[{"locationId": 8820360, "name": "Sonar Festival", "placeType": "ATTRACTION", "reviewListPage": {"reviews": [{"id": 691348317, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d8820360-r691348317-Sonar_Festival-Barcelona_Catalonia.html", "text": "Three different stages with a lot of techno music, it is extremely hot inside, I felt like I was suffocating, there is no AC. Last but not least, vodka, gin, and whiskey are 9,5 euros per glass !!!! Personally I didn’t find fun at all.", "publishedDate": "2019-07-21", "language": "en", "rating": 2}, {"id": 595273087, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d8820360-r595273087-Sonar_Festival-Barcelona_Catalonia.html", "text": "In the beginning I was not sure 100% if it will be so good, but thanks to my wife we went on sonar day friday and saturday night and it was amazing. \nDefinitely we will come next year if it will be possible.  ", "publishedDate": "2018-07-11", "language": "en", "rating": 5}, {"id": 588573014, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d8820360-r588573014-Sonar_Festival-Barcelona_Catalonia.html", "text": "I do many many festivals. This year was my first attempt at sonar and I was very disappointed.\n\nThe sound quality : it goes from barely ok if you choose a good place on some stage to unbearable for some sets. The main stage is in a huge industrial metallic building, resonance is everywhere, sound is blurry. They don't install any passive acoustic devices like bass traps. Their only answer to bad sound is adding more speakers stronger speakers, that makes more noise and everybody deaf. A festival like this with this level of lineup really deserve some descent sound design. I always stay in front of the soundboard (best place for sound quality in a concert) and even there, half the sets where disappointing.\n\nAnother bad point for decoration and activities : for this price I expect something more than direction signs, fake grass, and bits of red carpet. The only thing to do despite dancing is bumpers cars (for a whopping 5€ for 1min16s, yes, they make more than 70000€ over two days on this stand alone). Some flashy decorations, chill place, street artists, maker market, makeup artist, dancers.... anything creative would be welcome. \n\nOrganisation is quite OK. waiting time are OK except for food and for the bus between day an night venues. Loading the buses one by one with only the driver being the cashier. For tens thousand persons? Come on, that's ridiculous! maybe a cashless system would solve that.\n\nSecurity : they were bands of well organised pickpockets inside the site, working in teams of 3 and calling their big tall friend to the rescue when they got caught. And after that they don't allow you to get water bottle caps? What a joke!\n\nLet's compare : For the same price at ozora you got ten days camping included, drinks for half the price, wonderful decorations all over the site so you feel in wonderland, fireshows, dancers, activities all day, incomparable sound quality. So ok artists are not at the same price but there's something to find in between.\n\nThe sonar is just a big eartless cash machine. Take a huge place, bring some big names, powerful sound, then stack tourists in it, make them deaf and get the cash...\n\nStill you can enjoy it with friends, if are not on a budget, not picky on sound quality and more clubber than a festival person. \n", "publishedDate": "2018-06-18", "language": "en", "rating": 2}, {"id": 495323542, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d8820360-r495323542-Sonar_Festival-Barcelona_Catalonia.html", "text": "A large group of us all went to Sonar Festival. A few of my friends had been before but it was my first time. I had heard from everyone that it was amazing but I didn't expect it to be as good as it was. I was overwhelmed with how good it was and can't wait to go back again!! \n\nThe location of Sonar by Day and Sonar by Night were brilliant, the line up was fantastic and it just seemed very well organised. Reasonably priced drinks for a festival and the atmosphere was out of this world.", "publishedDate": "2017-06-23", "language": "en", "rating": 5}, {"id": 450086220, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d8820360-r450086220-Sonar_Festival-Barcelona_Catalonia.html", "text": "Been to the Sonar festival now 5 years running and it is by far the best music festival I've ever been to. There is always a good mix of electronic music and the atmosphere, especially in the main courtyard of sonar day, is always amazing.", "publishedDate": "2017-01-07", "language": "en", "rating": 5}, {"id": 425633799, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d8820360-r425633799-Sonar_Festival-Barcelona_Catalonia.html", "text": "For anyone who has a true appreciation for electronic music, sound engineering and technology in general; sonar is the place for you. This is not your everyday Top 40 festival; this will push you to challenge your own musical limits and taste.\n\nFor those who are looking to do just Sonar by Day, keep in mind the acts you will see will be much more subdued and experimental; it's not a rave but there are certainly some fun acts to see.\n\nFor anyone looking to do just the night, here is where you will find more dance music/techno acts; be ready to dance until the sun comes up. \n\nFor the ultimate experience and to truly appreciate/understand sonar you should really do at least one full day and night (ideally the whole festival). If you are going to do this however, make sure that you get plenty to EAT lots of SLEEP and WATER.", "publishedDate": "2016-10-06", "language": "en", "rating": 5}, {"id": 387117778, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d8820360-r387117778-Sonar_Festival-Barcelona_Catalonia.html", "text": "The Flume performance was literally life changing! The venues were set up very nicely and were perfectly spread out. I felt the food as alright but it did the job! Want to fly here every year just so that I can go again. The best weekend since I have been here for sure! Have been watching my videos reliving the experiences!", "publishedDate": "2016-06-28", "language": "en", "rating": 5}]}}]