[{"locationId": 4556731, "name": "MUHBA Domus de Sant Honorat", "placeType": "ATTRACTION", "reviewListPage": {"reviews": [{"id": 361309295, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d4556731-r361309295-MUHBA_Domus_de_Sant_Honorat-Barcelona_Catalonia.html", "text": "Don't understand why this isn't advertised more... This for me is one of Barcelona's top attractions - The foundations of a Roman 4th-century private house decorated with poly-chrome mosaics and wall paintings together hidden under the streets of the modern city. This is one of the MUHBA (Barcelona City History Museum) sites dotted around the city. You can walk through the archaeological via a raised walkway. The rooms are beautifully conserved including large terracotta tanks for grain storage. Interpretation panels and audio guide complete the experience. Well worth a visit; highly recommended!", "publishedDate": "2016-04-03", "language": "en", "rating": 5}, {"id": 251327686, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d4556731-r251327686-MUHBA_Domus_de_Sant_Honorat-Barcelona_Catalonia.html", "text": "We came here as part of our trip round the Roman sites in central Barcelona. We'd bought a combined ticket, but found that some places were too far to see easily or were free anyway or were closed for renovations. So do check how many places you actually want to see and work out if the combined ticket offers good value for money.\n\nThis small museum seems to be rarely visited. It's a shame because it is actually rather interesting, having been inhabited for hundreds of years and built on top of some wonderfully interesting Roman remains. You can see the foundations of original Roman buildings, old storage jars and various other foundations. There are also two leaflets available in English if you ask the attendant for them. All other information is in Spanish or Catalan. There is also a toilet - handy in the centre of Barcelona!\n\nIt's worth going to see, although finding it takes a bit of navigation through some old streets. It's near the old synagogue, so if you find that, you're very close. The streets are wonderfully atmospheric, so are worth walking round in their own right.", "publishedDate": "2015-01-27", "language": "en", "rating": 4}]}}]