[{"locationId": 313685, "name": "Estadi Olímpic", "placeType": "ATTRACTION", "reviewListPage": {"reviews": [{"id": 752472275, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d313685-r752472275-Estadi_Olimpic-Barcelona_Catalonia.html", "text": "During my visit to Barcelona, I was able to visit the Olympic Complex which was the site of the 1992 Summer Olympics. This Olympic Stadium appeared to be the largest facility at the Olympic Complex. \n\nFortunately for the Olympic planners in Barcelona, they did not have to build a brand new stadium for the 1992 Summer Olympics. The Estadi Olimpic was actually built in 1927 for the 1929 International Exposition. Though it had fallen into disrepair by the 1970s, it was renovated once Barcelona was awarded the 1992 Summer Olympics. When I visited, it was very well maintained. I learned that it is currently used for European football matches.", "publishedDate": "2020-04-10", "language": "en", "rating": 4}, {"id": 742132067, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d313685-r742132067-Estadi_Olimpic-Barcelona_Catalonia.html", "text": "Was surprised to learn you could just enter the stadium for free, and really enjoyed the views you get when you stroll in", "publishedDate": "2020-01-30", "language": "en", "rating": 4}, {"id": 739462184, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d313685-r739462184-Estadi_Olimpic-Barcelona_Catalonia.html", "text": "This is one of the highlights of my trip to Barcelona. I'm a huge fan of the Olympic games and the 1992 games held here when I was 13 were special to me. Seeing the clock tower in person was great. I'd just like to say to whoever decided to allow the public in for free, thank you. You made my trip. You enter under the clock tower and there's a terraced area about 100M long which includes a shop. You have a great view of the stadium from here. If you're in the area or have a personal connection like me then pop in. I believe one of the tour buses stops there, too.", "publishedDate": "2020-01-16", "language": "en", "rating": 5}, {"id": 735213749, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d313685-r735213749-Estadi_Olimpic-Barcelona_Catalonia.html", "text": "Worth a stop on the bus on the way up to or down from the Castle. 15 minutes is more than enough. Buses are really regular so not really out of your way.", "publishedDate": "2019-12-28", "language": "en", "rating": 3}, {"id": 720227511, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d313685-r720227511-Estadi_Olimpic-Barcelona_Catalonia.html", "text": "Waisted an hour waling aroung trying to find the entrance.  The signage was non-existant and no one we asked really knew. And it was hot and it is hilly.  And when we finally found the entrance it was all locked up.  The stadium, the grounds and everything.  Only thing we could see was a \"lookout\" view of the stadium field.  Never saw any signs explaining why it was closed.  Lots of other people trying to get in.", "publishedDate": "2019-10-21", "language": "en", "rating": 1}, {"id": 719810206, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d313685-r719810206-Estadi_Olimpic-Barcelona_Catalonia.html", "text": "Walking into the Olympic stadium in Barcelona was both awe-inspiring and saddening.  Like so many Olympic stadiums that have come before it and have come after it, once the games had passed by so had the stadium's reason for being.  As a result, stadium was in a bit of disrepair as the years had begun to take a toll on the place.  But at the same time, you could feel significance of it and what it might have been like when the fire was still burning in the Olympic Cauldron.  \n\nWhen we visited the main gate was open and you could walk right up to field.  Inside there was a sad little gift shop that sold absolutely nothing related to the Olympics.  Just your standard Barcelona tchotchkes.  There was also a cafe that sold some basic food and drinks open for business.  But it felt very much like visiting a coal mining town in Western Pennsylvania.  There are still enough reminders of what it was in its prime that you can imagine what it used to be like but those days are never coming back.", "publishedDate": "2019-10-20", "language": "en", "rating": 3}, {"id": 718674009, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d313685-r718674009-Estadi_Olimpic-Barcelona_Catalonia.html", "text": "Wandered around the area outside the stadium (didn't go inside) and it's great to see the legacy left from a very memorable Olympic Games. Our kids loved roaming around and taking some photos of the grounds. Worth a visit.", "publishedDate": "2019-10-15", "language": "en", "rating": 5}, {"id": 715797293, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d313685-r715797293-Estadi_Olimpic-Barcelona_Catalonia.html", "text": "Barcelona really knew how to do the Olympics right. They used this opportunity to improve their city in every way and this stadium is just one example. It was a thrill so be inside this venue where history was made and best of all, its free. We made it a stop on a hop on, hop off bus.", "publishedDate": "2019-10-06", "language": "en", "rating": 5}, {"id": 714505247, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d313685-r714505247-Estadi_Olimpic-Barcelona_Catalonia.html", "text": "I enjoy the Olympics so this was a must do stop during my time in Barcelona. The area in front of the stadium is beautiful however the stadium inside is worn out.", "publishedDate": "2019-10-01", "language": "en", "rating": 3}, {"id": 714269280, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d313685-r714269280-Estadi_Olimpic-Barcelona_Catalonia.html", "text": "This is free to enter but that’s because there isn’t a lot to see. Some where to eat, a shop and toilets and that’s about it.", "publishedDate": "2019-09-30", "language": "en", "rating": 3}, {"id": 699577817, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d313685-r699577817-Estadi_Olimpic-Barcelona_Catalonia.html", "text": "Had a few hours to kill before our flight home, so decided to go and chill out in one of the beautiful gardens they Barcelona has to offer. Parked next to the Olympic Stadium and popped in for a view. \n\nFree to enter, with a couple of info boards a cafe and access down to the Olympic park and public toilets. Impressive venue but requires some upkeep as it’s starting to get a little run down.\n\nAll in all a 20-30 minute visit max.", "publishedDate": "2019-08-16", "language": "en", "rating": 3}, {"id": 690369829, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d313685-r690369829-Estadi_Olimpic-Barcelona_Catalonia.html", "text": "The Estadi Olimpic is the site of the 1992 Barcelona Olympics and occasionally still host sports events such as the national Spanish Cup. There's not a lot to see as you can only view from one of the stand. It's still a magnificent sight though and worth a visit for true athletics fans.", "publishedDate": "2019-07-17", "language": "en", "rating": 4}, {"id": 689310248, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d313685-r689310248-Estadi_Olimpic-Barcelona_Catalonia.html", "text": "After watched and remembered the 1992 Barcelona Olympics, it was well worth it to stop by the Stadium to take a look.  You can go in and take pictures and get a feel for what it must have been like.  Quite impressive!   There is a store you can visit to buy memorabilia too.  \nJust wish we'd had more time to go to the Museum!", "publishedDate": "2019-07-13", "language": "en", "rating": 4}, {"id": 687601142, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d313685-r687601142-Estadi_Olimpic-Barcelona_Catalonia.html", "text": "There’s a stop on the hop on hop off bus right outside and entry to the front of the stadium is free. You can stop for a photo and a snack/drinks in the cafe. \n\nThe toilets are free but as the stadium is not used are basic and very school like cubicles.\n\nFrom this location you can walk 10mins toward the Magic Fountain.", "publishedDate": "2019-07-07", "language": "en", "rating": 4}, {"id": 681819264, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d313685-r681819264-Estadi_Olimpic-Barcelona_Catalonia.html", "text": "It was nice to experience this stadium during an Ed Sheeran concert, coming here it was straight forward either with bus 150 from Placa Espanya or through the direct shuttle buses planned for the concert. However we found the stadium to be somewhat small and crowded for such an event! The worst part was returning back due to the severe congestion with several pedestrian cars all going through the same singular road!\n\nit was nice to experience this stadium tough!", "publishedDate": "2019-06-16", "language": "en", "rating": 4}, {"id": 680465443, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d313685-r680465443-Estadi_Olimpic-Barcelona_Catalonia.html", "text": "We went to see Ed Sheeran and it was amazing. We we quite close to the front and on the left so we had a good view but I couldn't say the same for all the way at the back! It was quite a mission to get to the venue. There was a long walk to the top, about 25 to 30 minutes. There are escalators but if you don't want to walk, or have access needs, definitely take a cab from Placa di Espanya for about 6 or 7 euros. There is no train station at the top. There are also no restaurants nearby the venue so eat before or take food to eat outside. (You can't take backpacks inside for a music gig). We arrived an hour or so early to see the first band and to get our seats. The left side of the venue is the last to have sun so we were getting a nice tan for a few hours, it gets quite hot! Take a hat and sun cream xD. Also girls, use the toilets before the show starts or when the support bands are on because there are limited toilets and huuuge queues. Would visit again!", "publishedDate": "2019-06-10", "language": "en", "rating": 5}, {"id": 680363437, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d313685-r680363437-Estadi_Olimpic-Barcelona_Catalonia.html", "text": "Second time we have been to a concert at this venue (Coldplay 4 years ago) Ed Sheeran this time.  Whilst the stadium may be interesting from a touristic point of view, it's just not up to staging huge concerts in this day and age.  Facilities are poor which could be fixed, but the worst part is access to and getting away from the venue.  At the top of the mountain there are limited ways to get in.  25 minute walk uphill from the nearest Metro.  You will be lucky to get a cab to take you all the way as police close off road access halfway up.  Don't even think about the cable car or Fenicula railway.  Getting to it is a pain - but at the end of the show when 60,000 people are exiting at the same time it can be positively dangerous with large crowds attempting to get down old stairways and concrete steps at the same time.  Chaos at the Metro station, when you finally get there.  Would never pass health and safety regs in the UK.  Why don't they use the Camp Nou for concerts of this size?", "publishedDate": "2019-06-10", "language": "en", "rating": 2}, {"id": 675988729, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d313685-r675988729-Estadi_Olimpic-Barcelona_Catalonia.html", "text": "Nice views, nice to walk around. Free!! Some nice bits of info displayed to read as we walked round- recommend! ", "publishedDate": "2019-05-23", "language": "en", "rating": 4}, {"id": 673042593, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d313685-r673042593-Estadi_Olimpic-Barcelona_Catalonia.html", "text": "Despite website saying it was open it wasn’t and no signage to say why. I’d advise contacting in advance to check if you want to visit.", "publishedDate": "2019-05-10", "language": "en", "rating": 1}, {"id": 667977270, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d313685-r667977270-Estadi_Olimpic-Barcelona_Catalonia.html", "text": "A nice place to visit when in montjuic park, what’s also great about it is that it is free to go inside and look around. For our kids they enjoyed looking round (most of it is restricted) so we only spent about 20 minutes in there but we literally were walking past it.", "publishedDate": "2019-04-20", "language": "en", "rating": 4}, {"id": 664180185, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d313685-r664180185-Estadi_Olimpic-Barcelona_Catalonia.html", "text": "If you are into the Olymipcs or athletics then why wouldn't you spend an hour here. You can walk up from Place de Espanya and use the escalators passing the Magic Fountain and the National Art Museum. The Olympic stadium is set behind and is free to go in. You can spend as long as you like when you are there  (only part of the stadium is accessible but enough so as you get the feel of the place and there is a cafe if you want a drink. From Place de Espanya, you can easily walk up and down and spend half an hour in the stadium in and be back down on an hour and half.", "publishedDate": "2019-04-06", "language": "en", "rating": 4}, {"id": 663917646, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d313685-r663917646-Estadi_Olimpic-Barcelona_Catalonia.html", "text": "This stadium is amazing. I love stadiums very much and this was a very fun experience going to a former Olympic stadium. If you visit Barcelona this is a must go.", "publishedDate": "2019-04-05", "language": "en", "rating": 5}, {"id": 662237511, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d313685-r662237511-Estadi_Olimpic-Barcelona_Catalonia.html", "text": "call it olympic village on the hill: Worthwhile to spend some time strolling around.  You can get into the stadium for free. Nice to see the plaza in front of it.  A couple of museums up there as well.  Taxi there is easy, coming back into the city may take a bit to find one.", "publishedDate": "2019-03-30", "language": "en", "rating": 4}, {"id": 656266519, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d313685-r656266519-Estadi_Olimpic-Barcelona_Catalonia.html", "text": "It's easy to enter the stadion and even run a lap on the parcours. There is not much else too see or do than that, but it's a nice stop on your way to the parc.", "publishedDate": "2019-03-04", "language": "en", "rating": 3}, {"id": 654834237, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d313685-r654834237-Estadi_Olimpic-Barcelona_Catalonia.html", "text": "I’ve been here before, having taken the funicular then walked. This time I drove and parked right outside the stadium. I could find any dedicated parking or tickets so I’m not sure if where I parked was correct or not. \n\nThe stadium is free to look around, although you’re only able to enter one section. There’s a place to buy ice cream and drinks just outside. \n\nBeing far less of a tourist trap than many areas of Barcelona you won’t be hassled to buy a blanket or other bits of tat. There’s also far less tourists to compete with so you’ll have a much more relaxing time up here than in the heart of Barcelona. ", "publishedDate": "2019-02-25", "language": "en", "rating": 4}, {"id": 640930322, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d313685-r640930322-Estadi_Olimpic-Barcelona_Catalonia.html", "text": "This place is free entry. You can go inside and take picture of the old stadium. A bit run-down and nothing much to do here. Just to take some pictures and move on to the museum next door.", "publishedDate": "2018-12-21", "language": "en", "rating": 3}, {"id": 637020758, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d313685-r637020758-Estadi_Olimpic-Barcelona_Catalonia.html", "text": "After taking the Montjuïc Funicular up to the hilltop, I made my way toward the piece de resistance, the Lluís Companys Olympic Stadium from the 1992 Olympic Games in Barcelona. HOLY MOLY! This was so high on my to do list when visiting Barcelona, you can't even imagine. Although it's a popular spot to visit, for me especially being as Olympic-obsessed as I am, it was pure gold (see what I did there?).\n\nThe Barcelona Olympics were one of the few in Olympics history that didn't financially debilitate the city hosting the games. Barcelona was smart. They invested money in the infrastructure they already had instead of simply building from the ground up. This resulted in a more modern Barcelona for its citizens and not just a fancy setting for an Olympic Games.\n\nAdmission is free, and I had read on TripAdvisor that you could pay a couple Euros and actually run the track, but don't believe this is the norm, as I didn't see anyone around who actually worked for the stadium. It was just open to walk around a certain limited area.\n\nThere was more to the Olympic Park than just the stadium, so I explored a bit of that as well. The Palau Sant Jordi is a sporting and concert arena which during the '92 Olympics hosted the men's and women's gymnastics competitions, the men's and women's handball finals, the men's volleyball quarter- and semi-finals and finals and the women's volleyball semi-finals and finals. Here we also find the Torre Calatrava, or Montjuïc Communications Tower, which was built to transmit television coverage of the Olympic Games.\n\nThis is definitely worth a stop for anyone who loves the Olympics!", "publishedDate": "2018-12-02", "language": "en", "rating": 5}, {"id": 636368836, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d313685-r636368836-Estadi_Olimpic-Barcelona_Catalonia.html", "text": "Our tour was in the vicinity since we were going up to the top of Montjuic for the views.  We just drove past the stadium.", "publishedDate": "2018-11-28", "language": "en", "rating": 3}, {"id": 636354896, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d313685-r636354896-Estadi_Olimpic-Barcelona_Catalonia.html", "text": "Good to visit if you can remember it at the time when it happened. Think Linford Christie, think 100m GOLD.\n\nNo entry fee. Has a little cafe where you can get a bite to eat and a drink, have a little rest.  The grounds outside and around it (to the right as you look at it) are good to see (look for the tall telecoms tower). There are lovely views over the city.", "publishedDate": "2018-11-28", "language": "en", "rating": 4}, {"id": 633794522, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d313685-r633794522-Estadi_Olimpic-Barcelona_Catalonia.html", "text": "It's like visiting an old monument that is not that old. \n\nSomewhat like visiting a ghost town and not very lively or pleasant. \n\nIt was part of the City tour therefore not sure whether there is an admission fee. Didn't see any tickets .\n\nThe only cafe there was closed when we went - mid morning", "publishedDate": "2018-11-16", "language": "en", "rating": 3}, {"id": 632885369, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d313685-r632885369-Estadi_Olimpic-Barcelona_Catalonia.html", "text": "It was a pleasant (and long) walk from the cable car/funicular station, but it was good to see the main Olympic stadium and imagine how it must have been in 1992 whilst the events were on as it brought back memories of the 2012 London Olympics which I managed to visit at the time.\nIt was free to enter the main viewing area when we arrived around 6pm on a Sunday afternoon.", "publishedDate": "2018-11-12", "language": "en", "rating": 4}, {"id": 626786680, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d313685-r626786680-Estadi_Olimpic-Barcelona_Catalonia.html", "text": "What a majestic historic landmark both for 1929 and 1992\n\nSeeing the olympics in 92 on the tv then walking around where the magic happened on a sunny October day was just brilliant.  Not for everyone, but for any sports and especially athletics fan/athlete it is awesome ", "publishedDate": "2018-10-20", "language": "en", "rating": 5}, {"id": 626543093, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d313685-r626543093-Estadi_Olimpic-Barcelona_Catalonia.html", "text": "Worth the visit if you’re in the Montjuic area. It felt so great seeing it upclose especially that it’s the 1992 Barcelona Olympics that i started being a fan of the olympics. We went on an odd hour (2ish) and there’s less people. So good ", "publishedDate": "2018-10-19", "language": "en", "rating": 4}, {"id": 622857072, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d313685-r622857072-Estadi_Olimpic-Barcelona_Catalonia.html", "text": "not realy expecting much from this when i got off the bus really, seemed to be very few people around, but it turned out to be surprisingly pleasant to have a couple of hours wandering around the stadium and the park.", "publishedDate": "2018-10-07", "language": "en", "rating": 5}, {"id": 622129386, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d313685-r622129386-Estadi_Olimpic-Barcelona_Catalonia.html", "text": "Free to visit, nice quick visit to the Olympic Stadium, if you walk further out there are also other things you can see and view.", "publishedDate": "2018-10-04", "language": "en", "rating": 4}, {"id": 622008549, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d313685-r622008549-Estadi_Olimpic-Barcelona_Catalonia.html", "text": "Huge fans of sports and history so this was on my Barcelona bucket list. For a stadium that’s 90 years old I was really happy with it. It was free to get in and look around and then 2EUR to walk on the track. ", "publishedDate": "2018-10-03", "language": "en", "rating": 5}, {"id": 615981452, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d313685-r615981452-Estadi_Olimpic-Barcelona_Catalonia.html", "text": "Definately worth the walk to this stadium. It’s free to get in and have a look. You can also pay €2 each to go down on the track and take pictures and videos, which is great fun.", "publishedDate": "2018-09-12", "language": "en", "rating": 5}, {"id": 613614320, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d313685-r613614320-Estadi_Olimpic-Barcelona_Catalonia.html", "text": "Great free sight.  Fairly well maintain.  Great to walk the grounds and reminisce if you remember the 1992 Olympics!  There is a small gift shop.", "publishedDate": "2018-09-03", "language": "en", "rating": 4}, {"id": 613050566, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d313685-r613050566-Estadi_Olimpic-Barcelona_Catalonia.html", "text": "Superbly well maintained ! The Towers of flames , the calatrava telecommunication tower.. The place itself - Montjuic.. just reminds of the 1992 Glory days !!  ", "publishedDate": "2018-09-02", "language": "en", "rating": 5}, {"id": 612390012, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d313685-r612390012-Estadi_Olimpic-Barcelona_Catalonia.html", "text": "While there wasn’t anything taking place at the stadium at that time, it was still interesting to see the grounds. ", "publishedDate": "2018-08-30", "language": "en", "rating": 4}, {"id": 602332453, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d313685-r602332453-Estadi_Olimpic-Barcelona_Catalonia.html", "text": "Very surprised that you can just walk in to view the stadium for free! Very well kept, you can go onto a balcony area and get a real feel for the atmosphere. Around the outside you can see the torch basin on the exterior wall. Definitely worth popping in if you remember 1992!", "publishedDate": "2018-08-03", "language": "en", "rating": 4}, {"id": 592978325, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d313685-r592978325-Estadi_Olimpic-Barcelona_Catalonia.html", "text": "Absolutely worth the short trip over from the castle, however, it was closed when we arrived. All of the tourists around us were also confused and some (such as us) decided to trek to the other side to see if there was a different main entrance. Unfortunately, that was closed as well. This was frustrating because there were no posted hours, and it was very hot outside.", "publishedDate": "2018-07-04", "language": "en", "rating": 2}, {"id": 592587846, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d313685-r592587846-Estadi_Olimpic-Barcelona_Catalonia.html", "text": "I came to Barcelona with very little of knowledge of this city. After I arrived, a running buddy of mine told me to check out this Stadium. It seems like a very cool idea, so I ran from hotel to here. I love the experience.\nThe Stadium itself is free to enter, but the track was locked so I couldn't run on it. But I got to check out the inside of the Stadium and the surrounding areas. If you are not into this kind of stuff, then you can skip since it's a bit out of the way. But I love the experience.", "publishedDate": "2018-07-02", "language": "en", "rating": 4}, {"id": 591698160, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d313685-r591698160-Estadi_Olimpic-Barcelona_Catalonia.html", "text": "As part of our city tour, the stadium was our first stop of visit for the day. We arrived the location at around 9am and our guide brought us and showed us the iconic landmark and explained to us how it was being transformed and used as an Olympic stadium.\n\nHowever, the gate to enter the stadium is only opened at 10am (we were too early and thus unable to get in) but just stood outside and \"peeped in\". It was nice and gigantic, spectacular too and one that you cannot find it in Singapore where we are from.\n\nWhat a shame that we could not enter as we needed to proceed to the next stop for visitation.\n\nWell, it's nice and surely worth visiting if you are a fan of sports or Olympic and happen to be in the city!", "publishedDate": "2018-06-29", "language": "en", "rating": 3}, {"id": 589965114, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d313685-r589965114-Estadi_Olimpic-Barcelona_Catalonia.html", "text": "This was highly recommended by my brother and we reached there just before closing time in late afternoon soon after visiting Spanish village which is a short walking distance from the theme village. Great place for football fanatic.", "publishedDate": "2018-06-23", "language": "en", "rating": 3}, {"id": 587648290, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d313685-r587648290-Estadi_Olimpic-Barcelona_Catalonia.html", "text": "Our daughter is a pretty big Real Madrid fan so we did this tour for her. We went in not expecting much at all, but were pleasantly surprised. You get a tour (self-guided) of the entire stadium to include the locker rooms and team sidelines. This was a huge hit for her and the rest of us enjoyed it as well.", "publishedDate": "2018-06-15", "language": "en", "rating": 4}, {"id": 585253230, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d313685-r585253230-Estadi_Olimpic-Barcelona_Catalonia.html", "text": "We got off the hop on hop off bus here not sure what to expect. The stadium is free to get in and for 2 Euros each we had exclusive access to the track area for around 15 mins. One of the staff was with us to take pics in the staring blocks, you can have a race and have more pics on the podium. Great fun, when else will you get to race on an Olympic track?\n\nThere's a decent cafe and free, clean toilets. ", "publishedDate": "2018-06-05", "language": "en", "rating": 5}, {"id": 584365435, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d313685-r584365435-Estadi_Olimpic-Barcelona_Catalonia.html", "text": "This is surprisingly worthwhile to visit. It’s decor and external features are impressive and a sign that the designers wanted to build lasting quality during the ‘90s. ", "publishedDate": "2018-06-01", "language": "en", "rating": 4}, {"id": 582880538, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d313685-r582880538-Estadi_Olimpic-Barcelona_Catalonia.html", "text": "During our time over at Montjuic my friend mentioned heading over to the Olympic stadium.  It was a short walk from the National Museum and offered views of Barcelona and beyond.  The olympic torch statue from the 1992 games stands proud within the grounds.\n\nThe site itself was vast but looked very run down and dilapidated with lots of graffiti, sad because I imagine in it's former glory it was quite spectacular.  \n\nPersonally, I wouldn't travel especially to Montjuic for this but if you are in the area it's worthwhile having a look around.", "publishedDate": "2018-05-26", "language": "en", "rating": 3}, {"id": 580914246, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d313685-r580914246-Estadi_Olimpic-Barcelona_Catalonia.html", "text": "The old Olympic Park and facilities are somewhere I really enjoyed visiting whilst in Barcelona. \n\nThe area is a little run down in parts now but to see the effort that went into the 1992 Olympics and the village and facilities was great to see. \n\nThe area was quite derelict and didn’t seem to attract many tourists but i really enjoyed my visit. It was great to see the communications tower, which depicts an athlete with the Olympic torch in the Gaudi mosaic design to the bottom. \n\nThe area is fairly well maintained and it would be great to see if Barcelona ever use this space to host future Olympics. \n\nDefinitely worth a visit. ", "publishedDate": "2018-05-17", "language": "en", "rating": 5}, {"id": 580090023, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d313685-r580090023-Estadi_Olimpic-Barcelona_Catalonia.html", "text": "This is my 2nd visit. I was too early. It opens at 10 am. I remember there was a time capsule in there.", "publishedDate": "2018-05-14", "language": "en", "rating": 3}, {"id": 576267427, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d313685-r576267427-Estadi_Olimpic-Barcelona_Catalonia.html", "text": "My group wanted to visit this iconic place just because the 1992 Olympic games played out here. The gates were open and there wasn't a charge. A cafe and gift shop were also available to the few of us visiting this day. The stadium itself is very tidy and well maintained by the looks. I found it hard to visualize the many competitors down there on the track, cos to me it just looked to small a venue. But he'll, what do I know. It is well worth the visit don't get me wrong. And this place is quite high up and you can see right across Barcelona, which is cool. I loved the paddle on the outer wall of the stadium, which at first I thought was a whale..duh, and the feet impressions of some great sports people are outside on the pavement to boot ( see what I did there ) ;)", "publishedDate": "2018-04-28", "language": "en", "rating": 3}, {"id": 576099323, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d313685-r576099323-Estadi_Olimpic-Barcelona_Catalonia.html", "text": "The main stadium in 1992 Olympic games,but now its really nothing special,take a few pictures only-atmosphere is looong time away...", "publishedDate": "2018-04-27", "language": "en", "rating": 3}, {"id": 573243084, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d313685-r573243084-Estadi_Olimpic-Barcelona_Catalonia.html", "text": "Whenever I visit a major city, I always look out for the Olympic stadium. So much history and it's always the location where someone achieved something great. \n\nTo think of all the great athletes that performed here or even just walked around in ther opening ceremony... Linford Christie winning gold, the USA basketball 'dreamteam' etc. \n\nWas free to get in, the gate seemed to be just left open. Was very tempted to jump the gate and run a lap of the track. Now that I'm home, I actually regret not doing it! There didn't seem to be any security around who'd have stopped me!\n", "publishedDate": "2018-04-14", "language": "en", "rating": 4}, {"id": 573073157, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d313685-r573073157-Estadi_Olimpic-Barcelona_Catalonia.html", "text": "Very Bad. We went to this stadium to see the beautiful sights of the pitch. Instead we were greeted with a decline of access. We were told we had to walk a mile round the building to get in. We also saw people leaving were we were not allowed in. We would not come again.", "publishedDate": "2018-04-13", "language": "en", "rating": 1}, {"id": 572809057, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d313685-r572809057-Estadi_Olimpic-Barcelona_Catalonia.html", "text": "The stadium used during the 92 Barcelona Olympics which is free to enter if it is not being used for an event (it looked as though it is not used often)\n\nThe 92 Olympics is the first that I remember watching and really getting in to and so I always intended to take a look. However if you are not especially bothered about the Olympics then it may not be worth the trip.\n\nThe approach is quite attractive with various water features etc. The stadium itself is not very well kept and was disappointed to see that the track is currently blue, rather than the expected and traditional brownie colour. The torch is still there - smaller than I remembered actually. It's free to enter but you can only take a few pictures from one of the balcony areas. 5 minutes was sufficient.\n\nIt was quite an overcast and miserable day and perhaps the whole thing would have seemed more impressive in the sunshine. There is an Olympic museum nearby, which again might have added to the overall feel but that was closed when we were there.\n\nIf you happen to be on Montjuic hill seeing other things and/or you are particularly keen on the Olympics then you should take a look.", "publishedDate": "2018-04-12", "language": "en", "rating": 3}, {"id": 571813329, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d313685-r571813329-Estadi_Olimpic-Barcelona_Catalonia.html", "text": "Lost much of its old glory, but the stadium and surrounding neighbourhood still breaths the olympic atmosphere and you can still feel the magic. Located on Mont Juic, with lots of other landmarks nearby, so definitly worth a visit.", "publishedDate": "2018-04-07", "language": "en", "rating": 5}, {"id": 571117726, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d313685-r571117726-Estadi_Olimpic-Barcelona_Catalonia.html", "text": "This was such a lovely place to visit - both the surrounding grounds and the stadium itself. It seems to be completely underused which is a shame. We thoroughly enjoyed wandering round and exploring. And the best thing is - it is free!", "publishedDate": "2018-04-04", "language": "en", "rating": 4}, {"id": 570956448, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d313685-r570956448-Estadi_Olimpic-Barcelona_Catalonia.html", "text": "This is the main stadium that was used for the '92 Olympics. You'll find it in the MontJuic park, although really only worth a quick look as it is mostly locked up and looks unused now. You do get good views over Barcelona from up here though, and there are plenty of other attractions to visit on this hill.", "publishedDate": "2018-04-04", "language": "en", "rating": 3}, {"id": 570818283, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d313685-r570818283-Estadi_Olimpic-Barcelona_Catalonia.html", "text": "Decided to spend the morning exploring Montjuïc via the Magic Fountain & ended up at the Olympic site (Barcelona 1992).  Beautiful but totally wasted, underused and locked up.  The graffiti visible at the bottom of the stunning white tower was quite upsetting!", "publishedDate": "2018-04-03", "language": "en", "rating": 4}, {"id": 570302838, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d313685-r570302838-Estadi_Olimpic-Barcelona_Catalonia.html", "text": "It’s free to enter part of the stadium concourse but no entry to the seating area and field.  There is a gift shop and a cafe on site.  Next to the stadium is a huge plaza with a view of Barcelona.\n\nThe stadium is close to the Joan Antonio Samaranch Olympic & Sports Museum.", "publishedDate": "2018-04-01", "language": "en", "rating": 4}, {"id": 569123738, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d313685-r569123738-Estadi_Olimpic-Barcelona_Catalonia.html", "text": "We found it quite difficult to find our way in to the Olympic area.  We arrived at the Magic Fountain and then looked round to find where we go, there were escalators next to the stairs but no way for wheelchairs to get around the Art Museum.  So we went around the road way which was fairly long!  At one stage we came across a lift which took you down to the cafeteria, unfortunately this was closed!  However, we did find the stadium and got to take some photos, it surprised us by how small it seemed to be.  The whole area was incredible there were water features running through the whole site.  The swimming pool was being used which was really good to see.", "publishedDate": "2018-03-27", "language": "en", "rating": 4}, {"id": 564844726, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d313685-r564844726-Estadi_Olimpic-Barcelona_Catalonia.html", "text": "A nice place to see... view was very good.. had a good walk and spent some quality time. Not sure if matches happen in thus place... but great to see well maintained location.", "publishedDate": "2018-03-06", "language": "en", "rating": 4}, {"id": 563116875, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d313685-r563116875-Estadi_Olimpic-Barcelona_Catalonia.html", "text": "Just like everything else I did in Barcelona this was a special experience. The stadium is beautiful. It was nice to see people still use it too!", "publishedDate": "2018-02-27", "language": "en", "rating": 5}, {"id": 562050415, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d313685-r562050415-Estadi_Olimpic-Barcelona_Catalonia.html", "text": "When you go in this place, you feel you're part of the Olympic crowd though there is no crowd as it is huge but the view of Barcelona from here is not to be missed. You must go around the park. This place is huge, a whole park is around it and gardens as well. It is very well maintained.", "publishedDate": "2018-02-21", "language": "en", "rating": 5}, {"id": 561299687, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d313685-r561299687-Estadi_Olimpic-Barcelona_Catalonia.html", "text": "If you discovers the montjuic quarter, you should look this staduim ( possible to look the inside for Free ). This is a beautiful olympic staduim with a historical link. Please add on your todo list !", "publishedDate": "2018-02-18", "language": "en", "rating": 5}, {"id": 555310309, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d313685-r555310309-Estadi_Olimpic-Barcelona_Catalonia.html", "text": "first time to Barcelona and had the experience of seeing Barca playing and Messi at  his best.  It was our first live Soccer match and was memorable", "publishedDate": "2018-01-21", "language": "en", "rating": 5}, {"id": 553826872, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d313685-r553826872-Estadi_Olimpic-Barcelona_Catalonia.html", "text": "A little out of the way, but great for an Olympic buff like me.  I loved walking around the area.  You can go for a quick visit--I probably spent less than half an hour in total but then walked through the gardens to make my way down the hill back to downtown, so it was a nice little side trip.", "publishedDate": "2018-01-14", "language": "en", "rating": 4}, {"id": 543306465, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d313685-r543306465-Estadi_Olimpic-Barcelona_Catalonia.html", "text": "It's good to visit in a sunny day! And you do not have to pay to get in. It's a little bit nostalgic in order to remember Olympics of 1992", "publishedDate": "2017-11-26", "language": "en", "rating": 3}, {"id": 539781909, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d313685-r539781909-Estadi_Olimpic-Barcelona_Catalonia.html", "text": "A part from a few concerts this stadium is horribly underused since Espanyol left years ago. Barcelona benefitted greatly from the Olympics but never really found a use for this stadium. It’s a great walk area though up from here from Placa Esapana up to Montjuic ", "publishedDate": "2017-11-09", "language": "en", "rating": 3}, {"id": 535478205, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d313685-r535478205-Estadi_Olimpic-Barcelona_Catalonia.html", "text": "Working in Barcelona for 3 months and saw that the Stones were coming to town! Got right on line, got scalped, who cares, and joined the crowds. Lots of walking from parking the car a million miles away. My wimpy cell camera couldn't capture the on-stage antics of this iconic band, but nevertheless, it was tremendous fun.  Actually had one of the best hot dogs and coke I've ever had! Maybe it was all that open air, great music, and the large hearts of those who live in Barcelona--what a treat. Makes me want to be a permanent ex pat.  Now I have a Stones t shirt to remind me.", "publishedDate": "2017-10-23", "language": "en", "rating": 5}, {"id": 534863633, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d313685-r534863633-Estadi_Olimpic-Barcelona_Catalonia.html", "text": "Up high on the hill in the Montjuic area. Worth walking up to visit. If not on a tour you can see the arena through the wired gates.", "publishedDate": "2017-10-21", "language": "en", "rating": 4}, {"id": 533240550, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d313685-r533240550-Estadi_Olimpic-Barcelona_Catalonia.html", "text": "The Rolling Stones concert was great. It sounded well. The VIP entry was super fast to enter and OK to leave. But the maps and signs were terrible. It was neither easy nor intuitive to find the spots marked on the map. The transportation was a nightmare. No clear guidance where to go. Buses not announced. Hours to get back home. ", "publishedDate": "2017-10-15", "language": "en", "rating": 3}, {"id": 531205503, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d313685-r531205503-Estadi_Olimpic-Barcelona_Catalonia.html", "text": "We missed the entry to the Palau Nacional and found ourselves at the stadium.  so we went in and looked around.  Not like the feeling you get when you see the field at Fenway but it's free!  And, just like Fenway, don't look for a bathroom.", "publishedDate": "2017-10-08", "language": "en", "rating": 3}, {"id": 529631574, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d313685-r529631574-Estadi_Olimpic-Barcelona_Catalonia.html", "text": "On our Montjuic trek and this is an impressive building!\nWe couldn't get in but you can peek from the street.\nThe outside is what you'd expect...very impressed!", "publishedDate": "2017-10-03", "language": "en", "rating": 4}, {"id": 529213816, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d313685-r529213816-Estadi_Olimpic-Barcelona_Catalonia.html", "text": "It was impressive stadium, we were a family of 7, we love sports, surrounding area is beautiful too, we had a nice tour, kids were enjoying a lot", "publishedDate": "2017-10-02", "language": "en", "rating": 3}, {"id": 528647655, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d313685-r528647655-Estadi_Olimpic-Barcelona_Catalonia.html", "text": "Attended a spectacular Rolling Stones Concert which was spoiled by the fact that the seat numbering was worn out and unreadable, so that hundreds of people were confused and having to be moved mid concert. At £200+ per seat, the least the organisers could have done was to make sure the seats were clearly numbered.", "publishedDate": "2017-10-01", "language": "en", "rating": 2}, {"id": 527335567, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d313685-r527335567-Estadi_Olimpic-Barcelona_Catalonia.html", "text": "This place is unreal, free entry, fantastic to see, extremely well maintained, excellent to see the stadium, the grounds on which it stands. The stunning water features. Soak up the atmosphere. Well worth a visit. Such a shame it is no longer used.", "publishedDate": "2017-09-25", "language": "en", "rating": 5}, {"id": 522884637, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d313685-r522884637-Estadi_Olimpic-Barcelona_Catalonia.html", "text": "Entry to the stadium itself is free, so ideal for those wanting to find a few free events to do; however once inside there isn't a lot to it besides the view. Inside the stadium there are a couple of shops that sell tourist souvenirs and there are some public toilets (a rare find in some areas). Outside, there is a nice cafe where you can get ice creams, beer and fruit cups - all reasonably priced. \n\nThe rest of the complex seems to host events and concerts throughout the year so may be worth checking the official website before planning a visit.", "publishedDate": "2017-09-09", "language": "en", "rating": 3}, {"id": 521157780, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d313685-r521157780-Estadi_Olimpic-Barcelona_Catalonia.html", "text": "We were a family of 4 with 2 boys ages 10 and 12 that love sports.\nThe stadium is impressive. The fun starts outside of the stadium on the way to it and next to the Olympic museum with the footprints of famous athletics on the sidewalk. When you enter the Olympic area its not only the stadium there is also an exhibition outside and a very nice garden with another sports arena. There are some very impressive and interesting structures. My kids did not want to leave this area.", "publishedDate": "2017-09-04", "language": "en", "rating": 4}, {"id": 520863918, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d313685-r520863918-Estadi_Olimpic-Barcelona_Catalonia.html", "text": "We promised the kids a trip there to complete with each other and other kids as part of the open camp but unfortunately it closed suddenly just a week earlier and was now only bookable for large groups - very disappointed children - wish we had taken swim stuff so we could at least swim in the outdoor pool. Nice place to walk around despite the disappointment and great views overlooking the City and nice walk back down to Magic Fountains", "publishedDate": "2017-09-03", "language": "en", "rating": 3}, {"id": 520370720, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d313685-r520370720-Estadi_Olimpic-Barcelona_Catalonia.html", "text": "It was great to be there and remembering the Olympic games of 1992. It is nice for whom are sports fan.", "publishedDate": "2017-09-01", "language": "en", "rating": 5}, {"id": 517761705, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d313685-r517761705-Estadi_Olimpic-Barcelona_Catalonia.html", "text": "It is worth sticking your head in the stadium door to have a look at this Olympic venue. There are a few little coffee shops and a gift shopping as well as public toilets available for use. A good place to sit in the shade and rehydrate on a warm day.", "publishedDate": "2017-08-26", "language": "en", "rating": 3}, {"id": 515417619, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d313685-r515417619-Estadi_Olimpic-Barcelona_Catalonia.html", "text": "The old Olmpic Stadium, kept open to view, and part of the Olympic Village site near the Parc de Montjuic. If you're on the tourist bus route and go to the museum, or are passing to other sites, it's worth a quick stop. Entry is free, and you can view the stadium from one of the stands. The stadium is a little tired now, but gives a good feel of an Olympic venue, perhaps of particular interest for athletics fans. Not essential viewing, but for free, worth 20 mins if you are in the area.", "publishedDate": "2017-08-20", "language": "en", "rating": 3}, {"id": 515210241, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d313685-r515210241-Estadi_Olimpic-Barcelona_Catalonia.html", "text": "Had a quick look at the Olympic stadium and park! Brings back memories from 1992! Looked out onto the track area and the diving area! ", "publishedDate": "2017-08-19", "language": "en", "rating": 4}, {"id": 515176676, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d313685-r515176676-Estadi_Olimpic-Barcelona_Catalonia.html", "text": "It was interesting to visit having never seen an Olympic stadium before but at the end of the day, it's just a stadium. It would have been better to have had some information about the olympic games that were held here. Entrance into the main stadium is free.", "publishedDate": "2017-08-19", "language": "en", "rating": 3}, {"id": 513657146, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d313685-r513657146-Estadi_Olimpic-Barcelona_Catalonia.html", "text": "As we were by the magic fountains we came here, nearby.\nLots things to see you can go inside main stadium too!\nEasy to find - the white landmark can be seen for miles! Well worth it!", "publishedDate": "2017-08-16", "language": "en", "rating": 4}, {"id": 513486332, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d313685-r513486332-Estadi_Olimpic-Barcelona_Catalonia.html", "text": "Visited Barcelona Olympic stadium with our tour group. Place is nice well maintained girls in a fealing of thrill. We could visit balcony to see main stadium where some schools level event was going on. Cheered young students who were running with all their might. Also visited souvenir shop that is quite small though. Other stadium n arena also near by area. ", "publishedDate": "2017-08-15", "language": "en", "rating": 4}, {"id": 509376928, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d313685-r509376928-Estadi_Olimpic-Barcelona_Catalonia.html", "text": "My family and I walked over here after visiting Montjuic Castle. The museum was closed, which was fine, but the stadium was open. You can't go down onto the track, but getting to walk into a viewing area was cool. Not much \"to do\" but we enjoyed walking around the park area behind the stadium and enjoying the beautiful views with the waterfall and reflecting pools. Would have liked to picnic there.", "publishedDate": "2017-08-06", "language": "en", "rating": 4}, {"id": 508858129, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d313685-r508858129-Estadi_Olimpic-Barcelona_Catalonia.html", "text": "It was fun to see where the 1992 Olympics were held. A self guided stroll that was more interesting for parents than kids.", "publishedDate": "2017-08-04", "language": "en", "rating": 3}, {"id": 508376407, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d313685-r508376407-Estadi_Olimpic-Barcelona_Catalonia.html", "text": "It's fun to see because of the history, but as a stadium it's not that impressive to be honest. I've seen better, more unique, stadiums in my life. ", "publishedDate": "2017-08-03", "language": "en", "rating": 3}, {"id": 506117219, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d313685-r506117219-Estadi_Olimpic-Barcelona_Catalonia.html", "text": "My family loved this. We go off the tour bus here and walked in and we immediately felt a sense of awe. This grand stadium was bursting with colour, sound and history. The kids didn't want to leave. We walked around where we could ( a lot is blocked off). It was a great family free place to see.", "publishedDate": "2017-07-27", "language": "en", "rating": 5}, {"id": 505287455, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d313685-r505287455-Estadi_Olimpic-Barcelona_Catalonia.html", "text": "We jumped off at stop 10 to have a look around. It's fantastic to see such a marvellous stadium with it's gates open welcoming you in. Unfortunately, not much of the stadium is open for you to look around but you can really get a sense of the scale. \n\nThere was a cafe open selling drinks and snacks. Only a 15/20 minute visit, but it's an Olympic stadium to tick off the list. \n\nEntrance is free. ", "publishedDate": "2017-07-24", "language": "en", "rating": 4}, {"id": 502215482, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d313685-r502215482-Estadi_Olimpic-Barcelona_Catalonia.html", "text": "The stadium is fantastic to see and is free of charge, although there is only a limited area that tourists are granted access to. The Olympic campus is lovely to stroll through, the telefonica tower and grand stadium providing some nice views and pictures. I took the 150 bus to the closest stop and went to the museum first. The museum costs €3.60 (to the best of my recollection), which is a very reasonable price. In the museum you learn about each Olympic games (Paralympic, Special, Summer and Winter), the history, origins and sport's of each. You can research your country's Olympic history and watch footage from as far back as the early 1900's. The museum is certainly worth a visit if you are interested in the Olympics and sports.", "publishedDate": "2017-07-15", "language": "en", "rating": 4}, {"id": 499987658, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d313685-r499987658-Estadi_Olimpic-Barcelona_Catalonia.html", "text": "You don't get to see an Olympic Stadium very often. You should see it and can see it up close for free. ", "publishedDate": "2017-07-09", "language": "en", "rating": 4}, {"id": 499929685, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d313685-r499929685-Estadi_Olimpic-Barcelona_Catalonia.html", "text": "My boyfriend and I walked about 50 minutes from where we were staying to go here and it did not disappoint. The stadium was lovely and makes you feel very nostalgic! There was music being played and things going on so it was a good atmosphere. We loved strolling round the whole olympic park with the great views at the far end. We spent almost 3 hours here! It was a great memory and I'm so glad we decided to visit. ", "publishedDate": "2017-07-09", "language": "en", "rating": 5}, {"id": 499915463, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d313685-r499915463-Estadi_Olimpic-Barcelona_Catalonia.html", "text": "We hopped off our bus tour to drop into this stadium. It's free and you can't help but sense the atmosphere of the place plus it has toilets !", "publishedDate": "2017-07-09", "language": "en", "rating": 4}, {"id": 497244199, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d313685-r497244199-Estadi_Olimpic-Barcelona_Catalonia.html", "text": "Hop on a bus/metro to Pl Espanya then onto another (150) ,6 stops later you are outside the Stadium. Or if you feel like a Olympian you can walk from Pl Espanya (There`s signs a plenty) to the stadium  which should take about 15-20 mins .\nI got there for 10am (That`s when it opens) and went inside .You can see the Olympic torch tower standing proudly as you enter the walkway into the stadium . I was told i could only go as far as this entrance i was standing in  and a little way down to the running track .I didn`t mind as i could sit down and viewed the running track from my seat .The stadium looked small to me but it still looked good . There was something on for the school kids when i was there (Open Camp) . I did pay 6 euros to have a go on a MotoGP bike simulator which was in the entrance ,That was brill .It`s all for free and you can buy hot/cold drinks ,sandwiches/cakes from a trailer just inside the stadium .Look also for the other venues which were used close by .", "publishedDate": "2017-06-29", "language": "en", "rating": 4}, {"id": 495623826, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d313685-r495623826-Estadi_Olimpic-Barcelona_Catalonia.html", "text": "This stadium along with the rest of the Olympic Village gives visitors great memories of the 1992 Summer Olympics. If you like the Olympic Games, I recommend visiting. ", "publishedDate": "2017-06-24", "language": "en", "rating": 5}, {"id": 493345057, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d313685-r493345057-Estadi_Olimpic-Barcelona_Catalonia.html", "text": "We visited Parc Montjuic on a Sunday but it was still remarkably quiet. The Olympic Museum was closed but the stadium was accessible and the Open Camp was in full swing, we watched kids trying the 100m running & wheelchair race, plus some other sports.  This a great scheme to allow people to use the stadium....such a shame that the London 2012 stadium is now a football ground.\nThere is a cafe/bar and it was so relaxing to sit in the shade for a while!", "publishedDate": "2017-06-15", "language": "en", "rating": 5}]}}]