[{"locationId": 17593156, "name": "The Port Cable Car", "placeType": "ATTRACTION", "reviewListPage": {"reviews": [{"id": 749932210, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d17593156-r749932210-The_Port_Cable_Car-Barcelona_Catalonia.html", "text": "If you want to reach Mount Juic for heavens sake do not pay a dime of this over priced, insane waiting time nonsense.. the \"view\" is nothing compared to what you'll see on top of the mountain and you'll just lose your precious time standing first queuing for the tickets, then lift to take you up and lastly to get to the cable car. There's only two cp ticket booth.. apparently it's the other cable car on the other side of the mountain.. we didn't use our way back tickets.. instead took a buss  nro 150 down hill and went to see the stunning National Art Museum.. before the museum there's the Botanical Garden's which are totally worth a visit! ", "publishedDate": "2020-03-08", "language": "en", "rating": 1}, {"id": 742026551, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d17593156-r742026551-The_Port_Cable_Car-Barcelona_Catalonia.html", "text": "This cable car has both a practical and a pleasure purpose. It gives you a spectacular view of the city and the beach from above and it moves you from the beach & harbor area til Montjuic. Try to be there early - it will save you from the worst rush in.", "publishedDate": "2020-01-29", "language": "en", "rating": 5}, {"id": 740489071, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d17593156-r740489071-The_Port_Cable_Car-Barcelona_Catalonia.html", "text": "Amazing views, a lovely 10 minute ride across the port and up the mountain.   some great photo opportunities    just have to get the right position in the cable car", "publishedDate": "2020-01-21", "language": "en", "rating": 5}, {"id": 740463801, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d17593156-r740463801-The_Port_Cable_Car-Barcelona_Catalonia.html", "text": "Horrific queuing nearly three hours by the time we actually got on, the cable car ride was ok, but it wasn’t really worth it", "publishedDate": "2020-01-21", "language": "en", "rating": 3}, {"id": 738800276, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d17593156-r738800276-The_Port_Cable_Car-Barcelona_Catalonia.html", "text": "Beautiful view,  it passes over Columbus square , marina and parts of the city and then there is a beautiful walk some posh restaurants and then there is metro service and a smaller cable car which takes you to top of the mountain with a beautiful view and an old fort. Its beautiful and worth going ", "publishedDate": "2020-01-12", "language": "en", "rating": 5}, {"id": 738661929, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d17593156-r738661929-The_Port_Cable_Car-Barcelona_Catalonia.html", "text": "Went across the port on the cable car towards Montjuic which was 11 euros each. We then walked up the hill to the next cable car which took us to the castle (13:50 euros each) but thankfully the castle was only 5 euros each.\nWhen you come back down , take the fenicular railway next door down the hill to the metro station, it saves alot of walking", "publishedDate": "2020-01-12", "language": "en", "rating": 5}, {"id": 735098574, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d17593156-r735098574-The_Port_Cable_Car-Barcelona_Catalonia.html", "text": "One of the best things you can do to WASTE your time is to take this cable car ride. Interesting idea but in reality we waited almost 2 hours in line (in December) and then you get in way overcrowded cabin. We absolutely regret this and definitely would not recommend to anyone. ", "publishedDate": "2019-12-28", "language": "en", "rating": 1}, {"id": 734914444, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d17593156-r734914444-The_Port_Cable_Car-Barcelona_Catalonia.html", "text": "Good views of the city and harbour are the reason to use this as is the convenience of getting quickly from Montjuic to Barcelonetta. Cost is a little high but you do it for the experience. No queues on our visit.", "publishedDate": "2019-12-27", "language": "en", "rating": 3}, {"id": 726832915, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d17593156-r726832915-The_Port_Cable_Car-Barcelona_Catalonia.html", "text": "I should have listened to all the other reviewers on this Port Cable Car...not worth it. Honestly, the only reason why I decided to take it was because it was a means of quick transportation from Barceloneta to Montjuic. The old tower is easily seen from walking down the Barceloneta plaza strip, finding it was no problem. This company also goes by Telefericos de Barcelona S.A. and has goes from Barceloneta to the top of Montijuic, with a stop in the middle, however closed. \n\nWe arrived at ticket booth about 4:15pm, and the last car runs at 5:00pm. Obviously, we wouldn't have had enough time to see all of Montijuic and make it back before the last cable car departs, so I was expecting to only be purchasing a One Way Ticket. Being an obvious tourist, the very rude middle aged lady at the ticket booth decided to charge me for a Round Trip Ticket for both me and my husband! 16.50 euros each, which was supposed to be 11 euros! I found out that the European persons in line before AND after us all got One Way Tickets...this lady singled us out and took advantage of us! NOT COOL. \n\nOn top of that, the ride wasn't event worth it. Luckily, our wait wasn't that long, only a car ride wait as it was already about time for closing. However, they jam packed us in that car like sardines- there had to be 20 of us in that tiny little box. I was lucky enough to get a window view, but those in the middle, good luck. The actual ride was longer than I expected, and I did get some good views out of it. But this didn't hide the fact that every single worker, from the ticket booth lady to the man riding up the elevator with you, and the men packing you into the car booth--NONE of them have any kind of customer service at all, not even a grin. \n\nDO NOT confuse this with Telerific de Montjuic, which is run by another company and only runs up and down the Montjuic area. By the time we got to the top, we didn't realize that all the attractions (Castle de Montjuic, Magic Fountain, Palau de Montjuic) were all A LONG WALK away--unless you took this other cable car which would be another fee of 14 euros I believe. By then, we were over it. Found our way walking to the attractions up there. I DO NOT recommend at all.", "publishedDate": "2019-11-16", "language": "en", "rating": 1}, {"id": 726187670, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d17593156-r726187670-The_Port_Cable_Car-Barcelona_Catalonia.html", "text": "Beautiful views but not worth 16.50 euros at all. \nStaff incredibly miserable and rude. One in particular but I do not wish to say the. Name of the person. Doesn’t even really acknowledge you when you say Thankyou. Too busy texting on her phone. 13th November. \nMay be nice if the staff member riding in the carriage was to point out a few landmarks etc, or tell you what you can do at the top. Everything written in Spanish, no information for tourists\nThe cashier at the bottom was friendly and the man who operated the lift. All the other staff were ignorant and treat the tourists with contempt. I was annoyed about this. \nBetter things to do for views that are less money or free. We went to the park Guell yesterday it was free entry to walk around and amazing views BUT a decent hike. However Much better. \nVery over priced for what is was wouldn’t bother doing this if I’d known. Waste of money. Also the drinks at the top are very expensive. ", "publishedDate": "2019-11-13", "language": "en", "rating": 2}, {"id": 722023858, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d17593156-r722023858-The_Port_Cable_Car-Barcelona_Catalonia.html", "text": "This is very popular, can be very crowded and can also take an age.\n\nWe arrived at 10:10 for a 11:00 first ride from the Telefonica at the port to ride one way to Montjuïc. We were in the first car and it wasn’t rammed. \n\nWhen we got to Montjuïc it was much quieter. My tip would be go to the gardens and ride to the coast. Still do it early though to avoid ridiculous queues.\n\nSpecial mention to the guy setting up this morning. A special blend of surliness that can only be achieved by someone who hates their job and dealing with the public 😂😂.\n\nWe had a lovely trip, loved the views and the touristic spotting.", "publishedDate": "2019-10-28", "language": "en", "rating": 4}, {"id": 719155029, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d17593156-r719155029-The_Port_Cable_Car-Barcelona_Catalonia.html", "text": "We waited an hour for a three-minute ride over the top of the city. You'll get the same view from other high spots in Barcelona like the La Sagrada Familia. \nIf you feel you must do this, board from the Mt. Montjuïc side. There was no line.", "publishedDate": "2019-10-17", "language": "en", "rating": 2}, {"id": 718670688, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d17593156-r718670688-The_Port_Cable_Car-Barcelona_Catalonia.html", "text": "Expensive and really nothing spectacular. You are in a box with another 15-16 people for about 6-8 minute ride. Don't waste your time and money.", "publishedDate": "2019-10-15", "language": "en", "rating": 1}, {"id": 717807904, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d17593156-r717807904-The_Port_Cable_Car-Barcelona_Catalonia.html", "text": "Literally!  Cannot buy tickets in advance and obviously wait times can vary, but usually quite busy.  Only two cable cars, each holding 16 people, so a line of 100 people will take at least 45 minutes.  Beware, it can be deceptive, because at the port there is a line on the ground at the ticket window, but then another line once you get to the top of the tower. The view during the ride is nice, but it is very quick.\n\nAlso note it can be confusing because there are two different cable car rides.  This one (Teleferico del Puerto) goes from the port to the Montjuic park near the Miramar Hotel. The other (Teleferic de Montjuic) starts at the opposite side of the park and goes to the castle at top of the mountain.  \n\nThe park is large with a lot to do.  National Palace, Magic Fountain, Olympic Stadium, restaurants, beautiful views of the city.  But I would probably advise getting there a different way and to not waste time waiting on line.  Remember there is also a line for the cable car going back down to the port!", "publishedDate": "2019-10-12", "language": "en", "rating": 2}, {"id": 713091769, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d17593156-r713091769-The_Port_Cable_Car-Barcelona_Catalonia.html", "text": "The Port Cable Car must be the best vantage point offering the most spectacular views over the harbour. Originally designed for the 1929 Barcelona International Exposition, it was not inaugurated until 1931. It crosses the old harbour, or Port Vell from Torre Sant Sebastià, in Barceloneta Beach, to the Miramar Gardens viewpoint in Mount Montjuïc. The route is about a kilometre and a half long and it reaches a height of almost 60 metres. It's open every day and it costs eleven euros one way, or about 17 euros for a return trip. Great if you are not scared of heights!!!", "publishedDate": "2019-09-26", "language": "en", "rating": 5}, {"id": 711146211, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d17593156-r711146211-The_Port_Cable_Car-Barcelona_Catalonia.html", "text": "Not for those with any fear of heights. Extremely safe yet terrifying as I am not a fan of heights. The walk up the hill is relatively easy. Not for people in wheelchairs.", "publishedDate": "2019-09-19", "language": "en", "rating": 4}, {"id": 706434949, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d17593156-r706434949-The_Port_Cable_Car-Barcelona_Catalonia.html", "text": "45 min wait for 10 mins of breathtaking views of sea, mountains and city.  Loved this sky ride from Barcelona Beach/Port Vell to Montjuic in ten minutes.  When arrive to Montjuic by this Cable Car pause to take in the view looking back or better yet stop for a beverage on the patio and take it all in.  Cable Car to Montjuic is not to be confused with the funicular car which is on Montjuic.", "publishedDate": "2019-09-04", "language": "en", "rating": 5}, {"id": 706370005, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d17593156-r706370005-The_Port_Cable_Car-Barcelona_Catalonia.html", "text": "From the top of Mont Juic the walk to the port cable car winds down for about 5 mins. The views are lovely and the air still cool in summer. From the top of the cable cars the voyage down give a wonderful view of the port and beaches. I’ve only ever done the trip down and would say it the best route to get off the mountain", "publishedDate": "2019-09-04", "language": "en", "rating": 4}, {"id": 701178709, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d17593156-r701178709-The_Port_Cable_Car-Barcelona_Catalonia.html", "text": "Beware only two cable cars, one going one way and one going the other. The que was horrifically long, do a boat trip or something much more entertaining with your time in Barcelona, we wish we had.", "publishedDate": "2019-08-20", "language": "en", "rating": 1}, {"id": 699937149, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d17593156-r699937149-The_Port_Cable_Car-Barcelona_Catalonia.html", "text": "Way to expensive\nBig queues\nTightly packed\nNothing to do when you get to top\nYou would be better of getting a taxi to the top more comfortable an a lot cheaper.\nIn fact you need to get a taxi to the start of cable car as it is off the beaten track", "publishedDate": "2019-08-17", "language": "en", "rating": 1}, {"id": 695562061, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d17593156-r695562061-The_Port_Cable_Car-Barcelona_Catalonia.html", "text": "We went oneway port to miramar and then walked on the the ‘magic’ fountain. \n\nPlus side - good view and we really enjoyed sitting in the Plaça de l'Armada which also had good view, shady benches and there was someone playing music. \n\nDownside - a lot of queuing, pretty crammed in, pretty pricey. ", "publishedDate": "2019-08-04", "language": "en", "rating": 3}, {"id": 692879673, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d17593156-r692879673-The_Port_Cable_Car-Barcelona_Catalonia.html", "text": "The views from the cable car are good, however we had a very long wait (1.5 hours) and were only on the cable car for about 4 minutes... Wouldn't say it was worth the wait as by the time we got on the car we were all fed up and underwhelmed. I think the wait time should be advertised. ", "publishedDate": "2019-07-26", "language": "en", "rating": 2}, {"id": 685503078, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d17593156-r685503078-The_Port_Cable_Car-Barcelona_Catalonia.html", "text": "Thìs is a good experience with very good views over the bay and harbour. BUT don't make the mistake we made thinking it was to the top of Montjuic. This cable car only takes you half way. Then you get another cable car to the top. It cost us 66 euros for our trip and would have cost about another 50 euros to get to the top. We made a big mistake but I also think it should be displayed at the start that there is another cost involved. Big rip off !!", "publishedDate": "2019-06-30", "language": "en", "rating": 2}, {"id": 681519454, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d17593156-r681519454-The_Port_Cable_Car-Barcelona_Catalonia.html", "text": "This was a pleasant way to view the city from the sky. We had the cable car to ourselves and it was a beautiful clear day. At the top is an old fort which you can explore. It gives you a real feel for the overall make up of Barcelona.", "publishedDate": "2019-06-14", "language": "en", "rating": 4}, {"id": 679780688, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d17593156-r679780688-The_Port_Cable_Car-Barcelona_Catalonia.html", "text": "There are two Cable Car rides in Barcelona and most appear to head for the one which goes up over MontJuic. If you have the time I'd recommend tackling both. However, the Port Cable Car was suggested by a work colleague for its fabulous views of the bay and she was right. It is well worth a visit.\n\nIt's pretty cheap to but a ticket. 11 Euros one way and 16 Euros return. Kids under 6 go free. You can get there by foot, on the local bus, the hop-on hop-off bus or by taxi. And of course, its a view you won't see anywhere else.\n\nWe visited on a fairly quiet day during half term in England. We had a 20 minute wait to purchase tickets, then another 30 minute wait to get on the cable car. However, at this point you are up the top of a very tall tower and the views are great, so the wait is not so much of a problem. You are crammed inside the car ride and so ensure you grab a window position even if you have to stand sideways.\n\nI imagine going here in the mid-day sun, when the whole top floor is full of people under glass, could cause no end of problems, heat exhaustion being one of them. There are no refreshment facilities on the floor though there appeared to be a toilet so take make sure you take your water.\n\nI'd reccommend going there early on in the day because I'm guessing the queues become 2 hr waits, judging by the miles of que ribbons winding back and forth. Tip -  If there's only a short queue at the ticket office downstairs, chances are the queue in in the tower is also fairly short. You have to travel by lift to reach the top.\n\nAnd finally, of course if its raining you won't see a thing.", "publishedDate": "2019-06-07", "language": "en", "rating": 4}]}}]