[{"locationId": 8797192, "name": "Mercat de la Llibertat", "placeType": "ATTRACTION", "reviewListPage": {"reviews": [{"id": 709845499, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d8797192-r709845499-Mercat_de_la_Llibertat-Barcelona_Catalonia.html", "text": "Indoor market located in the Gracia neighbourhood of Barcelona. Not a large market, you are likely to spend less than a half hour here. Typical European market... fruits, vegetables, meat, fish, etc. ", "publishedDate": "2019-09-15", "language": "en", "rating": 3}, {"id": 675430144, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d8797192-r675430144-Mercat_de_la_Llibertat-Barcelona_Catalonia.html", "text": "Mercat de la Llibertat is an excellent place to get some lovely fresh food at local prices. It is clean and offers  a wide range of fresh produce and other products. You can buy to take away or you can sit in and enjoy a meal inside. The atmosphere is really pleasant. The service professional and friendly. The Market was built back in the late 19th century and was \"recently\" renovated, in 2009. It's worth a visit if you happen to be in the area.", "publishedDate": "2019-05-21", "language": "en", "rating": 4}, {"id": 656372947, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d8797192-r656372947-Mercat_de_la_Llibertat-Barcelona_Catalonia.html", "text": "Ideal place to pick up local ingredients for when you want to prepare a meal yourself. Vendors can make recommendations. ", "publishedDate": "2019-03-04", "language": "en", "rating": 4}, {"id": 654713651, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d8797192-r654713651-Mercat_de_la_Llibertat-Barcelona_Catalonia.html", "text": "Excellent market in the nice quiet neighbourhood of Gracia. Not at all overcrowded with tourists like in La Boqueria. Very good selection of high grade foods. All stalls are very friendly and eager to give info about their products. An excellent place to shop if you are staying in an appartment nearby.", "publishedDate": "2019-02-25", "language": "en", "rating": 5}, {"id": 607394950, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d8797192-r607394950-Mercat_de_la_Llibertat-Barcelona_Catalonia.html", "text": "Excellent art nouveau market, restored in 2009. The market sells high quality, fruit, vegetables, meat, fish, cheese and charcuterie. This is a local market where you won't find crowds of tourists, like the Boqueria and neither will you find food on sticks.\nIt's a great place to shop for food if you want the best at a reasonable price. I particularly recommend the dried fruit and nuts at Lagrana and the fantastic fish restaurant attached to Joan Noi. The air conditioning is also welcome on a hot day.", "publishedDate": "2018-08-17", "language": "en", "rating": 5}, {"id": 508977640, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d8797192-r508977640-Mercat_de_la_Llibertat-Barcelona_Catalonia.html", "text": "All kinds of fruits in just one place. Once it is a tourist place, prices are a bit high. It is a market like all others. So, if you don't like that type of attraction, this is one should not be on your list.", "publishedDate": "2017-08-05", "language": "en", "rating": 3}, {"id": 479377126, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d8797192-r479377126-Mercat_de_la_Llibertat-Barcelona_Catalonia.html", "text": "It's very nice and recently rebuilt. But besides that you'll get fresh products and the few restaurants are just fine. Better to go and eat outside.", "publishedDate": "2017-04-26", "language": "en", "rating": 3}, {"id": 448675119, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d8797192-r448675119-Mercat_de_la_Llibertat-Barcelona_Catalonia.html", "text": "If I were living in the Eixample, this is where I would shop. Fresh meats, fish, veggies, fruit and other assortments of food. Connected to the market is a full service supermarket. And it´s a nice neighbiorhood, too. Less hassle than the Boqueria.", "publishedDate": "2017-01-02", "language": "en", "rating": 3}, {"id": 442157043, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d8797192-r442157043-Mercat_de_la_Llibertat-Barcelona_Catalonia.html", "text": "We loved this find when walking in Gracia.  El Taste del Joan Noi has a small seafood counter with stools for some yummy and fresh seafood options at a great price.  This market also has fruits, vegetables, meats, etc.  It was frequented mostly by locals and was a refreshing change from the market on La Rambla.  We bought fresh fruit and ate seafood at the Joan Noi counter.  It was our best meal in Barcelona and most unexpected as we hadn't planned to visit but instead stumbled upon this market on a walk.  The market building also has some historical significance (local famous architect).", "publishedDate": "2016-12-05", "language": "en", "rating": 5}, {"id": 428074399, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d8797192-r428074399-Mercat_de_la_Llibertat-Barcelona_Catalonia.html", "text": "Los mejores \"callos\" de Barcelona. Els millors \"callos\" de Barcelona. The best \"callos\" of Barcelona.\nCallos: It's a plate performed such strong sauce. Very good with wine or beer.", "publishedDate": "2016-10-15", "language": "en", "rating": 5}, {"id": 411453671, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d8797192-r411453671-Mercat_de_la_Llibertat-Barcelona_Catalonia.html", "text": "If Boqueria market was a little overwhelming, try this local one if you are in the area.  Just a nice collection of shops and a small lunch counter.", "publishedDate": "2016-08-27", "language": "en", "rating": 5}, {"id": 370048430, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d8797192-r370048430-Mercat_de_la_Llibertat-Barcelona_Catalonia.html", "text": "We lived close to the market, so we could enjoy the fresh and tasty food. Everything is of the highest quality. We liked a lot a Joan Noi cafe inside the market - the food was delicious and the service is perfect and friendly, though the cafe is tiny. ", "publishedDate": "2016-05-04", "language": "en", "rating": 5}]}}]