[{"locationId": 531598, "name": "Casa Vicens", "placeType": "ATTRACTION", "reviewListPage": {"reviews": [{"id": 752535239, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d531598-r752535239-Casa_Vicens-Barcelona_Catalonia.html", "text": "This house has only relatively recently been opened to the public. It stands as an example of what really good restoration can do to widen understanding of Gaudi‘s work. Completely iconoclastic when compared with the standard Victorian family house of the late 19th C. it is astonishingly beautiful and full of colour and images of the natural world both inside and out.  Sadly the gardens which contained spectacular fountains, designed by Gaudi, gradually became diminished as pressure grew on land in the popular new area of Gracia. What space remains around the house, can hardly be called a garden but has at least been filled with plants to try and make good the loss. But for me the most exciting thing was the top floor which houses a collection of archival material. There are old photographs, models and copies of the original planning drawings for the house and its surrounding land. In all, a very worthwhile experience.", "publishedDate": "2020-04-12", "language": "en", "rating": 5}, {"id": 751853507, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d531598-r751853507-Casa_Vicens-Barcelona_Catalonia.html", "text": "Pleasent and calm experience. I hardly reccomend to plan your visit alone and enjoy this amazing house -full of history- creating your own experience.", "publishedDate": "2020-03-26", "language": "en", "rating": 5}, {"id": 750886609, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d531598-r750886609-Casa_Vicens-Barcelona_Catalonia.html", "text": "This was one of the best things we did during our two month stay in Barcelona. There were few people, we got a close glimpse of Gaudi’s work, the staff was friendly and knowledgeable, the technology and exhibits were very sophisticated and easy to use, and the Hoffman mascarpone croissants in the courtyard shop are phenomenal, especially after a cava. It is a pleasant walk from El Borne and gave us an appreciation for Gracia.  ", "publishedDate": "2020-03-14", "language": "en", "rating": 5}, {"id": 750740021, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d531598-r750740021-Casa_Vicens-Barcelona_Catalonia.html", "text": "I took a guided tour in English at Casa Vicens. I absolutely loved it. The house is just beautiful and the history around it was very interesting. The museum shop had a very nice and modern feel about it and the coffee shop looked very nice too.", "publishedDate": "2020-03-13", "language": "en", "rating": 5}, {"id": 750394819, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d531598-r750394819-Casa_Vicens-Barcelona_Catalonia.html", "text": "Great place to visit. Here you will see the amazing work Gaudi has built to see before your eyes. A truly visionary man. I love the way he tries to incorporate in his work nature as part of his designs.", "publishedDate": "2020-03-11", "language": "en", "rating": 4}, {"id": 750384093, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d531598-r750384093-Casa_Vicens-Barcelona_Catalonia.html", "text": "Casa Vicens is the first house Gaudí built. Altough it's quite big inside, it's still a \"holidays villa\"·, so it's much better to visit if it's not full of visitors. That's why I liked it. I could see everything in detail,I didn't feel sorrounded by tourists every moment, as it happens some other Gaudí places. ", "publishedDate": "2020-03-10", "language": "en", "rating": 5}, {"id": 750351135, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d531598-r750351135-Casa_Vicens-Barcelona_Catalonia.html", "text": "Entering Gaudi's first house is a magical experience, its amazing colours and botanical styles make it a jewel of modernism in the wonderful city of Barcelona.\nI strongly recommend to visit it.", "publishedDate": "2020-03-10", "language": "en", "rating": 5}, {"id": 750242704, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d531598-r750242704-Casa_Vicens-Barcelona_Catalonia.html", "text": "Casa Vicens isn’t a place, it is the beginning of Modernism: Gaudí’s first house builded by a Young Gaudi with 30 years old. \n\nA Magic Building, a house in vivid colors, decorated with ceramic tiles, with lots of amazing details. Among other houses gives the impression of a fairytale.\n\nThe opportunity to experience the house who opened its doors to the public at the end  of 2017 after 3 years of restoration, through the voice of the owner, co-host of the event.", "publishedDate": "2020-03-10", "language": "en", "rating": 5}, {"id": 749207180, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d531598-r749207180-Casa_Vicens-Barcelona_Catalonia.html", "text": "The interior decoration of the house is marvelous. The smoking room is a gem.. It is a pity that the original garden is lost. It was an integral part of the original Gaudi design.", "publishedDate": "2020-03-05", "language": "en", "rating": 5}, {"id": 749200284, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d531598-r749200284-Casa_Vicens-Barcelona_Catalonia.html", "text": "All my family enjoy it. for me the first one from Gaudi is a hit. it's a touchable wow, because a mega crack as him was born.", "publishedDate": "2020-03-05", "language": "en", "rating": 5}, {"id": 749200226, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d531598-r749200226-Casa_Vicens-Barcelona_Catalonia.html", "text": "The first house of Gaudi, but with all the special things of him. Every little detail is fantastic .", "publishedDate": "2020-03-05", "language": "en", "rating": 5}, {"id": 749182744, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d531598-r749182744-Casa_Vicens-Barcelona_Catalonia.html", "text": "Gaudís first masterpiece is extraordinary, so different from all other Gaudí houses. We highly recommend to visit. ", "publishedDate": "2020-03-04", "language": "en", "rating": 5}, {"id": 749134216, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d531598-r749134216-Casa_Vicens-Barcelona_Catalonia.html", "text": "Very good guide : nice and sweet and her explanations were very complete and interesting! Very beautiful casa especially the outside (so better be sunny when you come) ! ", "publishedDate": "2020-03-04", "language": "en", "rating": 5}, {"id": 747354062, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d531598-r747354062-Casa_Vicens-Barcelona_Catalonia.html", "text": "Vincent's home in a small alley, in fact,is not open,can only look outside, from the style should be gaudi,s early works because although the building has characteristics but it is too normal", "publishedDate": "2020-02-24", "language": "en", "rating": 5}, {"id": 746369637, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d531598-r746369637-Casa_Vicens-Barcelona_Catalonia.html", "text": "Visit Gaudi's houses with my daughter and get an impression in Barcelona. We celebrate her birthday in the city.", "publishedDate": "2020-02-20", "language": "en", "rating": 5}, {"id": 746265627, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d531598-r746265627-Casa_Vicens-Barcelona_Catalonia.html", "text": "Very interesting if you like architecture and Gaudí as it is the first house he made. The Renovation is beautifully made. A must", "publishedDate": "2020-02-20", "language": "en", "rating": 5}, {"id": 746173844, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d531598-r746173844-Casa_Vicens-Barcelona_Catalonia.html", "text": "An other wonderful house, the first villa of Gaudi, to admire very nice painted tiles, inside, a stunning decoration of Manuel Vincens and the architecture of Gaudi; I bought a book of Art Nouveau , and have a nice souvenir of this famous casa Vincens.", "publishedDate": "2020-02-19", "language": "en", "rating": 5}, {"id": 746054975, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d531598-r746054975-Casa_Vicens-Barcelona_Catalonia.html", "text": " It is worth a visit. Friendly staff. Anyway, in my opinion, the restoration could have been better. I do not see the necessity of preserving only Gaudi´s work (which represents 50% of the house). The inner part of the house built during the twenties of the last century has been completely demolished. In its place a complete modern structure which has nothing to do with the house.  ", "publishedDate": "2020-02-19", "language": "en", "rating": 4}, {"id": 745362868, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d531598-r745362868-Casa_Vicens-Barcelona_Catalonia.html", "text": "If you are a fan of Gaudi or just incredible architecture, this is a must see. Excellent tour guides, loved that we could ask questions. Beautiful restoration, and interesting additional exhibits.", "publishedDate": "2020-02-15", "language": "en", "rating": 5}, {"id": 744768138, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d531598-r744768138-Casa_Vicens-Barcelona_Catalonia.html", "text": "Friendly staff. Beautiful rooms. Amazing location. Really tasty breakfast. Can not fault it at all !!", "publishedDate": "2020-02-12", "language": "en", "rating": 5}, {"id": 744536497, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d531598-r744536497-Casa_Vicens-Barcelona_Catalonia.html", "text": "You can visit the house by yourself. Very easy and clear informations. Short movie from 10 minutes About the City growing. Nice coffee in the garden. Reachable by Metro to Stop Fontana (15min from Placa Catalunya).", "publishedDate": "2020-02-11", "language": "en", "rating": 4}, {"id": 743700582, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d531598-r743700582-Casa_Vicens-Barcelona_Catalonia.html", "text": "I had an early ticket before the attraction became too crowded. My guide was David, he was very knowledgeable about the house's history and architecture and I learned a lot about Antoni Gaudí. ", "publishedDate": "2020-02-08", "language": "en", "rating": 5}, {"id": 743694268, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d531598-r743694268-Casa_Vicens-Barcelona_Catalonia.html", "text": "We felt like we were secretly looking at Gaudi's work.   It wasn't overly crowded, it was beautifully presented, it was a peek back in time and of course, it was Gaudi.\n\nDo yourself a favour and see this stunning home with ideas ahead of their time and then sit, drink a local Catalan Cava in the cafe and imagine you were in the sprawling garden looking at that stunning summer house.  \n\nFabulous.  Go and see this!", "publishedDate": "2020-02-08", "language": "en", "rating": 5}, {"id": 743610450, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d531598-r743610450-Casa_Vicens-Barcelona_Catalonia.html", "text": "Maybe because of the red exterior, I always think this is what Guadi would’ve done if he were to design a firehouse. I have no idea what it actually is. We didn’t go inside. But just to marvel at the exterior beauty is worth the walk to get there. \n\nI don’t recall the walk being very far from more touristy areas, and it’s definitely not surrounded by sights like casa Batllo is. But we were glad to have gone out of our way to see it even without doing the tour. It’s relative isolation may have had to do with the fact that there was no line to get in, and no crowd to push through to walk by. ", "publishedDate": "2020-02-07", "language": "en", "rating": 4}, {"id": 742055230, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d531598-r742055230-Casa_Vicens-Barcelona_Catalonia.html", "text": "A little out of the way by definitely worth making the effort. I would strongly recommend taking the guided tour. Our Guide (Laura V.) was excellent. We would have missed so much had it not been for her knowledge and passion of the house. The coffee shop in the courtyard also comes highly recommended - the filled croissants are to die for!! ", "publishedDate": "2020-01-30", "language": "en", "rating": 5}, {"id": 741948064, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d531598-r741948064-Casa_Vicens-Barcelona_Catalonia.html", "text": "Beautifully restored first house designed by Gaudí with a very nice model exhibit of architectural contemporaries as well as some good information on the history and the restoration of Casa Vicens.  I loved this house.  It is smaller and less fantastical than Gaudí's later and larger projects, but absolutely lovely.  However, the entrance price is quite high for such a small building and I wish there had been an audio tour included.", "publishedDate": "2020-01-29", "language": "en", "rating": 4}, {"id": 741893066, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d531598-r741893066-Casa_Vicens-Barcelona_Catalonia.html", "text": "Of all the Gaudì sites we visited, this was one of the best. Welcoming staff, interesting site. Highly recommended!", "publishedDate": "2020-01-29", "language": "en", "rating": 5}, {"id": 740764408, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d531598-r740764408-Casa_Vicens-Barcelona_Catalonia.html", "text": "Beautiful house, it had a good structured visit... The staff was very attentive and nice towards everyone. We had our ticket booked for later but we got there an hour earlier and they let us in.", "publishedDate": "2020-01-23", "language": "en", "rating": 5}, {"id": 740577165, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d531598-r740577165-Casa_Vicens-Barcelona_Catalonia.html", "text": "Great peace of work made to reconstruct the building. No queue, bought tickets online. Great Cafe, tea was exceptional. ", "publishedDate": "2020-01-22", "language": "en", "rating": 5}, {"id": 738913859, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d531598-r738913859-Casa_Vicens-Barcelona_Catalonia.html", "text": "I wanted visit this house for so long that I don't count years anymore.\nSo when I knew it was finally open to public, I didn't hesitate.\nIt's really beautiful. The style of the architecture is very different of the others Gaudi's buildings (less art nouveau and more moorish).\nThe facades are full of details (sculptures, earthenwares, ironworks,...). \nThe interior is just as amazing.\nI took the first visit of the morning, so there were few people. It was more pleasant because rooms are small. And it's better too if you want take photos without tourists in the middle :)\nIf I should say something negative, I would say the garden is really small, mostly thinking about what it was at the begenning. But despite of this, it is all the same nicely maintained.\nSo if you have the opportunity, come to visit this house.\nIt's worth it !!!", "publishedDate": "2020-01-13", "language": "en", "rating": 5}, {"id": 738321573, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d531598-r738321573-Casa_Vicens-Barcelona_Catalonia.html", "text": "My DW and I walked here after visiting Park Guell and were so happy we did. Gaudi's works are just awe inspiring. Only saw the outside but it truly amazed.", "publishedDate": "2020-01-10", "language": "en", "rating": 5}, {"id": 738287612, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d531598-r738287612-Casa_Vicens-Barcelona_Catalonia.html", "text": "It was wonderful to see this house on the inside. It gives a lot of insight into Gaudi's career trajectory, and the leap he made from this first commissioned work to his second, El Capricho. Worth the visit.", "publishedDate": "2020-01-10", "language": "en", "rating": 5}, {"id": 738070793, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d531598-r738070793-Casa_Vicens-Barcelona_Catalonia.html", "text": "Casa Vincens was a fantastic discovery. I recommend everyone the guided tour to appreciate even more this Gaudì's architectural work of art.", "publishedDate": "2020-01-09", "language": "en", "rating": 5}, {"id": 738066034, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d531598-r738066034-Casa_Vicens-Barcelona_Catalonia.html", "text": "Stunning house.  Such a shame the garden and outbuildings are no longer in existence.    \nEssential for all Gaudi or Modernista fans.", "publishedDate": "2020-01-09", "language": "en", "rating": 5}, {"id": 738056115, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d531598-r738056115-Casa_Vicens-Barcelona_Catalonia.html", "text": "It is the best house of Gaudi in my opinion. The interior is so futuristic but in the same time old. I would really recomand visiting it. ", "publishedDate": "2020-01-09", "language": "en", "rating": 5}, {"id": 737891254, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d531598-r737891254-Casa_Vicens-Barcelona_Catalonia.html", "text": "First Gaudí's building. A beautiful House.\n Verbal decoration. Flowers, leafs....\nOriental inspiration. \nI recommand this visit\n", "publishedDate": "2020-01-08", "language": "en", "rating": 5}, {"id": 737751172, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d531598-r737751172-Casa_Vicens-Barcelona_Catalonia.html", "text": "It was very interesting guided tour with a lot of specail information regarding the person of Antoni Gaudi. Casa Visens it's a good place for better understanding of personal history. ", "publishedDate": "2020-01-07", "language": "en", "rating": 5}, {"id": 736988301, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d531598-r736988301-Casa_Vicens-Barcelona_Catalonia.html", "text": "For us, the view outside was sufficient. The inside was pretty empty. We expected some old furniture etc to be maintained but we were greeted with ipads and projector screens that tell the story of the place. 17 euros. I'd say just skip it. Maybe some pinchos and beer at a bar would be much better. ", "publishedDate": "2020-01-05", "language": "en", "rating": 3}, {"id": 736852697, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d531598-r736852697-Casa_Vicens-Barcelona_Catalonia.html", "text": "It is definitely different than all other Gaudi houses, it mixes modernism, with Asian and arabic styles. You can see the house in about 40mins if you like to stare at the details etc. It is pretty quick :) Very much worth the visit!", "publishedDate": "2020-01-04", "language": "en", "rating": 4}, {"id": 736344473, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d531598-r736344473-Casa_Vicens-Barcelona_Catalonia.html", "text": "At 17.50 euros it’s an absolute waste of money. The exterior is great but you can see this for free. The inside is mostly clinical with a few rooms nicely finished. But it’s a replica of the original. I was disappointed as I had previously visited Guell palace which was only 12 euros including an audio guide and much more interesting interior. The price should be cheaper or include more such as guided tour or audio at the very least. It just wasn’t very interesting.", "publishedDate": "2020-01-02", "language": "en", "rating": 1}, {"id": 736262872, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d531598-r736262872-Casa_Vicens-Barcelona_Catalonia.html", "text": "The place is lovely. Offers some history, architecture and fun. Still the price is too high to enter a house ", "publishedDate": "2020-01-02", "language": "en", "rating": 4}, {"id": 736219032, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d531598-r736219032-Casa_Vicens-Barcelona_Catalonia.html", "text": "The house was full of history which are interesting. The tour went like an hour which is sufficient to tour the whole house. I would recommend Casa Vicens. ", "publishedDate": "2020-01-02", "language": "en", "rating": 5}, {"id": 736183727, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d531598-r736183727-Casa_Vicens-Barcelona_Catalonia.html", "text": "We booked an excellent guided tour with the English speaking guide who was very knowledgeable and increased our enjoyment of the visit. The style may appear a little over the top for popular minimal taste but, as a showcase for all the artisan skills of the Modernist era, it can't be beaten.", "publishedDate": "2020-01-01", "language": "en", "rating": 5}, {"id": 735951716, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d531598-r735951716-Casa_Vicens-Barcelona_Catalonia.html", "text": "Very glad we visited. Our guide was excellent which made the tour very worthwhile to see gaudi’s first work. ", "publishedDate": "2019-12-31", "language": "en", "rating": 5}, {"id": 735522998, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d531598-r735522998-Casa_Vicens-Barcelona_Catalonia.html", "text": "This is literally the most beautiful building. I didn't know about it before, I saw a picture of it in the Parc Güell. Hghly recommended!!!", "publishedDate": "2019-12-29", "language": "en", "rating": 5}, {"id": 735061685, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d531598-r735061685-Casa_Vicens-Barcelona_Catalonia.html", "text": "If you are a fan of gaudi, you definitely have to visit casa vincens. Absolutely recommended to take the guided visit.", "publishedDate": "2019-12-28", "language": "en", "rating": 5}, {"id": 734616103, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d531598-r734616103-Casa_Vicens-Barcelona_Catalonia.html", "text": "Everything is fine. Very accurate restore. Staff's  introduction are  professional and initiative.But the entire exhibition hall is smaller than expected, and the content is slightly less.So the price of ticket is a bit high.", "publishedDate": "2019-12-25", "language": "en", "rating": 4}, {"id": 733629840, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d531598-r733629840-Casa_Vicens-Barcelona_Catalonia.html", "text": "We had visited most of the more famous Gaudi works in previous visits to Barcelona, so we were excited to hear about Casa Vicens. It's a bit out of the way, but worth seeing. The displays are interesting, and some of the history (like the fact that when built, it was in the country). It's not as impressive as some of the other works, but it was his first commission, and it is worth seeing.", "publishedDate": "2019-12-19", "language": "en", "rating": 5}, {"id": 733291672, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d531598-r733291672-Casa_Vicens-Barcelona_Catalonia.html", "text": "This building is an amazing riot of colour and design. One of Gaudi's earliest commissions, the recent restoration is set out in a permanent exhibition on the top floor, and gives insights into the craftsmanship involved.  Allow around two hours to see everything, and round off the trip with a coffee and cake in the cafe in the small courtyard.  Highly recommended!", "publishedDate": "2019-12-17", "language": "en", "rating": 5}, {"id": 733189017, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d531598-r733189017-Casa_Vicens-Barcelona_Catalonia.html", "text": "This house was once in the middle of vast gardens and the gates that surround Gaudi's famous Park Guell originally were the garden gates of this property. Sadly all that remains now is the house, sitting incongruously beside modern apartment buildings in a nondescript area of the city. The house itself is actually amazing but the guided tour wasn't worth it. Our guide wasn't very interesting and she didn't have very much to say, ending 15 minutes early. ", "publishedDate": "2019-12-17", "language": "en", "rating": 3}, {"id": 732952277, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d531598-r732952277-Casa_Vicens-Barcelona_Catalonia.html", "text": "One of the master piece of Gaudi, it looks like a candy house. Because of the entering price i didnt visit the inside but it looks beautifull from the outside.", "publishedDate": "2019-12-15", "language": "en", "rating": 3}, {"id": 732023998, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d531598-r732023998-Casa_Vicens-Barcelona_Catalonia.html", "text": "Really beautiful inside and worth the visit.  An audio guide would have been a nice extra option but you kind of get it with the info booklet they give you on arrival.", "publishedDate": "2019-12-11", "language": "en", "rating": 5}, {"id": 732021902, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d531598-r732021902-Casa_Vicens-Barcelona_Catalonia.html", "text": "If you're in Barcelona, don't waste your time on Milà and Battlò House, but visit this jewel, which is cured in every detail and has an amazing exhibition of technical details at second floor.", "publishedDate": "2019-12-11", "language": "en", "rating": 5}, {"id": 732016167, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d531598-r732016167-Casa_Vicens-Barcelona_Catalonia.html", "text": "Very big surprise! If you want to know Gaudì you had to start from here. You can see the first house projetected by Gaudì.  The Casa Vicens is not to far from Park Guell and you can join it by walking for 20 min max. ", "publishedDate": "2019-12-11", "language": "en", "rating": 5}, {"id": 731990653, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d531598-r731990653-Casa_Vicens-Barcelona_Catalonia.html", "text": "This is one of the first works done by Gaudí and it's really something else, quite different from other (and better known) works such as Sagrada Família or La Pedrera. It reopened back in 2017 and it's really worth it –the guided tour was great and we were lucky enough to be the only ones so it was like a private tour. Totally recommended for those who want to know more about Modernism, aside the most typical buildings. ", "publishedDate": "2019-12-10", "language": "en", "rating": 5}, {"id": 731980366, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d531598-r731980366-Casa_Vicens-Barcelona_Catalonia.html", "text": "It was wonderful to finally visit this amazing house which has not been open to the public until quite recently. To see Gaudi’s earliest work was fascinating. The restorations have been beautifully done.and there are some interesting displays to see as well.", "publishedDate": "2019-12-10", "language": "en", "rating": 5}, {"id": 731978865, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d531598-r731978865-Casa_Vicens-Barcelona_Catalonia.html", "text": "Magnificent house designed by A.Gaudi. Deserves a visit if you are in Barcelona and you want to see other architectural gems apart from the most visited as Sagrada Familia. It will complete your vision of the works and contribution of Gaudi to the art of the 20th century (or late 19thcentury). ", "publishedDate": "2019-12-10", "language": "en", "rating": 5}, {"id": 731652161, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d531598-r731652161-Casa_Vicens-Barcelona_Catalonia.html", "text": "Rated this house with 3 stars only due i visited it as last one. It's first house of fantastic architect. It was designed as summer resinldence and was surraunded with garden. Afterwards there were many changes which affected Gaudis work. Nowadays many unique elements of decoration were restored and visitors can enjoy architects idea of union of garden outside the house and house itself. This house is small. I really enjoyed but i put 3 stars only because i guess not many people will be fascinated.", "publishedDate": "2019-12-09", "language": "en", "rating": 3}, {"id": 731426220, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d531598-r731426220-Casa_Vicens-Barcelona_Catalonia.html", "text": "Well done!  guides are fantastic, knowlegable, interesting.  \nA sight to see, indoor and out.  We arrived early, a short while after opening in Dec, not crowded.  \nI paid a discounted rate which was appropriate for the activity.", "publishedDate": "2019-12-08", "language": "en", "rating": 5}, {"id": 730794225, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d531598-r730794225-Casa_Vicens-Barcelona_Catalonia.html", "text": "I was delighted to learn that this site has been open to the public (since 2017) and my visit made that delight justified.  With a fascinating history and a wonderful guided tour, Casa Vicens makes for a great addition to the Gaudi story in Barcelona.  ", "publishedDate": "2019-12-05", "language": "en", "rating": 5}, {"id": 730548328, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d531598-r730548328-Casa_Vicens-Barcelona_Catalonia.html", "text": "The house is fantastic , what surprised us was the kindness and competence of all the guides working there. They explained us all the story and the renovation tecniques of Casa Vicens And in a very fluent English!!!", "publishedDate": "2019-12-03", "language": "en", "rating": 5}, {"id": 729774750, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d531598-r729774750-Casa_Vicens-Barcelona_Catalonia.html", "text": "We have a guided visit to Casa Vicencs and all was perfect!! The architecture, the house, the visit, the staff and  all the explanations of the guide were perfect and very precise.\nHighly recommended if you like modernist architecture and Gaudi! ", "publishedDate": "2019-11-30", "language": "en", "rating": 5}, {"id": 729768780, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d531598-r729768780-Casa_Vicens-Barcelona_Catalonia.html", "text": "Beautiful house with amazing architecture. A jewel. Well located and easy to go around. The coffee shop in the garden is a plus.", "publishedDate": "2019-11-30", "language": "en", "rating": 5}, {"id": 729662989, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d531598-r729662989-Casa_Vicens-Barcelona_Catalonia.html", "text": "Casa Vincens built in 1888 was the first home built by Antoni Gaudi.  The outside of this building at 23 Carrer de les Carolines attracts one by its color and designs.  We debated about going in another of Gaudi’s creations, but are very happy we did explore this 4-story masterpiece.  It gives the visitor an appreciation of the intricacies of Gaudi’s considerable and practical creativity.  Don’t miss the rooftop.  Though visiting is self-guided with a decent brochure, staff are on each floor to answer questions. Currently on display are models of homes by other influential architects around the world, including Frank Lloyd Wright.  To me, and with all due respect, Wright could be a student of Gaudi, not the reverse.", "publishedDate": "2019-11-29", "language": "en", "rating": 5}, {"id": 729623933, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d531598-r729623933-Casa_Vicens-Barcelona_Catalonia.html", "text": "Casa Vicens hadn’t yet opened on my last visit to Barcelona so I was very excited to check it out. This was Antoni Gaudi’s first house and it showcases his incredible talent. \n\nThis still seems a bit under the radar and it is a bit off the main tourist track. There is very easy access from the metro and you can purchase tickets for a timed entry online. Don’t miss it while in Barcelona! ", "publishedDate": "2019-11-29", "language": "en", "rating": 5}, {"id": 728909276, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d531598-r728909276-Casa_Vicens-Barcelona_Catalonia.html", "text": "This is an excellent example of the terrific Modernista architecture found all around town, but especially in this district.  This lovely building is especially well-exposed for viewing.", "publishedDate": "2019-11-25", "language": "en", "rating": 5}, {"id": 728639000, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d531598-r728639000-Casa_Vicens-Barcelona_Catalonia.html", "text": "When looking at places to visit while in Barcelona this caught my eye reading reviews discovered it was cheaper entry on a Monday. So my husband and I visited it Monday morning and weren’t disappointed. Absolutely amazing architecture and design it must of been stunning when it was originally built as it is now with only a few rooms as originally designed. So pleased it was renovated and we got to visit such an impressive building, well worth a visit even if it’s just to walk past. ", "publishedDate": "2019-11-24", "language": "en", "rating": 5}, {"id": 728404577, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d531598-r728404577-Casa_Vicens-Barcelona_Catalonia.html", "text": "We enjoyed a guided tour of this house that is the first one designed and built by Antonio Gaudí.\nAlthough this building is not typical from the Catalan Modernism, it’s actually interesting and illustrates the genius of Gaudí.\nThe functionalities and the beauty of this house ordered by a broker from Barcelona stock exchange at the end of the 19th Century are pretty in advance compared to contemporary buildings.\nThe guide was perfect, interesting, always ready to answer questions and fluent in French and English.\nWe strongly recommend. ", "publishedDate": "2019-11-23", "language": "en", "rating": 5}, {"id": 727884084, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d531598-r727884084-Casa_Vicens-Barcelona_Catalonia.html", "text": "According to the introduction played in Casa Vicens , It is a rebuild attraction; Special price at every monday which just cost 10 euro per person.", "publishedDate": "2019-11-20", "language": "en", "rating": 4}, {"id": 727673596, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d531598-r727673596-Casa_Vicens-Barcelona_Catalonia.html", "text": "Very interesting visit of the first house designed by Gaudi, full of nice ceramics and crafts overoll the rooms. We enjoyed a lot the glass of cava we had at the garden at midday.", "publishedDate": "2019-11-19", "language": "en", "rating": 5}, {"id": 727379036, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d531598-r727379036-Casa_Vicens-Barcelona_Catalonia.html", "text": "High in the Hills of Gracia neighborhood is Gaudis first house, a summer house for a Financier Client. It’s a complete phantasy and the use of color and technique is mindbending. It’s only been accessible to public since late 2017 and still has an insider‘s secret vibe to it, is not completely overrun with visitors (yet). Plan 1-2 hours.  Near fabulous Gracia market.", "publishedDate": "2019-11-18", "language": "en", "rating": 5}, {"id": 726757623, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d531598-r726757623-Casa_Vicens-Barcelona_Catalonia.html", "text": "We were excited to visit Casa Vicens and it didn't disappoint!\n\nWhat an amazing man Antoni Gaudi was - so innovative and so talented!\n\nEven before going inside we were wowed - the exterior is just beautiful - the neighbours who look out onto Casa Vicens are so lucky!\n\nThe rooms inside were all beautiful - and all so different too.\n\nI highly recommend a visit to Casa Vicens!", "publishedDate": "2019-11-16", "language": "en", "rating": 5}, {"id": 726426703, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d531598-r726426703-Casa_Vicens-Barcelona_Catalonia.html", "text": "I really enjoyed the guided tour. Laura, my guide, really brought the history, decoration and intention behind the design of the house to life. I was a bit mystified by the price however. I nearly bought a ticket online for €25 but decided to just show up before the English tour started and was charged €9.75. I have booked other tours online for the next few days - have I been massively ripped off..?", "publishedDate": "2019-11-14", "language": "en", "rating": 5}, {"id": 726102688, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d531598-r726102688-Casa_Vicens-Barcelona_Catalonia.html", "text": "My children had been asking me to visit the Casa Vicens for a long time.  At school they had studied Gaudí and his works.  We have it near home.  It is an essential wonder.", "publishedDate": "2019-11-12", "language": "en", "rating": 5}, {"id": 726028008, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d531598-r726028008-Casa_Vicens-Barcelona_Catalonia.html", "text": "one of the best representation of Modernism.\na must see in the city.\nvery interesting also the evolution of the building since the original project", "publishedDate": "2019-11-12", "language": "en", "rating": 5}, {"id": 725442153, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d531598-r725442153-Casa_Vicens-Barcelona_Catalonia.html", "text": "Gorgeous place, excellent guide and finally a shop where locally made high class objects are sold. Just perfect and a must see.", "publishedDate": "2019-11-10", "language": "en", "rating": 5}, {"id": 725417668, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d531598-r725417668-Casa_Vicens-Barcelona_Catalonia.html", "text": "The first building Gaudi built for a wealthy family in the early 20th century. It is beautiful, colorful, modern to its era with Islamic influences. it is highly recommend to enter the building and enjoy its lovely design.", "publishedDate": "2019-11-10", "language": "en", "rating": 5}, {"id": 725235321, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d531598-r725235321-Casa_Vicens-Barcelona_Catalonia.html", "text": "Different from Gaudi's later work. The shape of the house is more traditional but the inside decorations are fantastic.", "publishedDate": "2019-11-09", "language": "en", "rating": 4}, {"id": 724962190, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d531598-r724962190-Casa_Vicens-Barcelona_Catalonia.html", "text": "Lovely little pearl of architecture and Gaudis first house. A small sight without hords of visitors, allows you to wander around and explore for yourself. Dont miss the roof terrace!", "publishedDate": "2019-11-08", "language": "en", "rating": 5}, {"id": 724398498, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d531598-r724398498-Casa_Vicens-Barcelona_Catalonia.html", "text": "The visit was very nice. two thigs to improve: 1) clarify the order of the visit 2) we found the price of the tickets very expensive.\nBut all in all, I recommend the visit.\n", "publishedDate": "2019-11-06", "language": "en", "rating": 4}, {"id": 724348638, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d531598-r724348638-Casa_Vicens-Barcelona_Catalonia.html", "text": "Do not forget to visit this amazing first Gaudi s house.Not so crowded as Casa Battlo and La Pedrera.Really nice experience.We do not need to buy tickets in advance.", "publishedDate": "2019-11-05", "language": "en", "rating": 4}, {"id": 724325811, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d531598-r724325811-Casa_Vicens-Barcelona_Catalonia.html", "text": "Fantastic, nice and well organized visit, everything was easy.\nThe Building is amazing and I'm sure it'll become an essential hot spot in town.", "publishedDate": "2019-11-05", "language": "en", "rating": 5}, {"id": 724303942, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d531598-r724303942-Casa_Vicens-Barcelona_Catalonia.html", "text": "This was the best visit in Barcelona with my daughters, 17 and 5 years old. We really enjoyed the house!", "publishedDate": "2019-11-05", "language": "en", "rating": 5}, {"id": 724292819, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d531598-r724292819-Casa_Vicens-Barcelona_Catalonia.html", "text": "Although there are not much things furniture wise inside the rooms but this is one of Gaudi’s work of art. It consists of several levels, hanging balconies and terraces and beautiful daisy tiles. Very neatly preserved overall. The cafe in the courtyard is cozy too. ", "publishedDate": "2019-11-05", "language": "en", "rating": 5}, {"id": 724175644, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d531598-r724175644-Casa_Vicens-Barcelona_Catalonia.html", "text": "Very interesting to see his earlier work.  More Islamic and a little Japanese influence than any of his other works.  While I wouldn’t rate it higher than Casa Battlo, I think it is one of his more interesting works.", "publishedDate": "2019-11-05", "language": "en", "rating": 4}, {"id": 723777466, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d531598-r723777466-Casa_Vicens-Barcelona_Catalonia.html", "text": "one of most interesting gaudi houses in my opinion, casa vicens stood out from the others. we spent just over an hour here to take in all the intricacies of the rooms. we visited mid-afternoon which was not busy at all, which surprised me! i really enjoyed my visit and the lack of crowds made it easier to roam at our own pace. \nif i was to find a negative, i wish they had some cheaper things in the gift shop as it was all quite expensive.", "publishedDate": "2019-11-04", "language": "en", "rating": 5}, {"id": 723002262, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d531598-r723002262-Casa_Vicens-Barcelona_Catalonia.html", "text": "Very interesting building, modernised from the Gaudi original.  It is nicely laid out and informative.  The cafe was a welcome retreat.", "publishedDate": "2019-11-01", "language": "en", "rating": 4}, {"id": 722957117, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d531598-r722957117-Casa_Vicens-Barcelona_Catalonia.html", "text": "I thoroughly enjoyed my self guided direct entry visit to Casa Vicens and by chance visited on a Monday when the house offers reduced entry rates. Fascinating to see Gaudi's first design for a domestic residence having visited Casa Mila that morning. The Nature themed plasterwork is stunning. Heartening to see such care and attention paid to the resoration of the building. Informative 8 minute film about the architect and house. \n\nI also enjoyed the exhibition about first houses by contempories of Gaudi such as Philip Webb, Charles Rennie Mackintosh & Frank Lloyd Wright.\n\nThe house is a must for those interested in Gaudi.", "publishedDate": "2019-10-31", "language": "en", "rating": 5}, {"id": 722872831, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d531598-r722872831-Casa_Vicens-Barcelona_Catalonia.html", "text": "After 4 years of visiting Barcelona and hoping Casa Vicens is finally open this year we were rewarded. The restoration work is awesome and as much as possible kept its original feel and look. There is also some good related exhibitions in upper floors. Well worth a visit to get and even greater insight into Gaudi's style.", "publishedDate": "2019-10-31", "language": "en", "rating": 5}, {"id": 722844275, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d531598-r722844275-Casa_Vicens-Barcelona_Catalonia.html", "text": "Very interesting design - and history - to see here. And is self-guided so you can linger as you wish. Has a small outdoor cafe in the garden area. Friendly staff.", "publishedDate": "2019-10-31", "language": "en", "rating": 5}, {"id": 722790600, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d531598-r722790600-Casa_Vicens-Barcelona_Catalonia.html", "text": "Our visit to Casa Vicens was on of the best “museum/architecture” experiences that we have had.  The guide was very informative.  The film and house model exhibit were extra benefits that helped us to understand Gaudi and the development of Barcelona as a city. Would gladly recommend to others.", "publishedDate": "2019-10-31", "language": "en", "rating": 5}, {"id": 722590220, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d531598-r722590220-Casa_Vicens-Barcelona_Catalonia.html", "text": "Went on a Devour Madrid tour in Gracia which was fabulous and when the tour ended discovered we were 1.5 blocks from Antonio Gaudi’s first architectural assignment. The house was commissioned by a private owner as a Summer home. It was purchased from private owners in 2014 and restored with continuing restoration.\n\nThe cost was around 12 euro and we paid 6 euros for a guided tour in English. The home has many beautiful artistic finishes and is not a typical Gaudi look. The building has a heavy Arabic influence which is quite attractive.\n\nThere is a quaint outdoor area with a small cafe for drinks and snacks. This was quite pleasant. Bathrooms are available and clean.\n\nWould recommend this as a stop. All of the staff was quite helpful and kind.", "publishedDate": "2019-10-30", "language": "en", "rating": 5}, {"id": 722477023, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d531598-r722477023-Casa_Vicens-Barcelona_Catalonia.html", "text": "This Gaudi build home is much more interesting then the 2 famouse one's (La Pedrera & Casa Batllo); exterieur and interieur are sublime !", "publishedDate": "2019-10-29", "language": "en", "rating": 4}, {"id": 722399760, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d531598-r722399760-Casa_Vicens-Barcelona_Catalonia.html", "text": "What a beautiful  house ! we booked a guided tour with a very competent and passionate man. We learned a lot about Gaudi.", "publishedDate": "2019-10-29", "language": "en", "rating": 5}, {"id": 721778740, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d531598-r721778740-Casa_Vicens-Barcelona_Catalonia.html", "text": "We read on-line that Casa Vicens, Gaudi's first architecturally designed project for the Vicens family's \"summer escape\", had just opened to the public. We intended just to go peek from the outside, but some enterprising young sales reps invited us in, assuring us we could enjoy about an hour's tour of the house and grounds--and still make our flight from the airport. We stored our bags in the free lockers and began exploring this amazing, original, Moorish-Spanish blended building. As seniors, our tickets were a mere 10 euros, and after marveling our way through the home, the time and visit were worth far more.  Staircases, window treatments, room layouts, wall and ceiling designs were all impressive. This site is far less known than Gaudi's other works in Barcelona (so far)--go see it before it, too, becomes overrun with tourists.", "publishedDate": "2019-10-27", "language": "en", "rating": 5}, {"id": 721481022, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d531598-r721481022-Casa_Vicens-Barcelona_Catalonia.html", "text": "Worth the visit! Beautiful structure.  It was only until recently (2017) that it opened to the public. ", "publishedDate": "2019-10-26", "language": "en", "rating": 5}, {"id": 721068303, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d531598-r721068303-Casa_Vicens-Barcelona_Catalonia.html", "text": "Casa Vicens is absolutely gorgeous from top to bottom. The exhibit provides adequate details of the design and influences of the home. Only ten euros for general admission. ", "publishedDate": "2019-10-24", "language": "en", "rating": 5}, {"id": 721016572, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d531598-r721016572-Casa_Vicens-Barcelona_Catalonia.html", "text": "Apparently this house has only been open for two years after extensive renovation and is Gaudi's 'first house' Inside you see such intricate work and beautiful colour and the information about the history, influences and renovations helped us appreciate his work.  We had a Monday entrance deal for 10Euros instead of 16 and just turned up", "publishedDate": "2019-10-24", "language": "en", "rating": 5}, {"id": 720774722, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d531598-r720774722-Casa_Vicens-Barcelona_Catalonia.html", "text": "It seems to Me that the house of Vicens, though the very first of the houses of Gaudi, in time. the most beautiful performance. but that's my opinion....it is as mysterious, quiet, private as a country estate, although it is close to busy streets", "publishedDate": "2019-10-23", "language": "en", "rating": 5}, {"id": 720743162, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d531598-r720743162-Casa_Vicens-Barcelona_Catalonia.html", "text": "We were able to wander at our own pace in the house and gardens.\nDidn’t feel too busy or rushed.\nBeautiful house and interesting exhibition.", "publishedDate": "2019-10-23", "language": "en", "rating": 5}, {"id": 720651966, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d531598-r720651966-Casa_Vicens-Barcelona_Catalonia.html", "text": "Gaudi's first house is truly magnificent in its own right. It is well preserved and professionally and conscientiously managed as an attraction. Not swamped with visitors as many other Gaudi sites are; a commendable mix of the commercial and of historical preservation. In addition it was well worth having a guided tour - Laura was knowledgeable and helpful - she is a great asset to this organisation. ", "publishedDate": "2019-10-23", "language": "en", "rating": 5}, {"id": 720614417, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d531598-r720614417-Casa_Vicens-Barcelona_Catalonia.html", "text": "Absolutely stunning. Arguably Gaudi's best work. A masterpiece.All this to say it is his first work completed. ", "publishedDate": "2019-10-22", "language": "en", "rating": 5}, {"id": 720611048, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d531598-r720611048-Casa_Vicens-Barcelona_Catalonia.html", "text": "From the inside Casa Vicens was a bit boring compared to Casa Batllo where I came from. However, the architecture is fantastic!! ", "publishedDate": "2019-10-22", "language": "en", "rating": 3}, {"id": 720605780, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d531598-r720605780-Casa_Vicens-Barcelona_Catalonia.html", "text": "One of the highlights of our family visit to Barcelona after my Camino de Santiago walk. Beautiful use of ceramics, glass, ironwork and timber with Moorish influences. Strongly recommend Casa Vicens as an essential part of a Barcelona itinerary.", "publishedDate": "2019-10-22", "language": "en", "rating": 5}, {"id": 720555289, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d531598-r720555289-Casa_Vicens-Barcelona_Catalonia.html", "text": "Visit of the 1rst house built by Gaudí. Very interesting visit. The guides are very nice and helpful. \nThe visit is perfectly adapted for disable people. Even the rooftop. ", "publishedDate": "2019-10-22", "language": "en", "rating": 4}, {"id": 720547730, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d531598-r720547730-Casa_Vicens-Barcelona_Catalonia.html", "text": "Just open to the public since 2017, Casa Vicens represents Gaudi’s earliest works. As impressive and enjoyable as the house itself is, the experience is made even more rewarding with an excellent display of masterpiece works by other contemporary architects in the western world.  Casa Vicens is a visual treat and informative architecture museum at a most reasonable cost. Easy to get to by bus or Metro as well.", "publishedDate": "2019-10-22", "language": "en", "rating": 5}, {"id": 719938113, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d531598-r719938113-Casa_Vicens-Barcelona_Catalonia.html", "text": "Went there after learning it was Gaudi's first design in Barcelona.  What a lovely gem!  Easy to find and wander about. Each room was a treat.  Our ticket even included a snack and drink at the café on-site. Not to be missed.", "publishedDate": "2019-10-20", "language": "en", "rating": 5}, {"id": 719184108, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d531598-r719184108-Casa_Vicens-Barcelona_Catalonia.html", "text": "So beautiful.....you Can NOT imagine....\nI Wish I could live in that House the rest of my life....\nI Will come again.", "publishedDate": "2019-10-17", "language": "en", "rating": 5}, {"id": 719010037, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d531598-r719010037-Casa_Vicens-Barcelona_Catalonia.html", "text": "Looks good. But it is maily outside.  It is so so about the inside decolation.  There are no decolation and only white wall about 50% ", "publishedDate": "2019-10-16", "language": "en", "rating": 3}, {"id": 718964198, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d531598-r718964198-Casa_Vicens-Barcelona_Catalonia.html", "text": "Casa Vicens is one of my favourite houses of Gaudi after my trip to Barcelona this time. The house is beautifully decorated with colorful tiles everywhere with a lot of oriental elements. The overall experience was very pleasant. \n\nHowever, one note is that when we were at one of the balconies, a staff came and told us not to open the window as that was not allowed. We completely have no objection to that policy except that the window was not opened by us at all. But that staff sounded like we were the one opening it and requested us not to do so again. We felt a little offended. That said, the attitude of the staff was not particularly rude.  After we have clarified it was not opened by us she explained it could be dangerous. ", "publishedDate": "2019-10-16", "language": "en", "rating": 5}, {"id": 718951445, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d531598-r718951445-Casa_Vicens-Barcelona_Catalonia.html", "text": "3 years ago we went to all of his other houses and were excited to be able to see his first project that opened a little over a year later. It was lovely inside and out. Not to be missed.", "publishedDate": "2019-10-16", "language": "en", "rating": 5}, {"id": 718945679, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d531598-r718945679-Casa_Vicens-Barcelona_Catalonia.html", "text": "Easy ticket purchase that morning on phone........let us in early.\nNo massive crowds.\nGreat photo op.\nLovely exhibit.\nStaff easy and helpful.\nNice to sit in back courtyard with tea and desert.\nThanks......", "publishedDate": "2019-10-16", "language": "en", "rating": 5}, {"id": 718790028, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d531598-r718790028-Casa_Vicens-Barcelona_Catalonia.html", "text": "I would rate Casa Vicens as good as La Sagrada Familia. Although it is small in comparison, the fact that it was Guadi's first work make this house really interesting. It is his manifesto and really shows all of his thought very well. The best experience comes with a guide; the guide is very knowledgable and explain all the details of his works. After that, when you continue to visit his other works, it will help you to understand more of how he developed the design. You will not have the same experience when you visit Casa Batllo and Casa Mila. The details of this work are hidden in every single corner,  ", "publishedDate": "2019-10-16", "language": "en", "rating": 5}, {"id": 718202971, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d531598-r718202971-Casa_Vicens-Barcelona_Catalonia.html", "text": "Really nice to spend an hour of your day there. Not as impressive as Casa Battlo but still a picturesque building, worth a visit if you have time.", "publishedDate": "2019-10-14", "language": "en", "rating": 5}, {"id": 718182666, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d531598-r718182666-Casa_Vicens-Barcelona_Catalonia.html", "text": "Casa VIcens was worth visiting. We booked our tickets online and spent an hour there admiring Gaudi's genius. ", "publishedDate": "2019-10-14", "language": "en", "rating": 5}, {"id": 718066623, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d531598-r718066623-Casa_Vicens-Barcelona_Catalonia.html", "text": "I really enjoyed visiting this early work by Guadi. The colors & architecture choices were original & unique. His growth & confidence were so early!", "publishedDate": "2019-10-13", "language": "en", "rating": 5}, {"id": 717956038, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d531598-r717956038-Casa_Vicens-Barcelona_Catalonia.html", "text": "Not so crowded as Batllo or Guell, yet very beautiful! I think city of Barcelona must show this off like other Gaudi's masterpieces! Such a (relatively) hidden gem, I would highly recommend!", "publishedDate": "2019-10-13", "language": "en", "rating": 5}, {"id": 717456330, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d531598-r717456330-Casa_Vicens-Barcelona_Catalonia.html", "text": "Gaudi designed this summer retreat in the hills outside Barcelona. Today, of course it’s in the city, but a much quieter neighborhood than most tourist attractions. It’s very different from his later work. Worth seeing.", "publishedDate": "2019-10-11", "language": "en", "rating": 5}, {"id": 717224020, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d531598-r717224020-Casa_Vicens-Barcelona_Catalonia.html", "text": "As a huge Gaudi fan I visited Casa Vicens and was not disappointed. It was interesting to see how different Gaudi's work was at the beginning of his career yet showed signs of his emerging aesthetic. The home has been beautifully restored however it's a pity it no longer exists in its entirety and that much of the original garden has disappeared. Thank goodness what's left has been preserved for historical significance.", "publishedDate": "2019-10-10", "language": "en", "rating": 5}, {"id": 717135168, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d531598-r717135168-Casa_Vicens-Barcelona_Catalonia.html", "text": "With all of the Gaudi nights around Barcelona, You might be overwhelmed but DO NOT MISS Casa Vincens. the first home Gaudi built....Loved every bit of it!!!\n", "publishedDate": "2019-10-10", "language": "en", "rating": 5}, {"id": 717021830, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d531598-r717021830-Casa_Vicens-Barcelona_Catalonia.html", "text": "This is quite difficult to find, down a very narrow street, subsequently there are not many visitors so parking is not so much a problem. You can’t go inside, but can peer through the entrance. It looked great, pity you can’t go inside. We did see a man sitting on his balcony eyeing us as tourists. It must be quite a place to live!", "publishedDate": "2019-10-10", "language": "en", "rating": 4}, {"id": 716992564, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d531598-r716992564-Casa_Vicens-Barcelona_Catalonia.html", "text": "We visited Casa Vicens with our family and found it be a really beautiful house/museum. Unlike a lot of the Gaudi sites, it's not too busy with tourists so you have time to really look at his work. The museum is carefully laid out in such a way as to show the Gaudi architecture at its best, with plenty of seats to allow you to observe the ceilings or other points of interest. The staff made us feel very welcome and there was a very reasonably priced cafe on the ground floor.", "publishedDate": "2019-10-10", "language": "en", "rating": 5}, {"id": 716710096, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d531598-r716710096-Casa_Vicens-Barcelona_Catalonia.html", "text": "the casa Vicens is a little jewel, a Beethoven's First, a fine rose a day before full bloom, and is truly worth a visit.  the more simple setting allows for a more intimate acquaintance with Gaudi's mastery.  we were there in the morning, with just enough people to allow a slow and fluid visit.  and the guides were fantastic, both at the gates and throughout the house, explaining everything and answering every question.", "publishedDate": "2019-10-09", "language": "en", "rating": 5}, {"id": 716610953, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d531598-r716610953-Casa_Vicens-Barcelona_Catalonia.html", "text": "The house is beautiful and has a fascinating history. It's in a side street in Gracia, a bit out of the way and not swamped with visitors. I highly recommend it.", "publishedDate": "2019-10-09", "language": "en", "rating": 5}, {"id": 716586718, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d531598-r716586718-Casa_Vicens-Barcelona_Catalonia.html", "text": "The building is phenomenal.  One of the early work of Gaudi and yet he didn't disappoint us!  The location is easy to find and the staff is very friendly and helpful attending all the questions we have even in English", "publishedDate": "2019-10-09", "language": "en", "rating": 5}, {"id": 716533159, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d531598-r716533159-Casa_Vicens-Barcelona_Catalonia.html", "text": "Gorgeous building. Well organised. There were people stationed at versions areas to explain the key highlights and able to answer questions in various languages. I loved it.", "publishedDate": "2019-10-08", "language": "en", "rating": 5}, {"id": 716521264, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d531598-r716521264-Casa_Vicens-Barcelona_Catalonia.html", "text": "Whether it’s your first or fifth trip to Barcelona, don’t forget to put Casa Vicens on your must-see list. It’s small, manageable, with knowledgeable guides on every floor so a guided tour is not absolutely necessary. ", "publishedDate": "2019-10-08", "language": "en", "rating": 5}, {"id": 716350786, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d531598-r716350786-Casa_Vicens-Barcelona_Catalonia.html", "text": "Wonderful Spain, marvelous CATALUNYA. In Barcelona you could appreciate a lot of attractions, one of my favorite is Casa Vicens (Gaudí). ", "publishedDate": "2019-10-08", "language": "en", "rating": 5}, {"id": 716217528, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d531598-r716217528-Casa_Vicens-Barcelona_Catalonia.html", "text": "A very interesting house! Mix of Arabic and European art! \nThe house that you can see the street till the end through the very narrow windows!\nVery helpful tour guides! With a lot of knowledge! \nHighly recommended!\n", "publishedDate": "2019-10-07", "language": "en", "rating": 5}, {"id": 716154982, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d531598-r716154982-Casa_Vicens-Barcelona_Catalonia.html", "text": "A very interesting visit. The introduction in the courtyard was very informative. Worth visiting to see the origins of Gaudí’s work", "publishedDate": "2019-10-07", "language": "en", "rating": 5}, {"id": 716119679, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d531598-r716119679-Casa_Vicens-Barcelona_Catalonia.html", "text": "This is Gaudi’s first built house, way quieter than the other Gaudi buildings. It is set beside new and quite brutal flats. How they got planning permission is questionable! The house has been completely renovated, or rather restored and the master crafts men and women are to be praised for their painstaking work. What skills! Exhibitions are on view in the more modern half of the house. Great visit.", "publishedDate": "2019-10-07", "language": "en", "rating": 5}, {"id": 715830543, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d531598-r715830543-Casa_Vicens-Barcelona_Catalonia.html", "text": "Casa Vicens is absolutely gorgeous. Amazing to think how Gaudi was so creative and put together such an amazing building. Worth a visit.", "publishedDate": "2019-10-06", "language": "en", "rating": 5}, {"id": 715436974, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d531598-r715436974-Casa_Vicens-Barcelona_Catalonia.html", "text": "Casa Vicens is GORGEOUS, especially from the outside.  The inside decor is just okay, but the outside is definitely beautiful to see. ", "publishedDate": "2019-10-05", "language": "en", "rating": 4}, {"id": 715262768, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d531598-r715262768-Casa_Vicens-Barcelona_Catalonia.html", "text": "We visited Casa Vicens 2-weeks ago and we were not disappointed. It is a beautiful structure, interior and exterior. Again, exhibits Gaudí’s design genius, love of nature and his creativity. ", "publishedDate": "2019-10-04", "language": "en", "rating": 4}, {"id": 714818883, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d531598-r714818883-Casa_Vicens-Barcelona_Catalonia.html", "text": "We had a tour wth excursion. It was great to see how guide interested in history and creativity of Gaudy. The guide told us many inyeresting things about Barselona, architecture, design and construction.  He explain us every detail of the house ( constraction, materials, planning, history and so on). \nIf we speak just about Casa Vicens I should say that ,for my opinion, it is the one of the most interesting and original buildings which was built in the beggining of the 20 centure. \nSo I really recomended you to visit museum.", "publishedDate": "2019-10-02", "language": "en", "rating": 5}, {"id": 714710610, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d531598-r714710610-Casa_Vicens-Barcelona_Catalonia.html", "text": "Our frenchspeaking Gids was very friendly and answer to our questions politely. Very easy to find and accessible with thé public transport.", "publishedDate": "2019-10-02", "language": "en", "rating": 5}, {"id": 714702572, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d531598-r714702572-Casa_Vicens-Barcelona_Catalonia.html", "text": "After visiting some of the Gaudi-houses in the city center, we decided to head for Casa Vicens. Happy thoughts indeed, because this house turned out to be a lot less crowded. This made the visit very enjoyable. Plus the staff was very willing to explain about the different aspects of the house, which really added a lot to the visit. I would therefore highly recommend a visit to this house.", "publishedDate": "2019-10-02", "language": "en", "rating": 5}, {"id": 714668902, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d531598-r714668902-Casa_Vicens-Barcelona_Catalonia.html", "text": "In spite of being Gaudí’s first work, Casa Vicens is a masterpiece. Overwhelming. Highly recommended. Our guide had lots of knowledge.", "publishedDate": "2019-10-01", "language": "en", "rating": 5}, {"id": 714188357, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d531598-r714188357-Casa_Vicens-Barcelona_Catalonia.html", "text": "Really beautiful place for a visit. This is Gaudi’s first major project. It is a weird house yet at the same time normal in relation to his later work.This house  is widely regarded as his manifesto, because he gives an interpretation of his new style.  If you are looking to understand this Catalan master your tour should probably start here.There is a lack of a \"liquid\" line in this building, which Gaudí later made his hallmark. The interior is spectacular, well worth the price of admission.  The staff is helpful and you learn a lot about Gaudi himself. It is a very beautiful building.", "publishedDate": "2019-09-30", "language": "en", "rating": 5}, {"id": 713648648, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d531598-r713648648-Casa_Vicens-Barcelona_Catalonia.html", "text": "One of the most interesting Gaudi houses to view from the outside. It's a bit further out and on a very narrow street but this makes it feel less like a tourist attraction. Didn't go inside but worth 5 mins to see from outside", "publishedDate": "2019-09-28", "language": "en", "rating": 5}, {"id": 713166651, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d531598-r713166651-Casa_Vicens-Barcelona_Catalonia.html", "text": "Beautiful exterior and interior.  It is all in the details.  It was so nice to see the house without masses of people.  Really enjoyed the taking time to enjoy the ambiance, architectural details, and garden.  The seats on the terrace and porch were so comfortable as expected. Clearly he was trying several techniques in this one house that he would later use in his other ones. You could see the influence of his travels and his observations from nature.  Really enjoyed the video how the house was restored painstakingly by experts.  There is a Hofmann cafe there, which has an absolutely delicious mascarpone croissant you have to try!", "publishedDate": "2019-09-26", "language": "en", "rating": 5}, {"id": 713130288, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d531598-r713130288-Casa_Vicens-Barcelona_Catalonia.html", "text": "It is another beautiful building of an architectural visionary. Off the beaten path of Gaudis other masterpieces but should not be missed. ", "publishedDate": "2019-09-26", "language": "en", "rating": 5}, {"id": 712573543, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d531598-r712573543-Casa_Vicens-Barcelona_Catalonia.html", "text": "Gorgeous premises, so much imagination and so much to see! I live in Barcelona for years and was majorly impressed! Worth it 200%!!", "publishedDate": "2019-09-24", "language": "en", "rating": 5}, {"id": 712513204, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d531598-r712513204-Casa_Vicens-Barcelona_Catalonia.html", "text": "The house has been beautifully restored and is a real treat tucked away from the crowds. The exhibits and cafe are great. A lot of effort has been made to ensure the visitor experience is top notch. \n\n", "publishedDate": "2019-09-24", "language": "en", "rating": 5}, {"id": 712500925, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d531598-r712500925-Casa_Vicens-Barcelona_Catalonia.html", "text": "AS the first house Gaudi so impressive and ahead of the times! Loved the way he brought nature into the home with the botanical walls, and lovely , many little verandas.", "publishedDate": "2019-09-23", "language": "en", "rating": 5}, {"id": 712487402, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d531598-r712487402-Casa_Vicens-Barcelona_Catalonia.html", "text": "The house must have been incredible but has suffered from transformations over time. The renovation of what was left is fantastic but the entry is a bit expensive considering what is left to see.", "publishedDate": "2019-09-23", "language": "en", "rating": 3}, {"id": 711749425, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d531598-r711749425-Casa_Vicens-Barcelona_Catalonia.html", "text": "This late night tour was our best exclusive experience in all the tours we had in houses by Gaudí.  The museum was already almost empty and we had all the space for us. \nPerfume Artist Nasevo formulated scents for each one of the rooms that evokes the life of the family Vicens which makes all the nature elements that Gaudí incorporated in every corner of the house come to life.   \nThe exhibition on the upper floors excellently curated and taught us a lot about Gaudí’s creative process.  Thank you to all the wonderful staff and our guide at Casa Vicens,,\n\n", "publishedDate": "2019-09-21", "language": "en", "rating": 5}, {"id": 711735159, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d531598-r711735159-Casa_Vicens-Barcelona_Catalonia.html", "text": "I've wanted to get inside this house for decades.  Beautifully preserved interiors, helpful staff and great interpretive displays made my visit unforgettable", "publishedDate": "2019-09-21", "language": "en", "rating": 5}, {"id": 711676890, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d531598-r711676890-Casa_Vicens-Barcelona_Catalonia.html", "text": "A bit out of the way from the other 3 properties on the Gaudi tour, but with the visit.  An early piece of work that is impressive on both the inside and outside.  The attention to detail, the imagination and the playfulness of the design is amazing.", "publishedDate": "2019-09-21", "language": "en", "rating": 5}, {"id": 711042227, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d531598-r711042227-Casa_Vicens-Barcelona_Catalonia.html", "text": "It was an amazing visit tour. The House is very beautiful, totally in Gaudí style. I loved it. I really advice you!", "publishedDate": "2019-09-18", "language": "en", "rating": 4}, {"id": 710962475, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d531598-r710962475-Casa_Vicens-Barcelona_Catalonia.html", "text": "It was a very informative tour.  If you have the time it is worth the visit. It was interesting seeing and comparing the different works of Antonio Guardi.", "publishedDate": "2019-09-18", "language": "en", "rating": 5}, {"id": 710957170, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d531598-r710957170-Casa_Vicens-Barcelona_Catalonia.html", "text": "The tour was awesome. The inside of the house has been set up perfectly. The theatrical aspect was cool, but not much different from a typically tour (except the complimentary glass of wine). I definitely recommend going inside Casa Amatller! And also trying the hot chocolate from the cafe downstairs! \n\nI actually wish I had been able to do this experience in Spanish, but only English and Catalan were available on the night I could go.\n", "publishedDate": "2019-09-18", "language": "en", "rating": 4}, {"id": 709831922, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d531598-r709831922-Casa_Vicens-Barcelona_Catalonia.html", "text": "Located north of the Gothic quarter in the area known as Gràcia. A very nice building, which showcases Gaudi’s early work. Some aspects of this building can be found in Gaudi’s more famous buildings. ", "publishedDate": "2019-09-15", "language": "en", "rating": 4}, {"id": 709693775, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d531598-r709693775-Casa_Vicens-Barcelona_Catalonia.html", "text": "See this first before his other works. No need to book ahead but we booked online. Very helpful and informative staff. A great exhibition in a significant architectural casa. It is strikingly colourful and ornamental from your first street sighting. Inside is very interesting. An architect way ahead of his time. An easy enjoyable visit and not crowded like his larger works", "publishedDate": "2019-09-14", "language": "en", "rating": 5}, {"id": 708634666, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d531598-r708634666-Casa_Vicens-Barcelona_Catalonia.html", "text": "Wonderful place, the beginning of Gaudi's genuine. Very interesting audio-visual zone. Lot's of materials, history. Definitely worth visiting before it become overcrowded. And it definitely will. ", "publishedDate": "2019-09-10", "language": "en", "rating": 5}, {"id": 708531765, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d531598-r708531765-Casa_Vicens-Barcelona_Catalonia.html", "text": "I came across Casa vicens at the recommendation of my Airbnb host. It’s not nearly as famous as casa Batllo or casa Mila, but I decided to gamble on the 10 euro or so entrance fee. Boy was I pleasantly surprised! I would say that I enjoyed casa Vicens more than its famous cousins. Being designed by Gaudi, it has lots of fine details and a lot less crowd for you to enjoy and appreciate. Staff was generally helpful and explained in each room. But I only wish there were audio guide available. ", "publishedDate": "2019-09-10", "language": "en", "rating": 5}, {"id": 708482393, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d531598-r708482393-Casa_Vicens-Barcelona_Catalonia.html", "text": "The visit was great. The architecture is very interesting, the staff is welcoming and available to explain the history and it is not overcrowded by tourists. I'll definitely go back again.", "publishedDate": "2019-09-10", "language": "en", "rating": 5}, {"id": 708472251, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d531598-r708472251-Casa_Vicens-Barcelona_Catalonia.html", "text": "Delighted to visit this newly opened first Gaudi ... fascinating decor with excellent well informed staff", "publishedDate": "2019-09-10", "language": "en", "rating": 5}, {"id": 708442850, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d531598-r708442850-Casa_Vicens-Barcelona_Catalonia.html", "text": "One of Gaudi's first works. It's not very famous as it has been opened to the pubic only 5 years ago (2014). Very interesting to visit and the guides that are all around the house are very attentive and give you any type of tips you may need. ", "publishedDate": "2019-09-10", "language": "en", "rating": 5}, {"id": 708437012, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d531598-r708437012-Casa_Vicens-Barcelona_Catalonia.html", "text": "Great visit, nice easygoing garden, not to manynpeople. Great to see the first start of Gaudi with inspirational effects : nature , colors and architecture. ", "publishedDate": "2019-09-10", "language": "en", "rating": 4}, {"id": 708141135, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d531598-r708141135-Casa_Vicens-Barcelona_Catalonia.html", "text": "Casa Vicens is quite small but worthwhile if you want to see more Gaudí buildings. This is his first major commission so has special interest. The exterior is Art Nouveau with a Spanish Mudejar twist. It is within walking distance of central Barcelona although not easy to find unless you have a map. You can book tickets (12 Euros) on line to avoid queues although there were none when we visited. Some of the rooms are as they were, others have nothing left. The garden has been greatly reduced in size. It also houses exhibitions inside the house.", "publishedDate": "2019-09-09", "language": "en", "rating": 4}, {"id": 707910416, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d531598-r707910416-Casa_Vicens-Barcelona_Catalonia.html", "text": "With Casa Batllo, Casa Mila and Sagrada Familia being on top of must-see works by Gaudi, Casa Vicens deserves a spot amongst them without a doubt. \n\nIt’s Gaudi’s first house and in this building-museum one can discover more about its historical development & gaze upon its various influences and motives from all over the world that Gaudi incorporated in his work. \n\nI cannot recommend this place enough - it was such a pleasant and calm experience - when I visited, there was only a small number of other visitors and I even had the possibility to enjoy the terrace and balcony for myself. \n\nEach room has a character of its own and should be given enough time to spend in and notice every detail because there is a lot of them! Additionally, there is plenty of innovative souvenirs and works of art in the museum shop. \n\nThis is a must-visit for everyone interested in architecture, arts and history of Barcelona. \nMake sure to stop here when you are in Gracia neighborhood! ", "publishedDate": "2019-09-08", "language": "en", "rating": 5}, {"id": 707062411, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d531598-r707062411-Casa_Vicens-Barcelona_Catalonia.html", "text": "Interesting visit, worth to see if you like arts and craft. Not too crowdly, not in the center area, but next to Gracià, alternative neighbourhood. It's a good place to get lost and enjoy the narrow streets full of restaurants and cosy shops", "publishedDate": "2019-09-05", "language": "en", "rating": 4}, {"id": 706358820, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d531598-r706358820-Casa_Vicens-Barcelona_Catalonia.html", "text": "It was the first house of Gaudi. We avent been inside because of time reasons but it looks great from the outside.", "publishedDate": "2019-09-04", "language": "en", "rating": 4}, {"id": 706306390, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d531598-r706306390-Casa_Vicens-Barcelona_Catalonia.html", "text": "So inspiring! The teacher was very professional and so passionate about the art of ceramic that he could actually transmit that positive and creative vibe to anyone participating.", "publishedDate": "2019-09-03", "language": "en", "rating": 5}, {"id": 705912021, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d531598-r705912021-Casa_Vicens-Barcelona_Catalonia.html", "text": "I had a brilliant time at Casa Vicens, the exhibitions were very interesting and well presented. It is a stunning building and the friendly guides are extremely knowledgeable and happy to share extra information or answer questions in English as well as Spanish. It was an excellent experience. ", "publishedDate": "2019-09-03", "language": "en", "rating": 5}, {"id": 705844376, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d531598-r705844376-Casa_Vicens-Barcelona_Catalonia.html", "text": "This beautifully restored structure shows the beginnings of Gaudi’s genius. It’s not very big, but is full of details that illustrate his creativity. You can walk around on your own, but we chose the guided tour, which was excellent. We also went to see Sagrada Família later in the same day, so had a chance to see the bookends of Gaudi’s career. Highly recommended.", "publishedDate": "2019-09-02", "language": "en", "rating": 5}, {"id": 705802393, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d531598-r705802393-Casa_Vicens-Barcelona_Catalonia.html", "text": "Definitely worth a visit to see the first house Antoni Gaudi designed (not lived in as we had initially understood).  Note: best to take the guided tour - guide was incredibly knowledgeable and spoke fluent English, so she really made the visit worthwhile with lost of little factoids that would have been missed if visiting by oneself.", "publishedDate": "2019-09-02", "language": "en", "rating": 5}, {"id": 705770261, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d531598-r705770261-Casa_Vicens-Barcelona_Catalonia.html", "text": "Worth the visit. Beautiful house and kind staff. You will be speechless with such beautiful details. ", "publishedDate": "2019-09-02", "language": "en", "rating": 5}, {"id": 705768750, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d531598-r705768750-Casa_Vicens-Barcelona_Catalonia.html", "text": "Love the Casa Vicens, bright, cheery, the guides are terrific and willing to basically give mini private tours.  Don't miss the Hofmann cafe either! Wonderful raspberry croissants. ", "publishedDate": "2019-09-02", "language": "en", "rating": 5}, {"id": 705011298, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d531598-r705011298-Casa_Vicens-Barcelona_Catalonia.html", "text": "This is Gaudi’s first house.it was fully restored in 2017. It is located a little off the beaten path but well worth the trip. We were looking to see the interior of a Gaudi house but didn’t want to spend so much money. The museum was very interesting and there were videos to view. There’s even a cafe in the garden where you can have a little snack. Walking there gave us an opportunity to see neighborhoods of Barcelona that we might not have seen otherwise.", "publishedDate": "2019-08-31", "language": "en", "rating": 5}, {"id": 704958465, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d531598-r704958465-Casa_Vicens-Barcelona_Catalonia.html", "text": "The early master piece of Gaudi, showed very different style as his later buildings. The staffs there were very helpful and friendly also. ", "publishedDate": "2019-08-31", "language": "en", "rating": 5}, {"id": 704228239, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d531598-r704228239-Casa_Vicens-Barcelona_Catalonia.html", "text": "My girlfriend and I visited the place and were totally amazed by the architecture. Almost everything there is well designed. We will probably visit Casa Vicens if we visit Barcelona again:)", "publishedDate": "2019-08-29", "language": "en", "rating": 5}, {"id": 704060607, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d531598-r704060607-Casa_Vicens-Barcelona_Catalonia.html", "text": "I would not recommend the private tour. Lack of information and very messy the organization (lots of people in small rooms, not reserved for groups that paid private tour.", "publishedDate": "2019-08-28", "language": "en", "rating": 2}, {"id": 703984159, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d531598-r703984159-Casa_Vicens-Barcelona_Catalonia.html", "text": "Casa Vicens is an interesting building from outside and it is pretty cool inside, but in my opinion not for 20 euros... I think it's better to visit more famous house (like casa batllo) - for almost the same price you'll get more interesting details and interiors. ", "publishedDate": "2019-08-28", "language": "en", "rating": 3}, {"id": 703896560, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d531598-r703896560-Casa_Vicens-Barcelona_Catalonia.html", "text": "Everything went well during our visit. We booked the tickets online, went to Casa Vincens and got in in 5 minutes. Going with two children we could left the buggy at the reception and leave our bag in the boxes (closing with keys). We even got a short presentation in English about the history of Casa Vincens. ", "publishedDate": "2019-08-28", "language": "en", "rating": 5}, {"id": 703869204, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d531598-r703869204-Casa_Vicens-Barcelona_Catalonia.html", "text": "This is one of the most beautiful places in Barcelona and in my opinion Gaudi's best creation. The place is breathtaking and the best part is not a lot of people know of it so there wasn't a line of people waiting and you can take as many pictures as you want without disturbing anyone. \nThe staff are more then willing to help and everyone is super nice.\nThere is a small cafe house on the property which was great and the staff were very friendly.", "publishedDate": "2019-08-28", "language": "en", "rating": 5}, {"id": 703795859, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d531598-r703795859-Casa_Vicens-Barcelona_Catalonia.html", "text": "Absolutely impressive. But, there are a couple of things that would have made the experience perfect: a bit of information on a plate to know which rooms you’re visiting would be handy, and the fact that everything is set by default to Catalan and changes back to it before you have read all the pages is rather annoying.\nI appreciate Catalan language, but I don’t appreciate having to go back to the main menu every time to change it to one I could understand.", "publishedDate": "2019-08-27", "language": "en", "rating": 4}, {"id": 703786242, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d531598-r703786242-Casa_Vicens-Barcelona_Catalonia.html", "text": "Absolutely visionary space and beautifully restored and managed. The temporary exhibition was also very interesting in terms of locating the style in an international context ", "publishedDate": "2019-08-27", "language": "en", "rating": 5}, {"id": 701354917, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d531598-r701354917-Casa_Vicens-Barcelona_Catalonia.html", "text": "Casa Vicens allows one to immerse into the history, the building details and the restoration without facing mass tourism. For us all other Gaudi sites look more like a mega fun fair with mass tourists coming in with buses. The quiet well planned garden, the wonderful gallery with the stunning staircase and the meticulous restoration work let you understand this is a project that the entire team wanted to preserve and respect.\n\nWe have enjoyed a wonderful afternoon in this house and would recommend this place as \nGaudi's No. 1 site to see, especially for visitors that are interested in architectural and interior.", "publishedDate": "2019-08-21", "language": "en", "rating": 5}, {"id": 701309957, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d531598-r701309957-Casa_Vicens-Barcelona_Catalonia.html", "text": "We went there on a Monday, it was not crowded and the entry fee was reduced to 10Euros.  It was worth the full fee, when one understands the renovations that were required.  This just opened up two years ago.  The information on the placards and the movie were given in English too, which was very well done.  We highly recommend this UNESCO World Heritage Site!", "publishedDate": "2019-08-20", "language": "en", "rating": 5}, {"id": 701289331, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d531598-r701289331-Casa_Vicens-Barcelona_Catalonia.html", "text": "Definitely worth a visit, well organized and Gaudi's work is amazing, as always. Nice exhibitions on the building and restoration.", "publishedDate": "2019-08-20", "language": "en", "rating": 5}, {"id": 701250452, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d531598-r701250452-Casa_Vicens-Barcelona_Catalonia.html", "text": "The place is gorgeous and the guided tour helps to understand better each room and also the intention of Gaudi with this project. ", "publishedDate": "2019-08-20", "language": "en", "rating": 5}, {"id": 701205046, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d531598-r701205046-Casa_Vicens-Barcelona_Catalonia.html", "text": "It is a recently refurbished house, the first of Gaudi's work. Was added in the visiting tour in late 2017. The guides are really nice and provide tons of information. It is definitely a must see. Also go for the guided tour, it is worth the extra, but book in advance, tours are limited to 12 persons. ", "publishedDate": "2019-08-20", "language": "en", "rating": 5}, {"id": 700066327, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d531598-r700066327-Casa_Vicens-Barcelona_Catalonia.html", "text": "It is incredible that someone can do such a magnificent project as its first project. a beautiful house with very interesting ideas. It is important to understand that it was done by a young person and than you realize how big Gaudi was.", "publishedDate": "2019-08-17", "language": "en", "rating": 5}, {"id": 698410166, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d531598-r698410166-Casa_Vicens-Barcelona_Catalonia.html", "text": "The house has an interesting history and backstory. I recommend the guided tour. Our tour guide spoke English really well and his descriptions made us understand Gaudi's reasoning behind each detail of the house. ", "publishedDate": "2019-08-13", "language": "en", "rating": 5}, {"id": 698340415, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d531598-r698340415-Casa_Vicens-Barcelona_Catalonia.html", "text": "And little bit expensive for what it is. Please do something for the central stairs! But Gaudí anyway so...", "publishedDate": "2019-08-12", "language": "en", "rating": 2}, {"id": 696901458, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d531598-r696901458-Casa_Vicens-Barcelona_Catalonia.html", "text": "I loved this place it was so quiet and tranquil away from the busy streets.  The building itself is so colourful and the interior is just gorgeous.  If you have a phone you can get the guide on there.  I love pattern and colour so this was right up my street.  You can grab a drink or a bite to eat in the courtyard as well.", "publishedDate": "2019-08-08", "language": "en", "rating": 5}, {"id": 696683882, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d531598-r696683882-Casa_Vicens-Barcelona_Catalonia.html", "text": "I'm a Barcelona local and I've never been in Casa Vicens before: it was great! I really enjoyed the experience as the place is so beautiful and all the staff is willing to solve any doubt you have. They explained us all the story of the house and whenever we felt a bit lost, they were there to help us. I would totally recommend it. ", "publishedDate": "2019-08-07", "language": "en", "rating": 5}, {"id": 696560044, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d531598-r696560044-Casa_Vicens-Barcelona_Catalonia.html", "text": "We enjoyed Casa Vicens without the volume of tourists usually associated with a Gaudi building. The tour guide was very good and provided great insight into the building. Highly recommend a visit.", "publishedDate": "2019-08-07", "language": "en", "rating": 5}, {"id": 695983569, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d531598-r695983569-Casa_Vicens-Barcelona_Catalonia.html", "text": "The outside is better than the inside. If you want to save a few euros just walk by the building as I was most impressed with the outside and maybe the roof. The inside rooms are mostly empty rooms with displays and a video loop of the story behind the building playing in one of the rooms.", "publishedDate": "2019-08-06", "language": "en", "rating": 4}, {"id": 695516327, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d531598-r695516327-Casa_Vicens-Barcelona_Catalonia.html", "text": "My favourite of Gaudi’s buildings bar the Sagrada Familia. The vicens is colourful, exciting and vibrant to look at. Also it’s not as busy as other buildings as it’s out of the way slightly so guaranteed a good photo ", "publishedDate": "2019-08-04", "language": "en", "rating": 5}, {"id": 695301144, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d531598-r695301144-Casa_Vicens-Barcelona_Catalonia.html", "text": "Beautiful house that we learnt was Gaudi’s first house. Not as large as casa Batlo or Mila, but also way less people waiting to get in plus cheaper prices", "publishedDate": "2019-08-03", "language": "en", "rating": 5}, {"id": 695216571, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d531598-r695216571-Casa_Vicens-Barcelona_Catalonia.html", "text": "A little harder to get to than some of the other Gaudi works but still worth the trip. Apart from the architecture and decor, there are also a number of 3D models to see and a film. There is a lift to access all floors including the roof.\n\nThis is included in the Barcelona Pass.", "publishedDate": "2019-08-03", "language": "en", "rating": 4}, {"id": 695133817, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d531598-r695133817-Casa_Vicens-Barcelona_Catalonia.html", "text": "Amazing insipration, and amazing place! In my opinion worth a visit, even though you have to pay for entrance. You get to learn a bit about Gaudi and watch a lil short film inside!", "publishedDate": "2019-08-03", "language": "en", "rating": 5}, {"id": 695126885, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d531598-r695126885-Casa_Vicens-Barcelona_Catalonia.html", "text": "If you have extra time in Barcelona, visiting la Casa Vicens is really amazing. A small cozy house with all the spirit of Gaudí. What's more, it is in Gràcia district, a must in Barcelona ( narrow streets, lots of restaurants and night life ... ) ", "publishedDate": "2019-08-03", "language": "en", "rating": 5}, {"id": 694707854, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d531598-r694707854-Casa_Vicens-Barcelona_Catalonia.html", "text": "I have been living in Barcelona for 3 years now and so have visited many of the Gaudi houses and museums. I had high expectations for the interior of the property as I was living on the same street as Casa Vicens (carrer de les carolines) and so walked past it almost everyday for a year! However, when I finally got round to going inside I thought we paid a lot for the entrance ticket (€19 bought online, including a refreshment was the only offer). The interior is quite disappointing in comparison to the other Gaudi houses in my opinion and the majority of the house has been converted into a museum so has lost the original architecture. The best thing about Casa Vicens is the exterior without a doubt so I felt a bit cheated being made to pay so much to go inside. ", "publishedDate": "2019-08-01", "language": "en", "rating": 2}, {"id": 694611970, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d531598-r694611970-Casa_Vicens-Barcelona_Catalonia.html", "text": "I think Casa Vicens is my favourite Gaudi. Maybe because I never saw pictures of it before going there but it was just an amazing suprise to see these building hidden away in the quiet neighbourhood of Gracia.", "publishedDate": "2019-08-01", "language": "en", "rating": 5}, {"id": 694517386, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d531598-r694517386-Casa_Vicens-Barcelona_Catalonia.html", "text": "Amazing to see the detail. Hosts were very helpful, bilingual and very knowledgeable.\nAmazing to see.", "publishedDate": "2019-07-31", "language": "en", "rating": 5}, {"id": 694372147, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d531598-r694372147-Casa_Vicens-Barcelona_Catalonia.html", "text": "If you in love of Gaudi, you really must go visite his manifest house ! She is such a beauty !!! If you can, take a guided tour it's so interesting ;)", "publishedDate": "2019-07-31", "language": "en", "rating": 5}]}}]