[{"locationId": 4764185, "name": "Base Elements Urban Art Gallery", "placeType": "ATTRACTION", "reviewListPage": {"reviews": [{"id": 747794274, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d4764185-r747794274-Base_Elements_Urban_Art_Gallery-Barcelona_Catalonia.html", "text": "If you love graffiti, pop art and contemporary artists then this place is a must visit. This was our second visit to this gallery in the last four years and it didn’t disappoint. The owner was so kind to spend time showing us the incredible collections by talented local artists and we even met a couple during our last visit. We talked art, architecture and politics all surrounding the gallery and it’s contents. Our 10 & 12 year old girls also enjoyed the experience both times. Next time.. we’re not leaving empty handed.", "publishedDate": "2020-02-26", "language": "en", "rating": 5}, {"id": 709360859, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d4764185-r709360859-Base_Elements_Urban_Art_Gallery-Barcelona_Catalonia.html", "text": "Always a must visit when in Barcelona!\nReally enjoy the chats with Robert the owner and his staff. Bought an awesome painting last time, reasonably priced and with a „no worries“ shipping to Germany by UPS. Looking forward to the next visit! ", "publishedDate": "2019-09-13", "language": "en", "rating": 5}, {"id": 704264422, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d4764185-r704264422-Base_Elements_Urban_Art_Gallery-Barcelona_Catalonia.html", "text": "I stumbled into Base Elements several years ago and became friends with the owner and a few artists represented there. Now they are family to me. I hope to go back next year! if you are traveling to barcelona add this gallery to your itinerary. ", "publishedDate": "2019-08-29", "language": "en", "rating": 5}, {"id": 692168336, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d4764185-r692168336-Base_Elements_Urban_Art_Gallery-Barcelona_Catalonia.html", "text": "We had visited here with our daughters, they also enjoyed from this event. If you have some time and like a soft visit this place is good choice", "publishedDate": "2019-07-23", "language": "en", "rating": 4}, {"id": 685667826, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d4764185-r685667826-Base_Elements_Urban_Art_Gallery-Barcelona_Catalonia.html", "text": "We walked in and Robert took us on private tour of his wonderful gallery. Highly enjoyable! He knows many of the artists personally and we learned a lot about the evolving world of street art, the art market, and the many styles and media encompassed by urban art.", "publishedDate": "2019-07-01", "language": "en", "rating": 5}, {"id": 685409741, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d4764185-r685409741-Base_Elements_Urban_Art_Gallery-Barcelona_Catalonia.html", "text": "Today is Sunday and this gallery is not normally open on Sundays. However, we headed for the gallery anyway and found Robert, the owner, setting up as he had decided to open on Sundays. Lucky us. \n\nThere is the main floor gallery and the basement. Asked to see the basement. This building is hundreds of years old and Robert has set up a workshop for artists with some unique pieces of art as well as antiques in the basement.\n\nRobert was so accommodating. He explained the artists whose works are represented in the gallery. While we didn’t purchase anything, it was certainly worthwhile to see this remarkable gallery of graffiti artists.\n\nIf you like this review or the photographs, please could you give me a thumbs up? You may also like to check out my reviews of other tourist sites in Barcelona and other Spanish cities, as well as Lisbon, Sintra and Porto in Portugal, as well as cities in South America, southeast Asia, Australia and New Zealand.", "publishedDate": "2019-06-30", "language": "en", "rating": 5}, {"id": 631933867, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d4764185-r631933867-Base_Elements_Urban_Art_Gallery-Barcelona_Catalonia.html", "text": "We stumbled upon this gallery - as one does- after having lunch and ended up staying for 2 hours. Fabulous art stimulate your senses and open thoughtful conversation. This is fuel for your mind and your soul.", "publishedDate": "2018-11-08", "language": "en", "rating": 5}, {"id": 607384379, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d4764185-r607384379-Base_Elements_Urban_Art_Gallery-Barcelona_Catalonia.html", "text": "Lovely gallery, with a really gracious and informative curator. Picked up a really nice piece of Francisco!", "publishedDate": "2018-08-17", "language": "en", "rating": 5}, {"id": 604929002, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d4764185-r604929002-Base_Elements_Urban_Art_Gallery-Barcelona_Catalonia.html", "text": "Whilst in the gothic quarter made a point of visiting this gallery thanks to trip advisor reviews I had read. Very welcoming proprietor very open and provided context to artists and themptied works on display also explained to my girlfriend and son the techniques used in the creation of some of her pieces.  Also a delight to see a local artist at work with oils in the basement (beautiful work) I would recommend to anyone interested in art and a non-pretentious atmosphere.", "publishedDate": "2018-08-10", "language": "en", "rating": 5}, {"id": 587757182, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d4764185-r587757182-Base_Elements_Urban_Art_Gallery-Barcelona_Catalonia.html", "text": "Made a stop at this small but unique urban art gallery. Bought a few pieces and to me they were reasonably priced and nicely packed for my upcoming travel. The owner was super nice and was more than willing to share the stories behind each art piece. It is also conveniently located in the city center. It is always nice to meet people supporting the local art scene. Kudos!", "publishedDate": "2018-06-15", "language": "en", "rating": 5}, {"id": 578967017, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d4764185-r578967017-Base_Elements_Urban_Art_Gallery-Barcelona_Catalonia.html", "text": "The works vary in medium, style, and scale. None lack in craft and the gentleman working there was very friendly. It's a very fun place to check out and prices are clearly listed.", "publishedDate": "2018-05-09", "language": "en", "rating": 5}, {"id": 574928521, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d4764185-r574928521-Base_Elements_Urban_Art_Gallery-Barcelona_Catalonia.html", "text": "Very creative and deep art! Lots if vibrant colors. I wanted to have all the pieces. Will come back definitely as I could not buy anithing but only soaked the art ..... Highly recommended for art lovers :)", "publishedDate": "2018-04-22", "language": "en", "rating": 5}, {"id": 543469236, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d4764185-r543469236-Base_Elements_Urban_Art_Gallery-Barcelona_Catalonia.html", "text": "Not what i was expecting when we searched art galleries in the area. This urban art gallery is nothing short of amazing. A must see when visiting Barcelona. It was a pleasure to speak with the owner who provided me & my companions some insight on an artist we all were intrigued about. I'll definitely pay a visit when i return to see the new instillations.", "publishedDate": "2017-11-26", "language": "en", "rating": 5}, {"id": 494347846, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d4764185-r494347846-Base_Elements_Urban_Art_Gallery-Barcelona_Catalonia.html", "text": "This ia an amazing gallery with an incredible collection of \"urban art\"! If you want high end graffitti to hang in your home this place is not to be missed! I loved the selection, a huge range of artists and styles. If I lived closer I could EASILY have bought a few pieces. And the owner was so nice, we kept him late which he didn't even mention. He told us the whole history of Barcelona street art, it was fascinating. If you are nearby make sure to check it out!", "publishedDate": "2017-06-19", "language": "en", "rating": 5}, {"id": 471924276, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d4764185-r471924276-Base_Elements_Urban_Art_Gallery-Barcelona_Catalonia.html", "text": "Me gustó mucho ver obras de ART IS TRASH, SM 172, AKORE, BTOY... \n\nGreat gallery to discover what's going on in Barcelona streetart right now.", "publishedDate": "2017-04-01", "language": "en", "rating": 5}, {"id": 393255199, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d4764185-r393255199-Base_Elements_Urban_Art_Gallery-Barcelona_Catalonia.html", "text": "This is a very cool art gallery with contemporary and street artists from Barcelona. The work spans a range of styles but is all quite good at reasonable prices. The owner is very knowledgable about the local art scene. Definitely worth a stop in Barcelona.", "publishedDate": "2016-07-16", "language": "en", "rating": 5}, {"id": 381695103, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d4764185-r381695103-Base_Elements_Urban_Art_Gallery-Barcelona_Catalonia.html", "text": "beautiful pieces and a wonderfol place, and very pleasent people as well. takes about 5 minutes and leaves you with a great immpression", "publishedDate": "2016-06-11", "language": "en", "rating": 5}, {"id": 376408564, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d4764185-r376408564-Base_Elements_Urban_Art_Gallery-Barcelona_Catalonia.html", "text": "It feels like you are entering into someones living room, with the relaxed setting. Lots of colorful paintings, prints and even some merch with handmade art from the artist displayed there. Check it out!", "publishedDate": "2016-05-25", "language": "en", "rating": 5}, {"id": 355976522, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d4764185-r355976522-Base_Elements_Urban_Art_Gallery-Barcelona_Catalonia.html", "text": "This is always a good visit when I'm in barcelona...any time you will find some new atrworks from diferent artists....very interesting", "publishedDate": "2016-03-16", "language": "en", "rating": 4}, {"id": 326521998, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d4764185-r326521998-Base_Elements_Urban_Art_Gallery-Barcelona_Catalonia.html", "text": "Stumbled on this gallery by chance and spent ages learning about the best street artists of Barcelona. One of the best things we did whilst visiting this city!", "publishedDate": "2015-11-13", "language": "en", "rating": 5}, {"id": 317332622, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d4764185-r317332622-Base_Elements_Urban_Art_Gallery-Barcelona_Catalonia.html", "text": "I loved my experience in this gallery, Robert, the curator and owner, had a fantastic selection of art, most with a great street art vibe. I can highly recommend this gallery to view, or to purchase from. The gallery itself is absolutely amazing to view, and I assure you that I could not leave without purchasing something of my own.", "publishedDate": "2015-10-09", "language": "en", "rating": 5}, {"id": 315800006, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d4764185-r315800006-Base_Elements_Urban_Art_Gallery-Barcelona_Catalonia.html", "text": "Excellent local art. The owner, Robert, was very helpful, clearly passionate, and had so many interesting stories to tell. He spent quite a bit of time with us, and we ended up purchasing a few pieces which he is shipping back to us in the US.\n\nA must-see for any urban art collector, or anyone who likes to support local artists.", "publishedDate": "2015-10-03", "language": "en", "rating": 5}, {"id": 312826115, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d4764185-r312826115-Base_Elements_Urban_Art_Gallery-Barcelona_Catalonia.html", "text": "I gave a 4* rating as the artwork was cool, but this is basically a shop, not a gallery. From the amazing reviews I thought I'd check it out, but it was very cramped, so I felt uncomfortable looking at the work, and no one came to greet us even though the bell rung when we went in the shop? Soon left after a quick look at the work.", "publishedDate": "2015-09-22", "language": "en", "rating": 4}, {"id": 297217378, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d4764185-r297217378-Base_Elements_Urban_Art_Gallery-Barcelona_Catalonia.html", "text": "In the famous old part of Barcelona, Barrio gótico, you will find many small and beautiful streets.  We, family of 5, found completely by accident this fantastic (Urban) Art Galery \"Base Elements\" . \nThe owner, Robert Burt, explained with passion and love about all the works he had in his gallery. The Gallery is unique and so is Robert. The time we spent in his gallery have been worth every second of it. Our children 13,16,and 17 were so interested about all  \nRobert explained concerning the fantastic ART he showed us.\nWe all learned a lot about the exiting world of graffiti and the interesting work these great artists make.\nThanks Robert!", "publishedDate": "2015-08-09", "language": "en", "rating": 5}, {"id": 278793739, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d4764185-r278793739-Base_Elements_Urban_Art_Gallery-Barcelona_Catalonia.html", "text": "We try to buy local art in cities we visit so we've stopped into quite a few galleries. We were immediately impressed with the bold artwork & then with Roberts enthusiasm. We Bought a peice & very excited to enjoy it at home!", "publishedDate": "2015-06-08", "language": "en", "rating": 5}, {"id": 277638074, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d4764185-r277638074-Base_Elements_Urban_Art_Gallery-Barcelona_Catalonia.html", "text": "We were told this gallery is home to around 12 local artists. The works of art range from low to high budgets well worth a look", "publishedDate": "2015-06-03", "language": "en", "rating": 4}, {"id": 274839738, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d4764185-r274839738-Base_Elements_Urban_Art_Gallery-Barcelona_Catalonia.html", "text": "Four of us were having a morning coffee when the man next to us began chatting in an American accent.  Turned out he was from San Diego CA, where various members of my extended family have lived since 1953, and that he was the owner of Base Elements.  We stopped in later that day and bought an original by Francisco de Pajaro, an artist who deserves to be seen, admired and supported.  Thank God for people like Robert.", "publishedDate": "2015-05-26", "language": "en", "rating": 5}, {"id": 272009867, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d4764185-r272009867-Base_Elements_Urban_Art_Gallery-Barcelona_Catalonia.html", "text": "If you like street art, intensive colours and you have a sense of humour, enter this gallery. You won't regret ;)", "publishedDate": "2015-05-14", "language": "en", "rating": 5}, {"id": 269590208, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d4764185-r269590208-Base_Elements_Urban_Art_Gallery-Barcelona_Catalonia.html", "text": "We stopped in here to check out the art.  We were given a great tour with detail descriptions of the art pieces, including some information and history about their artists.\n\nThank you!", "publishedDate": "2015-05-02", "language": "en", "rating": 5}, {"id": 266789516, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d4764185-r266789516-Base_Elements_Urban_Art_Gallery-Barcelona_Catalonia.html", "text": "Robert explained the Barcelona street art scene in a very engaging manner! He was Refered to us by Mike who gives Street Style walking Tours and both were great. I feel like we received a great intro and understanding to the graffiti scene in BNC and look forward to making several purchases! Thanks !", "publishedDate": "2015-04-20", "language": "en", "rating": 5}, {"id": 265831647, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d4764185-r265831647-Base_Elements_Urban_Art_Gallery-Barcelona_Catalonia.html", "text": "What a nice guy, Robert, the owner is. We visited the gallery on the spur of the moment and were so pleased we did. His knowledge of  'Urban Art' is extensive only overtaken by his enthusiasm. We must have spent a good hour in his gallery and I left having learned much and with the full intention of purchasing something in the near future. If you're even slightly interested I highly reccommend a visit.", "publishedDate": "2015-04-15", "language": "en", "rating": 5}, {"id": 251643377, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d4764185-r251643377-Base_Elements_Urban_Art_Gallery-Barcelona_Catalonia.html", "text": "We made this gallery visit part of our trip, and we were extremely pleased we did, incredible work by talented artists, Robert the curator, is passionate about his work and the artists that he represent, which is infectious. Robert took the time to show us his studio and various artefacts, the art work was simply stunning. Needless to say we bought a piece, looking forward to receiving it. we visit Barcelona regularly and will make this a regular stop.", "publishedDate": "2015-01-29", "language": "en", "rating": 5}, {"id": 248616776, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d4764185-r248616776-Base_Elements_Urban_Art_Gallery-Barcelona_Catalonia.html", "text": "Visiting Base Elements Gallery was probably the highlight of my week in Barcelona. The art works are amazing and the gallery adds another dimension to the dynamic street art scene in Barcelona. Rob, the owner,  is one of the most passionate gallery directors I've ever met and he is happy to share his knowledge on all his works. Not to be missed for anyone looking for a connection to contemporary Barcelona.  \n\n", "publishedDate": "2015-01-10", "language": "en", "rating": 5}, {"id": 223727059, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d4764185-r223727059-Base_Elements_Urban_Art_Gallery-Barcelona_Catalonia.html", "text": "I really love street art but Ive never been to a gallery where I've loved it so much. Part of that is due to the works on display - an absolute feast of upcoming and some slightly more established artists. But the other part is due to the owner. Robert is such a chilled and friendly guy, who has an absolute passion for street art. It was a pleasure talking to him and I see reading the reviews others were fortunate to enjoy the same experience. Not only does he have a great eye for brilliant art. But he also has an amazing passion too and is clearly doing a great job supporting and promoting artists.  Rob I take my hat off to you. And will hopefully become a new customer very soon!", "publishedDate": "2014-08-22", "language": "en", "rating": 5}, {"id": 218855868, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d4764185-r218855868-Base_Elements_Urban_Art_Gallery-Barcelona_Catalonia.html", "text": "amazing gallery, had a guided tour in front and stopped over there... Now we've got a complete different view on all those pics and tags and things on the street. Burt is brilliant in explaining and giving some background information bout the artists.\n\nThank you, Burt", "publishedDate": "2014-08-01", "language": "en", "rating": 5}, {"id": 216779624, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d4764185-r216779624-Base_Elements_Urban_Art_Gallery-Barcelona_Catalonia.html", "text": "I only recently have started to have an interest in street art through a friend of mine.  I saw this place on Trip Advisor and as we were just a few minutes away we thought we would check it out. Wow!  We have just come out of there and I had goosebumps thinking about the art.  The owner made me feel comfortable as I know very little about art.  It's a must see while you are in Barcelona.  I never bought anything this time but will definitely be buying in the future.  Go and check it out! ", "publishedDate": "2014-07-22", "language": "en", "rating": 5}, {"id": 212569725, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d4764185-r212569725-Base_Elements_Urban_Art_Gallery-Barcelona_Catalonia.html", "text": "I found the place on trip advisor before heading to Barcelona. Made sure to find my way there once I got in. totally worth it. The artist Robert and his wife a really nice, Had a long chat and brought a few small pieces done by LA Monix. Would have love to get something big but baggage issues. Anyway a must visit.", "publishedDate": "2014-06-29", "language": "en", "rating": 5}, {"id": 191469458, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d4764185-r191469458-Base_Elements_Urban_Art_Gallery-Barcelona_Catalonia.html", "text": "I have to say this gallery was phenomenal.  There were lots of quality pieces on display particularly from up and coming artists.  I left with three original pieces for a very reasonable price.  I've never had so much fun at a gallery before, Robert (the owner) and I must have chatted for well over an hour.  Regrettably,  I waited until the last minute to swing by.  Don't make the same mistake, visit early you will not be disappointed!", "publishedDate": "2014-01-20", "language": "en", "rating": 5}, {"id": 190299212, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d4764185-r190299212-Base_Elements_Urban_Art_Gallery-Barcelona_Catalonia.html", "text": "We fell in love with the urban art scene in Barcelona so we wanted to visit Base Elements Gallery!  Robert, the owner is amazing and we were able to take a graffiti art class from him for the afternoon with our 5 kids!  It was an unforgettable experience!", "publishedDate": "2014-01-09", "language": "en", "rating": 5}, {"id": 187743716, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d4764185-r187743716-Base_Elements_Urban_Art_Gallery-Barcelona_Catalonia.html", "text": "Really cool collection of art.  I must have looked through the window a dozen times and started making excuses to walk past the shop.\n\nIve never found art i click with quite like graffiti art, and ive never found a gallery i like quite like this. \n\nIn short, Barcelona's got a wicked street-art vibe and culture and this place showcases it really well. Check it out and dont forget to go downstairs to see the extra pieces!  Store owner's a really good guy too.", "publishedDate": "2013-12-15", "language": "en", "rating": 5}, {"id": 183112098, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d4764185-r183112098-Base_Elements_Urban_Art_Gallery-Barcelona_Catalonia.html", "text": "Base Elements was the highlight of my two weeks in Spain. Seriously, you have to visit. Learning about street art in Barcelona is a window into the city of today that long lines to tourist activities will never give you. I learnt so much about the brilliant artists through viewing the works that are displayed in this extraordinary gallery. Robert is someone clearly committed to supporting artists in this beautiful city. As an Australian living in China I have traveled a lot and cannot recommend this highly enough. Thanks Robert.", "publishedDate": "2013-10-31", "language": "en", "rating": 5}, {"id": 182238547, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d4764185-r182238547-Base_Elements_Urban_Art_Gallery-Barcelona_Catalonia.html", "text": "Fabulous gallery with a warm, friendly and interesting host(Robert). Inspirational pieces from from some famous street artists at prices to match all price points. I wish we could have spent more...even had the good fortune of witnessing btoy at work- check out her work if u get a chance.\n\nKeep up the good work Robert and Monica!", "publishedDate": "2013-10-24", "language": "en", "rating": 5}, {"id": 181919818, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d4764185-r181919818-Base_Elements_Urban_Art_Gallery-Barcelona_Catalonia.html", "text": "I live in Barcelona and this is my favorite gallery in this city. I've long admired Robert's eye for art since I stepped into his gallery when I first arrived in Barcelona 8 years ago. If you like urban art, this should be your destination...in a great part of town (you can swing by after seeing the Cathedral and Plaza St. Jaume -- it's right behind it) Robert's gallery is covered floor to ceiling with striking and original pieces, and he's got boxes of small prints, some by famed graffiti artists like Pez that are really affordable and fun to browse through. I always find that I find something original that speaks to me in his collection of art, in contrast to other places that I've walked in and out of because they just felt too commercial. Highly recommend this great gallery.", "publishedDate": "2013-10-22", "language": "en", "rating": 5}, {"id": 180445846, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d4764185-r180445846-Base_Elements_Urban_Art_Gallery-Barcelona_Catalonia.html", "text": "Just arrived in Barcelona, with no thought about art we stumbled across Base Elements Urban Art Gallery, the first thing I noticed was some paintings of a happy fish!! \n\nI talked with Robert and he showed me some of the different works by el Pez, and I couldn't forget about them after we left the shop.\n\nDuring our week in Barcelona we saw several of El Pez pieces on doors and walls around the town and I knew I couldn't go home without one of my own!!!\n\nSo the evening before departure I went and bought a 35 by 35 cm piece of original el Pez graffiti :-)\nI am so happy to have it in my home and can't stop smiling every time I look at it.\n\nThanks to Robert for his patience showing me all the different paintings in his gallery, I know that I will come back there next time I'm in Barelona", "publishedDate": "2013-10-10", "language": "en", "rating": 5}, {"id": 180270194, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d4764185-r180270194-Base_Elements_Urban_Art_Gallery-Barcelona_Catalonia.html", "text": "By accident we found this gallery and we stopped by to see the art. Robert Burt him self was in and was inspiring, patient and helpful. Even though we were only browsing Robert was very kind to us, and he was an excellent storyteller. I fell in love with so much of his artwork and if money was no issue a container was now on its way to the USA loaded with beautiful art. Don't miss this amazing gallery, if you are visiting Barcelona.", "publishedDate": "2013-10-08", "language": "en", "rating": 5}, {"id": 179731420, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d4764185-r179731420-Base_Elements_Urban_Art_Gallery-Barcelona_Catalonia.html", "text": "After reading about Base Elements on-line I could not believe my luck when I accidentally found this gallery.\nThe owner, Robert Burt was friendly & very informed on all the urban art he stocked.\nThe more I browsed the more I liked but eventually purchased a Btoy numbered print, a Pez print & another jazz musician print (artist name escapes me). My 21 & 23 year old sons are gonna love them!\nRobert was very careful in packaging them to safely travel back with me to Australia.\nThoroughly recommend this gallery, well worth the trouble to track it down.", "publishedDate": "2013-10-04", "language": "en", "rating": 5}, {"id": 179722293, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d4764185-r179722293-Base_Elements_Urban_Art_Gallery-Barcelona_Catalonia.html", "text": "Stopped by this great gallery while doing the Barcelona Street Art Tour (excellent tour btw). Lovely work by great urban/street artists.. You can see their work through the whole city, but Robert seems to be able to have the artists 'gallery' work. The gallery in itself is also beautiful with also a large basement which shows even more work.. Definitely  gonna hop by on my next visit to Bcn..", "publishedDate": "2013-10-04", "language": "en", "rating": 5}, {"id": 177874747, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d4764185-r177874747-Base_Elements_Urban_Art_Gallery-Barcelona_Catalonia.html", "text": "Robert Burt was in when me and my wife stopped in. He was very helpful and showed us a lot of different artist who he knew a lot about. The artwork and choice of artists were amazing. we wished we had more time but we were only in Barcelona for one night and had a lot on our list. Every time we come back though we will stop in. Must stop in, even for a couple minutes. Thanks again Robert if your reading this!", "publishedDate": "2013-09-20", "language": "en", "rating": 5}]}}]