[{"locationId": 4688353, "name": "Arts Santa Monica", "placeType": "ATTRACTION", "reviewListPage": {"reviews": [{"id": 515730042, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d4688353-r515730042-Arts_Santa_Monica-Barcelona_Catalonia.html", "text": "Not exactly green but a welcome sanctuary to compliment and enrich the Barcelona experience. The 2017 exhibition includes a lightforms/ soundforms installation by Brian Eno. Time to lay back and let the experience take you where it may; possibly to english landscapes but it might depend on where you mind has been after the Ramblas. Pleasantly suprised to find that it was free.", "publishedDate": "2017-08-20", "language": "en", "rating": 5}, {"id": 504805272, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d4688353-r504805272-Arts_Santa_Monica-Barcelona_Catalonia.html", "text": "Historical building refurbished in order to be an arts venue. These days it hosts a Brins Eno exhibition, 77 Billion Paintings. The place is great, and Eno's installation too. It is worth more than one visit.", "publishedDate": "2017-07-23", "language": "en", "rating": 5}, {"id": 418077692, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d4688353-r418077692-Arts_Santa_Monica-Barcelona_Catalonia.html", "text": "We feel this museum is underappreciated – despite being on La Rambla, at a prime spot, and free to enter, it was not at all crowded. The exhibits were thought-provoking and inspiring. The feature on Marseille, France in particular. You might think that, with this museum title, that it’s a stuffy, religion-focused place but that is not at all the case. There was even a wall of newspaper clippings including some mocking of prominent politicians, including the current GOP presidential nominee. Quite entertaining. Definitely worth a visit. Be aware though – most signage is not translated into English.", "publishedDate": "2016-09-13", "language": "en", "rating": 4}, {"id": 324087728, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d4688353-r324087728-Arts_Santa_Monica-Barcelona_Catalonia.html", "text": "This is the prefect art center for a visit on a Sunday, when the ramblas are more quite. This old monastery is renovated into an contemporary art centre/space housing traveling exhibitions on all forms of art, mixed media, etc.\n\nJust recently we visited the very quirky exhibition on puppets and puppeteers. The scenography will appeal to yound and old and is above all very original.\n\nAnd on Sunday morning from 11 'o clock the entrance is free!\n\n", "publishedDate": "2015-11-03", "language": "en", "rating": 4}, {"id": 203767832, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d4688353-r203767832-Arts_Santa_Monica-Barcelona_Catalonia.html", "text": "When you get to Barcelona go to a tourist info booth and ask for the current Arts trail Map.   Start following this map being sure that you end at Santa Monica.  Having been through so much history and culture both traditional and modern you find that by ending at Santa Monica you will bring all this history to closure.  I attended the Systematurgica Exhibition and it was well worth it.\nThe curation at the gallery is excellent and the capacity the Arts Complex has for Modern Visual Art and Performance Art is quite innovative.  There was also an exhibition of the development of Spanish Comic Book Creation which was excellent.   Don't miss this exhibition space if you get to Barcelona.", "publishedDate": "2014-05-02", "language": "en", "rating": 5}, {"id": 175686830, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d4688353-r175686830-Arts_Santa_Monica-Barcelona_Catalonia.html", "text": "Located on the famous Rambla, this is a great space for contemporary art but also science and thought. I visited the \"Pure Views\" exhibition on contemporary Chinese art and it was a great experience.", "publishedDate": "2013-09-04", "language": "en", "rating": 5}]}}]