[{"locationId": 244200, "name": "Museu Maritim de Barcelona", "placeType": "ATTRACTION", "reviewListPage": {"reviews": [{"id": 746999078, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d244200-r746999078-Museu_Maritim_de_Barcelona-Barcelona_Catalonia.html", "text": "Really interesting museum with video shows and english audio guidance. One can spend easily several hours exploring maritime history.", "publishedDate": "2020-02-23", "language": "en", "rating": 5}, {"id": 744498761, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d244200-r744498761-Museu_Maritim_de_Barcelona-Barcelona_Catalonia.html", "text": "If you love the ocean and boats the Maritime Museum is a must see in Barcelona. The building itself is quite incredible, being a naval and shipbuilding facility for several hundred years. But even more spectacular is the huge sailing and rowing galleon that plied the Mediterranean. It is amazing and is surrounded by great interpretive displays. There are several large galleries depicting other aspects of the maritime history of Barcelona. All a great experience and very well presented. Comes right up to emigrant voyages to the New World and present day cruise lines. ", "publishedDate": "2020-02-11", "language": "en", "rating": 5}, {"id": 743013868, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d244200-r743013868-Museu_Maritim_de_Barcelona-Barcelona_Catalonia.html", "text": "Wow! I spent 4 hours in this museum marveling over the amazing interactive displays. Historical pieces. The reconstituted boat from the 16th century and the building itself ! Worth a trip for anyone interested in boats trade and how a port cities functions! Amazing transition from old times to now and you feel like you’re transported back through time just by being in the building itself. ", "publishedDate": "2020-02-04", "language": "en", "rating": 5}, {"id": 737813509, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d244200-r737813509-Museu_Maritim_de_Barcelona-Barcelona_Catalonia.html", "text": "This was such a cool museum. As someone who grew up by the water and sailing this was a must. The building alone is worth the cheap admissions, I was blown away with the amount of interactive exhibits they had too. 4 or 5 small movie theaters, a life sized galley ship, and much much more. I’m surprised this isn’t rated higher for things to do in Barcelona. ", "publishedDate": "2020-01-08", "language": "en", "rating": 5}, {"id": 735621512, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d244200-r735621512-Museu_Maritim_de_Barcelona-Barcelona_Catalonia.html", "text": "Really interesting museum and wow, what a building! It has a lot of history in the building alone. Also, it’s free to enter on sundays between 3&7pm", "publishedDate": "2019-12-30", "language": "en", "rating": 5}, {"id": 731318968, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d244200-r731318968-Museu_Maritim_de_Barcelona-Barcelona_Catalonia.html", "text": "Usually when you go to a museum, it is to see the exhibits inside. In the case of the maritime museum, the building itself is part of the exhibit. It was constructed to build galleys, and is a fascinating building. There are a number of very fine models and artifacts, and a replica full size galley. Well worth a visit.", "publishedDate": "2019-12-08", "language": "en", "rating": 5}, {"id": 728409217, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d244200-r728409217-Museu_Maritim_de_Barcelona-Barcelona_Catalonia.html", "text": "We especially enjoy history museums and their displays.  This is one of the nicest we've been in.  Boats have been nicely restored and displays are well organized, attractive and informative.", "publishedDate": "2019-11-23", "language": "en", "rating": 5}, {"id": 726275423, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d244200-r726275423-Museu_Maritim_de_Barcelona-Barcelona_Catalonia.html", "text": "This is a new museum situated in a very old boat yard. I’m a boat person, so I reveled in the displays, including a full sized replica of a galley (see photo).", "publishedDate": "2019-11-13", "language": "en", "rating": 5}, {"id": 723059894, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d244200-r723059894-Museu_Maritim_de_Barcelona-Barcelona_Catalonia.html", "text": "We were lucky to have the opportunity to visit this museum as part of a reception dinner in this venue. There is a nice collection of small vessels and models. The center piece is a large galley. Impressive!", "publishedDate": "2019-11-01", "language": "en", "rating": 4}, {"id": 722872119, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d244200-r722872119-Museu_Maritim_de_Barcelona-Barcelona_Catalonia.html", "text": "This was just over the road from where we were staying so have it a go. Free for under 17s which was a bonus. We spent a good 2 plus hours there, plus had a ticket to see the ship at the harbour thrown in.", "publishedDate": "2019-10-31", "language": "en", "rating": 5}, {"id": 721961922, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d244200-r721961922-Museu_Maritim_de_Barcelona-Barcelona_Catalonia.html", "text": "For my birthday i wanted an special event and i found a journey sailing on board on Santa Eulàlia pailebot... it was amazing!!! My family & i (with others passengers) were sailing during almost 2 hours, enjoying a sunny day and the sighseeing of Barcelona \nRecommended ❤️", "publishedDate": "2019-10-28", "language": "en", "rating": 5}, {"id": 721738515, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d244200-r721738515-Museu_Maritim_de_Barcelona-Barcelona_Catalonia.html", "text": "What a great museum!!  Focusing on the maritime history of Barcelona, this museum is a joy to visit. Absolutely get the included audio tour. As you walk around it senses when you arrive in a certain area or in front of a specific display and tells you what you’re seeing in your language, complete with music. Really well done!\n\nThe reproduction galleon is the high point of the museum but the large teaching models for ship pilots, history displays, and artifacts from the museum building itself are excellent and unique. It covers 700 years of developments. You need 2-3 hours to see everything and everything is worth seeing. Make a pilgrimage and visit this museum while in Barcelona. Cheers!", "publishedDate": "2019-10-27", "language": "en", "rating": 5}, {"id": 721488825, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d244200-r721488825-Museu_Maritim_de_Barcelona-Barcelona_Catalonia.html", "text": "Let me start by saying we are not usually \"museum people\" when we go on vacation but a friend at home recommended it and since we are boaters we decided to check it out.  We were both very impressed!  It was interesting with a handheld audio tour that moved along with you where you were in the museum which was nice because we could focus on the bits that most interested us without having to sit though parts that were of less interest.  We both felt it was well worth the visit and we learned some history of the area in an engaging way.  Well worth the admission of 10 euros each.", "publishedDate": "2019-10-26", "language": "en", "rating": 5}, {"id": 720123032, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d244200-r720123032-Museu_Maritim_de_Barcelona-Barcelona_Catalonia.html", "text": "Was free after 15.00 hours on Sundays so paid a visit.  Only came to see the replica Galley ship which was very impressive.  The information displays next to the Galley were very informative particularly on the lifes of the crew.\n\nThe queue for the cafeteria was very long so didn't visit.  Also there were 4 ladies toilets and only 1 was working so the queue was also very long", "publishedDate": "2019-10-21", "language": "en", "rating": 3}, {"id": 718226821, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d244200-r718226821-Museu_Maritim_de_Barcelona-Barcelona_Catalonia.html", "text": "First a disclaimer - I hadn't researched what was in the museum before I went there and I was slightly short on sleep so the lack of coherence to the place may have been more a reflection on me.\n\nThere was some fantastic stuff there. The full size galley reconstruction from the battle of Lepanto is worth the entry fee on its own. The medieval shipyard interactive displays got me thinking about how to organise a shipyard (in their time shipyards were the apex of industrial organisation so anyone interested in the history of factories or organisation of labour would find plenty to think about here)\n\nMy only criticism is that the arrangements of the exhibits seemed pretty random to me.  The route I took left me looking at a medieval shipyard one moment, then exhibits related to slavery and steam power, then modern containerisation, then a galley from Lepanto.\n\nThe way it is laid out may appeal to more sophisticated museum goers who don't like being spoon fed. However for me personally I appreciate some structure or unfolding narrative as I go around a museum so I have an historical context for the developments I am looking at, and can see how the changes built upon each other.\n\nIn summary,  a lot of effort had gone into the individual exhibits but perhaps not so much into the overall organisation.", "publishedDate": "2019-10-14", "language": "en", "rating": 3}, {"id": 717947806, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d244200-r717947806-Museu_Maritim_de_Barcelona-Barcelona_Catalonia.html", "text": "We found the Maritime museum very interesting - the story of shipbuilding and its relation to the economic success of Barcelona, really only gets told here. There is a lot of national pride that eminates from this place, and a lot to learn. We spent about an hour - but it got a little long after that. It was a warm day and they really dont have a lot of air exchange/cooling in the building (i know, i know, typical American complaint). The audio tour works really well, but not being a sailor or maritime history enthusiast, got kinda long and technical after awhile. Still a good place to visit for an hour or two.", "publishedDate": "2019-10-13", "language": "en", "rating": 3}, {"id": 715005391, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d244200-r715005391-Museu_Maritim_de_Barcelona-Barcelona_Catalonia.html", "text": "The building is terrific and the displays are very well done. Everything can be seen properly and it is fully anotated. You can spend a long time here if the particular subect fascinates you. It is a very comfortable space. Interesting place and good for a bite and drink", "publishedDate": "2019-10-03", "language": "en", "rating": 4}, {"id": 714996718, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d244200-r714996718-Museu_Maritim_de_Barcelona-Barcelona_Catalonia.html", "text": "We needed to meet up with our guide just across the road from the entrance.  We really just popped in to see what it was like.  We did not find out cost of entry because some sort of festival made it free.\n We spotted the coffee shop & thought we would call in for a coffee & a bun at the end of our visit.\nWe found the museum to be very interesting with most of the displays also being labeled in English.  Many of the little video presentations also had subtitles three languages.\n Benches were dotted about.  A bonus for pensioners legs.\n We were kept interested for our three hour free time.  So much so we did not find time for coffee & a bun.", "publishedDate": "2019-10-03", "language": "en", "rating": 5}, {"id": 713163349, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d244200-r713163349-Museu_Maritim_de_Barcelona-Barcelona_Catalonia.html", "text": "Set in the historic dockyard of Barcelona, the Museu Maritim provides a wonderful setting to showcase the city's long association with the sea and ships. The museum is nice and spacious with plenty of time to view the exhibits with include replica vessels, historic film footage, interactive experiences and photography. Included in the cost of the ticket (10 euro or 8 with a Barcelona Card) is a free audio guide which automatically triggers the commentary. So far so good - but the guide's fault was that you could not override the numbers nor was there any corresponding numbering on any of the exhibits - so if you missed a number on your headset you had no idea how to find it again, That being said, it was an enjoyable trip to kill a morning in the city.", "publishedDate": "2019-09-26", "language": "en", "rating": 4}, {"id": 713122725, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d244200-r713122725-Museu_Maritim_de_Barcelona-Barcelona_Catalonia.html", "text": "This is a magnificent, modern maritime museum located in a historic building which was part of a shipyard. There are many fine small boats, replica ships and models on display.  It is well laid out and very informative.  Even if you have no interest in the sea you should still visit to see the fine building.", "publishedDate": "2019-09-26", "language": "en", "rating": 5}, {"id": 706446629, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d244200-r706446629-Museu_Maritim_de_Barcelona-Barcelona_Catalonia.html", "text": "My second visit after 15 years , I love this place. Found new items on display and I could see that a new area is in preparation . This means that I have to come again sometime soon :)", "publishedDate": "2019-09-04", "language": "en", "rating": 5}, {"id": 699018656, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d244200-r699018656-Museu_Maritim_de_Barcelona-Barcelona_Catalonia.html", "text": "We arrived in Barcelona after having our day in Roses cancelled due to cruise ship being unable to tender the day. \nWe had driven past the Museum before so decided to pay a visit. It was very quite when we arrived but it hadn't been open long. The offer the audio guide free and it helps as you follow through the various galleries. The building itself is very impressive. The old dockyard buildings are huge. Tall vaulted ceilings allow large boats and ships to be displayed. Small rooms on the tour route tell stories of the building of the yards the people who used them and the future for our oceans. Lots of scale models on view and the \"smell of the cargo\" area does hit the senses. Well worth a visit.", "publishedDate": "2019-08-14", "language": "en", "rating": 5}, {"id": 696336366, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d244200-r696336366-Museu_Maritim_de_Barcelona-Barcelona_Catalonia.html", "text": "This maritime museum, set in a shipyard building hundreds of years old, is superb.  I'm a museum professional who studies visitor experience and exhibition design.  This is, hands down, the best maritime museum out of the 20 or so I've visited.  It doesn't numb your brain and tire your feet with 6,000 ship models.  Instead, it tells stories with replicas (one a huge galleon), models, and authentic artifacts.  The audio guide is absolutely flawless in synchronization with your walking tour.  And the building itself will give you goosebumps when you think of all the historic ships that it produced for centuries.  Well-lit, spotlessly clean, great multi-lingual labels, a very nice gift shop and café, and a cool refuge from Barcelona's July heat!  Less than a block from the foot of Las Ramblas - go see it!", "publishedDate": "2019-08-06", "language": "en", "rating": 5}, {"id": 696088782, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d244200-r696088782-Museu_Maritim_de_Barcelona-Barcelona_Catalonia.html", "text": "If you are a true “sea wolf”, you have to visit the museum. Inspirational.\nSundays after 15:00 are free but you might not get an audio guide.", "publishedDate": "2019-08-06", "language": "en", "rating": 4}, {"id": 690569061, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d244200-r690569061-Museu_Maritim_de_Barcelona-Barcelona_Catalonia.html", "text": "Off the tourist trail, interesting history explained and some great reproductions.\nThe guides are very good indeed and well thought out. At €20 for the 3 of use great value.\nNot for young children, I'd say.", "publishedDate": "2019-07-18", "language": "en", "rating": 4}, {"id": 684571728, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d244200-r684571728-Museu_Maritim_de_Barcelona-Barcelona_Catalonia.html", "text": "Very interesting replicas of many types of boats, from those going down the coast to those trading round the Med. and to South America..  Quiet in the morning before school groups arrived.  There is a cafe in the building.", "publishedDate": "2019-06-26", "language": "en", "rating": 5}, {"id": 682265616, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d244200-r682265616-Museu_Maritim_de_Barcelona-Barcelona_Catalonia.html", "text": "This is a good way of utilizing their old shipyard.  I love the replicas that they have created and some of the small boats that they have collected.  Aside from these, they also covered the historical aspect of maritime in Barcelona.  The star of the museum is the full size replica of the Real Gallery.  It is quite beautiful and very exciting to explore.", "publishedDate": "2019-06-17", "language": "en", "rating": 4}, {"id": 680560814, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d244200-r680560814-Museu_Maritim_de_Barcelona-Barcelona_Catalonia.html", "text": "We had a wonderful time especially as it was free on Sunday afternoon from 3pm. Definitely worth a visit, there are some amazing displays, the replica ship in display is amazing.", "publishedDate": "2019-06-10", "language": "en", "rating": 5}, {"id": 677255053, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d244200-r677255053-Museu_Maritim_de_Barcelona-Barcelona_Catalonia.html", "text": "For those of us who like museums, this is a very good one indeed. It re-uses a very old shipbuilding facility. Not only are there boats inside, big ones, too, but state of the art displays -- even sensory experiences like the smell of things maritime. The displays on screens come alive when you approach. Good audio improves the displays. Spanish maritime history is paramount, but it was a prime maritime power.Also an excellent introductory video. The restaurant is first class and open to the public. Worth a long visit.", "publishedDate": "2019-05-28", "language": "en", "rating": 5}, {"id": 674782683, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d244200-r674782683-Museu_Maritim_de_Barcelona-Barcelona_Catalonia.html", "text": "We arrived on International museum day so entry was free. The prices though are reasonable.\nThe museum is  roomy and beautifully set out. The information on the displays has an English translation too which is helpful for non Spanish speakers. Unfortunately the audio was not available and we missed having it. It was difficult to know which route to follow and be sure we hadn't missed any displays. The theatres were great but it was hard to follow the films. Of course the restored ship or perhaps it was a replica was quite a show stopper. Again excellent information.\nThis is a beautiful museum and definitely worth a visit, but with a bit of tweaking so a route through is easy to follow, it would be so much better. Anyone who has a strong interest in shipping and history will enjoy the displays.\nThe attached restaurant is well priced and perfect for coffee afterwards.", "publishedDate": "2019-05-18", "language": "en", "rating": 4}, {"id": 667193858, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d244200-r667193858-Museu_Maritim_de_Barcelona-Barcelona_Catalonia.html", "text": "My wife surprised me when she suggested that we visit this museum while we were in the city, and she chose wisely.\nThe museum is situated in the ship yards, which were built during the middle ages, and the structure itself is worth the price of admission. \nThere are numerous exhibits that show the history of the city's dockyards and shore areas. Although there us a wealth of information it is not too overwhelming. You can see pretty much everything without spending the entire day there.\nThe center piece is a full scale reproduction of Don Juan's war galley from the Battle of Lepanto, the Real, which is absolutely stunning. \nIf you have any interest in maritime history do not miss this museum.", "publishedDate": "2019-04-17", "language": "en", "rating": 5}, {"id": 665273379, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d244200-r665273379-Museu_Maritim_de_Barcelona-Barcelona_Catalonia.html", "text": "At first glance, a maritime museum doesn't seem like a worthwhile visit when there are so many great things to do in Barcelona.  But this was our favorite museum.  There is an audio guide that comes with the reasonably priced admission fee, the exhibits are very interesting and well laid out. All the information is in English as well as Spanish. There's a full-size recreation of a Spanish warship from the 16th century and so much fascinating information about how the crews were treated and Spain's role as the superpower in the 15th-18th centuries.  Loved it. Nice restaurant on site.", "publishedDate": "2019-04-10", "language": "en", "rating": 5}, {"id": 664483471, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d244200-r664483471-Museu_Maritim_de_Barcelona-Barcelona_Catalonia.html", "text": "Visited this museum as my first port of call as I was in Barcelona for research, and the Maritime Museum was a great starting point, full of well-presented information at various levels, for children, tourists and scholars alike. Staff were also friendly and helpful.", "publishedDate": "2019-04-07", "language": "en", "rating": 4}, {"id": 664439641, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d244200-r664439641-Museu_Maritim_de_Barcelona-Barcelona_Catalonia.html", "text": "Been in Barcelona every year since 2007 our first visit here.  Situated near the harbour and Christopher Columbus statue this is a must do.  Fascinating history of Barcelona and all things maritime.  Amazing things to see and stories to read/listen too.  Very efficient electronic guides.  Good visual effects and shows/story telling. ", "publishedDate": "2019-04-07", "language": "en", "rating": 4}, {"id": 663930703, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d244200-r663930703-Museu_Maritim_de_Barcelona-Barcelona_Catalonia.html", "text": "The highlight is the reconstrcution of the galley used by Don Juan of Austria at the battle of Lepanto. The building itself and its history is amazing, and the other exhibits are pretty good. It is a family friendly museum too. Worth while.", "publishedDate": "2019-04-05", "language": "en", "rating": 5}, {"id": 661703396, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d244200-r661703396-Museu_Maritim_de_Barcelona-Barcelona_Catalonia.html", "text": "On our last day we actually had a full day, so wanted to do something for a few hours. We normally do a museum when we go away and for this trip decided on the Maritime Museum.\n\nVery interesting. A lot bigger than it first seems. More to see and do that at first sight, which, is very welcomed by us.\n\nNot only did it include a full history of different ships. It had video stories told by different people who work on the ships (captains, cooks, galley men) and our favorite part - the interactive screens. Here you can do some fun exercises to learn about how to navigate and what different pirates looked like.", "publishedDate": "2019-03-27", "language": "en", "rating": 4}, {"id": 660342792, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d244200-r660342792-Museu_Maritim_de_Barcelona-Barcelona_Catalonia.html", "text": "My husband and I ended up here on the evening that admission is free. I was glad for that but I can tell you that this museum warrants paying admission for as well. The audio guides were awesome! They know where you are at so there is no having to push buttons or anything. You stand in front of a ship and it tells you about it. You go into one of the theaters and it plays right along with the film. I thought this was such a cool feature. This museum is PACKED with information. I learned more than I ever expected to and this ended up being one of my favorite museums in Barcelona! Definitely worth a visit!", "publishedDate": "2019-03-22", "language": "en", "rating": 5}, {"id": 659905771, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d244200-r659905771-Museu_Maritim_de_Barcelona-Barcelona_Catalonia.html", "text": "This museum is housed in a beautiful building with some stunning architecture. An interesting display of the maritime history of Spain with some beautiful and interesting ship models.", "publishedDate": "2019-03-20", "language": "en", "rating": 4}, {"id": 659612104, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d244200-r659612104-Museu_Maritim_de_Barcelona-Barcelona_Catalonia.html", "text": "We have planned to spend Sunday afternoon on the beach, but it was very windy and we decided to try this museum instead and it turned out as the most pleasant surprise!\nFrom 15.00 on Sundays it’s free of charge, othersise it’s €10. During our stay it was literally empty! Maybe 10 visitors in the whole building! We have spent there approx. 2 hours.\nThere are many marine models (several of them in life-size), but what I enjoyed the most was the modern way of presentation - with interactive parts and many short movies. All the information provided were in a short and suggestive form - not overflowing you with tons of historical details, but showing you life of explorers, sailors, slaves on galleys and more. Giving the facts in context of the era. It really caught my attention and we’ve spent there much more time than we expected. I can highly recommend even for kids.", "publishedDate": "2019-03-19", "language": "en", "rating": 5}, {"id": 659437966, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d244200-r659437966-Museu_Maritim_de_Barcelona-Barcelona_Catalonia.html", "text": "This maritime museum, befittingly located near the Plazza Colon in the former old shipyards is beautifully constructed to house a full size 16th century royal war galley, built on 1:1 life scale with very explicit billboards showing the hard life on board, mainly of the convicted and slave rowers, the sailors and and everyone on board. The galley itself which takes the entire main hall is majestic and beautifully reconstructed. The rest of the museum with its various ship models and other artifacts is very interesting and arranged and depicted masterfully. Definitely a must for any maritime history buff. A tip to senior citizens: on Sunday afternoons , after 15:00 hrs, admission is free.", "publishedDate": "2019-03-19", "language": "en", "rating": 4}, {"id": 658996694, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d244200-r658996694-Museu_Maritim_de_Barcelona-Barcelona_Catalonia.html", "text": "It’s a great spot for 90 minutes with modern multi-lingual audio guides included in the entrance. They lead you through the exhibition without entering numbers :-).  Great information in three languages on displays, enough interactive displays for younger ones. Some explanations are a bit political to demonstrate Catalunya‘s stake as a country (using the kingdom of Sicily to throw out the French ;-)).\nInteresting facets about life and history on the sea. In a beautiful ship factory. \nTo revisit. ", "publishedDate": "2019-03-17", "language": "en", "rating": 5}, {"id": 658982829, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d244200-r658982829-Museu_Maritim_de_Barcelona-Barcelona_Catalonia.html", "text": "Very nice but confusing museum with some historically incorrect facts. \nBeautiful model of the flagship of the Battle of Lepanto. \nOtherwise very nice. ", "publishedDate": "2019-03-17", "language": "en", "rating": 3}, {"id": 657383618, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d244200-r657383618-Museu_Maritim_de_Barcelona-Barcelona_Catalonia.html", "text": "As a lover of boats, I rarely pass up a visit to maritime museums, and this is one of the best.  The exhibits are extensive and impressive - especially the galley, the information about them is extensive, and the interactive activities are great for kids", "publishedDate": "2019-03-09", "language": "en", "rating": 5}, {"id": 657023640, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d244200-r657023640-Museu_Maritim_de_Barcelona-Barcelona_Catalonia.html", "text": "This is potentially a great attraction.  The viewed items are great.  The information of the oral guide is very good.  But there is no orientation of the path to follow.  There are no numbers.  If there is a plan of the exibit, we were not offered one.  There were no guards or guides. We had to guess where the exit might be.  With proper management this would be a great attraction.", "publishedDate": "2019-03-07", "language": "en", "rating": 1}, {"id": 653069146, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d244200-r653069146-Museu_Maritim_de_Barcelona-Barcelona_Catalonia.html", "text": "Many interactive activities, very interesting, the kids loved the place and for adults it is a good opportunity to learn about Maritim history in Barcelona ", "publishedDate": "2019-02-17", "language": "en", "rating": 5}, {"id": 653003289, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d244200-r653003289-Museu_Maritim_de_Barcelona-Barcelona_Catalonia.html", "text": "The museum is very impressive, the audio guide is interactive and captivating. Defently worth seeing", "publishedDate": "2019-02-17", "language": "en", "rating": 5}, {"id": 651975677, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d244200-r651975677-Museu_Maritim_de_Barcelona-Barcelona_Catalonia.html", "text": "Great place. Very good value for money.\nEasy to find. Only a short walk from Columbus monument. Think it was €5 per person to get in. Beautiful boats. The main attraction is amazing. The way they showing you the story is really clever. Not a typical boring museum. Worth a visit! ", "publishedDate": "2019-02-12", "language": "en", "rating": 5}, {"id": 651428929, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d244200-r651428929-Museu_Maritim_de_Barcelona-Barcelona_Catalonia.html", "text": "Museo Maritim is located near the waterfront,  at the bottom of Las Ramblas, in the stunningly restored, nearly 1000-year-old  Royal Arsenal of Barcelona, and contains a  smallish but impressive collection of ships and maritime paintings.  The main attraction for us was a replica of the Royal Galley, a warship operated by the \"Holy League\" and propelled by 200 unfortunate galley slaves.  On our way out the door, we passed an old wooden submersible that we thought was quite interesting.  Walking through this beautiful old building, and viewing the exhibits there may have been the highlight of our Barcelona visit.", "publishedDate": "2019-02-11", "language": "en", "rating": 5}, {"id": 650727729, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d244200-r650727729-Museu_Maritim_de_Barcelona-Barcelona_Catalonia.html", "text": "Hard to believe this wonderful museum hasn't a higher rating.  Brilliant repurposing of seafront sheds where ships were built hundreds of years ago: lots of high ceilings, large windows and natural light,  Knockout presentation of the King's Galley.  Lots of displays in historical context draw you through to complement Spanish history and up to current seafaring.  Great for kids.", "publishedDate": "2019-02-07", "language": "en", "rating": 5}, {"id": 649527490, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d244200-r649527490-Museu_Maritim_de_Barcelona-Barcelona_Catalonia.html", "text": "We have no particular interest in things maritime but the building is so intriguing by its size and the large crafts you can see through the enormous windows it was worth the €5 (senior discount, audio tour included) to stop and take a look. First, we had a great lunch at the equally spacious restaurant. They have table service and offer typical lunches for €12 which turned out to be above average. The atmosphere was worth it alone. An exhibit on the old Barcelona seafront was well designed and eye-opening. Barcelona was not always the glamorous  place it has become. But, the real treasure is the genuine King's Galley, a floating residence for the King in the 1500s which required up to 400 slaves to row it around. Once that sunk in (and you get good close-up views) it all took on a terribly sinister cast. Unimaginable! On the lighter side: Amerigo Vespucci's personal Atlas is on display. Sometimes historical artifacts come to life, and this one had an affect on me. With an open mind and a helping of curiosity, this museum is one of the \"must see\" attractions of an extended visit to Barcelona.", "publishedDate": "2019-02-01", "language": "en", "rating": 5}, {"id": 648168848, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d244200-r648168848-Museu_Maritim_de_Barcelona-Barcelona_Catalonia.html", "text": "The full size galleria is truly stunning, and there is some effort to surround it with narrative about how it was crewed, used etc. but expectations these days are so high that they need to catchup.\nThey are clearly doing a lot of work to bring things up to date, and the venue is superb.  The old naval shipyards have huge history that could really do with exploiting.\nIn short, it could be great and I hope the current works deliver, but at the moment it’s worth visiting for 30mins or so, but no more.", "publishedDate": "2019-01-25", "language": "en", "rating": 3}, {"id": 646829426, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d244200-r646829426-Museu_Maritim_de_Barcelona-Barcelona_Catalonia.html", "text": "Ships are an important part of Barcelona's history and this museum does a good job of trying to explain how they were built, what they were used for and the lives of those who worked on them. We enjoyed learning about it and the cost was reasonable, although we did have a discount card. There was lots of different exhibitions and we didn't have time to see it all but did learn a lot.", "publishedDate": "2019-01-18", "language": "en", "rating": 4}, {"id": 646665619, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d244200-r646665619-Museu_Maritim_de_Barcelona-Barcelona_Catalonia.html", "text": "Absolutely loved the museum, it's up and coming, a lot of info. Loved the narrative of all the exhibits they were nice enough to have it in English(we didn't even,need to ask). Great hands on sections to row the boat and build as well... This is going to be beautiful when finished. A must see.. \n\nExtra you can,board a 100 year old vessel in the harbor as well...", "publishedDate": "2019-01-17", "language": "en", "rating": 5}, {"id": 640017800, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d244200-r640017800-Museu_Maritim_de_Barcelona-Barcelona_Catalonia.html", "text": "Firstly the museum is not finished and you can only visit about half of the museum. I am sure once it is finished it will be nice but now it’s too early. The building is impressive and the highlight was the large ship that was placed inside the museum. Not really worth the entrance fee.", "publishedDate": "2018-12-16", "language": "en", "rating": 3}, {"id": 635502616, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d244200-r635502616-Museu_Maritim_de_Barcelona-Barcelona_Catalonia.html", "text": "Converting a discontinued shipyard into a maritime museum sounds like a great idea. It actually is but the execution leaves a lot to be desired. The center piece here is an impressive replica of a 16th century galley surrounded by a bunch of other interesting exhibits. The harsh life on the galley for slaves is well documented and narrated. But the visitor has no clue of what is included or located where. You are given an audio gizmo and pushed into a room with the assurance that everything is \"automatic\". The gizmo  is supposed to sense where you are standing and start the related commentary. But half the time you don't hear anything and it is not clear if you are in the wrong spot, or the exhibit does not need an explanation or where to go next. The \"map\" of the museum is a set of coloured rectangles with incomprehensible titles. I wish the tour was logically organised with clear instructions for the non Spanish visitors.", "publishedDate": "2018-11-24", "language": "en", "rating": 3}, {"id": 635427471, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d244200-r635427471-Museu_Maritim_de_Barcelona-Barcelona_Catalonia.html", "text": "The Museu Marítim (Maritime Museum) is certainly one of the most interesting sights in Barcelona. In line with the theme, the museum is housed in the former shipyards of Drassane. The museum is located on the southern edge of the old town and at the end of the Rambla, and has an extensive collection of ships and boats and a large exhibition on the construction of medieval sailing ships.", "publishedDate": "2018-11-24", "language": "en", "rating": 5}, {"id": 634211557, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d244200-r634211557-Museu_Maritim_de_Barcelona-Barcelona_Catalonia.html", "text": "We popped into this museum on a rainy day, thinking to pass a little time and dry off, even though neither one of us are nautical buffs. We were pleasantly surprised at how interesting it was. Of special interest – an exhibition on Barcelona's history.", "publishedDate": "2018-11-18", "language": "en", "rating": 4}, {"id": 631395914, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d244200-r631395914-Museu_Maritim_de_Barcelona-Barcelona_Catalonia.html", "text": "Great museum sure to satisfy, whether you’re visiting as an adult, child, family, or solo. \n\nInteractive museum with special videos, free audio touring headsets, plus lots of exhibits to explore up close. \n\nMuseum is in a great location, so be sure to incorporate into your day touring downtown. Lots of great places to grab a snack nearby, including within the museum itself. \n", "publishedDate": "2018-11-06", "language": "en", "rating": 5}, {"id": 628935929, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d244200-r628935929-Museu_Maritim_de_Barcelona-Barcelona_Catalonia.html", "text": "Well conceived exhibition for the port history\nThe galeria replica is a must to see\nWell conceived display", "publishedDate": "2018-10-27", "language": "en", "rating": 4}, {"id": 626553104, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d244200-r626553104-Museu_Maritim_de_Barcelona-Barcelona_Catalonia.html", "text": "This museum demonstrates the historical and chronological review of the development of the Port in Barcelona.   It has English translation throughout and has a nice flow to it, with creative use of multi-media interspersed.  It also contains many boats on various kinds, and this visual component is especially attractive to me, the non-museum type.  Two short movies are available, and think this is a good family museum.   A replica of a historical galley named Galiota takes up the largest showroom.  Each oar on this galley weighed 180 kgs. and needed four men to move it; top speed was 11 kms./hr.  Always remember to ask for senior’s rate as there is usually one available.   Audio guide options available and Wifi is accessible in adjacent cafe, and there is a delightful courtyard that is worth seeing complete with pond full of goldfish.", "publishedDate": "2018-10-19", "language": "en", "rating": 5}, {"id": 625978944, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d244200-r625978944-Museu_Maritim_de_Barcelona-Barcelona_Catalonia.html", "text": "If anyone has a passion or even a passing interest in the maritime history connected to the vibrant and beautiful city of Barcelona then a trip to the Museu Maritim De Barcelona is a must go destination. \nA showcase for all things nautical it's an ideal place to learn of the rich history of Barcelona. \nThe wooden submarine looks awesome but then again so do most of the other exhibits in this museum.\nThere's so much to see and so much to take in.\nWell worth checking out. ", "publishedDate": "2018-10-17", "language": "en", "rating": 5}, {"id": 621444884, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d244200-r621444884-Museu_Maritim_de_Barcelona-Barcelona_Catalonia.html", "text": "Excellent curation and display: spare, clear, clean.The real stuff[—— and remember who is on that statue downtown... Excellent cafe", "publishedDate": "2018-10-02", "language": "en", "rating": 5}, {"id": 620341865, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d244200-r620341865-Museu_Maritim_de_Barcelona-Barcelona_Catalonia.html", "text": "I really loved this museum, and found it absolutely fascinating. I don't have any particular interest in boats, but the history of Barcelona is entwined with the sea, and that was beautifully explained here. Highly recommended.", "publishedDate": "2018-09-28", "language": "en", "rating": 5}, {"id": 613461412, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d244200-r613461412-Museu_Maritim_de_Barcelona-Barcelona_Catalonia.html", "text": "We went because my husband loves boats; we stayed far longer than we had thought we would because it is actually very engaging. The museum is not exactly over-stuffed and appears to be a bit of a work in progress, but the exhibits were very informative and good use has been made of mixed media. In the centre of the old building is a massive life-size replica of a galley which you come across after seeing the history of galleys and how they were made, and how important they were to this part of the world. There is an audio guide in English (and other languages) that covers this part of the museum. All the signage was in English as well as Spanish/Catalan. The ticket also includes a visit to the schooner usually moored in the harbour, but not there on the day we went so we couldn't see it.\nAs a foreigner I did not think that the museum was Catalan-biased as another reviewer has commented, after all we are talking about a time when the World was local.", "publishedDate": "2018-09-03", "language": "en", "rating": 4}, {"id": 610910955, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d244200-r610910955-Museu_Maritim_de_Barcelona-Barcelona_Catalonia.html", "text": "This place is awesome and free! It us located inside an old fort and us absolutely beautiful. It features ships and fishing equipment, most of them handmade.", "publishedDate": "2018-08-27", "language": "en", "rating": 4}, {"id": 610022418, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d244200-r610022418-Museu_Maritim_de_Barcelona-Barcelona_Catalonia.html", "text": "Visited Tuesday afternoon (high season). Set in a beautiful building. Very open inside and easy to navigate. The information was well presented- e.g. Interactive display. Films were also used to engage guests. Reasonable admission price- 10 EUR/adult. Around one hour and a half is the right time to spend here. Suitable for children.", "publishedDate": "2018-08-24", "language": "en", "rating": 4}, {"id": 607891720, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d244200-r607891720-Museu_Maritim_de_Barcelona-Barcelona_Catalonia.html", "text": "The museum is near the Port. The buildings that houses the Naval Museum were once the Royal Shipyard. It is obvious the total work that was done to restore the building, with excellent results. I think it is a valuable contribution of the Museum to highlight the maritime history of Spain and especially of Catalonia - Barcelona.\nThe ticket costs €10 per person. Your visit can include the sailing ship which is in the port, a few hundred meters further.   (Schooner Santa Eulalia). It sound strange but in the Christian Orthodox religion, she is the same Santa Eulalia [(the person with blessed speech )–[ Eυ = Καλό ( in Greek  is the word Good)  + λαλώ = speak , in Greek ) ]that in the age of 12 the young girl, became a martyr for the faith of Christ, chased as a Christian by the envoys of the Roman Empire, even today Eulalia is the patron and protector of the city of Barcelona. The Greek Orthodox Church honours the memory of the Santa, on 22th of August. \nAt the entrance of the Museum (in the garden) there is a wooden submarine, and an old crane for unloading the ships, as outdoor exhibits. \nI suggest to follow the correct direction for your personal tour, having the electronic guide device with headphones. It all starts with your entry in a projection room to watch a short film about the naval history of Spain. The door closes automatically and the next visitors will have to wait the specified time of the next presentation (view). Watching the movie, which is very believable, perceived the importance of navigation and exploration and contribution to the New World. With the end of the film, another door opens in opposite direction, in order to continue your visit. You will notice the giant Royal Galley (a replica), oars in actual size, also an electronic simulation device, that give the real idea of the hard motion of oars, noting how difficult life was of rowers. Try to move it alone! You can realise that you must synchronize with other rowers, to have a result! The Galley (1571) even is a replica, present the real ship with all magnificent design and decoration mainly in the part of the Stern. A special scale model give the complete picture of the Royal Galley, the Flagship of the Fleet of the Holy League at the Battle of Lepanto in which the Turkish Armada was defeated. (8-10-1771).\n\nThere is a restaurant and Café, inside the Museum, also outside there is a garden with beautiful fountain, as extension of the Café for smokers also. The area is well cared. A good choice for a brake, after the tour in the Museum.\nThere is a souvenir shop, with many souvenirs at reasonable prices. The best nautical souvenirs are between €30-€200. The rest of the objects are the classic children’s or cheap souvenirs. My suggestion would be considered by the Museum, the possibility of the production, by order, issues from naval history, in magnets for the refrigerator, as is the case with the other Museums of Barcelona. It takes imagination and creativity, something that exists in Barcelona and it is obvious at each step around the city.\nCongratulation to the people that worked for this project. The staff that worked, it certainly worked very hard to present the naval history of Spain and especially of Barcelona.\nHighly recommended, especially during the morning hours, where the temperature in the summer months is high. There are many lockers to leave your packs, during the visiting. You can take photos without any problem.  Quiet place, ideal especially for those who are studying maritime history.", "publishedDate": "2018-08-19", "language": "en", "rating": 5}, {"id": 605133268, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d244200-r605133268-Museu_Maritim_de_Barcelona-Barcelona_Catalonia.html", "text": "Beautiful building and display of a Galley ship, great museum to escape the crowds and heat ! Very convenient off las ramblas, the gardens are beautiful too!", "publishedDate": "2018-08-10", "language": "en", "rating": 5}, {"id": 602994006, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d244200-r602994006-Museu_Maritim_de_Barcelona-Barcelona_Catalonia.html", "text": "The building is awesome - the architecture combining the new and old is quite superb. This is a tremendous exhibition space. The contents are not remarkable but certainly give a good maritime feel - a nice collection of shipping artifacts but not a huge amount. Certainly worth visiting a nd a great eating drinking area.", "publishedDate": "2018-08-05", "language": "en", "rating": 4}, {"id": 596270783, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d244200-r596270783-Museu_Maritim_de_Barcelona-Barcelona_Catalonia.html", "text": "The maritime museum is often overlooked in favour of the Gaudi and other museums, but it is well worth a visit and reasonably priced. There are heaps of small boats and lots and lots of model ships, but the highlight is undoubtedly the full-scale replica of the royal galley used by Juan of Austria. It is huge and very interesting. The building is also fascinating in its own right. Definitely recommended.", "publishedDate": "2018-07-14", "language": "en", "rating": 4}, {"id": 595671249, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d244200-r595671249-Museu_Maritim_de_Barcelona-Barcelona_Catalonia.html", "text": "What a horrible museum....\nHate how it has become a racistic museum .....that tries to just promote Catalan .....\nBefore it was much better.....", "publishedDate": "2018-07-12", "language": "en", "rating": 1}, {"id": 589790172, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d244200-r589790172-Museu_Maritim_de_Barcelona-Barcelona_Catalonia.html", "text": "I’m not generally a fan of repro’s, but this one is so huge and so over the top that it really needs to be seen.", "publishedDate": "2018-06-22", "language": "en", "rating": 4}, {"id": 589599869, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d244200-r589599869-Museu_Maritim_de_Barcelona-Barcelona_Catalonia.html", "text": "It was raining and I love boats, so we had a fabulous couple of hours here before eating at the museum restaurant. The reproduction of a 16th century galley was very interesting, and you learned quite a bit about the life of slaves on board.", "publishedDate": "2018-06-21", "language": "en", "rating": 5}, {"id": 588192746, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d244200-r588192746-Museu_Maritim_de_Barcelona-Barcelona_Catalonia.html", "text": "This is a museum about shipping and worth a visit just to see the Spanish galleon on display (replica of course).  There are also various ships with their sailing histories attached.\n\nThe building is just across the road from the Columbus monument, so it is easy to find.  You could easily spend a couple of hours there. There are also interactive displays of how the old shipyards worked, where they were situated and also of trans-Atlantic ships.", "publishedDate": "2018-06-17", "language": "en", "rating": 4}, {"id": 585357314, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d244200-r585357314-Museu_Maritim_de_Barcelona-Barcelona_Catalonia.html", "text": "The museum building is really amazing and definitely worth seeing. If you want some calm and peace after experiencing La Rambla, this museum is a good option. The collection is a bit limited but truly focused on ships and sailing. ", "publishedDate": "2018-06-05", "language": "en", "rating": 3}, {"id": 585155734, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d244200-r585155734-Museu_Maritim_de_Barcelona-Barcelona_Catalonia.html", "text": "Barcelona's maritime museum has a small but interesting collection that tells the story of the city. A good place to spend an afternoon. Admission is free on Sunday afternoons.", "publishedDate": "2018-06-04", "language": "en", "rating": 4}, {"id": 584918474, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d244200-r584918474-Museu_Maritim_de_Barcelona-Barcelona_Catalonia.html", "text": "Like other reviewers have mentioned, this museum was more than we expected. We had spent the entire day before walking our legs off so when we saw this place across the street from the cruise ship shuttle drop off, we decided to go inside. They do offer a senior discount of 5E, which is always nice. There is a café and a gift shop off the lobby. And rarest of rare.. clean,public restrooms! This place is absolutely cavernous. The museum building is actually a former medieval shipyard built of stone blocks, covered by a gigantic wooden roof. There are signs explaining every display in several languages, including English. The center piece of the museum is a reproduction of a 16th century galleon. There are stairs and viewing platforms around it to get up close and personal. Also ground level view ports where you could see inside the bottom of the ship. Lots of other ships and maritime items on display, including the glass from a lighthouse.  We probably spent about  2 1/2 hours here.", "publishedDate": "2018-06-03", "language": "en", "rating": 4}, {"id": 583293065, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d244200-r583293065-Museu_Maritim_de_Barcelona-Barcelona_Catalonia.html", "text": "We decided on the spur of the moment to enter this museum whilst walking by and totally enjoyed our visit to the Maritime Museum of Barcelona. \nLocated inside Barcelona's former medieval shipyards, whose construction began before 1300. The exhibits included displays of the various ship types used over time on the Mediterranean and from Barcelona. We found the information of the slave galleys to be very informative a well done.\nThe reproduction of the 16th-century galleon is breathtaking.", "publishedDate": "2018-05-28", "language": "en", "rating": 5}, {"id": 582980170, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d244200-r582980170-Museu_Maritim_de_Barcelona-Barcelona_Catalonia.html", "text": "We went here on a free day. It was OK and some interesting items but we were expecting more. Nice building. Overall a bit disappointing.", "publishedDate": "2018-05-27", "language": "en", "rating": 3}, {"id": 582945426, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d244200-r582945426-Museu_Maritim_de_Barcelona-Barcelona_Catalonia.html", "text": "This museum is displayed in a different manner - under themes where you see ancient to more recent artefacts adjacent to each other. There are two theatres with artistically presented historical footage- it was a little difficult to follow these films as there was no audio. The highlight of the museum was the huge reproduction of a Spanish galleon! We thoroughly enjoyed this museum and loved the setting in the ancient Gothic shipyards from the 13th century. One of the best maritime museums we have visited. ", "publishedDate": "2018-05-26", "language": "en", "rating": 5}, {"id": 582910760, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d244200-r582910760-Museu_Maritim_de_Barcelona-Barcelona_Catalonia.html", "text": "I thoroughly enjoyed my visit to the Maritime Museum of Barcelona.  The building itself is remarkable:  the museum is located inside Barcelona's former shipyards, whose construction began before 1300.  The exhibits included some enjoyable activities (some were aimed at children but even we adults enjoyed trying our hand at them), and the reproduction of the 16th-century galleon is breathtaking.  In some exhibits crew members of various eras came to life in short first-person videos describing their lives and work.  I thought the museum was well-designed, and I was very glad I got to visit it!", "publishedDate": "2018-05-26", "language": "en", "rating": 5}, {"id": 582852554, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d244200-r582852554-Museu_Maritim_de_Barcelona-Barcelona_Catalonia.html", "text": "From La Rambla to Aquarium make a stop in navy museum nearby statue of Colomb. You will see unique and huge \"galera\", lot of ship models or wood submarine outside. Friendly staff in restaurant.", "publishedDate": "2018-05-26", "language": "en", "rating": 3}, {"id": 582003842, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d244200-r582003842-Museu_Maritim_de_Barcelona-Barcelona_Catalonia.html", "text": "Located at the foot of Las Ramblas, near the entrance to the cruise ship port and the Columbus statue, this museum will provide a nice highlight of your Barcelona visit. You are augmented with a sound device that initiates as you approach each display (w/your language of choice.) Very interesting history of early sailing, and the building's construction. You will see a *gigantic* model of an old galley ship and learn about sailing life in the old days. As you wander around you will see the evolution of some of the Spanish ships. There are displays in the garden, in the halls, in a theater, and you will have the opportunity to board an old sailing vessel for up-close inspection. I was there on a day when admission was free but there was a small charge for the listening device. Watch while workers are restoring reclaimed old ships from the waters.", "publishedDate": "2018-05-22", "language": "en", "rating": 5}, {"id": 581842549, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d244200-r581842549-Museu_Maritim_de_Barcelona-Barcelona_Catalonia.html", "text": "Arrived here at opening time and scored a day when it was free!!! I would have paid anyway as I wanted to hear about the centuries old Maritime history. The exhibition covers a lot and you only need headphones for a small part of this The video was interesting and the Galley was ENORMOUS It was also interesting to see the ares for restoration. I stayed for 1 and a half hours reading all the info Thoroughly enjoyed!", "publishedDate": "2018-05-21", "language": "en", "rating": 5}, {"id": 581247996, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d244200-r581247996-Museu_Maritim_de_Barcelona-Barcelona_Catalonia.html", "text": "We enjoyed our visit. The Museum is in a section of the old royal shipyards. The reconstructed Galley was fabulous and is for obvious reasons the star of the Museum. Ships like that were actually built in the same building. Good English info all around. Lots of models  showing the development of ships and shipping thru the ages.", "publishedDate": "2018-05-19", "language": "en", "rating": 4}, {"id": 578616671, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d244200-r578616671-Museu_Maritim_de_Barcelona-Barcelona_Catalonia.html", "text": "We loved our time at the museum. We found it very informative and very interesting. We loved the replica galley and learning about the lives of the people on board. \nThe ship discovered while preparing for the Olympic Games was amazing. \nA must visit if you enjoy this kind of stuff ", "publishedDate": "2018-05-07", "language": "en", "rating": 5}, {"id": 577707383, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d244200-r577707383-Museu_Maritim_de_Barcelona-Barcelona_Catalonia.html", "text": "Was very disappointed with museum. Was expecting a lot more history on Columbus and artifacts of the past. Very sterile only nice thing was the building", "publishedDate": "2018-05-03", "language": "en", "rating": 1}, {"id": 576225738, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d244200-r576225738-Museu_Maritim_de_Barcelona-Barcelona_Catalonia.html", "text": "This museum is housed in the original ship building sheds of Barcelona, stunningly restored to house the exhibits.  Audio guide in English available, with interesting audio- visual exhibits and ship models, including a full size reproduction of a galley which was sent to the battle of Lepanto.  Definitely worth the visit.", "publishedDate": "2018-04-28", "language": "en", "rating": 5}, {"id": 575640276, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d244200-r575640276-Museu_Maritim_de_Barcelona-Barcelona_Catalonia.html", "text": "Museum is located just opposite the statue Christopher Columbus, in the bottom of Ramblas.\n\nMoving around one can reach by walk , bicycle or alternate. it would cost 5 euro but worth to antique , historic colection , well maintained. \n\nThe maritime museum is one of the most imaginative museum of the city and one of the most visited too. \n\nInstalled in the royal arsenals- date from 1378 and are the biggest and most complete Medieval dockyards in the world. \n\nKids can enjoy much more.", "publishedDate": "2018-04-25", "language": "en", "rating": 3}, {"id": 573370667, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d244200-r573370667-Museu_Maritim_de_Barcelona-Barcelona_Catalonia.html", "text": "The central hall of this museum is a large reproduction of a design from hundreds of years ago.     The audio tour does a decent job of explaining the displays, outlining the key elements connecting Barcelona to maritime history.    Much of this history is represented by models, with view actual historical artifacts.\n\nI usually seek out museums in cities that I travel to (bit of a history nerd), but this was a disappointment.", "publishedDate": "2018-04-14", "language": "en", "rating": 3}, {"id": 572935206, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d244200-r572935206-Museu_Maritim_de_Barcelona-Barcelona_Catalonia.html", "text": "We were particularly impressed with the organization of this museum. The staff was very polite and efficient, we were given audio guides that started explaining automatically, without us needing to push any buttons first, the space  dry well kept and neat. The main attraction of the museum is the galley and how it functioned. The collection isn’t particularly rich but it is definitely charming.", "publishedDate": "2018-04-12", "language": "en", "rating": 4}, {"id": 571465255, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d244200-r571465255-Museu_Maritim_de_Barcelona-Barcelona_Catalonia.html", "text": "The visit is definitely worth a visit. Located in Royal Shipyard building. Lots of boat models and interesting interactive parts. One of the most beautiful museums in Europe. Possibility to visit the boat in the port, for an additional surcharge.", "publishedDate": "2018-04-06", "language": "en", "rating": 5}, {"id": 570535547, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d244200-r570535547-Museu_Maritim_de_Barcelona-Barcelona_Catalonia.html", "text": "DISCLAIMER: It really helps if you are interested in ships and maritime history, if not, this is probably NOT the place for you.\n\nThe entry fee is perhaps a little steep, but the multi-lingual audio guides are included in the ticket price. Each exhibit has an infra-red sensor that means you only hear it's audio stream when you are directly in front of it. Once you walk away, the audio cuts out. \n\nThe most impressive pieces in the exhibition are the massive Royal Galleon in the main building, and the model ship within the glass case, at the top of the stairs near the back of this room. It was interesting to learn how the ship building yard changed over the years and under differing rule of Barcelona, and the fact the exhibition is actually within the walls of the ship building sheds is pretty cool.\n\nThis would be a great place for a school trip as there's loads of information and activities that kids can take part in. Again, if you are interested in maritime history then you'll enjoy it... if not, maybe just enjoy a walk around the harbour, which is really beautiful!", "publishedDate": "2018-04-02", "language": "en", "rating": 3}, {"id": 570051660, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d244200-r570051660-Museu_Maritim_de_Barcelona-Barcelona_Catalonia.html", "text": "It is supposed to.be open the first sunday of thr month but this is not the case, not to mention the attitude of the personal ", "publishedDate": "2018-04-01", "language": "en", "rating": 1}, {"id": 569944076, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d244200-r569944076-Museu_Maritim_de_Barcelona-Barcelona_Catalonia.html", "text": "There is one big ship, a few models and a few boats. There's not much to see here. The lift was cordoned off so I couldn't take my daughter up the steps to see the big ship from the top. The exit is confusing also as it seems to lead in to the museum next door. Not worth the money.  ", "publishedDate": "2018-03-31", "language": "en", "rating": 2}, {"id": 563863271, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d244200-r563863271-Museu_Maritim_de_Barcelona-Barcelona_Catalonia.html", "text": "What can I say - avoid. Total waste of money. We opted for the more expensive fast track tour which made it even more of a waste of money. 50 euros to see a few costumes and displays. I am a massive fan of the show but contrary to what other reviewers have said its not what I would expect for either the hype or the money.", "publishedDate": "2018-03-03", "language": "en", "rating": 1}, {"id": 563712916, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d244200-r563712916-Museu_Maritim_de_Barcelona-Barcelona_Catalonia.html", "text": "Came to see the Game of Thrones Exhibit. It is a must do if you are a fan. We had so much fun seeing the different outfits and props. They even have some interactive props that you can play around with. Make sure to bring your smartphone/camera, photos are allowed. Towards the end you do get a glimpse into the museum section, if we had the time I wish we would have been able to see that portion too as it looked quite interesting.", "publishedDate": "2018-03-02", "language": "en", "rating": 5}, {"id": 562749778, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d244200-r562749778-Museu_Maritim_de_Barcelona-Barcelona_Catalonia.html", "text": "Established in 1929, Museu Maritim de Barcelona (Maritime Museum of Barcelona) is a Barcelona museum dedicated to shipbuilding and Catalan seafaring culture. It is located inside Drassanes Reials de Barcelona, a former shipyard and military building of Gothic architecture dating back to the 13th century at the Port Vell area of the Port of Barcelona. Items in the museum's collection include model ships, nautical instruments, ex-votos, seascapes, figureheads, and maps. Highlights include a full-scale replica of the royal galley used by Juan of Austria at the Battle of Lepanto and the historic Santa Eulàlia, a 46-metre, four-masted schooner daring back to 1918, moored in Barcelona harbour. In the courtyard is a life-size replica of Ictíneo I, one of the world's first submarines. The sub was invented and built by Narcis Monturiol, a Catalan, in 1858. Museu Maritim de Barcelona is open daily from 10:00 in the morning until 8:00 at night. Tickets cost €10 for adults and €5 for children. Admission is free after 3:00 on Sundays. There is an on-site café with outdoor seating offering a set-price menu at lunchtime.", "publishedDate": "2018-02-25", "language": "en", "rating": 4}, {"id": 561620730, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d244200-r561620730-Museu_Maritim_de_Barcelona-Barcelona_Catalonia.html", "text": "Enjoy a cheap and fun tour for GoT fans, seeing costumes used on the show. Have fun taking pictures at some spots and get the opportunity to sit on the Iron Throne. But beware!! There are two thrones in this location. First one is right before gift shop and they make you take photo with their professional setup. If you skip that and go beyond gift shop you'll find another Iron Throne that you can take picture for free. The professional one looks cooler although, so make the choice that fits your pocket.", "publishedDate": "2018-02-19", "language": "en", "rating": 4}, {"id": 560194020, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d244200-r560194020-Museu_Maritim_de_Barcelona-Barcelona_Catalonia.html", "text": "Wow. Just WOW after a lovely tour through Barcelona the day was ended on the best Note.\nWe were able to go and see the Game of Throne exhibition it was so surreal and utterly enjoyable, How many people can honestly say they flew half across the world an got too see an Exhibition of their Favorite SERIES.\nWorth every Cent and a must do if you able too", "publishedDate": "2018-02-13", "language": "en", "rating": 5}]}}]