[{"locationId": 313686, "name": "Barcelona Pavilion", "placeType": "ATTRACTION", "reviewListPage": {"reviews": [{"id": 732268636, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d313686-r732268636-Barcelona_Pavilion-Barcelona_Catalonia.html", "text": "Mies van der Rohe is one of the most important Modernist architects of the 20th Century.  He designed the Barcelona Pavilion for the 1929 Barcelona International Exposition.  The pavilion is small and can be visited in 30-45 minutes.  It is about 2 blocks from the Magic Fountain and it is easy to work a visit into a Montjuic Area Sights Walking Tour. This is an important building in the Modernist style and is interesting to see, even if you are not a big architecture fan.  Van der Rohe used lavish materials and a simple design for impressive visual impact.  His design for furnishings resulted in the universally recognized “Barcelona Chair.”  You will instantly recognize the design when you see examples inside the pavilion.", "publishedDate": "2019-12-12", "language": "en", "rating": 4}, {"id": 723481472, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d313686-r723481472-Barcelona_Pavilion-Barcelona_Catalonia.html", "text": "This place was ok for me.  My son, who minored in architecture was absolutely awed by it.  Still, at 5e, it was worth the visit", "publishedDate": "2019-11-03", "language": "en", "rating": 3}, {"id": 720238255, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d313686-r720238255-Barcelona_Pavilion-Barcelona_Catalonia.html", "text": "I shed a tear when we got to the Barcelona Pavilion.  I'd seen pictures all my life but they dont do it justice.  Truely inspired.  My husband who saw me cry thought I'd gone insane. \nThere are Barcelona Chairs to sit in and although at 56 I no longer enter or exit one gracefully it was still a thrill to get a picture in one at their birthplace.  For all architecture fans, you must make this pilgrimage.  For everyone else, suck it up and let your architecture-loving partner have their moment.", "publishedDate": "2019-10-21", "language": "en", "rating": 5}, {"id": 715835773, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d313686-r715835773-Barcelona_Pavilion-Barcelona_Catalonia.html", "text": "BUT it was a big disappointment that they had an expo that ruined the essence of the building ️\n\nI will return in a hope that they will show the pavilion the way it was meant to be!!!", "publishedDate": "2019-10-06", "language": "en", "rating": 5}, {"id": 714423443, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d313686-r714423443-Barcelona_Pavilion-Barcelona_Catalonia.html", "text": "If you are not a fan of architecture, you may not want to spend the 5E to enter the Barcelona Pavilion.  However, if you are a fan, this is the building that started the modern architecture style and it is magnificent to experience first hand. It is a reproduction, but the guide there told me it was built exactly where it was originally built.  To experience this gem first hand was a pinnacle of my visit to Barcelona.   The design and setting are sublime.", "publishedDate": "2019-10-01", "language": "en", "rating": 5}, {"id": 712434818, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d313686-r712434818-Barcelona_Pavilion-Barcelona_Catalonia.html", "text": "It was a dream come true to visit the Barcelona Pavilion. Mies van der Rohe was a master architect. A building this clean and modern build in 1929 is mindblowing. Architects will understand this as it changed the history of design forever. Must visit if you understand Mies and architecture ", "publishedDate": "2019-09-23", "language": "en", "rating": 5}, {"id": 709408217, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d313686-r709408217-Barcelona_Pavilion-Barcelona_Catalonia.html", "text": "The vast majority of this building is visible from the outside, without going up the steps and being charged 5 euros to walk around. Why bother? Great architecture and a beautiful building nevertheless. ", "publishedDate": "2019-09-13", "language": "en", "rating": 4}, {"id": 709091693, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d313686-r709091693-Barcelona_Pavilion-Barcelona_Catalonia.html", "text": "For those architecture lovers, you can go inside and pay the much exaggerated entry fee of 5€ for a visit that could last a maximum of 5 to 10 min. I suggest to stay outside and have a good view of the pavilion...and save your money for better attractions ", "publishedDate": "2019-09-12", "language": "en", "rating": 2}, {"id": 707163624, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d313686-r707163624-Barcelona_Pavilion-Barcelona_Catalonia.html", "text": "As an architect, this modest structure built initially for the 1929 World Exposition (and rebuilt in the 1980s) was earth shaking in it's divergence from the architectural norms of the time. It still is. A bit off the beaten (tourist) path, you can enjoy a visit at your leisure with almost no one else around. ", "publishedDate": "2019-09-06", "language": "en", "rating": 5}, {"id": 693175459, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d313686-r693175459-Barcelona_Pavilion-Barcelona_Catalonia.html", "text": "Not mentioned as a very interesting attraction in Barcelona but is certainly worth a visit. Modern architecture that is stil very actual. Small garden, nice interior which breathes quietness.", "publishedDate": "2019-07-27", "language": "en", "rating": 5}, {"id": 690337094, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d313686-r690337094-Barcelona_Pavilion-Barcelona_Catalonia.html", "text": "This minimalist pavilion designed by Mies van der Rohe for the 1929 World Exhibition is  preserved as an example of a modernist building. While a little quirky, it's fairly minimalist and totally over-priced at €5 for a 10 minute visit.", "publishedDate": "2019-07-17", "language": "en", "rating": 3}, {"id": 682253912, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d313686-r682253912-Barcelona_Pavilion-Barcelona_Catalonia.html", "text": "Mies's modernist buildings are a true pleasure to be in. To those saying it's overpriced, you must be hard pressed for 5€. I spent over an hour in here sitting and looking at all the marble details. A true masterpiece.", "publishedDate": "2019-06-17", "language": "en", "rating": 5}, {"id": 682183319, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d313686-r682183319-Barcelona_Pavilion-Barcelona_Catalonia.html", "text": "We had just finished seeing Poble Espanyol and this was on our list of sights to see on the way back to our AirBnB in Barcelona. I have to agree with most of the reviewers...unless you are an architect, this may not be worth a visit.\n\nAlthough a stunning design for the 1930’s (and even now) it is not a large place. You enter and wonder...is there more to see? Well there isn’t. In fact, from the outside you can see 80% of the structure. Inside are just empty (but beautiful) marble walls. No explanation of where the marble came from, no explanation of what the designer was attempting to say with the design.\n\nSo for the 10 € we paid, we only stayed less than 10 minutes. I suspect had I been an architect and not a civil engineer, I may have just stayed and marveled at the simplicity of the design...but one visit to this place will be enough for me.", "publishedDate": "2019-06-17", "language": "en", "rating": 2}, {"id": 681484518, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d313686-r681484518-Barcelona_Pavilion-Barcelona_Catalonia.html", "text": "My wife as an architect historian had to visit and see the reconstruction. Design by Mies van der Rohe. For the 1929 International Exhibition it Issa taken down when it was over in 1930. Reconstructed in the 1980s using the original plans and a set of black and white photos it is a grand example of early 20th century architecture. There are replicas of Mies furniture inside including his iconic chairs.  Well worth the 5 EU fee", "publishedDate": "2019-06-14", "language": "en", "rating": 5}, {"id": 677560971, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d313686-r677560971-Barcelona_Pavilion-Barcelona_Catalonia.html", "text": "another place to see full of interesting architecture and appreciate Barcelona\n\nif you'd like architecture don't go", "publishedDate": "2019-05-30", "language": "en", "rating": 4}, {"id": 659601021, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d313686-r659601021-Barcelona_Pavilion-Barcelona_Catalonia.html", "text": "Iconic 20th-century architecture. Built in 1929 there is not yet anything more elegant, more cutting edge, more modern then this gorgeous house. If ever in Barcelona: don't miss it. ", "publishedDate": "2019-03-19", "language": "en", "rating": 5}, {"id": 656396305, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d313686-r656396305-Barcelona_Pavilion-Barcelona_Catalonia.html", "text": "We visited the pavillon on our way back from montjuic.\nThe ticket was 5€ but it is worth it, the athmosphere is relaxing/strange/modern.. hard to describe, just take a ticket and sit near the 'pool' for 15 minutes, you wont regret it", "publishedDate": "2019-03-04", "language": "en", "rating": 5}, {"id": 655483769, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d313686-r655483769-Barcelona_Pavilion-Barcelona_Catalonia.html", "text": "I too walked in wondering why i was there but luckily i married a brilliant architect! He explained you cant study architecture without knowing this building and then proceeded to exllain the overhang etc and i got it. Every building on grand design bows down to this and i loved the serenity of it. I also had a tear jerking husband at touching in his words architectural perfection", "publishedDate": "2019-02-28", "language": "en", "rating": 5}, {"id": 645635449, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d313686-r645635449-Barcelona_Pavilion-Barcelona_Catalonia.html", "text": "This place is for sure a dream place for every architect the admires Modern architecture and Mies work. It's worth every single penny and I do not agree it is overpriced. The only problem is that the people who work there (entrance and store) are terribly rude and lazy. They do not talk to you and barely answer your questions. They don't even answer you back when you say \"good afternoon\". I am amazed.", "publishedDate": "2019-01-13", "language": "en", "rating": 4}, {"id": 640108356, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d313686-r640108356-Barcelona_Pavilion-Barcelona_Catalonia.html", "text": "What a shame. We came to the pavilion with high expectations, but felt that whole thing was just horribly overpriced. Apart from the pools, there’s nothing to see here. If I had the choice, I’d avoid.", "publishedDate": "2018-12-17", "language": "en", "rating": 1}, {"id": 635426428, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d313686-r635426428-Barcelona_Pavilion-Barcelona_Catalonia.html", "text": "Photos and written descriptions don't do enough to convey what it is like to walk through this gem of mondernist architecture that gets overshadowed by all of the other masterworks in the city. Experiencing the contrasting philosophies of van der Rohe and Gaudi make it worth the effort to seek out the pavillion to see proof that \"less is more\" does not mean simple and lacking in detail to capture the imagination and soothe the soul.", "publishedDate": "2018-11-24", "language": "en", "rating": 5}, {"id": 631401526, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d313686-r631401526-Barcelona_Pavilion-Barcelona_Catalonia.html", "text": "Oh my gosh. The very definition of a rip off! They get you for €5 a person as soon as you approach.\n\nLook around as you pay your euros. YOU’VE SEEN IT ALL!  There is nothing behind the walls. There’s not even a bathroom. \n\nThe history is interesting, but be sure to have your phone and look it up on Wikipedia. There is no exhibit. No nothing. What you see is what you get. Walls. \n\nHopefully they can add an exhibit or a guided tour or something to justify the cost. Otherwise this is a strong AVOID!", "publishedDate": "2018-11-06", "language": "en", "rating": 2}, {"id": 628535946, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d313686-r628535946-Barcelona_Pavilion-Barcelona_Catalonia.html", "text": "The house is definitely an interesting piece of architecture. But you see almost everything from outside. \nThat's why it is totally not worth to pay 5€ for the entrance.", "publishedDate": "2018-10-26", "language": "en", "rating": 2}, {"id": 609890787, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d313686-r609890787-Barcelona_Pavilion-Barcelona_Catalonia.html", "text": "I passed by this pavilion while walking from the magic fountain to Poble Espanyol. Its exterior is a beautiful piece of modern design. Worth a photo shoot before heading to my destination.", "publishedDate": "2018-08-24", "language": "en", "rating": 3}, {"id": 593080517, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d313686-r593080517-Barcelona_Pavilion-Barcelona_Catalonia.html", "text": "Beaware location posted on tripadvisor is totally wrong. Villa is located at Espanya plaza few miles different way.", "publishedDate": "2018-07-04", "language": "en", "rating": 5}, {"id": 590227017, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d313686-r590227017-Barcelona_Pavilion-Barcelona_Catalonia.html", "text": "We chose to visit the pavilion as our son studied the building and made a model of it as part of an Architecture course he attended. He was able to give us a detailed history of the building and help us understand it. Without that, I'm not sure we'd have enjoyed it as much. It is interesting but you can only really spend 20 minutes there. ", "publishedDate": "2018-06-24", "language": "en", "rating": 5}, {"id": 587419400, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d313686-r587419400-Barcelona_Pavilion-Barcelona_Catalonia.html", "text": "This is not the original pavilion, but an exact replica recreated in the same spot that the original was in. It is an important milestone in 20th Century architecture. The interior is not large, so cheapskates can just view the outside and imagine the interior through the windows. It is fun to think that this building went up while other more decorated buildings were being constructed in town, like the Sagrada Familia, but this has an infinitely more modern aesthetic.", "publishedDate": "2018-06-14", "language": "en", "rating": 4}, {"id": 587262097, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d313686-r587262097-Barcelona_Pavilion-Barcelona_Catalonia.html", "text": "We visited it by night, but still, it was impressive. What can an architect think, so many years ago and change the standards. Plain and simple.", "publishedDate": "2018-06-13", "language": "en", "rating": 5}, {"id": 583790842, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d313686-r583790842-Barcelona_Pavilion-Barcelona_Catalonia.html", "text": "This was the name of the building used by Germany for the 1929 Exhibition, taking its name from the designer, Ludwig Mies van der Rohe. It was removed after the Exhibition. \nIt still retained significant interest in architectural circles and a decision was taken to reconstruct the building in 1986. Constructed of glass, steel  and assorted marble and stone. Unusual and interesting.", "publishedDate": "2018-05-29", "language": "en", "rating": 4}, {"id": 578695259, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d313686-r578695259-Barcelona_Pavilion-Barcelona_Catalonia.html", "text": "So yes it’s small and it’s 10 euros but it is special. \nIf you don’t like 20 century architecture don’t go you will feel ripped off. Like the louvre and it’s Mona Lisa.\nNow the problem, who would hang laundry in this place???\nA total WTF moment for me. ", "publishedDate": "2018-05-07", "language": "en", "rating": 2}, {"id": 566076419, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d313686-r566076419-Barcelona_Pavilion-Barcelona_Catalonia.html", "text": "It is not a big place with much to see, but it is very beautiful. It gives you a great sense of peace and relax. Recommended if you like architecture.", "publishedDate": "2018-03-12", "language": "en", "rating": 5}, {"id": 556387367, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d313686-r556387367-Barcelona_Pavilion-Barcelona_Catalonia.html", "text": "there's a ticket person asking for 5 Euros, really. I would say walk past and take your pictures from the park. ", "publishedDate": "2018-01-25", "language": "en", "rating": 3}, {"id": 555337822, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d313686-r555337822-Barcelona_Pavilion-Barcelona_Catalonia.html", "text": "16.01.2018. 13:40 hrs.\nThe staff in the museum-shop is the rudest we have ever met. It was obvious that she had more important things to do than serving her customers. We wanted to buy a € 13 or € 14 souvenir, but she refused to take a € 50 note! We then emptied our pockets and counted 14 in euros and cents. On two first askings, wether the price was 13 or 14 euros, she did not answer. When we asked the third time she went absolutely mad, yelling at us in a language we did not understand. We then left.", "publishedDate": "2018-01-21", "language": "en", "rating": 1}, {"id": 551922627, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d313686-r551922627-Barcelona_Pavilion-Barcelona_Catalonia.html", "text": "This is one of the most important buildings in the history of Modern Architecture. A masterpiece that embodies the values and principles of modernity in an elegant manner. Never has an architect done so much with so little. Every detail is accounted for. If you're an architect or an art historian, this pavilion is a must.", "publishedDate": "2018-01-05", "language": "en", "rating": 5}, {"id": 548409828, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d313686-r548409828-Barcelona_Pavilion-Barcelona_Catalonia.html", "text": "Incredible architecture! A true lesson of how much less is definitely more and a timeless style that was way ahead of its time and still is. A real inspiration.", "publishedDate": "2017-12-21", "language": "en", "rating": 5}, {"id": 535697098, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d313686-r535697098-Barcelona_Pavilion-Barcelona_Catalonia.html", "text": "On a warm sunny morning before the park got too busy this was a fantastic space to explore and contemplate in. For those who find it useful to know, there are no toilets in the pavilion but there are some very close by in the park.", "publishedDate": "2017-10-24", "language": "en", "rating": 5}, {"id": 535471541, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d313686-r535471541-Barcelona_Pavilion-Barcelona_Catalonia.html", "text": "Get there early, before too many people getting in your photos. Perfectly tranquil. The stone is astonishingly beautiful up close", "publishedDate": "2017-10-23", "language": "en", "rating": 5}, {"id": 533748960, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d313686-r533748960-Barcelona_Pavilion-Barcelona_Catalonia.html", "text": "Following the advice from others, I was told this attraction was worth doing even if just from the outside without paying the entrance fee.\n\nThis is incorrect.\n\nUnless you have specific knowledge of architecture and this architect, then you will likely be disappointed. We walked around saying, Is this it? \n\nWe opted not to pay the 5 Euro entrance fee, and I think that was a wise decision. Unfortunately, it wasn't even worth the time or effort it took to get there to see it from the outside.", "publishedDate": "2017-10-17", "language": "en", "rating": 1}, {"id": 529177291, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d313686-r529177291-Barcelona_Pavilion-Barcelona_Catalonia.html", "text": "One of the most important building in the 20th century. The simplicity with the absolute precision in construction is breathtaking. If you imagine that this was constructed about 1929 you must appreciate timelessness of the building.\n\nAnd it is not so owercrowded as other spots in Barcelona.", "publishedDate": "2017-10-02", "language": "en", "rating": 5}, {"id": 525250108, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d313686-r525250108-Barcelona_Pavilion-Barcelona_Catalonia.html", "text": "The Mies van der Rohe pavilion in Barcelona is an oasis of beauty and calm in the hectic city. The light, textures, lines and mood created by the pavilion are perfection. This is a little-known spot in Barcelona and worth every minute spent finding it and soaking in its sense of style, elegance and finery. ", "publishedDate": "2017-09-17", "language": "en", "rating": 5}, {"id": 508493541, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d313686-r508493541-Barcelona_Pavilion-Barcelona_Catalonia.html", "text": "Lovely place to spend a few moments away from the hustle and bustle of Barcelona centre. Fantastic example of modern architecture ", "publishedDate": "2017-08-03", "language": "en", "rating": 5}, {"id": 507306203, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d313686-r507306203-Barcelona_Pavilion-Barcelona_Catalonia.html", "text": "I returned here with my son to let him experience this 1928 essay in modernism - Mies Van Der Rohe's \"less is more\" modernism. After disassembly in 1930, the pavilion is as fresh as a daisy having been rebuilt in the mid 1980's. My 11 year old loved it and he is inspired to build a card model when he gets back home and seek out software that will take him past the blocky limitations of Minecraft. \n\nThis is a seminal building which is the perfect counterpoint (or antidote) to Antoni Gaudi's genius. Only a few euros for admission too, even less with a Barcelona Card, and kids are free. In a city where you can get charged a lot for ad(mission to some fine buildings this is refreshing. Just a few architecture students sitting quietly in their IM Pei/Le Corbusier style specs, lol) sketching in Moleskine notebooks... a book shop has monographs and drawings etc but how ironic that the book shop sells 'less is more' fridge magnets! Mies must be spinning is his grave!\n\nWorth the entry even to meditate for a while...", "publishedDate": "2017-07-31", "language": "en", "rating": 5}, {"id": 506448146, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d313686-r506448146-Barcelona_Pavilion-Barcelona_Catalonia.html", "text": "Has been on my wish list for at least 20 years and have built it up in my mind to be magnificent. It didn't disappoint. I guess you'd need to appreciate minimalist architecture and Mies van de Rohe's philosophy \"Less is more\" though. ", "publishedDate": "2017-07-28", "language": "en", "rating": 5}, {"id": 500586734, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d313686-r500586734-Barcelona_Pavilion-Barcelona_Catalonia.html", "text": "Calm and beautiful place to see and walk around their surroundings. Love design and this pavilion is a must!", "publishedDate": "2017-07-10", "language": "en", "rating": 5}, {"id": 500222350, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d313686-r500222350-Barcelona_Pavilion-Barcelona_Catalonia.html", "text": "Full disclosure - I'm an architecture graduate. \n\nI walked up here from the Gothic neighbourhood in Barcelona - what a trek! But to get inside and just sit watching the pool for 30 minutes in conversation with a friend was so relaxing. The flow of visitors meant that for a time we were all alone. It was just nice to have the space to look around at the materials, the light, the reflections in the glass and how they all played together. It makes a change from those visits where you aren't allowed to sit anywhere or touch anything or the top tourist traps where you shuffle along in a queue, unable to see anything or form your own views.\n\nIt is situated in a huge and varied public park. Worth spending a rambling afternoon in! yes the 5eu entry is a bit steep if all you want to do is 'tick it off' your 'to see' list, but if you want to enjoy a modernist masterpiece up close, it's worth it!", "publishedDate": "2017-07-10", "language": "en", "rating": 4}, {"id": 497318928, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d313686-r497318928-Barcelona_Pavilion-Barcelona_Catalonia.html", "text": "The Barcelona Pavilion, designed by Ludwig Mies van der Rohe, was the German Pavilion for the 1929 International Exposition in Barcelona, Spain. This building was used for the official opening of the German section of the exhibition.", "publishedDate": "2017-06-29", "language": "en", "rating": 3}, {"id": 495542076, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d313686-r495542076-Barcelona_Pavilion-Barcelona_Catalonia.html", "text": "The pavilion is gorgeous and a fresh alternative to all the beautiful old architecture around the city. Clean lines, beautiful marble and muted colours make the visit one of calm, quiet contemplation.", "publishedDate": "2017-06-23", "language": "en", "rating": 5}, {"id": 495061549, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d313686-r495061549-Barcelona_Pavilion-Barcelona_Catalonia.html", "text": "Every time a walk past the Van der Rohe pavillion, I am blown away by that fact that it, and the building adjacent were designed in the same year - that is when one realised the brilliance of Van der Rohe, and how far he pushed boundaries, innovation and beauty! Every time I've been inside, I was lucky enough that it was relatively quiet, and there were moments where I was alone in one of the rooms - which is a privilege. For me, this is on the must see list of Barcelona!  ", "publishedDate": "2017-06-22", "language": "en", "rating": 5}, {"id": 490266705, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d313686-r490266705-Barcelona_Pavilion-Barcelona_Catalonia.html", "text": "I know he's a minimalist but really? There is virtually nothing in this building that you can't see from the outside. I'm really not sure what they charge 5€ for. If you are interested in how marble can be beautifully attached, OK, Go. ", "publishedDate": "2017-06-04", "language": "en", "rating": 3}, {"id": 486092511, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d313686-r486092511-Barcelona_Pavilion-Barcelona_Catalonia.html", "text": "A very simple elegant building but every student of architecture will appreciate the innovative design. It still looks very modern after almost 100 years. Could do with a little more information about the building and its construction.", "publishedDate": "2017-05-21", "language": "en", "rating": 4}, {"id": 484677251, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d313686-r484677251-Barcelona_Pavilion-Barcelona_Catalonia.html", "text": "Not much here. Was expecting more of an exhibit or exhibition. It's beautiful modern architecture but I'm really not sure why they placed it here and have two huge flags hanging over the building. Had this been placed in a different environment, it would really contribute to overall experience.", "publishedDate": "2017-05-16", "language": "en", "rating": 3}, {"id": 482429712, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d313686-r482429712-Barcelona_Pavilion-Barcelona_Catalonia.html", "text": "I return to this building every time I am in Barcelona. So beautiful, such an architectonic masterpiece. Hidden away in a corner. 5 EUR to enter - not a must - it can be enjoyed from the outside.", "publishedDate": "2017-05-07", "language": "en", "rating": 5}, {"id": 481693026, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d313686-r481693026-Barcelona_Pavilion-Barcelona_Catalonia.html", "text": "My husband is an architect so he wanted to visit.  It is interesting but I was done after ten minutes, he wanted to stay over an hour studying every detail.  One of only two places I visited in Barcelona that were not crowded.  There were about five other architects roaming the site.  No restrooms on site but you're near the Magic Fountains and Montjuic Park so there are some paid public restrooms close by.  ", "publishedDate": "2017-05-04", "language": "en", "rating": 3}, {"id": 469455700, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d313686-r469455700-Barcelona_Pavilion-Barcelona_Catalonia.html", "text": "This is one of the most interesting spots in the city, in my opinion. It´s a simple and rather small building that was the German Pavilion during the International Exposition held in Barcelona in 1929, although what we can see nowadays is a painstaking reconstruction of the original pavilion. The main attractive of this building is its fine, simple, clear architecture, one of the most iconic examples of the Modern movement, aiming to represent the values of that time. The building itself is quite small, but has an amazing beauty. The main downside of it is that you need some smattering of architecture or some inclination to design and art to really enjoy it. Otherwise, it would seem to you a bit bland and soulless: a set of empty rooms -except for the famous armchairs- and patios. The entrance is just 5€ and I found the visit a very interesting experience making you realise that what we consider contemporary nowadays was built 90 years ago.", "publishedDate": "2017-03-22", "language": "en", "rating": 4}, {"id": 468953206, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d313686-r468953206-Barcelona_Pavilion-Barcelona_Catalonia.html", "text": "Ideal place of people love architecture. It started modern pond, and simple lines. The stones was magnificent. \nThe exhibition cost 5 Euro in early 2017, the there was limited introduction for fresh visitors. The maintenance was also not as good as those by Gaudi in Barcelona.", "publishedDate": "2017-03-20", "language": "en", "rating": 4}, {"id": 468114760, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d313686-r468114760-Barcelona_Pavilion-Barcelona_Catalonia.html", "text": "This is a really, really small pavilion with barely anything to see. There is a statute, a small pool, a small lounge, and a gift shop. In my opinion, there really is nothing to see. I recommend that you go here if you have nothing better to do and you want to kill time.", "publishedDate": "2017-03-17", "language": "en", "rating": 3}, {"id": 464244654, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d313686-r464244654-Barcelona_Pavilion-Barcelona_Catalonia.html", "text": "very small and simple, but most modern buildings take the Barcelona Pavilion as their reference - and you can see why when you are here!", "publishedDate": "2017-03-03", "language": "en", "rating": 5}, {"id": 462275157, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d313686-r462275157-Barcelona_Pavilion-Barcelona_Catalonia.html", "text": "It was my reason for wanting to visit Barcelona in the first place. To visit and pay homage to Ludwig Mies Van der Rohe’s Barcelona Pavilion.\n\nFor those of you who do not know, it was the German Pavilion first built in 1928-29 for the International Exposition in Barcelona, Spain it was demolished in 1930 and later on, they figured that that was a bad idea. It was an important building and pivotal in the architects career.  So the foundation set about reconstructing the building on the original site, in 1983 and in 1986 work was completed.  It is now open to the public and can also be hired for private events. At this news, I thought what a wonderful place to have your wedding photographs taken. I felt that the clean lines, beautiful chrome and glass and exquisite stonework, would only enhance the photographs from the best day of a woman’s life. \n\nI felt a sense of calm being up there and thought that it would be a wonderful place to do some yoga or meditate, away from the buzz of the city a chance to gather your thoughts and recharge.", "publishedDate": "2017-02-23", "language": "en", "rating": 4}, {"id": 461190170, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d313686-r461190170-Barcelona_Pavilion-Barcelona_Catalonia.html", "text": "Often forgotten due to the proximity with the Palau Nacional, the Mies van der Rohe Pavillion really is a must see if you like modern architecture.", "publishedDate": "2017-02-19", "language": "en", "rating": 5}, {"id": 460494110, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d313686-r460494110-Barcelona_Pavilion-Barcelona_Catalonia.html", "text": " exquisite reconstruction of this Pavillion for 1929 worldfair ..the Onix  from Argelia...and rest of materials together with Barcelona chair  collection are fantastic..you got see it!...", "publishedDate": "2017-02-16", "language": "en", "rating": 5}, {"id": 453396669, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d313686-r453396669-Barcelona_Pavilion-Barcelona_Catalonia.html", "text": "Designed by Mies van der Rohe was erected on the occasion of the Universal Exhibition of 1929 as part of the German pavilion, he also designed the Barcelona chair especially for the Pavilion, a chair based on leather and metal profile, which is still marketed.\nI recommend you to visit one of so many sunny days in Barcelona, the visit is short but very interesting.\nIt is located near the Montjuic fountain in a very nice setting. If you are going to visit it I advise also to visit the Spanish Village too, near by.", "publishedDate": "2017-01-19", "language": "en", "rating": 4}, {"id": 436671789, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d313686-r436671789-Barcelona_Pavilion-Barcelona_Catalonia.html", "text": "It was so nice to see this place. Took so many photos and loved every bit of it. What is good is that it's plain and not crowded like a museum where you get overwhelmed with room after room of the same art. This however was a pleasant and simple experience. A must see if you love architecture. Plus I love the gift shop. Need to pay 5 euros to get in. :)", "publishedDate": "2016-11-12", "language": "en", "rating": 5}, {"id": 428787727, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d313686-r428787727-Barcelona_Pavilion-Barcelona_Catalonia.html", "text": "I really wanted to see this attraction as its in all my architecture books and I couldn't visit Barcelona without seeing it, there is a small fee to see inside and stupidly we paid it, if you walk round the back you could get in for free, nonetheless you need to see this if you appreciate a good building!   \nbut honestly 10/15-mins is all the time you need to allow for it as its not massive.", "publishedDate": "2016-10-17", "language": "en", "rating": 4}, {"id": 427494535, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d313686-r427494535-Barcelona_Pavilion-Barcelona_Catalonia.html", "text": "This building was originally part of the 1929 world exhibition, removed, reconstructed and reopened in 1986. In 2016 there is an interesting special exhibition outside telling the story and commemorating that it is 30 years since the reopening of this architectural masterpiece.", "publishedDate": "2016-10-12", "language": "en", "rating": 5}, {"id": 427272020, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d313686-r427272020-Barcelona_Pavilion-Barcelona_Catalonia.html", "text": "This is an astonishing space. It has a door but no sense of a door. It can be seen through but is solid. It seems to nudge for you too keep moving but it has a few places to sit. It's a powerfully firm space, yet there is water. Go. Dream up your own list of contrasts so well demonstrated by this structure. ", "publishedDate": "2016-10-12", "language": "en", "rating": 5}, {"id": 426356876, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d313686-r426356876-Barcelona_Pavilion-Barcelona_Catalonia.html", "text": "Architecture don't get much better than this. Been here four times and get blown away every time by this astonishing place. Perfection in material combinations, proportions and layout. A must see!", "publishedDate": "2016-10-09", "language": "en", "rating": 4}, {"id": 425445226, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d313686-r425445226-Barcelona_Pavilion-Barcelona_Catalonia.html", "text": "My husband studied architecture, and this building has been on his bucket list for a long time. The admission is 5 euros per person, and  well worth it.\n\nDespite being in a busy city, there is something so peaceful about this place. We enjoyed sitting on one of the benches and watching the breeze on the reflecting pool. There is a short video available that is very informative, and most of the people in it are the staff talking about what it feels like to work there.\n\nThere is a small gift shop that sells some really interesting items.", "publishedDate": "2016-10-05", "language": "en", "rating": 5}, {"id": 424194844, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d313686-r424194844-Barcelona_Pavilion-Barcelona_Catalonia.html", "text": "The \"less is more\" architect is sensationally represented in his 1929 building for the International Exhibition of Barcelona. It was reconstructed in 1986 on a most perfect site. The domed, sculptured, columned and frescoed palace with its waterfalls (now the Catalonian Museum of National Art) is a sharply contrasting backdrop.\nWhat a spectacular place to experience the simple elegance of modernism against the  Italian classical style art museum towering over the pavilion on Montjuic hill.", "publishedDate": "2016-10-01", "language": "en", "rating": 5}, {"id": 423754760, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d313686-r423754760-Barcelona_Pavilion-Barcelona_Catalonia.html", "text": "One of the most modern influential modern  architectural  forces around. It is a beautiful example of toward thinking that existed in modern times in an evolving city. For those looking for a bit different place to go here it is", "publishedDate": "2016-09-30", "language": "en", "rating": 5}, {"id": 423631448, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d313686-r423631448-Barcelona_Pavilion-Barcelona_Catalonia.html", "text": "this building is a must see for anyone who is into architecture... even if you aren't into architecture that much, go and see it.. you will feel the fantastic space of the pavilion.. it is really something special.. you will se a movie about how pavilion was reconstructed and learn a lot about the idea behinee it... place is near Plaza Espana, and across from Caixa forum which is also beautiful building\n10/10", "publishedDate": "2016-09-29", "language": "en", "rating": 5}, {"id": 415996662, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d313686-r415996662-Barcelona_Pavilion-Barcelona_Catalonia.html", "text": "Architects should make the trip to see the reconstruction of this seminal building. Elegant, groundbreaking and exquisite. ", "publishedDate": "2016-09-07", "language": "en", "rating": 5}, {"id": 413438349, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d313686-r413438349-Barcelona_Pavilion-Barcelona_Catalonia.html", "text": "Only thing missing was a little drink. Incredible building well presented and great shop. I hate the columns made of oil barrels in the front but that's just me.", "publishedDate": "2016-09-01", "language": "en", "rating": 5}, {"id": 413313052, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d313686-r413313052-Barcelona_Pavilion-Barcelona_Catalonia.html", "text": "Well anyone who knows anything about modern architecture knows the building (to be precise the original to the reproduction) and will make sure to pass by. It's just awesome to see it. Will come back every time when in Barca. Quite an excellent bookshop. ", "publishedDate": "2016-08-31", "language": "en", "rating": 5}, {"id": 400589545, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d313686-r400589545-Barcelona_Pavilion-Barcelona_Catalonia.html", "text": "This pavilion was originally built in 1929 in 8 months, then taken down, however it was determined that its architectural importance required it be rebuilt on the very same footprint in 1983, although this time it took 3 years to build. Having been to other World's Fairs, I was initially letdown with the buildings simplicity, however sitting and contemplating changed my mind.", "publishedDate": "2016-08-02", "language": "en", "rating": 5}, {"id": 393593985, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d313686-r393593985-Barcelona_Pavilion-Barcelona_Catalonia.html", "text": "Not your usual popular tourist spot hence no crowd and plenty of space to enjoy this beauty by the famous Mies Van Der Rohe! What a piece and a great experience for us to have witness his architecture. ", "publishedDate": "2016-07-17", "language": "en", "rating": 4}, {"id": 392675361, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d313686-r392675361-Barcelona_Pavilion-Barcelona_Catalonia.html", "text": "I will start this review with this... DO NOT PAY THE FEE if you are not 100% interested in architecture or design history. I am a design student and I paid the 5euro fee to see this place and I thoroughly enjoyed it. But I could tell that there were people there that were not enjoying it so please be wise about entering. You can see the building from outside and that is probably what most people should see, as it is next to other museums, and inside has some Barcelona Chairs and a great little gift shop.", "publishedDate": "2016-07-14", "language": "en", "rating": 5}, {"id": 388303778, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d313686-r388303778-Barcelona_Pavilion-Barcelona_Catalonia.html", "text": "The architecture itself is with interesting design and high historical value. As a Bauhaus fan, it is definitely worth a visit, but I would say it might be not interesting for most of the people. There is no actual exhibition or curation but only the building itself with a small shop.", "publishedDate": "2016-07-01", "language": "en", "rating": 3}, {"id": 386164286, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d313686-r386164286-Barcelona_Pavilion-Barcelona_Catalonia.html", "text": "A must see for architecture students and enthusiasts. Very interesting pavilion reconstruction from the brink of modern architecture. Id seen so many pictures of it I wasn't sure if it was worth visiting but the light shade and materials are far more impressive in reality so highly recommend. ", "publishedDate": "2016-06-26", "language": "en", "rating": 5}, {"id": 384607481, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d313686-r384607481-Barcelona_Pavilion-Barcelona_Catalonia.html", "text": "A waste of time and money.  It's two pools that are about ten inches deep and a shiny building made out or marble slabs.  The gift shop is larger than the museum and the tin cans outside are probably cooler.  ", "publishedDate": "2016-06-21", "language": "en", "rating": 1}, {"id": 384606834, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d313686-r384606834-Barcelona_Pavilion-Barcelona_Catalonia.html", "text": "We like architecture designs and buildings, but honestly this does NOT worth to pay 5 euro when there's nothing to see.  We have had so much fun in Barcelona, but this is the only disappointment fr. All our visit.", "publishedDate": "2016-06-21", "language": "en", "rating": 1}, {"id": 379935330, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d313686-r379935330-Barcelona_Pavilion-Barcelona_Catalonia.html", "text": "This is worth a visit for anyone with an interest in architecture. Not sure it was entirely worth the entrance fee though.", "publishedDate": "2016-06-05", "language": "en", "rating": 4}, {"id": 374813927, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d313686-r374813927-Barcelona_Pavilion-Barcelona_Catalonia.html", "text": "After two days of Gaudi, it was very refreshing to visit the pavillion of Mies van der Rohe. A very quiet, Zen-like place. Beautiful use of materials and of the space available. It's rather small, but very pleasant to stay for awhile.", "publishedDate": "2016-05-20", "language": "en", "rating": 5}, {"id": 373015914, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d313686-r373015914-Barcelona_Pavilion-Barcelona_Catalonia.html", "text": "This was my second visit. Such a beautiful, peaceful place in the middle of the all the hustle and bustle of Barcelona. A must for architects and architecture fans.", "publishedDate": "2016-05-15", "language": "en", "rating": 5}, {"id": 369394734, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d313686-r369394734-Barcelona_Pavilion-Barcelona_Catalonia.html", "text": "Maybe to architects, this is a big deal.  They understand that the style was so new.  However, to the average person, it is not that impressive.", "publishedDate": "2016-05-01", "language": "en", "rating": 3}, {"id": 366660919, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d313686-r366660919-Barcelona_Pavilion-Barcelona_Catalonia.html", "text": "I personally didn't understand the hype of this, but I understand the significance. The reflecting pool is nice, and there's a statue in one of the inner areas. However, there is a few to enter and it takes approximately 5 minutes to view all that it has to offer. There are some great photo opportunities here, along with a pricey gift shoppe.", "publishedDate": "2016-04-23", "language": "en", "rating": 3}, {"id": 364076848, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d313686-r364076848-Barcelona_Pavilion-Barcelona_Catalonia.html", "text": "Brilliant structure, well maintained and not crowded at all. To enter the main pavilion there is an entrance fee, but to walk around outside on the open space is free.\nThey have a nice gift shop.", "publishedDate": "2016-04-14", "language": "en", "rating": 5}, {"id": 361434560, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d313686-r361434560-Barcelona_Pavilion-Barcelona_Catalonia.html", "text": "The words 'seminal' and 'iconic' are amongst the most overused in the English language, but in the case of the Barcelona Pavilion, they couldn't be more apt.  A great building, what seems to be a floating roof balanced by a few narrow posts.  \n\nThe downsides - the guy on duty at the entrance ('S') was only interested in chatting to his pretty colleague and not interested in taking admissions.  The gift shop shut down for no apparent reason at about 2PM (although it was supposed to be open all day).  It is, indeed, very small, and so transparent as to be almost completely visitable without actually entering/paying.  The location is as a side-show to the main exhibition buildings and was almost hidden at the time.  \n\nThe upsides - if you want to visit a great exercise in minimalism and see one of the simplest, and, at the same time, most sophisticated works of the period....then  you have got to go!", "publishedDate": "2016-04-04", "language": "en", "rating": 4}, {"id": 361356844, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d313686-r361356844-Barcelona_Pavilion-Barcelona_Catalonia.html", "text": "For those interested in the origins of modern architecture this is not to be missed.  I stop by every time I visit the city.", "publishedDate": "2016-04-03", "language": "en", "rating": 5}, {"id": 358516118, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d313686-r358516118-Barcelona_Pavilion-Barcelona_Catalonia.html", "text": "I have wanted to come here for a long time, and it was clear I was not the only one - pretty much everyone else there was a fellow fanboy/girl (or a patient travelling companion of one). This is a small, simple, compact, and vastly important building. It is not full of placardss telling you how to interpret it; there is not even much to it, really. Anyone who goes to look jsut on spec without caring about it will be disappointed. But if you have any curiosity about modernist architecture and design, if you want to get a feel for one of the foundation stuctures that informed much of the built environment we now live in, if you've heard about this place and have wondered whether it's worth the effort - then do it. Just go.", "publishedDate": "2016-03-25", "language": "en", "rating": 5}, {"id": 345248946, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d313686-r345248946-Barcelona_Pavilion-Barcelona_Catalonia.html", "text": "We are fans of Mies van der Rohe and were excited to be able to visit the Barcelona house.  What a disappointment.  There is nothing in the house except two Barcelona chairs.  The entry charge is exorbitant for what you see.   Tip:  take photos of the exterior (building and pool) and visit the art museum up the hill.", "publishedDate": "2016-02-05", "language": "en", "rating": 1}, {"id": 344939070, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d313686-r344939070-Barcelona_Pavilion-Barcelona_Catalonia.html", "text": "A small building from an exhibition with nothing in side worth the money. Admire outside and move on.", "publishedDate": "2016-02-04", "language": "en", "rating": 4}, {"id": 343830403, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d313686-r343830403-Barcelona_Pavilion-Barcelona_Catalonia.html", "text": "Adult ticket costs around 6 euros and students get a discount, and if you're interested in architecture, you must see it. Be sure to check out the small museum shop before going out. the only negative thing I'd say would be that there were many people in there just to take photos for instagram and I personally found that a little annoying but there's nothing bad I could say regarding the Pabellon itself.", "publishedDate": "2016-01-30", "language": "en", "rating": 5}, {"id": 340391238, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d313686-r340391238-Barcelona_Pavilion-Barcelona_Catalonia.html", "text": "Built as the German National Pavilion for the 1929 International Exhibition, this marvelous, minimalistic and exquisite architectural complex soon became inspiration for generations of architects. The Pavilion was disassembled after the exhibition and later, in the eighties, carefully reconstructed, using the same materials which were used by Mies - glass, steel and stones (Roman travertine, green Greek and Alpine marble and golden onyx).", "publishedDate": "2016-01-16", "language": "en", "rating": 5}, {"id": 338918808, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d313686-r338918808-Barcelona_Pavilion-Barcelona_Catalonia.html", "text": "This is a lovely place to enjoy beautiful architecture. It is a very relaxing place. The reflective pool, the lovely garden, and the building itself invite you to enjoy beauty.", "publishedDate": "2016-01-10", "language": "en", "rating": 5}, {"id": 338715862, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d313686-r338715862-Barcelona_Pavilion-Barcelona_Catalonia.html", "text": "This is a truly beautiful and tranquil spot in Barcelona and an iconic building. The craftsmanship and beauty of the design and stone is stunning and it is definitely worth a visit. The only slight disappointment was that we specifically visited on a Saturday morning in order to get a guided tour but the externally contracted tour guide didn't turn up. The staff at the pavilion were very apologetic and refunded us both our entrance and tour fees, but still a shame nonetheless. I would highly recommend anyone to pay this a visit if they are in Barcelona", "publishedDate": "2016-01-09", "language": "en", "rating": 4}, {"id": 337374696, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d313686-r337374696-Barcelona_Pavilion-Barcelona_Catalonia.html", "text": "My husband is an architect and had to see this building. Once we got there I was in awe along side him. Very minimal, yet extremely exquisite! Took many photos and none does it justice. Take a look people. Very nice!", "publishedDate": "2016-01-04", "language": "en", "rating": 5}, {"id": 334291214, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d313686-r334291214-Barcelona_Pavilion-Barcelona_Catalonia.html", "text": "This was a great visit. I didn't know anything about this building, but my mom really wanted to see it. It's such a beautiful Pabellon, simple and peaceful. If you want to get away from the city, it's a nice place to sit and read and watch the pools and reflect. Definitely worth the visit for the architecture.  ", "publishedDate": "2015-12-21", "language": "en", "rating": 5}, {"id": 333121371, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d313686-r333121371-Barcelona_Pavilion-Barcelona_Catalonia.html", "text": "A really interesting place to see the roots and origins of modern day architecture. Also a nice peaceful place to relax. ", "publishedDate": "2015-12-15", "language": "en", "rating": 4}, {"id": 332943161, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d313686-r332943161-Barcelona_Pavilion-Barcelona_Catalonia.html", "text": "Lost for words...\nThe Barcelona pavilion is an absolute bodily experience. Being one with the room, the space, light and materials. Fantastic! To get the best shot at seeing it alone - or with a limited amount of people, be sure to be there when they open (or even before) and you might get up to half an hour ALONE (in February!)  - depending on the time of year, naturally. \n", "publishedDate": "2015-12-15", "language": "en", "rating": 5}, {"id": 332622002, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d313686-r332622002-Barcelona_Pavilion-Barcelona_Catalonia.html", "text": "Beautiful materials used for this historic building. Husband is an architect so he appreciated being able to see a slice of architectural history.", "publishedDate": "2015-12-14", "language": "en", "rating": 3}]}}]