[{"locationId": 13970378, "name": "El Beso De Joan Fontcuberta", "placeType": "ATTRACTION", "reviewListPage": {"reviews": [{"id": 748198441, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d13970378-r748198441-El_Beso_De_Joan_Fontcuberta-Barcelona_Catalonia.html", "text": "Don't go all the way to Barcelona and not find \"The Kiss\" mural.  It is really cool!  As you get very close to it, you see that the mural is comprised of thousands of small pictures of couples.  If you are with your significant other, it is impossible not to sneak a long (real) kiss while gazing at this excellent art.\n\nSo where is it?  Not far from the center, near the big traditional Cathedral.  No more hints, you just need to explore that (very safe/nice) area and you will find it.  The hunt is fun, and the payoff is worth it!", "publishedDate": "2020-02-28", "language": "en", "rating": 5}, {"id": 738233888, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d13970378-r738233888-El_Beso_De_Joan_Fontcuberta-Barcelona_Catalonia.html", "text": "Beautiful mosaic with a wonderful meaning. Tucked away in a small courtyard. Definitely worth the walk to take a look and a photo. ", "publishedDate": "2020-01-10", "language": "en", "rating": 4}, {"id": 677431176, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d13970378-r677431176-El_Beso_De_Joan_Fontcuberta-Barcelona_Catalonia.html", "text": "Strolling around, taking photos of graffiti and street art, in the hidden corners of Barcelona, I bumped into this great work of art. As I found out, it was a compilation of 4000 pictures of citizens, printed on ceramic tiles, depicting the lovers kiss. Great work by Joan Foncuberta and a very refreshing sight.", "publishedDate": "2019-05-29", "language": "en", "rating": 5}, {"id": 669018790, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d13970378-r669018790-El_Beso_De_Joan_Fontcuberta-Barcelona_Catalonia.html", "text": "El Món Neix en Cada Besada (The World Begins With Every Kiss). Approaching the kiss of freedom mural in Plaça d’Isidre Nonell you’d be forgiven for assuming that it’s a large graffiti. As you get closer you’ll realise that it is in fact a mosaic made up of thousands of tiny ceramic tiles. Each individual tile is printed with a photo of a person, a place, a moment, an event or something which in some way represents an expression freedom. ", "publishedDate": "2019-04-24", "language": "en", "rating": 4}, {"id": 642068009, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d13970378-r642068009-El_Beso_De_Joan_Fontcuberta-Barcelona_Catalonia.html", "text": "This mosaic tells the story of two lips kissing celebrating Barcelona's freedom in the 18th century. The mosaic is around 6ft x 12ft and made up of hundreds of little 2 inch tiles incorporating photos. Stunning to see.", "publishedDate": "2018-12-28", "language": "en", "rating": 4}, {"id": 624760103, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d13970378-r624760103-El_Beso_De_Joan_Fontcuberta-Barcelona_Catalonia.html", "text": "We never, ever would have found this truly astounding photo mosaic mural if it hadn't been situated right beneath our hotel window. From the third floor vantage point we didn't understand why tour groups were gathering in the tiny courtyard next door, and really couldn't fathom why love-struck young couples were posing in front of the seemingly blank wall below. We had to see what all the fuss was about. \n\nWe took a peek into the tiny plaza and STILL didn't see what all the fuss was about. What was it? It looked like a washed out bunch of tiles and we absolutely couldn't make out any design or image. But, when in Rome (or Barcelona) do as they do, so Peter and I asked a nice young couple to take our picture in front of the wall.\n\nAnd what turned up in the picture astounded us! That seemingly blurry wall turned out to be a stunning mural of a pair of lips kissing, and in the daylight for some magical reason the image can't really be seen. If you go at night or if the lighting is cloudy and dull you can see the image, but not in the full light.\n\nThe story behind the mural is just as stellar. It is called The World Begins With Every Kiss and it was conceptualized to honor freedom. The artist worked with a local paper to collect hundreds of thousands of photos that were sent in, each one representing what the first taste of freedom meant to the individual. The result is this romantic and enduring vision which, like freedom, can be elusive if not viewed in the right light.", "publishedDate": "2018-10-14", "language": "en", "rating": 5}, {"id": 621618479, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d13970378-r621618479-El_Beso_De_Joan_Fontcuberta-Barcelona_Catalonia.html", "text": "What an eye catching and fascinating piece of public art! The World Begins With Every Kiss is a wonderful and large mosaic mural created by Joan Fontcuberta in 2014 as part of Barcelona’s tricentennial celebrations. From a distance you see an arresting mural of two sets of lips kissing. From close up, however, you see that it is a mosaic made up of thousands of small tiles, each with a photograph.  The mural is slightly tucked away from heavily travelled streets. It is, however, very close to Plaça Nova and Barcelona Cathedral. Well worth seeking out when you are in the area. ", "publishedDate": "2018-10-02", "language": "en", "rating": 4}]}}]