[{"locationId": 8614069, "name": "Flirty Giraffe", "placeType": "ATTRACTION", "reviewListPage": {"reviews": [{"id": 706701343, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d8614069-r706701343-Flirty_Giraffe-Barcelona_Catalonia.html", "text": "Interesting scultpture showing a Giraffe in an flirty pose, located at the start of the Rambla street, worth a look while talking a walk in the area. There is also a second one at the other end of the Rambla street. ", "publishedDate": "2019-09-04", "language": "en", "rating": 4}, {"id": 689546384, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d8614069-r689546384-Flirty_Giraffe-Barcelona_Catalonia.html", "text": "At the end of the Rambla de Catalunya, on the corner of Avinguda Diagonal is this sculpture. It has to be one of the weirdest, most surreal sculptures I’e ever seen. It features giraffe in a anthropomorphic sexy pose in what would normally be a lady lying flirtatiously on her side, by the edge of a bed.\n\nVery amusing!", "publishedDate": "2019-07-14", "language": "en", "rating": 5}, {"id": 676068313, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d8614069-r676068313-Flirty_Giraffe-Barcelona_Catalonia.html", "text": "Flirty Giraffe is a beautiful piece of art and it occupies a very central part of Barcelona. You can't miss it if you are passing that way. We were surprised to come across such a strange artwork, but we found it very likeable, funny, unusual and quite lovely. It seems to be a sort of seductive heroine waiting for her hero, who could, in all likelihood be the Bull, the sculpture sitting right across the other end of the road, at some distance, of course. But the Bull, quite obviously, has not made his move, yet!!! This is definitely a must see, at least if you are in the vicinity.", "publishedDate": "2019-05-24", "language": "en", "rating": 5}, {"id": 672159289, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d8614069-r672159289-Flirty_Giraffe-Barcelona_Catalonia.html", "text": "The defenders of the Rambla used art to prevent it from becoming a boulevard, which would have broken the initial design with a central causeway and two rows of trees.\n\nIn 1972, a well-known sculptor and engraver Josep Granyer made two animal sculptures, one giraffe to be placed at the Diagonal intersection and one bull at the Gran Via intersection. \n\nSo the Rambla between Diagonal and Gran Via was changed to an art park and the road project was stopped.", "publishedDate": "2019-05-07", "language": "en", "rating": 4}, {"id": 587576395, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d8614069-r587576395-Flirty_Giraffe-Barcelona_Catalonia.html", "text": "Loved this item, right in place of the area of modern art in a classic district. Fun to take pictures here and in a very prominent  spot for the. City.  Great that art is such a big deal here.", "publishedDate": "2018-06-15", "language": "en", "rating": 4}, {"id": 504186370, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d8614069-r504186370-Flirty_Giraffe-Barcelona_Catalonia.html", "text": "Found this statue a couple of blocks from our hotel. Like so much art in Barcelona, just take it at face value.", "publishedDate": "2017-07-21", "language": "en", "rating": 4}, {"id": 495677887, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d8614069-r495677887-Flirty_Giraffe-Barcelona_Catalonia.html", "text": "In the centre of a nice square this weird giraffe deserves a visit eventhough it's not easy to find. Cool place, and friendly people in that square", "publishedDate": "2017-06-24", "language": "en", "rating": 3}, {"id": 386564989, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d8614069-r386564989-Flirty_Giraffe-Barcelona_Catalonia.html", "text": "Took us a while to find it but my wife loved this, took a bunch of pictures and she was super happy that we found it....", "publishedDate": "2016-06-27", "language": "en", "rating": 4}, {"id": 341829653, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d8614069-r341829653-Flirty_Giraffe-Barcelona_Catalonia.html", "text": "Josep Granyer, Barcelonan sculptor, engraver and illustrator, made two well-known sculptures in which animals imitate human behavior. Both of them are located on the opposite sides of Rambla de Catalunya. This one, at the crossroad with Avinguda Diagonal, shows a giraffe in a pretty undignified position.", "publishedDate": "2016-01-21", "language": "en", "rating": 5}]}}]