[{"locationId": 7820170, "name": "Museum of World Cultures", "placeType": "ATTRACTION", "reviewListPage": {"reviews": [{"id": 713125476, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d7820170-r713125476-Museum_of_World_Cultures-Barcelona_Catalonia.html", "text": "I wonder how many of the thousands of people who shuffle around the Picasso Museum each day actually cross the road and go into this wonderful place?\n\nIt is the finest ethnographic museum I have ever visited. There are wonderful displays of artefacts from America, Asia, Africa and Oceania.  An incredible variety of art, religious artefacts, canoes, costumes, etc. \n\nEverything is really well displayed. Highly recommended and free with the Barcelona Card.", "publishedDate": "2019-09-26", "language": "en", "rating": 5}, {"id": 710011708, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d7820170-r710011708-Museum_of_World_Cultures-Barcelona_Catalonia.html", "text": "Here i am again, admiring a museum's collection but despising its presnetation.\n\nIn this museum, you will find artifacts from pre-Colonial culrures in Asia, Africa, Oceania, and South America. In some ways it's great--there's a display of a globe on the way in that takes you from culture to culture, east to west and around the world once more--it's billiant.\n\nThen you enter the exhibits, and you are treated like a barnyard animal--forced to follow their path whether you want to or no. You find wonderful artifacs but they're not labelled clearly--it might be in one or three or four languages, it might be on the floor where it's hared for the visually impaired to read, you might not know which culture the piece is from, there might be a map showing the culture or there might not.\n\nI wish museum directors would be educated in how to communicate with the public. This could have been a wonderful experience, but the presentation was just too amateurish.", "publishedDate": "2019-09-15", "language": "en", "rating": 4}, {"id": 667184891, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d7820170-r667184891-Museum_of_World_Cultures-Barcelona_Catalonia.html", "text": "I did not know about this museum when I started out on my walk. But it was an easy decision to tour it when I saw the long queue for the Picasso Museum and it was free. Then I walked in and saw many wonderful exhibits, in various languages, so I could understand. I learned a lot that day. I definitely recommend including this museum on your tour.", "publishedDate": "2019-04-17", "language": "en", "rating": 4}, {"id": 662705982, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d7820170-r662705982-Museum_of_World_Cultures-Barcelona_Catalonia.html", "text": "You can either forget the Picasso Museum and go here instead or this collection will make you forget it anyway. My experience was the latter, but I did note where Picasso got his ideas from. This is an exceptional collection of Ethnographics art and antiquities from many regions that I had never even heard of. The examples from each region are particularly fine, well presented and accessible. The influences on each other and artists through the centuries appears obvious. There is a great temporary exhibit at the moment on two local artists that travelled to South and Central America, achieved acclaim, but could never afford the passage home. I hope we appreciate artists more now...", "publishedDate": "2019-04-01", "language": "en", "rating": 5}, {"id": 662701559, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d7820170-r662701559-Museum_of_World_Cultures-Barcelona_Catalonia.html", "text": "We spent nearly 3hours wandering around this museum. It has everything and is so overlooked. If I’d known how good it was I would have skipped the Picasso altogether and just looked here at his inspirations", "publishedDate": "2019-04-01", "language": "en", "rating": 5}, {"id": 662447134, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d7820170-r662447134-Museum_of_World_Cultures-Barcelona_Catalonia.html", "text": "I think this place gets (unfairly) overlooked because it’s right across from the Picasso museum. I had a great Saturday afternoon taking in the wonderful exhibits—definitely a nice counterbalance to the Eurocentricness of many other tourist attractions in Barcelona. ", "publishedDate": "2019-03-31", "language": "en", "rating": 5}, {"id": 656342080, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d7820170-r656342080-Museum_of_World_Cultures-Barcelona_Catalonia.html", "text": "I have to say that although I've passed a lot of times by this place, have never been aware of it.\n\nAs it's face to face with Picasso Museum, probably this cause people don't be aware of it.\n\nBut it really deserves a visit.\n\nIt comprises items from different cultures around the globe. From masks to religious items. Every item has a text description written in Spanis, Catalan and English. This helps to know what the item is about.\n\nThe building is a old building, but there is an elevator. There are three floors, and the time to visit it it's around 1-2 hours.\n\nI recommend it to anyone interested in other cultures, like Maya, Asian, etc, most of them unkown to us.", "publishedDate": "2019-03-04", "language": "en", "rating": 4}, {"id": 617302444, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d7820170-r617302444-Museum_of_World_Cultures-Barcelona_Catalonia.html", "text": "What a great ethnology museum. Really the best-of-the-best from all over the world. I believe it exceed the Chicago Field Museum in ethnology. We saw things in this museum never seen anywhere else. Across the street from the Picasso museum.", "publishedDate": "2018-09-17", "language": "en", "rating": 5}, {"id": 616368061, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d7820170-r616368061-Museum_of_World_Cultures-Barcelona_Catalonia.html", "text": "Stumbled upon this exhibition because the Picasso Museum (directly opposite) had a massive queue. A very large collection of artefacts from around the world, beautifully and thoughtfully displayed. There were very few other people which meant we could take our time. The special exhibition was all about selfies and was fascinating, very detailed and a fun contrast while still being in cultural context. Don’t miss this gem!", "publishedDate": "2018-09-13", "language": "en", "rating": 5}, {"id": 583103791, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d7820170-r583103791-Museum_of_World_Cultures-Barcelona_Catalonia.html", "text": "An amazing colletion! Such a beautiful display of art! So well kept! And clean! Just amazing! Must visit!", "publishedDate": "2018-05-27", "language": "en", "rating": 5}, {"id": 582327465, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d7820170-r582327465-Museum_of_World_Cultures-Barcelona_Catalonia.html", "text": "Chanced upon this primarily because I ended up being too early for my \"skip the line\" ticket at the Picasso Museum. The staff is welcoming and provide sufficient detail to be aware of both the highlight pieces as well as the permanent exhibits. \n\nIf you allocate 2-3 hours for taking in the entire exhibition do remember to use the audio-guide. The multimedia learning room is a fun place to learn new things. The exhibits have good annotations and arranged in a manner that provides a reasonably complete picture of the culture of the geographical block identified.", "publishedDate": "2018-05-23", "language": "en", "rating": 5}, {"id": 573489083, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d7820170-r573489083-Museum_of_World_Cultures-Barcelona_Catalonia.html", "text": "A lovely museum of artefacts from around the world. Well displayed and annotated in English, Spanish and Catalonian. \n\nOur intention was to go to the Picasso museum but on a rainy day the queue was still long, so we went in here instead. Warm, dry, calm and empty! An enjoyable stroll perusing historical artefacts. ", "publishedDate": "2018-04-15", "language": "en", "rating": 5}, {"id": 572211511, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d7820170-r572211511-Museum_of_World_Cultures-Barcelona_Catalonia.html", "text": "This was a very basic museum and the staff was super rude like we were a bother. It was free on the day we visited otherwise I would have rated it lower.  It is all non-europeon pieces and not very interesting at all.", "publishedDate": "2018-04-09", "language": "en", "rating": 3}, {"id": 569941096, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d7820170-r569941096-Museum_of_World_Cultures-Barcelona_Catalonia.html", "text": "There are many interesting pieces at this museum. Particularly the Africa and Oceanianic areas. The museum is well laid out and staff were very friendly and helpful. We spent an hour there while waiting for our prebooked slot at Picasso. For me and my family we preferred the Museum of world cultures to the Picasso museum. Next time I visit, I will allow more time and get the audio guide to provide further information. ", "publishedDate": "2018-03-31", "language": "en", "rating": 5}, {"id": 543777329, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d7820170-r543777329-Museum_of_World_Cultures-Barcelona_Catalonia.html", "text": "Interesting place with rooms for different regions with art from those times and places. Enjoyed it, even though some regions were not covered.", "publishedDate": "2017-11-28", "language": "en", "rating": 4}, {"id": 540644986, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d7820170-r540644986-Museum_of_World_Cultures-Barcelona_Catalonia.html", "text": "This is one of the very best museums I have ever visited.  The low entrance fee provides access to a brilliantly curated exhibition of art and cultural objects from Africa, Asia, America and Oceana.  Each collection is sufficient to showcase the beauty, fearsomeness, or other characteristics of its related culture.  Every object matters and no object is superfluous.  Highly recommended.", "publishedDate": "2017-11-13", "language": "en", "rating": 5}, {"id": 532124499, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d7820170-r532124499-Museum_of_World_Cultures-Barcelona_Catalonia.html", "text": "The museum is located in a beautiful zone of Barcelona. The entry fee was cheap (around 5-6 euro per person). They had about 5-6 exposition went we went. It was a good activity for a rainy day or a extremely hot day!", "publishedDate": "2017-10-11", "language": "en", "rating": 4}, {"id": 528833721, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d7820170-r528833721-Museum_of_World_Cultures-Barcelona_Catalonia.html", "text": "Gem of a Museum is World Cultures is only a 5 € entrance fee.\n\nIt is directly across from the Picasso Museum and no one realizes it is right there.\nWell laid out and plenty of text to read on each and every object, in Spanish and English.\n\nWell designed and nothing feels crowed as items are spread across three different floors.   \nSculptures, drawings, jewelry from Africa to Asia and Oceana, through Thailand, Korea, Japan, and more...\n\nGO and enjoy the beautiful history of these objects from the dawn of time and take a moment to just relax.", "publishedDate": "2017-10-01", "language": "en", "rating": 5}, {"id": 507923598, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d7820170-r507923598-Museum_of_World_Cultures-Barcelona_Catalonia.html", "text": "We loved this place.  Surprisingly it was empty, we were the only ones there.  They have a ton to offer.  Every culture is represented in this museum.  There are several floors, it starts out with the african culture and it goes on to asian, mesoamerican, etc.  I would definitely recommend going to this museum.  If you have to choose between this and the Picasso museum choose this one, it has a lot more to offer.", "publishedDate": "2017-08-01", "language": "en", "rating": 5}, {"id": 505589756, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d7820170-r505589756-Museum_of_World_Cultures-Barcelona_Catalonia.html", "text": "A walk through some cultures in Africa, Asia, Oceania and America. Certainly, not the British Museum, yet very nice items, you will feel like Indiana Jones. They used to have this collection in Montjuïc a few years ago and I missed it...a pleasure to rediscover amidst a medieval palace and right in front of the Picasso Museum.\n\nThe interactive room in the upper store is very nice too. Children can enjoy the music, recipes and languages of the same cultures they just saw.", "publishedDate": "2017-07-25", "language": "en", "rating": 5}, {"id": 494538299, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d7820170-r494538299-Museum_of_World_Cultures-Barcelona_Catalonia.html", "text": "OK, I admit it: I went to the Museum of World Cultures because it proved impossible to visit the museum Picasso. But then I was blown away by the pieces in this museum, and also the information provided is very interesting and well-written. It's certainly worth a visit!", "publishedDate": "2017-06-20", "language": "en", "rating": 4}, {"id": 481635113, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d7820170-r481635113-Museum_of_World_Cultures-Barcelona_Catalonia.html", "text": "We intended to go to the Picasso Museum before heading back to the airport, but the queue was long and not moving much. Just up the way we found this gem of a museum. The collection has artistic endeavours representative of cultures from Africa, Oceania, Asia and the Americas demonstrating cultural diversity of art and beliefs.\n\nWe were able to enjoy the exhibit to the maximum since there are lockers available to leave bags and hand luggage and we didn't need to take the luggage round with us.", "publishedDate": "2017-05-04", "language": "en", "rating": 5}, {"id": 475475874, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d7820170-r475475874-Museum_of_World_Cultures-Barcelona_Catalonia.html", "text": "As we were assessing the queue for the Picasso Museum we saw, directly opposite the Picasso entrance, the Museum of World Cultures. Since we have an interest in world cultures, especially Africa, we thought it worth a try. It turned out to be the best thing we saw in Barcelona. Away from all the crowds, the exhibits are beautifully presented with good short information about each (in Spanish, Catalan and English) and in a lovely setting of an old Barcelona town house. The exhibition is organised into continents with representative statues, icons, carvings clearly marked and easy to follow directions. There are short videos available about each area and including a history of how the objects came to be in the museum. This clearly places ethnographic collecting in the context of colonial exploration and appropriation. I cannot recommend this museum highly enough to anyone with any interest in world cultures. You can travel all round the world in just a couple of hours without getting on a plane!", "publishedDate": "2017-04-14", "language": "en", "rating": 5}, {"id": 472753581, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d7820170-r472753581-Museum_of_World_Cultures-Barcelona_Catalonia.html", "text": "This museum is just across the street from the Picasso Museum and I think the more famous place puts it a bit in shadow, but it is absolutely worth to see! For a very friendly entry price, compared to other attractions. \nI missed North America and the native american cultures. \nNice and informative - unfortunately not everything is available in english.", "publishedDate": "2017-04-04", "language": "en", "rating": 4}, {"id": 454227062, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d7820170-r454227062-Museum_of_World_Cultures-Barcelona_Catalonia.html", "text": "Be a rebel, don't go to the Picasso Museum but take opposite place! In Picasso Museum you can't see his most important works (so to wait in 100m queue on sunday afernoon is just a waist of time) but in Museu de Cultures del Mon (just opposite to the Picasso) for a only 2,2 euro (or for free) you can see a huge collection of art from Africa, Asia, Oceania or America with interesting commentary (in english too). I spend there almost 2 hours and it was excellent experience.", "publishedDate": "2017-01-23", "language": "en", "rating": 5}, {"id": 421581968, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d7820170-r421581968-Museum_of_World_Cultures-Barcelona_Catalonia.html", "text": "Across the street from the Picasso Museum is the Museum of World Cultures, i.e. Non-European Art.  It contains objects from Barcelona's own Ethnology Museum and loans from the Folch Foundation. Some regions are well represented in the Museum such as India, while others with a long history such as China do not have as many objects to display.\n\nIt starts with the Arts of Africa on the ground floor.  West coast Sub-Saharan Africa is the main source of the display with also a small display of Ethiopian Christian Art.  \n\nMoving upstairs to the first floor it begins with the art of Oceania.  This leans heavily on works from New Guinea but native Australian works are also on show.\n\nFurther on this floor are works from India or within its cultural sphere (Burma, Thailand, etc.)  The main traditions in India are all on display; Hindu, Buddhist, Jain and Muslim/Mughal. Indonesia also has Hindu works on this floor.\n\nA large part of the second floor is given over to Pre-Colombian works. Those from Meso America are from the Mayan, Aztec and other cultures. \n\nThose objects from South America are from the Peru region and are not just Pre-Colombian but also Pre-Incan.  It contains a number of Moche stirrup vessels.\n\nThe size of the East Asian collection is small compared with the others.  Japanese works are diverse split between prints, ceramics, etc. while China has very few items on display and Korea a small number of ceramics.\n\nOverall a very good museum for this material but gaps in the collection are noticeable.\n\nNotes; Open Tuesday to Sunday.  If you have the Barcelona Card it is included in the price of this.", "publishedDate": "2016-09-23", "language": "en", "rating": 5}, {"id": 419727574, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d7820170-r419727574-Museum_of_World_Cultures-Barcelona_Catalonia.html", "text": "Good way to spend an hour, nicely laid out and plenty to read. Gets a bit samey by the third floor..", "publishedDate": "2016-09-18", "language": "en", "rating": 3}, {"id": 418076846, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d7820170-r418076846-Museum_of_World_Cultures-Barcelona_Catalonia.html", "text": "Although I found the content of this museum a bit statue-heavy (there could have been more variety), we definitely enjoyed seeing these artifacts. There were also some interesting tools used by various cultures throughout history. The exhibits covered Asia, Oceania, the Americas, Africa and Europe. If you appreciate sculptures/carvings and are interested in seeing them from a number of interesting cultures from across the globe, this is definitely the place for you. Very close to La Rambla, right across from the Picasso Museum. Most content is translated into English.", "publishedDate": "2016-09-13", "language": "en", "rating": 3}, {"id": 389874708, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d7820170-r389874708-Museum_of_World_Cultures-Barcelona_Catalonia.html", "text": "It's pleasant cool down after Museu Picasso. Interesting and informative; good to learn tribal peoples' life around the world. The building itself is amazing, also the street where it takes place. Kept the original features.", "publishedDate": "2016-07-06", "language": "en", "rating": 4}, {"id": 370955110, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d7820170-r370955110-Museum_of_World_Cultures-Barcelona_Catalonia.html", "text": "lot's of things on display, organized by country. Personally i found it boring but some can find this interesting i guess.\n\nFound this by accident when exiting the picasso museum luckily it was free with barcelona card.", "publishedDate": "2016-05-07", "language": "en", "rating": 3}, {"id": 365473401, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d7820170-r365473401-Museum_of_World_Cultures-Barcelona_Catalonia.html", "text": "This was not only a very informative museum, covering cultures of Asia, Africa and Pacific Islands, but it was housed in two fantastic houses, which were very interesting in themselves. We found it by chance, as it is opposite the Picasso museum, but it warrants much more attention as a worthwhile attraction in Barcelona.", "publishedDate": "2016-04-19", "language": "en", "rating": 5}, {"id": 364131399, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d7820170-r364131399-Museum_of_World_Cultures-Barcelona_Catalonia.html", "text": "Colonial pillaging aside, this is a great little attraction across the street from the Picasso museum. \n\nFree to enter on a Sunday and really quite quiet in the shadow of its more popular rival, this place has a vast collection that is genuinely interesting, with historic detail given in both the artefacts and the cultures they come from. \n\nYou won't go here of you have only hit the weekend, but if you have a bit longer it's well worth a visit. ", "publishedDate": "2016-04-14", "language": "en", "rating": 4}, {"id": 361112849, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d7820170-r361112849-Museum_of_World_Cultures-Barcelona_Catalonia.html", "text": "A beautiful museum, just opposite the Museu Picasso. The artifacts, from different cultures around the world, are amazing and well displayed in the museums spacious galleries. The museum is set in the Casa Marques de Llio and the Casa Nadal, which retain much of their character, whilst the displays look great set against this backdrop. There is a particularly beautiful old ceiling on the first floor. The artifacts are not overcrowded, well lit and clearly explained in several languages, and the staff are also very helpful adding to the atmosphere of history and awe. The museum has been open for a year or more and is a great discovery set in the backstreets of old Barcelona.", "publishedDate": "2016-04-03", "language": "en", "rating": 5}, {"id": 358786029, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d7820170-r358786029-Museum_of_World_Cultures-Barcelona_Catalonia.html", "text": "This museum was such a pleasant surprise! It is way larger than expected and it is so well put together with very interesting explanations. It is a journey through the world's cultures and ethnicities,  a lot of which I had not heard before! If you are interested in archeology or ancient history,  put it top of your list. ", "publishedDate": "2016-03-26", "language": "en", "rating": 5}, {"id": 335885806, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d7820170-r335885806-Museum_of_World_Cultures-Barcelona_Catalonia.html", "text": "Taste may differ, but I found this museum boring. Bare and sterile, lots of objects on display organized geographically but without any other proper context or relationship to each other so it is hard to really understand or appreciate them or the cultures that created them. Why has this museum come about, how have all these objects arrived here? You don't get much information on that. It is like an encyclopedia with isolated entrances. There was a temporary exhibition about the art of writing which was very informative, otherwise not worth while in comparison to other world culture museums we have seen. Lucky for us we visited on a Sunday after 15:00 when the entrance was free.", "publishedDate": "2015-12-29", "language": "en", "rating": 2}, {"id": 323941370, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d7820170-r323941370-Museum_of_World_Cultures-Barcelona_Catalonia.html", "text": "It's new, in the old Barbieri-Muller location, with another medieval mansion added I believe. I don't know how the City council does this: turns mediaeval mansions into superb, world-class museums for very reasonable entry prices.... This one's new for 2015, they've done a superb job, lots of information intelligently presented.  A bit like some of the Museum of Natural History in NY, but without the old dioramas, just carefully chosen pieces of excellent quality from 70 odd years of collecting by folks who knew what they were doing. A wonderful experience. Pleasant helpful staff, you can go out for lunch and return. The usual lockers with returnable 1 euro locks, so civilised.", "publishedDate": "2015-11-02", "language": "en", "rating": 5}, {"id": 320257485, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d7820170-r320257485-Museum_of_World_Cultures-Barcelona_Catalonia.html", "text": "My wife and I enjoyed seeing this museum. The museum is quite big and all areas of the world are covered. One can see much primitive art here. We met a young man in the museum who had plenty of information about the museum and he was very informative and very simpatico.", "publishedDate": "2015-10-19", "language": "en", "rating": 5}, {"id": 313031074, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d7820170-r313031074-Museum_of_World_Cultures-Barcelona_Catalonia.html", "text": "A fascinating small museum covering Africa, Asia, the Americas and Oceania explaining the cultural diversity of the various populations over the decades. Spread over 3 floors this will appeal to both adults and children. Not very busy and therefore a pleasure to be able to wander at your own pace. Well worth the €5 entrance (reduced to €3.50 for under 16's and over 65's).", "publishedDate": "2015-09-23", "language": "en", "rating": 4}, {"id": 298719331, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d7820170-r298719331-Museum_of_World_Cultures-Barcelona_Catalonia.html", "text": "Eye-openning, thrilling, beautiful pieces of art from all around the world, very interesting and of high educational value", "publishedDate": "2015-08-13", "language": "en", "rating": 5}, {"id": 294218122, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d7820170-r294218122-Museum_of_World_Cultures-Barcelona_Catalonia.html", "text": "Went here because we were turned away from the Picasso museum.  Only 5 euros to get in and well worth it.  Lots of exhibits from around the world including masks and statues. The temporary exhibition on writing is very interesting and the interactive task is great fun.", "publishedDate": "2015-07-30", "language": "en", "rating": 4}, {"id": 292743561, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d7820170-r292743561-Museum_of_World_Cultures-Barcelona_Catalonia.html", "text": "We were not planning to go to this museum. We saw a long queue outside the Picasso museum and was wondering what to do, our 8 year old son wanted to go so we have decided to go. Their permanent collection which have variety of exhibits from all over the world are beautifully presented and easy to browse around, Even if you don't have any interest in the area you will appreciate the beautiful and unique exhibits. In addition to all the collection, the museum itself has been resotored beautifully and I was busy checking out their different woodworks of the ceilings in different rooms. It was very quiet and not many people around. It was air conditioned everywhere so we cooled ourselves down from the heat outside.", "publishedDate": "2015-07-26", "language": "en", "rating": 5}, {"id": 288051406, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d7820170-r288051406-Museum_of_World_Cultures-Barcelona_Catalonia.html", "text": "The most extraordinary and beautifully curated exhibition of world indigenous artefacts I have ever seen. Easily matching what is on display at the British Museum. And no one here! All in beautifully conserved medieval Catalan houses.what is most amazing is that works like these informed  Picasso's cubist period, and the thousands that flock to the Picasso museum right next door ( you can literally see right into it through the windows ) don't come inside.", "publishedDate": "2015-07-11", "language": "en", "rating": 5}, {"id": 285799298, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d7820170-r285799298-Museum_of_World_Cultures-Barcelona_Catalonia.html", "text": "We went to Museu de Cultures del Món in July 2015.\n\nPros: Really interesting, well-displayed, fantastic museum. Everything is new and clean. The explanations in Catalan, Spanish and English are very detailed and the lighting is really good - it's just me or there are lots of museums out there with poor and/or strange illumination?\n\nThe exhibition is split in four: you start with Africa, then walk through Oceania, Asia (the biggest part) and America in the end. While there are fewer pieces than in other ethnographic museums we've been to (like Museé Du Quay Branly in Paris), it is a good selection and everything is well represented, especially Papua New Guinea and India.\n \nWe loved the \"Research room\", where they have five computers filled with traditional music, videos and all kind of information to complete and expand what you see on the displays. There is also a little \"cinema\" (a big screen with seats in front of it) where you can watch short stories from all around the world (in Catalan, Spanish, English and French), about 5 minutes each. They are kid-oriented but we liked them very much, give it a try!\n\nThe buildings where the museum is located are like another piece of art. Very similar to the one that hosts the Picasso Museum, they tell the story of the old Barcelona, from medieval times to the present: there are some scattered panels through the museum with explanations about the rooms.\n\nCons: Nothing. Well, the temperature of the air-conditioning was set too low for me, but I'm always cold, so you'll probably be OK. Anyway, I don't know if it has something to do with the conservation, but bring a jacket if you happen to be like me :)\n\nPractical tips: Lockers available (the big ones can fit a suitcase).\n\nFree wi-fi spots all around the museum. \n\nCompletely wheelchair-friendly, and also adapted for deaf and blind people.\n\nFree on Sunday afternoons and evenings (15h - 20h).\n\nSave at least two hours, three if you can!\n\nGreat location, just in front of Picasso Museum.\n\nOverall: We loved it! It's very new (just opened in January this year) but it totally deserves to become one of the most visited museums in Barcelona. Just go there and see it by yourself!", "publishedDate": "2015-07-05", "language": "en", "rating": 5}, {"id": 269284981, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d7820170-r269284981-Museum_of_World_Cultures-Barcelona_Catalonia.html", "text": "We stumbled across this museum because we were going to the Picasso museum (they are opposite each other). We tried it and found it was really cheap (only @3.50 each) and very enlightening. Worth a visit.", "publishedDate": "2015-05-01", "language": "en", "rating": 4}]}}]