[{"locationId": 592217, "name": "Placa Sant Felip Neri", "placeType": "ATTRACTION", "reviewListPage": {"reviews": [{"id": 752118172, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d592217-r752118172-Placa_Sant_Felip_Neri-Barcelona_Catalonia.html", "text": "We visited here on a walking tour of the Gothic Quarter.  A romantic and quaint square with a sad tale to tell.  Once it was stories of firing squads but the hidden truth was that 153 people were killed here on 30 January 1938 in a bomb attack, most of them orphans.\nThe square is also home to a church that the incredible Anton Guadi visited daily.  He was on his way here when he was hit by a tram and subsequently died from his injuries.", "publishedDate": "2020-03-31", "language": "en", "rating": 5}, {"id": 728886650, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d592217-r728886650-Placa_Sant_Felip_Neri-Barcelona_Catalonia.html", "text": "Plaza de Sant Felip Neri near L’esplender del barrow catala shows the damage to the walls from the Italian bombing in their civil war.  The bombing was on the church filled with orphans—30 died immediately and another 12 later on.  Antoni Gaudi came to this church daily and was hit by a tram June 7, 1926 on his way to his daily confession.  People did not recognize him and thought he was a beggar more or less leaving him to die as a pauper would.  He died two days later at 73 years old.", "publishedDate": "2019-11-25", "language": "en", "rating": 4}, {"id": 722384680, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d592217-r722384680-Placa_Sant_Felip_Neri-Barcelona_Catalonia.html", "text": "Small and unassuming, this placa is easy to miss, but it bears a moment of quiet contemplation. A terrible tragedy occurred here and the signage tastefully directs your attention to the historical features of the placa. The single cafe has tables and an attentive staff to serve drinks and tapas for a quiet rest in the heart of the Gothic quarter, away from the hustle and bustle.", "publishedDate": "2019-10-29", "language": "en", "rating": 4}, {"id": 722297596, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d592217-r722297596-Placa_Sant_Felip_Neri-Barcelona_Catalonia.html", "text": "I was on a walking tour, when we went here.  It is awful what has happened here in the past.  It was nice to see lots of children playing in this area again.  When I initially went here it was busy, but I went here again later on in the day on my own, to read more about its history.  It was quiet when I went on my own.", "publishedDate": "2019-10-29", "language": "en", "rating": 3}, {"id": 712566775, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d592217-r712566775-Placa_Sant_Felip_Neri-Barcelona_Catalonia.html", "text": "We stumbled upon this quiet little square on our way to somewhere else. We didn't know exactly where we were at first, but then we saw the pockmarks on the walls and realized we had read about this site. During the Spanish Civil War, Franco's forces hit this area with aerial bombs - first the church, and then, as people were busy carrying out survivors, the square in front of it. Most of the 42 dead were children. It's not a busy place, so it's easy to look at the scarred buildings and reflect on how humanity can chew itself up at times.", "publishedDate": "2019-09-24", "language": "en", "rating": 5}, {"id": 711500121, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d592217-r711500121-Placa_Sant_Felip_Neri-Barcelona_Catalonia.html", "text": "This square is truly a gem. It's tucked away from the busy Las Ramblas and offers a place to sit and relax. The church in this square played an important role in the civil war and the marks of those times are still visible on the outside of the church. While a great place to contemplate what happened there are also a few recommended shops and places to sit and get some food and drinks.", "publishedDate": "2019-09-20", "language": "en", "rating": 5}, {"id": 707823417, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d592217-r707823417-Placa_Sant_Felip_Neri-Barcelona_Catalonia.html", "text": "We found this little oasis of quiet and sat having an ice cream and admiring the buildings for a while. ", "publishedDate": "2019-09-08", "language": "en", "rating": 5}, {"id": 707286860, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d592217-r707286860-Placa_Sant_Felip_Neri-Barcelona_Catalonia.html", "text": "During the Spanish civil war, the square was the center of conflict and bombings! The shrapnel has destroyed part of the church's facade, and you can see this now, since they have left it as a reminder of the wounds and suffering Barcelona went through.", "publishedDate": "2019-09-06", "language": "en", "rating": 5}, {"id": 706358351, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d592217-r706358351-Placa_Sant_Felip_Neri-Barcelona_Catalonia.html", "text": "It is a nice square to sit and relax, is calm and often there is a beautiful musicial playing. It has a lot of history.", "publishedDate": "2019-09-04", "language": "en", "rating": 4}, {"id": 704254309, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d592217-r704254309-Placa_Sant_Felip_Neri-Barcelona_Catalonia.html", "text": "This is a square surrounded by the small streets of old Barcelona. Nothing much special but it was a resting spot after going through long walks", "publishedDate": "2019-08-29", "language": "en", "rating": 3}, {"id": 698693529, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d592217-r698693529-Placa_Sant_Felip_Neri-Barcelona_Catalonia.html", "text": "Like the other plazas in medieval sectors,this plaza offers a time to reflect upon what once was. The architecture is old and grand. ", "publishedDate": "2019-08-13", "language": "en", "rating": 5}, {"id": 697894508, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d592217-r697894508-Placa_Sant_Felip_Neri-Barcelona_Catalonia.html", "text": "...for a few things: gateway to the old Jewish quarter, 17th century Baroque church the walls of which still bear the scars of the heavy bombardments endured during the Spanish Civil War  and quite an odd museum - Museo de Calcat: the smallest in the city, just 2 rooms showing a collection of shoes from all over the world and a few shoe-making tools, no longer open for visit (The guide told us).As a matter of fact, it's hardly visible (on entering the square, on your right) were it not for 2 metal plates showing a pair of shoes and St Mark, the patron-saint of shoe-making.", "publishedDate": "2019-08-11", "language": "en", "rating": 3}, {"id": 696217319, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d592217-r696217319-Placa_Sant_Felip_Neri-Barcelona_Catalonia.html", "text": "Beautiful tall trees, school children playing in the plaza and the walls left untouched to remind of the tragedy of war when they dropped two bombs, one to frighten the people into the street and the second to kill them. Sad but beautiful plaza and a reminder of what can happen when people don't stand up to dictators. ", "publishedDate": "2019-08-06", "language": "en", "rating": 5}, {"id": 690445421, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d592217-r690445421-Placa_Sant_Felip_Neri-Barcelona_Catalonia.html", "text": "The Placa Sant Felip Neri is a small public square in the Gothic Quarter of Barcelona. It's a very popular square for tour guides because one tragic night in 1938, the Nationalists bombed this square city killing 42 citizens. The damage from the bomb are still visible on the walls of the Church of Sant Felip Neri.\n\nNot a great square, but great history", "publishedDate": "2019-07-17", "language": "en", "rating": 5}, {"id": 689497313, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d592217-r689497313-Placa_Sant_Felip_Neri-Barcelona_Catalonia.html", "text": "A lovely little spot in the Gothic Quarter with some unfortunately tragic history.  Highly recommend a stop here,  take your time and reflect.  ", "publishedDate": "2019-07-14", "language": "en", "rating": 5}, {"id": 686421150, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d592217-r686421150-Placa_Sant_Felip_Neri-Barcelona_Catalonia.html", "text": "The plaza is like an oasis from the crowds of the gothic quarter. Beautiful square but its history is scary.  ", "publishedDate": "2019-07-03", "language": "en", "rating": 5}, {"id": 677015981, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d592217-r677015981-Placa_Sant_Felip_Neri-Barcelona_Catalonia.html", "text": "Lovely little courtyard scarred by the Spanish civil war. Was a bit busy when I visited and it was a shame to see Museu Calcat appear to be closed down and abandoned but highly recommend a visit ", "publishedDate": "2019-05-28", "language": "en", "rating": 5}, {"id": 676380197, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d592217-r676380197-Placa_Sant_Felip_Neri-Barcelona_Catalonia.html", "text": "The small church remains a monument to the cruelty of Franco's Fascists, as they bombed the small courtyard and killed many children from the attached school.\n\nA sad but necessary commentary.", "publishedDate": "2019-05-25", "language": "en", "rating": 3}, {"id": 672381266, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d592217-r672381266-Placa_Sant_Felip_Neri-Barcelona_Catalonia.html", "text": "It's right in the old district, close to the Cathedral and other attractions but it's hidden and not too much known. It's worth a visit to this small, lovely square. This is one of those beautiful unknown spots you can find in Barcelona.", "publishedDate": "2019-05-07", "language": "en", "rating": 5}, {"id": 668938012, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d592217-r668938012-Placa_Sant_Felip_Neri-Barcelona_Catalonia.html", "text": "This small Plaza is is home to a beautiful church, school and Hotel Neri. when school is closed the Neri provides chairs and tables for light snacks, coffee and other beverages. The Plaza is usually quiet and offers a nice change to the very crowded streets in and around the neighboring cathedral. Visit or worship inside the Church. Behind the walls which were damaged in the Civil War is a beautiful tribute to 18th Century Christian architecture.    ", "publishedDate": "2019-04-24", "language": "en", "rating": 5}, {"id": 594896423, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d592217-r594896423-Placa_Sant_Felip_Neri-Barcelona_Catalonia.html", "text": "50 meters of the crowd of tourists visiting the Cathedral and Barri Gotic of Barcelona, you have this quiet and charming corner with a church, a boutique hotel and a fountain.", "publishedDate": "2018-07-10", "language": "en", "rating": 5}, {"id": 590982992, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d592217-r590982992-Placa_Sant_Felip_Neri-Barcelona_Catalonia.html", "text": "We've been to Barcelona many times but somehow managed to miss this charming square when wandering through the Gothic Quarter. We would have missed the square this time, too, except for a man who emerged from a narrow street and urged us to follow it to an amazing place. So off we went to \"discover\" what I now consider to be one of the prettiest spots in the quarter.\n\nAbout 10 people gawked at the small square's Gothic buildings when we arrived. An octagonal fountain acted as a focal point in the area's center, and acacia trees in the space likely provide shade in summer but had few leaves at the end of March. The dominant building proved to be a simple church with a violent history. An information plaque indicated that 42 people -- mostly children -- died here during the Spanish Civil War when Franco's air force bombed the area. The church bears witness to the bombings with a shrapnel-marked facade.\n\nMany of the Gothic buildings went up here in the mid-20th century because of much empty space after the bombings. They were moved stone by stone from areas scheduled for demolition and reassembled in the square.\n\nPlaca Sant Felip Neri is quite near the Barcelona cathedral. I suggest going to the visitor information center close to the cathedral for detailed instructions on how to reach the square.", "publishedDate": "2018-06-26", "language": "en", "rating": 5}, {"id": 589961132, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d592217-r589961132-Placa_Sant_Felip_Neri-Barcelona_Catalonia.html", "text": "Placa de Sant Felip Neri is one of the most charming spaces of the Bari Gotic and a pleasant corner to visit without a haste,although the facades still conserve old wounds.In the Baroque church of Sant Felip Neri,where Gaudi heard daily mass in his final years,and inside of which paintings by Joan Llimonda portray the saint with the face of the architect,you can see on the facade the marks left by the fascist air bombing during the civil war.The square is completed by Casa Gironella from the 18th century,currently a hotel.", "publishedDate": "2018-06-23", "language": "en", "rating": 5}, {"id": 589633758, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d592217-r589633758-Placa_Sant_Felip_Neri-Barcelona_Catalonia.html", "text": "Have a look at the walls and see where the Spanish Civil War played out in this small square - try the gelato too!", "publishedDate": "2018-06-21", "language": "en", "rating": 3}, {"id": 585086489, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d592217-r585086489-Placa_Sant_Felip_Neri-Barcelona_Catalonia.html", "text": "Really peaceful square in the gothic quarter. A little bit difficult to reach without a gps, but amazing. It seems you are not in a big city.", "publishedDate": "2018-06-04", "language": "en", "rating": 5}, {"id": 579965211, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d592217-r579965211-Placa_Sant_Felip_Neri-Barcelona_Catalonia.html", "text": "In this quiet and peaceful small square it is difficult to imagine the chaos that occurred here during the Spanish Civil War.  The scares on the façade of the Church of St. Philip Neri remind us of the innocents that perished here in 1938.  Across the plaza from the church is a building that was once associated with the Brotherhood of St. Mark the Evangelist, which became the shoemakers Guild--note the Lion and the shoes on the façade.", "publishedDate": "2018-05-13", "language": "en", "rating": 4}, {"id": 579096253, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d592217-r579096253-Placa_Sant_Felip_Neri-Barcelona_Catalonia.html", "text": "You must to get a serious explanation about the place' then you can apreciate wath you are watching there.", "publishedDate": "2018-05-09", "language": "en", "rating": 4}, {"id": 570922835, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d592217-r570922835-Placa_Sant_Felip_Neri-Barcelona_Catalonia.html", "text": "This is a small square in the Gothic Quarter.  The shrapnel-scarred wall of the church in the square is from two bombs dropped during the Spanish Civil War by the forces of Franco.", "publishedDate": "2018-04-03", "language": "en", "rating": 4}, {"id": 568838174, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d592217-r568838174-Placa_Sant_Felip_Neri-Barcelona_Catalonia.html", "text": "This small square is so peaceful and quiet. If you want to spend some time with yourself come here and observe the light, the trees, the water from the fountain, and the walls of the church which talk about more darker times.", "publishedDate": "2018-03-26", "language": "en", "rating": 5}, {"id": 565937139, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d592217-r565937139-Placa_Sant_Felip_Neri-Barcelona_Catalonia.html", "text": "This is a pretty church in a picturesque placa.  However, a guidebook is really needed to understand the history of the church and the placa.  I recommend Rick Steves for adults and \"Secret Agent Barcelona\" for children.", "publishedDate": "2018-03-11", "language": "en", "rating": 4}, {"id": 564853399, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d592217-r564853399-Placa_Sant_Felip_Neri-Barcelona_Catalonia.html", "text": "The accident that took place in this place many years ago still lingers there.. you'll be all happy and bubbly but once you walk inside that square you'll feel a very dark energy surrounding the place. many children got bombed in here many years ago and died on fire because the church is next to a school. it's a very enlightening experience. one of my favorite spots in barcelona", "publishedDate": "2018-03-06", "language": "en", "rating": 5}, {"id": 563411071, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d592217-r563411071-Placa_Sant_Felip_Neri-Barcelona_Catalonia.html", "text": "This spot is almost hidden in the Gothic Quarter. It's not straightforward to find it, but it is definitely worth it. The story of it is heartwrenching, but it adds to the atmosphere. I came back here multiple times during my visit.", "publishedDate": "2018-02-28", "language": "en", "rating": 5}, {"id": 557394627, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d592217-r557394627-Placa_Sant_Felip_Neri-Barcelona_Catalonia.html", "text": "Our guide from Runner Bean Free Walking Tours took us to this area as part of our Gotíc Quarter walk. Don't miss the relocated building details, the shoes, the shrapnel marks. ", "publishedDate": "2018-01-30", "language": "en", "rating": 4}, {"id": 557154311, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d592217-r557154311-Placa_Sant_Felip_Neri-Barcelona_Catalonia.html", "text": "If you go on one of the free tours (which is a MUST), you'll probably stop by here.  It's not just the preferred church of the great artist Gaudi, it has a bloody history that's debated.", "publishedDate": "2018-01-29", "language": "en", "rating": 4}, {"id": 554981328, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d592217-r554981328-Placa_Sant_Felip_Neri-Barcelona_Catalonia.html", "text": "There is a small church in the square which shows bomb damage from the Spanish Civil War, unfortunately sore orphan children took refuge in the church and many died, there is a infants school in the square now as well and the kids use the area as their play place", "publishedDate": "2018-01-20", "language": "en", "rating": 4}, {"id": 553374677, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d592217-r553374677-Placa_Sant_Felip_Neri-Barcelona_Catalonia.html", "text": "The very old church is very interesting to see, but the square outside provides some free entertainment if you have a few minutes to rest. Buy a gelato close by and sit oposite the church on some benches there. From beggars putting on an X factor show with singing and performing to just plain old people watching, a very intersting space!", "publishedDate": "2018-01-12", "language": "en", "rating": 4}, {"id": 550801643, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d592217-r550801643-Placa_Sant_Felip_Neri-Barcelona_Catalonia.html", "text": "A real gothic square, nice church with the same architecture, and much other ancient buildings; nice to stroll in this romantic atmosphere.", "publishedDate": "2018-01-01", "language": "en", "rating": 5}, {"id": 548640937, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d592217-r548640937-Placa_Sant_Felip_Neri-Barcelona_Catalonia.html", "text": "besides its history, it's a nice spot to relax and make you feel in the past. it's located one street away or less from the barcelona cathedral.", "publishedDate": "2017-12-22", "language": "en", "rating": 5}, {"id": 541869999, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d592217-r541869999-Placa_Sant_Felip_Neri-Barcelona_Catalonia.html", "text": "This is a tiny old square in the gothic quarter, surrounded by very old buildings. Certainly historic but nothing much there to explain what's going on. You'll likely walk through it if you spend any time in the Gothic Quarter but this isn't really an \"attractions. Take 5 minutes to look at the walls closely then move on.", "publishedDate": "2017-11-18", "language": "en", "rating": 3}, {"id": 540277216, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d592217-r540277216-Placa_Sant_Felip_Neri-Barcelona_Catalonia.html", "text": "I was so glad we found this place. There is signs so it's pretty easy. It feels so historic and really like your stepping back in time.", "publishedDate": "2017-11-11", "language": "en", "rating": 4}, {"id": 539941703, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d592217-r539941703-Placa_Sant_Felip_Neri-Barcelona_Catalonia.html", "text": "You can SEE history in these walls as they still have the markings left form a bombing during the Franco regime.", "publishedDate": "2017-11-10", "language": "en", "rating": 4}, {"id": 536717225, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d592217-r536717225-Placa_Sant_Felip_Neri-Barcelona_Catalonia.html", "text": "Somewhere that mass tourism does not overwhelm. Lots of associated historical facts that give a great perception of the Franco era.", "publishedDate": "2017-10-28", "language": "en", "rating": 5}, {"id": 535769808, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d592217-r535769808-Placa_Sant_Felip_Neri-Barcelona_Catalonia.html", "text": "It's quaint and a lovely place to just chill but you have to sit on the fountain and leave if school is out, those monkeys make a lot of noise. Best in the later evenings if the guitar player is out and about. The pock marked wall of the church was caused by Italian bombing (at Franco's request) of the Catedral. They missed and dropped one in the square OR it was caused by machine gun fire according to a different tour guide. I think the bombing makes more sense given the pattern, hardly enough room to fire a large caliber machine gun in this small plaza.", "publishedDate": "2017-10-24", "language": "en", "rating": 4}, {"id": 534106063, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d592217-r534106063-Placa_Sant_Felip_Neri-Barcelona_Catalonia.html", "text": "Lovely place in Gothic,\n\nBarcelona is a beautiful city, very pleasant to walk, go shopping, ... with an excellent gastronomy. \nIdeal to come and spend a few days.\nDo not worry. \nThe political situation may be complicated but the Catalan society does not tolerate violence and we will not allow visitors to be affected by any violent act.\nCome and you will be welcomed with the same hospitality as always.", "publishedDate": "2017-10-18", "language": "en", "rating": 5}, {"id": 530045677, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d592217-r530045677-Placa_Sant_Felip_Neri-Barcelona_Catalonia.html", "text": "A very small plaza but I agree with our friends who live in Barcelona, it is the prettiest little hidden secret in Barcelona!", "publishedDate": "2017-10-04", "language": "en", "rating": 5}, {"id": 529335883, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d592217-r529335883-Placa_Sant_Felip_Neri-Barcelona_Catalonia.html", "text": "This square was such a blessing after walking so much around the old city. In one of the corners a guy was playing guitar. Gothic views around.", "publishedDate": "2017-10-02", "language": "en", "rating": 5}, {"id": 528122157, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d592217-r528122157-Placa_Sant_Felip_Neri-Barcelona_Catalonia.html", "text": "This big open square is the center of the Barrio Gothic, and thus you won't be able to miss it.  Old lovely architecture surrounds.", "publishedDate": "2017-09-28", "language": "en", "rating": 4}, {"id": 527956013, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d592217-r527956013-Placa_Sant_Felip_Neri-Barcelona_Catalonia.html", "text": "we waled through this square many times during our week in barcelona - it has some amazing history related to the Civil War. Well worth navigating the narrow lanes to find this little hidden gem. (The restaurant in the courtyard of the hotel is a wonderful spot for lunch of dinner)  Take a few photos, read about the history and listen to the quiet gurgle of the fountain - beautiful! ", "publishedDate": "2017-09-27", "language": "en", "rating": 4}, {"id": 526133517, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d592217-r526133517-Placa_Sant_Felip_Neri-Barcelona_Catalonia.html", "text": "A year ago I \"found\" this place, and spent some time there with my wife one beautiful evening. We sat down and watched the bullet markings on the wall, thought about the history and all the sorrow this represent to the locals. At the same time there were only few people there, but thousands wandering on the streets around us. But, at the square there was a gentleman with his guitar. He was from Somalia, playing the most beautiful song I've ever heard! Still, I can hear this song, his voice and lyrics I will never understand! But those moments, that place, made this evening perfect. Since that, I've tried to find the performers name, but I have not succeed. He walked into the night before I could ask for his name... as we sat there emotionally occupied! :) Dear reader: if you will by any chance find this square, and hear a tall Somali play by his heart, enjoy! ", "publishedDate": "2017-09-20", "language": "en", "rating": 5}, {"id": 523292618, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d592217-r523292618-Placa_Sant_Felip_Neri-Barcelona_Catalonia.html", "text": "We had been on a long walk through the Gothic Quarter, during our most recent stay in Barcelona. after walking through some of the narrow winding laneways located there, we found ourselves in Placa Sant Felip Neri, more by good luck than by any planning by us. \nThe main feature of the small square is the church of Sant Felip Neri. Located in the middle of the square is a small fountain surrounded by a small, walled pond.\nWe spent a short time looking at the plaques located on the walls around the square and then it was time to move on. \nWorth a look if you happen to be exploring the Gothic Quarter!", "publishedDate": "2017-09-10", "language": "en", "rating": 4}, {"id": 519716795, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d592217-r519716795-Placa_Sant_Felip_Neri-Barcelona_Catalonia.html", "text": " Felip Neri church situated in the Gothic Quarter close to Barcelona Cathedral has a dark history in Span's civil war. On  30th January 1938 a bomb dropped by General Franco's air force exploded in front of the church killing 42 people most of whom were children.A bronze  plaque in memory of these civil war victims of the church is installed at the location.", "publishedDate": "2017-08-30", "language": "en", "rating": 4}, {"id": 518864575, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d592217-r518864575-Placa_Sant_Felip_Neri-Barcelona_Catalonia.html", "text": "This is one of those hidden gems you can find in Barcelona, we weren't looking for it so it made the surprise even better! You should take some minutes and apreciate the walls all around!", "publishedDate": "2017-08-29", "language": "en", "rating": 4}, {"id": 509072771, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d592217-r509072771-Placa_Sant_Felip_Neri-Barcelona_Catalonia.html", "text": "Had a very good explaination from our guide about what happened at this plaza. Very moving, hard to imagine. I was impacted by this part of our tour and I am glad we were able to freely take pictures and remember it. ", "publishedDate": "2017-08-05", "language": "en", "rating": 5}, {"id": 508476930, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d592217-r508476930-Placa_Sant_Felip_Neri-Barcelona_Catalonia.html", "text": "One of the few places showing frag damage fro the indescrimunant booming of the Spanish war. And if your a movie buff look around and try and work out which two films had scenes there\n\nWell worth the visit", "publishedDate": "2017-08-03", "language": "en", "rating": 5}, {"id": 507963610, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d592217-r507963610-Placa_Sant_Felip_Neri-Barcelona_Catalonia.html", "text": "The building,  Fountain, old houses, are beautiful. Is a silent and very clean place  with a special ambience. Here are very  good restaurants.", "publishedDate": "2017-08-01", "language": "en", "rating": 5}, {"id": 506003547, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d592217-r506003547-Placa_Sant_Felip_Neri-Barcelona_Catalonia.html", "text": "This Placa is delightful.  Has a building (Shoemakers Guild) placed there from somewhere else; a recently added fountain and Shoe Museum.  Also has many 'bullet/bomb' markings said to have been from the Spanish Civil War on the church (now a school)", "publishedDate": "2017-07-26", "language": "en", "rating": 4}, {"id": 505356804, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d592217-r505356804-Placa_Sant_Felip_Neri-Barcelona_Catalonia.html", "text": "We stopped here on a guided tour of the Gothic quarter, the church was bombed as part of the civil war and has been left as a reminder of those times.  There is a cafe where we returned the next day to have a drink and soak up the atmosphere, we were rewarded by an impromptu flamenco performance.", "publishedDate": "2017-07-25", "language": "en", "rating": 4}, {"id": 503988118, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d592217-r503988118-Placa_Sant_Felip_Neri-Barcelona_Catalonia.html", "text": "Well worth a visit while in barrio gotic. This is such a beautiful little square. Can be kind of hard to find. Well worth the visit. The fountain in the center makes for some great pictures.", "publishedDate": "2017-07-20", "language": "en", "rating": 5}, {"id": 500683934, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d592217-r500683934-Placa_Sant_Felip_Neri-Barcelona_Catalonia.html", "text": "This almost invisible square is full of history, it is hidden in a corner of the Gothic quarter, you'll see the Baroque church of Sant Felip Neri, walk around look at the walls and read the plaques that speak of the history of the city...", "publishedDate": "2017-07-11", "language": "en", "rating": 4}, {"id": 500151588, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d592217-r500151588-Placa_Sant_Felip_Neri-Barcelona_Catalonia.html", "text": "Even though hard to find, We found the plaza with the Church of Felip Neri with it's sad history, There is also a restaurant and sometimes there are musicians with guitars at the fountains within it.", "publishedDate": "2017-07-10", "language": "en", "rating": 3}, {"id": 498996890, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d592217-r498996890-Placa_Sant_Felip_Neri-Barcelona_Catalonia.html", "text": "Plaza with church whose walls still show bomb damage from the civil war.  The church was being used as an orphanage at the time and 42 were killed by the bomb.  There is a wall plaque and one in the ground.", "publishedDate": "2017-07-05", "language": "en", "rating": 4}, {"id": 497317512, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d592217-r497317512-Placa_Sant_Felip_Neri-Barcelona_Catalonia.html", "text": "Too much history around the walls of this beatifull square, you can find peace after many years of war and suffering. Just amazing place.NICE PLACE enjoy with family. wonderful place.  very beatifull walls.", "publishedDate": "2017-06-29", "language": "en", "rating": 3}, {"id": 496548686, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d592217-r496548686-Placa_Sant_Felip_Neri-Barcelona_Catalonia.html", "text": "Nice to stroll through and maybe have a bite to eat at the Neri Restaurant. Sometimes musicians strum guitars there and sometime police patrol the area as people tend to loiter there.", "publishedDate": "2017-06-27", "language": "en", "rating": 3}, {"id": 496422794, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d592217-r496422794-Placa_Sant_Felip_Neri-Barcelona_Catalonia.html", "text": "Too much history around the walls of this beatifull square, you can find peace after many years of war and suffering. Just amazing place.", "publishedDate": "2017-06-27", "language": "en", "rating": 5}, {"id": 494534364, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d592217-r494534364-Placa_Sant_Felip_Neri-Barcelona_Catalonia.html", "text": "Placa Sant Felip Neri is possibly the best spot in town: a quiet, hidden gem where I suggest you to go and enjoy some peace!", "publishedDate": "2017-06-20", "language": "en", "rating": 5}, {"id": 493815287, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d592217-r493815287-Placa_Sant_Felip_Neri-Barcelona_Catalonia.html", "text": "Pretty square with a charming fountain and lots of shade - which was much appreciated as a short retreat from the June heat. When we were there, the children from a local school were out playing so it was quite loud and bustling. It was incredible to see the gunshots that mar the facade of the church that overlooks the square.", "publishedDate": "2017-06-17", "language": "en", "rating": 3}, {"id": 491030176, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d592217-r491030176-Placa_Sant_Felip_Neri-Barcelona_Catalonia.html", "text": "Despite its tragic history, I was more curious to visit the Placa Sant Felip Neri because some important scenes from the movies Perfume: Story of a Murderer and Vicky Cristina Barcelona have been filmed here. The square is very little known, there is even a coffee shop where you can sit and enjoy the gothic architecture of the place.", "publishedDate": "2017-06-06", "language": "en", "rating": 5}, {"id": 490518712, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d592217-r490518712-Placa_Sant_Felip_Neri-Barcelona_Catalonia.html", "text": "This is one of the best squares in Barcelona.  It is often filled with couples and families, and is a nice respite from the constant buzz of the old city.  We visited the Placa Sant Felip Neri several times and enjoyed the laid back atmosphere.", "publishedDate": "2017-06-04", "language": "en", "rating": 5}, {"id": 480146324, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d592217-r480146324-Placa_Sant_Felip_Neri-Barcelona_Catalonia.html", "text": "Hidden treasure in Barcelona. Not all the people know about it, but I definitely suggest to come. It feels like a mystic place.  ", "publishedDate": "2017-04-30", "language": "en", "rating": 5}, {"id": 473953733, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d592217-r473953733-Placa_Sant_Felip_Neri-Barcelona_Catalonia.html", "text": "We  came here because it was an early part of one of the Frommer walking tours. The real touching part for us: the reminder of the bomb that killed many schoolchildren there during the Spanish civil war; there is a plaque that commemorates the loss. Even when the square in front of the Catedral is crowded and noisy, this nearby Placa is quiet.", "publishedDate": "2017-04-09", "language": "en", "rating": 4}, {"id": 473664554, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d592217-r473664554-Placa_Sant_Felip_Neri-Barcelona_Catalonia.html", "text": "I was surprised to find such a quiet square in the middle of a city as crowded as Barcelona, ​​it's worth stopping for a while to rest", "publishedDate": "2017-04-08", "language": "en", "rating": 5}, {"id": 468463894, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d592217-r468463894-Placa_Sant_Felip_Neri-Barcelona_Catalonia.html", "text": "This is a square in the Gothic Quarter of Barcelona with a rather dark history. All the dents in the walls are from when Franco's execution squads were executing school children. I definitely recommend that you see this, to see something other than Gaudi about Spanish culture, and learn some history.", "publishedDate": "2017-03-19", "language": "en", "rating": 4}, {"id": 466799001, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d592217-r466799001-Placa_Sant_Felip_Neri-Barcelona_Catalonia.html", "text": "I was taken there by one of the tour guide arranged by Barcelona tourism and it was such a little gem even if it hides a sad history.", "publishedDate": "2017-03-13", "language": "en", "rating": 5}, {"id": 466604517, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d592217-r466604517-Placa_Sant_Felip_Neri-Barcelona_Catalonia.html", "text": "Very sensitive place thought provoking ,and moving.We need places left like this to remind us of how delicate life's balance is", "publishedDate": "2017-03-12", "language": "en", "rating": 5}, {"id": 465150267, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d592217-r465150267-Placa_Sant_Felip_Neri-Barcelona_Catalonia.html", "text": "One of my favorite places in the city, when it's empty it's just magical. The best idea is just to get lost in the night and walk around the Gothic Quarter.", "publishedDate": "2017-03-06", "language": "en", "rating": 5}, {"id": 465068022, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d592217-r465068022-Placa_Sant_Felip_Neri-Barcelona_Catalonia.html", "text": "Nice beautiful  small square near Cathedral with fountain. You can still see the bomb traces from the Civil War when Italian warships attacked the city. The acoustic is great for the troubadours which are often here. ", "publishedDate": "2017-03-06", "language": "en", "rating": 5}, {"id": 464406246, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d592217-r464406246-Placa_Sant_Felip_Neri-Barcelona_Catalonia.html", "text": "A little hard to find - you probably won't accidentally stumble on it. But worth making the effort. Find out about the history of this square and how many children died here during the Civil War. \nStop and soak up the emotion evoked by the shrapnel pock marks in the walls - it's a moving experience.", "publishedDate": "2017-03-03", "language": "en", "rating": 5}, {"id": 463257553, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d592217-r463257553-Placa_Sant_Felip_Neri-Barcelona_Catalonia.html", "text": "Just finding this place is an adventure. Its nice and quite and you get away from the mainstream of tourists.", "publishedDate": "2017-02-27", "language": "en", "rating": 4}, {"id": 458469014, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d592217-r458469014-Placa_Sant_Felip_Neri-Barcelona_Catalonia.html", "text": "We visited the Placa during a guided walk around the medieval and roman quarter of Barcelona and the damage caused by a bomb in the square was a vivid reminder of a violent episode in Barcelona's history. There is more to see, though, so look around you at the other buildings as the church with its bullet holes. ", "publishedDate": "2017-02-10", "language": "en", "rating": 5}, {"id": 458145361, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d592217-r458145361-Placa_Sant_Felip_Neri-Barcelona_Catalonia.html", "text": "a small quiet \" oase\"  in the heart of Barcelona. Just enjoy the calm atmosphere and realize why Gaudi came here so often..", "publishedDate": "2017-02-08", "language": "en", "rating": 5}]}}]