[{"locationId": 10086735, "name": "Placa Tetuan", "placeType": "ATTRACTION", "reviewListPage": {"reviews": [{"id": 689531105, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d10086735-r689531105-Placa_Tetuan-Barcelona_Catalonia.html", "text": "Placa Tetuan is a public square that is roughly at the junction of Eixample and Fort Pienc. The square is actually a giant roundabout, but with many cross points so that you can safely enter the square without having to risk your life trying to cross at a busy intersection. \n\nProbably the best feature is the monument at the centre of the square, which is a Monument to Doctor Bartomeu Robert and also a separate attraction on Tripadvisor. The monument is of course magnificent. Other than that, there's not much in the square as it's largely paved with grass, plants and trees at the boundaries of the square. The cafes and restaurants are on the on the other side of the roundabout, so you can really sit and enjoy the squares like you would in more traditional squares in Spain.", "publishedDate": "2019-07-14", "language": "en", "rating": 4}, {"id": 628055330, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d10086735-r628055330-Placa_Tetuan-Barcelona_Catalonia.html", "text": "Plaça De Tetuán is a major square in Barcelona that holds one of the most stunning monuments in this vibrant and exciting city. \nThe square is named in honour of the siege and occupation of the city of Tetuán, a city in Morocco. \nThe centrepiece of the square is the stunning monument to Doctor Robert ,a truelly stunning monument and sculpure,the architecture around the plaza is also really good,some really grand buildings in this area.\nIt's not an essential must go destination but if your in the area well worth checking out. ", "publishedDate": "2018-10-25", "language": "en", "rating": 5}, {"id": 624208444, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d10086735-r624208444-Placa_Tetuan-Barcelona_Catalonia.html", "text": "This place was very nice. But it is not worth it going there if you’re not nearby. It was not something special about it, but it was nice to see the statues and some bench to sit on.", "publishedDate": "2018-10-12", "language": "en", "rating": 3}]}}]