[{"locationId": 190629, "name": "Casa Milà - La Pedrera", "placeType": "ATTRACTION", "reviewListPage": {"reviews": [{"id": 757442995, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d190629-r757442995-Casa_Mila_La_Pedrera-Barcelona_Catalonia.html", "text": "Casa Mila is beautiful, one of my favourite architecture in Barcelona. It is very worth checking out. The view from the top is gorgeous", "publishedDate": "2020-06-15", "language": "en", "rating": 5}, {"id": 753498825, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d190629-r753498825-Casa_Mila_La_Pedrera-Barcelona_Catalonia.html", "text": "Looking at Casa Milà from the outside, it looks like a house shaped by sea waves. On the ground floor, there is a gate that made me wonder how someone made such a gate. In fact, everything there is impressive, because there are so many curves, that I wonder how everything was made, considering that it was a time when there were not so many facilities as today. When walking around the rooms, it is very nice to think about how people lived in the past, especially in a huge and beautiful house like that. Be sure to visit!", "publishedDate": "2020-05-13", "language": "en", "rating": 5}, {"id": 753445321, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d190629-r753445321-Casa_Mila_La_Pedrera-Barcelona_Catalonia.html", "text": "All of the pics I've seen are of the outside of the building and the roof.  All of which is great.  But it was what we saw in the attic that was impressive.  I always wondered where Gaudi found inspiration and I learned it here, and more about the architect.  ", "publishedDate": "2020-05-11", "language": "en", "rating": 5}, {"id": 753026570, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d190629-r753026570-Casa_Mila_La_Pedrera-Barcelona_Catalonia.html", "text": "My husband and I were in Barcelona in 2010 and didn't make it here, so when we came back in 2020 we knew we had to go.  It definitely did not disappoint.  Our 8 year old son also loved it.", "publishedDate": "2020-04-29", "language": "en", "rating": 5}, {"id": 752985610, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d190629-r752985610-Casa_Mila_La_Pedrera-Barcelona_Catalonia.html", "text": "Very interesting and beautiful building, one of the most famous architectural construction. \nPositioned near the center.", "publishedDate": "2020-04-28", "language": "en", "rating": 5}, {"id": 752826216, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d190629-r752826216-Casa_Mila_La_Pedrera-Barcelona_Catalonia.html", "text": "It was wonderful to finally get a look inside this famous building. It is a unique look at a different side of Gaudi. The real show stopper is the roof, it is gorgeous! We had the opportunity to visit at night for a light show and then the following day. Gaudi's rooftop sculptures are a delight and there is even a great photo op with the Sagrada Familia in the background.  The apartment interior is lovely but not as amazing as the Sagrada Familia or Rooftop. A great addition to your trip if you have extra time or a returning for a 2nd or 3rd or more visit", "publishedDate": "2020-04-22", "language": "en", "rating": 4}, {"id": 752473299, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d190629-r752473299-Casa_Mila_La_Pedrera-Barcelona_Catalonia.html", "text": "During my time in Barcelona the work of Antoni Gaudi was breathtaking regardless of the scale. This included this unique building with the “wavy” features that was originally built as a private residence. The wrought iron railings and balconies add to the modernist architecture that is a Gaudi signature. Tours of the interior can be arranged with the foundation that is now housed in the building. However, it is the exterior of the building which really stands out in Catalonia and is well worth at least a brief visit when in Barcelona.", "publishedDate": "2020-04-10", "language": "en", "rating": 4}, {"id": 752462736, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d190629-r752462736-Casa_Mila_La_Pedrera-Barcelona_Catalonia.html", "text": "Once again on of Gaudi's amazing creations. Great architect and amazing as a building. Throughout the pictures it's not that easy to understand how magic is the whole scenery. Just amazing. ", "publishedDate": "2020-04-10", "language": "en", "rating": 5}, {"id": 752398176, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d190629-r752398176-Casa_Mila_La_Pedrera-Barcelona_Catalonia.html", "text": "This wasn't on our original schedule to visit but having been blow away by Casa Battlo it was a no brainer to squeeze either this or Park Guell in on the small amount of time we had nothing planned (Park guell was ruled out due to distance and time needed there).\n\nWe walked right up to the door and booked tickets outside through Viator to save a couple of pound and within minutes we were inside.  The outside certainly doesn't compare to Casa Battlo but is still something to behold.  Inside it is very different to Battlo with rooms furnished as they would have been.\n\nFor some reason what I found most impressive is the underground area where the clearly very wealthy owners would drive their car in, just something you don't associate with an historic building.\n\nNot top of the list of things to see in Brcelona but very near, if you went to Casa Battlo and weren't overly bothered then it isn't for you, if you were blown away then why not take in a bit more Gaudi.", "publishedDate": "2020-04-08", "language": "en", "rating": 5}, {"id": 752168771, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d190629-r752168771-Casa_Mila_La_Pedrera-Barcelona_Catalonia.html", "text": "It's always interesting to see a lot of people staring the modernists buildings at Passeig de Grácia, anytime. La Casa Milá is  the fusion of the unregular shape of the stones with the harmony of the modernist architecture. ", "publishedDate": "2020-04-02", "language": "en", "rating": 4}, {"id": 752163791, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d190629-r752163791-Casa_Mila_La_Pedrera-Barcelona_Catalonia.html", "text": "The best place to go to learn more about the thoughts and inspirations  behind Gaudi's works! More than being just works of art, Gaudi ensured that his works were created in a manner that was purposeful and functional. A truly informative experience and the audioguide is a useful addition.", "publishedDate": "2020-04-02", "language": "en", "rating": 5}, {"id": 752151606, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d190629-r752151606-Casa_Mila_La_Pedrera-Barcelona_Catalonia.html", "text": "This is one of the major 'Gaudi' must sees in Barcelona. How forwarded thinking to be allowed to build such an amazing architectural building back in the day. The rooftop and the chimneys are just amazing", "publishedDate": "2020-04-02", "language": "en", "rating": 5}, {"id": 751939021, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d190629-r751939021-Casa_Mila_La_Pedrera-Barcelona_Catalonia.html", "text": "World Heritage site off Passeig de Gràcia boulevard this is Gaudí's secular building in avant-garde style resembling a stone quarry. It is a work of sculpture. All lines of the grey natural stone façade are curved, with rounded windows and wrought iron balcony railings twining around in plant-like shapes. The roof has an undulating shape complemented by the mosaic adorned chimneys.  Entrance is on Carrer de Provença through a wrought-iron gate leading to an inner courtyard. The building is supported by ribbed arches designed for load-bearing purposes. Metro stop Diagonal L3 Green; L5 Light Blue; L7 Navy Blue lines", "publishedDate": "2020-03-28", "language": "en", "rating": 4}, {"id": 751753454, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d190629-r751753454-Casa_Mila_La_Pedrera-Barcelona_Catalonia.html", "text": "The highlight of this tour, to me, was the rooftop, where the tour began.  It is anything but level!  You must watch your step.  Some of the \"chimneys\" reminded me of Star Wars Storm Troopers.  I found it fascinating.  My husband disliked the style of architecture intensely.  He prefers symmetry!", "publishedDate": "2020-03-24", "language": "en", "rating": 4}, {"id": 751748607, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d190629-r751748607-Casa_Mila_La_Pedrera-Barcelona_Catalonia.html", "text": "A fun example of Gaudi architecture. We just were walking in the area and did not go in or examine it too closely. ", "publishedDate": "2020-03-24", "language": "en", "rating": 3}, {"id": 751599468, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d190629-r751599468-Casa_Mila_La_Pedrera-Barcelona_Catalonia.html", "text": "What on earth did the architect have in mind when he built that? It is a uniquely style with all the curvy balconies.  ", "publishedDate": "2020-03-22", "language": "en", "rating": 5}, {"id": 751290234, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d190629-r751290234-Casa_Mila_La_Pedrera-Barcelona_Catalonia.html", "text": "This house build by Antoni Gaudi is a beautiful piece of architecture. Strongly recommend everyone to see this house when you are in Barcelona! it is also very close to Casa Batlló", "publishedDate": "2020-03-18", "language": "en", "rating": 5}, {"id": 751215041, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d190629-r751215041-Casa_Mila_La_Pedrera-Barcelona_Catalonia.html", "text": "This is just across street from the other stunning building, it is just amazing is in the middle of busy avenue.\n", "publishedDate": "2020-03-17", "language": "en", "rating": 4}, {"id": 751144178, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d190629-r751144178-Casa_Mila_La_Pedrera-Barcelona_Catalonia.html", "text": "Of the two Guadi houses near each other we preferred this one, there’s more to see and the smart audio guide works well sensing where you are in the building. \n\nThe rooms that are furnished and decorated give more of a sense of these buildings as they were originally used and help date them.\n\nI still find €50 for two people to have a look round a building a bit ridiculous and I’d never repeat visit at that price but I guess they have an endless supply of people who want to see it for the first time", "publishedDate": "2020-03-16", "language": "en", "rating": 4}, {"id": 751114797, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d190629-r751114797-Casa_Mila_La_Pedrera-Barcelona_Catalonia.html", "text": "For anyone who is a little culturally interested, this building by Antoni Gaudi is part of a visit to Barcelona.\n\nAlready a great sight from the outside. However, it has much more to offer. The view from the roof of the building, as well as the architecture inside the building.\nGaudi designed the Casa Mila exclusively with natural shapes, so that there is hardly a right angle to be found. Colors and natural, round shapes adorn the interior of the building and the courtyards. At the beginning of the descent from the roof, the interior is reminiscent of a whale belly.\n\"La Pedrera\" (\"The Quarry\") - most of the people who mocked the building at the time would probably change their minds today. That is the passage of time. Much of what is art was not considered to be art at the time. The building was declared a World Heritage Site by UNESCO in 1984 as the first building of the 20th century. I think that says a lot about it.\n\nOf course, the building does not come close to the Familia Sagrada, but it is still worth seeing.\nAn outstanding architect and artist - and to my knowledge that should have been Gaudi's last work.\n\nThere are also long lines of people here, like most of the other sights, and waiting is no fun. I would buy the tickets online in advance, so you don't have to queue. And the audio guide is definitely worth it. So you get information about the house, about Gaudi and about Barcelona, ​​which you would otherwise miss.", "publishedDate": "2020-03-16", "language": "en", "rating": 4}, {"id": 751109801, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d190629-r751109801-Casa_Mila_La_Pedrera-Barcelona_Catalonia.html", "text": "It is a very beautiful house and worth to see, but I just have to say that paying 27 Euros is way too much. We payed less for the Sagrada família which is a monumental scructure still being built, while Casa Mila is already finished. I really think the price is ridiculous. ", "publishedDate": "2020-03-16", "language": "en", "rating": 4}, {"id": 750881166, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d190629-r750881166-Casa_Mila_La_Pedrera-Barcelona_Catalonia.html", "text": "Intriguing location with impressive history. Expensive but memorable. The headphones were a nice addition that activated automatically throughout the facility. ", "publishedDate": "2020-03-14", "language": "en", "rating": 5}, {"id": 750687324, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d190629-r750687324-Casa_Mila_La_Pedrera-Barcelona_Catalonia.html", "text": "Quite an unique design and viewing it closer, it looks quite a piece of art. Designed by Antoni Gaudi was build during the period 1906 till 1916. There is a lot of art work into the structure, the floors are waving, the railing are so different with metal designs. One cannot miss this building while in Barcelona as all the tourist buses pass through this road.        ", "publishedDate": "2020-03-12", "language": "en", "rating": 4}, {"id": 750444901, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d190629-r750444901-Casa_Mila_La_Pedrera-Barcelona_Catalonia.html", "text": "We went at night and got to see the light show on the roof. Highly recommend it was very cool! Great views from the roof as well. ", "publishedDate": "2020-03-11", "language": "en", "rating": 5}, {"id": 750220959, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d190629-r750220959-Casa_Mila_La_Pedrera-Barcelona_Catalonia.html", "text": "This is another must see. A little on the expensive side but another great example of Gaudí s imagination. Views from the roof are great and the workmanship on the roof and in the loft are stunning. ", "publishedDate": "2020-03-10", "language": "en", "rating": 5}, {"id": 750149719, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d190629-r750149719-Casa_Mila_La_Pedrera-Barcelona_Catalonia.html", "text": "Loved it and the audio guide was cool. The first place you enter is quite a nice place for photos, you can then go to a few floors. The top floor where all the sculptures are, the 'attic' which is a really cool museum where you learn many fascinating things about Gaudi and see some furniture he designed and how he made it ergonomic. And the 4th floor which is an apartment made into a museum where you see several rooms. Really enjoyed it!", "publishedDate": "2020-03-09", "language": "en", "rating": 5}, {"id": 750136713, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d190629-r750136713-Casa_Mila_La_Pedrera-Barcelona_Catalonia.html", "text": "Another lovely place to visit. So much to see in here. His furniture and doors are amazing. More quirkiness.", "publishedDate": "2020-03-09", "language": "en", "rating": 5}, {"id": 749999635, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d190629-r749999635-Casa_Mila_La_Pedrera-Barcelona_Catalonia.html", "text": "Walking into the building, especially going to the roof and the attic, it is difficult to imagine people living in the building - even though there are still several families living in apartments.\n\nThe wavy architecture and design were amazing, and highlight for me was the attic which showcased what looked like the skeletal remains of a large animal.\n\nA must do in Barcelona!", "publishedDate": "2020-03-08", "language": "en", "rating": 5}, {"id": 749923643, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d190629-r749923643-Casa_Mila_La_Pedrera-Barcelona_Catalonia.html", "text": "I passed by this apartment building back in 1998 (my last trip to Barcelona), but never ventured inside. Seeing the inside was one of the reasons I returned to the city. Was it worth the more than two decade wait? Absolutely! Using the included virtual audio guide was brilliant. This should be the standard for all self guided tours - anywhere. From the courtyard to the rooftop to the attic and the apartment, this was one of the most fascinating, unique, engaging and beautiful (man-made) places I’ve ever visited. On the afternoon I visited there were just a handful of other visitors which made for a relaxed, unhurried visit. ", "publishedDate": "2020-03-08", "language": "en", "rating": 5}, {"id": 749895558, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d190629-r749895558-Casa_Mila_La_Pedrera-Barcelona_Catalonia.html", "text": "Absolutely worth a visit. Spectacural roof top and chimneys like guards. Very imaginative architecture and yet an apartment house. Definitely a masterpiece of it’s kind.", "publishedDate": "2020-03-08", "language": "en", "rating": 5}, {"id": 749733603, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d190629-r749733603-Casa_Mila_La_Pedrera-Barcelona_Catalonia.html", "text": "Lovely and so much quieter than the Família. Lovely views from the roof and each level stunning in its own way. Well worth a visit \n", "publishedDate": "2020-03-07", "language": "en", "rating": 5}, {"id": 749697948, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d190629-r749697948-Casa_Mila_La_Pedrera-Barcelona_Catalonia.html", "text": "This building is situated near to main fashion shops. The curved shape is tipical to Gaudí stile with grey surface since no colour have been used to decorate the main building. Lines are clean and immediate. ", "publishedDate": "2020-03-07", "language": "en", "rating": 4}, {"id": 749314939, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d190629-r749314939-Casa_Mila_La_Pedrera-Barcelona_Catalonia.html", "text": "The tour was such a fun experience. Getting to actually be inside the building and see his work was very worth the time and the money. I love that the building is actually still occupied with residents. ", "publishedDate": "2020-03-05", "language": "en", "rating": 5}, {"id": 749290546, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d190629-r749290546-Casa_Mila_La_Pedrera-Barcelona_Catalonia.html", "text": "This is a must see for anyone in the building industry. The focus on design and the ability to build is fantastic.  well worth the price of admission", "publishedDate": "2020-03-05", "language": "en", "rating": 5}, {"id": 749280994, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d190629-r749280994-Casa_Mila_La_Pedrera-Barcelona_Catalonia.html", "text": "This was an excellent choice to see.  An amazing example of Gaudi's work start to finish.  The apartment and the roof are the most detailed highlights.", "publishedDate": "2020-03-05", "language": "en", "rating": 5}, {"id": 749271646, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d190629-r749271646-Casa_Mila_La_Pedrera-Barcelona_Catalonia.html", "text": "A visit to La Pedrera provides an opportunity to see the genius of Gaudi in an every day object - a place where you could live.. not a right-angle to be found.. magic!", "publishedDate": "2020-03-05", "language": "en", "rating": 4}, {"id": 749240202, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d190629-r749240202-Casa_Mila_La_Pedrera-Barcelona_Catalonia.html", "text": "It was a long queue so couldn't enter because we needed to visit other places too, instead, we admired the exterior. Beautiful.", "publishedDate": "2020-03-05", "language": "en", "rating": 3}, {"id": 748940194, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d190629-r748940194-Casa_Mila_La_Pedrera-Barcelona_Catalonia.html", "text": "I went to La Pedrera today with my fiancee and we were mesmerized by the beautiful architecture all around. All the nature like symbols, walls and sculptures - divine! And the roof was the best part of it. Great spot for contemplation. And you can see the Sagrada Familia as well!\nAn advantage, compared to Casa Batllo, is that the rooms are furnished, and you get to see the way people used to live in the 20th century. But the exterior of Casa Batllo is over the top, a fairytale in real life. \n", "publishedDate": "2020-03-03", "language": "en", "rating": 5}, {"id": 748514930, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d190629-r748514930-Casa_Mila_La_Pedrera-Barcelona_Catalonia.html", "text": "We have visited the other Gaudi’s building Casa Battlo in our previous visit. Although there are some similarities in style between the two, Casa Mila is much larger project on a totally different scale. We were lucky with the weather as it was very sunny and bright day. This really helped to get the full advantage of the design and how Gaudi has achieved sun penetration in every possible part of the building. Light was very important for him in his architectural solutions. Good to book tickets in advance as it gives you €3 discount. ", "publishedDate": "2020-03-01", "language": "en", "rating": 5}, {"id": 748350180, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d190629-r748350180-Casa_Mila_La_Pedrera-Barcelona_Catalonia.html", "text": "...if there is such a list, that is. \"Fascinating\" is the word that comes to mind. Skipping the line by buying on-line will save you some Euros - never mind the time saved. Since each Gaudi building is more amazing than the last, just plan to see them all. Casa Mila is no exception. Never use audioguides, so can't comment.", "publishedDate": "2020-02-29", "language": "en", "rating": 5}, {"id": 748343871, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d190629-r748343871-Casa_Mila_La_Pedrera-Barcelona_Catalonia.html", "text": "I could have spent hours sitting on the roof, it did for me what he designed it for, relaxing. I cannot get over how forward thinking he was. ", "publishedDate": "2020-02-29", "language": "en", "rating": 5}, {"id": 748149432, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d190629-r748149432-Casa_Mila_La_Pedrera-Barcelona_Catalonia.html", "text": "We took our teenage grandson here in the evening during half term  He really enjoyed hearing the stories and the music/light show on the roof. It was over priced for what you actually see during the evening visit but was an interesting experience. Beforehand we enjoyed a cocktail and some tapas in the adjoining building which was also v beautiful.", "publishedDate": "2020-02-28", "language": "en", "rating": 4}, {"id": 747898035, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d190629-r747898035-Casa_Mila_La_Pedrera-Barcelona_Catalonia.html", "text": "My wife booked the night experience tour which included the meal at the cafe on the first floor. The meal was a four course meal which was inclusive of drinks. We thoroughly enjoyed the meal in the Cafe, which in itself was stunning. Then we headed down stairs to start our tour. I apologise , but i can't remember our guides name, but she was enthusiastic and very knowledgeable about the Casa Mila. Travelling through the building we learnt about the history and architectural design of the property and then finally into the Loft and Roof for the light show, which were stunning. After we had made our way back downstairs we were treated to a glass of Cava, or soft drinks withe a huge bowl of freshly made cookies to enjoy. A superb tour and great value, thank you.", "publishedDate": "2020-02-27", "language": "en", "rating": 5}, {"id": 747399561, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d190629-r747399561-Casa_Mila_La_Pedrera-Barcelona_Catalonia.html", "text": "Fabulous building, audio cover just enough to be informative without being boring.\nThe building feels as though it is breathing.", "publishedDate": "2020-02-24", "language": "en", "rating": 5}, {"id": 747381708, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d190629-r747381708-Casa_Mila_La_Pedrera-Barcelona_Catalonia.html", "text": "Bought the tickets online just the day before very easily and chose a time slot that suited us. No delays getting through and picked up  audio guides that auto changed as you moved through the different areas of the building. There is a lift to the roof and you return via stairs at the end of the tour. The rooftop trip is amazing, full of the most surreal shapes and flowing lines inspired by nature and the elements of water, earth, wind etc. What an incredibly fantastical futuristic imagination Gaudi must have had. We were so lucky with the weather as the blue skies gave the shapes a truly stunning backdrop. One of my group has a real fear of heights but was able to walk the rooftop and marvel at the place as the roof is enclosed by a waist height rolling wall around the perimeter which helped them feel safe. \nAfter coming in from the roof you enter the attic space, also magical in the way it is structured and you can learn more about how Gaudi created the building. Finally you drop down a further floor and enter the apartment, left as it would have been at the turn of the 1900's when it was first built. Some beautiful exhibits and tactile features such as the architraves and the folding connecting door between the dining room and lounge. \nHighly recommended vìsit, a must see site in Barcelona even if only there for a short time.  Great shop afterwards as well, full of unusual and gorgeous gifts. \nLove love loved it. ", "publishedDate": "2020-02-24", "language": "en", "rating": 5}, {"id": 747341103, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d190629-r747341103-Casa_Mila_La_Pedrera-Barcelona_Catalonia.html", "text": "We were able to leave our strollers in the lockers and walk up with the kids . There was also audio guide for adults and even the kids", "publishedDate": "2020-02-24", "language": "en", "rating": 5}, {"id": 747310046, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d190629-r747310046-Casa_Mila_La_Pedrera-Barcelona_Catalonia.html", "text": "Is a nice place to visit when you visit Barcelona because is in the city center. I really had a good time there. Easy to get there with tram and metro bus.", "publishedDate": "2020-02-24", "language": "en", "rating": 4}, {"id": 747283495, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d190629-r747283495-Casa_Mila_La_Pedrera-Barcelona_Catalonia.html", "text": "We booked the 8am tour of Le Pedrera with the extremely informative and entertaining Arcadi guiding us around this magnificent building.\nThe tour only had 7 of us and as the building was not open to the public yet, some great opportunities for photos. The tour includes access to the rooftop, the attic and the townhouse. Arcadi has a passion for the building and  passed on all the important aspects of the history and its creation, absolutely fascinating. We finished off with a coffee in the cafe that was included in the tour. We would highly recommend this tour.", "publishedDate": "2020-02-24", "language": "en", "rating": 5}, {"id": 746989561, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d190629-r746989561-Casa_Mila_La_Pedrera-Barcelona_Catalonia.html", "text": "I did not personally experience this tour. However, several tourists we met recommended the night tour experience and said it was a must do. Gaudi’s architecture is inspired by nature and a unique experience. Sorry we missed it.  Next time!", "publishedDate": "2020-02-23", "language": "en", "rating": 4}, {"id": 746970295, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d190629-r746970295-Casa_Mila_La_Pedrera-Barcelona_Catalonia.html", "text": "The admission is a little high at 27€, but 45% is used for maintenance of the building/museum and the balance is contributed to a fund that takes care of underprivileged people. Like all of Gaudí works, the outside has a lot going on and the inside is simple. The rooftop was beautiful but make sure to only go on a sunny day (rooftop can be closed when it rains as it is slippery). The attic is very cool and the apt gives you a glimpse into the everyday life in 1920’s. The tour ends when you hit the gift shop. The free picture is not really free as you have to buy one and you get the second free. The self-guided audio tour is very good and helps you understand a lot of the building.", "publishedDate": "2020-02-23", "language": "en", "rating": 5}, {"id": 746679393, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d190629-r746679393-Casa_Mila_La_Pedrera-Barcelona_Catalonia.html", "text": "Our tour guide was phenomenal, knowledgeable on the history and also funny. Great way to see Casa Mila!", "publishedDate": "2020-02-22", "language": "en", "rating": 5}, {"id": 746662051, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d190629-r746662051-Casa_Mila_La_Pedrera-Barcelona_Catalonia.html", "text": "Night light show on the terrace was worth seeing. Guide was very good and there was an option of the lift or 7 flights of stairs!\nHighly recommended ", "publishedDate": "2020-02-22", "language": "en", "rating": 5}, {"id": 746454191, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d190629-r746454191-Casa_Mila_La_Pedrera-Barcelona_Catalonia.html", "text": "This is a iconic land mark in Barcelona and again we have looked as passed but this time thought we must go in and we were glad we did the whole building tells a story and the views are to die for", "publishedDate": "2020-02-21", "language": "en", "rating": 5}, {"id": 746387367, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d190629-r746387367-Casa_Mila_La_Pedrera-Barcelona_Catalonia.html", "text": "The kids loved it here. It’s such a functional building and has a charm all of its own. The view from the rooftops is stunning. Worth a visit.", "publishedDate": "2020-02-20", "language": "en", "rating": 5}, {"id": 746350296, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d190629-r746350296-Casa_Mila_La_Pedrera-Barcelona_Catalonia.html", "text": "Well worth a visit if you go to just one Gaudí house. Take the lift to the roof as you see nothing on the stairs on the way up. If you struggle with heights beware of the relatively low external wall on the roof terrace. The apartment is a good snapshot of life for the well to do people of early last century. ", "publishedDate": "2020-02-20", "language": "en", "rating": 4}, {"id": 746275558, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d190629-r746275558-Casa_Mila_La_Pedrera-Barcelona_Catalonia.html", "text": "One of the fine examples of Gaudi’s work in apartment design.  Interesting detail in the courtyard, but the most fascinating element was his use of art to create a rooftop landscape that hid the chimneys, and his amazing use of light to create a feeling of openness.\nI used the audio guide which was enough information and allowed me to set my own pace.  Timed ticket entry is a blessing here, as this a big line that forms outside.  Since I purchased my ticket in advance, I walked right in.", "publishedDate": "2020-02-20", "language": "en", "rating": 5}, {"id": 746268280, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d190629-r746268280-Casa_Mila_La_Pedrera-Barcelona_Catalonia.html", "text": "Did not purchase a ticket to go in but definitely enjoyed walking around the outside!\n\nMany public monuments and sights throughout Spain require an entrance fee (which may be indicative of the Spanish economy - 14% unemployment) and often have long lines to get in unless you book in adavance.", "publishedDate": "2020-02-20", "language": "en", "rating": 4}, {"id": 746192666, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d190629-r746192666-Casa_Mila_La_Pedrera-Barcelona_Catalonia.html", "text": "I have to say, all of gaudis work is a masterpiece! How could someone at that time in life, make something so spectacular! His stuff still is the most epic architecture to date... everything looks like it could be made in the next 300-500 years!", "publishedDate": "2020-02-19", "language": "en", "rating": 5}, {"id": 745238770, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d190629-r745238770-Casa_Mila_La_Pedrera-Barcelona_Catalonia.html", "text": "Casa Milà, also known as La Pedrera, was Gaudi's final work before he dedicated himself to Sagrada Familia. It is being classified as one of his most quintessential works ever! What makes Casa Milà special is it pays attention to every detail of Gaudi's genius organic sensitivities of modernista architecture, which all created and converted into his vision of the domestic world. For me, the highlights of La Pedrera are:\n1) Facade: Which I think is the most attractive part of Casa Milà and it's hard not to be attracted by its exterior curved walls and balconies.\n2) Roof Terrace: This rooftop is filled with curved sculptures and chimneys. Unfortunately, it was shut on the day we visited due to the drizzle.\n3) La Pedrera apartment: The apartments show what the lives of the typical affluence of Barcelona in the late 19th-century were like. \n4) Staircase & courtyard: 2 words: Posh and Grand.\n5) Interior courtyard: A courtyard decorated with mosaics and multicoloured wall paintings.\n6) Espai Gaudi: This is my other favourite part of Casa Mila as I liked the cured supporting ceiling joists, interiors and its mini-museum!\nUnfortunately, we didn't have a good time at the Casa Mila due to:\n1) Staffs: All staffs we came across were rude - from the receptionist in the ticket office to the guy who escorted us to the lift. They were just unbelievably rude!\n2) Roof Terrace: Unfortunately, it was closed on the day we visited due to the light rain. We were told the roof terrace was closed shortly AFTER we brought the ticket. (When I tried to ask the staff why she didn't tell me before I paid, she pointed to a small note at the door and to the almost invisible small print on the ticket saying the terrace would be closed on the rainy day. She either allow us to come back at another time or to give us a refund.) \n3) Didn't like the apartment: To be honest, the apartment-style and the interior design were not our cups of tea. We prefered Casa Batlló much more than Casa Milà! \nTips: \ni) It's 3 Euro cheaper per ticket if you booked online, you can book it on your mobile upon arrival if you're unsure what time you'd arrived. \nii) Rainy days: Try not to visit on the rainy days as the roof terrace would be closed.", "publishedDate": "2020-02-15", "language": "en", "rating": 3}, {"id": 745217176, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d190629-r745217176-Casa_Mila_La_Pedrera-Barcelona_Catalonia.html", "text": "It's an amazing building as expected, entertaining stories and details. We had the night tour, surely fascinating, but we expected to be able to visit a bit more. On the whole, despite understanding the costs for maintenance, it's a bit pricey.", "publishedDate": "2020-02-15", "language": "en", "rating": 4}, {"id": 745154477, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d190629-r745154477-Casa_Mila_La_Pedrera-Barcelona_Catalonia.html", "text": "This one of most beautiful places in the world. Glad I visited this place. I met with my old friend use to work together in state and stay in few area around the cities. Amazing and memorable visit ", "publishedDate": "2020-02-14", "language": "en", "rating": 5}, {"id": 744887970, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d190629-r744887970-Casa_Mila_La_Pedrera-Barcelona_Catalonia.html", "text": "Really quite disappointed with our visit to la pedrera, we followed the audio guide and were in and out inside an hour. Between tour groups and school groups it was too busy, I felt like I was in someone's way wherever I was. The rooftop view is nice but not great. The audio guide was interesting in parts but I found the constant music annoying and was never sure when I could stop and chat to my husband without missing parts. \n\nWe had visited Palau guell the day before and enjoyed our visit there much more.", "publishedDate": "2020-02-13", "language": "en", "rating": 2}, {"id": 744776107, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d190629-r744776107-Casa_Mila_La_Pedrera-Barcelona_Catalonia.html", "text": "It was night when my our flight arrived in Barcelona. We  try to find a place that still open, then we find Casa Mila. I have to say the light show on the roof of Casa Mila is awsome!! The design of this building, especially the desigh of roof is the priceless treasure that Gaodi has left for us. Every single mosture has it own meaning on the roof. The tourguide of Casa Mila will tell you the legend of Gaodi.", "publishedDate": "2020-02-12", "language": "en", "rating": 5}, {"id": 744690992, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d190629-r744690992-Casa_Mila_La_Pedrera-Barcelona_Catalonia.html", "text": "We went on the night tour of Casa Mila. It was great but the group was too large, by the time the last person was in the new destination the guide was already into her presentation, We tended to miss a lot. I believe that a bit smaller group would have been better, it was difficult to see things and still follow along. ", "publishedDate": "2020-02-12", "language": "en", "rating": 4}, {"id": 744665902, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d190629-r744665902-Casa_Mila_La_Pedrera-Barcelona_Catalonia.html", "text": "I learned so much about Gaudi and visited so many sites and could never grow tired of it. Creative genius. The rooftop does seem otherworldly. I suggest spending extra for the open ticket. you can go anytime and skip the very long lineup - totally worth it.\n", "publishedDate": "2020-02-12", "language": "en", "rating": 5}, {"id": 744640321, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d190629-r744640321-Casa_Mila_La_Pedrera-Barcelona_Catalonia.html", "text": "Interesting insight into Gaudi's thinking. The audio tour is atmospheric but also full of information.", "publishedDate": "2020-02-12", "language": "en", "rating": 5}, {"id": 744304250, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d190629-r744304250-Casa_Mila_La_Pedrera-Barcelona_Catalonia.html", "text": "Very impressive and really unique. The entrance fees are too high.Nice shop with a lot of things you won't find elsewhere.", "publishedDate": "2020-02-11", "language": "en", "rating": 5}, {"id": 744163329, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d190629-r744163329-Casa_Mila_La_Pedrera-Barcelona_Catalonia.html", "text": "The first full day in Barcelona, we opted to take our own walking tour and ended up at Casa Mila.  We sprung for the immediate entrance tickets rather than the cheaper timed tickets since we didn't want to have to come back.  They have you start on the roof and work your way down.  I mean, for the first time I experienced Gaudi's genius.  I always thought his vision was too funky but when you experience the architecture up close it's mind blowing.  I usually have a fear of heights yet walking along the rooftop, I experienced none of that.  It did get a bit hot once inside, walking around the attic and got crowded at certain exhibits so take water with you.  In general this is a must see.", "publishedDate": "2020-02-10", "language": "en", "rating": 5}, {"id": 744121203, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d190629-r744121203-Casa_Mila_La_Pedrera-Barcelona_Catalonia.html", "text": "The building may not be for all, but it is well worth visiting for the wonderful exhibition at the attic gallery space, which explores and explains Gaudi's design concepts and inspiration under the brick arches.", "publishedDate": "2020-02-10", "language": "en", "rating": 5}, {"id": 744086894, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d190629-r744086894-Casa_Mila_La_Pedrera-Barcelona_Catalonia.html", "text": "The roof was tremendous and the thought behind the chimneys and arcs. The arcs framing the Sagrada Familia and Tibidabo were a highlight for photography. \nWe started at the top and descended the building through servants quarters and domestic areas. The story boards conveyed a great deal of information easily accessible. ", "publishedDate": "2020-02-10", "language": "en", "rating": 5}, {"id": 743415849, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d190629-r743415849-Casa_Mila_La_Pedrera-Barcelona_Catalonia.html", "text": "this is a master pieces. you must go see it. definitely buy skip the line ticket, its worth it. The roof top is spectacular. you can spend lots of time taking photos.", "publishedDate": "2020-02-06", "language": "en", "rating": 5}, {"id": 743233426, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d190629-r743233426-Casa_Mila_La_Pedrera-Barcelona_Catalonia.html", "text": "We didn’t go in here (tickets are available for some sort of interior experience though). So this is just a short review on walking by and stopping to see it. Basically, in a city full of cool and unique buildings, this one manages to stand out and is worth checking out, even if only to marvel at the exterior. ", "publishedDate": "2020-02-05", "language": "en", "rating": 4}, {"id": 743229234, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d190629-r743229234-Casa_Mila_La_Pedrera-Barcelona_Catalonia.html", "text": "Casa Mila is a very interesting building, but of all the Gaudi sites in Barcelona, it was the one I felt I could have skipped.  It seemed to me like a really nice apartment with some extra  flourishes.", "publishedDate": "2020-02-05", "language": "en", "rating": 4}, {"id": 742952636, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d190629-r742952636-Casa_Mila_La_Pedrera-Barcelona_Catalonia.html", "text": "Another masterpiece by Gaudì, not as beautiful as Casa Battlo, but still worth seeing, for it's uniqueness.", "publishedDate": "2020-02-03", "language": "en", "rating": 4}, {"id": 742761619, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d190629-r742761619-Casa_Mila_La_Pedrera-Barcelona_Catalonia.html", "text": "No major queue in January ...when we visited..but the house was busy. You start your tour on the very top floor of the attic and rooftop. Lots and lots of stairs but there is a lift...best ask on arrival. Worth the climb though for spectacular views and amazing detail of the whole space - created by Gaudi. A genius.\nRooms are \"as they were\" when the house was a family home and it's great to see the furniture, fittings in situ .\nAudio guide is very good . There is a shop on the ground floor as you leave the tour. Toilets are available on several floors. Well worth a visit...took us about 90 minutes. You can take photos inside. ", "publishedDate": "2020-02-03", "language": "en", "rating": 5}, {"id": 742581487, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d190629-r742581487-Casa_Mila_La_Pedrera-Barcelona_Catalonia.html", "text": "Gaudi was a true genius, the house is impressive on the outside and inside. all you can visit here is impressive, so it is also a must when in Barcelona. ", "publishedDate": "2020-02-02", "language": "en", "rating": 5}, {"id": 741966686, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d190629-r741966686-Casa_Mila_La_Pedrera-Barcelona_Catalonia.html", "text": "I really recommend to visit Casa la Pedrera, all the Gaudi creations are a life experience more than architectural structures.\nThis stop have to be included in you trip!", "publishedDate": "2020-01-29", "language": "en", "rating": 5}, {"id": 741890064, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d190629-r741890064-Casa_Mila_La_Pedrera-Barcelona_Catalonia.html", "text": "This is a must visit in Barcelona. A masterpiece by Gaudi. Highlight is definitely the rooftop. Audio guide was very helpful. Make sure you book tickets online in advance. It’s not as crowded as I expected, maybe because we got in during the earliest time slot. ", "publishedDate": "2020-01-29", "language": "en", "rating": 5}, {"id": 741614157, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d190629-r741614157-Casa_Mila_La_Pedrera-Barcelona_Catalonia.html", "text": "We loved our stop here.  It is crazy how it just settles into the block.  Worth a stop and an look!  We ate lunch with a view of this beautiful building!", "publishedDate": "2020-01-27", "language": "en", "rating": 5}, {"id": 741607813, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d190629-r741607813-Casa_Mila_La_Pedrera-Barcelona_Catalonia.html", "text": "This a beautiful house and the price of the ticket was worth it if you love Gaudi and how his brain worked. The roof of this building is stunning and indescribable. If there is a possibility of going you should make the time. ", "publishedDate": "2020-01-27", "language": "en", "rating": 5}, {"id": 741558488, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d190629-r741558488-Casa_Mila_La_Pedrera-Barcelona_Catalonia.html", "text": "I finally made it to La Pedrera after countless trips to Barcelona. Why did I wait so long?? This is a must see and the rooftop is indescribable. Don’t hesitate, pay the entrance fee and just go see it! You won’t be disappointed.", "publishedDate": "2020-01-27", "language": "en", "rating": 5}, {"id": 741347552, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d190629-r741347552-Casa_Mila_La_Pedrera-Barcelona_Catalonia.html", "text": "Debated about visiting Casa Mila and/or Casa Batllo’ as tickets are pretty pricey.  Ended up choosing Casa Mila because it was designed from “ground up” by Gaudi and also includes some furnishings whereas Casa Batllo was a renovation.\nAudio guide was helpful and available in an array of languages.  Main disappointment was that the space inhabited by the Mila family was not available to tour.  Only one of the apartments above.  The roof was spectacular and also offers wonderful views of the city.", "publishedDate": "2020-01-26", "language": "en", "rating": 4}, {"id": 741023717, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d190629-r741023717-Casa_Mila_La_Pedrera-Barcelona_Catalonia.html", "text": "A strange building but a satisfying tour around.\nThe audio commentary was clear and very good quality and the rooftop and furnished room was very good ", "publishedDate": "2020-01-24", "language": "en", "rating": 4}, {"id": 740437088, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d190629-r740437088-Casa_Mila_La_Pedrera-Barcelona_Catalonia.html", "text": "This is the most amazing building i ever saw. And turns out that is from the last century. \n\nIt is crowded, but the waiting is worth it. I won't anticipate what you are gonna find in there, just go and visit yourself\n\nDon't miss it. It's a must if you are in Barcelona", "publishedDate": "2020-01-21", "language": "en", "rating": 5}, {"id": 740435277, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d190629-r740435277-Casa_Mila_La_Pedrera-Barcelona_Catalonia.html", "text": "Unfortunately it was a wet, very windy day and the terrace was closed. But that was okay for we still enjoyed our visit. Gaudi was brilliant and we have seen some other of his designs on this trip. I was amazed how he took natural shapes and incorporated them into his work. The layout of the attic was impressive and the displays on how the building was built was also remarkable. We also enjoyed viewing the apartments and seeing some of the furniture of the day and how the residents would have lived.The audio guide was a great help too. Really enjoyed it and we spent well over 2 hours there. ", "publishedDate": "2020-01-21", "language": "en", "rating": 5}, {"id": 740371525, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d190629-r740371525-Casa_Mila_La_Pedrera-Barcelona_Catalonia.html", "text": "We unfortunately went on a very rainy night, but it was still beautiful and the light was was nice how it was all done even in he rain", "publishedDate": "2020-01-20", "language": "en", "rating": 5}, {"id": 740324376, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d190629-r740324376-Casa_Mila_La_Pedrera-Barcelona_Catalonia.html", "text": "This is lovely from the outside, but the tour is worth it as well if you appreciate architecture. You'll learn a lot about Gaudi and his works.  A great view of the city from the roof.", "publishedDate": "2020-01-20", "language": "en", "rating": 5}, {"id": 740314495, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d190629-r740314495-Casa_Mila_La_Pedrera-Barcelona_Catalonia.html", "text": "Last time my husband and I were in Barcelona (22 years ago), we saw La Pedrera but could not go in.  Finding out that you could now do a self-guided tour was a reason we choose Barcelona again.  The roof, with it's chimneys and towers, was mesmerizing!  Worth the wait!", "publishedDate": "2020-01-20", "language": "en", "rating": 5}, {"id": 740103442, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d190629-r740103442-Casa_Mila_La_Pedrera-Barcelona_Catalonia.html", "text": "My husband and I came here for a self-guided tour and really enjoyed this unique building. We especially like the roof and it’s towers. Gaudi was a genius in his designs and we really like this place.", "publishedDate": "2020-01-19", "language": "en", "rating": 5}, {"id": 739968601, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d190629-r739968601-Casa_Mila_La_Pedrera-Barcelona_Catalonia.html", "text": "Lovely building, very expensive to enter and look round. \nYou can see enough without going in and looking round. ", "publishedDate": "2020-01-19", "language": "en", "rating": 4}, {"id": 739352958, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d190629-r739352958-Casa_Mila_La_Pedrera-Barcelona_Catalonia.html", "text": "Yet another Gaudi marvel. The rooftop chimneys are imposing and incredible. The museum demonstrates Gaudi's love of nature and his vision for his masterpieces such as Sagrada Familia. The building itself is on a street amongst shops, and if it wasn't for the intrivate external designs, you might miss it- don't! It's amazing!", "publishedDate": "2020-01-15", "language": "en", "rating": 5}, {"id": 739007095, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d190629-r739007095-Casa_Mila_La_Pedrera-Barcelona_Catalonia.html", "text": "It has been several years since my previous visit. This time with my husband was a new and exciting experience. Both of us really enjoyed the roof, the attic, and the apartment. My husband's favorite was the roof. We were lucky with the weather and few tourists. My favorite was the apartment as there was much to see and I couldn't remember this from my earlier visit. Much to enjoy here although the audio was annoying for me. My husband liked it.", "publishedDate": "2020-01-13", "language": "en", "rating": 5}, {"id": 738995974, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d190629-r738995974-Casa_Mila_La_Pedrera-Barcelona_Catalonia.html", "text": "It was worth while going. The architecture was amazing.\nThe roof top was spectacular. Definitely get tickets ahead of time. The audio is a must.", "publishedDate": "2020-01-13", "language": "en", "rating": 5}, {"id": 738873925, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d190629-r738873925-Casa_Mila_La_Pedrera-Barcelona_Catalonia.html", "text": "Beautiful looking building, \nShame buildings aren’t as beautiful as this any more. \n\nDefo worth a look if the weather is nice ", "publishedDate": "2020-01-13", "language": "en", "rating": 4}, {"id": 738833128, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d190629-r738833128-Casa_Mila_La_Pedrera-Barcelona_Catalonia.html", "text": "So, I fell out with Google Maps while walking from Parc Guell to the Casa Mila. Google Maps took me to somewhere near by but not the building and not this street. I've put the name of the street as the title so you only need to find the street and you will eventually find the beautiful building. Due to time constraints and having an evening activity booked, we didn't get to go inside. Perhaps on my next visit, I'll get to go inside. By the way, that street, Passeig de Gracia is also lovely to walk down. ", "publishedDate": "2020-01-13", "language": "en", "rating": 4}, {"id": 738774580, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d190629-r738774580-Casa_Mila_La_Pedrera-Barcelona_Catalonia.html", "text": "We bought tickets online for the standard tour which included the audio guide, which was good. The tour starts in the lovely courtyard of the building. It’s amazing how everything is unique in this building- there is no symmetry. The next stop is the level just below the roof. We skipped the elevator and took the stairs and had to walk up about 8 flights, in a lovely stairwell. The roof was interesting with its many levels and surreal sculptures. From the roof we had a spectacular view of Passeig de Gràcia and the central area within the block to which Casa Mila belongs. What I enjoyed most though was touring the apartment of one of the building’s wealthy residents from 100 years ago. The rooms were meticulously preserved, and it was just fascinating and beautiful.", "publishedDate": "2020-01-12", "language": "en", "rating": 5}, {"id": 738741064, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d190629-r738741064-Casa_Mila_La_Pedrera-Barcelona_Catalonia.html", "text": "Beautiful architecture and less busy than Casa Battlo. Slightly expensive but worth it considering an audio guide is included. If you enjoy Gaudi’s style youll enjoy your visit. I personally loved it!", "publishedDate": "2020-01-12", "language": "en", "rating": 5}, {"id": 738704532, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d190629-r738704532-Casa_Mila_La_Pedrera-Barcelona_Catalonia.html", "text": "We booked the night experience and were thoroughly disappointed. Our tour guide wasn't engaged at all with what she was saying, most of which is a rehash of what you'll hear and read at every other Gaudi site. Some of the tour feels like a gimmick to mask the fact that most of Casa Mila isn't accessible to you. The views from the top are a silver lining. The tour could have been much improved with a better guide, but overall it's hard to justify the cost.", "publishedDate": "2020-01-12", "language": "en", "rating": 2}, {"id": 738457844, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d190629-r738457844-Casa_Mila_La_Pedrera-Barcelona_Catalonia.html", "text": "Visit and the roof top show is not a bad way to wind up your evening. We weren't disappointed but slightly underwhelmed. Maybe our expectations from the reputation of this place was higher than what it is. Still, worth the visit for the originality.", "publishedDate": "2020-01-11", "language": "en", "rating": 4}, {"id": 738112710, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d190629-r738112710-Casa_Mila_La_Pedrera-Barcelona_Catalonia.html", "text": "Casa Mila is bigger than Casa Batlio, but not as good looking from outside. It looks somewhat ordinary except for the lighting and teh crowd. Only exception being the balcony railings - which are of irregular shape.", "publishedDate": "2020-01-09", "language": "en", "rating": 3}, {"id": 738056616, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d190629-r738056616-Casa_Mila_La_Pedrera-Barcelona_Catalonia.html", "text": "The audio tour and displays do an amazing job of explaining Gaudi's approach to architecture to the curious novice.  It's a must-do before seeing the Sagrada Familia.  Splurge on the Premium tickets form the site's website.  You are whisked to a separate security check and front of the line all the way ~ well worth the extra 7 euros.", "publishedDate": "2020-01-09", "language": "en", "rating": 5}, {"id": 737983001, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d190629-r737983001-Casa_Mila_La_Pedrera-Barcelona_Catalonia.html", "text": "Go at sunset, and watch the sun setting over the ventilation shafts on the rooftop. Then take your time exploring the attic and apartments and get a feel as to how people lived in the 1920s. ", "publishedDate": "2020-01-08", "language": "en", "rating": 5}, {"id": 737980692, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d190629-r737980692-Casa_Mila_La_Pedrera-Barcelona_Catalonia.html", "text": "We came to this after visiting Familia Sagrada. This amazing building and the excellent audio guide gives you a real insight into the genius of Gaudi, a man way ahead of his times. We did a tour of the Familia Sagrada and the guide spent lots of time talking about bible stories. Maybe fine if you were a Roman Catholic.", "publishedDate": "2020-01-08", "language": "en", "rating": 5}, {"id": 737950741, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d190629-r737950741-Casa_Mila_La_Pedrera-Barcelona_Catalonia.html", "text": "When you attend the night experience, you will not see the apartments with the furnitures, you will get a semi-private tour with a guide who will tell you about the building and its history. You will start at the foyer/atrium and head straight to the attic and then the roofdeck where you will watch a light show. At the end of the tour, you will have cava and sweets. I won't spoil it any further, but if you're looking for something to do, I don't think this will disappoint. It was a nice relaxing way to end the night.", "publishedDate": "2020-01-08", "language": "en", "rating": 4}, {"id": 737926913, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d190629-r737926913-Casa_Mila_La_Pedrera-Barcelona_Catalonia.html", "text": "We purchased tickets through Viator for a 10:30 admission on New Years Day as we had an early afternoon train departure so we had about 90 minutes to complete the tour. When we arrived, we found out they did not open until 11:00 am (We were not the only ones sold tickets before the operating hours) Then during the tour, our headsets were not working (2 out of 4 of us) and discovered this once we were on the roof where you basically start (many steps up). They tried to reset our headsets but they still did not work. The entire experience was frustrating. My recommendation is do not purchase tickets through Viator (2nd awful experience with this company) and Casa Mila- you need to do something with the headset experience.", "publishedDate": "2020-01-08", "language": "en", "rating": 2}, {"id": 737886875, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d190629-r737886875-Casa_Mila_La_Pedrera-Barcelona_Catalonia.html", "text": "I have become a big enthusiast over Gaudi's works and this place has so much to offer.  plan on spending some time studying the roof and it's strange but awesome structures.\nThe attic is very unusual and deserves some reverent investigating.  Love this place.", "publishedDate": "2020-01-08", "language": "en", "rating": 5}, {"id": 737635692, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d190629-r737635692-Casa_Mila_La_Pedrera-Barcelona_Catalonia.html", "text": "Our first stop off on day one, lovely staff. Good menu outside. We had a small bite 2 teas and the Coca bread, simple and nice", "publishedDate": "2020-01-07", "language": "en", "rating": 4}, {"id": 737628067, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d190629-r737628067-Casa_Mila_La_Pedrera-Barcelona_Catalonia.html", "text": "This place is situated in a street full of shops so cannot be missed. Beautiful building to see. Unusual shape and design.", "publishedDate": "2020-01-07", "language": "en", "rating": 4}, {"id": 737626001, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d190629-r737626001-Casa_Mila_La_Pedrera-Barcelona_Catalonia.html", "text": "One of the famous works of Gaudi in Barcelona, this beautiful building can be seen on a walk along Passeig de Gracia coming from Placa de Catalyuna.", "publishedDate": "2020-01-07", "language": "en", "rating": 4}, {"id": 737570256, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d190629-r737570256-Casa_Mila_La_Pedrera-Barcelona_Catalonia.html", "text": "This place is a very unusual hundred-year old apartment building designed by Gaudi in his usual style. While it may look strange to us, it seems very well laid-out and would have been a great place to live at the time. The roof is a challenge for anyone with problems with heights, but there are handrails to hold!", "publishedDate": "2020-01-07", "language": "en", "rating": 4}, {"id": 737514215, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d190629-r737514215-Casa_Mila_La_Pedrera-Barcelona_Catalonia.html", "text": "Starting in the central courtyard, there are so many beautiful features of the building to admire. The tour then proceeds to one level below the roof and works its way down. We took the  stairs instead of elevator, and had to walk up about 8 flights (in a lovely stairwell). The audioguide was good, not great. All that aside, seeing Case Mila was a delight. The undulating roof with its many levels and sculptures provided fantastic views of Passeig de Gracia. What I most enjoyed was touring the apartment of one of the wealthy tenants, which was like stepping into a time capsule from over 100 years ago.", "publishedDate": "2020-01-07", "language": "en", "rating": 5}, {"id": 737340355, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d190629-r737340355-Casa_Mila_La_Pedrera-Barcelona_Catalonia.html", "text": "Recommendation for online tickets (3€ less than regular price and skipping the line). La Pedrera is absolutely amazing, no right words for it. Must, must see!", "publishedDate": "2020-01-06", "language": "en", "rating": 5}, {"id": 737327276, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d190629-r737327276-Casa_Mila_La_Pedrera-Barcelona_Catalonia.html", "text": "This really shows how a house can be made in apartment style. Your starts from the top i.e. From roof (via lift) and then you come down one floor at a time to see rest of the things. It also shows an actual apartment how it was in the old time. Audio guide was really helpful. ", "publishedDate": "2020-01-06", "language": "en", "rating": 4}, {"id": 737135622, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d190629-r737135622-Casa_Mila_La_Pedrera-Barcelona_Catalonia.html", "text": "This was a great addition to our Gaudi stops in Barcelona. We, 51yo mmother and 20 and 22yo daughter and son, all got something different out of it. My engineer son, loved the structural tour in the attic and the clues(chains) that helped him design the arches and shapes. My romantic, imaginative daughter loved the projections onto the chimneys. And I loved it all. The more I experience Gaudi, the more I am infatuated with his work. We did this after the Güell Park and Sagrada Família. It was a fun thing to do after dark, and the views from the top are spectacular!", "publishedDate": "2020-01-05", "language": "en", "rating": 5}, {"id": 737015943, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d190629-r737015943-Casa_Mila_La_Pedrera-Barcelona_Catalonia.html", "text": "Casa Milà is a must visit site for anyone living or visiting Barcelona. \nIt is the most unique, gorgeous, practical and grounding apartment building I have ever seen. \nCasa Milà’s attic exhibits Gaudí’s thought process, his work, vision and how his work is dedicated to nature and how is brings in the best of nature into his work through its engineering, shapes, forms, lighting and so much more. \nA must visit before heading to Sagrada Familia. ", "publishedDate": "2020-01-05", "language": "en", "rating": 5}, {"id": 736954250, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d190629-r736954250-Casa_Mila_La_Pedrera-Barcelona_Catalonia.html", "text": "The whole tour was mesmerising! Loved the roof solders. The audio was amazing and had a good sound quality. It was run very well. The same as Casa Batlo. when you are there you don't want to leave. I went back and visited previously seen places again. A must to see when in Barcelona", "publishedDate": "2020-01-04", "language": "en", "rating": 5}, {"id": 736877524, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d190629-r736877524-Casa_Mila_La_Pedrera-Barcelona_Catalonia.html", "text": "Genius Antoni Gaudí built this fascinating building in the center of Barcelona. The audio guide is very well clear and helps to have a deeper experience. It’s worth value to buy the tickets online", "publishedDate": "2020-01-04", "language": "en", "rating": 5}, {"id": 736873525, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d190629-r736873525-Casa_Mila_La_Pedrera-Barcelona_Catalonia.html", "text": "Barcelona is full of houses, parks and monuments built by Gaudi and it is impossible to visit every one of them in a few days. La Pedrera ( meaning they Quarry, a name given to it by the inhabitants of the city) was our choice and it proved to be very interesting especially because of the very unusual and beautiful attic. \n\nThe house is at a junction on Passeig de Gràcia and looks beautiful with its nice form and the balconies with interesting iron decorations. \nThe terrace is nice with the interesting and symbolic chimneys, however if you have problems with your knees, it is difficult because you are constantly climbing or going down the stairs. \nThere is an elevator that takes you to the terrace but be careful going around if you have health problems. \n\nThe auto guide explains everything very well. \nThe furnished apartment gives you a good idea about the period. There is a nice short video here as well. If you would like to use the elevator going down 4-5 floors, be careful not to miss it. \n\nThe free photo is NOT free, just a tourist trap, the first photo is 10 euros, the second one is free!!!\nThe museum shop is excellent with nice books and objects. ", "publishedDate": "2020-01-04", "language": "en", "rating": 5}, {"id": 736871805, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d190629-r736871805-Casa_Mila_La_Pedrera-Barcelona_Catalonia.html", "text": "The name \"Gaudi\" should suffice. Why would anybody need 100 characters to describe. Go inside by day and by night repeat to your heart content.", "publishedDate": "2020-01-04", "language": "en", "rating": 5}, {"id": 736354351, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d190629-r736354351-Casa_Mila_La_Pedrera-Barcelona_Catalonia.html", "text": "The audio tour for this is automatically triggered as you walk past certain tour points.  While cool, if you get stuck behind a slow group or backtrack or move too quickly, you might hear the same info twice or completely miss something.  It’s also hard to tell how close to the end you are.  But the info is informative and brings the building to life.  In creating this building without written drawings, Gaudí kind of winged it as he went, and you get to see how he developed the most effective building elements (spoiler alert - it involves a mirror and chains).  Seeing the roof elements (giant chess pieces?) and especially the attic demonstrates his creative genius.  The lack of straight lines nearly everywhere is pretty amazing. There are still tenants in the building, so the tour is generally the lobby, roof, attic, and furnished apartment in that order.  Two nice gift shops are available as well.", "publishedDate": "2020-01-02", "language": "en", "rating": 5}, {"id": 736039144, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d190629-r736039144-Casa_Mila_La_Pedrera-Barcelona_Catalonia.html", "text": "Lovely way to get to know the works of Gaudi! Buy your tickets online so you don’t have to wait in the long line. Takes about an hour or so to do.", "publishedDate": "2020-01-01", "language": "en", "rating": 4}, {"id": 735970258, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d190629-r735970258-Casa_Mila_La_Pedrera-Barcelona_Catalonia.html", "text": "Seeing the building from outside is not so inspiring i just bought the entrance as frustrated from Sagrada Familia endless queue. But inside completely different story. Amazing experience lucky I went for sunset. ", "publishedDate": "2019-12-31", "language": "en", "rating": 5}, {"id": 735926152, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d190629-r735926152-Casa_Mila_La_Pedrera-Barcelona_Catalonia.html", "text": "We purchased our tickets (16.50 Euros per person senior admission) to Casa Mila, also called La Pedrera (built 1905-1910) on our walk there and were able to enter quickly. We found it even more fascinating than Casa Batllo, especially the rooms that were furnished as they would have been for the residents of the building, and, of course, the incredible rooftop with its creative stairwells, ventilation towers, and chimneys. The cost of admission is used to maintain the house and to fund charitable endeavors of the Foundation. We were glad we decided to include this building in our tour of Gaudi-designed sights.", "publishedDate": "2019-12-31", "language": "en", "rating": 5}, {"id": 735828449, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d190629-r735828449-Casa_Mila_La_Pedrera-Barcelona_Catalonia.html", "text": "Superb audioguide which changed programme as you walked passed the different rooms. The visit to the appartements was most interesting.", "publishedDate": "2019-12-31", "language": "en", "rating": 4}, {"id": 735644490, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d190629-r735644490-Casa_Mila_La_Pedrera-Barcelona_Catalonia.html", "text": "We were fortunate to visit during low season and the lack of crowds in the early AM allowed for some pretty easy upward gazing and picture taking.  A Gaudi masterpiece indeed, but unsure if there is much need to invest the money to go inside. Just my humble opinion.", "publishedDate": "2019-12-30", "language": "en", "rating": 4}, {"id": 735559188, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d190629-r735559188-Casa_Mila_La_Pedrera-Barcelona_Catalonia.html", "text": "Another one of gaudis amazing masterpiece. It’s a really nice shape and it’s weirdly fascinating too look at. Walk further away from it then look at it, it’s brilliant.", "publishedDate": "2019-12-30", "language": "en", "rating": 5}, {"id": 735413613, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d190629-r735413613-Casa_Mila_La_Pedrera-Barcelona_Catalonia.html", "text": "Easy to find and within easy walking distance from the go this pc and central area. Amazing structure from the outside and worth a visit.", "publishedDate": "2019-12-29", "language": "en", "rating": 5}, {"id": 735341156, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d190629-r735341156-Casa_Mila_La_Pedrera-Barcelona_Catalonia.html", "text": "Did the audio tour which started on the roof. It was like an adult playground. So well thought out and original and fun to walk around on. The audio skips to where you are so if you want to do the self guided tour more quickly you can. Then we went to the attic which was huge and really cool. After that we went to an apartment.  It had a great layout for an older city apartment with furniture and trinkets from the time period. After the apt you can take the stairs down to the entrance/courtyard. Loved this tour. ", "publishedDate": "2019-12-29", "language": "en", "rating": 5}, {"id": 735033607, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d190629-r735033607-Casa_Mila_La_Pedrera-Barcelona_Catalonia.html", "text": "When you been in Barcelona of course you have to visit Gaudí’s buildings so I recommend you to start with casa Mila and of course the night experience!!!! You will love it 😍", "publishedDate": "2019-12-27", "language": "en", "rating": 5}, {"id": 735029760, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d190629-r735029760-Casa_Mila_La_Pedrera-Barcelona_Catalonia.html", "text": "There is a reason why this stunning creation was declared UNESCO World Heritage in 1984. This beautiful building is in Passeig de Gracia  near Casa Batllo. Love the design as definitely looked more classier than other Gaudi creations (with the exception of course of the magnificent La Sagrada Familia)\n\nWorth visiting.\n\nHope this helps,\nGorgeous Raquel", "publishedDate": "2019-12-27", "language": "en", "rating": 4}, {"id": 734820404, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d190629-r734820404-Casa_Mila_La_Pedrera-Barcelona_Catalonia.html", "text": "This was my favourite Gaudi built house.  It had the Gaudi treatment, but a little less intense.  The histrorical information of Gaudi's work was very interesting as it also gave an insight of how he formed his ideas for shapes.", "publishedDate": "2019-12-26", "language": "en", "rating": 5}, {"id": 734465939, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d190629-r734465939-Casa_Mila_La_Pedrera-Barcelona_Catalonia.html", "text": "One of the premier attractions in Barcelona which attracts a lot of visitors so worth booking ahead, worth it for the undulating rooftop views and the unique chimneys , the street view is also photo worthy but in my opinion Casa Battlo is the better of the 2 Gaudi masterpieces on the Passeig de Gracia if you had only time to do one.", "publishedDate": "2019-12-24", "language": "en", "rating": 5}, {"id": 734303627, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d190629-r734303627-Casa_Mila_La_Pedrera-Barcelona_Catalonia.html", "text": "This place is a must see very unusual but fantastic place quirky but planned with great detail. Go up onto the roof great views over Barcelona", "publishedDate": "2019-12-23", "language": "en", "rating": 5}, {"id": 734290880, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d190629-r734290880-Casa_Mila_La_Pedrera-Barcelona_Catalonia.html", "text": "Situated along the Passeig de Gracia (very close to Casa Batllo) lies another of Gaudi's amazing architectures.\n\nThe place right now is used as an office however some of the floors are used as a museum like experience.  The housing estate was rented out before as a residence to affluent families in Barcelona and it's nice to see how they lived in the early 19th century.\n\nBest part is the rooftop where the best architectural designs are laid bare and is the best place to walk around.\n\nBook tickets in advance as lines get long especially in the afternoon and is best paired with the Casa Batllo visit which is a few blocks away.", "publishedDate": "2019-12-23", "language": "en", "rating": 4}, {"id": 733931014, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d190629-r733931014-Casa_Mila_La_Pedrera-Barcelona_Catalonia.html", "text": "An amazing city, La Pedrera was fascinating- so much history and information given. A must if you visit", "publishedDate": "2019-12-21", "language": "en", "rating": 5}, {"id": 733779480, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d190629-r733779480-Casa_Mila_La_Pedrera-Barcelona_Catalonia.html", "text": "A stunning creation by the famous city architect Antony Gaudi, it is a must see place in Barcelona. Advance online ticketing shall help to save on time. ", "publishedDate": "2019-12-20", "language": "en", "rating": 5}, {"id": 733648080, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d190629-r733648080-Casa_Mila_La_Pedrera-Barcelona_Catalonia.html", "text": "Beautiful experience went for the evening dinner and tour with my husband and watched the light show on the roof it’s a must do in Barcelona we loved every moment including the champagne toast at the end it was incredible from beginning to end Gaudi is a genius and this tour was phenomenal. Loved the dinner before in the beautiful restaurant it was all really a five star event!", "publishedDate": "2019-12-19", "language": "en", "rating": 5}, {"id": 733394342, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d190629-r733394342-Casa_Mila_La_Pedrera-Barcelona_Catalonia.html", "text": "A beautiful modernist building by the great architect Antoni Gaudí. We did not go inside but we were able to enjoy the spectacular design from the street. ", "publishedDate": "2019-12-18", "language": "en", "rating": 4}, {"id": 733248980, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d190629-r733248980-Casa_Mila_La_Pedrera-Barcelona_Catalonia.html", "text": "It is odd to be oogling an apartment building, but the displayed genius of Gaudi in Barcelona is one of the main reasons one visits. Quite Crowded,which is why I gave it 4 stars instead of 5, but it is worth going to, and worth examining the work product of a man totally beyond time.", "publishedDate": "2019-12-17", "language": "en", "rating": 4}, {"id": 733061576, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d190629-r733061576-Casa_Mila_La_Pedrera-Barcelona_Catalonia.html", "text": "This is quintessential Gaudi and very well organized and maintained. It might seem a bit pricey but it is worth it with the level of detail and explanation. The automatic audio tour is excellent and executed so well you wonder why more places can’t provide the same. The building is completely laid out for you between all the exhibits and its a great place to go before going to the amazing La Sagrada.", "publishedDate": "2019-12-16", "language": "en", "rating": 5}, {"id": 732939594, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d190629-r732939594-Casa_Mila_La_Pedrera-Barcelona_Catalonia.html", "text": "Don’t skip this place because you have visited Casa Batllo. This place offersa different kind of magic. It is as colourful and wonderful, bringing nature and colour to life in architecture as one has never seen before. Definitely a must see!", "publishedDate": "2019-12-15", "language": "en", "rating": 5}, {"id": 732900277, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d190629-r732900277-Casa_Mila_La_Pedrera-Barcelona_Catalonia.html", "text": "Outside of this beautiful building is the highlight. Don’t waste time going inside with rude staff. Just admire from our side. Beautiful at night as well!", "publishedDate": "2019-12-15", "language": "en", "rating": 4}, {"id": 732890070, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d190629-r732890070-Casa_Mila_La_Pedrera-Barcelona_Catalonia.html", "text": "Very impressive how Gaudí used the natural light for interior spaces, the natural airflow within the building and the admirable space functionality", "publishedDate": "2019-12-15", "language": "en", "rating": 5}, {"id": 732847153, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d190629-r732847153-Casa_Mila_La_Pedrera-Barcelona_Catalonia.html", "text": "My husband is a general contractor and he was completely in awe of this building. It is beautiful, innovative and a must see and experience.", "publishedDate": "2019-12-15", "language": "en", "rating": 5}, {"id": 732819981, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d190629-r732819981-Casa_Mila_La_Pedrera-Barcelona_Catalonia.html", "text": "Casa Mila is a great piece of architecture but if you’ve done casa Battlo i guess its a bit of an overkill.", "publishedDate": "2019-12-15", "language": "en", "rating": 3}, {"id": 732783130, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d190629-r732783130-Casa_Mila_La_Pedrera-Barcelona_Catalonia.html", "text": "Beautiful place. Amazing.\nHowever, very unfriendly staff from beginning to end. They didn't want us there even though we have the most super amazing Spanish guide (not from Casa Mila).", "publishedDate": "2019-12-15", "language": "en", "rating": 1}, {"id": 732549358, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d190629-r732549358-Casa_Mila_La_Pedrera-Barcelona_Catalonia.html", "text": "This is one of the two Gaudi designed homes on display in the great city of Barcelona – both are within around 15 minutes walk. Allow around an hour to visit and enjoy the views of the city and the building from the terrace on the roof which has many unique Gaudi designed and built features including many Darth Vader-like heads which actually camouflage chimneys. A self-guided audio tour is available which takes you via a lift to the upper levels and from here you descend through the various floors and living spaces including museum rooms with original items of the era. A nice little shop sells works of art along with souvenirs. Washrooms are clean. Altogether a very nice visit and one learns more about this amazing man with more to his skills than the magic Sagrada and Guell Parc. Entrance is not cheap however at around 24 Euro but we figured we won’t be back so we splurged. You can pre-book online to avoid the queues of visitors but we were there just after peak tourist season and arrived at opening time so had really little delay.", "publishedDate": "2019-12-13", "language": "en", "rating": 5}, {"id": 732079594, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d190629-r732079594-Casa_Mila_La_Pedrera-Barcelona_Catalonia.html", "text": "La Pedrera was Gaudi's last project before Sagrada Familia. It is very interesting and the self-guided audio tour is included in the admission price and  worth taking  ", "publishedDate": "2019-12-11", "language": "en", "rating": 4}, {"id": 731896355, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d190629-r731896355-Casa_Mila_La_Pedrera-Barcelona_Catalonia.html", "text": "Definitely buy ticket in advance and use audioguide.  It's crowded on the inside and lots of stairs.  It's beautiful but was not my favorite place in Barcelona.\n", "publishedDate": "2019-12-10", "language": "en", "rating": 3}, {"id": 731846332, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d190629-r731846332-Casa_Mila_La_Pedrera-Barcelona_Catalonia.html", "text": "Breathtaking and so, so clever. The guided tour with the radio is brilliant, not cheap but its like nothing else, hard to explain, just go inside and its another world.", "publishedDate": "2019-12-10", "language": "en", "rating": 5}, {"id": 731829363, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d190629-r731829363-Casa_Mila_La_Pedrera-Barcelona_Catalonia.html", "text": "What a fantastic building! I am glad we got the audio guide and went to the terrace, where some important work was done as well. Truth be told, it did feel short for the €25 paid, but it was a fantastic experience, and while I wouldn't do it again, would recommend doing it at least once!", "publishedDate": "2019-12-10", "language": "en", "rating": 4}, {"id": 731762410, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d190629-r731762410-Casa_Mila_La_Pedrera-Barcelona_Catalonia.html", "text": "This Gaudi building Case Mila is a must to see. Not only the insite but also the roof deck outside.  You will have a mazing look at La Sagrada Familia. The campus Basilica in Barcelona. ", "publishedDate": "2019-12-09", "language": "en", "rating": 5}, {"id": 731648928, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d190629-r731648928-Casa_Mila_La_Pedrera-Barcelona_Catalonia.html", "text": "Got online tickets and skiped the line which wasn't huge in the end of November. This is another amazing masterpiece of talented architect. Audioguide makes your visit more interesting so it is worth to take it. Here you can take a look in the daily life of one family with good income in the beginning of 20th century. If you visit this house in the eve you can see amazing sunset from the roof top. ", "publishedDate": "2019-12-09", "language": "en", "rating": 5}, {"id": 731473105, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d190629-r731473105-Casa_Mila_La_Pedrera-Barcelona_Catalonia.html", "text": "I only had about 5 hours' stopover in Barcelona so I went from the airport straight there because my friend recommended it to me.\nIt took me about an hour or so to walk leisurely throughout the beautiful complex and take tons of photos.\nI highly recommend going there. It's extremely interesting and gorgeous.", "publishedDate": "2019-12-08", "language": "en", "rating": 5}, {"id": 731445671, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d190629-r731445671-Casa_Mila_La_Pedrera-Barcelona_Catalonia.html", "text": "WE LOVE GAUDI!   Our tour guide loved him too. Absolutely stunning and fascinating behind the scenes tour of a Barcelona icon.", "publishedDate": "2019-12-08", "language": "en", "rating": 5}, {"id": 731429626, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d190629-r731429626-Casa_Mila_La_Pedrera-Barcelona_Catalonia.html", "text": "A stunning and unique house which showcases the work of Gaudi, the rooftop is amazing with views of one of the main roads in Barcelona. You can also see Gaudi’s influences that went into the roof design along with the Sagrada Familia. A must see if you are in Barcelona - around 2-3 hours is plenty of time to see the whole house. You also get given headphones and an audio set so you can hear about the building as you move around.", "publishedDate": "2019-12-08", "language": "en", "rating": 4}, {"id": 731003717, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d190629-r731003717-Casa_Mila_La_Pedrera-Barcelona_Catalonia.html", "text": "Great to see, not far from middle of the city - go and check this out as it is very interesting architecture", "publishedDate": "2019-12-06", "language": "en", "rating": 4}, {"id": 730902034, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d190629-r730902034-Casa_Mila_La_Pedrera-Barcelona_Catalonia.html", "text": "It is definitely another worth visiting to enjoy the beauty of Gaudi's works.  Yet, frankly speaking, i t was not as impressive as Casa Battlo, which  I believe is the best of the best, if you are looking for his works.", "publishedDate": "2019-12-05", "language": "en", "rating": 3}, {"id": 730880711, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d190629-r730880711-Casa_Mila_La_Pedrera-Barcelona_Catalonia.html", "text": "I purchased the combo ticket for both a self-guided-with-audio daytime admission and a nighttime guided tour and multimedia show of light and sound on the rooftop.\n\nThe self-guided daytime admission was awesome, and the audio tour was informative.  Touring the furnished apartment was the highlight of this visit.\n\nThe nighttime guided tour covered a lot of the same ground as in the daytime (but does *not* include the apartment).  I did not really enjoy the nighttime multimedia event on the rooftop...it seemed a bit twee, as the Brits like to say.\n\nMy bottom line: one visit to La Pedrera should be sufficient to take in this amazing Gaudi building; and, in my view, the self-guided daytime tour (which includes the apartment) is the superior choice.", "publishedDate": "2019-12-05", "language": "en", "rating": 4}, {"id": 730873972, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d190629-r730873972-Casa_Mila_La_Pedrera-Barcelona_Catalonia.html", "text": "It is worth to visit that place. You can go to roof top and enjoy the Barcelona city sightseeing with the elevation view. The marvellous architectural design can make you surprised. ", "publishedDate": "2019-12-05", "language": "en", "rating": 5}, {"id": 730852135, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d190629-r730852135-Casa_Mila_La_Pedrera-Barcelona_Catalonia.html", "text": "We took the audio tour and it really helped me to understand the reasoning and genius behind this architect. It can be rough for the disabled to deal with the uneven floors and fairly numerous stairs - but I did it and saw the accommodations made for someone in a wheelchair - so it can be done!", "publishedDate": "2019-12-05", "language": "en", "rating": 5}, {"id": 730818968, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d190629-r730818968-Casa_Mila_La_Pedrera-Barcelona_Catalonia.html", "text": "Casa Mila is indeed a unique building, very different from rest of the buildings in Barcelona or elsewhere. Gaudi conceived this design at the start of 20th century and even after more than 100 years, one doesn't come across many such buildings. It's just a 5 minutes walk from Casa Battlo, another masterpiece of Gaudi's architecture.", "publishedDate": "2019-12-05", "language": "en", "rating": 4}, {"id": 730549604, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d190629-r730549604-Casa_Mila_La_Pedrera-Barcelona_Catalonia.html", "text": "It is 5 min walk from Casa Battlo and you should see it. I didnt go inside but from outside you can also see the stormtrooper helmets on the roof. ", "publishedDate": "2019-12-03", "language": "en", "rating": 4}, {"id": 730545493, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d190629-r730545493-Casa_Mila_La_Pedrera-Barcelona_Catalonia.html", "text": "Guide was very good. The building is just wow and the light show took my breath away. Fantastic views especially with Christmas lights", "publishedDate": "2019-12-03", "language": "en", "rating": 5}, {"id": 730471588, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d190629-r730471588-Casa_Mila_La_Pedrera-Barcelona_Catalonia.html", "text": "Guell is always beautiful. However I'd you are short on time I would recommend casa batlo instead because this is one definitely doesn't feel as spectacular as some of his other buildings.", "publishedDate": "2019-12-03", "language": "en", "rating": 3}, {"id": 730456987, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d190629-r730456987-Casa_Mila_La_Pedrera-Barcelona_Catalonia.html", "text": "We were lucky enough to get in a night tour of the Casa Mila - La Pedrera! The rooftop light show was mesmerizing!! Do'nt miss this if you have the opportunity!!", "publishedDate": "2019-12-03", "language": "en", "rating": 5}, {"id": 730423581, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d190629-r730423581-Casa_Mila_La_Pedrera-Barcelona_Catalonia.html", "text": "Been there so many times and always impressed like it's  the first time. \nThis time I took the evening tour which  costs 38eur. Per person. \nIt started at 1900 and the duration was an hour & a half with a \"tour\" guide who was so pleasant & interesting. The way he put it- \"let's walk as the servants walked in this house\"\nWe went straight to the attic,  heard the building's history story & then we ended at the roof with a spectacular audiovisual show.", "publishedDate": "2019-12-03", "language": "en", "rating": 5}, {"id": 730344919, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d190629-r730344919-Casa_Mila_La_Pedrera-Barcelona_Catalonia.html", "text": "The highlight of the Casa Mila is definitely the roof. I highly recommend the audio guide to contextualize the interior, which is interesting but not so much as the roof.", "publishedDate": "2019-12-02", "language": "en", "rating": 5}, {"id": 730095856, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d190629-r730095856-Casa_Mila_La_Pedrera-Barcelona_Catalonia.html", "text": "Casa Mila is on Paseig de Gracia, not far from Casa Battlo. While Casa Battlo felt more 'alive' and artistic to me, Casa Mila had a better introduction into Gaudi's universe and method of building. The audioguide was however terribly uncomfortable  (on the neck and ears!) and poor quality as a device. The information presented is however very interesting and educational. The most basic experience (unless you know Catalan) costs 22 euro, provided you buy the ticket online, otherwise you'll end up paying 25 euro. Once again, it's very hard for me to understand why the rich price compared to other famous European museums. ", "publishedDate": "2019-12-01", "language": "en", "rating": 3}, {"id": 729979181, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d190629-r729979181-Casa_Mila_La_Pedrera-Barcelona_Catalonia.html", "text": "My wife booked an entry time and we had the audio guide which was perfect.\nAbsolutely wonderful place to visit, so many interesting things to see. Only problem is that it was crowded and too many people made it difficult to get around, especially the model apartments; even worse with people taking pictures meant that progress around the exhibits was often impeded.\nWould strongly recommend a visit if in Barcelona, probably the best of the Gaudi places, but then it was the first we visited and therefore we were still enthusiastic and not \"Gaudied out\".\nIf you don't do anything else Gaudi in Barcelona, visit here.", "publishedDate": "2019-12-01", "language": "en", "rating": 4}, {"id": 729961652, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d190629-r729961652-Casa_Mila_La_Pedrera-Barcelona_Catalonia.html", "text": "The audio tour is great because it automatically kicks in as you cross certain thresholds.  The rooftop is extraordinary, but for someone with a fear of heights, a little daunting as the outer wall is low.  Gauidi's work is always fascinating. It was neat to see a recreation of an actual apartment from the time.  They were huge, and I learned later there are still a few occupants in the building.", "publishedDate": "2019-12-01", "language": "en", "rating": 5}, {"id": 729907244, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d190629-r729907244-Casa_Mila_La_Pedrera-Barcelona_Catalonia.html", "text": "We didn't regret our visit here, but it definitely was nowhere near as interesting as Gaudi's other works - Sagrada Familia, Casa Batllo, Parc Guell... We would visit all of those again if back in Barcelona, but would probably not come back to Casa Mila. It still had Gaudi's unique style, but not as many interesting and colourful elements as the other attractions.", "publishedDate": "2019-11-30", "language": "en", "rating": 3}, {"id": 729357598, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d190629-r729357598-Casa_Mila_La_Pedrera-Barcelona_Catalonia.html", "text": "I highly recommend taking this tour at night. The guided tour is very informative and the architecture breathtaking. The tour ends with a light show on the roof, which was the icing on the cake, an experience I won’t soon forget.", "publishedDate": "2019-11-27", "language": "en", "rating": 5}, {"id": 729299919, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d190629-r729299919-Casa_Mila_La_Pedrera-Barcelona_Catalonia.html", "text": "Nice walk and perfect weather... Spent time enjoying the architecture, walking into different stores and a nice beer, tapas and coffee from time to time. ", "publishedDate": "2019-11-27", "language": "en", "rating": 4}, {"id": 729274882, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d190629-r729274882-Casa_Mila_La_Pedrera-Barcelona_Catalonia.html", "text": "It is something amazing. I don't want to explain how it was, just to say go there. It was like a journey through time. I recommend this place! :)", "publishedDate": "2019-11-27", "language": "en", "rating": 5}, {"id": 729248786, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d190629-r729248786-Casa_Mila_La_Pedrera-Barcelona_Catalonia.html", "text": "#1 spot.\nQ-Trip: My agenda suggestion is Milà first, Batlló second in \n             one morning with Billy Brunch after ... Billy is closer\n             to Milà BUT worth the walk. \nQ-Trip: Quite a site that needs closer to two hours \n             than one. Batlló can be done under an hour. \n             The Attic information displays are essential to \n             your understanding of Gaudi ... essential I repeat. ", "publishedDate": "2019-11-27", "language": "en", "rating": 5}, {"id": 729056429, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d190629-r729056429-Casa_Mila_La_Pedrera-Barcelona_Catalonia.html", "text": "Was well pleased with this tour. Price was good and organized from beginning to end. Highly recommend!", "publishedDate": "2019-11-26", "language": "en", "rating": 5}, {"id": 729056256, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d190629-r729056256-Casa_Mila_La_Pedrera-Barcelona_Catalonia.html", "text": "Prebooked tickets for Casa mila la padrera. We sailed straight in and avoided the queues brilliant!  Loved it so informative and interesting would definitely recommend", "publishedDate": "2019-11-26", "language": "en", "rating": 4}, {"id": 728885048, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d190629-r728885048-Casa_Mila_La_Pedrera-Barcelona_Catalonia.html", "text": "Casa Mila “La Pedrera” (meaning the stone quarry) is a house at Carrer de les Carolines 20-26 within the Eixample area fashioned by architect-artist Antoni Gaudi and built between 1906 and 1910.  The house has a wave-like facade easy to find at the intersection of the major street Passeig de Gracia and Carrer de Provenca.   The roof has extraordinary sculptures of the air ducts and chimneys that look quite threatening.\nTickets are required to enter—best bought ahead, but depending on tourist numbers, can be purchased on-site.  The rooftop vents and chimneys are famous sculpture-like edifices.", "publishedDate": "2019-11-25", "language": "en", "rating": 4}, {"id": 728847234, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d190629-r728847234-Casa_Mila_La_Pedrera-Barcelona_Catalonia.html", "text": "Did the night tour and light show at Casa Mila which is still an apartment building. It was pretty. We liked the other Gaudi buildings better than this one, though really all of his designs are so interesting and different.The light show on the roof was fun. It shows you all of the symbolism in Gaudi’s work on this building. one of the best things about this tour is that it’s not super crowded.", "publishedDate": "2019-11-25", "language": "en", "rating": 4}, {"id": 728780734, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d190629-r728780734-Casa_Mila_La_Pedrera-Barcelona_Catalonia.html", "text": "Gaudi did so many amazing things in Barcelona. We only visited the outside and the shop. No time to visit the inside. Would have loved to see how the design carried to the interior", "publishedDate": "2019-11-25", "language": "en", "rating": 4}, {"id": 728037385, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d190629-r728037385-Casa_Mila_La_Pedrera-Barcelona_Catalonia.html", "text": "Gaudi’s masterpiece is truly that.  Be sure to start on the roof and work down.  The uniqueness of the rooftop is only topped by the scenery.  There is a lot of walking and few places to sit.  Working your way down into the attic and other floors gives you the sense of how advanced Gaudi’s techniques were.  Be sure to use the audio guides so you can go at your own pace.  The building is well worth visiting and learning about the master Gaudí.", "publishedDate": "2019-11-21", "language": "en", "rating": 4}, {"id": 727987299, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d190629-r727987299-Casa_Mila_La_Pedrera-Barcelona_Catalonia.html", "text": "Took a tour with audio guide which was the perfect way to see the castle. Lovely architecture and fascinating story - yet another feather in anton gaudi’s Magical cap! The attic and roof top were stunning with wonderful views of the city as well -  mountains on one side, sea on the other and Sagrada Familia in the background! On weekdays in winters, even skip the queue is not necessary - you can walk in during high availability slots and easily get a ticket (check slots online on the official website). Would love to go there again for a night tour!", "publishedDate": "2019-11-21", "language": "en", "rating": 5}, {"id": 727976957, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d190629-r727976957-Casa_Mila_La_Pedrera-Barcelona_Catalonia.html", "text": "We had the self-guided audio tour, which was perfectly executed; we highly recommend that, since there are stories and details we would otherwise have missed. The audio device was synced with our location in the building, so the narration matched whatever we were looking at. The headset was the most comfortable we've experienced, an open-air design that sits away from the ear so we can also talk to each other. The narrator's wide-eyed enthusiasm was quirky but entertaining. The building itself is Gaudi at his flamboyant best: undulating stonework, twisted wrought iron, and much more. ", "publishedDate": "2019-11-21", "language": "en", "rating": 5}, {"id": 727886934, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d190629-r727886934-Casa_Mila_La_Pedrera-Barcelona_Catalonia.html", "text": "La Casa Mila is one of the must visited and due to popular visitors, pre purchase on line of your ticket is a must or you may not be able to enter and get a tours.\nHave good choose to climb and walk so much to see and the views from the rooftop are spectacular.", "publishedDate": "2019-11-20", "language": "en", "rating": 5}, {"id": 727813909, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d190629-r727813909-Casa_Mila_La_Pedrera-Barcelona_Catalonia.html", "text": "I purchased my tickets online and was allowed to enter on arrival. We were provided audio guides which were interesting and well executed. The first stop is the first of two courtyards. The next stop is the terrace which is up 8 flights of steps (there is an elevator option). The terrace provides a 360 view of the city and was well worth the climb up all those stairs. After the terrace there are exhibits in the attic and rooms set up with period furniture and other artifacts. The tour ends in the second of the two courtyards and the exit is through the gift store.\nThe architecture is amazing but this building doesn’t have the magic of Casa Batllo (IMO)", "publishedDate": "2019-11-20", "language": "en", "rating": 4}, {"id": 727811419, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d190629-r727811419-Casa_Mila_La_Pedrera-Barcelona_Catalonia.html", "text": "This building is fascinating to see and visually enjoy. Whether you are a fan of Gaudi or not, it is worth the experience of visiting and viewing his unique design and conceptual ideas. Even the street lights by this building are Gaudi designed. His works are seen in various locations throughout the  city and this was our favorite...even over the Basicilica.", "publishedDate": "2019-11-20", "language": "en", "rating": 4}, {"id": 727617339, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d190629-r727617339-Casa_Mila_La_Pedrera-Barcelona_Catalonia.html", "text": "So lovely, so interesting!! We really enjoyed our visit. Walking through the apartment took us to another time and sensibility. The finishing touches on the public spaces were photo worthy for sure. Also liked the model and explanation of how La Prefers was built.", "publishedDate": "2019-11-19", "language": "en", "rating": 5}, {"id": 727580531, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d190629-r727580531-Casa_Mila_La_Pedrera-Barcelona_Catalonia.html", "text": "This house is what started it all.  Gaudi designed and built this house and it was so different that people are still awed by it.  The tour starts with a elevator ride to the roof which is amazing.\nThe roof is a sculpture garden that runs around the center atrium of the building.  Every direction has a sculpure or turret and everything is unique.  You then descend to the attic and then into an apartment.  Every inch of this building is a visual delight.  Do not skip attraction this when in Barcelona!  Buy tickets in advance to avoid lines.", "publishedDate": "2019-11-19", "language": "en", "rating": 5}, {"id": 727420112, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d190629-r727420112-Casa_Mila_La_Pedrera-Barcelona_Catalonia.html", "text": "One thing is to read about Gaudi. Another is to be touched by his creations. Casa Mila is not a place. It's an EXPERIENCE! You must visit this place.", "publishedDate": "2019-11-18", "language": "en", "rating": 5}, {"id": 727417726, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d190629-r727417726-Casa_Mila_La_Pedrera-Barcelona_Catalonia.html", "text": "Casa Mila is located very close to the Passeig de Gracia and Diagonal metro stops. It’s a lovely example of Gaudi architecture and doesn’t take more than an hour (ish) to tour.", "publishedDate": "2019-11-18", "language": "en", "rating": 4}, {"id": 727365237, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d190629-r727365237-Casa_Mila_La_Pedrera-Barcelona_Catalonia.html", "text": "Barcelona is full of these strange-looking, but beautiful houses. I didn't enter as I didn't want to spend money on this attraction, but I still enjoyed it from the outside.", "publishedDate": "2019-11-18", "language": "en", "rating": 4}, {"id": 727362853, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d190629-r727362853-Casa_Mila_La_Pedrera-Barcelona_Catalonia.html", "text": "As noted in another review by 3citykids on TA, \"...the fencing is ugly (chain link) but some sort of protection from accidental falls is absolutely necessary. Without it, there'd be only a few inches of lip between you and a tumble into the interior courtyards.\"\n\nWell, happened to me. Not quite a tumble into the interior courtyards, but after someone else beside me tripped and someone else tried to help, I was pulled into the jostle, and was knocked headlong unto the steps below.\n\nIt wasn't just bad luck. The uneven design of the steps, the lack of sufficient lighting, the lack of handholds, the lack of assistance to first-time visitors, the lack of signage or warning/caution markers, etc., I am certain all contributed to the fall. There were also a lot of people and we were not sufficiently warned about the hazard of negotiating the uneven steps. I firmly believe that had the hazards been managed better, I might have better recovered my balance and not have fallen in the first place. But, alas...did.\n\nI managed to take the brunt of the fall on my arms but still hit my face on the steps. My chin split and I ended up needing 3 stitches. It's already been a week and my face is still slightly puffy and have not recovered full mobility in in my left arm. In the beginning, even the simple tasks of eating, drinking, and brushing teeth was difficult. What a way to ruin a holiday, right?\n\nOn one hand...the staff of La Pedrera were quick to respond and the tour guide did initially attend to me. However, after I was administered first aid, I was put in a cab with a scribbled address to a hospital and was pretty much left to fend for myself. And yes...I even had to pay for the taxi fare. I do resent that I was not accompanied or met at the hospital. For the most part, no one in the hospital could speak English and could not explain my condition to me clearly, which added to my distress. \n\nI have since written La Pedrera at the supplied email address but so far, no response.\n\nWell...at least they refunded my ticket. \n\nI would still recommend the visit to La Pedrera-Casa Mila and if I get a chance to go back to Barcelona, may visit again. But, probably not come in the daytime and take the advice of other reviewers to skip the Night Experience altogether.", "publishedDate": "2019-11-18", "language": "en", "rating": 1}, {"id": 727317652, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d190629-r727317652-Casa_Mila_La_Pedrera-Barcelona_Catalonia.html", "text": "Casa Mila is amazing and i truly recommend this to see!\nFrom the great architect Guadi and the old style apartment and furniture,this is a  great place to start your Barcelona tours.\n", "publishedDate": "2019-11-18", "language": "en", "rating": 5}, {"id": 727208203, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d190629-r727208203-Casa_Mila_La_Pedrera-Barcelona_Catalonia.html", "text": "This is an experience worthwhile to make time for in your tour through Barcelona. It certainly confirms Gaudi's brilliance!", "publishedDate": "2019-11-17", "language": "en", "rating": 5}, {"id": 727130618, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d190629-r727130618-Casa_Mila_La_Pedrera-Barcelona_Catalonia.html", "text": "Every intersection in Barcelona is a plaza, with entrances cut at 45 degrees. And every building is filled with balconies, which we were told is a Spanish innovation. This Gaudi building is an absolute delight. ", "publishedDate": "2019-11-17", "language": "en", "rating": 4}, {"id": 726810789, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d190629-r726810789-Casa_Mila_La_Pedrera-Barcelona_Catalonia.html", "text": "La Pedrera is one of many building Gaüdi designed and built in Barcelona.  Just like many of his designs, this one is strange by “normal” architectural standards.  Although the outside and roof are very unconventional the inside and the apartment you get to tour, seem very normal and very functional.  The attic is particularly interesting as you really get to see Gaüdi’s genius in how the supporting infrastructure actually works.  I found the outside roof “whimsical” in the way the chimneys were designed.  As our guide informed us - “Urban legend” has it that the chimneys were the inspiration for the “Storm Troopers” helmets in Star Wars.  There are even photographs comparing the two and letting the viewer reach their own conclusion.  A guided tour, with an informative guide, and using the recording audio boxes is the best way to tour this building.  All the other apartments in the building are actually occupied with tenants.\n", "publishedDate": "2019-11-16", "language": "en", "rating": 5}, {"id": 726468971, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d190629-r726468971-Casa_Mila_La_Pedrera-Barcelona_Catalonia.html", "text": "This building is awesome piece of architecture anywhere.  The rooftop smokestacks are eerily real and seem to come to life.  Couldn’t stop taking pictures and just loved the views from the top.  Don’t miss this and spend the money to go inside", "publishedDate": "2019-11-14", "language": "en", "rating": 5}, {"id": 726446932, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d190629-r726446932-Casa_Mila_La_Pedrera-Barcelona_Catalonia.html", "text": "The shapes of the building are so unexpected and beautiful that you should saw it. Outside and inside shape and structures are considered. It helps to imagine how many work/time Gaudi put in this design/project.", "publishedDate": "2019-11-14", "language": "en", "rating": 5}, {"id": 726446611, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d190629-r726446611-Casa_Mila_La_Pedrera-Barcelona_Catalonia.html", "text": "I cannot recommend a tour more highly, nor a venue more elegant and sophisticated.  I also HIGHLY RECOMMEND the 8AM \"before we open\" tour.  Everything about the building is phenomenal: the tour and thr guide (top rate), the rooftop and attic museum, the furnished apartment, the gift shop, and the nice (included) cafe in the cafe.  Go here before you go to Batlo (if you do at all) and do the morning tour at 8AM. Fabulous!", "publishedDate": "2019-11-14", "language": "en", "rating": 5}]}}]