[{"locationId": 3360600, "name": "Gaudi Experience", "placeType": "ATTRACTION", "reviewListPage": {"reviews": [{"id": 736787613, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d3360600-r736787613-Gaudi_Experience-Barcelona_Catalonia.html", "text": "Fascinating!\nThe film show gave a good insight into Gaudi's sources of inspiration, methods and background which made great preparation for the museum exhibits.  Very enjoyable but the earphone system didn't work properly and I couldn't adjust the volume to hear clearly enough, for my taste.  Other than the one issue, well worth doing!", "publishedDate": "2020-01-04", "language": "en", "rating": 4}, {"id": 725253594, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d3360600-r725253594-Gaudi_Experience-Barcelona_Catalonia.html", "text": "Stopped by this place the staff was kind and attentive and it was a great visual experience. I strongly recommend it if you are in the area.", "publishedDate": "2019-11-09", "language": "en", "rating": 5}, {"id": 716382576, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d3360600-r716382576-Gaudi_Experience-Barcelona_Catalonia.html", "text": "We walked past this 'theater' on our way to the Guell Park. We decided to do the 4D 'movie' about Gaudi. It was an experience we will not forget. It was interesting, fun and educational..", "publishedDate": "2019-10-08", "language": "en", "rating": 5}, {"id": 715036812, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d3360600-r715036812-Gaudi_Experience-Barcelona_Catalonia.html", "text": "The show was very impressive; lots of special effects when wearing the 4d glasses. You have your own chair and seatbelt as the chair moves around. However, the show only lasted 20 minutes which I thought was way too short.\n\nAll in all, this place is worth a visit, they just need to make the show a little longer,", "publishedDate": "2019-10-03", "language": "en", "rating": 4}, {"id": 706724576, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d3360600-r706724576-Gaudi_Experience-Barcelona_Catalonia.html", "text": "The 4D audiovisual is fascinating. My kids enjoyed to learn what inspired Gaudi's work. I would like to mention the great help we got from the employee Amadou who was very friendly", "publishedDate": "2019-09-05", "language": "en", "rating": 4}, {"id": 701587145, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d3360600-r701587145-Gaudi_Experience-Barcelona_Catalonia.html", "text": "a 10-minute experience but a film that shows very clearly where his gaudi ideas came from in his projects. one of the most interesting experiences in Barcelona. you have to see this . i recommend", "publishedDate": "2019-08-21", "language": "en", "rating": 5}, {"id": 694295739, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d3360600-r694295739-Gaudi_Experience-Barcelona_Catalonia.html", "text": "It’s basically a small 4D cinema next to Park Guell. Not bad but certainly not the best 4D I have been. Film is quite short. You will feel it’s like ‘what? That’s it?!’\nStore is interesting though.\nYou can line up the same trip to Park Guell. ", "publishedDate": "2019-07-31", "language": "en", "rating": 4}, {"id": 692460113, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d3360600-r692460113-Gaudi_Experience-Barcelona_Catalonia.html", "text": "I was expecting the detail behind each project but instead I believe I had a trip into Gaudis mind and the things that possibly influenced him, which I found very  thought provoking. It helped me appreciate his works that I then saw and made me ponder what could have influenced his creativity..I sure hope I see him in heaven he was a genius !!!", "publishedDate": "2019-07-24", "language": "en", "rating": 4}, {"id": 689449808, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d3360600-r689449808-Gaudi_Experience-Barcelona_Catalonia.html", "text": "Firstly, this place is very unique in what it offers in terms of offering a fun experience in learning about the city.\nHowever, what tops this was Marta ! She walked us through what the place offers and is very well spoken in English ! Excellent customer service, she also helped me and my friend pick out some gifts to take back to the family.\n\nMerci Marta !", "publishedDate": "2019-07-14", "language": "en", "rating": 5}, {"id": 674576340, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d3360600-r674576340-Gaudi_Experience-Barcelona_Catalonia.html", "text": "We went here expecting the movie to show all guadi’s works since we didn’t have time to see all of them. The movie itself was expensive and didn’t have that information at all, but could be fun for kids I suppose. What was worth it (and free) was the informational interactive screens in the main area that gave you background on each of his buildings and had pictures of the interiors and exteriors. I wish we had skipped the ticket and just looked at these. ", "publishedDate": "2019-05-17", "language": "en", "rating": 2}, {"id": 672386318, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d3360600-r672386318-Gaudi_Experience-Barcelona_Catalonia.html", "text": "We enjoy the experiance, the cost was worth it, amazing art and architecture, the line was not that long, we booked a time a day before online ", "publishedDate": "2019-05-07", "language": "en", "rating": 5}, {"id": 665289918, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d3360600-r665289918-Gaudi_Experience-Barcelona_Catalonia.html", "text": "Arrived at Gaudí Experience at 17.40pm to be told it was closed, after checking several times on there website stating closing time 18.30. Such a shame after visiting the Sagrada Familia and the park it was to be on the icing on the cake for my 12yrs and 14yrs old boys. Very sad and disappointed. Most unhelpful staff.", "publishedDate": "2019-04-10", "language": "en", "rating": 1}, {"id": 655070287, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d3360600-r655070287-Gaudi_Experience-Barcelona_Catalonia.html", "text": "The short movie is fun and great. People think it is a documentary, but it’s actually a review of the most known works of Gaudi’s works. It is fun and unexpected. Great for kids and groups. The panels outside have a lot of information of all the work of this amazing architect and the staff there are very helpful. Big thanks to Amadou and Ignasi who helped us find our way through the city!! Don’t miss it!", "publishedDate": "2019-02-26", "language": "en", "rating": 5}, {"id": 642180026, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d3360600-r642180026-Gaudi_Experience-Barcelona_Catalonia.html", "text": "We came to see this \"4D\" experience as part of out visit to the nearby Park. The film provides very little information about Gaudi, and also isn't greatly entertaining. The special effects are also quite poor. If you have ever been to a 4D film, you will know what to expect (some chair moving, the odd puff of air).\n\nThe shop area is a little better, but I wouldn't bother with the film ", "publishedDate": "2018-12-29", "language": "en", "rating": 2}, {"id": 621565856, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d3360600-r621565856-Gaudi_Experience-Barcelona_Catalonia.html", "text": "This was a fun. I bought a ticket for the 4D movie and that was great to see. This place is close to Park Guell", "publishedDate": "2018-10-02", "language": "en", "rating": 4}, {"id": 618380108, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d3360600-r618380108-Gaudi_Experience-Barcelona_Catalonia.html", "text": "Good introduction to the Gaudí works you will see as you tour the city.  Good video presentation and museum.  Recommend seeing this early in your visit. Part of Barcelona Pass.", "publishedDate": "2018-09-21", "language": "en", "rating": 4}, {"id": 617559032, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d3360600-r617559032-Gaudi_Experience-Barcelona_Catalonia.html", "text": "We visited the Gaudi Experience the same day as we visited Park Güell. It’s on walking distance and gives you in 10 minutes a beautiful overview of Gaudi’s most stunning projects. The whole cinema where you watch the 4D movie, is decorated in the style of Gaudi’s architecture. \n\nThe entry is just a few euros (Barcelona Bus Turistic offers a coupon in their booklet) and definitely worth it. ", "publishedDate": "2018-09-18", "language": "en", "rating": 5}, {"id": 603047514, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d3360600-r603047514-Gaudi_Experience-Barcelona_Catalonia.html", "text": "The 4 d show us great ! 9 euros is a bit much but we really enjoyed it x also a great break from the sun x ", "publishedDate": "2018-08-05", "language": "en", "rating": 5}, {"id": 600555357, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d3360600-r600555357-Gaudi_Experience-Barcelona_Catalonia.html", "text": "If you’re in Barcelona and enjoying the many Gaudí architectures, this is an absolute must. The overall experience is great, goes through Gaudi’s life and inspirations. Well planned and thought through. Some may say it’s expensive. I think it’s worth every cent", "publishedDate": "2018-07-28", "language": "en", "rating": 5}, {"id": 583065643, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d3360600-r583065643-Gaudi_Experience-Barcelona_Catalonia.html", "text": "Those who propose to visit Barcelona for the Gaudi creation, it would be the best to visit 4D Gaudi Experience first. This would give an idea of thoughts behind Gaudi's creation. Then one can start visiting Casa Batlo, Casa Mila and the Sagrada Familia. The centre also has a good shop to purchase items like 1000 pieces Gaudi creation puzzle which is a fantastic gift for anyone.", "publishedDate": "2018-05-27", "language": "en", "rating": 5}, {"id": 579113184, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d3360600-r579113184-Gaudi_Experience-Barcelona_Catalonia.html", "text": "The show isn’t 30 minutes, it’s 12 minutes long. I had to check because I thought something had foment wrong with the film because it ended so quickly. The actual film is pretty s***-bad effects and not particularly informative or entertaining. And as someone who is generally excited with any touristy activities, I was disappointed.\nIn short; it’s overpriced and not as advertised. Don’t be a mug like me and waste your money and time (all 12 minutes of it).\nPark Güell is beautiful though :)", "publishedDate": "2018-05-09", "language": "en", "rating": 2}, {"id": 573328634, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d3360600-r573328634-Gaudi_Experience-Barcelona_Catalonia.html", "text": "If you’re an Art lover, and love exploring new things this is a must in Barcelona. The Gaudi Park is beautiful, lots of walking involved, but can be done in 3 hours. ", "publishedDate": "2018-04-14", "language": "en", "rating": 5}, {"id": 566700145, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d3360600-r566700145-Gaudi_Experience-Barcelona_Catalonia.html", "text": "This was really a really good 4D Experience come ride, however it's well out of the way to get there and far too expensive at 9E for less than 10 mins!", "publishedDate": "2018-03-15", "language": "en", "rating": 3}, {"id": 565137329, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d3360600-r565137329-Gaudi_Experience-Barcelona_Catalonia.html", "text": "We decided to go and give this a try we had to wait around 20 mins for the showing .\n\nBut in this time they have a good interactive information piece that allows you to look at the details around Gaudi and his works which was very good.\n\nThe actual showing was very odd the fact that we felt like we’d been taken into a kids play show and the chairs moving and then the dragon was just a bit of a let down. We thought it would have been a more facts based showing with information rather than what felt like a play ride for a kid.\n\n", "publishedDate": "2018-03-07", "language": "en", "rating": 2}, {"id": 561002564, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d3360600-r561002564-Gaudi_Experience-Barcelona_Catalonia.html", "text": "This place is the worst experience I have ever had in a foreign country.  The people working at the desk took advantage of a tourist that did not speak English.  We had pre paid for a tour with Barcelona City Tours of Park Güell.  We were unsure of the meeting place but we were told it was a gift shop.  We were asking in different places that looked like gift shops and showing them our tickets.  We informed them that we were looking for a tour of park güell (in Spanish, I am not fluent but I know basics).  This man led us to believe that his stupid 4D movie was part of the tour when in reality it was not connected at all and it caused us to completely miss our tour and not get to see park guell at all which was one of the main things we wanted to see.  Never use Barcelona City Tours.  They will be getting their own separate terrible review.  They failed to properly explain how to find the tour meeting point and we totally missed the entire thing because of it.  This Gaudí experience saw a confused young tourist that did not speak the language and took it as an opportunity to scam a lost tourist into buying a ticket for their stupid 10 minute movie and completely missing the tour I paid for because it left during the movie.  If he wanted money he should’ve just asked, now I lost out on the experience I traveled all the way to Barcelona for.", "publishedDate": "2018-02-17", "language": "en", "rating": 1}, {"id": 547566778, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d3360600-r547566778-Gaudi_Experience-Barcelona_Catalonia.html", "text": "You can easily look at the works of Gaudi by visiting La Sagrad Familiale, La Pedrera, Parc Guell etc.  But to understand Antoni Gaudi come to the Gaudi Experience.  Set in a lovely old church building in the heart of the gorgeous Gothic quarter this exhibition will inform you about Gaudi's life and his work.  Exhibits include works of art from hundreds of years before Gaudi and explain how these influenced him, and how sometimes he deconstructed them and then used them in that way.  You walk around with a mobile phone and a headset which explains in your own language what you are looking at.  It is quite sophisticated and you can move around at your own pace and skips things which are not so interesting to you.  Add the Gaudi Experience to your Gaudi sites and you will get more from them", "publishedDate": "2017-12-16", "language": "en", "rating": 5}, {"id": 546024977, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d3360600-r546024977-Gaudi_Experience-Barcelona_Catalonia.html", "text": "Visited here after visiting Parc Guell and really wished I hadn't bothered. Ok 4D is good but I don't think many people will leave here going Wow!!!", "publishedDate": "2017-12-08", "language": "en", "rating": 2}, {"id": 538931600, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d3360600-r538931600-Gaudi_Experience-Barcelona_Catalonia.html", "text": "If you are on your way to Park Gruell then this is well worth a visit, it is not worth going to as a \"stand alone\" attraction. Having said that, the 4D 10 minute film was incredible. I love 4D cinema and this was not only entertaining but also informative on what inspired Gaudi.\nLoved it!", "publishedDate": "2017-11-06", "language": "en", "rating": 5}, {"id": 535743376, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d3360600-r535743376-Gaudi_Experience-Barcelona_Catalonia.html", "text": "Because it was a rainy day we decided to go to this museum. The free audio tour is available in a couple of languages. Interesting, but would love to find more information anout Gaudi.\nWe parked the car in a nearby parking garage with very reasonable prices.\n", "publishedDate": "2017-10-24", "language": "en", "rating": 4}, {"id": 530825634, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d3360600-r530825634-Gaudi_Experience-Barcelona_Catalonia.html", "text": "Sorry but I have to disagree with some reviews below.   You can get a good introduction to the genius of Gaudí without spending spending €12 ($14.08) per person to see short films and small model reproductions of some of his work.    Quite disappointing and an apparent attempt to capitalize on this great man's name.\n\nBarcelona is home to most of his best work...   Go to see these instead of wasting your time and money on this place", "publishedDate": "2017-10-07", "language": "en", "rating": 1}, {"id": 525491578, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d3360600-r525491578-Gaudi_Experience-Barcelona_Catalonia.html", "text": "We walked for 55 minutes  thinking we were going to see something amazing.  When we got there o my a small over priced gift shop and a 4-D movie, so not worth the walk.", "publishedDate": "2017-09-18", "language": "en", "rating": 2}, {"id": 523998444, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d3360600-r523998444-Gaudi_Experience-Barcelona_Catalonia.html", "text": "Disney comes to gaudi !\nThis is 9 euros well spent ! We went up the very long very steep hill to the gaudi park guell ( me on crutches!) only to find at the top lots of steps and very steep hills which couldn't be navigated. We found this 4d experience on the way up so thought we would pay a visit.\nIt is great fun ! Well worth it !\n", "publishedDate": "2017-09-13", "language": "en", "rating": 5}, {"id": 523973806, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d3360600-r523973806-Gaudi_Experience-Barcelona_Catalonia.html", "text": "it is very good idea to book for the 4D show, nice , cool , fun , not so long so you will not get bored, you will get ideas about Gaudi , Kids, love it , if you have time and want something different for the kids before or after  long walk at Park Guel , then it is a very good idea.", "publishedDate": "2017-09-13", "language": "en", "rating": 4}, {"id": 518583078, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d3360600-r518583078-Gaudi_Experience-Barcelona_Catalonia.html", "text": "This 4D experience helps you understand a lot about Gaudi,his work & what influenced him. it's a real fun. ", "publishedDate": "2017-08-28", "language": "en", "rating": 5}, {"id": 515896501, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d3360600-r515896501-Gaudi_Experience-Barcelona_Catalonia.html", "text": "The 4d show was great. When we saw the price (9€) we thought that we hadn't heared a number.The show was absolutely perfect but... Only 10 minutes! Almost 1€ per minute.", "publishedDate": "2017-08-21", "language": "en", "rating": 4}, {"id": 512124174, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d3360600-r512124174-Gaudi_Experience-Barcelona_Catalonia.html", "text": "Stumbled across this having visited Park Guell and it was a little haven of air conditioning and wifi. Some info about Gaudi's works in the entrance / shop and a 4D cinema / thrill that really appealed to children and lasted about 10-15 minutes. Don't expect to learn lots from the film, but it is great fun and gives a flavour of Gaudi's works (hybrid with dragons) It is very accessible for those who are less inclined to be culture vultures.", "publishedDate": "2017-08-13", "language": "en", "rating": 4}, {"id": 508664847, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d3360600-r508664847-Gaudi_Experience-Barcelona_Catalonia.html", "text": "This experience really shows you how imaginative Gaudi was.It visually explained how much detail Gaudi put in his art. In the film it sprung his art to life creating this amazing masterpiece of a film. (If you looked carefully) also in this film you could see Gaudi actually sitting on a dragon. This represents that Gaudi was truly brave and also that all Catalans followed St . Andrew. If you are a GREAT fan of history I would recommend watching this.", "publishedDate": "2017-08-04", "language": "en", "rating": 5}, {"id": 504715712, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d3360600-r504715712-Gaudi_Experience-Barcelona_Catalonia.html", "text": "This is basically a short film with sound, lights and moving seats to provide an enhanced multimedia experience. It didn't really appeal to me all that much, being more of a kid's thing. Probably a must do if you have bored children/teenagers who have just been dragged through Gaudi's various works...... For adults only, possibly a waste of time, although it does provide an opportunity to get out of the summer heat (if applicable).\n\nOn the other side of the coin, I have given this attraction a reasonably high rating. Firstly, because of the undoubted technical mastery involved in the production of the presentation, but mainly because it justifiably, in my mind, gives an appreciation of the role that sheer imaginative genius and fantasy must have played in Gaudi's mind in coming up with the architectural and design marvels that he did.", "publishedDate": "2017-07-23", "language": "en", "rating": 4}, {"id": 496666061, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d3360600-r496666061-Gaudi_Experience-Barcelona_Catalonia.html", "text": "4D cinema about Gaudi work and design is so interesting and you can understand of his character and story, also you would be familiar with history of best places you should visit in Barcelona at glance.", "publishedDate": "2017-06-27", "language": "en", "rating": 5}, {"id": 494658124, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d3360600-r494658124-Gaudi_Experience-Barcelona_Catalonia.html", "text": "If you're looking for a fantastic tour  of Gaudis masterpieces then this is for you. Our guide Patrick(aka Richard haha)was very insightful and made the tour thoroughly  enjoyable.", "publishedDate": "2017-06-20", "language": "en", "rating": 5}, {"id": 482376635, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d3360600-r482376635-Gaudi_Experience-Barcelona_Catalonia.html", "text": "This exhibition helps you to understand what made Antoni Gaudi so special. Outstanding display and very friendly, helpful staff. A must see.", "publishedDate": "2017-05-07", "language": "en", "rating": 5}, {"id": 478055353, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d3360600-r478055353-Gaudi_Experience-Barcelona_Catalonia.html", "text": "We were disappointed not to get in to Park Guell (tickets were sold out when we arrived) so this was a fun thing to do. Used discount tickets we got on the tourist bus so it made it good value ", "publishedDate": "2017-04-22", "language": "en", "rating": 5}, {"id": 475196387, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d3360600-r475196387-Gaudi_Experience-Barcelona_Catalonia.html", "text": "A 10 minute \"immersive\" 4D experience - ok for the very young but over too quickly  - should have incorporated more things to do beforehand.", "publishedDate": "2017-04-13", "language": "en", "rating": 3}, {"id": 474714917, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d3360600-r474714917-Gaudi_Experience-Barcelona_Catalonia.html", "text": "Whole family loved this - Great experience - not cheap - but much better value with Barcelona Pass\nShow great, but not much else.", "publishedDate": "2017-04-11", "language": "en", "rating": 5}, {"id": 473214658, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d3360600-r473214658-Gaudi_Experience-Barcelona_Catalonia.html", "text": "As we were traveling with a 10 yr old boy, this attraction was a must have for us. It's like an amusement park ride that takes you through the inspiration of Gaudi as he created the unique buildings that can be seen through the city. The ride is not cheap and our family of 4 cost about $50 CAN to ride. It was the highlight of my sons trip however, and was enjoyed by all of us too. \nIt is located near the Park Guell and is accessible by the tourist buses. ", "publishedDate": "2017-04-06", "language": "en", "rating": 5}, {"id": 472829350, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d3360600-r472829350-Gaudi_Experience-Barcelona_Catalonia.html", "text": "First 4d experience was good to see after visiting lots of Gaudi sites. The 4d experience was good but very short, around 10 minutes. Get a cab if you have mobility problems as hills around a very steep.", "publishedDate": "2017-04-05", "language": "en", "rating": 4}, {"id": 470882521, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d3360600-r470882521-Gaudi_Experience-Barcelona_Catalonia.html", "text": "This is a 10 minute 4-D movie that is about one block from Park Guell. It's a cool way to preview his work which we enjoyed but not a must-see on your trip.", "publishedDate": "2017-03-28", "language": "en", "rating": 3}, {"id": 463178290, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d3360600-r463178290-Gaudi_Experience-Barcelona_Catalonia.html", "text": "This place has nice interactive screens which give you the history of Gaudi and his various buildings and achievements. We saw the 4D film which gives a bit of background although the extra dimension (moving chair) is rather silly. It was nice how that film had been made and the animation was quite good.", "publishedDate": "2017-02-27", "language": "en", "rating": 4}, {"id": 452757642, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d3360600-r452757642-Gaudi_Experience-Barcelona_Catalonia.html", "text": "It was the best 4D experience I have ever had. It takes you on a journey through Barcelona and shows you Gaudi's inspirations to build his amazing masterpieces.", "publishedDate": "2017-01-17", "language": "en", "rating": 5}, {"id": 449387664, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d3360600-r449387664-Gaudi_Experience-Barcelona_Catalonia.html", "text": "I thought it would be more of an experience but it was a bit disappointing. The website definitely sold this experience to be much more. The actual ride itself was super interesting and the effects were great. But the rest of the area was really an over glorified gift shop. If you need an area to get away from the heat of Park Guell for a hot moment, I’d recommend check it out. Reminded me a lot of “Captain Eo” from Disneyland but with more effects.", "publishedDate": "2017-01-04", "language": "en", "rating": 3}, {"id": 441426535, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d3360600-r441426535-Gaudi_Experience-Barcelona_Catalonia.html", "text": "Short 4d animated movie, moving chairs and a little exhibition on entrance. For me and family - great experience, awesome 3D views of Barcelona and Gaudi art from very beginning through the time. 9 € for ticket doesn't seem too expensive.", "publishedDate": "2016-12-01", "language": "en", "rating": 5}, {"id": 432017818, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d3360600-r432017818-Gaudi_Experience-Barcelona_Catalonia.html", "text": "We wanted to live the 4 D experience to get to know Gaudí better (as they promote it) but no, we did not really get to know him better. The effects (air blown in your face, chairs moving and even some water sprayed in your face) made us feel like we were more trying a ride than learning something. There were too many \"bells and whistles\" to distract us and not enough pertinent information.", "publishedDate": "2016-10-26", "language": "en", "rating": 2}, {"id": 430962865, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d3360600-r430962865-Gaudi_Experience-Barcelona_Catalonia.html", "text": "We were a bit confused as to what the 4d experience would entail content wise. The technology itself was fantastic and very impressive. It did feel like you were in the film experiencing it. However you didn't learn anything about Gaudi or his work, it was more interpretation. You'd expect it to be longer for the price aswell.", "publishedDate": "2016-10-23", "language": "en", "rating": 3}, {"id": 426730358, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d3360600-r426730358-Gaudi_Experience-Barcelona_Catalonia.html", "text": "I booked two tickets for the Gaudi Experience online in advance of my trip, after thoroughly looking through the website. On the official site it comes across as though the tickets are for access to the exhibits and ride. Being pregnant I knew that I wouldn't be able to go on the 4D ride as the website advised against this, but thought I was paying for a ticket to a museum. In fact the website is quite misleading and the ticket is for the 4D ride only. The models and interactive screens are part of the gift shop and are free to access. My ticket was non-refundable which I can understand, so my husband went on the ride by himself, which was over-priced anyway as it only lasted ten minutes. It's worth popping in to look at the models and screens, the gift shop offers a great range of souvenirs and books and the staff are friendly and helpful. Just be aware of buying tickets in advance that it is for the ride only. ", "publishedDate": "2016-10-10", "language": "en", "rating": 2}, {"id": 426195833, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d3360600-r426195833-Gaudi_Experience-Barcelona_Catalonia.html", "text": "We had an hour to kill while we waited for our slot at Parc Guell. It's unassuming from the outside, but inside the Gaudi Experience is pretty slick with interactive screens, a few models and a few photo opportunities.\n\nThe 9€ is basically for the 4D show, which lasts around 10 minutes and is shown every 15 minutes. It is on the pricey side even though it is very well done. I kind of expected to exit the show into a small exhibition, but it went straight back out into the shop/entrance area.\n\nI wouldn't recommend the 4D show until you have visited Casa Batllo and Sagrada Familia - a lot of it was interesting from the point of view of showing Gaudi's influences although a lot was a bit too stylised to be educational.\n\nAlso, if you've not experienced the moment of wonder as you walk through the doors into Sagrada Familia, then I would say to leave Gaudi Experience until afterwards because it's almost like a spoiler because the inside of Sagrada is so unexpected. \n\nOverall it's a really good attraction, and although 3/5 seems harsh, it's mainly because nothing compares to the real thing, and it is a bit on the expensive side when it is essentially 'just' the 4D show.", "publishedDate": "2016-10-08", "language": "en", "rating": 3}, {"id": 425060259, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d3360600-r425060259-Gaudi_Experience-Barcelona_Catalonia.html", "text": "The outside gallery is interesting but the movie is not worth your time it shows nothing just a few images of a man acting as Gaudí working 3 of his works that I would recommend you see them in real life instead and a badly animated dragon fight out of nowhere. at the end of it all I was glad I hadn't had lunch yet since I'm sure I would have lost it from the dizziness.", "publishedDate": "2016-10-04", "language": "en", "rating": 1}, {"id": 424296844, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d3360600-r424296844-Gaudi_Experience-Barcelona_Catalonia.html", "text": "Glad we walked by this little place and went on the ride! Educational and could really \"feel\" it! Loved it!", "publishedDate": "2016-10-02", "language": "en", "rating": 4}, {"id": 422874732, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d3360600-r422874732-Gaudi_Experience-Barcelona_Catalonia.html", "text": "We passed the Gaudi Experience on our way up the hill to Park Guell, and were convinced to come inside to have a look by one of the young staff members. We browsed through the digital photos on the interactive screens until it was time to enter the 3D area. While short, the presentation gave a great deal of insight into the everyday life and inspirations of Gaudi and the flight aspect brought the geographical distances of his projects together. Overall a better experience than expected; highly recommended.", "publishedDate": "2016-09-27", "language": "en", "rating": 4}, {"id": 419907079, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d3360600-r419907079-Gaudi_Experience-Barcelona_Catalonia.html", "text": "This is a  small exhibition near to Park Guell, showing the work of Gaudi. Entrance is free, but there is a 4D experience - which is chargeable- and definitely worth it. Would recommend to adults and children alike.", "publishedDate": "2016-09-18", "language": "en", "rating": 5}, {"id": 416499478, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d3360600-r416499478-Gaudi_Experience-Barcelona_Catalonia.html", "text": "Gaudi Experience was fifth stop in Barcelona on a Mediterranean cruise. Found the people of Spain to be more welcoming than my homeland italy. Attractions were clean, people were friendly & spoke English. Tour guides knew the area snd made it enjoyable for you.😀", "publishedDate": "2016-09-09", "language": "en", "rating": 5}, {"id": 413348984, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d3360600-r413348984-Gaudi_Experience-Barcelona_Catalonia.html", "text": "I absolutely recommend doing this! Such a different and fun touristic attraction. I think it's particularly cool once you've seen the Sagrada Familia, Casa Batlló, Casa Milà (Pedrera) and Parc Güell because you understand the imagery in the 4D movie much better. Even if you haven't seen them yet it's worth it though - you'll get to see what Barcelona looked like a century ago.", "publishedDate": "2016-08-31", "language": "en", "rating": 5}, {"id": 401800583, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d3360600-r401800583-Gaudi_Experience-Barcelona_Catalonia.html", "text": "A small exhibition close to Park Guell with interactive screens showing the work of Gaudi, his work etc.  this is all free but dont miss the 4D experience - especially if you have children.  The \"ride\" was around 10 minutes and I wish I could have done it again and I know i will have noticed more on a second go.  Highly recommended - we went out around the city looking at the buildings in a completely different light!  All 4 children aged from 8-15 plus both adults got something from this", "publishedDate": "2016-08-05", "language": "en", "rating": 4}, {"id": 395164975, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d3360600-r395164975-Gaudi_Experience-Barcelona_Catalonia.html", "text": "My wife and I had just finished exploring Park Güell and were wandering around the nearby shops when we came across The Gaudi Experience. We were intrigued by the \"4D movie\", and the giant screens and figured since we were already out here we might as well pop in. \n\nThe \"experience\" features giant touch screens that feature all sorts of information about Gaudi and his work. There's also a colouring station which my wife was very excited by. Unfortunately the pencil crayons weren't exactly the sharpest which made colouring tricky, but now we're just nit-picking aren't we. There’s also a gift shop with lots of books and trinkets dedicated to Gaudi and Barcelona. The prices aren’t outrageous, but I’m sure plenty of the same things could be found elsewhere in the city for slightly better prices.\n\nWe also did the 4D experience, which is essentially a 3D movie \"about\" Gaudi's work (there's no dialogue so it's really just a bunch of crazy visuals), and those seats that move around to correspond with what's going on on screen. It also features a few added 4D effects such as water spritz and air cannons. Pretty much the very definition of a tourist trap, but fun none the less (though perhaps not exactly worth the money).\n\nI wouldn't say \"The Gaudi Experience\" is worth heading to on it's own merits, but if you're in the area it's certainly worth popping in.", "publishedDate": "2016-07-21", "language": "en", "rating": 3}, {"id": 395068905, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d3360600-r395068905-Gaudi_Experience-Barcelona_Catalonia.html", "text": "Gaudi is a big part of Barcelona's history and culture.  This museum helps in part to better understand Gaudi's life and inspirations for his amazing designs.  Not a great museum for young children. ", "publishedDate": "2016-07-21", "language": "en", "rating": 4}, {"id": 390014901, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d3360600-r390014901-Gaudi_Experience-Barcelona_Catalonia.html", "text": "Short movie, but what a ride. Great way to discover Gaudi’s fascinating life and work. A must see if you have the chance.", "publishedDate": "2016-07-07", "language": "en", "rating": 5}, {"id": 385787445, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d3360600-r385787445-Gaudi_Experience-Barcelona_Catalonia.html", "text": "We found this place while visiting the Park Guell.\n\nI have to say show is well worth the money (which is not to high). It is great for adults and children alike. \n\nThe show lets you experience Gaudi in a way that just seeing a building cannot.\n\nSo if you are in the area, I would say the 4D show is well worth a visit.", "publishedDate": "2016-06-25", "language": "en", "rating": 4}, {"id": 382384501, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d3360600-r382384501-Gaudi_Experience-Barcelona_Catalonia.html", "text": "This exhibit is structured excellently and the individual audio guides really allow you to experience it at your own pace and in as much depth as you like.\n\nHaving done a lot of sightseeing beforehand we had a good idea of the location of many of the buildings / structures talked about.  I would recommend doing the sightseeing first as it seemed more meaningful with the real life experience already 'in the bag'.  (If you go on the official Barcelona bus tour you also get a voucher for money off the exhibit.)", "publishedDate": "2016-06-14", "language": "en", "rating": 5}, {"id": 379842231, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d3360600-r379842231-Gaudi_Experience-Barcelona_Catalonia.html", "text": "The ride is relatively cheap only about 10 euros per person, and if you got a coupon book from hop-on-hop-off buses or else where you can get a discount and bring it down to roughly 7 euros. The facility is located a few minutes from the front exit of Guell park, a nice stop to cool off and use the restroom.\n\nThe ride itself is quite short, maybe 15 minutes, but for the price it was as expected. The content of the show was somewhat interesting, showing Gaudi's work comes to life, the 4D experience was however somewhat lacking. The 3D effect of the movie wasn't too impressive, probably the same effect you got from a passive 3D TV at home. I wasn't super tall but half the time on the ride my feet can touch the ground when I was supposed to be \"flying\", this really takes any fantasies away. The ride is probably more tailored to young children or teens. \n\nThere are some effects such as wind and slight water splash during that ride, like I said, it was a nice ride for people to cool off after a whole days' walk. I would prefer if they just call this a screen play with rocking chair and blowing wind rather than a 4D experience.", "publishedDate": "2016-06-05", "language": "en", "rating": 3}, {"id": 377088606, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d3360600-r377088606-Gaudi_Experience-Barcelona_Catalonia.html", "text": "The 4D experience is a must. In my opinion it's cheap. If you take a look at the photos of people in the show, you can see that this is real fun and fairly educational at the same time. It's right by the Parc Guell, so, if you're up there, don't miss this.", "publishedDate": "2016-05-27", "language": "en", "rating": 5}, {"id": 374409791, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d3360600-r374409791-Gaudi_Experience-Barcelona_Catalonia.html", "text": "Up near the Parc Guell entrance, this is a fun thing to do. We had a short wait before our show time and grabbed a mojito at the restaurant opposite, which I'm sure helped make it all more exciting! ;) I was hoping for a 'fly by' the tops of La Sagrada Familia, got that and loads more. If you've been on the Bus Turistica their discount booklet gives you money off. Not cheap but it will stay with you so I think worth the money. ", "publishedDate": "2016-05-18", "language": "en", "rating": 5}, {"id": 368549620, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d3360600-r368549620-Gaudi_Experience-Barcelona_Catalonia.html", "text": "Stumbled across this on our way back from Park Guell, a very creative presentation of Gaudi's works. I always find the 4D stuff a bit strange, but the visual story they created (no speaking so no language problem) was very engaging and inspiring.", "publishedDate": "2016-04-28", "language": "en", "rating": 5}, {"id": 362041120, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d3360600-r362041120-Gaudi_Experience-Barcelona_Catalonia.html", "text": "Definitely worth seeing, not only on a rainy day ;) The 4D effects take you right into late 19th century Barcelona and the magical world of Gaudi's imagination. Wish it had been longer than 15 min.", "publishedDate": "2016-04-06", "language": "en", "rating": 5}, {"id": 360805350, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d3360600-r360805350-Gaudi_Experience-Barcelona_Catalonia.html", "text": "If you love Gaudi's design, if you want to know more about his creativity, then go for this Gaudi Experience! Although it is only 15 minutes, and the ticket might be a bit expensive, definitely worth to have a look, you will be amazed by the effects and the way of storytelling!", "publishedDate": "2016-04-01", "language": "en", "rating": 5}, {"id": 357335413, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d3360600-r357335413-Gaudi_Experience-Barcelona_Catalonia.html", "text": "Not good, it's a rip off for 9 EUR, don't waste your time, take a walk around the area much nicer, more peaceful, more cultural, and free.", "publishedDate": "2016-03-21", "language": "en", "rating": 2}, {"id": 356675640, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d3360600-r356675640-Gaudi_Experience-Barcelona_Catalonia.html", "text": "I got surprised when me, my mom, my little cousins, my siblings and aun, all felt the same: AMAZING! I t was very cool to feel it, although is not very strong the \"4D\" such as water/smells/air buuuuut is a nice first experience. Apart for all I find Gaudí a genius, and is a good way of knowing his beginnings.", "publishedDate": "2016-03-18", "language": "en", "rating": 5}, {"id": 356579800, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d3360600-r356579800-Gaudi_Experience-Barcelona_Catalonia.html", "text": "Whatever you do while in Barcelona . Do not get duped into seeing the 15 minute film. They sell it as something related to Gaudi while it is a third rate 3 D ride . Absolutely a rip off.", "publishedDate": "2016-03-18", "language": "en", "rating": 1}, {"id": 355420012, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d3360600-r355420012-Gaudi_Experience-Barcelona_Catalonia.html", "text": "\nBarcelona, more than any other city in the world, is famous for its architecture. The first day of your visit to Barcelona you will already outlined and you will see centuries of art and exceptional attention to detail in the old quarters of the city.\nBut to see how the roots evolved and were interpreted by the fantastic imagination of the most famous son of Barcelona, Antoni Gaudí, you must get out of the old town and cross the modern district of Eixample. You can see how modernism, most associated movement Gaudí, left a unique legacy that defines Barcelona today.\n", "publishedDate": "2016-03-14", "language": "en", "rating": 5}, {"id": 354860672, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d3360600-r354860672-Gaudi_Experience-Barcelona_Catalonia.html", "text": "This place leads off with the hint of learning more about Gaudi but is in fact nothing more than a 15 minute amusement park film that has little to do with Gaudi and more to do with dubious thrill. It's not worth the price to say the least.", "publishedDate": "2016-03-12", "language": "en", "rating": 1}, {"id": 354216423, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d3360600-r354216423-Gaudi_Experience-Barcelona_Catalonia.html", "text": "This is no ordinary 3D movie experience, it adds motion, making it truly immersive. You have to strap into your chair because it will move, sometimes violently, while the movie plays. The film runs for 15 minutes, but in that time, as well as thrill and entertain, it will inform you about Gaudi's vision and inspiration. It will open a door into his thinking and his designs. The special effects are just that, special. Well worth the 7.50 Euros (we are elderly people). In the inevitable gift shop, there is a very fine statue of the great man himself, positioned so you can take a selfie with him. Apparently, that's the current fashion. The location is by the taxi drop-off for Park Guell. Well worth including in your visit.", "publishedDate": "2016-03-09", "language": "en", "rating": 5}, {"id": 353582612, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d3360600-r353582612-Gaudi_Experience-Barcelona_Catalonia.html", "text": "These museum films/experiences are usually so disappointing - not this one.... a strapped-in 4D roller coaster view of Gaudi's work that is exciting, beautiful and emotional. Made me feel sick and want to do it again immediately - always a sign of a great fairground ride!!", "publishedDate": "2016-03-07", "language": "en", "rating": 5}, {"id": 340892650, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d3360600-r340892650-Gaudi_Experience-Barcelona_Catalonia.html", "text": "we arrived, I asked if photos could be taken, yes but no flash, understandable as is most places, halfway through visit was told my camera was professional at $200 from Target and my phone costs more I found this incredulous, very ignorant people controlling the photos, I stopped and waited for my husband was so angry by their ignornance", "publishedDate": "2016-01-18", "language": "en", "rating": 1}, {"id": 339135111, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d3360600-r339135111-Gaudi_Experience-Barcelona_Catalonia.html", "text": "Any one who loves anything can visit and enjoy Guadi . He is prevalent all around Barcelona . Segrada familiar is an outstanding piece of work . Enjoy", "publishedDate": "2016-01-11", "language": "en", "rating": 5}, {"id": 337719149, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d3360600-r337719149-Gaudi_Experience-Barcelona_Catalonia.html", "text": "Dont miss the opportunity to visit the many Gaudi treasures that is on offer in Barcelona. Incredible and breathtaking.", "publishedDate": "2016-01-05", "language": "en", "rating": 5}, {"id": 336570831, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d3360600-r336570831-Gaudi_Experience-Barcelona_Catalonia.html", "text": "The experience is a 10 minute 4D ride and film, with you strapped into a seat. It's shows Gaudi in a totally different way and is very good value and well worth a visit.", "publishedDate": "2016-01-01", "language": "en", "rating": 5}, {"id": 335351813, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d3360600-r335351813-Gaudi_Experience-Barcelona_Catalonia.html", "text": "A bit over inflated if you ask (a miserable) me.\n\nWas far less of an exhibition than I was expected and in the end you 'just' get this '4D' ride/film malarkey. The latter was well done but rather a short 15 minutes. The story was spruced up a tad to make it a bit more dynamic so they could get some 3D effects in.\n\nOut of the six of us, the youngest (7) found it a bit scary in places (but not much), I (Mr Miserable) felt it was 'ok' - and everyone else loved it.\n\nAlas, I'm doing the review so it gets an average!", "publishedDate": "2015-12-27", "language": "en", "rating": 3}, {"id": 334289578, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d3360600-r334289578-Gaudi_Experience-Barcelona_Catalonia.html", "text": "Nice 15 minutes show in 4D .We can feel the genius of the Gaudi and to see a very good attraction.Must to came with the children after visited the Park Guel ", "publishedDate": "2015-12-21", "language": "en", "rating": 5}, {"id": 330827982, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d3360600-r330827982-Gaudi_Experience-Barcelona_Catalonia.html", "text": "You can see Gaudi's influence all around Barcelona so we would encourage everyone to try this experience to get a feel for his life and how he developed his styles. A very well presented and thoroughly enjoyable experience - not to be missed!", "publishedDate": "2015-12-05", "language": "en", "rating": 5}, {"id": 328642663, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d3360600-r328642663-Gaudi_Experience-Barcelona_Catalonia.html", "text": "I think the 4D experience was a little overpriced for what it was but it was fun. We hadn't realised until after that we had a 20% of voucher with our bus tour and that would have made it a bit better value for money. In all it was quite a fun experience and gave a little insight into the works of Gaudi.", "publishedDate": "2015-11-23", "language": "en", "rating": 3}, {"id": 328329356, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d3360600-r328329356-Gaudi_Experience-Barcelona_Catalonia.html", "text": "I realise that this venue has a 4D video but we just needed somewhere to get out of the sun and use the toilet. It did well at providing services for this - with a decent shop offering a range of things to buy so you didn't feel too bad about not spending any money on 15 mins of video.", "publishedDate": "2015-11-22", "language": "en", "rating": 3}, {"id": 328120180, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d3360600-r328120180-Gaudi_Experience-Barcelona_Catalonia.html", "text": "Fantastic introduction, to the life and work of the great Gaudi.  The headset displays and information was really well presented with excellent use of technology.   The 4d movie was a short but fun experience.  I would highly recommend this walk with Gaudi before visiting la Segrada Familia or other Gaudi works.", "publishedDate": "2015-11-20", "language": "en", "rating": 5}, {"id": 321932433, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d3360600-r321932433-Gaudi_Experience-Barcelona_Catalonia.html", "text": "Its a short 10 minute movie in 4D. Having never experienced 4D before we were in for a fun ride. Can recommend it to everyone before going to the park guell. Its not worth a detour from the city it self, but worth the visit of you are near by. A good tip: Stay away from the restaurant across the road. ", "publishedDate": "2015-10-26", "language": "en", "rating": 4}, {"id": 316017085, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d3360600-r316017085-Gaudi_Experience-Barcelona_Catalonia.html", "text": "Wow!! This is definitely worth a visit. \nMy wife and I enjoyed it so much, the time just flew by and it was over before you knew it!!", "publishedDate": "2015-10-04", "language": "en", "rating": 5}, {"id": 315677775, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d3360600-r315677775-Gaudi_Experience-Barcelona_Catalonia.html", "text": "This is, by far, the best 15 minutes that I have spent learning about Gaudi. If you wanna do this, make sure that you hop on the Barcelona Bus Toursitic, hear all what the audio guide says, look at the buildings and the streets alto learn about modernisma, and when your bus takes you to Park Guell, go see it and when you are going down the street back to the bus station, pass by this place and see the 4D show. I'm not sure if the location is chosen or is a coincidence. But I'm sure if you do the above in sequence it will make more sense and you will enjoy the experience...", "publishedDate": "2015-10-02", "language": "en", "rating": 5}, {"id": 313975397, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d3360600-r313975397-Gaudi_Experience-Barcelona_Catalonia.html", "text": "If you are going to Park Guell, pass by this one.\nA 4-D show of Gaudi's inspirations for La Segrada Familia, Casa Batlo & Casa Mila. I would go again :)", "publishedDate": "2015-09-27", "language": "en", "rating": 5}, {"id": 312550636, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d3360600-r312550636-Gaudi_Experience-Barcelona_Catalonia.html", "text": "This appears to be not well know and is tucked away in a series of shops on the hill climb to the Park Guell ( if going to park buy these tickets online before you go). But what a find, 30-45 minutes is all you need but the interactive giant TV screens tells you all you need to know about Gaudi, and of course the shop has items to sell, but they are good and quite reasonable. Finished off by a 10-15 minute white knuckle 4D experience which was not only informative, great fun, but also had some heart stopping moments. Personally a must visit. We bought the 5 Day Barcalona card from Viator tours before we went ( 3 day and 4 day are available) which gives travel on all metros bus and some rail, but also discount on places to see. we thus paid 13 euros for two for this attraction....well worth it.", "publishedDate": "2015-09-21", "language": "en", "rating": 5}, {"id": 312345376, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d3360600-r312345376-Gaudi_Experience-Barcelona_Catalonia.html", "text": "After reading some reviews, i can't understand how some  people did not enjoy this 3D - 10 minute film which takes you through the mind of Gaudi and how he created the weirdest most famous buildings which brings millions of people to Barcelona just to see..  \nMe and my teenaged daughters enjoyed every second. We requested to see the 3D film again and we were willing to pay again but unfortunately it was closing time. \nIts very important that you go to see the monuments of Gaudi in different locations in the ciy before going to see this 3D film. At least you can relate to the buildings you see on this 3D film and discover the amazing  imagination of Gaudi and how he came up with his creation. .The 3D film basically takes you through his mind as he was creating so you have to sit back relax, fasten your seat belt and enjoy every second. Just pretend you are Gaudi. I totally recommend it. ", "publishedDate": "2015-09-21", "language": "en", "rating": 5}, {"id": 312123780, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d3360600-r312123780-Gaudi_Experience-Barcelona_Catalonia.html", "text": "Conflicting reviews on TripAdvisor meant we'd give this a chance and considering we had some time to kill before we saw the real Gaudi experience (La Sagrada Familia) we thought we'd give it a go.\n\nAt  €9, you can see some of the real Gaudi work for yourself for not much more! There's a gift shop outside the theatre with touch screens with information about Gaudi on. Yes, you could maybe spend a good hour looking at these, but there was just so much information on, no tourist is going to read through everything. It was basically a Wikipedia page just copy pasted onto some fancy looking touch screens. \n\nAs for the actual 4D film, completely overrated. I can see people with kids maybe wanting to come as it might keep them entertained, but it gave absolutely zero information about Gaudi and definitely didn't take you into his world. After visiting La Sagrada Familia and there being a museum part with so much interesting stuff about Gaudi being inspired by nature, it really made you wonder what whoever made the Gaudi Experience film was on. The film compromised of an actor playing Gaudi sat at a desk drawing and then his buildings morphed into knights and dragons and it just descended into an elaborate fight scene between the two. No information about his architecture or what inspired him really was shown. Definitely not worth the money considering the film was actually only about 10 minutes long.", "publishedDate": "2015-09-20", "language": "en", "rating": 1}, {"id": 311747858, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d3360600-r311747858-Gaudi_Experience-Barcelona_Catalonia.html", "text": "On our way out from Park Guell we saw this place and were intrigued so we decided to pay it a visit. it's all about the Great Gaudi. A display of some of his artworks samples including his special chair, souvenirs and most specially a 4D movie room showing a movie about the great innovative.", "publishedDate": "2015-09-19", "language": "en", "rating": 4}, {"id": 306924673, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d3360600-r306924673-Gaudi_Experience-Barcelona_Catalonia.html", "text": "This movie experience gives you the chance to understand the history and the making of. All This While beeing trilled by a 4D movie ride.", "publishedDate": "2015-09-04", "language": "en", "rating": 4}, {"id": 294372822, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d3360600-r294372822-Gaudi_Experience-Barcelona_Catalonia.html", "text": "Great fun for everyone, not exorbitantly priced, imaginative and informative. Combines modern day technology with Gaudis genius perfectly.", "publishedDate": "2015-07-31", "language": "en", "rating": 5}]}}]