[{"locationId": 15668683, "name": "JuegaRV Barcelona", "placeType": "ATTRACTION", "reviewListPage": {"reviews": [{"id": 750227367, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d15668683-r750227367-JuegaRV_Barcelona-Barcelona_Catalonia.html", "text": "I recently visited with friends and had a great time! I was surprised how realistic the games felt and how easy the console was to use. The graphics, console and game selection are all top notch, combine that with the friendly staff and clean environment, makes for an unforgettable experience. I highly reccomend giving this place a visit if you are in search of a spectacular time!", "publishedDate": "2020-03-10", "language": "en", "rating": 5}, {"id": 748649383, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d15668683-r748649383-JuegaRV_Barcelona-Barcelona_Catalonia.html", "text": "I went to JuegaRV during an event where we got to try a couple of their VR games. The setup was very impressive. I had no trouble wearing glasses with the headset and got to start playing really easily. The games were a lot of fun and you could even move around a bit and the sensors picked it up!  They were very immersive and the scores gave it an interesting competitive component.\nThe staff was really helpful and patient and they made it all feel really easy. It was also nice to see that they cleaned and disinfected the headsets between each use.", "publishedDate": "2020-03-02", "language": "en", "rating": 5}, {"id": 748499471, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d15668683-r748499471-JuegaRV_Barcelona-Barcelona_Catalonia.html", "text": "Very good Vr place with different games. I had a very enjoyable evening playing Vr games like shooting or dancing", "publishedDate": "2020-03-01", "language": "en", "rating": 5}, {"id": 741499406, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d15668683-r741499406-JuegaRV_Barcelona-Barcelona_Catalonia.html", "text": "We went for our sons 12th birthday and it turned out to be a very fun activity for the whole family. We did the escape room and tried some of the games and enjoyed ourselves a lot. The games are varied, for every taste and the instructors were very friendly and clear. So, thank you! Its been a great day out!", "publishedDate": "2020-01-27", "language": "en", "rating": 5}, {"id": 740848498, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d15668683-r740848498-JuegaRV_Barcelona-Barcelona_Catalonia.html", "text": "I have been continuing going to JuegaRv since 2019. Before , I’ve been in Terrassa location but now they have moved fully to Barcelona and this was the best news for me ! I adore this place , always recommend it to my friends for parties and another kind of celebrations \nIt is a nice place to spend time in a funny way\nGuys have a lot of different games for all interests and ages \nReally recommended place ", "publishedDate": "2020-01-23", "language": "en", "rating": 5}, {"id": 656023422, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d15668683-r656023422-JuegaRV_Barcelona-Barcelona_Catalonia.html", "text": "It was the first time my boyfriend and I tried a VR escape room and we had a lot of fun:) \nThat’s a cool place to go on a date or to spend time with friends. \nHighly recommend it!", "publishedDate": "2019-03-03", "language": "en", "rating": 5}, {"id": 651775893, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d15668683-r651775893-JuegaRV_Barcelona-Barcelona_Catalonia.html", "text": "My friends and I enjoyed all the games that were played. Atmosphere was fun and welcoming. The instructor was super friendly and patient with all of us and was able to instruct everything clearly. I will be coming back! ", "publishedDate": "2019-02-12", "language": "en", "rating": 5}, {"id": 651746379, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d15668683-r651746379-JuegaRV_Barcelona-Barcelona_Catalonia.html", "text": "had such a great time the games are so original and super entertaining and the people working there are very nice. A very unique experience and a guaranteed fun night even for non gamers haha. One of my favorite things to do in Barcelona for sure.", "publishedDate": "2019-02-12", "language": "en", "rating": 5}]}}]