[{"locationId": 3139265, "name": "Basilica de Santa Maria del Pi", "placeType": "ATTRACTION", "reviewListPage": {"reviews": [{"id": 753407669, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d3139265-r753407669-Basilica_de_Santa_Maria_del_Pi-Barcelona_Catalonia.html", "text": "The entrance was open around 8pm, so we walked inside and took a look. Spooky, eerie quiet and cold inside with low light. Quite dark. Really old, bare stone inside church. Need to call ghostbusters. We stayed inside for 5 mins, just taking in the atmosphere ", "publishedDate": "2020-05-10", "language": "en", "rating": 3}, {"id": 744061289, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d3139265-r744061289-Basilica_de_Santa_Maria_del_Pi-Barcelona_Catalonia.html", "text": "You can visit this place if you dont have any other places to go , Many other place worth visiting i would recommend ", "publishedDate": "2020-02-09", "language": "en", "rating": 2}, {"id": 743605436, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d3139265-r743605436-Basilica_de_Santa_Maria_del_Pi-Barcelona_Catalonia.html", "text": "Europe has so many great basilicas and this is another for that list. I wouldn’t say it’s a must see but it’s very near Las Ramblas and hard to miss if you’re in the gothic quarter. I honestly don’t recall there being a fee for us to go inside, or if there was it was very small. So I don’t think there is a reason to miss this one, inside or out. ", "publishedDate": "2020-02-07", "language": "en", "rating": 4}, {"id": 734934417, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d3139265-r734934417-Basilica_de_Santa_Maria_del_Pi-Barcelona_Catalonia.html", "text": "It’s incredibly nice and it looks so old. It has a good old rose window. This cathedral is really my style.", "publishedDate": "2019-12-27", "language": "en", "rating": 5}, {"id": 728403400, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d3139265-r728403400-Basilica_de_Santa_Maria_del_Pi-Barcelona_Catalonia.html", "text": "Wonderful ambience as the church is surrounded by a lovely little square , the church itself is impressive inside and out with the large Rose window a highlight , when I visited in 2007 the window was on display so have used these photos below but when we were there in Oct 2019 there was a cloth over the outside presumably for repair work which was a shame.", "publishedDate": "2019-11-23", "language": "en", "rating": 4}, {"id": 726446275, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d3139265-r726446275-Basilica_de_Santa_Maria_del_Pi-Barcelona_Catalonia.html", "text": "I did both del Mar and del Pi's rooftop tours.  Both guides were spectacular, two of the best guides in three weeks in Spain.  I did them both, back-to-back, two hours apart (wear knee compression sleeves, if you are old. like me).  I will say that del Pi has the better overall view, but del Mar is the easier climb.  HOWEVER!  Visit both churches, if you want to get a more rounded view of the variety of the Gothic Quarter.", "publishedDate": "2019-11-14", "language": "en", "rating": 5}, {"id": 715002809, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d3139265-r715002809-Basilica_de_Santa_Maria_del_Pi-Barcelona_Catalonia.html", "text": "It was not on our TO Do list, but we happy we did it!\n\n  We stumbled upon this Basilica by accident. Large Rose window (it is covered from outside with fabric) attracted our attention. We looked closely and notices beautiful coloured windows inside of the Basilica. \n  There was no line to get tickets, no tourist crowd around at all. So we decided to take a guided tour with tower. (8 euros per person). While waiting for the tour to begin we enjoyed local tapas and beer at the very intimate square right in front of the main entrance of the Basilica. Some local musicians played Spanish motives on guitar.\n  The tour was not what we expected (in the good way). First of all it was only me and my wife, so group tour turned into private. Most information that was provide by the tour guide was about the history and architectural aspects of the Basilica and not religion. \nBe ready to climb some tiny steps to the top of the tower, but its done in segments so you'll have time for rest and catch a breath. Totally worth it though. The view from the tower is unobstructed and stunning. \n\nHighly recommend.", "publishedDate": "2019-10-03", "language": "en", "rating": 5}, {"id": 710492071, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d3139265-r710492071-Basilica_de_Santa_Maria_del_Pi-Barcelona_Catalonia.html", "text": "Another nice church on a postage stamp parcel of land. Lots of weddings and doings on. Nice restaurants in the plaza", "publishedDate": "2019-09-17", "language": "en", "rating": 4}, {"id": 708396510, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d3139265-r708396510-Basilica_de_Santa_Maria_del_Pi-Barcelona_Catalonia.html", "text": "Just inside the front door is a display of the ceremonial “giants”. Apparently huge numbers of these take part in celebratory parades.", "publishedDate": "2019-09-09", "language": "en", "rating": 4}, {"id": 697110026, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d3139265-r697110026-Basilica_de_Santa_Maria_del_Pi-Barcelona_Catalonia.html", "text": "Very reasonably priced \nGreat guide who was knowledgeable\nThe climb is done in several segments , take water with you\nBut worth it at the top\nStunning", "publishedDate": "2019-08-08", "language": "en", "rating": 5}, {"id": 690673838, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d3139265-r690673838-Basilica_de_Santa_Maria_del_Pi-Barcelona_Catalonia.html", "text": "The Basilica de Santa Maria del Pi is a church in the Gothic Quarter of Barcelona dating from the 15th century. It doesn't look like much from the exterior, but the interior is both impressive and the epitome of Gothic architecture. The alter is one of the most impressive aspects of the church. Standing just in front of supporting pillars, the alter's deceptive simplicity design stands in contrast to the majestic columns behind it. As with most churches, there are chapels all around the nave, except that these are all very contemporary subject matter both it it's design of religious iconography and stained glass.", "publishedDate": "2019-07-18", "language": "en", "rating": 5}, {"id": 690632815, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d3139265-r690632815-Basilica_de_Santa_Maria_del_Pi-Barcelona_Catalonia.html", "text": "In the place where the church subject matter of this review stands there was a small romanesque church in the tenth century also dedicated to Sta. Maria del Pi (Virgin of the Pine Tree). The name is put down to the existence of a huge pine tree on the spot when the then new town bearing the same name originated. The present church started being built in the first half of the fourteenth century and apparently its construction lasted longer than 126 years.\nThe church is in gothic style with a rather sober façade. The belfry tower is the most outstanding outer element of the church. It was built under the architect Bartomeu Mas's design most probably in the fifteenth century. Some elements which were part of the ancient romanesque portal can still be observed in the Avemaria's portal facing St. Josep Oriol square. The said façade has a rectangular shape and it's flanked by two towers. The ornamented rose window is really astounding on account of its elaborate manufacture and its unusually large size. This element and the main entrance with all the niches, arches and other features in the portal and around it are the only façade parts contrasting its general sobriety.\nOnce inside one is struck by both its sobriety and its grandeur. The church layout and its conception are the typical ones of the Catalan gothic churches. It's a single nave church with side chapels deprived of any sculptural decoration. The ceiling consists in a ribbed vault divided in seven sections. The side chapels are each of them between two buttresses and it's in some of them where the sole baroque elements can be found, such as pillars with Corynthian capitals over the altars. They are very nice chapels, particularly that dedicated to the Helpless Virgin. Another chapel is dedicated to St. Joaquima de Vedruna i de Mas, who was baptised in that temple in 1783. The image of the Virgin presiding over the church was made by the sculptor Enric Monjo in 1973. It's a very nice carving worth of being observed carefully for a while.\nAttached to the basilica there is the chapel of the Holy Blood. It was built originally in the second half of the fifteenth century but it was set on fire during the Spanish Civil War. It was rebuilt as it is nowadays in 1952. At its inception it was used as a chapter house but in the seventies of the seventieth century it was conveyed to the Archguild of the Very Pure Blood.\nThe Basilica of Sta. Maria del Pi is an interesting church, as can be gathered from the foregoing, whose visit is worth the while. Apart from the imposing majestic inner architecture enhanced at day time by the brightness ascribable to the light coming through the stained glass windows, there one may feel a very peaceful atmosphere partly due to the fact that the surrounding area is also a rather calm part of the city, with little traffic. The negative point is that they make one pay to enter that temple, which doesn't seem to be in line with the relevant doctrine.", "publishedDate": "2019-07-18", "language": "en", "rating": 4}, {"id": 688508772, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d3139265-r688508772-Basilica_de_Santa_Maria_del_Pi-Barcelona_Catalonia.html", "text": "Wondered around the streets and stumbled upon this cute Basilica. The design is beautiful and the art work gorgeous. ", "publishedDate": "2019-07-10", "language": "en", "rating": 4}, {"id": 681921288, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d3139265-r681921288-Basilica_de_Santa_Maria_del_Pi-Barcelona_Catalonia.html", "text": "Discovered this gem whilst walking around the Gothic area. Only 4.50 euros per adult to experience hundreds of years history and religious icons in one beautiful building. The lower floor explains the history and has a couple of fabulous paintings and items of interest - remember to look up to see the gothic ceilings. The different altars are stunning. Unfortunately, we couldn't get to experience the full beauty of the stained glass as it was pouring with rain and dull outside. Again, due to the rain and some renovation work, we were unable to visit the rooftop but hope to return again on a sunny day to fully appreciate this beauty!", "publishedDate": "2019-06-16", "language": "en", "rating": 5}, {"id": 680939088, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d3139265-r680939088-Basilica_de_Santa_Maria_del_Pi-Barcelona_Catalonia.html", "text": "Yet another excellent specimen of Gothic style in the city of Barcelona, one minute walk from La Rambla. Quiet and not crowded.", "publishedDate": "2019-06-12", "language": "en", "rating": 4}, {"id": 677415284, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d3139265-r677415284-Basilica_de_Santa_Maria_del_Pi-Barcelona_Catalonia.html", "text": "Yet another excellent specimen of Gothic style in the city of Barcelona. Try and visit while the sun is still up, to enjoy the vitro glass..", "publishedDate": "2019-05-29", "language": "en", "rating": 4}, {"id": 673220611, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d3139265-r673220611-Basilica_de_Santa_Maria_del_Pi-Barcelona_Catalonia.html", "text": "Amazing and underrated Gothic basilica in the heart of Barcelona with beautiful rose window and extremely interesting history. The current church is built over Romanesque and even earlier temples, and at one time was more important than the Cathedral of Santa Eulalia and Santa Maria del Mar.", "publishedDate": "2019-05-11", "language": "en", "rating": 5}, {"id": 673186727, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d3139265-r673186727-Basilica_de_Santa_Maria_del_Pi-Barcelona_Catalonia.html", "text": "This church is a 15th-century Gothic church, which is situated on the charming Placa del Pi in the Barri Gotic district.\n\nThe most striking thing in the front facade is the large rose window. It was covered during our visit.", "publishedDate": "2019-05-11", "language": "en", "rating": 4}, {"id": 672722145, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d3139265-r672722145-Basilica_de_Santa_Maria_del_Pi-Barcelona_Catalonia.html", "text": "Basilica de Santa Maria del Pi is an old church with quite a bit of history within its walls. It's a lovely church. In particular its stained glass rose windows are beautiful. Of course it has other lovely features as well. Its long history goes back into the distant past, as far as the 10th century, when, according to sources a church stood there, dedicated to the Blessed Lady of the Pine Tree (the Virgin Mary). The present church was built much later in the 14th century. However over time it suffered extensive damage on a number of occasions, including earthquakes, war damage, civil unrest fires and much more. Yet, it still stands proudly! Worth a visit.", "publishedDate": "2019-05-09", "language": "en", "rating": 4}, {"id": 666120286, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d3139265-r666120286-Basilica_de_Santa_Maria_del_Pi-Barcelona_Catalonia.html", "text": "During our visit to Barcelona we incidentally we ended up in front of this modest Basilica of Santa Maria del Pe (Compared to Sagrada Familia and Santa Maria Del Mar) Its as beautiful as all others with magnificent sculptures and has a small square in front of it were the was a small market offering a variety of local sweet delicacies. Further more in the evening we joined to see and listen to a magnificent concert from 3 masters on the guitar who played a nice variety of Flamenco pieces.", "publishedDate": "2019-04-13", "language": "en", "rating": 5}, {"id": 588120821, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d3139265-r588120821-Basilica_de_Santa_Maria_del_Pi-Barcelona_Catalonia.html", "text": "Was shocked to find nearly every old church in Barcelona selling tickets.  This is wrong on every level.", "publishedDate": "2018-06-17", "language": "en", "rating": 1}, {"id": 585220555, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d3139265-r585220555-Basilica_de_Santa_Maria_del_Pi-Barcelona_Catalonia.html", "text": "This is one among many Gothic churches in Barcelona's Gothic quarter. Like other sites in the city, it charges a high admission. Not sure if it's worth the price.", "publishedDate": "2018-06-04", "language": "en", "rating": 3}, {"id": 584908529, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d3139265-r584908529-Basilica_de_Santa_Maria_del_Pi-Barcelona_Catalonia.html", "text": "While I wouldn't have gone out of my way to see the Basilica itself, it was the perfect venue for a 1-hour evening performance by Pedro Javier Gonzalez, a flamenco-style classical guitarist. The intimate setting and excellent acoustics made up for the wooden pews. This was definitely a show worth seeing, and there is a nice gelateria across the plaza for an after-show dessert.", "publishedDate": "2018-06-03", "language": "en", "rating": 4}, {"id": 583881102, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d3139265-r583881102-Basilica_de_Santa_Maria_del_Pi-Barcelona_Catalonia.html", "text": "This is one of a number of elaborate and large old churches in the old part of Barcelona and it is impressive but rather dark and unspectacular in side. Worth a visit .", "publishedDate": "2018-05-30", "language": "en", "rating": 3}, {"id": 579853735, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d3139265-r579853735-Basilica_de_Santa_Maria_del_Pi-Barcelona_Catalonia.html", "text": "We paid 8,5€ and expected an exceptional view. But we just got a poorly managed church. It is not fault of the church by their self. It got destroyed in the Spanish Civil War. I think it would be better to ask for supporters better than a entrance fee. ", "publishedDate": "2018-05-13", "language": "en", "rating": 3}, {"id": 579758331, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d3139265-r579758331-Basilica_de_Santa_Maria_del_Pi-Barcelona_Catalonia.html", "text": "It is tough to give a full and fair assessment of the Basilica as it was undergoing a decent amount of restoration when we were there.  As an example, the main stained glass rose window was covered up from the outside.  However, I never grow weary of viewing structures that have origins going back to the 1300s.  When one reads all the obstacles this church has overcome to still be there standing, it is quite amazing.  I find the Octagonal Bell Tower quite interesting and the Tympanum over the main entrance certainly catches your eye.  It sits on Placa del Pi, and when we were there there were cheese and jam vendors set up in booths---try the cheese snack.", "publishedDate": "2018-05-12", "language": "en", "rating": 4}, {"id": 567464960, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d3139265-r567464960-Basilica_de_Santa_Maria_del_Pi-Barcelona_Catalonia.html", "text": "A beautiful gothic basilica in the old city of Barcelona. Contrary to what happens in Gothic architecture this basilica has only one single nave enriched by chapels along its sides. The Gothic and Baroque chapels are splendid, richly decorated that will make you lose in all their details. The basic ticket is for 4€ but I suggest you make the € 6.50 ticket that allows you to take a guided tour in the medieval tower. The tower is 54 meters high and is the tallest tower in the city after those of Sagrata Familia. From the roof of the tower you can enjoy the 360 ​​degree view of the whole of Barcelona! The ticket also includes a visit to the cloister (rather disappointing compared to that of the Cathedral) and the visit to the small treasure museum, where the ancient relics and exhibitors are kept, if you like sacred art you’ll like it very much, even if it is very small.\nStaff is super friendly and nice.\nCheck my pics!\nMarzio from Rome, instagram: @marziomartel", "publishedDate": "2018-03-19", "language": "en", "rating": 4}, {"id": 560360863, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d3139265-r560360863-Basilica_de_Santa_Maria_del_Pi-Barcelona_Catalonia.html", "text": "It is alright for 4 euros I guess but cathedral is way nicer inside. I was in the gothic quarter so decided to pay the visit but I would not come here especially for this. Choice is yours, I have seen better craftshifts around Barcelona.", "publishedDate": "2018-02-13", "language": "en", "rating": 3}, {"id": 551448973, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d3139265-r551448973-Basilica_de_Santa_Maria_del_Pi-Barcelona_Catalonia.html", "text": "One of the interesting features of the Basilica is the display of the Gegants del Pi (Giants of Pi), located inside the entrance to the Basilica, on the right side. These can be viewed without paying the admission fee to enter the main section of the Basilica.\n\nThe gegants are used in various festivals, such as Corpus Christi, where they dance through the streets. The history of the gegants dates back to 1601 but they were largely forgotten for hundreds of years. Interestingly, for a catholic church, one of the main characters is a black Muslim man - named Mustafà. The main female gegant is called Elisenda.", "publishedDate": "2018-01-04", "language": "en", "rating": 4}, {"id": 547020943, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d3139265-r547020943-Basilica_de_Santa_Maria_del_Pi-Barcelona_Catalonia.html", "text": "A very memorable church to visit. The stained glass windows are most beautiful and the light coming through them is stunning. Take the time to walk around and see the side altars. The statues are so well done and the architecture is wonderful. It is a very quiet and peaceful place to visit. Try to take a few moments to see this if you visit the city.", "publishedDate": "2017-12-13", "language": "en", "rating": 5}, {"id": 546053456, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d3139265-r546053456-Basilica_de_Santa_Maria_del_Pi-Barcelona_Catalonia.html", "text": "Historic, beautiful architecture \nWonderful place to look at, check the art work sculptures, saints and stained glass, wonderful piece of architecture and history\nEasy access ", "publishedDate": "2017-12-08", "language": "en", "rating": 5}, {"id": 544042782, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d3139265-r544042782-Basilica_de_Santa_Maria_del_Pi-Barcelona_Catalonia.html", "text": "A wonderful church, free if you visit in the morning. The 3 euros for an elevator ride to the roof is worth the money. Great views over the Gothic Quarter and all of Barcelona.", "publishedDate": "2017-11-29", "language": "en", "rating": 5}, {"id": 543919163, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d3139265-r543919163-Basilica_de_Santa_Maria_del_Pi-Barcelona_Catalonia.html", "text": "This is a true hidden gem!  We took this tour and it is around a hour long.  The tower tour lasted the longest.  We scaled the narrow stairway up the tower.  As we made our way up section by section our tour guide let us rest while they explained the history of the church and tower.  The bell section has markings from workers and residents from  centuries ago.  Once on top wow.  The city view is wonderful.  Up on the top of the tower your guide shows you the Roman Wall, the old city, and so much more.  This tour is a history lesson of the church but also the city.  I highly recommend this tour.  ", "publishedDate": "2017-11-28", "language": "en", "rating": 5}, {"id": 541258518, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d3139265-r541258518-Basilica_de_Santa_Maria_del_Pi-Barcelona_Catalonia.html", "text": "If you love Spanish Guitar music, don't miss this!\nWe were lucky to get the ticket at the door on the night of the concert. We hung out on the lovely square before the show (9PM), there are some cafes and vendors selling local products that night. The concert took place in the chapel and the artist performs right on the altar under the statue of Jesus Christ, magical! \nWe enjoyed the music played by the lovely and talented Ekaterina Záytseva. Most memorable moment of my trip to Barcelona!", "publishedDate": "2017-11-15", "language": "en", "rating": 5}, {"id": 540866293, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d3139265-r540866293-Basilica_de_Santa_Maria_del_Pi-Barcelona_Catalonia.html", "text": "Basilica de Santa Maria is my favour church in Barcelona and at every opportunity that i have I return for a visit or take my friends visitors, is a unique architecture build around 13th century by neighbours and fisherman I also recommend to read the book about it. ", "publishedDate": "2017-11-14", "language": "en", "rating": 5}, {"id": 539216517, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d3139265-r539216517-Basilica_de_Santa_Maria_del_Pi-Barcelona_Catalonia.html", "text": "We saw Luis Robisco play guitar. It was an intimate setting in the church and he has an amazing talent. It was definitely a great hour of music. ", "publishedDate": "2017-11-07", "language": "en", "rating": 5}, {"id": 538765841, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d3139265-r538765841-Basilica_de_Santa_Maria_del_Pi-Barcelona_Catalonia.html", "text": "Beautiful gothic cathedral practically hidden downtown in Barcelona, wonderful little square attached to it ", "publishedDate": "2017-11-06", "language": "en", "rating": 5}, {"id": 530911779, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d3139265-r530911779-Basilica_de_Santa_Maria_del_Pi-Barcelona_Catalonia.html", "text": "This is a quaint basilica, but it isn't anything amazing. I think it gets confused with the other basilica named Santa Maria that is nearby. But that one is \"Del Mer\", not \"Del Pi\". \n\nThey both have large circular stained glass  windows so that doesn't help the confusion. \n\nIf you go early or late, admission is free. Otherwise the entrance is a couple of euros. \n\nThis one does have a bell tower you can climb for an additional fee but times are limited. Apparently they don't let people up after dusk because it can be dangerous climbing up/down. ", "publishedDate": "2017-10-07", "language": "en", "rating": 3}, {"id": 530886157, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d3139265-r530886157-Basilica_de_Santa_Maria_del_Pi-Barcelona_Catalonia.html", "text": "This is a beautiful example of gothic architecture.  The large rose window above the entrance is amazing.  It is worth paying the 4 Euros to visit.", "publishedDate": "2017-10-07", "language": "en", "rating": 4}, {"id": 523294601, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d3139265-r523294601-Basilica_de_Santa_Maria_del_Pi-Barcelona_Catalonia.html", "text": "We have visited this glorious old church each time that we have stayed in Barcelona. During our most recent stay in the city, we took another walk through the amazing Gothic Quarter and once again found ourselves at the basilica.\nIt has wonderful external architecture and its interior is beautifully decorated. The large stained glass windows are one of the outstanding features, best viewed from inside the church.\nDuring our latest visit, while we were both entering and leaving the basilica, we were harassed by beggars who station themselves at the church's main entrance. They were extremely persistent and all we could do was completely ignore them and walk by. This experience tended to take the gloss off our visit!", "publishedDate": "2017-09-10", "language": "en", "rating": 4}, {"id": 520374100, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d3139265-r520374100-Basilica_de_Santa_Maria_del_Pi-Barcelona_Catalonia.html", "text": "Great architecture with a lovely surrounding, very fascinating. I think it is more attractive than the Sagarda Familia.", "publishedDate": "2017-09-01", "language": "en", "rating": 5}, {"id": 515383631, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d3139265-r515383631-Basilica_de_Santa_Maria_del_Pi-Barcelona_Catalonia.html", "text": "Beautiful church in old Barri Gotic in Barcelona. The Rose window above the entrance is spectacular. There is a wonderful view from the Pi Bell tower. Please dress appropriately for visiting a church.", "publishedDate": "2017-08-19", "language": "en", "rating": 5}, {"id": 508981122, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d3139265-r508981122-Basilica_de_Santa_Maria_del_Pi-Barcelona_Catalonia.html", "text": "Before going to La Sagrada Familia, you should visit this one, so that you can compare both of them. Architecture is also the main attraction. Ceiling is really high and you will look to the top all the time.", "publishedDate": "2017-08-05", "language": "en", "rating": 5}, {"id": 508721354, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d3139265-r508721354-Basilica_de_Santa_Maria_del_Pi-Barcelona_Catalonia.html", "text": "It's in the middle of a built up area of Barcelona and doesn't look too grand from the outside. \n\nOnce you walk in you get a surprise as the church feels huge. It is as original as can be and I would recommend a visit up the bell tower. Not for the faint hearted as it's a bit of a narrow climb. Well worth it as you a 360 view of the city. \n\nWould highly recommend this over other churches in the area and there are lots. ", "publishedDate": "2017-08-04", "language": "en", "rating": 5}, {"id": 504091709, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d3139265-r504091709-Basilica_de_Santa_Maria_del_Pi-Barcelona_Catalonia.html", "text": "If you visit Barcelona, I recommend you to climb up this Basilica. The view from the top is really great, you can see the whole city from there!\nThe basilica itself is rather usual, like many others all over Europe.", "publishedDate": "2017-07-21", "language": "en", "rating": 4}, {"id": 503399757, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d3139265-r503399757-Basilica_de_Santa_Maria_del_Pi-Barcelona_Catalonia.html", "text": "Saint Mary the Sea:\n\nIn Ribera district of Barcelona, there is an imposing church built in 1329-1383 at the height of Catalonia’s maritime. It is a good example of Catalan Gothic Architecture.", "publishedDate": "2017-07-19", "language": "en", "rating": 3}, {"id": 501148841, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d3139265-r501148841-Basilica_de_Santa_Maria_del_Pi-Barcelona_Catalonia.html", "text": "Having read Ildefonso Falcone's \"Cathedral of the Sea\" this church was a must for me.\n\nIt might not be as lavishly decorated as some of the other churches in Barcelona, but it makes up for it with its simple beauty and calming atmosphere.\n\nRead the book, visit the church!", "publishedDate": "2017-07-12", "language": "en", "rating": 5}, {"id": 500397653, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d3139265-r500397653-Basilica_de_Santa_Maria_del_Pi-Barcelona_Catalonia.html", "text": "There are many other more famous churches in Barcelona, but this one is definitely worth a visit if you are in the area.  It is in a small square and the exterior is plain, Most of the tour groups just peak inside, but it is worth the nominal admission.  The inside is old, dark, and cool.  The church suffered a fire that destroyed much of the decorations, but the windows are lovely.\nAnd it was a peaceful place to sit quietly and cool off.", "publishedDate": "2017-07-10", "language": "en", "rating": 4}, {"id": 494433065, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d3139265-r494433065-Basilica_de_Santa_Maria_del_Pi-Barcelona_Catalonia.html", "text": "We were lost in Barri Gotic when we suddenly came upon this church, tucked next to a series of small plazas.\n\nIt felt as if we were transported back in time as we entered the quiet, dark church with a huge glowing rose window and imagined what it must have been like to live in Barri Gotic 8 centuries ago.\n\nThere was a small display of some of the church's silver treasures, which were beautifully ornate.", "publishedDate": "2017-06-19", "language": "en", "rating": 4}, {"id": 492102309, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d3139265-r492102309-Basilica_de_Santa_Maria_del_Pi-Barcelona_Catalonia.html", "text": "The basilica is very dark and dreary. Interesting to see but not to spend much time in. There are many better ones to visit.", "publishedDate": "2017-06-11", "language": "en", "rating": 3}, {"id": 490777959, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d3139265-r490777959-Basilica_de_Santa_Maria_del_Pi-Barcelona_Catalonia.html", "text": "This lady made her guitar sing. We got tickets earlier in the day on the front steps of Basilica Maria del Pi. We hadn't intended to attend a recital here but so glad we did. More than one hour of magic. Acoustics in the church were excellent. ", "publishedDate": "2017-06-05", "language": "en", "rating": 4}, {"id": 489447843, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d3139265-r489447843-Basilica_de_Santa_Maria_del_Pi-Barcelona_Catalonia.html", "text": "I saw this on the first evening I arrived in Barcelona. It felt magic, simply amazing. And every day wherever we went to or came to we found our way back to this place. Its doors were open after a long day and we entered it and it was so fulfilling. Although not catholics, we loved the gothic arches, the windows with colourful light coming in and the religious representations.", "publishedDate": "2017-05-31", "language": "en", "rating": 5}, {"id": 488065280, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d3139265-r488065280-Basilica_de_Santa_Maria_del_Pi-Barcelona_Catalonia.html", "text": "We saw this church during a tour but did not have time to go in. The tour guide suggested peeking in around the wall inside the front area and it looked pretty. It didn't seem crowded. It's named after the big pine tree out front. We enjoyed seeing a class of art students out front sketching the entrance of the building and rose window.", "publishedDate": "2017-05-26", "language": "en", "rating": 4}, {"id": 486046058, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d3139265-r486046058-Basilica_de_Santa_Maria_del_Pi-Barcelona_Catalonia.html", "text": "We visited Basilica de Santa Maria del Pi during an excursion booked through the Julia travels, this Basilica was so beautiful and with a good historical value.", "publishedDate": "2017-05-20", "language": "en", "rating": 4}, {"id": 483245239, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d3139265-r483245239-Basilica_de_Santa_Maria_del_Pi-Barcelona_Catalonia.html", "text": "Entering was like a time travel hundreds of years back, leaving the modern day busyness behind. I just sat down for a moment, walked around and left with a peace in mind. There would have been a guitar concert later that night that I unfortunately was not able to wait for, but I believe it would have been an even greater experience in such an ancient setting.", "publishedDate": "2017-05-10", "language": "en", "rating": 5}, {"id": 481887366, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d3139265-r481887366-Basilica_de_Santa_Maria_del_Pi-Barcelona_Catalonia.html", "text": "We happened to stumble upon this basilica whilst browsing the market.\nIt cost 4Eur entrance, it would have been 8Eur including a guide and entrance to the bell tower, if we were there during tour times which is 12, 1, 3 & 4 pm.\nI would like to return during one of these hours as there is not a lot of information about what you are seeing. \nIt is really beautiful and the attention to detail in the artwork is amazing. ", "publishedDate": "2017-05-05", "language": "en", "rating": 4}, {"id": 481778145, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d3139265-r481778145-Basilica_de_Santa_Maria_del_Pi-Barcelona_Catalonia.html", "text": "Largely forgotten by tourist, the basilica is fine example of early Gothic architecture. partially randsacked during Spanish civil war, it is again restaured (except burn-down wooden organ) and has small quite garden. Worthwhile to visit and escape the crowds.", "publishedDate": "2017-05-05", "language": "en", "rating": 4}, {"id": 481691860, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d3139265-r481691860-Basilica_de_Santa_Maria_del_Pi-Barcelona_Catalonia.html", "text": "This gothic church was one of two places I went in Barcelona that was not swarming with tourists.  There are prettier churches but it has historical value and it was great to go up in the tower (you must be fit and not afraid of heights or claustrophobic) but totally worth it. The guide (provided at the church as part of admission) was delightful and knowledgeable and the views from the top are awesome!  Highly recommend this stop.", "publishedDate": "2017-05-04", "language": "en", "rating": 5}, {"id": 481293475, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d3139265-r481293475-Basilica_de_Santa_Maria_del_Pi-Barcelona_Catalonia.html", "text": "Located in the Gothic Quarter. There is a visit fee, but it's worth it. \nInside is not very rich, but the tower and the building outside are interesting.", "publishedDate": "2017-05-03", "language": "en", "rating": 4}, {"id": 477589749, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d3139265-r477589749-Basilica_de_Santa_Maria_del_Pi-Barcelona_Catalonia.html", "text": "We were wandering around the area, followed the crowd, and found this church with a humming small market out front (it was a Saturday).\n\nNice, small basilica that just exuded age, with a nice little garden under the bell tower.", "publishedDate": "2017-04-20", "language": "en", "rating": 3}, {"id": 467975196, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d3139265-r467975196-Basilica_de_Santa_Maria_del_Pi-Barcelona_Catalonia.html", "text": "A 4 Euro fee will gain you entry to this architecturally simple but quietly elegant church in the heart of the Gothic Quarter in Barcelona.  There is a small plaza in front of the church for a view of its massive and relatively low to the ground circular stained glass window.  Inside the 2 long interior walls are separated by captivating chapel displays.  A small brochure on entry describes the contents of each.  Worth a 30 minute visit.", "publishedDate": "2017-03-16", "language": "en", "rating": 4}, {"id": 466916523, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d3139265-r466916523-Basilica_de_Santa_Maria_del_Pi-Barcelona_Catalonia.html", "text": "Elegant and intimate gothic church. Compact in size with high ceilings, an excellent place to sit, rest and meditate. ", "publishedDate": "2017-03-13", "language": "en", "rating": 5}, {"id": 463958586, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d3139265-r463958586-Basilica_de_Santa_Maria_del_Pi-Barcelona_Catalonia.html", "text": "I came here accidentally because I thought this was the Santa Maria by the sea cathedral. This is a smaller cathedral. It costs 4€ to visit and the people working the front entrance are a bit rude toward foreigners and prefer you not speak English. When I asked a question in English 2 of the workers including a bystander just look at me and give a look like huh?? While the bystander laughs and the bald guy working at the booth scoffs at me. I paid the entrance fee and visit this cathedral. It is beautiful and have no complaints about anything historical. You might like going to Santa Maria by the sea cathedral better as it is larger, illuminated better, may have better price features ( I think it's free during the day) and costs during the evening but you can visit while the choir is there and also take a rooftop tour for a fee. Been there done ✅ ", "publishedDate": "2017-03-01", "language": "en", "rating": 3}, {"id": 463827418, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d3139265-r463827418-Basilica_de_Santa_Maria_del_Pi-Barcelona_Catalonia.html", "text": "This unassuming church with its massive rose window is tucked away in the Gothic Quarter and almost catches you off-guard.  It's very simple and less of a tourist trap.  ", "publishedDate": "2017-03-01", "language": "en", "rating": 5}, {"id": 463566496, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d3139265-r463566496-Basilica_de_Santa_Maria_del_Pi-Barcelona_Catalonia.html", "text": "It:s important to visit the basilica to feel the history and to enjoy the ancient architecture.in Christmas period was very great to see.", "publishedDate": "2017-02-28", "language": "en", "rating": 5}, {"id": 461230850, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d3139265-r461230850-Basilica_de_Santa_Maria_del_Pi-Barcelona_Catalonia.html", "text": "Basilica de Santa Maria del Pi is a relatively unadorned gothic Church with a beautiful Rose Window and a lot of history.  \n\nI must highly recommend going on the guided tour.  You will get some insight into the history of the church and a trip to the top of the tower which, in my opinion, has the absolute best views of Barcelona.  Being in the Gothic Quarter, you get an intimate view of the city on all sides of you.  There are wonderful views from other high places (Sagrada Familia, Castel Montjuic), but this was the absolute best.", "publishedDate": "2017-02-19", "language": "en", "rating": 5}, {"id": 454202470, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d3139265-r454202470-Basilica_de_Santa_Maria_del_Pi-Barcelona_Catalonia.html", "text": "My wife & I stumbled upon this church after visiting Mercado de La Boqueria, and thought we were visiting the Catedral de Barcelona, which is a little further away. We didn't realize until the following day when we saw the correct one, so don't get confused like us.\n\nOn our visit, they were quite strict on the dress code (shoulders and knees covered), but luckily for us, I told my wife to bring something along to cover her shoulders just in case. Upon entry, you will see a small courtyard in the middle of the Cathedral like an island oasis with one of the towers in the background. The main area is peaceful and instantly calms you for the day ahead.\n\nIf you're already in the area then definitely worth a side trip here to visit.", "publishedDate": "2017-01-23", "language": "en", "rating": 4}, {"id": 451581025, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d3139265-r451581025-Basilica_de_Santa_Maria_del_Pi-Barcelona_Catalonia.html", "text": "The basilica is supposedly the oldest in the city. It is beautiful and full of power. The rose window is one of the biggest in the world. As a non-catholic, the favorite thing for me was that each chapel had a sign with a map that included the names of the saints and icons that are displayed. While many of the churches and cathedrals are full of awe, this one felt like the most people faced church we have been to in our Spain tour. \n\nOutside in the yard, there is a nice market that sells whine, cheese, chocolate, candles and other locally made goods. \n\nThe church offers guitar sessions at night and is a short walk from some of the nicest coffee shops and restaurants.", "publishedDate": "2017-01-12", "language": "en", "rating": 5}, {"id": 450280554, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d3139265-r450280554-Basilica_de_Santa_Maria_del_Pi-Barcelona_Catalonia.html", "text": "In a city with so many grand churches to visit, the Basilica de Santa Maria del Pi should be added to your itinerary.  The church is quaint with beautiful stained glass including its signature rose window.  Don't forget to get a picture of the church with the Pi - the pine tree!", "publishedDate": "2017-01-07", "language": "en", "rating": 4}, {"id": 449731340, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d3139265-r449731340-Basilica_de_Santa_Maria_del_Pi-Barcelona_Catalonia.html", "text": "My wife, two children and I visited Barcelona in December 2016 and January 2017.  I visited the Basilica de Santa Maria del Pi during a walk through the Gothic Quarter.  The entrance fee was 4 euros.  I was most impressed with the various statues along both walls.  I circled around and looked at each one carefully.  Outside the church are two interesting small plazas and then you can continue walking through the Gothic Quarter.", "publishedDate": "2017-01-05", "language": "en", "rating": 4}, {"id": 449694258, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d3139265-r449694258-Basilica_de_Santa_Maria_del_Pi-Barcelona_Catalonia.html", "text": "Beautiful basilica in the gothic tradition.  In the middle of a plaza with a pine tree (not the original).  A local market and several places to have coffee or food surround the plaza.  Worth the visit to the Gothic area of Barcelona.", "publishedDate": "2017-01-05", "language": "en", "rating": 5}, {"id": 448856205, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d3139265-r448856205-Basilica_de_Santa_Maria_del_Pi-Barcelona_Catalonia.html", "text": "The church is nestled away in the back streets of the gothic quarter. From the outside there is a beautiful market as well as pine trees and orange trees. \n\nWe paid an additional few euros to have the 40minute tour by a lady called Sofia. This was well worth the money as it gave us both history and the chance to walk the 260 steps up the top of the bell tower where the views were amazing. \n\nWord of caution: there are only stairs and no disabled access and the stairs are tiny and narrow. Also the tour only runs twice daily (12 and 13:00hrs) ", "publishedDate": "2017-01-03", "language": "en", "rating": 4}, {"id": 447892066, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d3139265-r447892066-Basilica_de_Santa_Maria_del_Pi-Barcelona_Catalonia.html", "text": "Attended an amazing Spanish guitar concert in this beautiful church over Christmas in Barcelona. Well worth a visit and worth every penny. Tickets were available on the door but we pre booked. Lovely small chapel next to the main church space. A great venue and a wonderful time had by all.", "publishedDate": "2016-12-30", "language": "en", "rating": 5}, {"id": 447263311, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d3139265-r447263311-Basilica_de_Santa_Maria_del_Pi-Barcelona_Catalonia.html", "text": "We see a sign for Cathedral and follow it . It is Basilica Santa Maria del Pi. This is where there are wonderful guitarists every night . So amazing .", "publishedDate": "2016-12-28", "language": "en", "rating": 5}, {"id": 445615977, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d3139265-r445615977-Basilica_de_Santa_Maria_del_Pi-Barcelona_Catalonia.html", "text": "Situated just outside the old walls of the gothic part of Barcelona, this is a stunning church with amazing architecture. Inside of the church is equally as beautiful with the most amazing rosetta, which is said to be one of the largest in Europe. Also interesting is the statics of the Basilica. There are stairs in the pillars to go up and so you have a gorgeous view. Well worth taking a look!!", "publishedDate": "2016-12-20", "language": "en", "rating": 5}, {"id": 443359029, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d3139265-r443359029-Basilica_de_Santa_Maria_del_Pi-Barcelona_Catalonia.html", "text": "It is a typical old building with old architectural work, 5 mins walking from the La Ramblas and around 5 mins to the Cathedral", "publishedDate": "2016-12-10", "language": "en", "rating": 3}, {"id": 443225897, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d3139265-r443225897-Basilica_de_Santa_Maria_del_Pi-Barcelona_Catalonia.html", "text": "Stunning place with a deep sense of history.  Dedicated in 1391, this medieval church gives you an incredible feeling of what life must have been like back then.  Side chapels are dedicated to the saints, some of which were parishioners.  Lively arts calendar, beautiful ambiance.  Probably my favorite stop in town. Will revisit.", "publishedDate": "2016-12-09", "language": "en", "rating": 5}, {"id": 441970476, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d3139265-r441970476-Basilica_de_Santa_Maria_del_Pi-Barcelona_Catalonia.html", "text": "It was lovely inside, amazing round stained glass window.  We seem to have missed the bell tower though.", "publishedDate": "2016-12-04", "language": "en", "rating": 3}, {"id": 439360013, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d3139265-r439360013-Basilica_de_Santa_Maria_del_Pi-Barcelona_Catalonia.html", "text": "We happened upon this Basilica by chance. Not much from the outside - typical gothic church. But inside is well worth the €8.50 we paid for the guided tour and trip up the tower. ( needs stamina - there are 260 steps in a spiral staircase that gets very narrow near the top). \nThe 360 degree views of Barcelona were amazing. \nOur guide was excellent and explained in detail the construction of the bell tower and how families lived in the tower until 1929. This was so the bells could be sounded every 15 minutes and then a melody at O' clock. I think people walk past this place - don't be one of them. Go in and enjoy. ", "publishedDate": "2016-11-22", "language": "en", "rating": 5}, {"id": 439342308, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d3139265-r439342308-Basilica_de_Santa_Maria_del_Pi-Barcelona_Catalonia.html", "text": "We went to the Basilica and what you be first to experience is how old the Church is. You just get that feeling when you enter it. We also bought tickets to the Spanish guitar performance they put on inside the church. It was a fantastic experience. There was only about 50 people so it was a very intimate setting.\nI would recommend \n", "publishedDate": "2016-11-22", "language": "en", "rating": 4}]}}]