[{"locationId": 2717850, "name": "Palau Dalmases", "placeType": "ATTRACTION", "reviewListPage": {"reviews": [{"id": 752796093, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d2717850-r752796093-Palau_Dalmases-Barcelona_Catalonia.html", "text": "Flamenco is so incredibly captivating, and the emotional performance at Palau Dalmases was no exception. I've seen a few flamenco performances including one of the most famous dancers in Spain, and I felt that this was the best performance I had seen. The musicians were very talented, particularly the guitarist  - surely the best around. With the location in the gothic quarter it makes a great place to wander before and after the show, and a glass of cava went perfectly with the experience.", "publishedDate": "2020-04-21", "language": "en", "rating": 5}, {"id": 749110038, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d2717850-r749110038-Palau_Dalmases-Barcelona_Catalonia.html", "text": "Passed by this place on a walking tour and came back for the 19.30 show. Powerful! Emotional! Great venue. I loved it.", "publishedDate": "2020-03-04", "language": "en", "rating": 5}, {"id": 748743430, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d2717850-r748743430-Palau_Dalmases-Barcelona_Catalonia.html", "text": "I happened by the entrance to Palau Dalmases on a walk around the Gothic district and thank goodness I did!  I purchased tickets online a few days before an evening performance and so grateful I did.  The ambience and performance was amazing and just what I wanted for my first Spanish Flamenco performance.  Small, great space, tons of energy and a passionate and fun performance.  The price is very affordable and includes a free drink.  All seats are good for the venue is small.  The performance is one hour so a great stop before you head out for dinner for the night. ", "publishedDate": "2020-03-02", "language": "en", "rating": 5}, {"id": 740488758, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d2717850-r740488758-Palau_Dalmases-Barcelona_Catalonia.html", "text": "We are first timers for flamenco show..the moment we stepped into the location we loved the ambience ;beautiful and intimate...\n    But what drew us the most is the passion and love of art by every artist present there and it was so evident from their performances...they were absolutely mesmerising...we would have loved  to watch them perform for  more time.one hour not enough to admire their talent...they were absolutely brilliant...\n\n    Thank you so much for fantastic evening...We would definately love to come back for another show and recomend it...", "publishedDate": "2020-01-21", "language": "en", "rating": 5}, {"id": 735322210, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d2717850-r735322210-Palau_Dalmases-Barcelona_Catalonia.html", "text": "We noticed this place just passing by from the  street because of its grand and historic setting.  The combination of the music and dancing was so  passionate and kept us spellbound.   It was also reasonably priced for what was offered.  The show lasted about an hour and we left with a bigger appreciation of this cultural gem.", "publishedDate": "2019-12-29", "language": "en", "rating": 5}, {"id": 733370668, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d2717850-r733370668-Palau_Dalmases-Barcelona_Catalonia.html", "text": "I am always somewhat leery of such performances, as being too touristy, but I was limited on time, so I went to see it. The performance was excellent. Technically, the singing, dancing and music was brilliant. What surprised me was the emotion that they put into it. The dancers, singers and musicians were really into it, both while performing and while in the background.", "publishedDate": "2019-12-18", "language": "en", "rating": 5}, {"id": 730658046, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d2717850-r730658046-Palau_Dalmases-Barcelona_Catalonia.html", "text": "It was my first time to attend a flamenco show. They really dance so well, I liked the place a lot, the music was just perfect!\nThe variety of drinks wasn’t so good, there wasn’t much to choose from. Also I think the tickets a little bit overpriced. ", "publishedDate": "2019-12-04", "language": "en", "rating": 4}, {"id": 730247958, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d2717850-r730247958-Palau_Dalmases-Barcelona_Catalonia.html", "text": "This is exactly what I was hoping for in a Tablao Flamenco show. This is located in a beautiful hidden building. The setting was very intimate and the show itself was exhilarating. The musicians, singer and dancers were extremely talented. Loved every minute of it and would go again in a future visit! Ole!", "publishedDate": "2019-12-02", "language": "en", "rating": 5}, {"id": 728443169, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d2717850-r728443169-Palau_Dalmases-Barcelona_Catalonia.html", "text": "Yes, and a very good one too. It sometimes sparkled on the floor. But best of all; song, empathy and strength.The rythm too. Enjoy, I did. ", "publishedDate": "2019-11-23", "language": "en", "rating": 4}, {"id": 726809514, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d2717850-r726809514-Palau_Dalmases-Barcelona_Catalonia.html", "text": "We searched for a good place for flamenco in Barcelona and this one seemed very real and authentic. It’s located next to the Picasso museum and has a beautiful space, worth visiting and admiring on its own. We bought tickets about 5 days in advance, but our friend got a single ticket the last minute (same evening) and it was fine. When we arrived, the seats were already distributed. I was very happy about sitting in the first row. I like taking pictures and recording and also being close to the performers. But I think even in the third row it’s totally fine. It’s a very intimate space, with small stage and about 30 people in the audience. At the bar you are allowed to grab one free drink (the choice is between red and white wine, sangria and cava). Then you can buy more drinks during the intermission. The show was an hour (think of one set at the jazz club). All musicians/performers were amazing and very characteristic. There were a guitar player, two singers and two flamenco dancers. It was my first flamenco show and I was very impressed. We all loved it! The skills, the passion!!! It was fantastic and I’m very glad we had this experience on our first day. I would definitely love to attend more flamenco performances when I’m in Spain again! ", "publishedDate": "2019-11-16", "language": "en", "rating": 5}, {"id": 722306681, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d2717850-r722306681-Palau_Dalmases-Barcelona_Catalonia.html", "text": "Amazing effort from the dancers in a small casual place!!! The price is €25 with a drink and it’s worth watching it even more than one time!! If I had more days there I would surly have done it again!!! Just don’t miss it...!!!", "publishedDate": "2019-10-29", "language": "en", "rating": 5}, {"id": 719033901, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d2717850-r719033901-Palau_Dalmases-Barcelona_Catalonia.html", "text": "The dancers and the musicians are  fine, the location is great too.\nBut the show is short and the people behind the bar stopped lighting candles and smile at people a long time ago.\nIt lloks and feels like a tourist thing.", "publishedDate": "2019-10-16", "language": "en", "rating": 3}, {"id": 717975016, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d2717850-r717975016-Palau_Dalmases-Barcelona_Catalonia.html", "text": "I was at a flamenco show here on my birthday. It was the most beautiful gift. If you arrive in Barcelona, ​​this is a must! They are extraordinary!", "publishedDate": "2019-10-13", "language": "en", "rating": 5}, {"id": 717435997, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d2717850-r717435997-Palau_Dalmases-Barcelona_Catalonia.html", "text": "This is the real deal. Emotionally charged and full of talent it is hard to pick a stand out act from this incredible performance. \n\nListen to trip advisor. Book in advance and this will be the highlight of your Barcelona experience. \n\nOne drink is included in the price. This is not limited to wine it includes cava, beer and a glass of sangria. \n\nBeautiful venue which is very atmospheric and not crammed full of people. Don't look any further for a flamenco show.", "publishedDate": "2019-10-11", "language": "en", "rating": 5}, {"id": 717204223, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d2717850-r717204223-Palau_Dalmases-Barcelona_Catalonia.html", "text": "We went there to experience a traditional flamenco show on my wive's birthday. And we were not disappointed. We sat right in front in the middle. We couldn't asked for better. The dancers were unbelievable good, and the musicians, especially the guitar player, was just as good. An evening we shall never forget.", "publishedDate": "2019-10-10", "language": "en", "rating": 5}, {"id": 716145365, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d2717850-r716145365-Palau_Dalmases-Barcelona_Catalonia.html", "text": "This was the first event we booked in Barcelona and we weren’t disappointed. The dancers, musicians and singers were very talented. One free drink came with our reservation. We really enjoyed the performance.", "publishedDate": "2019-10-07", "language": "en", "rating": 5}, {"id": 715180540, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d2717850-r715180540-Palau_Dalmases-Barcelona_Catalonia.html", "text": "No visit to Barcelona would be complete without a Flamenco show...! Musicians and dancers were extremely entertaining and we didn’t want it to be over in an hour. You get a drink with your ticket.", "publishedDate": "2019-10-04", "language": "en", "rating": 4}, {"id": 713484724, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d2717850-r713484724-Palau_Dalmases-Barcelona_Catalonia.html", "text": "Old small palace to see only when there is Flamengo shows playing. We actually started our Barcelona stay with the dinner Flamengo show which put us really in the spanish mood( the first glass of wine included in the price also helped)", "publishedDate": "2019-09-27", "language": "en", "rating": 4}, {"id": 713112732, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d2717850-r713112732-Palau_Dalmases-Barcelona_Catalonia.html", "text": "In the beginning I was a little afraid about a one hour show, I thought that it's too long. But in the end I'm glad we went, I didn't feel the time pass and I enjoyed very much. The singer and guitar player were great and the dancers were amazing. Also it's a very beautiful place and the show felt intimate. Recommended!", "publishedDate": "2019-09-26", "language": "en", "rating": 5}, {"id": 711234351, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d2717850-r711234351-Palau_Dalmases-Barcelona_Catalonia.html", "text": "I can’t say I was too excited when the missus booked us to go to the show, but fair play I was impressed. I thought I would be some cheesy tourist trap, and well, it was full of tourists, but the performers were top class, really looked like they cared and were enjoying themselves. They had the crowd (and me) on their feet at the end. ", "publishedDate": "2019-09-19", "language": "en", "rating": 5}, {"id": 710416525, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d2717850-r710416525-Palau_Dalmases-Barcelona_Catalonia.html", "text": "Definitely recommend. A great environment and talented dancers and musicians - really overwhelming. A really casual yet chic setup. Would return again and again.", "publishedDate": "2019-09-16", "language": "en", "rating": 5}, {"id": 708853425, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d2717850-r708853425-Palau_Dalmases-Barcelona_Catalonia.html", "text": "Located in a very old building (castle) opposite the Picasso Museum. Very intimate setting. Less than 100 seats. All seats have a good view of the show. The show was excellent. Great dancing and singing. Also great Spanish guitar and percussions. We had front row seats. We had to keep an eye on our drinks as we were so close to the stage, afraid the  vibrations might knock over our drinks!!!Highly recommended. One of the highlights of our time in Barcelona. ", "publishedDate": "2019-09-11", "language": "en", "rating": 5}, {"id": 706513629, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d2717850-r706513629-Palau_Dalmases-Barcelona_Catalonia.html", "text": "A memorizing experience. Palau Dalmases is a really cool venue, located in the heart of the neighborhood of Born, Barceleona. A lot of interesting shops and restaurants nearby so it's a perfect way to compliment your Born experience. We had front row seats. You could feel the energy of the performers in your soul. They are very talented flamenco dancers who know how to put on a show. The cost of the ticket comes with a drink as well which was a nice touch.", "publishedDate": "2019-09-04", "language": "en", "rating": 5}, {"id": 706066581, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d2717850-r706066581-Palau_Dalmases-Barcelona_Catalonia.html", "text": "We reserved its 6pm show and were sat front and center. Five performers:guitarist, drummer, two dancers and a singer. All passionate , athletic and talented. \nWe began afternoon at the Antonio Gaudi houses and block of discord. Walked to (time ticketed entry) Picasso Museum. Enjoyed tapas at a nearby adjacent restaurant. Entered and entertained at nearby Palau Dalmases. (Just across from Picasso). \nBTW suggest using  laptop for both Picasso tickets and Palau Dalmases tickets-websites from mobile phones not completing payment cycle. ", "publishedDate": "2019-09-03", "language": "en", "rating": 5}, {"id": 703604264, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d2717850-r703604264-Palau_Dalmases-Barcelona_Catalonia.html", "text": "Highly recommend a visit to this show while in town. Well priced and Drink included. The performance is phenomenal and full of feeling! A little bit of Spain! ", "publishedDate": "2019-08-27", "language": "en", "rating": 5}, {"id": 703578595, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d2717850-r703578595-Palau_Dalmases-Barcelona_Catalonia.html", "text": "This wonderful evening starts with a dark side street to an unimposing door way... step through to an open court yard and then youre escorted to your seat in a small theatre, maybe only 75 seats so initmate and perfect for this type of event...... its a noblemans house from 1600's and is perfect for this amazing evening of entertainment... amazing venue!\n\nTickets are not expensive but we booked a few weeks in advance and were seated front row centre... perfect ... so close we could feel the artists breath... free drink in price of the ticket ...\n\nGuitarist, box drum, signer and two dancers... almost two hours of entertainment and every moment incredible.\n\nThe passion, the authenticity the depth of the wonderful performance .. not speaking fluent spanish had very little idea what the singer was saying but the combination of his voice the musicians and the emotion of the dancers took our breath away.\n\nIf I had one adjustment .. Id have someone to briefly introduce each piece just to say in one paragraph what each piece is about ... I know they dont in Opera by comparison but the stories gernally well know ... but these pieces are so emotional it would be great to just add that extra layer to the passion.\n\nSimply wonderful... if you do nothing else in Barcelona ...make time for ths!", "publishedDate": "2019-08-27", "language": "en", "rating": 5}, {"id": 702977325, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d2717850-r702977325-Palau_Dalmases-Barcelona_Catalonia.html", "text": "This was the best night in Barcelona. The Flamenco show was outstanding! We sat in the first row and you could feel the intensity and emotion of the dancers. The singer and guitarist were terrific also. The quality of the show, the intimacy of the theatre, the wine, the beautiful entrance to the theatre, and the price were awesome for what we got! I will never forget this wonderful night in Barcelona with my husband. It was a night we will always remember. Thank you all for the wonderful performances. Get tickets in advance to be sure you get the date and time you would like. You won't regret it.", "publishedDate": "2019-08-25", "language": "en", "rating": 5}, {"id": 702286692, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d2717850-r702286692-Palau_Dalmases-Barcelona_Catalonia.html", "text": "The music was spectacular, dancing absolutely stunning. The presence of many locals showed that it’s not aimed at tourists per se. Really worth every penny - if you want something to remember for a whole, it’s a must to go there. We went for the 9.30pm show. The venue itself is old fashioned, located in the Gothic district, and gives a really cool vibe!", "publishedDate": "2019-08-23", "language": "en", "rating": 5}, {"id": 699342038, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d2717850-r699342038-Palau_Dalmases-Barcelona_Catalonia.html", "text": "Terrific Flamenco show. We all loved it. The tickets include the price of a drink and there are fabulous restaurants nearby. ", "publishedDate": "2019-08-15", "language": "en", "rating": 5}, {"id": 698005896, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d2717850-r698005896-Palau_Dalmases-Barcelona_Catalonia.html", "text": "How can one review this show: stunning? Pure joy? Pure raw emotion? Pure raw talent?\nYes and more.\nThe 5 artists on stage : 2 dancers, on singer, one drummer, one guitarist are so talented. Able to transmit their deep emotions in the music, voice or dance. Totally immersed in their art and their feelings, they transmit so much to the public in a sheer display of passion, strength, vulnerability, sorrows and rage.\nThe show is in a very old house, on a small stage in a quaint room. \nIt feels we are at least a century back. \nYet the emotions felt were current and brought us to tears, and smile and awe and cheers and goosebumps.\nA fantastic display of what Andalucia unique art form, the flamenco, is.\nHighly recommend!!!!", "publishedDate": "2019-08-11", "language": "en", "rating": 5}, {"id": 696445805, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d2717850-r696445805-Palau_Dalmases-Barcelona_Catalonia.html", "text": "Excellent show, very talented musicians and dancers. Would definitely recommend to anyone visiting Barcelona who wants to experience some culture!", "publishedDate": "2019-08-07", "language": "en", "rating": 5}, {"id": 693894670, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d2717850-r693894670-Palau_Dalmases-Barcelona_Catalonia.html", "text": "The performance was outstanding.  Totally enthralling.  The location was hard to find.  The sangria was colorful sprite rather than sangria but we were there for the show, not the alcohol.  If you want to experience flamenco dancing, I recommend visiting Palau Dalmases.", "publishedDate": "2019-07-29", "language": "en", "rating": 4}, {"id": 692177255, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d2717850-r692177255-Palau_Dalmases-Barcelona_Catalonia.html", "text": "Fabulous, intimate, entertaining energetic!  Power failed half way through plunging us into darkness, they just asked us all to shine our mobile phones at them and carried on - added to the atmosphere!\nUnmissable evening", "publishedDate": "2019-07-23", "language": "en", "rating": 5}, {"id": 690997873, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d2717850-r690997873-Palau_Dalmases-Barcelona_Catalonia.html", "text": "Very authentic. 1 hour show. A great taste of real flamenco. Close to the stage able to see everything.  Good bar too. Only 25 Euro.", "publishedDate": "2019-07-19", "language": "en", "rating": 5}, {"id": 690994746, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d2717850-r690994746-Palau_Dalmases-Barcelona_Catalonia.html", "text": "This is a small venue, just right for this amazing show.  We thoroughly enjoyed, and was well worth the price.  ", "publishedDate": "2019-07-19", "language": "en", "rating": 5}, {"id": 689939980, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d2717850-r689939980-Palau_Dalmases-Barcelona_Catalonia.html", "text": "a fun place, show just one hour, but well done, tastefully, enjoyable, small venue so all seats are good, good price and it comes with a drink.  Very authentic, all that is needed.", "publishedDate": "2019-07-15", "language": "en", "rating": 5}, {"id": 688657970, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d2717850-r688657970-Palau_Dalmases-Barcelona_Catalonia.html", "text": "I cannot say enough about the show, the performers, the space, the music...the hair was standing up on the back of my neck. I booked well in advance and got seated on the front row. My table was touching the stage, and the vibration from the dancers was so strong, my drink flew off, hit the floor and shattered! Amazing. Can’t say enough. ", "publishedDate": "2019-07-11", "language": "en", "rating": 5}, {"id": 687937421, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d2717850-r687937421-Palau_Dalmases-Barcelona_Catalonia.html", "text": "We happened to walk by the building and were intrigued by the decor. We saw that they had flamenco show performances and decided to try it out. We are very glad that we did. The dancers were passionate and very talented. The guitarist, vocalist, and drummer were as well. Thoroughly enjoyed our experience watching these talented individuals. Worth a visit during your trip to Barcelona! ", "publishedDate": "2019-07-08", "language": "en", "rating": 5}, {"id": 687154683, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d2717850-r687154683-Palau_Dalmases-Barcelona_Catalonia.html", "text": "One of the best dance shows I’ve seen! Amazing performance all round, passionate and intimate. I will be coming back for more and recommending to all I know! ", "publishedDate": "2019-07-06", "language": "en", "rating": 5}, {"id": 686815234, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d2717850-r686815234-Palau_Dalmases-Barcelona_Catalonia.html", "text": "The show was well done. Although, there are much better flamenco shows in Barcelona. The show had no standout performances that wowed me and therefore was not special. At the end, the 2 main dancers had a kid come up and dance but this was staged at the end.", "publishedDate": "2019-07-04", "language": "en", "rating": 3}, {"id": 686548966, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d2717850-r686548966-Palau_Dalmases-Barcelona_Catalonia.html", "text": "I was a little skeptical about going to see a dance show but was very pleasantly surprised. Not only was the dancing impressive but the guitarist was amazing! Really incredible musicianship and there were times they just let he, the singer and the percussionist play without the dancers. Definitely worth the price of admission.", "publishedDate": "2019-07-03", "language": "en", "rating": 5}, {"id": 684354161, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d2717850-r684354161-Palau_Dalmases-Barcelona_Catalonia.html", "text": "My wife and I attended our first Flamenco show at Palau Dalmases and it was great. The building itself was great to walk around and see and then the show was extremely entertaining. It is amazing how quickly the dancers can move their feet and the singing and guitar to back it up makes the show complete. ", "publishedDate": "2019-06-25", "language": "en", "rating": 5}, {"id": 684303993, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d2717850-r684303993-Palau_Dalmases-Barcelona_Catalonia.html", "text": "Booked this in advance (use your laptop as website wasn’t phone / tablet friendly) based on reviews on Timeout & Trip Advisor and we weren’t disappointed, it was absolutely brilliant!  It’s not at all gimmicky it feels real, passionate, intimate, emotional & thoroughly entertaining from start to finish.  The energy the performers have is immense & completely captivated the entire audience.  \nThe venue is a little gem, it feels special as soon as you walk in.  The ticket included a drink which was a bonus & we were shown where our seats were, but were free to walk around the venue & courtyard as we wished prior to the show beginning.  With shows like this, once you’ve seen one you perhaps feel as if you’ve seen them all but when I visit Barcelona again, I’ll be booking a ticket here again that’s for sure!  ", "publishedDate": "2019-06-25", "language": "en", "rating": 5}, {"id": 684091857, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d2717850-r684091857-Palau_Dalmases-Barcelona_Catalonia.html", "text": "The venue was lovely and intimate. It’s in the cellar of an old 17th century mansion which gives the whole performance an air of intrigue. The performers are amazing and I was entranced by the dancing and music. Literally gave me chills! If you’ve seen a lot of flamenco (like myself) or this is your first time (like my husband), it won’t disappoint.\n\nPS - It’s right by the Picasso museum so it’s super easy to get to!\n", "publishedDate": "2019-06-24", "language": "en", "rating": 5}, {"id": 682998920, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d2717850-r682998920-Palau_Dalmases-Barcelona_Catalonia.html", "text": "I was so excited to find this show. So many Flamenco shows include drinks and meals, and thus are pretty pricey. I didn’t want a mediocre meal and a pitcher of sangria- I just wanted to see the dancing. This show was very reasonably priced, and included one drink each (really, all you need). The dancers did a fantastic job, and even my husband who is not into this stuff just loved it. \n\nI booked our tickets online, which you don’t have to do because they had plenty of seating, but we got THE BEST seats in the house by doing this. Right in front of the stage, dead center. I actually worried about getting splashed with the dancer’s sweat- that’s how close we were. \n\nIntimate, powerful, beautiful- an amazing experience in Barcelona.", "publishedDate": "2019-06-20", "language": "en", "rating": 5}, {"id": 682158514, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d2717850-r682158514-Palau_Dalmases-Barcelona_Catalonia.html", "text": "Only one female Dancer and one Male dancer ...then a lot of filler moments ,like guitar playing to put us to sleep !! Very disappointed.....", "publishedDate": "2019-06-17", "language": "en", "rating": 2}, {"id": 681994702, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d2717850-r681994702-Palau_Dalmases-Barcelona_Catalonia.html", "text": "We did not regret booking this show. I have read from previous reviews that the show is intense with a lot of heart and with limited amount of seating space thus ensuring you of a good viewing experience. And indeed it was!!\n\nShow can be described as short perhaps 50mins excluding pause, but intense!! Both singers dancers performed intensely, the dancers were really sensual in their moved and we were all engaged (including my 11 year old son!!) in the show!\n\nA drink (wine, sangria, soft drink etc) is also included, highly recommended for a taste of real flamenco experience!\n\nTIP: Try to join this with a Saturday evening Sardana dance viewing in front of the nearby cathedral of Barcelona!", "publishedDate": "2019-06-16", "language": "en", "rating": 5}, {"id": 681207066, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d2717850-r681207066-Palau_Dalmases-Barcelona_Catalonia.html", "text": "Great passion, singing, music and performance. \nIntimate place, not more than 50 people. 1 hour of pure Spanish folklore.\nThe dancer woman really makes an impression - So powerful and into the dance, really remarkable.", "publishedDate": "2019-06-13", "language": "en", "rating": 5}, {"id": 680897808, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d2717850-r680897808-Palau_Dalmases-Barcelona_Catalonia.html", "text": "A must see experience in Barcelona: great passion, music and performance. The 2 dancers and 3 musicians really looked professionists, trying hard for one hour to make the show an unforgetable one. \nIf you want to stay in the front line, just inches from the stage, you should book early.", "publishedDate": "2019-06-11", "language": "en", "rating": 5}, {"id": 677704619, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d2717850-r677704619-Palau_Dalmases-Barcelona_Catalonia.html", "text": "Definitely must see! Great passion, music and performance. Enjoyed the show very much! The building where it is location is cool too. It is located in the Gothic quarter right next to the Picasso museum (same little street).", "publishedDate": "2019-05-30", "language": "en", "rating": 5}, {"id": 672362315, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d2717850-r672362315-Palau_Dalmases-Barcelona_Catalonia.html", "text": "My wife and I visited Yesterday and we were not disappointed.\nIntimate venue and a stunning show. We never knew how engaging and emotional Flamenco was until now.\nAn absolute must.", "publishedDate": "2019-05-07", "language": "en", "rating": 5}, {"id": 671627128, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d2717850-r671627128-Palau_Dalmases-Barcelona_Catalonia.html", "text": "The show takes place inside the courtyard of an old palace. This is a perfect intimate venue for Flamenco. The guitarist and dancers were excellent! The palace is located very near the entrance of the Picasso Museum. We came for a 9:30pm show drinks only no dinner. The cost was only $25euro with one drink included. There was great value for the money. I would highly recommend this venue for a Flamenco show while in Barcelona!\n\nGREAT VALUE FOR", "publishedDate": "2019-05-05", "language": "en", "rating": 5}, {"id": 671557075, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d2717850-r671557075-Palau_Dalmases-Barcelona_Catalonia.html", "text": "Beautiful atmosphere and traditional flamenco dancing.  You get a drink included for the 25 euros and pick your seats.  Only comment would have like more dancing", "publishedDate": "2019-05-05", "language": "en", "rating": 4}, {"id": 671552548, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d2717850-r671552548-Palau_Dalmases-Barcelona_Catalonia.html", "text": "Good intimate show with a central location. The main dancer was fabulous! Don't arrive too early unless you have more shopping to do as they don't let you in earlier than 10 minutes or less.  The theater/venue is gothic in style and very beautiful taking you to another time.  You enter through a pretty courtyard and the stage itself is small with seating for a small group of 30-40 people I think.  Our ticket came with a sangria and although I'm not a huge drinker the drink was really great!  We very much enjoyed the show.  ", "publishedDate": "2019-05-05", "language": "en", "rating": 5}, {"id": 670425177, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d2717850-r670425177-Palau_Dalmases-Barcelona_Catalonia.html", "text": "You can book to see Flamenco or an Opera ensemble (Opera only on a Thursday) It was our 1st time to see an Opera ensemble so had no idea what to expect- I won't give too much away but the setting is fantastic, intimate . Tip-you will need a map to find it and that is part of the fun . I never want to see another Opera again in-case it doesn't live up to this experience! Book your tickets online and the price includes a drink (decent wine) the venue is exquisite and personal. We were the last to leave and as we walked away the big wooden doors closed and as we looked back there were no signs of what we had just witnessed -Fab \n", "publishedDate": "2019-04-30", "language": "en", "rating": 5}, {"id": 670219631, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d2717850-r670219631-Palau_Dalmases-Barcelona_Catalonia.html", "text": "The venue for this show is amazing, great architectural design and historic look.  The show itself was very good in my opinion, though I have never been to a Flamenco show before so I don't have anything to compare it to.  The price was about €18 or so and it included a drink.  The dancers and instrument players were great.  I would recommend this to anyone in the area.", "publishedDate": "2019-04-29", "language": "en", "rating": 4}, {"id": 668749005, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d2717850-r668749005-Palau_Dalmases-Barcelona_Catalonia.html", "text": "We wound up going twice it was so good ! There is not a bad seat in this small venue which puts you right up close to the dancers, musicians and singer. Every show is different depending on the night and vibe.  Like stepping back in time when you enter the doors and are surrounded by old paintings and furntiure sitting in an old and grand palace. Not to be missed on your trip to Barcelona !", "publishedDate": "2019-04-23", "language": "en", "rating": 5}, {"id": 667447558, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d2717850-r667447558-Palau_Dalmases-Barcelona_Catalonia.html", "text": "This was an exceptionally authentic experience that gave me a glimpse of flamenco culture complete with guitar, singing, and dancing. Flamenco is like blues music, and the intimate venue inside the gothic quarter really helped accentuate what this music means for people. The 1-hour performance here was one of my favorite experiences in Barcelona - it flew by and I highly recommend it!\n\nNot sure if the performers rotate, but the 2 dancers and 3 musicians (incl 1 singer) really looked like they were enjoying themselves, were actively encouraging each other on challenging pieces, and appeared serious about their craft. \n\nSnobs will say flamenco should only be enjoyed in Andalucia, but this is probably as good as it gets if you’re a tourist visiting Barcelona for a short trip.\n\nDon’t mind the odd eventbrite page with bad English translations, booking early could mean sitting a foot away from the stage and that was an awesome experience for us!", "publishedDate": "2019-04-18", "language": "en", "rating": 5}, {"id": 665139148, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d2717850-r665139148-Palau_Dalmases-Barcelona_Catalonia.html", "text": "This is a smaller venue in the El Born area.  It was a few blocks from our hotel, it was near the Picasso Museum. It was 25 euros, so the price was reasonable.  If you have never seen a flamenco show you should take this in.  It is a quaint atmosphere in an area of town that has lots of places to eat after the show.  Narrow Streets, small shops good restautants.  What more could you ask for", "publishedDate": "2019-04-09", "language": "en", "rating": 5}, {"id": 664422896, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d2717850-r664422896-Palau_Dalmases-Barcelona_Catalonia.html", "text": "We enjoyed a stunning evening at Palau de Dalmases on Friday 5th April. The building itself is stunningly beautiful and is very atmospheric. The show began at 9.30pm (other shows earlier in the evening are available). The cost of admission incudes one drink (alcoholic or soft drink - we had a glass of Cava and a glass of Rioja). The flamenco show consisted of a singer, a flautist, a guitarist and a percussionist who played some kind of percussion wooden box. All of these were incredible. There were two dancers - one male and one female. Both dancers were amazing and very intense. There are other flamenco shows in Barcelona, some of which have the option of food too but we were extremely happy with our choice - the venue, music and dancers were all incredible. My phone died just before the show so I've only included one picture of the building. ", "publishedDate": "2019-04-07", "language": "en", "rating": 5}, {"id": 662590662, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d2717850-r662590662-Palau_Dalmases-Barcelona_Catalonia.html", "text": "We ended up here from a Air BnB booking.\n\nOur show included one free drink.   9pm show.\n\nAwesome venue.  Same street as the Picasso Museum.  \n\nGood time.  Heck what can I say.  Very serious performance.  No idle chitchat, or introductions.  Great performance.  \n\nHighly recommend.  Hey you can go out every night and get tapas.  You should totally check this out.  It will give you something else to check out vs doing the same thing every night~", "publishedDate": "2019-03-31", "language": "en", "rating": 5}, {"id": 662320580, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d2717850-r662320580-Palau_Dalmases-Barcelona_Catalonia.html", "text": "Just had a breathtaking hour of Flamenco dancing and singing in this atmospheric baroque building.  Lucky enough to be on the front row, to enjoy the intimate experience of a passionate display of musicianship, vocals, cajon and,  of course, skillful dancing by two female dancers.  A thoroughly enjoyable, and good value, hour of this exciting art form - bravo to all of the performers!", "publishedDate": "2019-03-30", "language": "en", "rating": 5}, {"id": 661518500, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d2717850-r661518500-Palau_Dalmases-Barcelona_Catalonia.html", "text": "My husband and I attended an 11PM opera performance here. Not sure if opera is just not as popular with tourists in Barcelona or if it was due to the late hour but we ended up being the only 2 people in attendance. Though I initially felt somewhat awkward, the performers were completely professional. And it actually turned out to be the most memorable experiences we had in Barcelona. We heard a wonderful rendition of O Mio Babbino Caro as well as some of the more popular selections from Don Giovanni and Carmen. The unexpected private performance was ultimately a lovely experience for us, and we ended up both liking it much better than a different performance that we went to at the more famous Palau de la Musica.", "publishedDate": "2019-03-26", "language": "en", "rating": 5}, {"id": 661501392, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d2717850-r661501392-Palau_Dalmases-Barcelona_Catalonia.html", "text": "There are at least 6 different Flamenco shows to choose from in the area.  The woman at the ticket booth on Ramblas said she would choose this one, as did our guide from the Dali day trip. I picked this one, the earliest show at 6pm with a drink ticket.  It's a little walk from the Ramblas with mostly high rise (but charming) buildings a long the way, be sure and stop for a moment and check out the Veterinary Hospital exterior....anyway, it's easy to walk right by the venue and the ticket counter just inside is not much to look at but go inside!  There is a large room with video playing a history of Flamenco, very interesting!  Then two beautiful young dancers come out and give you a little flamenco lesson!  Once inside there are long banquet table and comfortable chairs. The place is obviously very very old and could use a little sprucing up but that does NOT matter once the show starts!  As I was waiting a lovely family from Azerbaijan invited me to sit with them (better center seats) and share their meal!! How amazing!!  One of the joys of solo travel.  Therefore, I can tell you that the food is good as well as the Sangria! It was especially great because they do charge for water and considerate it your one beverage...fully hydrated, the show began...\nThere are Spanish guitar players, a violinist, two singers in the back of the stage. The main dancers that I had the joy of watching were 3 principal female dancers, 2 male dancers and another solo female performer.  The pace is fast and very exciting!  Obviously these performers are at the top of their profession.\nThe solo woman actually brought me to tears, and let's be clear I do not speak the language. If you are familiar with the Gipsy Kings the music will be right up your alley.\nAs someone who works in the arts I truly appreciated the talent and energy of the performers and the history lesson.  I obviously made the right choice!", "publishedDate": "2019-03-26", "language": "en", "rating": 5}, {"id": 660882851, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d2717850-r660882851-Palau_Dalmases-Barcelona_Catalonia.html", "text": "If you want a quick taste of Spanish guitar and flamenco, this venue is lovely and intimate and it was good value, frankly.  However, i was a bit disappointed in the flamenco.  The male dancer was very good and had high energy but the female dancer tired quickly.  I have actually seen better dancing in Toronto!", "publishedDate": "2019-03-24", "language": "en", "rating": 4}, {"id": 660606964, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d2717850-r660606964-Palau_Dalmases-Barcelona_Catalonia.html", "text": "I didn't expect to enjoy this as much as I did, but the performers were talented and charming.  The group's enthusiasm was infectious, especially the female dancer, who was so passionate, it was wonderful.  Yes, the show was a bit short, but I enjoyed every minute.  For 25 euro, a good value.", "publishedDate": "2019-03-23", "language": "en", "rating": 4}, {"id": 659901557, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d2717850-r659901557-Palau_Dalmases-Barcelona_Catalonia.html", "text": "I always go there to see flamenco when in Barcelona. The building is absolutely beautiful and the atmosphere is very authentic as is the show itself.\nit is quite small so has intimate and cosy feel to it, no big crowds and no tourists just sitting down and eating through the show.\nadvance booking recommended.", "publishedDate": "2019-03-20", "language": "en", "rating": 5}, {"id": 659665050, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d2717850-r659665050-Palau_Dalmases-Barcelona_Catalonia.html", "text": "It was Ok but if I could I would have bought the tickets to a different one. The only good performer was the singer. The guitar player was average. The dancers were a bit vulgar.", "publishedDate": "2019-03-19", "language": "en", "rating": 3}, {"id": 659327960, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d2717850-r659327960-Palau_Dalmases-Barcelona_Catalonia.html", "text": "The outside of the building hides a true Gothic gem inside. The 'theatre' is small and atmospheric, a room with three rows of comfortable chairs facing a small stage. There were 5 performers; the Spanish guitar, percussionist and singer with two dancers - one female and one male. All passionate and talented in their respective crafts. The show was mesmerising and we all left having experienced something uniquely Catalan.", "publishedDate": "2019-03-18", "language": "en", "rating": 5}, {"id": 658912450, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d2717850-r658912450-Palau_Dalmases-Barcelona_Catalonia.html", "text": "Really unique experience. I think we were expecting more of a theater type show, but the performance takes place in a large room with about 5-6 rows of seats and a small stage where the music and dancing happens. I booked the tickets online and upon arrival, we were surprised (in a good way) to find we were seated on the front row. There’s no introduction or explanation of what’s happening. If you need the context, it’s probably better to book a tour guide that can give you more information. There were three musicians (guitar, percussion and vocal) and two dancers that performed. It was exciting to watch and they were all extremely talented and passionate about the art of Flamenco. I took my two teen daughters and, while it wasn’t their favorite style of music or dance, they appreciated the talent and passion of the performers. ", "publishedDate": "2019-03-16", "language": "en", "rating": 5}, {"id": 658455127, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d2717850-r658455127-Palau_Dalmases-Barcelona_Catalonia.html", "text": "One of the famous & very traditional shows in Barcelona. It was different & well & enthusiastically performed 👍🏼", "publishedDate": "2019-03-14", "language": "en", "rating": 5}, {"id": 653987606, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d2717850-r653987606-Palau_Dalmases-Barcelona_Catalonia.html", "text": "Great introduction to Flamenco. Venue is in a fantastic space.  Guitar player, drummer, singer and dancers are very talented.  Would highly recommend for travelers of all ages that want to see this Spanish art.", "publishedDate": "2019-02-21", "language": "en", "rating": 5}, {"id": 652274302, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d2717850-r652274302-Palau_Dalmases-Barcelona_Catalonia.html", "text": "Absolutely loved the show. Its one of those things you should do when you're in Barcelona. Palau Dalmases will not disappoint if jus wanna have a good time.", "publishedDate": "2019-02-13", "language": "en", "rating": 5}, {"id": 651856800, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d2717850-r651856800-Palau_Dalmases-Barcelona_Catalonia.html", "text": "Gosh, I got very lucky when I saw this show a few weeks ago, while in Barcelona. By your tickets online, website is in Spanish but you can download the Google translate app on your phone, god your phone up to the website and hit  the camera button in Google Translate! Voile! You can translate the website from Spanish to English. Print out your tickets. Now, for the show. AMAZING!!! A trio of musicians, guitar, singing, stomping, clapping and oh,my goodness - amazing singing. As they sang, there were 2 Flemenco dancers that interpreted the songs through dance. Truly amazing art! I loved this show, one of the best I’ve ever seen (and I live close to NYC and have seen many shows and concerts). If you really want to experience Barcelona’s culture, I would definitely recommend this show. The show last a little more than 1 complete hour, which is perfect. The singers and dancers put their heart and souls into their performances. Just amazing. Bravo!!  ", "publishedDate": "2019-02-12", "language": "en", "rating": 5}, {"id": 647572183, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d2717850-r647572183-Palau_Dalmases-Barcelona_Catalonia.html", "text": "Enjoyed this a lot. An old atmospheric venue, commited and talented performers. One drink included. Good value. Recommended. ", "publishedDate": "2019-01-22", "language": "en", "rating": 5}, {"id": 645813594, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d2717850-r645813594-Palau_Dalmases-Barcelona_Catalonia.html", "text": "A one hour flamenco show at a reasonable price which includes one drink.  The show takes place in a 16th Century palace in the Born district.  The performers include two flamenco dancers, a guitarist, a singer and a percussionist.  The evening was very entertaining.  The hall is relatively small, so all seats facing the stage are excellent.  Enjoyable!", "publishedDate": "2019-01-14", "language": "en", "rating": 4}, {"id": 644948772, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d2717850-r644948772-Palau_Dalmases-Barcelona_Catalonia.html", "text": "最高以外の言葉がないほど、最高でした。\n５月の予約受付が始まってすぐ予約したからか、一番前の中央席を取ることができました。大迫力。ダンサーが足を踏み鳴らすたび体が（物理的に）震える震える！お若い女性ダンサーの評判がいまいちのようなレビューを見かけましたが、私がお邪魔したときは（失礼かもしれませんが）若い方ではなく酸いも甘いもあらゆる経験をしてきたような非常にフラメンコの世界を表現するのに説得力のある女性で、またとても美しい方でした。鬼気迫る迫力もあり、哀愁もあり。感動して涙が出たほど。男性ダンサーも非常に情熱的でした。歌手の声もまた素敵で。ギターも。おしゃれな隠れ家のような会場も、すべてが素敵でいい思い出になりました。また行きたいです。\n\nI sincerely wish I had enough vocabulary to describe how incredibly fantastic their show was. I booked the night show once the booking was open and we got the very front seat. I could feel the dancers' breath and sweat and all. Everything about the female dancer was beautiful and elegant. I was very very amazed by how she controlled each and every piece of her body. Her performance was not only beautiful but convincing as well, it was like I was witnessing somebody's life. Overwhelmed in a great way, I even cried. Such a shame I didn't checked her name.. I loved the fiery passion of the male dancer too, every time he stomped on the stage floor I was like thunderstruck! And the singer, his voice! The guitarist! Everything, EVERYTHING AT ALL was absobloodylutely FANTASTIC! The venue was also swanky and lovely. I literally loved every second. A part of me wanted to take photos but another part of me was really glad they didn't allow us to, because I could solely focus on the performance. A huge thank you to everybody at Palau Dalmases for the wonderful night.", "publishedDate": "2019-01-10", "language": "en", "rating": 5}, {"id": 644434964, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d2717850-r644434964-Palau_Dalmases-Barcelona_Catalonia.html", "text": "This flamenco show is in a charming and quirky building accessible to all of central Barcelona. There was four of us and not one of us left, un-exhilarated. There were 2 main dancers, one main singer, a guitarist and a percussionist. All were contributors to our great time. MAKE RESERVATIONS. \nWe all (4) felt it was a great value and the time FLEW by.", "publishedDate": "2019-01-07", "language": "en", "rating": 5}, {"id": 643407656, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d2717850-r643407656-Palau_Dalmases-Barcelona_Catalonia.html", "text": "Never seen such a well done tablao, went with family and really enjoyed guitar player, singer and best of all the dancers. If want to see a real tablao while in Barcelona it is a must.", "publishedDate": "2019-01-03", "language": "en", "rating": 5}, {"id": 642533476, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d2717850-r642533476-Palau_Dalmases-Barcelona_Catalonia.html", "text": "The place is very nice and the artists are fantastic! Make sure you reserve it in advance so you can catch a place near the stage!", "publishedDate": "2018-12-30", "language": "en", "rating": 5}, {"id": 641405747, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d2717850-r641405747-Palau_Dalmases-Barcelona_Catalonia.html", "text": "I visited it in October 2018. It was nice performance with Flamenco girl and a guy who danced with her as well and a live singer with guitar. I had a recommendation and don t know if there are other shows so nice like this one. I enjoyed it a lot, it is so spanish! I would recommend it , it lasts almost 1 hour and the price is ok + you have a drink for free ( I had a delicious sangria). Book in advance, the show is very famous", "publishedDate": "2018-12-25", "language": "en", "rating": 4}, {"id": 641395764, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d2717850-r641395764-Palau_Dalmases-Barcelona_Catalonia.html", "text": "Nice  flamenco show at a small theater at the old city (just next to Picasso museum). Very touristic. If you want a short and not too expansive experience of flamenco this can be the place. Price include a drink.", "publishedDate": "2018-12-25", "language": "en", "rating": 3}, {"id": 640019217, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d2717850-r640019217-Palau_Dalmases-Barcelona_Catalonia.html", "text": "This was the most memorable experience of our Barcelona trip. What a great performance and suiting atmosphere. We actually found this gem on our way to the Picasso museum. You need to pre book either one of the two daily shows. Only very limited seats available as the place is very small. The performance was breathtaking and full of emotions. The entrance ticket includes a free drink and worth every penny spent. ", "publishedDate": "2018-12-16", "language": "en", "rating": 5}, {"id": 639665461, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d2717850-r639665461-Palau_Dalmases-Barcelona_Catalonia.html", "text": "We had a great evening here with great energetic skilled dancers and musicians and a glass of wine or sangria. In a very historic area. Small venue so dancing was very close up, Authentic!", "publishedDate": "2018-12-14", "language": "en", "rating": 5}, {"id": 639084221, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d2717850-r639084221-Palau_Dalmases-Barcelona_Catalonia.html", "text": "very good show ! one drink , good music, nice place : everything needed to have a good moment in Barcelona ! ", "publishedDate": "2018-12-11", "language": "en", "rating": 4}, {"id": 638932600, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d2717850-r638932600-Palau_Dalmases-Barcelona_Catalonia.html", "text": "A magical hour of passion and rhythm.....an authentic flamenco experience. The atmosphere and surroundings were great.", "publishedDate": "2018-12-11", "language": "en", "rating": 5}, {"id": 638665095, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d2717850-r638665095-Palau_Dalmases-Barcelona_Catalonia.html", "text": "The palace was beautiful and the room was cozy and perfect to view the show.  The singer and musicians were fantastic and the dancers themselves, their beauty, energy and pride in their native dance, made the show a beautiful one.  It was the perfect ending to our trip, we really enjoyed it. Had a glass of wine as well....perfecto!\n", "publishedDate": "2018-12-10", "language": "en", "rating": 5}, {"id": 638051027, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d2717850-r638051027-Palau_Dalmases-Barcelona_Catalonia.html", "text": "The Palau Dalmases was one of the highlights of our trip to Barcelona. It is in a 17th Century Gothic building in old Barcelona, which in it's self is a treat and set the stage for a magical night.  However, the real price was the show itself. The guitar player and vocalist were fantastic and a surprise to us. Both dancers were amazing and displayed great talent, precision and talent. It was a night to remember!", "publishedDate": "2018-12-07", "language": "en", "rating": 5}, {"id": 637127796, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d2717850-r637127796-Palau_Dalmases-Barcelona_Catalonia.html", "text": "My husband and I recently enjoyed a fantastic evening of flamenco dance and music at the Palau Dalmasses. Both the woman and man dancers were incredibly professional, passionate artists who embodied the flamenco spirit. Some of their movements were heart-stopping in the way they executed them with such finesse and grace. The musicians were also incredibly gifted. The guitarist, percussionist, and vocalist were amazing and emotional. This was one show we were glad we saw. If you want to experience true flamenco while visiting Barcelona, make a point to see this show. Side note: Although flamenco originated in Andalusia, these performers know what they’re doing. I read that this company is located in Seville (which is in Andalusia), so they’re the real deal.", "publishedDate": "2018-12-02", "language": "en", "rating": 5}, {"id": 635270822, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d2717850-r635270822-Palau_Dalmases-Barcelona_Catalonia.html", "text": "I must have been to a different show than other reviewers as I was slightly disappointed,  The show was short in my view.  The first half both dancers danced but in the second half the woman just stood and clapped -  she was a great flamenco dancer so we were disappointed she didn't dance again.  \n\nWhat I did like was the the atmosphere -  small and intimate!", "publishedDate": "2018-11-23", "language": "en", "rating": 3}, {"id": 634972969, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d2717850-r634972969-Palau_Dalmases-Barcelona_Catalonia.html", "text": "This was my first experience of Flamenco and i must say it could not have been better. The setting for Palau Dalmases is extraordinary and that is only matched by the performance. The show is an hour long and cost €25 which also includes a drink. If you attend but one show whilst in Barcelona, make it this one. Oh and book in advance as the setting is intimate and gets full quick.", "publishedDate": "2018-11-21", "language": "en", "rating": 5}, {"id": 632231741, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d2717850-r632231741-Palau_Dalmases-Barcelona_Catalonia.html", "text": "Booked a 7:30pm performance which included a cocktail. The show started at 7:35 and ended at 8:40pm and there was a 5 minute break.  Not sure if I misunderstood but I thought the show was 90 mins.  This was my first flamenco show so I have no point of comparison.  Performers were engaging and intense.  Location was very central.", "publishedDate": "2018-11-09", "language": "en", "rating": 3}, {"id": 630355771, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d2717850-r630355771-Palau_Dalmases-Barcelona_Catalonia.html", "text": "Being in Barcelona for the first time, me and my husband really wanted to see a Flamenco performance, therefore I've decided, after careful consideration and research, to treat us on my birthday with one hour of high quality flamenco show at Palau Dalmases, a beautiful Gothic building. Our seats were right in the front row, very close to the stage, I don't know if it mattered but I have booked way in advance. The show is a very good value for money, considering that there is also a drink included in the ticket. Most importantly though was the performance, the authenticity of the show, it was very passionate, powerful and intense that it almost hurt, it is very important for an artist to transmit, and they have transmitted plenty of emotions. There were times when I've hold my breath, it was so intense, the energy is almost surreal. It was a magical birthday in every way.", "publishedDate": "2018-11-02", "language": "en", "rating": 5}, {"id": 630221678, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d2717850-r630221678-Palau_Dalmases-Barcelona_Catalonia.html", "text": "Went with a group of friends on Sunday night for our first trip to Barcelona! We wanted somewhere with great atmosphere and this place had it! The show was brilliant, all the performers were incredible and it felt really authentic. We had such a great time and would definitely go again! highly recommend this place!", "publishedDate": "2018-11-02", "language": "en", "rating": 5}, {"id": 629724408, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d2717850-r629724408-Palau_Dalmases-Barcelona_Catalonia.html", "text": "We ordered our tickets online about an hour before the 6p show started. Although our seats were in the back, the venue is small enough that it wasn’t a problem. And what a wonderful location too- the entire show was well done from beginning to end. We have been to many flamenco shows and everything was better than we expected. ", "publishedDate": "2018-10-30", "language": "en", "rating": 5}, {"id": 629675605, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d2717850-r629675605-Palau_Dalmases-Barcelona_Catalonia.html", "text": "This was our first Flamenco experience but it felt authentic and we enjoyed the show. The venue is small, gothic and atmospheric. The dancing was wonderful and the guitar music beautiful. For us, with two children in tow, an hour was just about right. It did not feel commercial and I liked that.", "publishedDate": "2018-10-30", "language": "en", "rating": 4}, {"id": 629652912, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d2717850-r629652912-Palau_Dalmases-Barcelona_Catalonia.html", "text": "We booked the flamenco show at Palau Dalmases because we were looking for the truest representation of flamenco while we were in Barcelona. We did not seek a Broadway-like show with glitz and fancy lighting, but rather a performance closer to the \"gitano\" influence that flamenco is known for. We found this at Palau Dalmases, which is housed in a 1700s 'palace' with so much atmosphere and history! It was the perfect backdrop for the talented musicians, singer and dancers. The entrance fee included a drink choice - cava, red wine, sangria or non-alcoholic drink. The seating was intimate and no seat was bad in my opinion. The palau is located a stone's throw from the Picasso museum (also worth a visit).", "publishedDate": "2018-10-30", "language": "en", "rating": 5}, {"id": 627556040, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d2717850-r627556040-Palau_Dalmases-Barcelona_Catalonia.html", "text": "First time in Europe... first night in Barcelona and awesome flamenco show! Beautiful enviroment... Just a perfect night.", "publishedDate": "2018-10-23", "language": "en", "rating": 5}, {"id": 624628913, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d2717850-r624628913-Palau_Dalmases-Barcelona_Catalonia.html", "text": "If you are visiting Barcelona and want to experience a flamenco show, this was excellent. The beautiful rustic setting was intimate enough to see the fantastic footwork and feel the music and intensity of the performers. Not a bad seat in the house and a great area to explore after the show. I think the price is very reasonable for the professionalism of the dancers and musicians. One drink included. I would go back. ", "publishedDate": "2018-10-14", "language": "en", "rating": 5}, {"id": 624177076, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d2717850-r624177076-Palau_Dalmases-Barcelona_Catalonia.html", "text": "I will not claim to have a professional opinion of this art all I can say is I only enjoyed the odd couple of seconds of the performance. \nThe cost was about £25 per person for a 1hr show and a drink.\nMost of the show (well over 50%) is three guys sat on chairs that could have passed for busking. \nDon’t get me wrong the singer was very good and clearly putting in everything he had. The guitarist was very good also having a couple of occasions during the performance to show how well he can play. Again not going to claim I am an expert so no opinion but the third guy had a box with some instrument inside that he played by striking it. Also a lot of the music was made up of simply clapping and tapping feet not really a £25 price tag. \nFor short times during the performance 2 dancers in turn would take to the stage. I did really enjoy the parts when they really gave it everything they had, however this would genuinely only last about 3 seconds per time and happened rarely with the rest of the time having them tapping around the stage at a much slower pace. \nIt was a 1hr show which included a 10 minute interval. I believe the interval was mostly for the singer given how much he was putting into it but at a 1hr run time including the interval could the other 2 musicians and the dancers filled in this time without halting the show?\nIt sounds harsh but I genuinely fell asleep during a long period of the 3 guys playing their instruments and clapping on their own with no dancing their was just not enough going on to grab my attention as all three were just sat down. \nThe building was very nice and the choice of drink included within the price was literally anything at the bar. \nI believe it was very traditional flamenco without the hype created over the years so they certainly deserve respect for sticking to their roots but honestly it’s not worth the price. \nAlmost pains me to say it as I am sure it takes a lot of skill and years of development but save yourself £25 and an hour of your time by watching a street performer instead or go to a cheaper show. \nI know this review sounds harsh and due to the skill level of the performers I would not give a 1 star review but this is my honest opinion with the bottom line being it is just too expensive for what it is. ", "publishedDate": "2018-10-12", "language": "en", "rating": 2}]}}]