[{"locationId": 8434367, "name": "Piscina Municipal de Montjuic", "placeType": "ATTRACTION", "reviewListPage": {"reviews": [{"id": 718039896, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d8434367-r718039896-Piscina_Municipal_de_Montjuic-Barcelona_Catalonia.html", "text": "Well the views are amazing, we found the small bar st the top as the pools were closed. Cleary this place needs work and investment but the views are remarkable and if your there you need to have a look ", "publishedDate": "2019-10-13", "language": "en", "rating": 4}, {"id": 717943320, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d8434367-r717943320-Piscina_Municipal_de_Montjuic-Barcelona_Catalonia.html", "text": "To be able to  see  a pool like that was an experience by itself! It was closed when I went but perhaps it is a pool with the best view in the world! You can see Barcelona spread out in front of you! Didn't get the logic of a square pool though. There is also a diving pool next to it. Just seeing it is a treat.", "publishedDate": "2019-10-13", "language": "en", "rating": 4}, {"id": 712881701, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d8434367-r712881701-Piscina_Municipal_de_Montjuic-Barcelona_Catalonia.html", "text": "The pool was closed, but the small bar was open so we had, a hamburger and beer and enjoyed the incredible view ", "publishedDate": "2019-09-25", "language": "en", "rating": 4}, {"id": 702088392, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d8434367-r702088392-Piscina_Municipal_de_Montjuic-Barcelona_Catalonia.html", "text": "It seems incredible that a place that could take advantage of tourism is in such conditions of abandonment. Changing rooms without lockers and without hygienic conditions, chipped roofs over our heads, dirty pool bottom, etc. There are 2 swimming pools: one was closed and full of seagulls, as if it were a pond. And most of the people who were there, had not paid entrance, since they sneak through an abandoned rear part of the building, a dangerous part full of thieves waiting to rob tourists (see other comments to check). A lot of these dangerous people are the ones you later find by the pool and, logically, they have not paid entrance. It's incredible that with the magnificent views it has and the possibilities that the bar above has, the city of Barcelona could not take more advantage of this must visit attraction and not give embarrassment to the locals themselves.", "publishedDate": "2019-08-23", "language": "en", "rating": 1}, {"id": 698120764, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d8434367-r698120764-Piscina_Municipal_de_Montjuic-Barcelona_Catalonia.html", "text": "We got off the Hop on Hop bus here so that we could get a drink and a snack as it was hot. Unfortunately they were not serving any food there and there were lots of people sitting watching the swimmers in the pool. Everywhere else in Barcelona we had no problem getting food and drinks. Walked along to the main stadium and they had plenty of choices of snacks and sandwiches.", "publishedDate": "2019-08-12", "language": "en", "rating": 2}, {"id": 697585363, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d8434367-r697585363-Piscina_Municipal_de_Montjuic-Barcelona_Catalonia.html", "text": "I went to this pool with my daughter because the roof top pool at our hotel was really small as it is very common in Barcelona due to lack of space in general.\nFirst of all it’s relatively easy to reach because the pool is just across the station. It sits on a hill so the view is really good. The size of the pool is also very good. \nThe facilities need improvement. The place needs a small investment to make it a great place which it truly deserves to become. Changing rooms, toilets, common areas are run down but the pool is fine.", "publishedDate": "2019-08-10", "language": "en", "rating": 3}, {"id": 693377921, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d8434367-r693377921-Piscina_Municipal_de_Montjuic-Barcelona_Catalonia.html", "text": "This is a proper hidden gem - 20 euro a for 3 people to stay the day, swim as needed and sit on loungers in the sun or shade. The view over Barcelona is as good as you’ll get anywhere and there’s a nice little snack bar up above.  Just watch out for the stairs back up from the pool to the street - on a hot day they’re hard going!\n\nEasy metro ride from Las Ramblas in a secret extra funicular line from Para-lel station.", "publishedDate": "2019-07-28", "language": "en", "rating": 5}, {"id": 689593630, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d8434367-r689593630-Piscina_Municipal_de_Montjuic-Barcelona_Catalonia.html", "text": "Well worth a trip. Quieter and more space than the beach and the views were unbelievable.. We didn't bother with changing rooms as just took everything on pool side. 6 euros for the day for adults and 1 euro for a sun lounger (there were at least 50 sunloungers to rent). The pool was open 11am - 6pm. We took the funicular up from Paral-lel which cost 1 euro if you have a T10.", "publishedDate": "2019-07-14", "language": "en", "rating": 5}, {"id": 685477364, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d8434367-r685477364-Piscina_Municipal_de_Montjuic-Barcelona_Catalonia.html", "text": "Popped in to enjoy the breathtaking view on-route to the cable car. Pool was closed. There is a basic bar at the top with a large local beer costing around 5e. ", "publishedDate": "2019-06-30", "language": "en", "rating": 4}, {"id": 684133832, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d8434367-r684133832-Piscina_Municipal_de_Montjuic-Barcelona_Catalonia.html", "text": "My friend and I went to use the pool and it was closed off for a private kids sporting event. The whole place was covered in graffiti and caging on the outside so it looked pretty rundown. We watched for a bit as it was a good atmosphere with lots of families supporting the kids and then left. About 20 mins down the nice chilled road, two guys came out of nowhere and started prising my friends fingers off her phone. They tussled for a bit before more people came running at us and he finally got it. They both ran down the path to the side which doubles back under the pool into a dodgey woodland area. Such a horrible experience and luckily I had just put my phone away. Later we bumped into police who had observed the whole thing and chased them down which was great, but we spent hours in the police station. Really not worth the trip to the pool, even if we could have gone swimming. Watch out for the quieter site-seeing places with trees and paths as the police said they love these places for thieving and it happens all day everyday!", "publishedDate": "2019-06-24", "language": "en", "rating": 1}, {"id": 677694610, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d8434367-r677694610-Piscina_Municipal_de_Montjuic-Barcelona_Catalonia.html", "text": "Just a note to say this is only open to the public July and August. Amazing and worth a trip if within those months.", "publishedDate": "2019-05-30", "language": "en", "rating": 4}, {"id": 661782523, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d8434367-r661782523-Piscina_Municipal_de_Montjuic-Barcelona_Catalonia.html", "text": "Be very careful if you visit this site! It was closed when we visited, boarded up with metal grills and graffiti everywhere and looked very neglected and forlorn. Thieves are prevalent in the area, more here than elsewhere in our experience,  and my wife had her phone and wallet snatched from her grasp. We managed to retrieve the phone but not the bank cards. Good response from the local police who dropped us off at a nearby metro station as we had them missed the last cable car back to the port.    ", "publishedDate": "2019-03-28", "language": "en", "rating": 2}, {"id": 605646950, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d8434367-r605646950-Piscina_Municipal_de_Montjuic-Barcelona_Catalonia.html", "text": "Simple and inexpensive, and with the most amazing views out over the city. The perfect place to cool off after a visit to the old Olympic park. Definitely worth a visit!", "publishedDate": "2018-08-12", "language": "en", "rating": 5}, {"id": 601838042, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d8434367-r601838042-Piscina_Municipal_de_Montjuic-Barcelona_Catalonia.html", "text": "This is a simple pool with a great view and friendly staff. The Bar on top called Moritz is also great. Burgers can be recommended. The staff was extremely helpful when we encountered an administrative problem! The many steps make it difficult for strollers and it‘s not particularly clean. I found the reviews on Tripadvisor helpful.", "publishedDate": "2018-08-01", "language": "en", "rating": 4}, {"id": 601618413, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d8434367-r601618413-Piscina_Municipal_de_Montjuic-Barcelona_Catalonia.html", "text": "Went at around midday on a Tuesday, lots of space to lie.\nAll concrete, no grass, but not a problem as was happy lying on a towel. \nFantastic views! Really special and worth the visit. Lots of seats on stadium. \nTwo pools, both are deep.\nChanging rooms are gendered and are communal. Basic but with showers and mirrors etc \nIf you want to use a locker BRING OWN LOCK!!\nAlso you can BRING OWN FOOD AND DRINK nice to picnic\nReally relaxed atmosphere, would visit again!\n6,95€ for 1 adult when we went ", "publishedDate": "2018-07-31", "language": "en", "rating": 5}, {"id": 597917427, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d8434367-r597917427-Piscina_Municipal_de_Montjuic-Barcelona_Catalonia.html", "text": "Rough and ready down with the locals pool at the end of a great walk with an amazing view of the city. €5 in for the family for the day ! Bring a picnic for a cheap as chips day out. Pool deep (bring armbands if necessary)  with spectacular views of the city. Good changing rooms. Good to know that you have to bring your own small padlock if you want to use the lockers. ", "publishedDate": "2018-07-20", "language": "en", "rating": 4}, {"id": 593853035, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d8434367-r593853035-Piscina_Municipal_de_Montjuic-Barcelona_Catalonia.html", "text": "Went for the day to the pool. It was €6.65 for an adult. We had read on other reviews that there were no shops there so took drinks & snacks! The changing facilities & toilets are tired looking but they did the trick! There is a lift to get up & down to the pool area/ changing rooms from street level & we managed to hire sun loungers for €1 but there weren't many & some appeared to break easily! You can easily spend the day here if you have supplies, watch the people on the diving boards or just looking out over Barcelona!", "publishedDate": "2018-07-07", "language": "en", "rating": 4}, {"id": 593069993, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d8434367-r593069993-Piscina_Municipal_de_Montjuic-Barcelona_Catalonia.html", "text": "We have been here before last year and this is an ideal place to chill cheaply in Barcelona with excellent views across the city. The place is cheap to get in at 6.5€ and there are limited sun beds (10) at the last count for a 1€ fee each.\nHowever this time some of the users around the pool decided to turn a nice environment to a Bob Marley stereo tribute time. Not that I mind this fine music however blasted across the pool for all to hear for several hours with no intervention from the staff on duty made it intolerable not just for us but for several others. So this may be an isolated incident but I won’t be going back......", "publishedDate": "2018-07-04", "language": "en", "rating": 3}, {"id": 585341353, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d8434367-r585341353-Piscina_Municipal_de_Montjuic-Barcelona_Catalonia.html", "text": "We planned a trip to this pool as we read on here it was open and looked lovely!\n\nWe turned up and it was very unclear on how to get in. Eventually we got in but it looked as if there was no one there and someone filming an advert. A local man who was working on the advert said it hadn’t been open for years (even although there’s clearly pictures on here of people using it).\n\nDon’t go as you’ll not be able to use it!!", "publishedDate": "2018-06-05", "language": "en", "rating": 1}, {"id": 574736935, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d8434367-r574736935-Piscina_Municipal_de_Montjuic-Barcelona_Catalonia.html", "text": "Really enjoyed my visit here. It was quite empty despite visiting in July. Perfect if you want an experience away from the tourist crowds.", "publishedDate": "2018-04-21", "language": "en", "rating": 4}, {"id": 529676679, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d8434367-r529676679-Piscina_Municipal_de_Montjuic-Barcelona_Catalonia.html", "text": "This must have been a great venue to view the Olympic swimming.\nVery impressed!\nRight in the side of the mountain.", "publishedDate": "2017-10-03", "language": "en", "rating": 4}, {"id": 519909321, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d8434367-r519909321-Piscina_Municipal_de_Montjuic-Barcelona_Catalonia.html", "text": "The views from this swimming pool are amazing but that is about it. The area was run down and dirty and staff were extremely rude. Shame as this place has so much potential to be an amazing tourist spot. ", "publishedDate": "2017-08-31", "language": "en", "rating": 2}, {"id": 514797698, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d8434367-r514797698-Piscina_Municipal_de_Montjuic-Barcelona_Catalonia.html", "text": "First: if you want a spectacular view over the city of Barcelona, this is the place. \n\nBut, if you are looking for a nice pool to spend the day, this isn't it. \n- changing rooms for men were closed;\n- no foods or beverages being sold;\n- the ", "publishedDate": "2017-08-18", "language": "en", "rating": 2}, {"id": 510052564, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d8434367-r510052564-Piscina_Municipal_de_Montjuic-Barcelona_Catalonia.html", "text": "Public hidden gem?\nBarcelona Olympic pools could be counted as big touristic attraction but still it's quite rarely known.\n\nEntry fee is 6,5€/adult and be here at 10.55 as it opens at 11.\nThe day we pended here there weren't that much of a rush but there are limited amount of sunbeds (1€/chair!!). \nThe pool is nice and big and the view is amazing!\n\nEvery place has of course it downsides. The bathrooms were dirty and there we no lights :D also there are no place to get snacks so bring your own drinks and snacks.\n\nHint. Spend here for the day and afterwords go to the funicular (it's located across the road so next by) and go to the hills to the castle.\n\nMaybe take a cheaper hotel with no pool and come here for every day :))?", "publishedDate": "2017-08-08", "language": "en", "rating": 5}, {"id": 508213267, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d8434367-r508213267-Piscina_Municipal_de_Montjuic-Barcelona_Catalonia.html", "text": "We live not far from the pool, but for some reason we had never been before.\nIMPORTANT NOTE: They do not have a interact machine, so bring cash... We learned this the hard way.\nThe pool itself is so quiet and we had a fantastic time paddling around. \nIf you are bringing small children be sure to bring water wings or other floats,as there is no shallow end. \nThere are some shaded areas and you can rent recliners for 1€, just ask the lifeguards. \nYou can also bring snacks or a lunch to eat on the pool deck.\nBathrooms need some TLC, but we managed fine.\n\nWe will be back!!!", "publishedDate": "2017-08-02", "language": "en", "rating": 4}, {"id": 506418135, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d8434367-r506418135-Piscina_Municipal_de_Montjuic-Barcelona_Catalonia.html", "text": "It's very much worth taking a little time out of your day to visit the municipal pool, which is located high up in the hills near to the Joan Miro museum and funicular. The views are absolutely incredible and the pool was pretty quiet while we were there which meant we managed a couple of hours of uninterrupted sunbathing and swimming. Absolute bliss on a hot day! ", "publishedDate": "2017-07-28", "language": "en", "rating": 5}, {"id": 505208369, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d8434367-r505208369-Piscina_Municipal_de_Montjuic-Barcelona_Catalonia.html", "text": "One of the best places where you can enjoy the warm weather of Barcelona - not too pricy (6,50€/per), not too many people and the perfect temperature of water.", "publishedDate": "2017-07-24", "language": "en", "rating": 5}, {"id": 504019938, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d8434367-r504019938-Piscina_Municipal_de_Montjuic-Barcelona_Catalonia.html", "text": "Not busy at all and such a great view! Aomehow this has remained a hidden gem from most tourists?! The pool is large and seems like it is partially chorine and partially salt water and is the perfect temperature. Although there weren't very many, we managed to snag a couple of chairs for 1 euro each. It is a great spot to spend the day! It only cost about 6 euros per adult for the whole day. We highly recommend checking out this pool! ", "publishedDate": "2017-07-20", "language": "en", "rating": 5}, {"id": 495441346, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d8434367-r495441346-Piscina_Municipal_de_Montjuic-Barcelona_Catalonia.html", "text": "Although it's not the beach, it's safer and you don't have to worry that someone might steal your stuff. A little pricey but a nice big pool with loungers.", "publishedDate": "2017-06-23", "language": "en", "rating": 5}, {"id": 436049251, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d8434367-r436049251-Piscina_Municipal_de_Montjuic-Barcelona_Catalonia.html", "text": "A bit of a hidden gem in Barcelona, not many tourists there and the views are simply breathtaking. \n\nIf you're heading to Barcelona and want to swim & sunbathe I'd advise you to avoid the crowded beach and head here!", "publishedDate": "2016-11-09", "language": "en", "rating": 5}, {"id": 416933568, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d8434367-r416933568-Piscina_Municipal_de_Montjuic-Barcelona_Catalonia.html", "text": "20 odd euros for a family of 4. It's quiet. It overlooks the city. It really is a hidden gem of a pool.\nThere are sunbeds but not many and they're always popular. We took towels like most people and they are more than adequate. The pool has no shallow end and the water is level with the edge of the pool, and because of the railings, even when you're in the water the view across the city is amazing.\nIt's  better than the beach.", "publishedDate": "2016-09-10", "language": "en", "rating": 5}, {"id": 410554443, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d8434367-r410554443-Piscina_Municipal_de_Montjuic-Barcelona_Catalonia.html", "text": "This was a really good find- pool is very deep and no shallow end but is really bigger than it looks- if you are staying somewhere with no pool and the beach is just too busy this is a great place €6:50 for adults and €4:50 for children but that's the whole day. Toilets and change facilities!", "publishedDate": "2016-08-25", "language": "en", "rating": 4}, {"id": 410237591, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d8434367-r410237591-Piscina_Municipal_de_Montjuic-Barcelona_Catalonia.html", "text": "Loved the pool and the views.  Been 2 days in a row and plan on going back again tomorrow.  Kids love the lack of rules.  You are allowed to run and dive in.  Great fun.", "publishedDate": "2016-08-24", "language": "en", "rating": 5}, {"id": 404653345, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d8434367-r404653345-Piscina_Municipal_de_Montjuic-Barcelona_Catalonia.html", "text": "Very easy to get to - metro to Paral-lel and funicular up the hill (all on the same ticket). Olympic pool with amazing views over Barcelona. Entry €6.50 for adults, €4.50 for under 15.   Not at all busy - plenty of room for sunbathing (limited loungers available for €1) and sufficient shade too. Diving pool next door is unfortunately not in use. Changing rooms pretty basic and no lockers, so either don't take any valuables or take them to the pool with you.\nGreat alternative for some outdoor swimming (in salty water) away from the crowds and tourists on the beach and with a fabulous view into the bargain! ", "publishedDate": "2016-08-12", "language": "en", "rating": 4}, {"id": 401169715, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d8434367-r401169715-Piscina_Municipal_de_Montjuic-Barcelona_Catalonia.html", "text": "We spent the afternoon here after reading the Guardian review that it's 'possibly the best pool in the world' and it did not disappoint. It was 6.50 euro to get in for adult and 4.5 euro for 6-14yrs and it seemed to be mostly used by locals, I don't think many tourists know about it. If you just want to look at the view and not swim they let you stand at the top of the seating for free. The view is AMAZING and you can see the whole city. The pool is very deep (about 2.5m the whole way across) so might not be suitable for very small children but the water is lovely and cool and clean and the pool is huge so you have lots of space. You can hire a lounger for 1 euro but there are only a few so take a towel to sit on, there is also not much shade. You will also need to take food and water up with you as there is nowhere to buy anything in there. However there is a small cafe/bar outside on the right where we went afterwards for drinks and ice cream before getting back on the train.\nThe changing rooms are very basic but you can change and shower no problem. We took the metro to Paralell to get here and then got on the Montjuic Funicular train up the mountain (you can use your metro tickets on it) its then a 1 min walk to the right when you exit the station.\nIt's well worth a visit!", "publishedDate": "2016-08-04", "language": "en", "rating": 5}, {"id": 314089351, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d8434367-r314089351-Piscina_Municipal_de_Montjuic-Barcelona_Catalonia.html", "text": "You have an amazing view over Barcelona! This pool is great! I highly recommend it!!!!\nA lot of people don't know about it so it's not crowded. I love it!", "publishedDate": "2015-09-27", "language": "en", "rating": 5}, {"id": 304574146, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d8434367-r304574146-Piscina_Municipal_de_Montjuic-Barcelona_Catalonia.html", "text": "I would thoroughly recommend this pool. It probably has more locals than tourists which shows what a well kept secret it is. If you google this pool The Guardian rate it as the best in the world!\n\nWe chose to look for a swimming pool trip after a slightly disappointing day at the beach where just a parasol cost 8 euros to hire and everyone is packed in close together, so we did a bit of research and decided to come here. We were not disappointed! \n\nIt is easy to get to. A short journey on a small shuttle train from the Parallel metro station. You can use your T10 tickets for this service. Straight out of the station and the pool is opposite to the right. Reasonably priced at 6.50 for adults and 4.50 for kids. There are sun beds to hire for 1euro each although they go quickly. However, you can put yourself on the waiting list and the lifeguards bring them over when they become available. \n\nThe pool is big and there is plenty of room as a lot of people sunbathe. I counted 80 people there but only 25 in the pool. It's great with slightly older kids as they can jump in as much as they want without disturbing people whilst I got to sunbathe and swim lengths with plenty of room. \n\nThe best bit though is the absolutely stunning views across barcelona which are amazing to see either from a sunbed or as you swim.\n\nSome points to note:\n- this was the diving pool for the Olympics but the diving boards aren't open to the public\n- there are no lockers so don't take any valuables\n- there is nowhere to buy food or drink so take some with you. We took a picnic which was great as we stayed for several hours without spending any extra money on overpriced drinks or snacks!", "publishedDate": "2015-08-29", "language": "en", "rating": 4}, {"id": 292404211, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d8434367-r292404211-Piscina_Municipal_de_Montjuic-Barcelona_Catalonia.html", "text": "What a great find!! We visited here after it was recommended by our tour guide. It is accessible via the funicular or bus. The huge 1992 Olympic swimming pool is open to the public and is set on the side of Montjuic hill, boasting some incredible views over the city. It costs €6.50 for adults and there is plenty of room to sunbathe around the pool, but there's only a limited number of sun beds available. We found it much quieter than the Barcelona beaches and the pool was lovely to cool off in. A great hidden gem in Barcelona!", "publishedDate": "2015-07-25", "language": "en", "rating": 5}, {"id": 289432902, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d8434367-r289432902-Piscina_Municipal_de_Montjuic-Barcelona_Catalonia.html", "text": "Do you want to sunbath and avoid the crowd from the Barcelona's beaches ?\nThis swimming pool is the spot.\n\nEasy : access by bus or metro/funicular.\nCheap : it's a standard swimming pool entrance fee !\nSpace : an old olympic place, absolutely oversized for the actual usage\n\nThe view is the plus ! \nBuilt on the Montjuic's hill, you have the entire city of Barcelona as panorama.\n\nDownside : Changing rooms are craps. \nBuilt in 1992, they have not been refurbished since.\nNo lockers, and I would suggest to bypass the showers.\n\nWater is salty, and depth is constant across the swimming pool (2,5 meters).\nSo, no recommended for small children who cannot swim.", "publishedDate": "2015-07-16", "language": "en", "rating": 4}]}}]