[{"locationId": 2223602, "name": "Museu de la Catedral", "placeType": "ATTRACTION", "reviewListPage": {"reviews": [{"id": 728463156, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d2223602-r728463156-Museu_de_la_Catedral-Barcelona_Catalonia.html", "text": "the Cathedral is beautiful inside and is free before 12:30pm when they charge to visit.  be sure to visit the cloister gardens and the gift show where you can learn the story about the 13 geese.\n", "publishedDate": "2019-11-23", "language": "en", "rating": 5}, {"id": 688505438, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d2223602-r688505438-Museu_de_la_Catedral-Barcelona_Catalonia.html", "text": "Really loved the views all around, especially the front of the building. Such unique and beautiful details. A must do while in the Gothic Quarters.", "publishedDate": "2019-07-10", "language": "en", "rating": 4}, {"id": 677557307, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d2223602-r677557307-Museu_de_la_Catedral-Barcelona_Catalonia.html", "text": "nice place to visit when you're also visiting the Cathedral\n\ncool architecture and nice place to enjoy the atmosphere, go early or late to avoid the crowds", "publishedDate": "2019-05-30", "language": "en", "rating": 4}, {"id": 659511952, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d2223602-r659511952-Museu_de_la_Catedral-Barcelona_Catalonia.html", "text": "I found this little side track from the church to be very interesting and felt like I learned something from seeing the information. Definitely worth the short amount of extra time.", "publishedDate": "2019-03-19", "language": "en", "rating": 5}, {"id": 602220739, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d2223602-r602220739-Museu_de_la_Catedral-Barcelona_Catalonia.html", "text": "It is included with your visit to the catheral and it is well worth the visit. You can see the geese that keep watch over the place, they have a fountain and for especial holidays it has great decorations.", "publishedDate": "2018-08-02", "language": "en", "rating": 5}, {"id": 593955968, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d2223602-r593955968-Museu_de_la_Catedral-Barcelona_Catalonia.html", "text": "Its always a nice haven in a city to find a quaint and beautiful church to rest one's weary feet and take time out from commercial craziness ", "publishedDate": "2018-07-08", "language": "en", "rating": 4}, {"id": 589280354, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d2223602-r589280354-Museu_de_la_Catedral-Barcelona_Catalonia.html", "text": "Very nice collection of art inside the museum.\nWe were for Sy Casals day and inquired about the museum.  It was well worth the time return back to view this. Large collection. The quality of the varied art. Makes it that  more interesting\nBelieve. That true art like vets would love me this collection", "publishedDate": "2018-06-20", "language": "en", "rating": 5}, {"id": 587743430, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d2223602-r587743430-Museu_de_la_Catedral-Barcelona_Catalonia.html", "text": "Museu de la Catedral locates at the inner courtyard of the Cathedral.  There is a cloister with 13 geese kept for historical reasons apart from the display of religious art displays inside.  Recommended to have a look.", "publishedDate": "2018-06-15", "language": "en", "rating": 4}, {"id": 441476146, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d2223602-r441476146-Museu_de_la_Catedral-Barcelona_Catalonia.html", "text": "Must see the inner yard where there is a cloister. There is a luxurious vegetation with green parrots in the palm trees and there are fish and gees swimming in a pool.", "publishedDate": "2016-12-01", "language": "en", "rating": 5}, {"id": 439115122, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d2223602-r439115122-Museu_de_la_Catedral-Barcelona_Catalonia.html", "text": "I walked the quiet streets of Barcelona from the Las Ramblas early Sunday morning to attend the 9AM Mass. It was well attended and held in the native tongue. The Church filled up but the velvet ropes were pt up to give us peace.", "publishedDate": "2016-11-21", "language": "en", "rating": 5}, {"id": 429010534, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d2223602-r429010534-Museu_de_la_Catedral-Barcelona_Catalonia.html", "text": "The architecture of this place is fantastic. \nAl though on June when I visited it was on construction so I wasn't able to go in. But is still a nice place to take a look!! ", "publishedDate": "2016-10-17", "language": "en", "rating": 5}, {"id": 382950141, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d2223602-r382950141-Museu_de_la_Catedral-Barcelona_Catalonia.html", "text": "It seems that many reviews on this page are for the actual cathedral rather than the cathedral museum. The cathedral and cloisters entrances are free (between 8am-12:45pm and 5:15pm-8pm, weekdays—slightly altered times on weekends), but the museum can only be accessed with a “Donation Fee” of 7 Euros (1pm to 5pm, weekdays—slightly altered times on weekends), which also includes entrance to the choir, the roof, and the Saint Christ of Lepanto’s Chapel. The Museum is very tiny, housed in the old Chapter Hall, which is accessed off the cloisters. It consists of three small spaces: 1) the entrance area with a few paintings, 2) an inner room with mostly religious treasures such as a gold and silver monstrance that since the mid-15th century has sat on the equally opulent 14th-century throne of King Martin, and 3) a narrow side room, which was the Chapter Hall where the cathedral’s religious order would meet for discussion; this room still retains the architectural seats and holds paintings and wall murals (or tapestries—my memory is fuzzy in regards to this room; it was a busy day of touring!). If you want to visit all the included entrances, then the 7 Euros is worth the money, but the museum alone is too small to account for that fee, unless your area of expertise or interest is in medieval church art and history. Otherwise, just visit the cathedral when it’s free.", "publishedDate": "2016-06-15", "language": "en", "rating": 3}, {"id": 372887137, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d2223602-r372887137-Museu_de_la_Catedral-Barcelona_Catalonia.html", "text": "Really nice museum the stuff was so polite and friendly. Very good English. The introduction of the video was great and very helpful. I definitely suggest it and I will visit it again", "publishedDate": "2016-05-14", "language": "en", "rating": 5}, {"id": 368129534, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d2223602-r368129534-Museu_de_la_Catedral-Barcelona_Catalonia.html", "text": "The cathedral stands right in Barcelona city center. It houses this interesting museum. The Gothic chamber showcases some of the most valuable exhibits and works of art no longer used in religious ceremonies. ", "publishedDate": "2016-04-27", "language": "en", "rating": 4}, {"id": 345811121, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d2223602-r345811121-Museu_de_la_Catedral-Barcelona_Catalonia.html", "text": "I realy enjoyed my stay in Barcelona and im glad i had time to visit Museu de la Catedral. Street singers are super cool! You can't skip to listen them...", "publishedDate": "2016-02-08", "language": "en", "rating": 5}, {"id": 326390019, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d2223602-r326390019-Museu_de_la_Catedral-Barcelona_Catalonia.html", "text": "A visitor to Barcelona must visit the magnificent Cathedral, a work of art in itself.  The Museum associated with the Cathedral is a limited display of religious art, some of it significant and very good, some forgettable.  Some nice statuary is included.", "publishedDate": "2015-11-12", "language": "en", "rating": 4}, {"id": 314329664, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d2223602-r314329664-Museu_de_la_Catedral-Barcelona_Catalonia.html", "text": "It is amazing to view the history of this region, especially when it comes to religion.  The Museu de la Catedral is both inspiring and enlightening, and it contains so much to enjoy!  This truly is one of those \"you MUST see sites\" in Barcelona!  In my opinion, it is also one of those sites that you will want to enjoy time and time again!  I can't wait to return to beautiful Barcelona!!!!!", "publishedDate": "2015-09-28", "language": "en", "rating": 5}, {"id": 310398006, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d2223602-r310398006-Museu_de_la_Catedral-Barcelona_Catalonia.html", "text": "I found this visit disappointing and the exhibits somewhat sparce and ordinary.Better off going to some of the others", "publishedDate": "2015-09-15", "language": "en", "rating": 3}, {"id": 309125749, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d2223602-r309125749-Museu_de_la_Catedral-Barcelona_Catalonia.html", "text": "Just like every other church in Europe nothing too special. People seemed more interested in the Geese in the courtyard than what the \"museum\" was showing. If you're religious perhaps this has another significance otherwise it's definitely skippable and can be admired externally.  ", "publishedDate": "2015-09-10", "language": "en", "rating": 2}, {"id": 304686038, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d2223602-r304686038-Museu_de_la_Catedral-Barcelona_Catalonia.html", "text": "Like another reviewer I seem to be saying wow, stunning and beautiful in most of my reviews will need to get new words!! But WOW this cathedral is stunningly beautiful, it is in the gothic area of the city and the architecture is WOW.", "publishedDate": "2015-08-29", "language": "en", "rating": 5}, {"id": 276733147, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d2223602-r276733147-Museu_de_la_Catedral-Barcelona_Catalonia.html", "text": "I seem to be saying beautiful a lot or wow look at that!  My husband and I just spent 27 days in Europe .  In all honesty The Museu de la Catedral was theist beautiful of them all.  It's located in the Gothic area and so very much worth the visit", "publishedDate": "2015-06-01", "language": "en", "rating": 5}, {"id": 272500265, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d2223602-r272500265-Museu_de_la_Catedral-Barcelona_Catalonia.html", "text": "I don't enjoy Gaudi's style. I have watched a documentary about him and his work, which I found interesting. But in practice, I don't like his work.\n\nOn the contrary, I find this Meseu de la Catedral less \"intellectual\" and generally prettier, both inside and outside.\n\nThe access is free, and it is not far from Plaza de Catalunya.", "publishedDate": "2015-05-17", "language": "en", "rating": 4}, {"id": 264062246, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d2223602-r264062246-Museu_de_la_Catedral-Barcelona_Catalonia.html", "text": "Beautiful amazing architecture with statues and frescoes, This amazing Cathedral and square are always full of activity, the cathedral is absolutely gorgeous with its architectural merit of the best in Europe or even the world.", "publishedDate": "2015-04-06", "language": "en", "rating": 4}, {"id": 256041786, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d2223602-r256041786-Museu_de_la_Catedral-Barcelona_Catalonia.html", "text": "Went to the Cathedral on sunday to especially watch the Catalan Dances.  This was truly amazing to see, and you get a feeling of the history in both the Cathedral and the people along with their dancing.  It is a must see, and we were luck enough to arrive on a sunday where they had a festival going on as well.  So they had traditional food with Traditional dancing.  This was a definite must see!!", "publishedDate": "2015-02-23", "language": "en", "rating": 4}, {"id": 255267230, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d2223602-r255267230-Museu_de_la_Catedral-Barcelona_Catalonia.html", "text": "Loved this place..Nice architecture and relaxing atmosphere full of tourist relaxing around this place....", "publishedDate": "2015-02-19", "language": "en", "rating": 4}, {"id": 232739482, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d2223602-r232739482-Museu_de_la_Catedral-Barcelona_Catalonia.html", "text": "My wife and I attended Mass here, and although the service we attended was in Catalan (which we don't speak) it was amazing thinking about the history here.        \nWhether or not you attend Mass, this is a MUST SEE in Barcelona.", "publishedDate": "2014-10-05", "language": "en", "rating": 5}, {"id": 231819891, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d2223602-r231819891-Museu_de_la_Catedral-Barcelona_Catalonia.html", "text": "A visit to the cathedral is a time tunnel.  When you enter you gasp, time portal!  I don't know where to start... Two worn velvet caskets perched high on the wall to the right of the alter 1058 yes 1058.  The count of Barcelona and his wife have been resting here for nearly a thousand years.  They founded the 2 nd church.  What you are now I is the 3rd reincarnation.  Mid 14th century.  This is a church Isabella and her daughter, Katherine of Aragon might have visited.  Speaking of which, one can pay a bit and enter the mid section of the church.  There are carved seats with crests on them from all over the Europe of that time... Including the crest of Henry the eighth.  Much more to be seen, fabulous alter pieces from1407 and later... Don't miss the roof or the cloister.  Quack quack. Geese. White geese.  A fountain with a renaissance bronze st. George killing the dragon.  Not to be missed by any history buff.  ", "publishedDate": "2014-09-30", "language": "en", "rating": 5}, {"id": 229791953, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d2223602-r229791953-Museu_de_la_Catedral-Barcelona_Catalonia.html", "text": "Very tranquil place in a very scenic area.\nThere were a couple of services going on while we were there but you can still go in and wonder around.\nI'm confused by people suggesting there's a charge. at the time of this review, it's free and as far as I aware, always has been. Contributions are optional. There's a 3 Euro charge to go up to the roof. It's worth it for the views.\n", "publishedDate": "2014-09-19", "language": "en", "rating": 5}, {"id": 227125561, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d2223602-r227125561-Museu_de_la_Catedral-Barcelona_Catalonia.html", "text": "Outstanding view from the roof ! We spent 1:30 hours there from our day.\nWe payed 6? for each in the enterance............", "publishedDate": "2014-09-05", "language": "en", "rating": 4}, {"id": 225740437, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d2223602-r225740437-Museu_de_la_Catedral-Barcelona_Catalonia.html", "text": "We visited during Sunday Mass which was reverent and mesmerizing. The architecture is exquisite. A wonderful experience not to be missed!", "publishedDate": "2014-08-31", "language": "en", "rating": 5}, {"id": 223804633, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d2223602-r223804633-Museu_de_la_Catedral-Barcelona_Catalonia.html", "text": "I have some concerns regarding places of worship that have taken on characteristics of a business.\n\nThey charge an entrance fee which at the time of writing will cost a family of two teenagers €24. When you enter the cathedral there are further demands for money. Collection boxes are everywhere. If you want to know more about a particular exhibit an audio clip can be heard by using a phone handset receiver located next to the exhibit. This will cost another €.\n\nWheelchair access is via a side entrance where a rather steep ramp will take you into the cathedral.\n\nRegarding the aesthetics of the building, this is down to personal preference. I prefer the simpler architecture of the Santa Maria del Mar which is a short walking distance from this place.", "publishedDate": "2014-08-23", "language": "en", "rating": 2}, {"id": 220075328, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d2223602-r220075328-Museu_de_la_Catedral-Barcelona_Catalonia.html", "text": "Firstly, ladies please ensure that you do not have a short skirt on/short shorts - and if you do, ensure you have something with you to cover your legs up.\n\nSecondly, enjoy. The building is beautiful inside - and though I'm not personally a religious person, I found this a very relaxing peaceful place to be. The courtyard complete with it's resident swans is well with a visit. ", "publishedDate": "2014-08-06", "language": "en", "rating": 5}, {"id": 213965750, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d2223602-r213965750-Museu_de_la_Catedral-Barcelona_Catalonia.html", "text": "First off ladies, make sure you have a shawl to cover your legs and bare arms.  They have people selling shawls outside the cathedral.  Inside is just beautiful.  Altho I am of different religion I appreciate churches & cathedrals & pay much respect.  Take the time to appreciate the architecture & the  beautiful surroundings.  This is a must see!", "publishedDate": "2014-07-06", "language": "en", "rating": 5}, {"id": 212865261, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d2223602-r212865261-Museu_de_la_Catedral-Barcelona_Catalonia.html", "text": "This cathedral is beautiful.  The courtyard is beautiful, the architecture is stunning, and you must at least take pictures of the outside - because it is gorgeous to look at.\n\nWe went in the afternoon and paid 6 euro each, which I didn't think was bad.  We toured it for maybe 1-1.5 hours.  The views at the top using the elevator are amazing as well.\n\nYou have to respect this ancient Cathedral as it is spectacular inside as well. We stayed in the Gothic area and it was a mere 5 minute walk here. Inside is massive and it almost takes your breath away upon entrance.  If you have time to tour here, it is worth the visit.  Plus, there is plenty to do in the area after you tour.  Take a long walk around the cathedral on the outside as well, different views offer great photo opportunities that you wouldn't expect.  At night, it is just as beautiful, if not more so.  Plus, it's quiet and perfect for a little relaxation.\n\nWhile it may not be in the top 10 must see in Barcelona, it was the first place we toured due to proximity and we enjoyed it immensely.", "publishedDate": "2014-06-30", "language": "en", "rating": 4}, {"id": 211329181, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d2223602-r211329181-Museu_de_la_Catedral-Barcelona_Catalonia.html", "text": "One of the few buildings you shouldn't miss when in Barcelona.\nGive a couple of hours, if you really enjoy the details in the structural architecture.", "publishedDate": "2014-06-21", "language": "en", "rating": 5}, {"id": 210815077, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d2223602-r210815077-Museu_de_la_Catedral-Barcelona_Catalonia.html", "text": "One of our favorite Basilica in Barcelona!Building began in 1298 under the reign of King James II. This Cathedral was and is the seat of all bishops that have overseen the diocese of Barcelona. winding staircase to access the cloister, and see the entire Cathedral. There is an elevator to the roof next to the Door of St. Yves,  that overlooks two bell towers, two Gothic spires as well as a breath taking view of Barcelona.", "publishedDate": "2014-06-17", "language": "en", "rating": 5}, {"id": 210765454, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d2223602-r210765454-Museu_de_la_Catedral-Barcelona_Catalonia.html", "text": "The cathedral is stunning, me and my partner kept going passed it on the bus until we finally jumped off to have a look.\n\nIf you're female make sure you are wearing a shawl/long shorts or a long skirt otherwise you will not be allowed in. You have to appreciate and respect this.\n\nIt's truly magnificent inside, very beautiful and calming.\n\nIt's definitely one of the places to see if in Barcelona. ", "publishedDate": "2014-06-17", "language": "en", "rating": 5}, {"id": 208855047, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d2223602-r208855047-Museu_de_la_Catedral-Barcelona_Catalonia.html", "text": "The Cathedral is certainly one of rare highlights of the Barri Gotik. A beautiful building with an amazing cloister (and its famous geese!) and a gorgeous fountain not to be missed.\n\nLike most areas in the Barri Gotik, it's mobbed by tourists most of the time, even more so because entrance is free in the morning (until 2 PM), so you may want to pay a fee in the afternoon to get some quiet. Still, well worth seeing.", "publishedDate": "2014-06-04", "language": "en", "rating": 5}, {"id": 206627607, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d2223602-r206627607-Museu_de_la_Catedral-Barcelona_Catalonia.html", "text": "This Cathedral is a real gem, in the Barri Gothic area and it's free.    Imposing outside and no queues and inside, what an amazing array of alters, stained glass windows and statues, all regal, and majestic, we decided not to queue for the Familia Sagrida and go for this one instead.   We hopped off the Barcelona red tourist bus and spent time there\n\n", "publishedDate": "2014-05-22", "language": "en", "rating": 5}, {"id": 205373735, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d2223602-r205373735-Museu_de_la_Catedral-Barcelona_Catalonia.html", "text": "Not just any cathedral, this is truly spectacular. Take a long slow walk around & don't forget to go up to the roof top. There is always something to view with amazement from the top of anywhere is Barcelona", "publishedDate": "2014-05-13", "language": "en", "rating": 5}, {"id": 194881961, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d2223602-r194881961-Museu_de_la_Catedral-Barcelona_Catalonia.html", "text": "This cathedral is done in the gothic architecture style so its very different from the Roman basilicas and especially from the Sangrada Family Basilica. The interior is darker than others I've seen but more fascinating. Its defiantly a masterpiece of design. Its free to visit and there's plenty to see. The inside also has plenty of Gothic style paintings.", "publishedDate": "2014-02-21", "language": "en", "rating": 4}, {"id": 191412539, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d2223602-r191412539-Museu_de_la_Catedral-Barcelona_Catalonia.html", "text": "To know about the Gothic times of Spanish History visiting this 800-900 years old cathedral is a must. We are fortunate that we have seen the restored master pieces which were so cleaned over the last 7-8 years. Many evenings there are group public balls organised in front of the Cathedral in the main square.  The music is played by the band of the Cathedral, and you can join if you are know the steps.", "publishedDate": "2014-01-20", "language": "en", "rating": 4}, {"id": 184038588, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d2223602-r184038588-Museu_de_la_Catedral-Barcelona_Catalonia.html", "text": "We were very impressed by the Cathedral and it was one of the more memorable places we visited.\nYou can look around the inside and even go onto the roof all for about 6E each.\n \nAlthough there are plenty of people looking round – it does not feel like a tourist location.", "publishedDate": "2013-11-08", "language": "en", "rating": 4}, {"id": 183168692, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d2223602-r183168692-Museu_de_la_Catedral-Barcelona_Catalonia.html", "text": "This is a must see while in Barcelona.  I found it\nvery different from the other churches that I have\nvisited in all of my trips. The columns are unbelievable\nand the simplicity of the main altar just beautiful.", "publishedDate": "2013-11-01", "language": "en", "rating": 4}, {"id": 180296779, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d2223602-r180296779-Museu_de_la_Catedral-Barcelona_Catalonia.html", "text": "This is a more sombre experience than Gaudi's masterpiece. You have to cover shoulders/ legs or just generally too much flesh. I had to buy a shawl on the way in. interesting old building, plenty to see but most of the explanations are not in English so I was unable to learn about much of the history or why there are geese living in the middle. You can go up on the roof which is worth the entrance fee alone. Definitely worth a look inside if you are interested in old buildings.", "publishedDate": "2013-10-09", "language": "en", "rating": 4}, {"id": 179027309, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d2223602-r179027309-Museu_de_la_Catedral-Barcelona_Catalonia.html", "text": "Beautiful cathedral to enjoy along with the other tourists.  Such history around to capture with the camera. A shame that the restoration is taking away part of the old look and feel.\n\nThe elevevator to the rooftop can be missed as it is certainly not worth paying for.", "publishedDate": "2013-09-29", "language": "en", "rating": 4}, {"id": 171977397, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d2223602-r171977397-Museu_de_la_Catedral-Barcelona_Catalonia.html", "text": "Been to this place today. But we didn't go inside. It has 6 .00 euro entrance . We we're running out of time to go around the city so we just look around . We walked around the Catedral and the old buildings are just so beautiful. Every corner is piece of Art .It's beautiful .", "publishedDate": "2013-08-12", "language": "en", "rating": 3}, {"id": 153347612, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d2223602-r153347612-Museu_de_la_Catedral-Barcelona_Catalonia.html", "text": "We specifically went to this cathedral on sundays so to enjoy the sardana, the catalan folk dance with nice music infront of this cathedral, a place call placa nova. \n\nI would rank it amongst the MUST if you visit barcelona. \n\nMetro: Jaume 1, walk for 5-10mins to reach here. Once you are out from the mtro exit, look for patisserie le colmena at the side of the metro exit outisde. personally felt its 1 of the best undiscovered pastry i have tried,", "publishedDate": "2013-02-27", "language": "en", "rating": 4}, {"id": 141802502, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d2223602-r141802502-Museu_de_la_Catedral-Barcelona_Catalonia.html", "text": "The art collection of the museum itself is very good, but one has to go up many stairs to many floors to see all of it.", "publishedDate": "2012-10-01", "language": "en", "rating": 4}]}}]