[{"locationId": 244201, "name": "Center of Contemporary Culture of Barcelona (CCCB)", "placeType": "ATTRACTION", "reviewListPage": {"reviews": [{"id": 730274924, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d244201-r730274924-Center_of_Contemporary_Culture_of_Barcelona_CCCB-Barcelona_Catalonia.html", "text": "Ancient charity house transformed into a cultural building with a library and expositions areas. You can get it for free to admire the cloister or rest into its library. The expositions are temporal and sometimes free.\nYou can ask about if it's allowed to get into the terrasse on top of the building, it is open some days of the year.", "publishedDate": "2019-12-02", "language": "en", "rating": 4}, {"id": 721262471, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d244201-r721262471-Center_of_Contemporary_Culture_of_Barcelona_CCCB-Barcelona_Catalonia.html", "text": "Lots of it appeared to be closed off and the viewing platform was also closed, so perhaps I didn't have the best experience. But I enjoyed the other museums of Barcelona a lot more.", "publishedDate": "2019-10-25", "language": "en", "rating": 3}, {"id": 702761406, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d244201-r702761406-Center_of_Contemporary_Culture_of_Barcelona_CCCB-Barcelona_Catalonia.html", "text": "I stumbled upon this place after leaving the Contemporary Art Museum. I was delighted to find some postcards in the gift shop.", "publishedDate": "2019-08-25", "language": "en", "rating": 4}, {"id": 680733034, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d244201-r680733034-Center_of_Contemporary_Culture_of_Barcelona_CCCB-Barcelona_Catalonia.html", "text": "Went for the photo exhibit. It was very crowded and the lighting wasn't that great. Probably would not return unless an exhibition really moved me.", "publishedDate": "2019-06-11", "language": "en", "rating": 3}, {"id": 676554568, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d244201-r676554568-Center_of_Contemporary_Culture_of_Barcelona_CCCB-Barcelona_Catalonia.html", "text": "Arrived at 2:45pm on a Sunday to learn the museum and it's special exhibits were free after 3pm (bonus!) Spent an enjoyable 30 minutes in the gift shop - with a thought provoking book collection (mostly Spanish, some English) and design inspired gifts / clothes. A trip to the WPP 2019 photo exhibit wretched my guys with images of ICE detention / Venezuelan poverty. Then, the Quantum exhibit was one of the most thought provoking science / art / philosophy disays I have seen. Truly enjoyed the afternoon. Not all future exhibitions displays are likely be as good; however, if this is the standard I will be back! Recommend.", "publishedDate": "2019-05-26", "language": "en", "rating": 5}, {"id": 675994732, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d244201-r675994732-Center_of_Contemporary_Culture_of_Barcelona_CCCB-Barcelona_Catalonia.html", "text": "Fantastic place and amazing exhibition\nwe loved the place and the exhibition\nwe could have stayed all day!\nvery nice patio\nhighly recommended", "publishedDate": "2019-05-23", "language": "en", "rating": 5}, {"id": 673733775, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d244201-r673733775-Center_of_Contemporary_Culture_of_Barcelona_CCCB-Barcelona_Catalonia.html", "text": "CCCB is currently having a Word Press Photo exhibition among others and I really liked the experience despite the fact that the mirador on top of the building was closed.\nFYI - you can have a free entrance from 3pm every Sunday.", "publishedDate": "2019-05-13", "language": "en", "rating": 5}, {"id": 663683372, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d244201-r663683372-Center_of_Contemporary_Culture_of_Barcelona_CCCB-Barcelona_Catalonia.html", "text": "if you have a few extra time in Barcelona, I would definitely recommend to visit CCCB. It's not a museum but a cultural center focused in exploring the borders of the present. It's free on Sundays and the rest of the year the ticket cost around 6 euros.", "publishedDate": "2019-04-04", "language": "en", "rating": 5}, {"id": 637331556, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d244201-r637331556-Center_of_Contemporary_Culture_of_Barcelona_CCCB-Barcelona_Catalonia.html", "text": "I came to Barcelona specifically for this exhibition as a birthday treat. I was not at all disappointed. Didn't have to queue at all and it was so cheap to get in.  I am a big Kubrick fan anyway but I do believe this would be very interesting for anyone to visit. The only thing that irritated me was the guided tour taking up the entire space in the rooms while we were trying to look around but I skipped ahead a bit and it was fine. Seeing some of the genuine articles from some of my favourite Kubrick movies was pretty damn awesome and I immediately went on a Kubrick movie marathon upon returning home. :)", "publishedDate": "2018-12-03", "language": "en", "rating": 4}, {"id": 636804469, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d244201-r636804469-Center_of_Contemporary_Culture_of_Barcelona_CCCB-Barcelona_Catalonia.html", "text": "Another visit during the free museum nights in the city and I must say we waited like an hour to get in. Busy night in the city. But it worth the wait cause the photo exhibition was fantastic.", "publishedDate": "2018-12-01", "language": "en", "rating": 4}, {"id": 632334433, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d244201-r632334433-Center_of_Contemporary_Culture_of_Barcelona_CCCB-Barcelona_Catalonia.html", "text": "Seen here an exposition about the life and work of Stanley Kubrick. A well designed experience, even for the not-so-cinemaniacs. File fragments, well explained texts, original film paraphernalia. Spent there about 80 minutes and had to leave become they closed at 8pm. But we could have stayed easily double the time. ", "publishedDate": "2018-11-10", "language": "en", "rating": 5}, {"id": 621567387, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d244201-r621567387-Center_of_Contemporary_Culture_of_Barcelona_CCCB-Barcelona_Catalonia.html", "text": "This was recommended by a local friend, and did not disappoint. Really cool experimental space with a well-thought out exhibition. \"La Llum Negra\" (Secret traditions in art of the last fifty years) admittedly isn't for everyone. But if you are a little weird and like outsider art, this is probably for you; a slant towards the occult and some art inspired by mind altering substances. \nThe gift store is a treat and everyone was helpful and friendly. I would definitely check back in on my next visit to BCN.  Bonus - the longest, steepest escalator ride I've ever experienced.", "publishedDate": "2018-10-02", "language": "en", "rating": 4}, {"id": 602992829, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d244201-r602992829-Center_of_Contemporary_Culture_of_Barcelona_CCCB-Barcelona_Catalonia.html", "text": "This is an art installation that might appeal to a lot of people of a certain age. I dont know what to make of it. Its very 1960 70s I think and there was so much experimental art going on To coin a phrase - People were trying ti find themselves. Most shouldnt have bothered. Its a strange exhibition to me - It will appeal to lots and lots will find it rubbish. Its a suck it and see place. The building is awesome and if you visit make sure you dont miss the top floor for Barcelona views.", "publishedDate": "2018-08-05", "language": "en", "rating": 4}, {"id": 568803528, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d244201-r568803528-Center_of_Contemporary_Culture_of_Barcelona_CCCB-Barcelona_Catalonia.html", "text": "My friend and I visited this on a very rainy day of our trip, wanting to stay inside. We must admit, when we entered we were a little underwhelmed as it was a very large space with not much appeal. We had read online that they charge per exhibition, so we asked how many they had on at the front desk - and they only had ONE on. We are from London so used to visit lots of museums full of art and interest - so this put us off a little, but as we'd already paid for transport to get here, we thought we may as well give it a go as the price was very low. Then we visited the toilets and they were quite run down and smelt bad.\n\nFirst impressions aren't always right because WOW - we visited the exhibition on climate change and I must say it was innovative, interesting and visually stunning. We were so surprised at how good it was considering all of the above. The exhibition included lots of photography and installation pieces with very clear explanations. Everything was in English which was great for us to be able to understand the art pieces. \n\nThe exhibition was very interactive, the highlight of the exhibition was an immersive experience where you put on headphones in one of the halls, and interact unknowingly with other guests - we were blown away how well it was done.\n\nWe would have loved to see some more exhibitions there so we hope they add more as it would be an amazing gallery if they did! At under 5 euros a person, go and visit!", "publishedDate": "2018-03-26", "language": "en", "rating": 4}, {"id": 567610489, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d244201-r567610489-Center_of_Contemporary_Culture_of_Barcelona_CCCB-Barcelona_Catalonia.html", "text": "Popped in here on a Tuesday morning whilst attempting to gain entry to the Contemporary Art museum which I subsequently discovered was closed on that day.\n\nI gained free entry with my Barcelona pass - normal fee is €12 - and was glad that I didn't waste my money on what I was about to see.\n\nThe current exhibition is called \"After the End of the World\" and consisted of a video presentation in which the narrator lectured the audience on environmental issues. Whilst I have every sympathy with these views, I did not care for the banal and patronising tone and soon departed.", "publishedDate": "2018-03-19", "language": "en", "rating": 2}, {"id": 555028167, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d244201-r555028167-Center_of_Contemporary_Culture_of_Barcelona_CCCB-Barcelona_Catalonia.html", "text": "The exhibition about environmental issues was OK. We had an Articket and this place was included in the price. So we visited the place and it was all right. We would not have visited this place if we had to pay a full entry price.", "publishedDate": "2018-01-20", "language": "en", "rating": 3}, {"id": 552789708, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d244201-r552789708-Center_of_Contemporary_Culture_of_Barcelona_CCCB-Barcelona_Catalonia.html", "text": "I appreciate that this review will quickly date as I can only review the one exhibit, but Después del Fin del Mundo (After the End of the World) was a nicely presented and quite engaging exhibition on the environment and the impact humans have on earth.\n\nThe layout of CCCB is quite funny in that the ticket desk is underground, and then you go several floors up via two extremely high escalators. The exhibition starts in earnest with some very nicely presented aerial photos showing the extent that humans change the face of the planet. Some photos showed both the negative and positive impact humans have; such as dams reducing our reliance on fossil fuels but at the cost of changing the landscape beyond recognition and flooding villages. \n\nThe exhibition includes set pieces, videos and photography, but also a REALLY clever show at the half-way point. Don't skip it on account of having to wait a little while, it's super clever and (like the whole exhibition) can be enjoyed in English, Spanish or Catalan. \n\nSome parts were perhaps a bit style over substance, and other parts were maybe a little preachy, but it was nicely presented and was food for thought. I managed to lose myself for several hours and it was probably my favourite exhibition I've seen from a few visits to CCCB.\n\nOh, entry is free on Sunday afternoons, too (check their website).", "publishedDate": "2018-01-09", "language": "en", "rating": 4}, {"id": 551277973, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d244201-r551277973-Center_of_Contemporary_Culture_of_Barcelona_CCCB-Barcelona_Catalonia.html", "text": "The exhibition around environmental issues wasn't what we expected from this museum and it felt like we were being lectured to and it was not delivering the message we have heard mant times before in an interesting or new way. Didn't feel like a high quality museum or that much investment had been made here.", "publishedDate": "2018-01-03", "language": "en", "rating": 3}, {"id": 543781990, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d244201-r543781990-Center_of_Contemporary_Culture_of_Barcelona_CCCB-Barcelona_Catalonia.html", "text": "We loved the end of the world exhibit. The aerial pictures that you walked through were very interesting.", "publishedDate": "2017-11-28", "language": "en", "rating": 4}, {"id": 532629017, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d244201-r532629017-Center_of_Contemporary_Culture_of_Barcelona_CCCB-Barcelona_Catalonia.html", "text": "Included as part of the ARTICKETBCN, CCCB was ‘supposedly’ included on the Pass but due to the “Bjork Digital” Exhibit an additional €12 was requested during our visit.  No discount on either the pass or the exhibit even though we were not told of this fact at the original point of purchase.  Obviously Bjork needs the money…I mean honestly, who is listening to her garbage these days?", "publishedDate": "2017-10-13", "language": "en", "rating": 1}, {"id": 516201886, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d244201-r516201886-Center_of_Contemporary_Culture_of_Barcelona_CCCB-Barcelona_Catalonia.html", "text": "We went on a Sunday afternoon as there is free entry after 3pm. The photobook exhibition was excellent. It was informative and put together in very interesting ways. I thoroughly enjoyed this and learned much for attending this exhibition. I will return to view the Bjork exhibition soon!", "publishedDate": "2017-08-22", "language": "en", "rating": 5}, {"id": 516197108, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d244201-r516197108-Center_of_Contemporary_Culture_of_Barcelona_CCCB-Barcelona_Catalonia.html", "text": "Very interesting space but only 1 exhibit of photos and another ticketed cost video exhibit. Was not worth the hour although we used our Artticket. Should check their website first. ", "publishedDate": "2017-08-22", "language": "en", "rating": 2}, {"id": 499696656, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d244201-r499696656-Center_of_Contemporary_Culture_of_Barcelona_CCCB-Barcelona_Catalonia.html", "text": "I saw a fantastic exhibit there about photo books. Really cool, really well laid out, and I would recommend!", "publishedDate": "2017-07-08", "language": "en", "rating": 4}, {"id": 491621213, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d244201-r491621213-Center_of_Contemporary_Culture_of_Barcelona_CCCB-Barcelona_Catalonia.html", "text": "The guidebooks are like \"come and see whatever is here\", which sounds a bit unfocused.  The layout of the museum is sort of odd - you end up taking elevators or escalators to get to the fourth floor but there isn't anything on most of the other floors.  Ignoring that, the exhibit on Photobooks is simply wonderful.  It is well curated and fascinating.  In fact, we didn't provide enough time to go through the exhibit.  \n\nAnd with the Barcelona Museum ArtTicket Pass, it is  inexpensive too.", "publishedDate": "2017-06-08", "language": "en", "rating": 5}, {"id": 482362486, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d244201-r482362486-Center_of_Contemporary_Culture_of_Barcelona_CCCB-Barcelona_Catalonia.html", "text": "I was really looking forward to seeing this place though it was a big disappointment...\nHuge empty places inside....\nA strange exhibition on photobook - took less than 10 minutes for us. \nThe only reason why we entered the World Press Photo 2017 is the free admission on Sunday afternoon. What a mistake. The crowd was excessive, we could hardly move inside....We checked the photos from a distance and left in 10 minutes.\nHave no idea why this \"exhibition\" attracts so many people....It has little to do with art, only the same repetitive stuff for years...\nDo not waste your time here.", "publishedDate": "2017-05-07", "language": "en", "rating": 1}, {"id": 476870888, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d244201-r476870888-Center_of_Contemporary_Culture_of_Barcelona_CCCB-Barcelona_Catalonia.html", "text": "Set in a striking modern building near Las Ramblas this centre holds a variety of different exhibitions in a suite of rooms on the third floor (accessed by lift or long escalators). We spent a peaceful and very interesting hour looking at a well curated and cleverly presented exhibition about photo-books. Had the weather not been so nice and we'd had more time we could easily have spent the afternoon here. It's also excellent value", "publishedDate": "2017-04-18", "language": "en", "rating": 5}, {"id": 475175058, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d244201-r475175058-Center_of_Contemporary_Culture_of_Barcelona_CCCB-Barcelona_Catalonia.html", "text": "This complex of buildings mixing old and modern architecture is amazing. The day we went there was a fair for children, celebrating Sant Jordi's day for children, with an exhibition of many bookstores with books for children, theater and story telling.  The organization was great, with signage for every attraction, restaurant and bathroom. This was a preview for Sant Jordi's day, when people exchange books as a gift, a Catalonian tradition.s", "publishedDate": "2017-04-12", "language": "en", "rating": 4}, {"id": 470571669, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d244201-r470571669-Center_of_Contemporary_Culture_of_Barcelona_CCCB-Barcelona_Catalonia.html", "text": "I visited CCCB with my Articket Art Passport (6 museums with one ticket). The exhibition on at the time (1000m2 Architecture and Sexuality) was really interesting to me and incorporated so many aspects related to the topic (film, literature, architecture, pop culture, cultural movements, art, etc.). It was not crowded at all and I literally read everything and looked at everything in the exhibition. Descriptions were mainly available in Spanish, Catalan, and English. I liked the space. An excellent way to spend an afternoon.", "publishedDate": "2017-03-27", "language": "en", "rating": 5}, {"id": 465837930, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d244201-r465837930-Center_of_Contemporary_Culture_of_Barcelona_CCCB-Barcelona_Catalonia.html", "text": "There's only 10 days left of this stunning exhibition! Their 1000sq m display covers the entire 2nd floor. Very well researched, imaginatively curated to explore and explain the often unconsidered link between architecture and sexuality. I stayed for nearly three hours and if anyone wants to arrange a meet-up, I'll certainly join you for another visit.", "publishedDate": "2017-03-09", "language": "en", "rating": 5}, {"id": 458952695, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d244201-r458952695-Center_of_Contemporary_Culture_of_Barcelona_CCCB-Barcelona_Catalonia.html", "text": "located around the corner of MACBA, the CCCB at the moment shows an exhibition on Sex & Architecture. I must confess that I was pretty disappointed. I guess it is a great thing for a catholic country that did not live its 68 movement due to the then dictatorship. But for me, it was just a lot of the things seen hundreds of times . and fed up with it to the top. James, Bond, Barbarella, Woody Allen... name it and it is there. But ok, this is a museum of contemporary culture. so maybe for youngsters, this is all new and already history...", "publishedDate": "2017-02-12", "language": "en", "rating": 3}, {"id": 447882094, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d244201-r447882094-Center_of_Contemporary_Culture_of_Barcelona_CCCB-Barcelona_Catalonia.html", "text": "We went to to cccb in december 2016.\nOnly one exibithion was open. \nWe liked the building and the area.\nUnfortunately it was not possible to go to the mirador on the 4. Th floor.", "publishedDate": "2016-12-30", "language": "en", "rating": 4}, {"id": 442138201, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d244201-r442138201-Center_of_Contemporary_Culture_of_Barcelona_CCCB-Barcelona_Catalonia.html", "text": "I receive regulary newsletter from Center of Contemporary Culture of Barcelona (CCCB) , so we visited the three exibitions, which  offers in these days: first one was showing photos from different  political events, which were on press top-pages (mostly horrible like wars). The second exibition, entitled \"Architecture and Sexuality\" was a pleasant surprise - from books' pages to movie fragments and with great variety of sexual aspects. The most unexpected was the third exibition - Ramon Llull and his cosmogonic influence on different artist and philosophers.", "publishedDate": "2016-12-05", "language": "en", "rating": 5}, {"id": 431694006, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d244201-r431694006-Center_of_Contemporary_Culture_of_Barcelona_CCCB-Barcelona_Catalonia.html", "text": "Espeacily in a hot crowded summer day in Barcelona, it is a true recreation to visit. If you looking for a place to break away and relax a little, could be a perfect choice.", "publishedDate": "2016-10-25", "language": "en", "rating": 5}, {"id": 430450318, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d244201-r430450318-Center_of_Contemporary_Culture_of_Barcelona_CCCB-Barcelona_Catalonia.html", "text": "The CCCB had been pointed out to me the day before while on a tour and I took a mental note to visit;  what better than on a rainy Spain day?!\n\nAs it's an exhibition space, the events change frequently, so your mileage may vary, but when I visited the exhibit was \"Making Africa. A Continent of Contemporary Design\". It was fascinating in that it challenges what it means to be African; what is Africa; and what is design. Granted, I was viewing this in Spain, but great job by Barcelona for hosting such a great exhibit and being a participant in the world community.\n\nIf my experience with CCCB is anything to go by, likely any event you attend at CCCB will be well worth your time!", "publishedDate": "2016-10-21", "language": "en", "rating": 4}, {"id": 430123513, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d244201-r430123513-Center_of_Contemporary_Culture_of_Barcelona_CCCB-Barcelona_Catalonia.html", "text": "The most important thing is to check what is the current exhibition (only one when we visited). There was - La Maquina de Pensar of Raul Lull, it was very nice and a young lady did an excellent tour which upgraded our visit. If you buy the Articket (which I recommend) visit also this place. Dont under estimate this place, but bottom line it will depends on how long you are staying in Barcelona.\nThe area - El Raval - is very special, full of nice places and young people.", "publishedDate": "2016-10-20", "language": "en", "rating": 4}, {"id": 427545974, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d244201-r427545974-Center_of_Contemporary_Culture_of_Barcelona_CCCB-Barcelona_Catalonia.html", "text": "This autumn (until Dec 11th) this contemporary cultural center has chosen to focus on the philosopher Ramon Llull (1232-1316) and how his socalled combinatorial art has inspired artists and scientists for centuries, among other Dali.", "publishedDate": "2016-10-13", "language": "en", "rating": 4}, {"id": 423523622, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d244201-r423523622-Center_of_Contemporary_Culture_of_Barcelona_CCCB-Barcelona_Catalonia.html", "text": "Lovely well thought out temporary exhibition space. Fabulous architure. Near the law ramblas. That's all I have to say.", "publishedDate": "2016-09-29", "language": "en", "rating": 5}, {"id": 418079195, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d244201-r418079195-Center_of_Contemporary_Culture_of_Barcelona_CCCB-Barcelona_Catalonia.html", "text": "The beginning of your path through this museum is really cool – strings with dark eerie lighting that makes key items on your person appear glow in the dark. Unfortunately only one exhibit (The Thinking Machine) was open at the time we went but it was still quite interesting. Some really fascinating items – even if we may not fully understand the purpose or meaning. Also a great view from Mirador Hall – don’t miss that. This museum can be tough to find but it’s pretty much right behind the MACBA. Worth a visit for sure! Most signage is translated into English.", "publishedDate": "2016-09-13", "language": "en", "rating": 4}, {"id": 413385050, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d244201-r413385050-Center_of_Contemporary_Culture_of_Barcelona_CCCB-Barcelona_Catalonia.html", "text": "I have experienced a contradictory experience with the exhibition on Ramon Llull. It is impressive for the effort, but difficult to understand because of the complexity of the work by Ramon Llull. I have always thought that if Ramon Llull had been British, he would have pointed out as the greatest philosopher ever. However, he is only Catalan. I recomend the exhibition because you get the idea of how great he was in different ways, specially trying to put together different cultures (Christian and Muslim) and making use of Catalan as his primary language to convey religion to the population of that time... Great, but difficult to understand!!", "publishedDate": "2016-08-31", "language": "en", "rating": 5}, {"id": 410707740, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d244201-r410707740-Center_of_Contemporary_Culture_of_Barcelona_CCCB-Barcelona_Catalonia.html", "text": "We bought Art Tickets so we could see 6 art museums without queueing in August, and frankly I don't recommend doing that. This particular venue was the best of the 4 we had time to visit during our trip here. By far the best exhibition in all the Barcelona art galleries we visited, was \"Making Africa\" at CCCB, absolutely incredible. But it finishes 28th August, so not likely to be there when people are reading this. The venue is free Sunday afternoons so our Art Ticket was pointless at this one.", "publishedDate": "2016-08-25", "language": "en", "rating": 4}, {"id": 403317004, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d244201-r403317004-Center_of_Contemporary_Culture_of_Barcelona_CCCB-Barcelona_Catalonia.html", "text": "I liked the Llull exposition very much, also it was awesome to see some masterpieces if Dali. Africa is OK too.", "publishedDate": "2016-08-09", "language": "en", "rating": 4}, {"id": 385548858, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d244201-r385548858-Center_of_Contemporary_Culture_of_Barcelona_CCCB-Barcelona_Catalonia.html", "text": "Went her because the museum next door was closed two days in a row. It was about Africa when we visited. Small display and a bit boring I taught. ", "publishedDate": "2016-06-24", "language": "en", "rating": 3}, {"id": 380138012, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d244201-r380138012-Center_of_Contemporary_Culture_of_Barcelona_CCCB-Barcelona_Catalonia.html", "text": "Have been quite a few times now to the CCCB and each was as different and rewarding as the last, with great exhibitions and concerts for free. The Primavera Sound concerts were energetic and engaging, and the exhibitions varied and interesting. Nice architecture too and pretty central. Great shop too! Worth a look in.", "publishedDate": "2016-06-05", "language": "en", "rating": 4}, {"id": 378275455, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d244201-r378275455-Center_of_Contemporary_Culture_of_Barcelona_CCCB-Barcelona_Catalonia.html", "text": " This is near the top of the mountain and the red tour bus stops there. It looks interesting, but DO NOT GO THERE, IT IS A TOURIST DIVE. The music is crazy, stupid, blasted loud and is emceed by someone who sounds like a Cancun beach party with better Spanish. We could not find a decent restaurant in the whole place. It's really not fair to tell you about my piaia which was really spaghetti chopped up in minuscule pieces with a tomato sauce and without saffron. We were grateful to find clean bathrooms.\n\nThere were some cute shops with art prints and some museums that didn't allow us to photograph? BUT, there are so many wonderful, stunningly beautiful and impressive museums in Barcelona that IMO, your time would be better spent elsewhere.", "publishedDate": "2016-05-31", "language": "en", "rating": 3}, {"id": 375252664, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d244201-r375252664-Center_of_Contemporary_Culture_of_Barcelona_CCCB-Barcelona_Catalonia.html", "text": "The exhibit is informative and offers diverse perspectives on design and art in africa. Particular intriguing were the video interviews.", "publishedDate": "2016-05-21", "language": "en", "rating": 5}, {"id": 370161507, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d244201-r370161507-Center_of_Contemporary_Culture_of_Barcelona_CCCB-Barcelona_Catalonia.html", "text": "This is just a beautiful space, I've just just come back from the making Africa exhibition and it was enlightening and beautiful at the same time. Set in an incredible space and building that is just breathtaking.\n\nThe staff here were great really helpful directing my reticent partner to the library where she read while i took hours pouring over every inch.\n\nFind this place...", "publishedDate": "2016-05-04", "language": "en", "rating": 5}, {"id": 336195421, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d244201-r336195421-Center_of_Contemporary_Culture_of_Barcelona_CCCB-Barcelona_Catalonia.html", "text": "Human+ is a very interesting exhibition and well done. It shows what science is doing for people who face physical challenges owing to amputations, illness or birth defects. It also poses important questions about how we want to be human in the future. Should we all add antennas to our heads in order to be able to sense colours?", "publishedDate": "2015-12-31", "language": "en", "rating": 5}, {"id": 335358740, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d244201-r335358740-Center_of_Contemporary_Culture_of_Barcelona_CCCB-Barcelona_Catalonia.html", "text": "In Barcelona for the holidays. We saw two terrific exhibits: DRAP15, a show of Catalan artists who use recycled and found materials. Terrific work and great idea - made me think about what recycled material could be in my own work (choreography). Also saw The Human Experience, an exhibit about the future of what it will mean to be human in light of technological advances, and that frame for looking at the Anthropocene Era. Extraordinary, disturbing and packed with people who were watching, listening, writing, reading, listening and otherwise really engaged with the exhibit. It was not your grandmother's museum. Thanks for a great visit!", "publishedDate": "2015-12-27", "language": "en", "rating": 5}, {"id": 335304790, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d244201-r335304790-Center_of_Contemporary_Culture_of_Barcelona_CCCB-Barcelona_Catalonia.html", "text": "We have visited CCCB twice, today for the exhibit called 'Humans'. It is a well organized and huge space. Well mantained as well.", "publishedDate": "2015-12-27", "language": "en", "rating": 4}, {"id": 331594766, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d244201-r331594766-Center_of_Contemporary_Culture_of_Barcelona_CCCB-Barcelona_Catalonia.html", "text": "Great exhibition and beautiful pictures. While you would think it's about the most important events from 2015, it's an exhibition about the pictures that won prices over 2015. Still a great overview of the most important events over the past year and a half and some wonderful pictures. Definitely have to check out the video part at the end of the exhibition!", "publishedDate": "2015-12-09", "language": "en", "rating": 5}, {"id": 330801698, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d244201-r330801698-Center_of_Contemporary_Culture_of_Barcelona_CCCB-Barcelona_Catalonia.html", "text": "Sorry but I do not get it. There was a lot here, but my Spanish is insufficient to make it a valuable experience. Do not recommend ", "publishedDate": "2015-12-04", "language": "en", "rating": 3}, {"id": 322823088, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d244201-r322823088-Center_of_Contemporary_Culture_of_Barcelona_CCCB-Barcelona_Catalonia.html", "text": "This museum and library center is definitely off the tourist beaten path in Barcelona.  There were two exhibits when we visited, one on the Lucha Libre wrestling tradition of Mexico and the other on the future of the human species. They were both simply outstanding. Where else can you get dressed up as a Mexican wrestler and take your picture - for free?  The exhibit on the future of the human species was a more permanent exhibit and filled with information, interactives, challenging issues, and sensitive treatment of diversity of humanity.  This is worth a visit even if you are in Barcelona only for a few days and want to fill an hour or two with edutainment.", "publishedDate": "2015-10-28", "language": "en", "rating": 5}, {"id": 309057788, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d244201-r309057788-Center_of_Contemporary_Culture_of_Barcelona_CCCB-Barcelona_Catalonia.html", "text": "The exhibition is really nice but unluckily was not easily understandable for foreign people (there was a huge amount of videos available only in spanish) however I've found the English part really good! ", "publishedDate": "2015-09-10", "language": "en", "rating": 4}, {"id": 296265730, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d244201-r296265730-Center_of_Contemporary_Culture_of_Barcelona_CCCB-Barcelona_Catalonia.html", "text": "The quality of a big city can be judged by the quality of their cultural offerings. The CCCB is an amazing place, with well thought out, detailed exhibitions and inspiring events. \n\nWe just saw Busco Piso - about housing and urban development in Barcelona and Medellin. Amazing detail put into this urbanist exhibition.\n\nThe spaces are large and welcoming and the architecture is cool. There is an open air cinema in the courtyard at the moment (early August) showing short films in the evening. \n\nGreat bookshop, too. Great place to take a break from the heat and mass tourism.", "publishedDate": "2015-08-06", "language": "en", "rating": 5}, {"id": 294671302, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d244201-r294671302-Center_of_Contemporary_Culture_of_Barcelona_CCCB-Barcelona_Catalonia.html", "text": "This museum had only a few posters in English, so it wasn't really possible to make sense of it without knowing Spanish. A pitty, because it seemed like and interesting place and is part of the Articket, which I imagine many culturally interested tourists have.", "publishedDate": "2015-08-01", "language": "en", "rating": 2}, {"id": 289671974, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d244201-r289671974-Center_of_Contemporary_Culture_of_Barcelona_CCCB-Barcelona_Catalonia.html", "text": "We found this place by accident as the MACBA was closed on the Tuesday we planned on going (usually Mondays is the day when museums close in Barcelona) and this other museum just around the corner was open. Technically, it is not a museum but a temporary exhibits center with various levels for simultaneous expositions.  I give it 3 stars because it is not really a tourist place but more for students and such looking for more serious ways to spend 2 or 3 hours. You pay to see any one or all exhibits you are interested in. The multi media exhibitions at the first level were quite frankly a too eclectic mix-match of works made mainly by local names that its unlikely I will ever remember. The second and third level had virtually hundreds of works mostly by Spanish, South American and Asian art, environmental, social and architecture students on ways to solve demographic problems of today's societies utilizing art, recycling and minimalism. This place is like a cauldron of new ideas and movements, kind of expected in a city who gave audience to geniuses like Gaudi, Dali and Picasso in the last century. Quite interesting if that fits in your background. Bear in mind the exhibits here are all temporary. You can take pictures freely.", "publishedDate": "2015-07-16", "language": "en", "rating": 3}, {"id": 288863657, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d244201-r288863657-Center_of_Contemporary_Culture_of_Barcelona_CCCB-Barcelona_Catalonia.html", "text": "I took my 6 and 8 year old children to the CCCB and we spent a lovely 2 hours.  The museum space is large but the number of installations is small, which worked out well with two kids who tend to complain a lot in museums.  We saw the Sebald variations and the Piso Piloto exhibit, which explored the concept of housing I the cities of Barcelona and Medellin.  The installations were highly interactive and engaging for them.  The building itself is beautiful and made the children want to explore.  They were admitted free and it was 8 € for me.  It was a  very pleasant way to escape the heat and learn something new.", "publishedDate": "2015-07-14", "language": "en", "rating": 4}, {"id": 285579172, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d244201-r285579172-Center_of_Contemporary_Culture_of_Barcelona_CCCB-Barcelona_Catalonia.html", "text": "The current exhibition was not interesting. It was a collection of installations that dealt with living in an overcrowded world or such. I left in 10 minutes because I didn't like it. Strangely, from all 6 museums of the Articked that I have visited, I counted in this museum the most visitors that really took the time looking at the exhibits. They seemed very interested...", "publishedDate": "2015-07-04", "language": "en", "rating": 2}, {"id": 284258855, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d244201-r284258855-Center_of_Contemporary_Culture_of_Barcelona_CCCB-Barcelona_Catalonia.html", "text": "a great space and exemplary conversion. the CCCB provides a quality programme of cultural and creative activities and exhibitions. Its beside the better known MACBA so you can easily visit both.  Dont forget to check out their programme before visiting.  The space is cool in design and temperature and particularly now during the summer provides a welcome respite. During the winter its an essential part of any Barcelona cultural visit. \n\n", "publishedDate": "2015-06-30", "language": "en", "rating": 5}, {"id": 280883579, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d244201-r280883579-Center_of_Contemporary_Culture_of_Barcelona_CCCB-Barcelona_Catalonia.html", "text": "We stumbled upon this museum as we were staying nearby and were very impressed with the special exhibits. The curatorial staff did a fantastic job and I would absolutely check it out again. Visited in May 2014 - exhibits on big data and brothers quay were really good.", "publishedDate": "2015-06-17", "language": "en", "rating": 5}, {"id": 269128470, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d244201-r269128470-Center_of_Contemporary_Culture_of_Barcelona_CCCB-Barcelona_Catalonia.html", "text": "Having seen some other reviews on TripAdvisor, I had expecter more from this museum. It is located right next to the Museum of Contemporary Art, so very centrally located. However, the exhibits they had when I visited were not nearly as interesting as others I saw in Barcelona.", "publishedDate": "2015-04-30", "language": "en", "rating": 3}, {"id": 259375614, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d244201-r259375614-Center_of_Contemporary_Culture_of_Barcelona_CCCB-Barcelona_Catalonia.html", "text": "The Center of Contemporary Culture of Barcelona (CCCB) in El Raval is a great center. Exhibitions and interesting displays are always on. The center is free on Sundays and makes for a great day out in combination with visit the El Raval district.", "publishedDate": "2015-03-14", "language": "en", "rating": 4}, {"id": 237600555, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d244201-r237600555-Center_of_Contemporary_Culture_of_Barcelona_CCCB-Barcelona_Catalonia.html", "text": "We visited because we had the ArtTicket and this is one of the six museums that are included with the ticket. We were in El Ravel, and we heard that this is the place to see the local kids congregate and skateboard. It is.\n\nWe saw the Big Data exhibit. It was fascinating. How data was created with the first computers and use of computer punch cards, to today with the massive storage of data of all kinds. Data usage today is phenomenal with social media - and government spying.\n\nHow data is created, who creates it, how it is stored, how it is used, how it is mined. Exhibit display panels are in Catalan, Spanish and English.\n\nExhibit ends with video interview of Edward Snowden. \n\nA real surprise.", "publishedDate": "2014-11-02", "language": "en", "rating": 4}, {"id": 235017297, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d244201-r235017297-Center_of_Contemporary_Culture_of_Barcelona_CCCB-Barcelona_Catalonia.html", "text": "We visited this amazing place because it was next to MNAC and free with the Barcelona Card. It turned out to be the best gallery / museum surprise of our trip. There was an incredible puppetry and animation exhibition in August that went on for room after room and kept us captivated. There was so much to take in. This place is sometimes overlooked on the must-see list but it should not be. Allow 3 hours here. You won't be disappointed.", "publishedDate": "2014-10-18", "language": "en", "rating": 5}, {"id": 227620434, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d244201-r227620434-Center_of_Contemporary_Culture_of_Barcelona_CCCB-Barcelona_Catalonia.html", "text": "I like to go there on Sunday afternoon. The exhibitions are interesting, modern and understandable by everybody and creative activities for kids.", "publishedDate": "2014-09-07", "language": "en", "rating": 4}, {"id": 224157223, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d244201-r224157223-Center_of_Contemporary_Culture_of_Barcelona_CCCB-Barcelona_Catalonia.html", "text": "I went here on a sunday afternoon and it was a free entrance for all the exhibitions. I would strongly recommend the big bang data exhibition! It concerns everyone living in the 21st century and gives perspective into modern life. There is also free wi-fi in the building.", "publishedDate": "2014-08-24", "language": "en", "rating": 5}, {"id": 222934404, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d244201-r222934404-Center_of_Contemporary_Culture_of_Barcelona_CCCB-Barcelona_Catalonia.html", "text": "The exhibition on big data was brilliant it makes you sit back and question all the data that is being collect. As to the other exhibitions I found these to be very weird and freaky as it was about bones and death etc.", "publishedDate": "2014-08-19", "language": "en", "rating": 5}, {"id": 216423821, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d244201-r216423821-Center_of_Contemporary_Culture_of_Barcelona_CCCB-Barcelona_Catalonia.html", "text": "The big bang data exhibition excellently shows the background of our daily life data usage: social media, weather control, the news...the data analysis of everything we see around is put together with interesting videos, installations and diagrams.", "publishedDate": "2014-07-20", "language": "en", "rating": 5}, {"id": 210709788, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d244201-r210709788-Center_of_Contemporary_Culture_of_Barcelona_CCCB-Barcelona_Catalonia.html", "text": "i went three years ago here to a great exhibition about claudio magris and returned for the current piece, metamorfasis.  everything glides perfectly well, a mixture of videos, art on walls, on the floor and interactive pieces. upstairs was a collection about info/data and its uses and applications which was quite mind boggling, but the works of abatract/surrealist film makers and puppeteers downstairs was curiously creepy and very enticing, wandering from one dark fairytale to another.", "publishedDate": "2014-06-17", "language": "en", "rating": 4}, {"id": 208994816, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d244201-r208994816-Center_of_Contemporary_Culture_of_Barcelona_CCCB-Barcelona_Catalonia.html", "text": "We bought an Articket which included this museum , so we went.  I would not include this Center on the caliber of Miro or Picasso Museums.  The exhibit was a horrble excuse for 'art.'. 'Metamorphoses' exhibit was as though someone had stored truckloads of bizarre props, for decades, and then decided to put it all on display.  It was a perverted display of art.", "publishedDate": "2014-06-05", "language": "en", "rating": 1}, {"id": 204343435, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d244201-r204343435-Center_of_Contemporary_Culture_of_Barcelona_CCCB-Barcelona_Catalonia.html", "text": "As with every other museum we went to in Barcelona, the staff were friendly and helpful and the exhibitions were laid out beautifully.  The items they had collected were impressive and made for a very interesting afternoon.", "publishedDate": "2014-05-06", "language": "en", "rating": 4}, {"id": 199994205, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d244201-r199994205-Center_of_Contemporary_Culture_of_Barcelona_CCCB-Barcelona_Catalonia.html", "text": "It is a contemporary museum, so it is OK if it doesn't appeal to everybody's taste. Before you visit, you'd better check online what exhibitions are displayed at the moment and decide for yourself. When we visited it was \"Metamorphosis\" - bizzare, at times disturbing art of three different artists. It included puppets, dolls, films. I found them interesting and thought-provoking, my husband was a bit shocked and disgusted but that's what art is all about - it depends on you if you're going to love it or hate it. If you have time in Barcelona, I suggest you give it a chance. It's free with Barcelona card.", "publishedDate": "2014-04-05", "language": "en", "rating": 4}, {"id": 167439190, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d244201-r167439190-Center_of_Contemporary_Culture_of_Barcelona_CCCB-Barcelona_Catalonia.html", "text": "We had expected more from the contemporary art centre of Barcelona. But the building is worth a visit and we also enjoyed some of the photos upstairs. ", "publishedDate": "2013-07-13", "language": "en", "rating": 2}, {"id": 160283424, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d244201-r160283424-Center_of_Contemporary_Culture_of_Barcelona_CCCB-Barcelona_Catalonia.html", "text": "Visited here and there only seemed to be one exhibition space open. The rest was closed off. Didn't see any airy aces that the other reviewers have mentioned. Check what's open before you go in. ", "publishedDate": "2013-05-10", "language": "en", "rating": 1}, {"id": 159374646, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d244201-r159374646-Center_of_Contemporary_Culture_of_Barcelona_CCCB-Barcelona_Catalonia.html", "text": "While taking a very long walking tour of Barcelona during which we decided to go where our senses of direction took us, we discovered the CCCB Museum.  It was almost empty when we arrived so we were able to take our time and go through the museum at our pace.  One of the most attractive features of the museum is the use of natural light.  Our overall favorable impression was enhanced by the amount of empty space allotted to the exhibits and by the variety of installations.  A wonderful museum if you like contemporary art.", "publishedDate": "2013-05-01", "language": "en", "rating": 4}, {"id": 153300936, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d244201-r153300936-Center_of_Contemporary_Culture_of_Barcelona_CCCB-Barcelona_Catalonia.html", "text": "There was only one exhibition on when I visited so maybe check what is on first, but it was great. On the top floor, you don't realise how big the building is as you walk around the exhibition which is laid out on in chronological order and dependent on the area of Barcelona today. In Spanish, Catalan and English, you learn about the history of Barcelona, and why the areas are split as they are. The exhibition focuses a lot about the importance of entertainment throughout the century and how it has progressed to the theatres of today. Very interesting insight and a great find.", "publishedDate": "2013-02-27", "language": "en", "rating": 4}, {"id": 149359132, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d244201-r149359132-Center_of_Contemporary_Culture_of_Barcelona_CCCB-Barcelona_Catalonia.html", "text": "Come bere just If you really lime contemporary art or you already have the articket card.\nBut worth the visit because there is a wifi hotspot named \"cccb _guest\" and the password is cccbguestcccb\nEnjoy", "publishedDate": "2013-01-10", "language": "en", "rating": 2}, {"id": 144680562, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d244201-r144680562-Center_of_Contemporary_Culture_of_Barcelona_CCCB-Barcelona_Catalonia.html", "text": "This refurbushment of la casa de la carida is a great example of old restored architechture and new one, the inside loighting is fenomenal, usually house nice collections.", "publishedDate": "2012-11-05", "language": "en", "rating": 5}, {"id": 144163640, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d244201-r144163640-Center_of_Contemporary_Culture_of_Barcelona_CCCB-Barcelona_Catalonia.html", "text": "It offers very thoughtful, well-presented exhibitions in many languages, which makes it accessible to everyone.  I really have to compliment them on being a museum/center that would rival any other in the world.", "publishedDate": "2012-10-31", "language": "en", "rating": 5}, {"id": 133885638, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d244201-r133885638-Center_of_Contemporary_Culture_of_Barcelona_CCCB-Barcelona_Catalonia.html", "text": "I was invited to the CCCB for a contemporary dance festival and loved the audacity of the architects in blending modern features with the very traditional. To sit in a courtyard with three very traditional aspects and look at a very modern glass structure which reflected the locale when lit of an evening really added an extra dimension to the dance displayed in front of it. Wander around the venues and enjoy the use of spaces and pop into the on site bookshop which had one of the best collections of books I have seen in a long time, many unusual titles with English text! ALS surrounded by great tapas bars!", "publishedDate": "2012-07-09", "language": "en", "rating": 4}, {"id": 132780188, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d244201-r132780188-Center_of_Contemporary_Culture_of_Barcelona_CCCB-Barcelona_Catalonia.html", "text": "I lived a semester in Barcelona and this was one of my favourite places to spend an afternoon. Their exhibits and expositions are usually really good! The good thing about it is that it's not only a museum, it's a place to hang out, there is a public study room with a good book collection, a great place to read something different and just relax.\nRestaurant is also worth a visit!", "publishedDate": "2012-06-25", "language": "en", "rating": 5}, {"id": 130189773, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d244201-r130189773-Center_of_Contemporary_Culture_of_Barcelona_CCCB-Barcelona_Catalonia.html", "text": "The photo journalism exhibition literally left me sobbing. Well worth a visit, but do check out whats on first as it seems to change quite regularily.", "publishedDate": "2012-05-18", "language": "en", "rating": 5}, {"id": 129718533, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d244201-r129718533-Center_of_Contemporary_Culture_of_Barcelona_CCCB-Barcelona_Catalonia.html", "text": "especially arts and video festivals and other initiatives", "publishedDate": "2012-05-10", "language": "en", "rating": 5}, {"id": 124425100, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d244201-r124425100-Center_of_Contemporary_Culture_of_Barcelona_CCCB-Barcelona_Catalonia.html", "text": "some of the best expos ive ever seen have been in here, last night was great with the BIOTIC BAKING BRIGADE...", "publishedDate": "2012-02-11", "language": "en", "rating": 5}, {"id": 121370352, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d244201-r121370352-Center_of_Contemporary_Culture_of_Barcelona_CCCB-Barcelona_Catalonia.html", "text": "I visited the CCCB as part of my Articket admission and it ended up being quite an interesting experience. There was one temporary exhibit involving epistolary dialogue\nbetween film directors in film\nformat. Quite fascinating but not sure if it would be worth it to pay admission for just 1 exhibition if it wasn't part of the Articket.", "publishedDate": "2011-12-03", "language": "en", "rating": 4}, {"id": 107572936, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d244201-r107572936-Center_of_Contemporary_Culture_of_Barcelona_CCCB-Barcelona_Catalonia.html", "text": "This exhibit will be one until the 17th of July of 2011 and is the most engaging exhibit we have ever seen.  It is part of a series on Cities and Their Writers.  \nSee http://www.ansamed.info/en/spagna/news/ME.XEF69412.html", "publishedDate": "2011-05-09", "language": "en", "rating": 4}, {"id": 87625725, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d244201-r87625725-Center_of_Contemporary_Culture_of_Barcelona_CCCB-Barcelona_Catalonia.html", "text": "It is a good place to go on a cultural trip. Especially if there are prepared interesting exhibitions - and it is almost always. You can visit the several floors of exhibits, you must reserve at least two or three hours at this place. I watched an exhibition here about the Labyrinth, it made a huge impression on me, because I could feel the sense of being lost. I think that this is the right place for this type of exhibitions. I recommend it much!", "publishedDate": "2010-11-19", "language": "en", "rating": 5}, {"id": 87424986, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d244201-r87424986-Center_of_Contemporary_Culture_of_Barcelona_CCCB-Barcelona_Catalonia.html", "text": "I simply love the CCCB. The expositions change every 3 or 4 months, so check the website to see what's new. It's not too expensive, and you usually need around 2 hours there. Usually there are English captions, and if not they provide you with a folder that contains the translations.", "publishedDate": "2010-11-17", "language": "en", "rating": 5}]}}]