[{"locationId": 244210, "name": "Museu d'Historia de Barcelona - MUHBA", "placeType": "ATTRACTION", "reviewListPage": {"reviews": [{"id": 750623878, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d244210-r750623878-Museu_d_Historia_de_Barcelona_MUHBA-Barcelona_Catalonia.html", "text": "I went to see an interesting photo exhibition about cities. The exhibition was made with a lot of attention. Unfortunately, there were no English speaking guides or headphones with English language.", "publishedDate": "2020-03-12", "language": "en", "rating": 4}, {"id": 745774399, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d244210-r745774399-Museu_d_Historia_de_Barcelona_MUHBA-Barcelona_Catalonia.html", "text": "A fascinating way to spend 1-2 hours. The Roman ruins are well preserved and explained, and you really get a feel for how the town and community operated. Recommended. ", "publishedDate": "2020-02-17", "language": "en", "rating": 5}, {"id": 744089332, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d244210-r744089332-Museu_d_Historia_de_Barcelona_MUHBA-Barcelona_Catalonia.html", "text": "Wonderful staff and a great museum! very educative and interactive to get to know Barcelona´s history.", "publishedDate": "2020-02-10", "language": "en", "rating": 4}, {"id": 743039598, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d244210-r743039598-Museu_d_Historia_de_Barcelona_MUHBA-Barcelona_Catalonia.html", "text": "Wonderful museum if you’re a history lover. Didn’t expect so much for what we paid, it’s excellent value for money. ", "publishedDate": "2020-02-04", "language": "en", "rating": 5}, {"id": 741419862, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d244210-r741419862-Museu_d_Historia_de_Barcelona_MUHBA-Barcelona_Catalonia.html", "text": "This museum is an archaeology lovers dream.  Extensive Roman ruins under the City that go so much further than I ever would have expected. The museum is huge and a bargain at only 7 euro per person. The ruins are very well preserved and there is a lot of detailed information about them available. The ruins are all indoors too which is great for a rainy day.", "publishedDate": "2020-01-26", "language": "en", "rating": 5}, {"id": 741073276, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d244210-r741073276-Museu_d_Historia_de_Barcelona_MUHBA-Barcelona_Catalonia.html", "text": "Catalonia has a long history, going back thousands of years and the curators of the museum have done a superb job of guiding the visitor through pre-history to the present day. Aware there are disputes about independence from Madrid, this museum - in the latter periods, identifies the reasons why without propogating nationalist views. VERY educational, not only from the perspective of Catalonia but from the evolution of a society and how these can be similar throughout other European nations.", "publishedDate": "2020-01-24", "language": "en", "rating": 5}, {"id": 740632658, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d244210-r740632658-Museu_d_Historia_de_Barcelona_MUHBA-Barcelona_Catalonia.html", "text": "Amazing. Ruins under the city going back to the 4th century. Kind of mindblowing. And a lot of ruins too, a huge and very well done exhibit. A must visit museum. The royal church at the end is so gorgeous, and then you exit the museum in the plaza where it is rumored that Isabella and Ferdinand met Columbus when he returned from discovering the Americas. ", "publishedDate": "2020-01-22", "language": "en", "rating": 5}, {"id": 738480162, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d244210-r738480162-Museu_d_Historia_de_Barcelona_MUHBA-Barcelona_Catalonia.html", "text": "I went to this museum as a time filler. I was after something a bit different after having seen heaps of art galleries on my Europe trip, as well as something a bit quieter/less filled with people than the bigger attractions (like the Gaudi ones). I am so glad I went here. At the reduced price of 5€ (full is 7€), it was excellent value. It was so interesting to see the excavated archeological site/remains of the original Barcelona. The audio guide which, unlike many places) was free gave a great description of each different site, which included a laundry, Roman baths, a wine making building and a church. There were also some old artifacts on display, some dating to BC years. Plus, it wasn’t filled with people so it was easy to move through at my own pace ", "publishedDate": "2020-01-11", "language": "en", "rating": 5}, {"id": 734916913, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d244210-r734916913-Museu_d_Historia_de_Barcelona_MUHBA-Barcelona_Catalonia.html", "text": "Much to see and do here and all explained on an included audio guide. For 7 euros this must be one of the best value and interesting museums in Barcelona and leaves the overpriced Gaudi exhibitions for dead", "publishedDate": "2019-12-27", "language": "en", "rating": 5}, {"id": 733250887, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d244210-r733250887-Museu_d_Historia_de_Barcelona_MUHBA-Barcelona_Catalonia.html", "text": "We took friends to this fascinating place. If you love finding the ancient history of so much of modern Europe, then thhis is the place for you. We were imporessed with the proud heritage of the Barcelonans, and this display tells some of that story. Additionally, as a bonus, (we went a few days before a festival) and there were all of the various parade figures on display, which would be paraded around Barcelona the following day. Various political municipalities created their large statues, usually of paper maché, and along with a giant king and queen are part of Barcelona's festival in mid September.", "publishedDate": "2019-12-17", "language": "en", "rating": 5}, {"id": 731211251, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d244210-r731211251-Museu_d_Historia_de_Barcelona_MUHBA-Barcelona_Catalonia.html", "text": "We visited this museum during a short stay in Barcelona this week and it gave a good background history to the city, and the various settlers who created the city. The handsets were really useful and well narrated, giving clear details of each exhibition. For anyone interested in history and archaeology, this is well worth visiting. ", "publishedDate": "2019-12-07", "language": "en", "rating": 4}, {"id": 730333651, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d244210-r730333651-Museu_d_Historia_de_Barcelona_MUHBA-Barcelona_Catalonia.html", "text": "We were caught very much by surprise by this stop on our visit - and very positively so!  One of the lovely things about is that it's under the city so you'd never know it was there unless you were looking for it.  The ruins are much more extensive than I was expecting, and the signage and video tour gave us a great feel for what it might have been like. It takes probably an hour, and is really quite fascinating.  The above-ground area also was worth walking through and looking at the exhibits.", "publishedDate": "2019-12-02", "language": "en", "rating": 5}, {"id": 730244707, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d244210-r730244707-Museu_d_Historia_de_Barcelona_MUHBA-Barcelona_Catalonia.html", "text": "Fui el primer domingo de noviembre donde la entrada es gratis (todos los museos de Barcelona son gratis el 1er domingo de cada mes). Aún así no estaba lleno para nada. Disfruté mucho caminar entre los pasillos conociendo mucho sobre la Barcelona en época Romana. Al ser domingo me pareció que hubo muchos espacios cerrados, pero no dejó de ser una buena visita.\n\nI went there the first sunday of november, when the entrance is free (every first sunday of each month, all the Barcelona museums are free). The place was not crowded at all. I enjoyed a lot walking around though the ruins of the Roman's Barcelona. I think there were a few museum rooms that were closed, I don't know if it was because it was Sunday or because it was the free day of the month, but it was still a very nice visit! Beware that most signs are only in catalan or spanish.", "publishedDate": "2019-12-02", "language": "en", "rating": 5}, {"id": 729101061, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d244210-r729101061-Museu_d_Historia_de_Barcelona_MUHBA-Barcelona_Catalonia.html", "text": "I enjoyed going to the museum on Sunday when it was free. I'm a big fan of Roman ruins, so this was great. You can walk around pretty extensive Roman and Visgoth ruins in the museum basement. The only downside is that only about half the explanation signs have any English on them, some of them are just in Catalan and Spanish. This is understandable in a non-English speaking country, however, if English is your only language, take that into account when deciding to visit.", "publishedDate": "2019-11-26", "language": "en", "rating": 4}, {"id": 727239564, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d244210-r727239564-Museu_d_Historia_de_Barcelona_MUHBA-Barcelona_Catalonia.html", "text": "Less than an hour at this archaeology site with artifacts and videos captures most of the long history of Barcelona from Roman times.   Revealing, unforgettable, don't miss MUHBA!", "publishedDate": "2019-11-18", "language": "en", "rating": 5}, {"id": 725170763, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d244210-r725170763-Museu_d_Historia_de_Barcelona_MUHBA-Barcelona_Catalonia.html", "text": "We enjoyed this museum, and zipped through it in 45 minutes.  It is essentially an expansive archaeology site, and you walk on a maze of catwalks to see it.  Kids may find the ruins a bit boring, but they will like the catwalks!  Anyone with respiratory issues may want to avoid this place--the air feels very dusty (rock dust).  I guess folks with claustrophobia may have issues here too as it essentially underground.  Staff were friendly and nice.  It is centrally located, but a bit tricky to find the entrance (but that's part of the appeal).  Hardly any people there when we were.", "publishedDate": "2019-11-09", "language": "en", "rating": 4}, {"id": 723037359, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d244210-r723037359-Museu_d_Historia_de_Barcelona_MUHBA-Barcelona_Catalonia.html", "text": "Excellent!\nwell worth it although it was a bit difficult to find.Thought there was a cafe but couldn't find it", "publishedDate": "2019-11-01", "language": "en", "rating": 5}, {"id": 722853903, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d244210-r722853903-Museu_d_Historia_de_Barcelona_MUHBA-Barcelona_Catalonia.html", "text": "This is the place to go to to realize that the city has had a diverse history right under your feet.  Clear content and easy access,  definitely would put this on the list at the end of the day since it is a very laid back experience", "publishedDate": "2019-10-31", "language": "en", "rating": 5}, {"id": 721247995, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d244210-r721247995-Museu_d_Historia_de_Barcelona_MUHBA-Barcelona_Catalonia.html", "text": "I hadn't thought to go to this museum before seeing it advertised during my trip, but glad I did. The well laid out exhibits and particularly the archaeological exhibition below were really enjoyable and I felt gave me a good appreciation of Barcelona.", "publishedDate": "2019-10-25", "language": "en", "rating": 5}, {"id": 721231752, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d244210-r721231752-Museu_d_Historia_de_Barcelona_MUHBA-Barcelona_Catalonia.html", "text": "We spent about an hour at this museum.  We arrived at 2:50pm on a Sunday afternoon and learned that it was free after 3:00pm on Sunday's.  We asked if we could have English audio guides, but they told us they didn't have any.  We later saw people with audio guides.", "publishedDate": "2019-10-25", "language": "en", "rating": 5}, {"id": 719480242, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d244210-r719480242-Museu_d_Historia_de_Barcelona_MUHBA-Barcelona_Catalonia.html", "text": "You travel through time starting in the basement among the Roman ruins.  This is an incredible museum that is not on most visitors list to see. We spent several hours here and thoroughly enjoyed it.", "publishedDate": "2019-10-18", "language": "en", "rating": 5}, {"id": 719196140, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d244210-r719196140-Museu_d_Historia_de_Barcelona_MUHBA-Barcelona_Catalonia.html", "text": "I enjoyed digging into the history of Barcelona in this well-designed museum.  Audio guides included in the entrance fee provide easy insight into everything you see, particularly the Roman ruins that have been excavated below the building.  Great museum for the whole family.  This museum doesn't seem to be on the must-do list for tourists in Barcelona as we had plenty of room to see and wander through everything.", "publishedDate": "2019-10-17", "language": "en", "rating": 4}, {"id": 719162018, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d244210-r719162018-Museu_d_Historia_de_Barcelona_MUHBA-Barcelona_Catalonia.html", "text": "This is an excellent  museum.  The highlight for me was the lower level with the Roman ruins.  However, the other part of the museum was also interesting. It is located in an interesting part of Barcelona, near the Cathedral and gothic quarter, and so is well worth a visit.", "publishedDate": "2019-10-17", "language": "en", "rating": 4}, {"id": 716816552, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d244210-r716816552-Museu_d_Historia_de_Barcelona_MUHBA-Barcelona_Catalonia.html", "text": "Dating back to a Roman times, walk around the lower levels tracing the development of the City.  Nice modern displays and useful multilingual handheld info device.  The museum uses this specific site to illustrate changes upto the Renaissance world so.  Good location behind th Barcelona Cathedral.", "publishedDate": "2019-10-09", "language": "en", "rating": 4}, {"id": 714754821, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d244210-r714754821-Museu_d_Historia_de_Barcelona_MUHBA-Barcelona_Catalonia.html", "text": "Audio tour of Roman ruins when Barcelona was a Mediterranean Trade Route.  It was wonderful to admire the ruins and see how advanced the Romans were.  They had a wine cellar and a laundromat among the ruins.  Upstairs is medieval and renaissance exhibits.  These do not have audio options.", "publishedDate": "2019-10-02", "language": "en", "rating": 4}, {"id": 713100311, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d244210-r713100311-Museu_d_Historia_de_Barcelona_MUHBA-Barcelona_Catalonia.html", "text": "This is a gem of a museum (entry fee is €7 or €5 for seniors). This is located near the Jaume 1 Metro off Via Laietana and the Cathedral of Barcelona. \n\nYou get to explore the underground Roman ruins, which is pretty extensive. You have use of an audio guide. There are also signs posted, as well as videos, which shows a time lapse of Barcelona from ancient history to today. We saw where the wine was made, public baths, and other things that showed the life of ancient times.  \n\nWe probably spent close to two hours, which was worth every minute. \n\nHighly recommended.", "publishedDate": "2019-09-26", "language": "en", "rating": 5}, {"id": 711501583, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d244210-r711501583-Museu_d_Historia_de_Barcelona_MUHBA-Barcelona_Catalonia.html", "text": "Very interesting museum. The underneath ruins of old town so well preserved something you don't find in other cities.", "publishedDate": "2019-09-20", "language": "en", "rating": 4}, {"id": 710930411, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d244210-r710930411-Museu_d_Historia_de_Barcelona_MUHBA-Barcelona_Catalonia.html", "text": "Only €5 to get in and the ticket can also be used for other attractions during the same day! \nRecommended by our tour guide as ‘definitely something like no other to see while in Barcelona’. \nDid not disappoint! Brilliant view of the history of how Barcelona was built and it’s society developed", "publishedDate": "2019-09-18", "language": "en", "rating": 5}, {"id": 710643455, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d244210-r710643455-Museu_d_Historia_de_Barcelona_MUHBA-Barcelona_Catalonia.html", "text": "Google Maps doesn't show you right to the door and it took me a while to find the entrance, but I'm glad I did. The Roman ruins are so extensive and most of the labels have an English translation. I had to rush it into a one-hour visit and would like to have stayed longer. Well worth €7.", "publishedDate": "2019-09-17", "language": "en", "rating": 5}, {"id": 709723272, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d244210-r709723272-Museu_d_Historia_de_Barcelona_MUHBA-Barcelona_Catalonia.html", "text": "A spacious museum dedicated to the history of Barcelona, located near to the Cathedral in a building with good air conditioning (!) so handy to pop into while wandering around the old town on a warm day. if it's your first time in the city or if you'd just like to know more it's definitely worth a visit. You get a great overview going back to prehistory, with a wide range of exhibits. The excavated Roman ruins in the basement are probably most memorable; you really get a sense of how people lived in Barcino. There's more to see too: I particularly liked all the medieval documents. Visiting really helped deepen my connection with Barcelona beyond that of a normal tourist: feel like I got to know the city better than I would have otherwise. Free all day on the first Sunday of the month.", "publishedDate": "2019-09-14", "language": "en", "rating": 5}, {"id": 708860178, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d244210-r708860178-Museu_d_Historia_de_Barcelona_MUHBA-Barcelona_Catalonia.html", "text": "If you love ancient history and are amazed by Romans, this is the place to see to be truly amazed by their ingenuity. The effort the museum has put into placing an ancient Roman town right in the middle of a modern city is really commendable", "publishedDate": "2019-09-11", "language": "en", "rating": 5}, {"id": 706359174, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d244210-r706359174-Museu_d_Historia_de_Barcelona_MUHBA-Barcelona_Catalonia.html", "text": "In this museum you can see the city from underground. How the city developed step by step, level by level", "publishedDate": "2019-09-04", "language": "en", "rating": 4}, {"id": 704083378, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d244210-r704083378-Museu_d_Historia_de_Barcelona_MUHBA-Barcelona_Catalonia.html", "text": "My 17 and 21 year old daughters, husband and I visited this museum on a weekday afternoon. There was no line and in fact few other visitors while we were there. There was a very interesting display of Barcelona and surrounding region from prehistory through the 13th century, including tools, currency, and life story. \n\nFor me the real magic is UNDER the MUHBA where Roman ruins have been excavated. The manner in which they are presented, with audio and written explanations of the city composition, clothes dying and washing, wine making, roads, and manner in which structures were reused was fascinating for all of us. \n\nThe price was the deal of our Barcelona visit, at 7 euros per adult and 5 euros per student. ", "publishedDate": "2019-08-28", "language": "en", "rating": 5}, {"id": 702511061, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d244210-r702511061-Museu_d_Historia_de_Barcelona_MUHBA-Barcelona_Catalonia.html", "text": "My kids were not to excited about another museum but they spend 2 hours here and didn't even finish it.  They really liked all those Roman ruins and history.  It was unfortunate that we didn't finish it, but it will give us a chance to come back.  The audio guide was great, but it was only for the roman part of the museum, would be nice to have it for everything.  over all is a must for Barcelona visit", "publishedDate": "2019-08-24", "language": "en", "rating": 5}, {"id": 701697660, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d244210-r701697660-Museu_d_Historia_de_Barcelona_MUHBA-Barcelona_Catalonia.html", "text": "An incredibly interesting museum outlining the history and development of Barcelona. I would highly recommend this museum to learn more about city.  ", "publishedDate": "2019-08-21", "language": "en", "rating": 5}, {"id": 700991026, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d244210-r700991026-Museu_d_Historia_de_Barcelona_MUHBA-Barcelona_Catalonia.html", "text": "We loved visiting this museum. It's very extensive, the first section is a walkway over the remains of the Roman city. The remains are well preserved and the free audio guide is a must. Highlights include the laundry, garum factory and wine factory. The Visigoth exhibit is worth a mention too. Further exhibits take you through the middle ages and later. The museum is surprisingly sizeable, the Romain remains alone are quite extensive. Don't miss the chapel on the way out.\n\nIn terms of practicalities, the museum looks accessible - fairly level on a given floor and lifts to take you between floors (the main lift has a \"clock\" showing you going back in time from the current year back, which is a nice touch). You might want to make sure the kids have used the lavatory before going through the Roman area. We took over an hour to walk around the Roman site, and given the nature of the site the museum obviously couldn't fit  such facilities.\n\nHighly recommended, great value for money.", "publishedDate": "2019-08-20", "language": "en", "rating": 5}, {"id": 700058371, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d244210-r700058371-Museu_d_Historia_de_Barcelona_MUHBA-Barcelona_Catalonia.html", "text": "Ancient history, that is. Back in the Roman times as you weave your way through this underground  museum to see the foundations of a Roman city. There are good descriptions for most of route, although some of the newer (?) parts being uncovered could use some more detail. Centrally located between the Catedral de Barcelona and Placa de Sant Jaume, it's well worth an hour or so just to learn about what the old Romans used in laundry and dying clothes and a few other things. And you won't be stuck in a crowd or perspiring in the heat (like touring most Roman ruins). Recommended.", "publishedDate": "2019-08-17", "language": "en", "rating": 4}, {"id": 697422503, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d244210-r697422503-Museu_d_Historia_de_Barcelona_MUHBA-Barcelona_Catalonia.html", "text": "This is certainly a must-see museum while in Barcelona. One of the best museums I have ever visited and very reasonably priced. Would highly recommend!", "publishedDate": "2019-08-10", "language": "en", "rating": 5}, {"id": 696228035, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d244210-r696228035-Museu_d_Historia_de_Barcelona_MUHBA-Barcelona_Catalonia.html", "text": "Went expecting to pay €7 but only paid €5 as under 29 yrs old! Really good value - spent several hours looking around, and the audio guides were really informative and clear. The roman ruins were really well preserved and well interpreted. It was really interesting to learn about how Barcelona City was born, and how it has developed. Would highly recommend for an afternoon's entertainment to escape the midday sun.", "publishedDate": "2019-08-06", "language": "en", "rating": 5}, {"id": 696182118, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d244210-r696182118-Museu_d_Historia_de_Barcelona_MUHBA-Barcelona_Catalonia.html", "text": "We tried (and failed) to find the Roman tombs but we stumbled on this museum. Lacking sufficient time we went back the next morning when it opened at 10. Very handy to have lockers (they charge 1 euro but you get it back). I took my phone in with me because you can take non-flash photos. Getting there at opening was wonderful. It was a Friday but we had the entire place to ourselves almost the whole time. The lay out is excellent, well marked and the explanations on exhibits are often in three languages. The audio guide is top notch and very helpful. We spent two hours in the museum and could have spent longer but we needed to vacate our flat. My favorite were the huge pottery globes used to make \"garum\" (think fish sauce) but the sophistication of the winery, the public baths and all the conveniences we take for granted in the 21st century was mind boggling. Back \"up top\" there are also permanent exhibits of local history — I would have liked to have longer to linger there. I will go back when next I visit Barcelona (and I will find those tombs!)", "publishedDate": "2019-08-06", "language": "en", "rating": 5}, {"id": 694482938, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d244210-r694482938-Museu_d_Historia_de_Barcelona_MUHBA-Barcelona_Catalonia.html", "text": "Museum is built on top of ruins of Roman city. Descend to the basement and  spend at least an hour wandering ancient Roman city.", "publishedDate": "2019-07-31", "language": "en", "rating": 5}, {"id": 693874143, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d244210-r693874143-Museu_d_Historia_de_Barcelona_MUHBA-Barcelona_Catalonia.html", "text": "We visited to get out of the heat and received a wonderful step into the roman history of the city.  To think of what is just below everyone's feet!  Very well done exhibits.  A bargain for the $8 Euro admission too.  If you enjoy history, you should consider visiting.  The below grade excavations are just wonderful!", "publishedDate": "2019-07-29", "language": "en", "rating": 5}, {"id": 690571538, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d244210-r690571538-Museu_d_Historia_de_Barcelona_MUHBA-Barcelona_Catalonia.html", "text": "Very interesting and extensive Roman remains, good audio guide. Would be suitable for all ages.\nThe review below which mentions the rooftop bar is totally wrong! The bar mentioned is at Museu d'Historia de Catalunya by the harbour, not this one next to the cathedral.", "publishedDate": "2019-07-18", "language": "en", "rating": 5}, {"id": 689939596, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d244210-r689939596-Museu_d_Historia_de_Barcelona_MUHBA-Barcelona_Catalonia.html", "text": "If you like historic sites and ruins. Go to this museum. Cheap and very easy to walk around. We had a great time and super recommend. ", "publishedDate": "2019-07-15", "language": "en", "rating": 5}, {"id": 689229912, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d244210-r689229912-Museu_d_Historia_de_Barcelona_MUHBA-Barcelona_Catalonia.html", "text": "Cheap (free for kids!) amazing museum of Roman ruins UNDER the city. You can walk over the old residences and learn how Barcino (the Roman city) functioned. ", "publishedDate": "2019-07-13", "language": "en", "rating": 5}, {"id": 689095982, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d244210-r689095982-Museu_d_Historia_de_Barcelona_MUHBA-Barcelona_Catalonia.html", "text": "Housed in an impressive former historic warehouse by the waterfront and converted in 1996 into a modern museum spread over 3 floors with a bar and restaurant on the 4th floor.  Lift and ramp access available and a special entry of Euro 3.50 for those 65 and over.  The displays are extensive, well presented and detailed, covering pre history to modern times. Explanatory narratives are in English as well as Catalan and Spanish. Staff are helpful and the ground floor has a shop/bookshop.   Strongly recommended for those who wish to have a better understanding of the history of Catalonia.", "publishedDate": "2019-07-12", "language": "en", "rating": 4}, {"id": 688962428, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d244210-r688962428-Museu_d_Historia_de_Barcelona_MUHBA-Barcelona_Catalonia.html", "text": "This is a very nice museum - takes about 2 - 3 hours. There is an audio tour of the Roman ruins beneath the streets of Barcelona. It will be familiar info if you've seen other Roman ruins but it really never seems to get old. Well done.", "publishedDate": "2019-07-12", "language": "en", "rating": 5}, {"id": 687169478, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d244210-r687169478-Museu_d_Historia_de_Barcelona_MUHBA-Barcelona_Catalonia.html", "text": "Its like travelling time going from the romans to the spanish inquisition. Its a well preserved archaeological site that has a fascinating history.  ", "publishedDate": "2019-07-06", "language": "en", "rating": 5}, {"id": 686979338, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d244210-r686979338-Museu_d_Historia_de_Barcelona_MUHBA-Barcelona_Catalonia.html", "text": "We stumbled upon this unique and beautiful building and really enjoyed the views from the courtyard area. It was closed when we were there, but the building itself is stunning!", "publishedDate": "2019-07-05", "language": "en", "rating": 4}, {"id": 686812708, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d244210-r686812708-Museu_d_Historia_de_Barcelona_MUHBA-Barcelona_Catalonia.html", "text": "I've never seen anything like this.  Much of the museum is underground, comprised of ruins from early A.D. Roman times.\n\nThere are written explanations of what you are looking at.  Some are not in English, but they have audio guides.  Took a while for me to figure out how to get English.  But the headsets are included in the 7 euro price, so not complaining.  \n\nThe underground tour is pretty extensive and takes you through areas where they did various jobs and religious functions.  Plenty of artifacts too. \n\nThe tour continues beyond the ruins and onto another floor where the tour takes you to the Middle Ages.  There are plenty of benches to rest as you go along.  Restrooms were not hard to find.\n\nHappily, the crowd was very light.  This one doesn't seem to make the official top attractions lists but it should.  ", "publishedDate": "2019-07-04", "language": "en", "rating": 5}, {"id": 686790476, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d244210-r686790476-Museu_d_Historia_de_Barcelona_MUHBA-Barcelona_Catalonia.html", "text": "Small museum on the street that then takes you below street level where you can see the foundations of the ancient city started by the Romans.  Wonderful way to see how Barcelona has changed over the years and appreciate all the archeological work that has been done.  Again, we had an audio tour in English that was very helpful.", "publishedDate": "2019-07-04", "language": "en", "rating": 4}, {"id": 686031502, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d244210-r686031502-Museu_d_Historia_de_Barcelona_MUHBA-Barcelona_Catalonia.html", "text": "A giant landscape of an old roman village, a palace and other ancient building remains - very well documented an reasonably priced.  ", "publishedDate": "2019-07-02", "language": "en", "rating": 4}, {"id": 684253547, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d244210-r684253547-Museu_d_Historia_de_Barcelona_MUHBA-Barcelona_Catalonia.html", "text": "Located in the Gothic quarter, this museum was is primarily underground with a series of pathways above the ruins that goes back 2000 years.  It was very interesting a looked like an archeological dig.  I am not sure if there is a generally a fee, but when we went on Sunday it was free.  ", "publishedDate": "2019-06-25", "language": "en", "rating": 5}, {"id": 683514618, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d244210-r683514618-Museu_d_Historia_de_Barcelona_MUHBA-Barcelona_Catalonia.html", "text": "You walk above an ancient Roman city and see where they dyed fabric, made wine, had shops, and lived.  The signs help you understand each part.  We only had an hour here and wished we had 2 or 3 hours!", "publishedDate": "2019-06-22", "language": "en", "rating": 5}, {"id": 682487275, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d244210-r682487275-Museu_d_Historia_de_Barcelona_MUHBA-Barcelona_Catalonia.html", "text": "The Spanish Civil War is a bit hard to understand unless you've read about it in depth. This museum does a decent job of explaining a complex and very impactful conflict that in some respects continues today.", "publishedDate": "2019-06-18", "language": "en", "rating": 3}, {"id": 682250504, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d244210-r682250504-Museu_d_Historia_de_Barcelona_MUHBA-Barcelona_Catalonia.html", "text": "This was really neat to walk through: an entire preserved section of the Roman city. The detail provided in the signage was incredibly informative and worked to help imagine earlier years.", "publishedDate": "2019-06-17", "language": "en", "rating": 4}, {"id": 681833105, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d244210-r681833105-Museu_d_Historia_de_Barcelona_MUHBA-Barcelona_Catalonia.html", "text": "In the beginning it looks interesting, but after 5 minutes for me was not so many info and exhibits. ", "publishedDate": "2019-06-16", "language": "en", "rating": 3}, {"id": 681737220, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d244210-r681737220-Museu_d_Historia_de_Barcelona_MUHBA-Barcelona_Catalonia.html", "text": "We visited on a Sunday after 3pm when entry is free which wS a bonus. There is lots to see and it wasn't too busy which was great. We really wanted to see the Roman floors which were amazing We spent ages looking and reading the info It's incredible what's under you feet.", "publishedDate": "2019-06-15", "language": "en", "rating": 5}, {"id": 680824460, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d244210-r680824460-Museu_d_Historia_de_Barcelona_MUHBA-Barcelona_Catalonia.html", "text": "This is an inexpensive (7 euros) museum that offers a free audio guide. It takes you through some ruins from the 5th century underground. The audio guide is critical in understanding what you are looking at. We went on a rainy day and it was well worth the hour or so we were there.", "publishedDate": "2019-06-11", "language": "en", "rating": 4}, {"id": 680800844, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d244210-r680800844-Museu_d_Historia_de_Barcelona_MUHBA-Barcelona_Catalonia.html", "text": "The museum's trick is that it's build on top of ruins dating back to Roman times. There are also ruins that go under the cathedral above that talk about the founding of the Christian constructions in the area. Then you come back up to road level and you can see some well-preserved chapels and the like.", "publishedDate": "2019-06-11", "language": "en", "rating": 4}, {"id": 680141874, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d244210-r680141874-Museu_d_Historia_de_Barcelona_MUHBA-Barcelona_Catalonia.html", "text": "So many things to look at, to read, it’s so interesting. Not a big fan of museums usually, but this one was famous and other tourists recommended it. Was definitely a good decision to go there!", "publishedDate": "2019-06-09", "language": "en", "rating": 5}, {"id": 680078819, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d244210-r680078819-Museu_d_Historia_de_Barcelona_MUHBA-Barcelona_Catalonia.html", "text": "This museum lets you walk through the actual streets and buildings (as they remain) of Roman Barcino, so you can see vats for fermenting grape juice for wine, a Roman commercial laundry, etc.  It is BIG.  Plan on several hours.  You need to do lots of walking and go up and down lots of steps.", "publishedDate": "2019-06-08", "language": "en", "rating": 5}, {"id": 679507021, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d244210-r679507021-Museu_d_Historia_de_Barcelona_MUHBA-Barcelona_Catalonia.html", "text": "Underground and see how life was like centuries ago.  Loved to see the frescos and the mosaic floors.  How this has served thousands of year's is amazing.  Great way to tour underground .  Allow for 45 min to 90 min for the self guided tour.", "publishedDate": "2019-06-06", "language": "en", "rating": 4}, {"id": 679242522, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d244210-r679242522-Museu_d_Historia_de_Barcelona_MUHBA-Barcelona_Catalonia.html", "text": "Spent a few hours on a rainy day, reading & listening to all info from ancient history to modern day.  Vast underground passages preserving illustrations of daily life centuries ago!  Even got a senior discount (over 65); audio guide included, many languages.", "publishedDate": "2019-06-05", "language": "en", "rating": 5}, {"id": 678600806, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d244210-r678600806-Museu_d_Historia_de_Barcelona_MUHBA-Barcelona_Catalonia.html", "text": "We had heard about a museum that included underground Roman ruins. We figured it would just be a few archeological sites but it ended up being an intricate maze of ruins that moves visitors from ancient ruins to medieval ruins to renaissance structures. We ended up spending hours exploring the museum and the labyrinth that is situated under Barcelona cathedral. The audio guide was great and explained so much. Afterward, we not only understood the complex history of Barcelona but also were able to appreciate the history of the whole region. This is a must see for everyone!", "publishedDate": "2019-06-03", "language": "en", "rating": 5}, {"id": 678574967, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d244210-r678574967-Museu_d_Historia_de_Barcelona_MUHBA-Barcelona_Catalonia.html", "text": "If you like Roman history, a visit to the extensive  (4000sm) foundations, which are  several metres underground is well worth your time.It took us about an hour to wander along the walkways looking down on the remains of various shops, public baths etc.", "publishedDate": "2019-06-03", "language": "en", "rating": 5}, {"id": 678054628, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d244210-r678054628-Museu_d_Historia_de_Barcelona_MUHBA-Barcelona_Catalonia.html", "text": "I went here on a free museum day (1st Sunday of the month) thinking that it was just one of those small museums with Roman remains and it seemed that way on the first floor but when we hopped into the elevator and went down five meters it looked vast.  I am sure I spent almost two hours there mesmerized by the details of what they have found and documented.  I practically read all English descriptions I could find.  It was really amazing.  \n\nThe temporary exhibit at the Saló del Tinell called Barcelona Meditarranean Capital. The Medieval Metamorphosis, 13th-15th Centuries was also beautiful.  Add to that the Chapel of Santa Àgata and I was overwhelmed (in a really good way).", "publishedDate": "2019-06-01", "language": "en", "rating": 5}, {"id": 677560455, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d244210-r677560455-Museu_d_Historia_de_Barcelona_MUHBA-Barcelona_Catalonia.html", "text": "great place to learn all about Barcelona and it's interesting history\n\nspend some time here to appreciate how it got to where it is now", "publishedDate": "2019-05-30", "language": "en", "rating": 4}, {"id": 677258615, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d244210-r677258615-Museu_d_Historia_de_Barcelona_MUHBA-Barcelona_Catalonia.html", "text": "It's like going into another world at this compact archeological site under the central city. Ancient Roman life is like a ghost among the ruins. The Romans made wine in Spain as still the Spanish do. So that's  two millennia of red and white. Lucky for us nobody makes garum fish sauce  anymore!", "publishedDate": "2019-05-28", "language": "en", "rating": 5}, {"id": 676457066, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d244210-r676457066-Museu_d_Historia_de_Barcelona_MUHBA-Barcelona_Catalonia.html", "text": "We arrived 1/2 before free time and decided to go ahead and pay to enter rather than wait. We were watching the film and it was had about 5 minutes left when a woman came in and said she had to stop it and start it over for the \"free people\". i explained we had paid and wished to finish watching . She rudely refused.  The lower level with  the  Roman  ruins was very interesting.", "publishedDate": "2019-05-25", "language": "en", "rating": 4}, {"id": 675889804, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d244210-r675889804-Museu_d_Historia_de_Barcelona_MUHBA-Barcelona_Catalonia.html", "text": "Yes and No. Yes, if you want to spend time in Museum. No, if you feel that history of Barcelona should have been seen not inside, but walk along the city streets. Accessed through a 14th-century mansion, this museum features the world’s most extensive subterranean Roman ruins. Visitors can view the streets and squares of Roman Barcelona. The ruins extend underground, through to the exit at the Palau Reial.", "publishedDate": "2019-05-23", "language": "en", "rating": 4}, {"id": 675708783, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d244210-r675708783-Museu_d_Historia_de_Barcelona_MUHBA-Barcelona_Catalonia.html", "text": "We were pleasantly surprised at the interesting artifacts and ruins in this museum. The audio guide was included for only 5 euros and easy to use. A treat in the middle of the old town.", "publishedDate": "2019-05-22", "language": "en", "rating": 5}, {"id": 675443173, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d244210-r675443173-Museu_d_Historia_de_Barcelona_MUHBA-Barcelona_Catalonia.html", "text": "It is very interesting to visit MUHBA and especially excavations from Roman period when Barcelona was called Barcino. this visit is a must for everybody who is interested in history.", "publishedDate": "2019-05-21", "language": "en", "rating": 5}, {"id": 675301948, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d244210-r675301948-Museu_d_Historia_de_Barcelona_MUHBA-Barcelona_Catalonia.html", "text": "Really enjoyed seeing the roman ruins. Not too crowded when we went in the afternoon. Would recommend.", "publishedDate": "2019-05-20", "language": "en", "rating": 5}, {"id": 674787694, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d244210-r674787694-Museu_d_Historia_de_Barcelona_MUHBA-Barcelona_Catalonia.html", "text": "Great museum to view ancient roman walls and infrastructure and items from the past. Easy walking. Very interesting.", "publishedDate": "2019-05-18", "language": "en", "rating": 5}, {"id": 673505973, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d244210-r673505973-Museu_d_Historia_de_Barcelona_MUHBA-Barcelona_Catalonia.html", "text": "The museum is very well organized. Yet, if you come from Rome (or if you’re Italian as we were) you are likely to find it quite boring. You will walk along the basement of the old Roman city and you will see some ceramics. Nothing really impressive if you are used to visit Roman sites in Italy or even Rome itself. The only very interesting part is the 5 mins film that describes the development of the city to modern age. \nBottom line is I wouldn’t recommend it if you are in town for 3 days...\n", "publishedDate": "2019-05-12", "language": "en", "rating": 2}, {"id": 669977312, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d244210-r669977312-Museu_d_Historia_de_Barcelona_MUHBA-Barcelona_Catalonia.html", "text": "This is a great museum to visit - just to see the Roman ruins, if for no other reason.  Probably the most extensive Roman ruins that I've seen, outside of Italy.", "publishedDate": "2019-04-28", "language": "en", "rating": 5}, {"id": 668027737, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d244210-r668027737-Museu_d_Historia_de_Barcelona_MUHBA-Barcelona_Catalonia.html", "text": "If you are historically interested, this is an absolute must. One of the most pleasant surprices of our stay in Barcelona. The astonishing exhibition is breathtaking.", "publishedDate": "2019-04-21", "language": "en", "rating": 5}, {"id": 667667678, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d244210-r667667678-Museu_d_Historia_de_Barcelona_MUHBA-Barcelona_Catalonia.html", "text": "We spent our morning exploring this museum. Make sure not to miss the elevator that goes downstairs to the actual excavations in the 3rd room, it's pretty inconspicuous... \nIt was quite chilly downstairs, make sure to take a 2nd layer with you! \nThe audio guide comes with the entry fee and makes up for any missing English descriptions. Only later on, in the Medieval part, there are no English texts to the exhibits, which is a pity; only printed papers you can take at the beginning of each room. \nWould definitely recommend this museum! (also easy to combine with the Barcelona Cathedral, Santa Maria del Mar, a walk around the Gothic quarter...)", "publishedDate": "2019-04-19", "language": "en", "rating": 4}, {"id": 667455883, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d244210-r667455883-Museu_d_Historia_de_Barcelona_MUHBA-Barcelona_Catalonia.html", "text": "I spent a great deal of time in the early underground area and ran out of time for the more recent (1500 on) historical section. The underground area was quite cool on the spring day that I was there and I wished I had not put my jacket in a free locker. Don't let the warm entrance area deceive you. I bet it's quite comfortable on a hot summer day.", "publishedDate": "2019-04-18", "language": "en", "rating": 5}, {"id": 666423699, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d244210-r666423699-Museu_d_Historia_de_Barcelona_MUHBA-Barcelona_Catalonia.html", "text": "Spent about 2 hours here on Sunday morning. At 7 euros for a general ticket inclusive of an audioguide, it's definitely worth the price. The guided audio tour takes you through underground to see remnants of the early city and several recovered artefacts. The guide was very informative and being able to walk over the streets of this early society was amazing.", "publishedDate": "2019-04-14", "language": "en", "rating": 5}, {"id": 666357278, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d244210-r666357278-Museu_d_Historia_de_Barcelona_MUHBA-Barcelona_Catalonia.html", "text": "I visited the MUHBA hoping it might have some interesting information on the city's role during the Guerra dels Segadors. Unfortunately the 17th century is noticeably absent from the museum, but the Roman exhibition which occupies the greater part of the lower floors was informative and the other relics housed within the museum were interesting enough.", "publishedDate": "2019-04-14", "language": "en", "rating": 4}, {"id": 665472046, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d244210-r665472046-Museu_d_Historia_de_Barcelona_MUHBA-Barcelona_Catalonia.html", "text": "Really cool exhibition of ruins through the ages, showing what was on the site in Roman and medieval times.  I was there on a free admission day, but it would definitely be worth paying to see on normal days.  Would be nice if more of the displays had English translations, but there was still enough English to get the idea.\n\nOne thing to watch out for - when you enter, there are a couple exhibits, and a then a small sign on the wall pointing to an elevator that says “direction of tour”.  MAKE SURE TO FOLLOW THE SIGN.  I almost missed it until a staff member pointed it out.  Most of the museum is underground, and easy to miss.", "publishedDate": "2019-04-11", "language": "en", "rating": 5}, {"id": 663231690, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d244210-r663231690-Museu_d_Historia_de_Barcelona_MUHBA-Barcelona_Catalonia.html", "text": "Gave a wonderful history of the development of Barcelona since Roman times and has extensive Roman ruins that are beneath the current buildings. Nothing like we’ve seen before. Not sure why other reviewers complained about Spanish only. We had an English audio guide and lots of the artifacts were described in English. Not first on our list, but cheap enough to be worth it if you are already in the Gothic Quarter. 10 € for two senior tickets. ", "publishedDate": "2019-04-02", "language": "en", "rating": 4}, {"id": 662586368, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d244210-r662586368-Museu_d_Historia_de_Barcelona_MUHBA-Barcelona_Catalonia.html", "text": "Cost us 2 euro's each.  We weren't there long.  Everything in Spanish.  Got a glimpse of a mosaic floor.  Kinda cool.  \nIf you are here make sure you check out  these other sites \n\nVia Sepulcral Romana (2 euro)\nTemple d'August (free)\n\nBoth are close and well worth a visit", "publishedDate": "2019-03-31", "language": "en", "rating": 3}, {"id": 660894515, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d244210-r660894515-Museu_d_Historia_de_Barcelona_MUHBA-Barcelona_Catalonia.html", "text": "We intended to have a look on Sunday morning but noticed there was free entry at 15.00. We were glad we hadn’t paid as it’s a pretty average archaeological museum. There isn’t much to see, the descriptions are poor and there are no English translations on many of the artefacts. Didn’t take us long to get round it. \n\nI expected a lot more - the building form the outside gives them impression it’s huge - it’s not. ", "publishedDate": "2019-03-24", "language": "en", "rating": 3}, {"id": 658851983, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d244210-r658851983-Museu_d_Historia_de_Barcelona_MUHBA-Barcelona_Catalonia.html", "text": "Near to the Estació De França, the Museu d’Historia is a wonderful exhibition of discovered ancient architecture.  Protected from the elements a section of ancient Barcelona is visible.  6 euros to enter is fair.  Definately worth a visit", "publishedDate": "2019-03-16", "language": "en", "rating": 4}, {"id": 658727801, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d244210-r658727801-Museu_d_Historia_de_Barcelona_MUHBA-Barcelona_Catalonia.html", "text": "If you are interested in archeology, this is a great place.  You see a large area of excavation from early Roman times.", "publishedDate": "2019-03-15", "language": "en", "rating": 4}, {"id": 658307655, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d244210-r658307655-Museu_d_Historia_de_Barcelona_MUHBA-Barcelona_Catalonia.html", "text": "Visited this museum on a Sunday afternoon and entrance was free. It was great to explore under the city to get an idea of what Barcelona was in Roman times  and later ", "publishedDate": "2019-03-13", "language": "en", "rating": 4}, {"id": 658242921, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d244210-r658242921-Museu_d_Historia_de_Barcelona_MUHBA-Barcelona_Catalonia.html", "text": "The first floor of this museum is ok but once you go down into the subterranean level that's where the magic takes place.  We were blown away with the ruins.  You really can visualize the way of live hundreds of years ago.", "publishedDate": "2019-03-13", "language": "en", "rating": 5}, {"id": 657605871, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d244210-r657605871-Museu_d_Historia_de_Barcelona_MUHBA-Barcelona_Catalonia.html", "text": "Many (many) European cities have some roman heritage, and Barcelona is no different.  If you've been to many (many) roman ruins, you might want to sit this one out, but the presentation is really interesting.  It will remind some of the Ray Bradbury story \"A Sound of Thunder\" for the suspension of a glass walkways over the old ruins.  You can do this in 1/2 hour, and admission if free first Sunday of the month (which is what we were able to do--score!).", "publishedDate": "2019-03-10", "language": "en", "rating": 4}, {"id": 657199789, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d244210-r657199789-Museu_d_Historia_de_Barcelona_MUHBA-Barcelona_Catalonia.html", "text": "The building itself is worth seeing but we went especially to see the remains of the roman city.you feel as if you’re walking through time. Quite a lot to see and very interesting and so surprised to see such well maintained archaeological remains under the cathedral area in the Gothic quarter. We went on a Sunday and it was free!!  Well worth a visit. ", "publishedDate": "2019-03-08", "language": "en", "rating": 4}, {"id": 656843349, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d244210-r656843349-Museu_d_Historia_de_Barcelona_MUHBA-Barcelona_Catalonia.html", "text": "I confess I had no idea there were such extensive Roman ruins in Barcelona -- and I I didn't expect there to be such terrific displays. I thought they did an excellent job with English signage and enjoyed the audio guide. This is a \"MUST\" for history lovers. I thoroughly enjoyed it.", "publishedDate": "2019-03-06", "language": "en", "rating": 5}, {"id": 654533672, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d244210-r654533672-Museu_d_Historia_de_Barcelona_MUHBA-Barcelona_Catalonia.html", "text": "A very interesting, though fairly small, museum. Dedicated to the history of the city since pre history, it has an imoressive underground which is part of the olde city since roman times. Free from 15h on Sundays.", "publishedDate": "2019-02-24", "language": "en", "rating": 4}, {"id": 650928569, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d244210-r650928569-Museu_d_Historia_de_Barcelona_MUHBA-Barcelona_Catalonia.html", "text": "We spent quite a bit of time here as there is so much information on the history of the origin of Barcelona. Interesting tour of the roman ruins with a lot of information.", "publishedDate": "2019-02-08", "language": "en", "rating": 5}, {"id": 650730601, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d244210-r650730601-Museu_d_Historia_de_Barcelona_MUHBA-Barcelona_Catalonia.html", "text": "We decided to visit this museum after doing the walking tour of the Gothic quarter. There is an extensive excavations of the roman city (Barcino) and the early Visigoths settlements including a fish factory, cloth dyeing operations, a wine production system and the remaind of a few temples/churches. It takes more than 1 hour to visit the underground site. You also get to see the palace and chapel of the Aragon royal dynasty. Very interesting visit and highly recommended to complement walking tours of the gothic quarter.", "publishedDate": "2019-02-07", "language": "en", "rating": 5}, {"id": 650007217, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d244210-r650007217-Museu_d_Historia_de_Barcelona_MUHBA-Barcelona_Catalonia.html", "text": "This is near the metro station and very well maintained. One of the worth-to-visit museums in Barcelona, look out for the foc timings. :)", "publishedDate": "2019-02-03", "language": "en", "rating": 5}, {"id": 649947539, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d244210-r649947539-Museu_d_Historia_de_Barcelona_MUHBA-Barcelona_Catalonia.html", "text": "Sadly (most of the time) no English descriptions were provided. Also it was not interactive at all (except for an old English video), leading it to be quite boring. The building itself is an architectural gem, so worth including in a walk! Free on the first Sunday of the month.", "publishedDate": "2019-02-03", "language": "en", "rating": 2}, {"id": 647456648, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d244210-r647456648-Museu_d_Historia_de_Barcelona_MUHBA-Barcelona_Catalonia.html", "text": "The underground tour was pretty good, for history buffs though. The old city wall and roman building give a good idea of what life was like in Roman times", "publishedDate": "2019-01-21", "language": "en", "rating": 5}, {"id": 647137013, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d244210-r647137013-Museu_d_Historia_de_Barcelona_MUHBA-Barcelona_Catalonia.html", "text": "This is a great place to start your visit to Barcelona's Gothic Quarter. (BTW, it's housed in a series of beautiful buildings) You'll see a great AV presentation that explains the city's history. Then you'll tour room after room where you literally walk through that history, via archeological sites. And for those of you who are interested in Sephardic Jewish history, there are a number of rooms on that. (And MUHBA has a seperate Museum of Jewish History, which is definitely worth a look-see, as is a walk through the Cal.) Very helpful staff too!", "publishedDate": "2019-01-20", "language": "en", "rating": 4}]}}]