[{"locationId": 7148963, "name": "Gold Fish Sculpture (Escultura el Peix d'Or)", "placeType": "ATTRACTION", "reviewListPage": {"reviews": [{"id": 752508530, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d7148963-r752508530-Gold_Fish_Sculpture_Escultura_el_Peix_d_Or-Barcelona_Catalonia.html", "text": "During our stroll along Barcelona’s waterfront, my wife and enjoy saw several vestiges of the 1992 Summer Olympics. Among them were this huge gold fish sculpture, which I learned was built in preparation for the 1992 Summer Olympics. The 52 meter size makes it impossible to miss when exploring the Barcelona waterfront. We were also fortunate to visit on a sunny September day, so the sun really made the gold colored sculpture by Frank Gehry glisten.", "publishedDate": "2020-04-11", "language": "en", "rating": 5}, {"id": 739293918, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d7148963-r739293918-Gold_Fish_Sculpture_Escultura_el_Peix_d_Or-Barcelona_Catalonia.html", "text": "We saw architect Frank Gehry's sculpture t from a block away. Wish we could have gotten closer. Impressive netted sculpture. Is it a whale, a fish, a dolphin?", "publishedDate": "2020-01-15", "language": "en", "rating": 5}, {"id": 735563682, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d7148963-r735563682-Gold_Fish_Sculpture_Escultura_el_Peix_d_Or-Barcelona_Catalonia.html", "text": "Modern and magnificent. This is a marvellous fish sculpture. It’s really undermarked. It was worth the walk to see this wonder.", "publishedDate": "2019-12-30", "language": "en", "rating": 5}, {"id": 733532272, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d7148963-r733532272-Gold_Fish_Sculpture_Escultura_el_Peix_d_Or-Barcelona_Catalonia.html", "text": "The Gold Fish sculpture is both modern and unique. You have a wonderful view from different angles along the esplanade. A great opportunity to capture some great photos. ", "publishedDate": "2019-12-18", "language": "en", "rating": 5}, {"id": 728572385, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d7148963-r728572385-Gold_Fish_Sculpture_Escultura_el_Peix_d_Or-Barcelona_Catalonia.html", "text": "On the marina of Barcelona you cannot miss this beautiful architecture - sculpture that catches your eye. Great photo opportunity.", "publishedDate": "2019-11-24", "language": "en", "rating": 5}, {"id": 723523010, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d7148963-r723523010-Gold_Fish_Sculpture_Escultura_el_Peix_d_Or-Barcelona_Catalonia.html", "text": "You can't miss this huge sculpture as you stroll the waterfront enjoying the beach area.  Everyone takes a photo and it has become a modern icon.  Lots of places to eat nearby.", "publishedDate": "2019-11-03", "language": "en", "rating": 5}, {"id": 722553186, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d7148963-r722553186-Gold_Fish_Sculpture_Escultura_el_Peix_d_Or-Barcelona_Catalonia.html", "text": "A lovely sculpture, welcoming me back on my third visit to Barcelona. This area is very nice beside port Olympic. Enjoy people watching and good food and drink. As well as the art of course", "publishedDate": "2019-10-30", "language": "en", "rating": 5}, {"id": 717077724, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d7148963-r717077724-Gold_Fish_Sculpture_Escultura_el_Peix_d_Or-Barcelona_Catalonia.html", "text": "I do like to look at different things. This is certainly in that bracket. Interesting and quite impressive", "publishedDate": "2019-10-10", "language": "en", "rating": 4}, {"id": 698698786, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d7148963-r698698786-Gold_Fish_Sculpture_Escultura_el_Peix_d_Or-Barcelona_Catalonia.html", "text": "We had a nice walk from the palace of music to The Golden Fish. It is great to see from the Promenade as closet as you getting.\nWorth the walking with the view to the ocean and the fish afterwards.\nWe rented a bike for the way back .", "publishedDate": "2019-08-13", "language": "en", "rating": 5}, {"id": 690590463, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d7148963-r690590463-Gold_Fish_Sculpture_Escultura_el_Peix_d_Or-Barcelona_Catalonia.html", "text": "Escultura el Peix d'Or is a giant steel sculpture created for the 1992 Barcelona Olympics. It's a major landmark of the city and one of the symbols of post-Olympic Barcelona i the port area. \n\nThe sculpture depicts a fish, and on a sunny day, the sunlight reflects off the steel structure in gold, giving the appearance of a Goldfish.", "publishedDate": "2019-07-18", "language": "en", "rating": 4}, {"id": 680445946, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d7148963-r680445946-Gold_Fish_Sculpture_Escultura_el_Peix_d_Or-Barcelona_Catalonia.html", "text": "If you're in La Barceloneta you can go on a walk to see the fish at close range. I like it,  but I like all sculptures :) ", "publishedDate": "2019-06-10", "language": "en", "rating": 4}, {"id": 674732447, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d7148963-r674732447-Gold_Fish_Sculpture_Escultura_el_Peix_d_Or-Barcelona_Catalonia.html", "text": "I was visiting a building on the waterfront nearby and could see something shimmering in the distance, so I decided to explore and investigate.\n\nWalking along the ocean front you discover this flying gold fish, which is both a sculpture and a piece of architecture.\n\nDesigned by the American architect Frank Gehry (who is possibly most famous in Spain for his masterful Guggenheim Museum in Bilbao) for the 1992 Barcelona Olympics, the Fish shimmers in the sunlight and takes on different characteristics as you walk round it. \n\nArchitecturally, it was designed as a canopy for the Barcelona Casino and the restaurants in this complicated series of spaces at different levels linking the Hotel Arts and the promenade. \n\nAlthough known as the Gold Fish, from different angles it takes the characteristics of a flying fish, a mantra ray or perhaps a whale, if you use your imagination.  Gold is just the reflective colour that catches the sun. \n\nA fun piece of architecture along the ocean front. \n", "publishedDate": "2019-05-18", "language": "en", "rating": 4}, {"id": 673635849, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d7148963-r673635849-Gold_Fish_Sculpture_Escultura_el_Peix_d_Or-Barcelona_Catalonia.html", "text": "The Gold Fish Sculpture (Escultura el Peix d'Or) is certainly different from other sculptures. It's a really big fish, 52 metres long!  It was actually made for the 1992 Barcelona Olympics. The steel structure, which is coloured gold, serves as a canopy for the casino and the restaurants below. Frank Owen Gehry, a Canadian-born American architect, is the man credited with designing this art work. His work is said to be postmodernist  with an element of deconstructivism. His best-known works include the titanium-clad Guggenheim Museum in Bilbao, the Dancing House in Prague,  and many others. You can see the big fish from afar so if you are in the vicinity you can probably see it from somewhere....", "publishedDate": "2019-05-13", "language": "en", "rating": 5}, {"id": 661518337, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d7148963-r661518337-Gold_Fish_Sculpture_Escultura_el_Peix_d_Or-Barcelona_Catalonia.html", "text": "I don't know the history of the sculpture, it was nice to look at. May be photo taking for some.\nIt seems average to me.", "publishedDate": "2019-03-26", "language": "en", "rating": 3}, {"id": 656710275, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d7148963-r656710275-Gold_Fish_Sculpture_Escultura_el_Peix_d_Or-Barcelona_Catalonia.html", "text": "Take a photograph of the fish and the ball as you walk along but not quite sure of what it is supposed to represent.", "publishedDate": "2019-03-06", "language": "en", "rating": 3}, {"id": 648589950, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d7148963-r648589950-Gold_Fish_Sculpture_Escultura_el_Peix_d_Or-Barcelona_Catalonia.html", "text": "Enough to say that I've taken many photos there\nA clean beach and a golden fish under shiny sun shone.", "publishedDate": "2019-01-27", "language": "en", "rating": 5}, {"id": 629215158, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d7148963-r629215158-Gold_Fish_Sculpture_Escultura_el_Peix_d_Or-Barcelona_Catalonia.html", "text": "Just a sculpture of a fish, nothing too special. If you pass it, it is nice to see but I wouldn’t go out of your way to visit it.", "publishedDate": "2018-10-28", "language": "en", "rating": 3}, {"id": 612372136, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d7148963-r612372136-Gold_Fish_Sculpture_Escultura_el_Peix_d_Or-Barcelona_Catalonia.html", "text": "Walking down to the beach, you can't miss the landmark of the Goldfish sculpture.  In the bright sun the scales will be glinting.  There are lots of bars and restaurants nearby", "publishedDate": "2018-08-30", "language": "en", "rating": 4}, {"id": 610503482, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d7148963-r610503482-Gold_Fish_Sculpture_Escultura_el_Peix_d_Or-Barcelona_Catalonia.html", "text": "Located at the north end of the beachside promenade, it’s a good starting point off the Metro (a couple of blocks away) to start a 2-mile stroll along the beach.  Neat landmark for your pics, especially when the afternoon sun reflects off it.", "publishedDate": "2018-08-26", "language": "en", "rating": 4}, {"id": 602096237, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d7148963-r602096237-Gold_Fish_Sculpture_Escultura_el_Peix_d_Or-Barcelona_Catalonia.html", "text": "It is what it is. No need do anything except appreciate and enjoy. Walking down to Port Olympic every morning it would be as gold as gold gets. Walking home that afternoon, it would be different, but still interesting. ", "publishedDate": "2018-08-02", "language": "en", "rating": 4}, {"id": 591421622, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d7148963-r591421622-Gold_Fish_Sculpture_Escultura_el_Peix_d_Or-Barcelona_Catalonia.html", "text": "We spend the day at the beach and saw this structure on the way. I had no idea what it was meant to be until i saw it on TripAdvisor. \n\nIt was huge and looked impressive, even more so when the sun was setting.", "publishedDate": "2018-06-28", "language": "en", "rating": 3}, {"id": 590321342, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d7148963-r590321342-Gold_Fish_Sculpture_Escultura_el_Peix_d_Or-Barcelona_Catalonia.html", "text": "This interesting and curiously constructed work of art is mounted on the beach and facing out to sea in this now affluent area of Barcelona. Commissioned for the '92 Olympics, the designer, Gehry, must have had a twinge of nervousness at the prospect of  competing with the beloved Gaudi, whose Sagrada Familia seems to be the greatest attraction to this fine city. He needn't have worried because this I a great work of art from a remarkable architect and his works can stand with the best in the world. \nIt might no be the only thing to bring someone to Barcelona but it is worth a visit if only to marvel at something that was created by the same artist as the Guggenheim in Bilbao and many others around the world.", "publishedDate": "2018-06-24", "language": "en", "rating": 5}, {"id": 587289696, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d7148963-r587289696-Gold_Fish_Sculpture_Escultura_el_Peix_d_Or-Barcelona_Catalonia.html", "text": "The Gold Fish Sculpture \nEl PEIX \nFrom Frank Gehry \n\nA Work of a Genius !\n\nLove letters to Barcelona...\nFew years back I went to AGO in Toronto. That was my first vis-a-vis encounter with Frank’s Architectural works. On my Review for that work I needed to confess that I never heard about this architectural masterpiece by the renowned -Toronto native architect- Frank Gehry. I was obliged state it’s an “ARCHITECTURAL MASTERPIECE....”. Noting that this wonderful masterpiece of modern architecture will impact even the guests to that Museum that does not care for architectural works. With its exterior facade and volumes that seems to overflow like an UFO, from the very top of the sidewalk, with its multiple curved structure of crystal panels, making an envelope for the old solid concrete structure building that had been gracefully adapted and redesigned with clear and fluent functionalism by Gehrig...\nSTUNNING DESIGN...SIMPLY A WORK OF A GENIUS ! \nMany says that, rather than a “tumultuously elaborated creation”, this may be one of Frank’s “most gentle and self-possessed designs”. \nBeen myself an old architect I had enjoyed his works in LA and now, as part of a longtime planned and cherished Gastrotour of (almost) all Spain...we are scheduled to visit-after Barcelona- two of his great works in Spain; “Marques de Riscal” and his well known “Guggenheim” Museum at Bilbao. \nFrank’s buildings are both; kind of experimental creations plus “transformative” (transformers like) ones, but always keeping the sense where they are created.\nHis boldish designs have led to call him:\n“THE...most important architect of our age” !\nWe were in the great city of Barcelona...our first Gastrotour Stop. \nOur Agenda, besides the finest and top restaurants, included “mandatory” visits to the creations of Antoni Gaudi. Another genius on Architecture, my field of professional work, with creations-similarly to Gehry-greater than his times  \n\nI heard so many things about Gehry’s “Peix” (Fish), here at Barcelona, that I needed to visit it...to better appreciate (as arts lover) that work. \nIt was our last day at Barcelona and we took good advantage of having that day, already with us, our rented BMW...a car that would be traveling with us, over 4,000 kms (almost), all over Spain; from Barcelona to La Rioja. From there to Pais Vasco and later on to Ribera del Duero and Galicia’s Rias Baixas. After that was Porto and from Porto our trip would end in majestic Madrid...via Monumental city of Caceres. \n\nIt was a rainy day, but we didn’t care; we were joyfully driving all over Barcelona including-of course- its beautiful renovated seaside areas...were that fish has become one of the symbols of post-Olympic Barcelona. In someways was a petty that we had no-sunshine as  it is interesting how the sunlight gets reflected into the scales of that large scale “Peix” \nIs important to note that this was the first Gehry project experimenting with the computer to help him design its curve form and build its complicated structure. \nusing stainless steel that, at the same time, is supported by a metal structure\nWith a perfect location on the beachfront, that giant “Peix” (120 ft x 100 ft approx) is today one of the city’s most beloved landmarks...among a city of many-many historic ones \nMany say that in many ways- it is a good way to remind -Cities resting next to the Sea- how lucky they are to have it, as it is here-in Barcelona-a wonderful City...City of great arts and fantastic gastronomic places...bathe by the Mediterranean sea.\nI’m obliged to comment that this thoughts are-similarly- good to ourselves...living in Santo Domingo City with a long-beautiful “Malecon”, right on the Caribbean Sea...but its a painful true to notice and accept-as architect- that we live giving our backs to that Sea...taking it for granted.", "publishedDate": "2018-06-13", "language": "en", "rating": 5}, {"id": 583841635, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d7148963-r583841635-Gold_Fish_Sculpture_Escultura_el_Peix_d_Or-Barcelona_Catalonia.html", "text": "This a large piece of artwork measuring 56m in length and 35m in height. It is a metal structure covered in gilded stainless steel strips. The sculpture looks good at night with lighting but is at its best in sunlight when the suns rays are reflected by the metallic strips. Nice artwork and an iconic feature in the area.", "publishedDate": "2018-05-30", "language": "en", "rating": 4}, {"id": 576447400, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d7148963-r576447400-Gold_Fish_Sculpture_Escultura_el_Peix_d_Or-Barcelona_Catalonia.html", "text": "You can see this amazing structure from many places but it is an especially cool piece of art seen from the Hotel Arts!  When the sun is shining on it, it looks golden :)", "publishedDate": "2018-04-29", "language": "en", "rating": 5}, {"id": 565857034, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d7148963-r565857034-Gold_Fish_Sculpture_Escultura_el_Peix_d_Or-Barcelona_Catalonia.html", "text": "This shining goldfish is located amongst the forecourt of the casino, so close up (see pic) it's not that impressive but seeing it across the beach (see pics) it looks fantastic.", "publishedDate": "2018-03-11", "language": "en", "rating": 5}, {"id": 564059943, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d7148963-r564059943-Gold_Fish_Sculpture_Escultura_el_Peix_d_Or-Barcelona_Catalonia.html", "text": "If you are a Frank Gehry fan then this is a must do. I was part of the team that built the Gehry NY building and ever since I have been a admirer. This is very cool!!!", "publishedDate": "2018-03-03", "language": "en", "rating": 5}, {"id": 563359476, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d7148963-r563359476-Gold_Fish_Sculpture_Escultura_el_Peix_d_Or-Barcelona_Catalonia.html", "text": "It was quite normal for the most famous living architect , Frank Gehry , to be invited to design the icon of the '92 Olympics in the mecca of architecture : Barcelona . I was told that it was the first time that he used the 3D digital imagery technique to design this huge sculpture ! Like most of his masterpieces , he maerials to create a design that changes with the sunlight", "publishedDate": "2018-02-28", "language": "en", "rating": 5}, {"id": 548902064, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d7148963-r548902064-Gold_Fish_Sculpture_Escultura_el_Peix_d_Or-Barcelona_Catalonia.html", "text": "The Gold Fish Sculpture on Barceloneta (beach area) is spectacular or not depending on the sunlight. It was created by famous architect Frank Gehry. The strips of steel shimmer when there is direct sun.  It kind of falls flat when the sun is not hitting it. But it does not hurt to see it in any event.", "publishedDate": "2017-12-23", "language": "en", "rating": 4}, {"id": 547418925, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d7148963-r547418925-Gold_Fish_Sculpture_Escultura_el_Peix_d_Or-Barcelona_Catalonia.html", "text": "I guess this is something interesting for someone who has a real passion for architecture and sculpture. But for me personally, this was nothing I would especially recommend. There are other more beautiful and interesting things to see in Barcelona. ", "publishedDate": "2017-12-15", "language": "en", "rating": 2}, {"id": 537454153, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d7148963-r537454153-Gold_Fish_Sculpture_Escultura_el_Peix_d_Or-Barcelona_Catalonia.html", "text": "Down at the beach you can’t miss the sculpture , standing out under the impressive arts hotel. The area surrounding it is lovely with bars, restaurants & beach area. At night it’s lit up fantastically, drawing the eyes! ", "publishedDate": "2017-10-31", "language": "en", "rating": 4}, {"id": 529684262, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d7148963-r529684262-Gold_Fish_Sculpture_Escultura_el_Peix_d_Or-Barcelona_Catalonia.html", "text": "If you're anywhere near the beach you will see the fish.\nIf you're there long enough it looks a different color depending on how the sun hits it.", "publishedDate": "2017-10-03", "language": "en", "rating": 5}, {"id": 524248802, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d7148963-r524248802-Gold_Fish_Sculpture_Escultura_el_Peix_d_Or-Barcelona_Catalonia.html", "text": "Iconic and very present.  If you walk along the waterfront and the beaches, you really can't miss it.  Fun and a good place for a photo.", "publishedDate": "2017-09-13", "language": "en", "rating": 4}, {"id": 509280477, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d7148963-r509280477-Gold_Fish_Sculpture_Escultura_el_Peix_d_Or-Barcelona_Catalonia.html", "text": "Honestly i have challenges in seeing the fish in the sculpture but it is nevertheless impressive. Recommendation: go there Early morning or at sunset. Just Beautiful to have the beach View with this shining fish.", "publishedDate": "2017-08-06", "language": "en", "rating": 4}, {"id": 506826498, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d7148963-r506826498-Gold_Fish_Sculpture_Escultura_el_Peix_d_Or-Barcelona_Catalonia.html", "text": "This sculpture was outside the Hotel des Arts where we stayed. We had lots of fun guessing what it was supposed to be before we looked it up, whale, fish, wave, we were told by a guide that it looks like a Conquistadors helmet from the sea. It was a good landmark for the hotel but I wouldn't make a trip to see it", "publishedDate": "2017-07-29", "language": "en", "rating": 2}, {"id": 504063114, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d7148963-r504063114-Gold_Fish_Sculpture_Escultura_el_Peix_d_Or-Barcelona_Catalonia.html", "text": "We were proud to see this lovely goldfish near the Barcelona beachfront. We were able to view it from the restaurant we had dinner in, from the street and from the beach. What s fitting tribute to the early fisherman who used this area for a long time prior to the Olympic transformation.", "publishedDate": "2017-07-20", "language": "en", "rating": 4}, {"id": 492201890, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d7148963-r492201890-Gold_Fish_Sculpture_Escultura_el_Peix_d_Or-Barcelona_Catalonia.html", "text": "We happened to walk by this. Nice  if you happen to walk by. Not anything to plan a special trip for. I didn't know it was a goldfish until I found it in here.", "publishedDate": "2017-06-11", "language": "en", "rating": 3}, {"id": 489117432, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d7148963-r489117432-Gold_Fish_Sculpture_Escultura_el_Peix_d_Or-Barcelona_Catalonia.html", "text": "Stayed at the Arts Hotel and had the luxury of viewing this wonderful sculpture every day from my room and pool. Just beautiful ", "publishedDate": "2017-05-30", "language": "en", "rating": 5}, {"id": 478527956, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d7148963-r478527956-Gold_Fish_Sculpture_Escultura_el_Peix_d_Or-Barcelona_Catalonia.html", "text": "This Sculpture dominates its area overlooking the Barcelona beach. Despite being huge and elevated it is hidden from view at certain angles so be careful not to miss it. Built by Gehry as a celebratory tribute to the 92 Olympiad it is a significant work.", "publishedDate": "2017-04-24", "language": "en", "rating": 4}, {"id": 471148478, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d7148963-r471148478-Gold_Fish_Sculpture_Escultura_el_Peix_d_Or-Barcelona_Catalonia.html", "text": "The goldfish sculpture 'El Peix' is one of the most striking and probably most photographed landmarks in Port Olimpic.\nI believe it was designed by Frank Gehry and stainless steel surface changes appearance depending on the angle of the sun.\nIt was built for the 1992 Olympic games.\nNice sculpture but not overly impressive.", "publishedDate": "2017-03-29", "language": "en", "rating": 3}, {"id": 455076850, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d7148963-r455076850-Gold_Fish_Sculpture_Escultura_el_Peix_d_Or-Barcelona_Catalonia.html", "text": "A nice sculpture that is well placed among the Olympic Port. I think on its own it is not that impressive but within the context of the ambience of beaches and port it gets it is a good addition.", "publishedDate": "2017-01-26", "language": "en", "rating": 3}, {"id": 443884853, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d7148963-r443884853-Gold_Fish_Sculpture_Escultura_el_Peix_d_Or-Barcelona_Catalonia.html", "text": "We had to see the beach in Barcelona so took the metro to Ciutadella|Vila Olimpica then walked down the street then under this huge gold mesh fish sparkling in the sun.  Unique to Barcelona and a great way to start our trip!", "publishedDate": "2016-12-12", "language": "en", "rating": 5}, {"id": 427832380, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d7148963-r427832380-Gold_Fish_Sculpture_Escultura_el_Peix_d_Or-Barcelona_Catalonia.html", "text": "A strange monument placed on the seashore,close to the Olympic Port.Theoretic it represents a whale or other kind of fish but for me it looks like a slaughtered whale.Interesting though...", "publishedDate": "2016-10-14", "language": "en", "rating": 3}, {"id": 420610902, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d7148963-r420610902-Gold_Fish_Sculpture_Escultura_el_Peix_d_Or-Barcelona_Catalonia.html", "text": "Quite a nice sculpture dominating several of the beaches from Barceloneta to Bogatell You can't miss it!\n\n", "publishedDate": "2016-09-20", "language": "en", "rating": 4}, {"id": 414642472, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d7148963-r414642472-Gold_Fish_Sculpture_Escultura_el_Peix_d_Or-Barcelona_Catalonia.html", "text": "Well-known Gehry's sculpture dominantes the east side of the beach creating a counterpart to W Barcelona by Bofill. ", "publishedDate": "2016-09-04", "language": "en", "rating": 3}, {"id": 409687909, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d7148963-r409687909-Gold_Fish_Sculpture_Escultura_el_Peix_d_Or-Barcelona_Catalonia.html", "text": "This shiny fish has been a landmark for the beaches of Barcelona since the Olympics of '92. When the rays of the sun play with the surfaces of the material, it is a very nice view. However it doesn't really capture the imagination as I would expect from a piece of architecture.\n\nAlso visible from the plane when landing at Barcelona if you have a right side window seat.", "publishedDate": "2016-08-23", "language": "en", "rating": 3}, {"id": 386167887, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d7148963-r386167887-Gold_Fish_Sculpture_Escultura_el_Peix_d_Or-Barcelona_Catalonia.html", "text": "Gloriously weird. This sculpture by Frank Gehry is fun and can't be missed when walking along the beach. Silly but in a good way! ", "publishedDate": "2016-06-26", "language": "en", "rating": 5}, {"id": 383784199, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d7148963-r383784199-Gold_Fish_Sculpture_Escultura_el_Peix_d_Or-Barcelona_Catalonia.html", "text": "The Gold Fish Sculpture is located in the north end of Barceloneta Beach.\nThe Gold Fish is designed by Frank Gehry and built to the Olympic Games in 1992.\nThe sculpture is 52 meter long, gold coulered stainless steel.\nIt is visible at a long distance along the beach and from the sea.\nIn sunshine the Gold Fish is a very beautiful multi-coulered sculpture.", "publishedDate": "2016-06-18", "language": "en", "rating": 4}, {"id": 378366576, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d7148963-r378366576-Gold_Fish_Sculpture_Escultura_el_Peix_d_Or-Barcelona_Catalonia.html", "text": "the Gold Fish Sculpture is located on the seafront alley of Barcelona in front of the skyscraper of The Arts Hotel and the Casino;it was created in 1992 by the Canadian artist Frank Gehry on the occasion of the 1992 Barcelona Olympic Games;it is 52 meters long is made of golden coloured stainless steel but changes its appearance depending on the angle of the sun and the weather conditions; although from Port Vell to the Golden Fish there is quite a long way to walk,an estimated 2 kilometers,it is worth the walk and worth seeing this amazing creation from a near perspective;from this point further down there is the former Olympic Village and the sailing stadium of the 1992 Olympic Games (kaiak and kanoe contests)", "publishedDate": "2016-05-31", "language": "en", "rating": 5}, {"id": 375251647, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d7148963-r375251647-Gold_Fish_Sculpture_Escultura_el_Peix_d_Or-Barcelona_Catalonia.html", "text": "Loved the area near the goldfish sculpture.  Its on the way to the beach and there are a lot of restaurants, bars and shops along the way! You can't miss the sculpture if you are in the area and look up.  I believe the tour guide said you could see it from all the Barcelona beaches", "publishedDate": "2016-05-21", "language": "en", "rating": 4}, {"id": 370449429, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d7148963-r370449429-Gold_Fish_Sculpture_Escultura_el_Peix_d_Or-Barcelona_Catalonia.html", "text": "It's a sculpture. It looks like a fish. If you like art and fish then you should be happy. Great art all over the city. Great location by the beach ", "publishedDate": "2016-05-05", "language": "en", "rating": 5}, {"id": 369152854, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d7148963-r369152854-Gold_Fish_Sculpture_Escultura_el_Peix_d_Or-Barcelona_Catalonia.html", "text": "If you are walking along the beach at Barcolonetta you will see this sculpture.  It is one of those weird things  that you take a photo of and then keep going.  I wouldn't go out of my way to see it but it is a part of Barcelona!", "publishedDate": "2016-05-01", "language": "en", "rating": 4}, {"id": 356992853, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d7148963-r356992853-Gold_Fish_Sculpture_Escultura_el_Peix_d_Or-Barcelona_Catalonia.html", "text": "If you're walking along Barceloneta, this is hard to miss. Frank Gehry's creation is situated right next to the casino. Walk past it, take some pictures, move along. ", "publishedDate": "2016-03-20", "language": "en", "rating": 4}, {"id": 353701951, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d7148963-r353701951-Gold_Fish_Sculpture_Escultura_el_Peix_d_Or-Barcelona_Catalonia.html", "text": "Visible from several areas of the city, located near the Casino.  Attractive and easy reference to gain your bearings.", "publishedDate": "2016-03-07", "language": "en", "rating": 3}, {"id": 339876600, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d7148963-r339876600-Gold_Fish_Sculpture_Escultura_el_Peix_d_Or-Barcelona_Catalonia.html", "text": "The imposing sculpture by Frank Gehry was made as a part of renovation works for hosting the Olympic Games in 1992. It is constructed from interlaced gold-colored stainless steel strips which change the color depending on the light conditions. That gives the impression that this 56 meters long and 35 meters high fish is almost alive and dances on the sea waves.", "publishedDate": "2016-01-14", "language": "en", "rating": 5}, {"id": 330497714, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d7148963-r330497714-Gold_Fish_Sculpture_Escultura_el_Peix_d_Or-Barcelona_Catalonia.html", "text": "In the sunlight this monument glimmers and looks almost like it is moving. It is modern, trendy and luxurious, makes a fantastic photo op.", "publishedDate": "2015-12-03", "language": "en", "rating": 5}, {"id": 330002371, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d7148963-r330002371-Gold_Fish_Sculpture_Escultura_el_Peix_d_Or-Barcelona_Catalonia.html", "text": "one of the most know sculpture for Barcelona but don't get so exited to see as well as every one says its not so impressive. but you will enjoy seeing sunshine on this metal sculpture", "publishedDate": "2015-11-30", "language": "en", "rating": 4}, {"id": 323836277, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d7148963-r323836277-Gold_Fish_Sculpture_Escultura_el_Peix_d_Or-Barcelona_Catalonia.html", "text": " is one of the best known and most striking landmarks on Barcelona’s seafront. It’s gold coloured stainless steel surface shines under the Mediterranean sun and changes appearance depending on the angle of the sun and the current weather conditions. Must visit.", "publishedDate": "2015-11-02", "language": "en", "rating": 4}, {"id": 322549137, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d7148963-r322549137-Gold_Fish_Sculpture_Escultura_el_Peix_d_Or-Barcelona_Catalonia.html", "text": "Walking from the harbour we wondered what it was we could see in the distance, glinting a bronze and gold colour in the sunlight.  Coming up to it was a very impressive sight, it looked light something out of the Milan EXPO.\n\nWell worth a visit!", "publishedDate": "2015-10-27", "language": "en", "rating": 4}, {"id": 317811499, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d7148963-r317811499-Gold_Fish_Sculpture_Escultura_el_Peix_d_Or-Barcelona_Catalonia.html", "text": "You shouldn't be so anxious to see it because it is not impressive.You cannot miss it if you get to barcelona beach,but it is sumersed by the other buildings.The sculpture by itself would be nicer if put in another place.Overall you should see it.Why miss it?!", "publishedDate": "2015-10-11", "language": "en", "rating": 3}, {"id": 317188483, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d7148963-r317188483-Gold_Fish_Sculpture_Escultura_el_Peix_d_Or-Barcelona_Catalonia.html", "text": "Awesome huge statue. Right in front of the beach, hotels, casinos, a lot of beautiful boats. A must see landmark. ", "publishedDate": "2015-10-08", "language": "en", "rating": 5}, {"id": 314912296, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d7148963-r314912296-Gold_Fish_Sculpture_Escultura_el_Peix_d_Or-Barcelona_Catalonia.html", "text": "If you walking on the beach you will see it anyway, so its a bit unusual fish, but its nice to find such things in Barcelona", "publishedDate": "2015-09-29", "language": "en", "rating": 4}, {"id": 311420073, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d7148963-r311420073-Gold_Fish_Sculpture_Escultura_el_Peix_d_Or-Barcelona_Catalonia.html", "text": "The golden fish located on the seaside is a must for those who love architecture, as it is a work of the legendary Frank Gehry - the curvy lines of the fish are rather innovative. \nThe giant golden fish is located at the seashore with lots of cocktail bars next to it. ", "publishedDate": "2015-09-17", "language": "en", "rating": 5}, {"id": 308314263, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d7148963-r308314263-Gold_Fish_Sculpture_Escultura_el_Peix_d_Or-Barcelona_Catalonia.html", "text": "We were staying at the Arts and the Gold fish Sculpture view from the window overlooking the ocean really stands out. ", "publishedDate": "2015-09-08", "language": "en", "rating": 5}, {"id": 259386233, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d7148963-r259386233-Gold_Fish_Sculpture_Escultura_el_Peix_d_Or-Barcelona_Catalonia.html", "text": "The Gold Fish Sculpture is a lovely sculpture by Frank Gehry sitting between Hotel Arts and the beach on the Port Olympic. It is large (50m plus), with a beautiful goldfish hue that glistens and changes with the sunlight. Built for the 1992 Barcelona Olympics, it is most recommended to visit.", "publishedDate": "2015-03-14", "language": "en", "rating": 4}, {"id": 257343464, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d7148963-r257343464-Gold_Fish_Sculpture_Escultura_el_Peix_d_Or-Barcelona_Catalonia.html", "text": "Looks great from many angles and worth catching as the sun goes down. its total made but that what makes it so interesting.", "publishedDate": "2015-03-02", "language": "en", "rating": 4}, {"id": 246511984, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d7148963-r246511984-Gold_Fish_Sculpture_Escultura_el_Peix_d_Or-Barcelona_Catalonia.html", "text": "This was an icon for the Olympic Village, but now sits quite forgotten in the middle of Port Olimpic. It looks particularly pretty at night, when the lights make the metal \"fish\" glow a bright gold.", "publishedDate": "2014-12-30", "language": "en", "rating": 3}]}}]