[{"locationId": 3224257, "name": "Templo del Sagrado Corazon de Jesus", "placeType": "ATTRACTION", "reviewListPage": {"reviews": [{"id": 749640372, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d3224257-r749640372-Templo_del_Sagrado_Corazon_de_Jesus-Barcelona_Catalonia.html", "text": "Beautiful basilica, very grand and perfect location to see from all angles of Barcelona. Inside is so peaceful and everyone was very respectful which was nice to see. The only disappointing thing is that the amusement park takes away from the grandeur.", "publishedDate": "2020-03-06", "language": "en", "rating": 5}, {"id": 749580150, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d3224257-r749580150-Templo_del_Sagrado_Corazon_de_Jesus-Barcelona_Catalonia.html", "text": "Interesting site. shame is, the best parts can only be seen from the outside far away from the site, not in the enclosure when you can use your audio guide. Huge rip off price min 36 EUR. I wish the pope and his mega rich vatican bank could do something positive and not just rip people off for, god knows what purpose.......Fleece tourists, new religion of the European South????", "publishedDate": "2020-03-06", "language": "en", "rating": 2}, {"id": 749303710, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d3224257-r749303710-Templo_del_Sagrado_Corazon_de_Jesus-Barcelona_Catalonia.html", "text": "Loved this temple outside and inside (the entrance is free)!!! It was our highlight of visit to Tibidabo. I just wish we came during the day (and not in the evening when it was dark) so I could take nicer photos and admire the facade better. Also, I saw on other’s pictures that you can go up and have a different point of view (to see the statue of Jesus and the whole view on Tibidabo). I wish we could have done that, but it was too late. ", "publishedDate": "2020-03-05", "language": "en", "rating": 5}, {"id": 748355697, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d3224257-r748355697-Templo_del_Sagrado_Corazon_de_Jesus-Barcelona_Catalonia.html", "text": "Just fantastic old history. It is a bit of struggle to get there but with nice weather it is great to see the interior and building. It is very black/white that there is a park for children just 50 meter away. Anyway, Nice to see", "publishedDate": "2020-02-29", "language": "en", "rating": 5}, {"id": 747820935, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d3224257-r747820935-Templo_del_Sagrado_Corazon_de_Jesus-Barcelona_Catalonia.html", "text": "Came here on the off-season so the amusement park was closed. But the church is so pretty and you can climb to the top for a small fee of 4 euros. There is a cute town not too far down that offers good local food.", "publishedDate": "2020-02-26", "language": "en", "rating": 5}, {"id": 747738166, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d3224257-r747738166-Templo_del_Sagrado_Corazon_de_Jesus-Barcelona_Catalonia.html", "text": "After looking at Tibidabo up on the hills on a previous visit to Barcelona it was great to visit the area itself during a recent visit. The church is beautiful and peaceful, the views over the city are magnificent. The drive is a bit hairy with lots of cyclists on the road. You pay at the top of the car park not at the barriers on the way oot", "publishedDate": "2020-02-26", "language": "en", "rating": 4}, {"id": 745447667, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d3224257-r745447667-Templo_del_Sagrado_Corazon_de_Jesus-Barcelona_Catalonia.html", "text": "If you go by public transport you need to take the metro to the cable car and then a bus to the Temple.It took longer tha a taxi but much cheaper. The statue of Christ on the top of the temple reminded me of Christ the Redeemer in Rio.", "publishedDate": "2020-02-16", "language": "en", "rating": 4}, {"id": 744573007, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d3224257-r744573007-Templo_del_Sagrado_Corazon_de_Jesus-Barcelona_Catalonia.html", "text": "This is a \"must visit\" place. Not only for the architectonic monument of this Basílica (Hermita, Crypt & Basílica), but also the most astonish view over Barcelona.", "publishedDate": "2020-02-12", "language": "en", "rating": 5}, {"id": 744070448, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d3224257-r744070448-Templo_del_Sagrado_Corazon_de_Jesus-Barcelona_Catalonia.html", "text": "It was a wonderful experience - I highly recommend to go on a sunny, clear day, to take the elevator till the highest point possible (downstairs is easy by foot) - pictures and landscape great!\nThe only problem was with the public transport  - tram was no more functional and we hardly found somebody to tell us the hours for bus, but till the end it worth!!", "publishedDate": "2020-02-09", "language": "en", "rating": 4}, {"id": 737064130, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d3224257-r737064130-Templo_del_Sagrado_Corazon_de_Jesus-Barcelona_Catalonia.html", "text": "I literaly thought i was in  a Disney movie. The view is breathtaking and the Temple struck me with awe.  You can feel gods presence watching over with kindness", "publishedDate": "2020-01-05", "language": "en", "rating": 5}, {"id": 736985779, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d3224257-r736985779-Templo_del_Sagrado_Corazon_de_Jesus-Barcelona_Catalonia.html", "text": "風景搭配好天氣拍起來超漂亮，建築物的外觀看起來非常雄偉。也可以搭電梯加一小段步行走到教堂頂端，可以俯瞰整個樂園和城市。來這裡的大眾運輸需要轉比較多次，但絕對值得。\nAmazing construction!\nNot easy to come here by public transport, but it's definitely worth it! You can climb up and see an overview of the city. Outside the building you can also take amazing pictures with this", "publishedDate": "2020-01-05", "language": "en", "rating": 5}, {"id": 732904058, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d3224257-r732904058-Templo_del_Sagrado_Corazon_de_Jesus-Barcelona_Catalonia.html", "text": "This is an absolute must see when in Barcelona. The absolute best view you will get just about anywhere in the world! Not the easiest place to get to and it take time to get there unless you just pay for a tact. BUT it’s all worth it. Take the lift to the second view and walk the steps to the top. Stand just below the Jesus statue. The inside is very nice but much smaller that you’d expect but I’m telling you the view is more than worth it. For a plus, visit in the late afternoon and stay for the sunset over the whole city. ", "publishedDate": "2019-12-15", "language": "en", "rating": 5}, {"id": 731845917, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d3224257-r731845917-Templo_del_Sagrado_Corazon_de_Jesus-Barcelona_Catalonia.html", "text": "We traveled there by bus, metro, funicular, bus and as well as enjoying that experience, when you get there... just wow. the place is stunning, the view is stunning, and all for a few Euro's.  ", "publishedDate": "2019-12-10", "language": "en", "rating": 5}, {"id": 731730926, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d3224257-r731730926-Templo_del_Sagrado_Corazon_de_Jesus-Barcelona_Catalonia.html", "text": "Thhis trip is worth the price to go to Barcelona Yes, it is crowded, and yes it is under construction, and yes, it is odd to pay a fee to enter a church. All that aside- the money dgoes back into the construction, which is now full steam ahead to try and finish the 100 years of work during the next 7 years alone. It is a monumental work, a unique testimony to one man's passion, dedication, and reverence. And it gorgeous besides.", "publishedDate": "2019-12-09", "language": "en", "rating": 5}, {"id": 730853430, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d3224257-r730853430-Templo_del_Sagrado_Corazon_de_Jesus-Barcelona_Catalonia.html", "text": "OMG....this is a must see stop in Barcelona.  Tried to reach the site by the hop on hop off bus but when directed to the funibus stop we found that it wasnt running that afternoon.  No driver would give any information as to why!  Very unhappy with that experience.  Later in the week we went to tourist information and discovered the easy metro ride to the same spot that the funibus didnt pick up the previous try.  This day we were a little earlier and tourist info people were standing at the funibus stop (placa Kennedy) selling tickets to the amusement park/church for $13 euro pp.  We bought those since we had planned on taking a taxi from this spot if no funibus was available again.  The amusement park was only partially open but had 4 rides running, big ferris wheel, aeroplane, carousel and some type of bucket lift.  All looked fun if you have time.  We were there for the beautiful church and views so, we didnt go on any rides.  It was very quiet at both places and we enjoyed a few hours enjoying the view and climbing to the top of the church tower!!!!  We all got some beautiful photos, had a light lunch at the restaurant and had a great time.  Unfortunately, the dumb bus stopped running before the park closed and when my brother left (later than I did), he had to figure it out by himself since no bus showed up after waiting ONE hour.  Taxi back down the mountain (awesome views on a steep road) cost $20.", "publishedDate": "2019-12-05", "language": "en", "rating": 5}, {"id": 725850000, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d3224257-r725850000-Templo_del_Sagrado_Corazon_de_Jesus-Barcelona_Catalonia.html", "text": "Pay the extra €4 and go all the way up to the top of the church! The view is absolutely incredible! You can see all of Barcelona!", "publishedDate": "2019-11-11", "language": "en", "rating": 5}, {"id": 724948681, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d3224257-r724948681-Templo_del_Sagrado_Corazon_de_Jesus-Barcelona_Catalonia.html", "text": "Beautiful spectacular wow - its just a beautiful peaceful place to visit and the cable cars/ tracks to get there are an experience in themselves", "publishedDate": "2019-11-08", "language": "en", "rating": 5}, {"id": 724201134, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d3224257-r724201134-Templo_del_Sagrado_Corazon_de_Jesus-Barcelona_Catalonia.html", "text": "Very nice place, awesome view! The restaurant is now worth the money, but is ok for a drink or too (very expensive). The church is beautiful, very impressive and you will get very nice pictures ups there. There is also a kind of small theme park with some rides.", "publishedDate": "2019-11-05", "language": "en", "rating": 5}, {"id": 722313825, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d3224257-r722313825-Templo_del_Sagrado_Corazon_de_Jesus-Barcelona_Catalonia.html", "text": "This was very nice to visit.  There is a big hill to walk up, when dropped off by the bus.  It is a nice place to go inside.  There is a lift at a cost, there is an extra cost to visit the terraces and the image of the sacred heart.  There was a wedding going on when we were here, which was a nice surprise.  There is a gift shop, and a set of toilets on one of the levels.", "publishedDate": "2019-10-29", "language": "en", "rating": 3}, {"id": 721868234, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d3224257-r721868234-Templo_del_Sagrado_Corazon_de_Jesus-Barcelona_Catalonia.html", "text": "We got a friend drive us to the church. There is parking lot available close to the church. Visitors then need to walk up on the hill. The visitors can access to the passage right under the feet of Jesus status through elevator and stairs. The view down to the cities of Catalonia is amazing. The church murals on the walls are pieced with small tiles and are so beautiful with details.", "publishedDate": "2019-10-27", "language": "en", "rating": 5}, {"id": 720774683, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d3224257-r720774683-Templo_del_Sagrado_Corazon_de_Jesus-Barcelona_Catalonia.html", "text": "It is worth of visit. We went there by a blue bus. Funicular was under construction. Bus tickets were quite expensive but includes free rides in amusement park.", "publishedDate": "2019-10-23", "language": "en", "rating": 4}, {"id": 719818059, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d3224257-r719818059-Templo_del_Sagrado_Corazon_de_Jesus-Barcelona_Catalonia.html", "text": "We are told to go. So tried to make the journey up here.The old tram was getting repaired so took a bendy bus. Amazing. Then got there and it took a beer to understand that it isn't an old theme park. But a wonderful place to take in the view. Each of rides are there to showcase the view of Barcelona. Each different and wonderful. Go and get a breath of fresh air and see the glory of the city below. Don't get on the big bus back take the strange little train. Not saying anything more seek and you will find. So worth it.", "publishedDate": "2019-10-20", "language": "en", "rating": 5}, {"id": 718400445, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d3224257-r718400445-Templo_del_Sagrado_Corazon_de_Jesus-Barcelona_Catalonia.html", "text": "A friend told us about this place and it was well worth the trip. We bought the tickets to go up and view from the top of the church. What an awesome sight all of Barcelona in front and Calatonia spread out behind. In the distance you can see Montserrat...awesome. WHen you come down forom the top make sure to take a ride int he airplane ride. It doesnt look lke much and by todays standards its not, but it is such a classic ride and so well maintined it makes you feel like you are back in the 30's. Just a fun little excursion back in time.", "publishedDate": "2019-10-14", "language": "en", "rating": 5}, {"id": 717630914, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d3224257-r717630914-Templo_del_Sagrado_Corazon_de_Jesus-Barcelona_Catalonia.html", "text": "Personally, this is my favorite place in Barcelona. The trip to reach the temple is very beautiful and amusing. The place in itself is very charming, not artificially built like other places in Barcelona to create touristic and impressive sites. The inside of the church is peaceful like ever.", "publishedDate": "2019-10-12", "language": "en", "rating": 5}, {"id": 716518855, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d3224257-r716518855-Templo_del_Sagrado_Corazon_de_Jesus-Barcelona_Catalonia.html", "text": "This wonderful Cathedral is more than amazing - Gaudi was a genius, and it is so exciting to see his work still going on, and hopefully on track to be completed in 2026.  We absolutely loved it.", "publishedDate": "2019-10-08", "language": "en", "rating": 5}, {"id": 714242568, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d3224257-r714242568-Templo_del_Sagrado_Corazon_de_Jesus-Barcelona_Catalonia.html", "text": "I'll let other reviewers tell you how wonderful the view is from here, but I will share with you how to get there so you don't have to waste your time asking.\n\nWe took the T2A bus found right in front of the Desegual boutique at Plaça Catalunya. The cost of a one way bus trip is 3€. The driver will give you a receipt but this is not a return ticket. You will need to pay another 3€ for the ride back to Plaça Catalunya.\n\nFor the right bus to take you back to Plaça Catalunya, be sure to take the T2A bus as there is also a T2B bus which ends in another locaton.", "publishedDate": "2019-09-30", "language": "en", "rating": 5}, {"id": 713949651, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d3224257-r713949651-Templo_del_Sagrado_Corazon_de_Jesus-Barcelona_Catalonia.html", "text": "If one is looking for great panoramic view of Barcelona head to Tibidabo.. it’s got a great location with amazing views ... very peaceful... the church is a one of the great architectures of the city ... it’s a wonderful experience and definitely less crowded than the other attractions of Barcelona ... must must visit ..!! ", "publishedDate": "2019-09-29", "language": "en", "rating": 5}, {"id": 709380716, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d3224257-r709380716-Templo_del_Sagrado_Corazon_de_Jesus-Barcelona_Catalonia.html", "text": "Combined this with a trip to the amusement park. No more than an hour to have a look around, unless perhaps you go up the tower, which we didn't do. Both the crypt and the church are remarkable and peaceful inside, and the view over the city on a clear day is fantastic. A fascinating location for a church.", "publishedDate": "2019-09-13", "language": "en", "rating": 5}, {"id": 707831609, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d3224257-r707831609-Templo_del_Sagrado_Corazon_de_Jesus-Barcelona_Catalonia.html", "text": "A minor basilica located on the hills overlooking the municipality of Barcelona. The location is an excellent place for walking enthusiasts and can also be reached using a funicular and public transport. A word of warning though, the buses are small so can't transport a lot of people up the hill so you may have to wait some time to get in one. But once you get there, you'll be amazed to find the best views of Barcelona along with a theme park and the pleasure of visiting an architecturally rich basilica which is free to enter. Highly recommended to anyone visiting Barcelona.", "publishedDate": "2019-09-08", "language": "en", "rating": 5}, {"id": 707551749, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d3224257-r707551749-Templo_del_Sagrado_Corazon_de_Jesus-Barcelona_Catalonia.html", "text": "This crypt has some very fine mosaics which are about 100 years old.  The view is fantastic, as you would expect. ", "publishedDate": "2019-09-07", "language": "en", "rating": 5}, {"id": 707186687, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d3224257-r707186687-Templo_del_Sagrado_Corazon_de_Jesus-Barcelona_Catalonia.html", "text": "It's an hour away from Barcelona. We took train & then caught bus to reach there. An awesome place at the top, can get a glimpse of whole of Barcelona, looks to attractive from high.An outstanding  place to spend half a day in solace & peace.", "publishedDate": "2019-09-06", "language": "en", "rating": 5}, {"id": 706900922, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d3224257-r706900922-Templo_del_Sagrado_Corazon_de_Jesus-Barcelona_Catalonia.html", "text": "This is another beautiful cathedral, up next to Tibidabo, so if you go to one you can go to the other. You also have a beautiful view of Barcelona with the Mediterranean in the back ground. There is not charge to go in the take a look. Definitely not a short walk from the city, there are many ways to get there. Inside is beautiful and the decoration is amazing. IF you go up that way you should see it, but I would not say it is an absolute must to see.", "publishedDate": "2019-09-05", "language": "en", "rating": 5}, {"id": 706355045, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d3224257-r706355045-Templo_del_Sagrado_Corazon_de_Jesus-Barcelona_Catalonia.html", "text": "Up the hill there it the Kathedrale del Sagrat Cor and the leisure parc.\nIt is beautiful to see the cathedrale from all over the city and especially during night when it is lightend", "publishedDate": "2019-09-04", "language": "en", "rating": 3}, {"id": 705591078, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d3224257-r705591078-Templo_del_Sagrado_Corazon_de_Jesus-Barcelona_Catalonia.html", "text": "Great Place for family ans children, and of course great place to share with friends. In addition to the Temple there are several rides that you can do. My favorite the wheel ride. Also you can Enjoy a beautiful view of the city in its full splendor. ", "publishedDate": "2019-09-02", "language": "en", "rating": 4}, {"id": 703292794, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d3224257-r703292794-Templo_del_Sagrado_Corazon_de_Jesus-Barcelona_Catalonia.html", "text": "We took a taxi and the funicular up to Tibidabo.   The church is stunning as are most churches throughout Barcelona.  We watched the sunset then went back down the funicular and had drinks at the bar there.  Lots of families with kids at the amusement park but we just walked around and looked at the views of the city.", "publishedDate": "2019-08-26", "language": "en", "rating": 4}, {"id": 700727091, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d3224257-r700727091-Templo_del_Sagrado_Corazon_de_Jesus-Barcelona_Catalonia.html", "text": "The view from up here was the best part about it. The church itself didnt amaze me so much, maybe becuase I was distracted by the fun park on its doorstep", "publishedDate": "2019-08-19", "language": "en", "rating": 4}, {"id": 699841453, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d3224257-r699841453-Templo_del_Sagrado_Corazon_de_Jesus-Barcelona_Catalonia.html", "text": "Getting to Tibidabo can be an ordeal -- the funicular is privately run so you pay extra to use it to get up there -- but once you're there, the views are spectacular. The Templo is lovely to explore both inside and out.", "publishedDate": "2019-08-16", "language": "en", "rating": 4}, {"id": 698606013, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d3224257-r698606013-Templo_del_Sagrado_Corazon_de_Jesus-Barcelona_Catalonia.html", "text": "Well worth the effort to visit.  Public transport is pretty efficient to get here and the fee was very reasonable to access the towers.  It can be very windy so make sure you dress appropriately and pay attention to the weather.  The attached amusement park doesn't appear to be worth the visit.", "publishedDate": "2019-08-13", "language": "en", "rating": 5}, {"id": 696572358, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d3224257-r696572358-Templo_del_Sagrado_Corazon_de_Jesus-Barcelona_Catalonia.html", "text": "This was a sight we added towards the end of our trip, and very glad we did.  The views were amazing and the trip up to the mountain is definitely worth it!  The elevator was out of service to go to the top of the cathedral, but otherwise was a great visit. \nThe amusement park is right next door and there are bathrooms but otherwise no real amenities.  There is a restuarant but did not look appetizing beyond pausing for a quick drink. \nThe Tram was out of service also, so we took a direct bus from Placa Catalunya to Tibidabo - woudl definitely recommend this route.  Costs 3 Euro each way and super easy - look for signs at the square for T2A Bus.", "publishedDate": "2019-08-07", "language": "en", "rating": 4}, {"id": 695983024, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d3224257-r695983024-Templo_del_Sagrado_Corazon_de_Jesus-Barcelona_Catalonia.html", "text": "I have to admit I wasn't expecting much when we saw this church lit up on top of the hill over looking Barcelona at night and my kids asked to visit it. After a metro ride, a few bus transfers we arrived. We paid extra to goto the top of the church and it was worth it. We must have stayed over an hour looking around and they even had to kick us out because we closed it down. We would have liked to stay to see it lit up at night but the sun didn't;t set for another hour or so and the amusement park wasn't open. If you have extra time do yourself a favor and visit this church.", "publishedDate": "2019-08-06", "language": "en", "rating": 5}, {"id": 693628427, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d3224257-r693628427-Templo_del_Sagrado_Corazon_de_Jesus-Barcelona_Catalonia.html", "text": "This place is amazing and has spectacular views.  You can easily take the T2A bus from Plaça De Catalunya running regularly.  Entry to the main part of the Basilica and only 4 Euro to take the stairs to the top.  Right next to the fun park.  Great day to escape the hustle and bustle of the city and very few tourists. Highly recommend!", "publishedDate": "2019-07-28", "language": "en", "rating": 5}, {"id": 692157933, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d3224257-r692157933-Templo_del_Sagrado_Corazon_de_Jesus-Barcelona_Catalonia.html", "text": "We really enjoyed this place. Beautiful buildings and spacious park. Well worth the visit. The amusement park is also good!", "publishedDate": "2019-07-23", "language": "en", "rating": 5}, {"id": 691790981, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d3224257-r691790981-Templo_del_Sagrado_Corazon_de_Jesus-Barcelona_Catalonia.html", "text": "Remember when the public transport say S1 it is the train, not a bus.  But the cable car was not working, substitute buses were is use.  That aside the church was a magnificent building, very photogenic.  The day was quiet hazy, so the views were limited.   Worth the effort to get too.", "publishedDate": "2019-07-22", "language": "en", "rating": 4}, {"id": 686936211, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d3224257-r686936211-Templo_del_Sagrado_Corazon_de_Jesus-Barcelona_Catalonia.html", "text": "Wonderful church from outside and inside. Just for few euro you can go up to the roof to have a wonderful view over Barcelona and surroundings. You can go by bus but there also a wonderful path trough the bush, you would not expect to be in Barcelona city.\nThis path could easily be found on & via the app Maps.me, By following the path you will pass Font del Bacallà where you can drink some fresh cold water straight from the spring.\nAt the time you arrive in the city again you can easily jump on the metro again.", "publishedDate": "2019-07-05", "language": "en", "rating": 5}, {"id": 686149195, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d3224257-r686149195-Templo_del_Sagrado_Corazon_de_Jesus-Barcelona_Catalonia.html", "text": "Nice, and worth it.  We just went ahead and took a taxi.  Haven't been to Rio but it seems like a smaller version of Christ the Redeemer.  ", "publishedDate": "2019-07-02", "language": "en", "rating": 5}, {"id": 685657329, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d3224257-r685657329-Templo_del_Sagrado_Corazon_de_Jesus-Barcelona_Catalonia.html", "text": "A Place that i Strongly Recommend to visit several times , you will have perfect view for Catalonia including all touristic places", "publishedDate": "2019-07-01", "language": "en", "rating": 5}, {"id": 685194221, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d3224257-r685194221-Templo_del_Sagrado_Corazon_de_Jesus-Barcelona_Catalonia.html", "text": "The authentic way to get here is via the Vallvidrera funicular and the bus. Amazing views on the trip up. Once you get to the top the church itself is amazing and you can actually go right to the foot of the statue at the top. Amazing views from here. There is also an amusement park.", "publishedDate": "2019-06-29", "language": "en", "rating": 4}, {"id": 684541650, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d3224257-r684541650-Templo_del_Sagrado_Corazon_de_Jesus-Barcelona_Catalonia.html", "text": "This place must visit everyone who comes to Barcelona! The view from this place is gorgeous! There are some carousels here too.", "publishedDate": "2019-06-26", "language": "en", "rating": 5}, {"id": 682912716, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d3224257-r682912716-Templo_del_Sagrado_Corazon_de_Jesus-Barcelona_Catalonia.html", "text": "Accessing the heights of Tibidabo by the funicular railway, you are treated to breath-taking views of the whole of Barcelona in one direction and the rolling hills in the other. There are good facilities for refreshment and children's amusement, as well as the historic church to visit.", "publishedDate": "2019-06-20", "language": "en", "rating": 4}, {"id": 682590876, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d3224257-r682590876-Templo_del_Sagrado_Corazon_de_Jesus-Barcelona_Catalonia.html", "text": "Honestly this was the best thing we did on our trip. Got off the sightseeing bus, walked uphill for about 15 mins through a park, which was a lovely little find, to get to the funicular. Costs €7 I think to get up to the top. When you get off there is the weirdest theme park there with about five rides. It's so tacky this thing needs to go. Totally ruins the whole atmosphere. The temple is SO beautiful. You can buy a ticket to go in the elevator that takes you all the way to the top. It's €3.5 and the best money I spent on this holiday. You literally could not get a better view of Barcelona and the surrounding areas. YOU NEED TO GO HERE!", "publishedDate": "2019-06-19", "language": "en", "rating": 5}, {"id": 682504133, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d3224257-r682504133-Templo_del_Sagrado_Corazon_de_Jesus-Barcelona_Catalonia.html", "text": "Views from Tibidabo mountains are great from any angle but are totally unobstructed from the top of the church accessible by lift for just Euros 3. The church itself is very interesting, lower part is the crypt with nice mosaic works and decorations whilst the church itself on top of it is more of Gothic oriented style with nice stained glass. It was also nice to relax at the Tibidabo coffee shop with the nice church and surrounding atmosphere!", "publishedDate": "2019-06-18", "language": "en", "rating": 5}, {"id": 681831837, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d3224257-r681831837-Templo_del_Sagrado_Corazon_de_Jesus-Barcelona_Catalonia.html", "text": "Trip to Tibidabo was not so long. All the way by bus I made video because view from the window was amazing! Temple is very tall, but I was disappointed of so close situation of amusement part - it ruins view on the city.\nWe took elevator to the top for 3,50 euro. View from there is breathtaking! ", "publishedDate": "2019-06-16", "language": "en", "rating": 5}, {"id": 679130460, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d3224257-r679130460-Templo_del_Sagrado_Corazon_de_Jesus-Barcelona_Catalonia.html", "text": "This amazing place is full of peace and integrity. it a little difficult to arrive here, due to the weak transportation after the metro, but definitely worth it. ", "publishedDate": "2019-06-05", "language": "en", "rating": 5}, {"id": 678249853, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d3224257-r678249853-Templo_del_Sagrado_Corazon_de_Jesus-Barcelona_Catalonia.html", "text": "I read some blogs before heading to Barcelona and this place was mentioned - it did not disappoint. Takes about an hour to get to but it’s worth it. The views are out of this world. The church is stunning inside and out. You can climb to the top of the church (for a small fee) to see spectacular views of tibidabo and Barcelona. There is also a mini theme park to enjoy also. Highly recommend! ", "publishedDate": "2019-06-02", "language": "en", "rating": 5}, {"id": 677559110, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d3224257-r677559110-Templo_del_Sagrado_Corazon_de_Jesus-Barcelona_Catalonia.html", "text": "great views from here over Barcelona, it's not just the monument although that's interesting too it's the overall atmosphere when you get up here", "publishedDate": "2019-05-30", "language": "en", "rating": 4}, {"id": 676391130, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d3224257-r676391130-Templo_del_Sagrado_Corazon_de_Jesus-Barcelona_Catalonia.html", "text": "nice view of the whole city,  fun things to do, a place full of history and a  very relaxing atmosphere", "publishedDate": "2019-05-25", "language": "en", "rating": 5}, {"id": 674892609, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d3224257-r674892609-Templo_del_Sagrado_Corazon_de_Jesus-Barcelona_Catalonia.html", "text": "Perched atop of a mountain, you can see a panoramic view of this beautiful city. While you're exploring, leave the kids at the amusement part that shares the area. Take the bus up to the top. It costs 3 euros in each direction. Enjoy the view.", "publishedDate": "2019-05-18", "language": "en", "rating": 4}, {"id": 673471230, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d3224257-r673471230-Templo_del_Sagrado_Corazon_de_Jesus-Barcelona_Catalonia.html", "text": "We visited Tibidabo & got a taxi up there as we were short for time. Our taxi driver dropped us off outside the church. The outside of the church is very nice. Inside there is a peaceful presence. ", "publishedDate": "2019-05-12", "language": "en", "rating": 4}, {"id": 673179288, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d3224257-r673179288-Templo_del_Sagrado_Corazon_de_Jesus-Barcelona_Catalonia.html", "text": "Will go back in the sun and do the upper half, what a pretty surprise to find at a theme park (assuming that was built later). Well worth a visit.", "publishedDate": "2019-05-11", "language": "en", "rating": 4}, {"id": 669490703, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d3224257-r669490703-Templo_del_Sagrado_Corazon_de_Jesus-Barcelona_Catalonia.html", "text": "Best place very close to Barcelona with an amazing view, the best we got in the city. And of course, the small church is also very beautiful. I recommend you to come here!", "publishedDate": "2019-04-26", "language": "en", "rating": 5}, {"id": 666959087, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d3224257-r666959087-Templo_del_Sagrado_Corazon_de_Jesus-Barcelona_Catalonia.html", "text": "What an amazing view on Barcelona and the outer parts of the city. If you hike up the Tibidabo hill (not easy), you will feel rewarded by the wonderful view and get some exercise in.\nTake the metro to Tibidabo if you are in city center. Also, the furnicular was out of service, so a bus goes up the hill if hiking is not something you want.", "publishedDate": "2019-04-16", "language": "en", "rating": 4}, {"id": 666476023, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d3224257-r666476023-Templo_del_Sagrado_Corazon_de_Jesus-Barcelona_Catalonia.html", "text": "This temple is amazing and the view is stunning! You can reach the hill first with metro line L7, then with blue tram or with bus 196 and then with funiculair or with bus (the funiculair didn’t work when we were there). In the temple there is a lift with tickets and it takes you to the terrace of the temple, where the view is breathtaking. And there are stairs up to reach the top of the temple. The atraction park Tibidabo is not impressive itself and my oppinion is that it’s place is not on the foot of the temple. But the hill Tibidabo is one of “must see” in Barcelona, because of the view!", "publishedDate": "2019-04-14", "language": "en", "rating": 5}, {"id": 666032842, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d3224257-r666032842-Templo_del_Sagrado_Corazon_de_Jesus-Barcelona_Catalonia.html", "text": "Apart from the historical architecture, it has a great panoramic view over the city and the shores. getting there with cable wagon and mini-bus is an adventure in itself.", "publishedDate": "2019-04-13", "language": "en", "rating": 5}, {"id": 664170304, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d3224257-r664170304-Templo_del_Sagrado_Corazon_de_Jesus-Barcelona_Catalonia.html", "text": "Is gonna take you like an hour going there but it's totally worth it. You will see one of the best spot in bcn. Also you have to go on the top of the church, and get there for the sunset. ", "publishedDate": "2019-04-06", "language": "en", "rating": 5}, {"id": 663667955, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d3224257-r663667955-Templo_del_Sagrado_Corazon_de_Jesus-Barcelona_Catalonia.html", "text": "The view was unforgettable, you can see the whole town from there. Make sure you go when the weather is nice. The church was also really nice. It is worth the trip. We did not have time to go there when is dark, but I assume that it will be even better.", "publishedDate": "2019-04-04", "language": "en", "rating": 5}, {"id": 661162450, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d3224257-r661162450-Templo_del_Sagrado_Corazon_de_Jesus-Barcelona_Catalonia.html", "text": "The church is more impressive from the outside than the inside, but make sure you go in both the lower and upper areas as they are quite different. We didn’t get tickets to go to the top as it wasn’t clear where to buy them. \n\nThe view from the church is stunning, it’s a shame the theme park obscures it. The Tibidabo funicular was out of order (like so many other things on this visit) so we had to take the 111 bus to the peu del funicular station which joins the metro network. It’s all included in the public transport passes. ", "publishedDate": "2019-03-25", "language": "en", "rating": 4}, {"id": 660917670, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d3224257-r660917670-Templo_del_Sagrado_Corazon_de_Jesus-Barcelona_Catalonia.html", "text": "The church is high on the hill overlooking Barcelona. The trip is worth it if only for the views (which are only slightly spoilt by the amusement park).  The Churches theselves are a bonus - free to see, and quite beautiful.\n\nWe took the L7 metro from Catalunya up to AV Tibidabo, then walked to the funicular station to find this was shut, so we walked up the hill using a series of long looping paths which took us some time.\n\nIn hindsight, the better way is to take any of the S1-S6 metro lines that run to Peu del Funicular, take the funicular up to Vallvidera Superior and take the 111 minibus up to the church (this is all one journey in terms of the ticket). if the 111 bus is full, the walk from the metro up to the church is about a mile.", "publishedDate": "2019-03-24", "language": "en", "rating": 5}, {"id": 660906179, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d3224257-r660906179-Templo_del_Sagrado_Corazon_de_Jesus-Barcelona_Catalonia.html", "text": "This place is breathtaking, one church was built on top of the other and statue of Jesus is on top of the structure. From the top, you will have great views of Barcelona. The drive from the city is also spectacular, there is a parking garage in a short walking distance from the church, please remember to take your ticket with you and pay at the ticket office, there is no way to pay at the exit.", "publishedDate": "2019-03-24", "language": "en", "rating": 5}, {"id": 660325560, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d3224257-r660325560-Templo_del_Sagrado_Corazon_de_Jesus-Barcelona_Catalonia.html", "text": "Nice run from the beach to the Church and back again approx 25km.  Tibodo is high enough without being too high yet you get a great view of the city.\nThe theme park and the Church were both closed but was even worth it for the view alone!", "publishedDate": "2019-03-22", "language": "en", "rating": 5}, {"id": 659299155, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d3224257-r659299155-Templo_del_Sagrado_Corazon_de_Jesus-Barcelona_Catalonia.html", "text": "Visiting this church is so worth it.  Going up to the top you can see the whole city and out into the ocean.   ", "publishedDate": "2019-03-18", "language": "en", "rating": 5}, {"id": 657590822, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d3224257-r657590822-Templo_del_Sagrado_Corazon_de_Jesus-Barcelona_Catalonia.html", "text": "First time abroad, a surprise present from my dear other half, never been abroad, ever, she organised this with our Son.\n\nAll i can say is Barcelona is an incredible place, only scratched the surface in 3 days,,, we visited The Sagrada Familia as everyone does, it is amazing you really do have to see it.\n\nWe also walked down the infamous La  Rambla, and Gothic Quater,, Beautiful.\n\nBut the highlight of our visit wasTemplo del Sagrado Corazon de Jesus,, when i knew i was going to Barcelona i knew i really had to see this. We had to try and speak Spanish, catch the metro, buses and get to the top of a very big hill ,,,,,\n\nSome people might say,, 'Was it worth it ',,,,,,,,\nI would just like to say,,, this place is totally amazing,, we went slightly out of season,, really glad about that,,,.\n\nThis building is amazing in every way possible, outside and inside,,.\n\nIf you want video or images of this Beautiful place check it out on youtube....\n\nI've seen quite a lot of things in my life,, but this is Incredible,,,,.", "publishedDate": "2019-03-10", "language": "en", "rating": 5}, {"id": 656486142, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d3224257-r656486142-Templo_del_Sagrado_Corazon_de_Jesus-Barcelona_Catalonia.html", "text": "excellent sightseeing attraction. for 3.5 euro one can take the elevator to the top of the chruch and have some more views of barcelona.", "publishedDate": "2019-03-04", "language": "en", "rating": 5}, {"id": 654421795, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d3224257-r654421795-Templo_del_Sagrado_Corazon_de_Jesus-Barcelona_Catalonia.html", "text": "I had never heard of or seen anything about Templo del Sagrado Corazon de Jesus prior to my trip. You will see it referred to as Tibidabo (the mountain it is on) on most of the city maps and what many people call it. Nearly anywhere you are in Barcelona you can see this off in the distance. Seeing this every day while I was there made me want to visit it. I am so glad that I did as it offers truly breathtaking views of the city. You have great views from the bottom, but  you can also take an elevator to the top (3.50 Euros) and I recommend doing this. If you are afraid of heights, DO NOT go to the top, just enjoy the views from solid ground.", "publishedDate": "2019-02-23", "language": "en", "rating": 5}, {"id": 653779467, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d3224257-r653779467-Templo_del_Sagrado_Corazon_de_Jesus-Barcelona_Catalonia.html", "text": "the most highest place in the city, wonderful view from the top of the monument, great sunset, great mountain view", "publishedDate": "2019-02-20", "language": "en", "rating": 5}, {"id": 653561043, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d3224257-r653561043-Templo_del_Sagrado_Corazon_de_Jesus-Barcelona_Catalonia.html", "text": "It’s wonderful. It’s a great view and other than the lift fee(€3.50) to get up to the top section of the building - it’s free. \nAnd what a view!!!\nIt is stunning. Get the train from Catalunya metro (or wherever is closest) to peu del funicular. Then change to the funicular and go up the hill. Then get the 111 v mini bus to the church. ", "publishedDate": "2019-02-19", "language": "en", "rating": 5}, {"id": 650242816, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d3224257-r650242816-Templo_del_Sagrado_Corazon_de_Jesus-Barcelona_Catalonia.html", "text": "After a beautiful walk away from the city center,and all the way up the hill,(whichleads through a beautiful forest) I got rewarded with an outstanding view. There is a beautiful cathedral up there which is worth to enter. In the lower season,it is a peaceful place to rest and just to enjoy.As there is a fun park at the bottom of the cathedral, which will be open then,I guess,that during the high  season  it will be more frequented and also noisier. I think it is much fun to sit in a carousel with this special view.Where do you find this,again?...", "publishedDate": "2019-02-04", "language": "en", "rating": 4}, {"id": 646910928, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d3224257-r646910928-Templo_del_Sagrado_Corazon_de_Jesus-Barcelona_Catalonia.html", "text": "I was lucky enough to be staying next to this church, so could visit at different times of the day. It's free to go inside, but a small large is made to ascend to the viewing terraces, which afford panoramic views of the city and countryside.", "publishedDate": "2019-01-18", "language": "en", "rating": 5}, {"id": 643045486, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d3224257-r643045486-Templo_del_Sagrado_Corazon_de_Jesus-Barcelona_Catalonia.html", "text": "This was a bit of a mess. The cable car that normally takes you to the top - was out of service.  They had a bus but it had very limited capacity and only ran every 30 minutes. There was a huge line to get tickets and no one really knew what was going on.  A British couple we meet said \"I have not idea what we just got tickets for\".\nIt didn't work out for us - hopefully you will have better luck.", "publishedDate": "2019-01-02", "language": "en", "rating": 2}, {"id": 642071179, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d3224257-r642071179-Templo_del_Sagrado_Corazon_de_Jesus-Barcelona_Catalonia.html", "text": "This cathedral is one of the best sights in all of Barcelona and it's not as hard to get to as some people make out. High up in the mountains behind the city it is an awesome sight with it's fabulous stone building, picturesque mural on it's facia, and it's Jesus Christ statue rising high on it's roof. Just beneath this are some smaller figurines and the stone structure a different colour to the base. Inside is simply stunning with high pillars, a beautiful alter and two alcoves each side filled with paintings, murals and lovely crafted designs all around the church walls. Simply magnificent and not to be missed! The views are also spectacular of the city.", "publishedDate": "2018-12-28", "language": "en", "rating": 5}, {"id": 639988164, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d3224257-r639988164-Templo_del_Sagrado_Corazon_de_Jesus-Barcelona_Catalonia.html", "text": "I went to Tibidabo for the sweeping views but really enjoyed seeing the interior of this church as well. I took the Hop-on, Hop-off bus to the Tibidabo stop, then took the city bus to the funicular. It was all enjoyable and not very expensive. Once at the top, I climbed the steps to the main level of the church and followed the signs to the elevator to the upper terrace and the tower. The stairs to the tower were easy to climb and it is possible to get within a few feet of the \"feet of Jesus\" at the base of the statue. Although it was a bit hazy when I was there, the view was still magnificent, all the way to the Mediterranean. \n\nThe church has 2 sanctuaries, one above the other and both are nicely done. There are a number of vantagepoints around the building in all directions. It was a bit odd to be in a reverent church and see the amusement park rides just in front of you, but that just added to the charm of the adventure.", "publishedDate": "2018-12-16", "language": "en", "rating": 4}, {"id": 639544175, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d3224257-r639544175-Templo_del_Sagrado_Corazon_de_Jesus-Barcelona_Catalonia.html", "text": "Love the funicular ride up here and the bizarre fifties style fairground on top. climb the stairs to the top of the church, its amazing", "publishedDate": "2018-12-14", "language": "en", "rating": 5}, {"id": 636998811, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d3224257-r636998811-Templo_del_Sagrado_Corazon_de_Jesus-Barcelona_Catalonia.html", "text": "If you take hop-on/hop-off bus, get off at Tibidado, then take bus 196 to the funicular station, then take the funicular up to the church.  Each ride will require a separate ticket. However, the funicular broke down on the day we visited, so they arranged another bus to take us up there.  When we were coming back, we found that you could just take bus T2A directly from/to Plaça Catalunya.  We also saw bus T2B up there.  Anyways, once you made it up there, the view is spectacular.  You will need to pay another fee to take the elevator to the upper part of the church, then go up more stairs to the top.  Unfortunately it was very windy, otherwise we would've stayed on top for much longer.", "publishedDate": "2018-12-02", "language": "en", "rating": 5}, {"id": 636264142, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d3224257-r636264142-Templo_del_Sagrado_Corazon_de_Jesus-Barcelona_Catalonia.html", "text": "This is a Church located on top of a village where you can see all barcelona from up. it is very spiritual, the church is one of the most beautifull churches i have ever been. It is a must visit place", "publishedDate": "2018-11-28", "language": "en", "rating": 5}, {"id": 628189394, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d3224257-r628189394-Templo_del_Sagrado_Corazon_de_Jesus-Barcelona_Catalonia.html", "text": "This magnificent church, set at the top of the mountain, can be seen from many miles away, so it follows that when you get alongside, you can see right across the city and out to sea.\n\nWe reached the summit of Tibidabo via the funicular, which is fun, albeit somewhat run down and disappointingly graffiti laden. (See \"Funicular Tibidabo\" for further details regarding the funicular service.) \n\nWhen you alight at the top, the views are sensational, and so is the church itself, which is apparently modelled on the Sacré-Cœur Basilica in Paris, and it is easy to see the similarity, given the mountain top location as well as the architecture of the church.", "publishedDate": "2018-10-25", "language": "en", "rating": 5}, {"id": 627430491, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d3224257-r627430491-Templo_del_Sagrado_Corazon_de_Jesus-Barcelona_Catalonia.html", "text": "Everybody must see this church, if goes to Barcelona. It's for free, only to the tower you have to pay 3€. And the view is amazing.\nNext to the church is amusement park, it's great for children. The entrance is for free, you'll buy only ticket to the attraction, you can choose from three types tickets., it depens on which attraction you want to go.", "publishedDate": "2018-10-23", "language": "en", "rating": 5}, {"id": 626909699, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d3224257-r626909699-Templo_del_Sagrado_Corazon_de_Jesus-Barcelona_Catalonia.html", "text": "We saw the church from a distance at Park Guell. It wasn't in our itinerary and decided to make a trip after reading in Trip Advisor. A well hidden gem indeed ! A church and an amusement park. The bronze statue of Jesus Christ overlooking Catalonia is impressive. The amusement park gives the place a whimsical feel. It was not crowded with tourists which was a bonus. The view from above was splendid. Take the elevator up with a small fee.", "publishedDate": "2018-10-21", "language": "en", "rating": 4}, {"id": 622802877, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d3224257-r622802877-Templo_del_Sagrado_Corazon_de_Jesus-Barcelona_Catalonia.html", "text": "The views back over the city are awesome, I’m not a lover of heights but my wife went all the way up the spires.", "publishedDate": "2018-10-06", "language": "en", "rating": 4}, {"id": 621228475, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d3224257-r621228475-Templo_del_Sagrado_Corazon_de_Jesus-Barcelona_Catalonia.html", "text": "Amazing church and the feeling you get once got there..\nI took the metro then on foot so I can see the CosmoCaixa Museum and the I took the funicular.\nThe view is stunning,nothing can compare to that place.Make sure you take a jacket because quite cold up there.Enjoy!", "publishedDate": "2018-10-02", "language": "en", "rating": 5}, {"id": 620313380, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d3224257-r620313380-Templo_del_Sagrado_Corazon_de_Jesus-Barcelona_Catalonia.html", "text": "We took the bus tour which dripped you off to wear the tram takes you up to the funiculair but wasn't working so got the bus 129 up the hill. When there we got the funiculair up the hill. Wasn't expensive around 7 euros. At the top there is an amusment park with traditional rides such as carousel. We climbed the steps and went in the church which was beautiful and serene. We climbed the many steps to.thr first floor and then took a lift 3.50 euros to.the second floor and them we climbed spiral stairs of.which there were many to the foot of Jesus\n. My knees were weak from.climbing but wow the views of the city on one side and the mountains on the other were brethtaking. If your scared of heights then this may not be for you or have trouble climbing as there are many steps. \nThere is a little shop selling souvenirs and a restaurant which we.didnt use.", "publishedDate": "2018-09-28", "language": "en", "rating": 5}, {"id": 618333073, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d3224257-r618333073-Templo_del_Sagrado_Corazon_de_Jesus-Barcelona_Catalonia.html", "text": "Outstanding, amazing, one of the kind view! A place that you should visit when you are in Barcelona. The church with the statue of Crist also a fab! Must place!", "publishedDate": "2018-09-20", "language": "en", "rating": 5}, {"id": 617324910, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d3224257-r617324910-Templo_del_Sagrado_Corazon_de_Jesus-Barcelona_Catalonia.html", "text": "Be careful if you’re afraid of heights but otherwise definitely take the elevator and stairs to the top for unbelievable views. The mosaic murals inside are exquisite as well.", "publishedDate": "2018-09-17", "language": "en", "rating": 5}, {"id": 616187657, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d3224257-r616187657-Templo_del_Sagrado_Corazon_de_Jesus-Barcelona_Catalonia.html", "text": "從進入教堂的濱海步道的日落非常美麗與巴塞羅那市的背景。這是一個拍照留念的好地方。進入教堂塔樓需要3.5歐元。\n\nThe sunset from the esplanade of access to the church is very beautiful with the city of Barcelona in the background. It is a good place to take photos to remember. Access to the church tower for 3.5 euros more.", "publishedDate": "2018-09-13", "language": "en", "rating": 4}, {"id": 614698502, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d3224257-r614698502-Templo_del_Sagrado_Corazon_de_Jesus-Barcelona_Catalonia.html", "text": "Templo del sagrado corazon de Jesus is highly reccomended place to visit in Barcelona. It's a very beautiful and unique temple and has best panoramic view to Barcelona city. \nUnforgettable place and emotions from the terrace of temple...", "publishedDate": "2018-09-07", "language": "en", "rating": 5}, {"id": 611313823, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d3224257-r611313823-Templo_del_Sagrado_Corazon_de_Jesus-Barcelona_Catalonia.html", "text": "Take the Funicular up to Tibidabo and visit the Temple Expiatoria del Sagrat Cor. Then make your way up the elevator and climb to the top for the most amazing views over Barcelona!", "publishedDate": "2018-08-27", "language": "en", "rating": 5}, {"id": 608723712, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d3224257-r608723712-Templo_del_Sagrado_Corazon_de_Jesus-Barcelona_Catalonia.html", "text": "The church at the top of Tibidabo is quite beautiful, with some impressive mosaic work. The views of the city of Barcelona are amazing up there. But with such impressive religious monuments in the center of Barcelona, the visit to Tibidabo (which implies a big bus ride) should not be your top priority on your holidays. Totally worth the visit but you're not losing too much if you don't go there.", "publishedDate": "2018-08-21", "language": "en", "rating": 3}, {"id": 608567098, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d3224257-r608567098-Templo_del_Sagrado_Corazon_de_Jesus-Barcelona_Catalonia.html", "text": "This was one of the highlights of our trip, definitely worth the trip up there even to experience the small little 8ish seater bus! Such an unusual place but fantastic panoramic views of the whole city. ", "publishedDate": "2018-08-20", "language": "en", "rating": 4}, {"id": 605800064, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d3224257-r605800064-Templo_del_Sagrado_Corazon_de_Jesus-Barcelona_Catalonia.html", "text": "This places takes a while to get to if you use public transportation but it’s worth it!  The temple itself is nice, nothing really distinguishing from other churches in Barcelona. The view from this place is incredible. You can see all of Barcelona and much of the coast. If you have a few hours to spare then I would definitely recommend making the journey. ", "publishedDate": "2018-08-12", "language": "en", "rating": 4}, {"id": 605744526, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d3224257-r605744526-Templo_del_Sagrado_Corazon_de_Jesus-Barcelona_Catalonia.html", "text": "This church, visible from all over Barcelona, especially at night, promised much. But when we visited, we were only astounded by the high, sharp peaks of the towers. The church is new, about a century old and is built in Neo Gothic style. Inside, it is very small and we did not stay long, as there was a mass at the time of our visit.The views from the terrace of the church are amazing, and there is a viewing platform on top, just beneath the peaks of the towers.", "publishedDate": "2018-08-12", "language": "en", "rating": 3}, {"id": 603508737, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d3224257-r603508737-Templo_del_Sagrado_Corazon_de_Jesus-Barcelona_Catalonia.html", "text": "an interesting church building and an amazing view for Barcelona from top of the hill side .. with a very intertaining train ( Ferris wheel) to take you to the highest mountain in Barcelona", "publishedDate": "2018-08-06", "language": "en", "rating": 5}, {"id": 602631731, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d3224257-r602631731-Templo_del_Sagrado_Corazon_de_Jesus-Barcelona_Catalonia.html", "text": "We visited Tibidabo mid-morning in mid-July.  We toured the area around the cathedral first and then went in for a visit.  The cathedral is very tall and visible from most areas of Barcelona if you look up at the Tibidabo mountain.  There are quite a few stairs to get to the main cathedral area.\n \nThis cathedral is not as ornate as others we’ve seen but is very unique being located at the top of the mountain and will additional access to the top of the spire.  From about 1/3 of the way to the top where the main cathedral area there is an elevator that you can take for 3.50 Euros.  This will take you up to about the 2/3 point or 538 meters above sea level.  From this point, it’s all stairs up to the top which is at about 565 meters above sea level.  The views are incredible, and the climb is worth it.  We highly recommend Cathedral del Sagrat Cor (Sagrado Corazon de Jesus).", "publishedDate": "2018-08-04", "language": "en", "rating": 5}]}}]