[{"locationId": 7363048, "name": "L'illa Diagonal", "placeType": "ATTRACTION", "reviewListPage": {"reviews": [{"id": 746153134, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d7363048-r746153134-L_illa_Diagonal-Barcelona_Catalonia.html", "text": "Great choice of shops largest in Barcelona designer brands supermarket all you need in one place including high street brands", "publishedDate": "2020-02-19", "language": "en", "rating": 4}, {"id": 731128604, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d7363048-r731128604-L_illa_Diagonal-Barcelona_Catalonia.html", "text": "This Mall is big, with all kind of shops, but the thing I didn't like is that they don't have a place, bench to rest for 5 minutes after hours of shopping. They have Primark with affordable price, but is not easy to find (I was lucky with google maps 😂)", "publishedDate": "2019-12-06", "language": "en", "rating": 4}, {"id": 724323511, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d7363048-r724323511-L_illa_Diagonal-Barcelona_Catalonia.html", "text": "mall with all kind of shops the level is high and the shops are all good brand the supermarket is very complete with all euopean products.", "publishedDate": "2019-11-05", "language": "en", "rating": 4}, {"id": 719125456, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d7363048-r719125456-L_illa_Diagonal-Barcelona_Catalonia.html", "text": "Probably the largest shopping mall in Barcelona that houses a variety of shops including some signature designer wear, children's items, Lego, and footwear. They also have quite a decent food court with multiple restaurants. The entire mall is clean, well maintained and built to be a one-stop venue for all the shopping needs of everyone.", "publishedDate": "2019-10-17", "language": "en", "rating": 5}, {"id": 710331969, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d7363048-r710331969-L_illa_Diagonal-Barcelona_Catalonia.html", "text": "I had a few hours to shop in Barcelona and had the good fortune to be staying at the hotel that was next door to this shopping centre that houses some of my favourite brands (Camper, Vialis, Massimo Dutti, Lush, Body Shop and Decathlon) plus some interesting ones that I had never heard of. There is also a large supermarket within the complex and a food court.\n\nThe layout of the mall was quite confusing, but I loved the open spaces. It was busy (I was there on a Saturday afternoon), but I felt safe because of the visible presence of security. The mall stays open until 10 p.m., but it is closed on Sundays.", "publishedDate": "2019-09-16", "language": "en", "rating": 4}, {"id": 699145866, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d7363048-r699145866-L_illa_Diagonal-Barcelona_Catalonia.html", "text": "Didn't like this shopping centre - very limited brands selection, poor food court and planning also could be better", "publishedDate": "2019-08-15", "language": "en", "rating": 3}, {"id": 676123799, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d7363048-r676123799-L_illa_Diagonal-Barcelona_Catalonia.html", "text": "All the stores here are tremendous in size. There is a wide variety of stores as well as a few smaller shops. Nothing is lacking in this huge complex. Many eating places to choose from. Access is easy by metro.", "publishedDate": "2019-05-24", "language": "en", "rating": 5}, {"id": 675392204, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d7363048-r675392204-L_illa_Diagonal-Barcelona_Catalonia.html", "text": "I think it is a good mall however its layout is not the best. I was lost a bit. Overall it is good for a visit especially on a rainy day. ", "publishedDate": "2019-05-20", "language": "en", "rating": 4}, {"id": 672761294, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d7363048-r672761294-L_illa_Diagonal-Barcelona_Catalonia.html", "text": "L'illa Diagonal is a huge shopping complex. There are dozens and dozens of shops, almost two hundred in total. It is probably just like any other shopping mall, in any city around the world. Here you will find all the shops you will expect to find in a Mall of its type. Big shops as well as the little ones. And you can buy virtually anything you wish. This is obviously very good for the locals and probably convenient for visitors. There isn't really any distinctive difference between this shopping centre and any other we know or have come across in other parts of the world.", "publishedDate": "2019-05-09", "language": "en", "rating": 4}, {"id": 671393777, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d7363048-r671393777-L_illa_Diagonal-Barcelona_Catalonia.html", "text": "It’s ok with nothing really special. Best shop is Decathlon one of the two biggest in BCN too hot .....poor service but a great range of very keenly priced sporting goods and hiking gear. Diagonal is a good area if you cross the road and there a number of interesting shops ", "publishedDate": "2019-05-04", "language": "en", "rating": 3}, {"id": 668822282, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d7363048-r668822282-L_illa_Diagonal-Barcelona_Catalonia.html", "text": "L'illa diagonal is a very very spacious mall, labyrinthical I should say...You can find anything you need/you want but the indications of location for some shops is parcimonious all over the mall. Maybe it's a strategy to make you search and somehow to make you buy something else during your quest !!! Another strategy seems to be organized: If you want to rest , forget it! Otherwise you will suffer  in searching for sits in other places than restaurants and you will fight for the 6 or 7 hided sits disposed at the last floor...", "publishedDate": "2019-04-24", "language": "en", "rating": 4}, {"id": 665079825, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d7363048-r665079825-L_illa_Diagonal-Barcelona_Catalonia.html", "text": "An extended shopping centre with attachments to hotels around\n\nExcellent ground and upper floor layout with very good brands but the lower level where restaurants are , is disappointing; the smell of different contradicting cousins have produced an unlikely scent I am afraid and in a close environment less attractive to dine. \n\nReorganisation of the lower food court and make it more airy is a must", "publishedDate": "2019-04-09", "language": "en", "rating": 4}, {"id": 660143258, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d7363048-r660143258-L_illa_Diagonal-Barcelona_Catalonia.html", "text": "My wife bought some clothing here and the shopping centre is spacious a nd plenty of different shops and restaurants.\nWe didn't like Sfera there.\nNice walk around for us!", "publishedDate": "2019-03-21", "language": "en", "rating": 4}, {"id": 649426509, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d7363048-r649426509-L_illa_Diagonal-Barcelona_Catalonia.html", "text": "A pleasant mall-easy to reach by metro from Placa de Catalunya to Maria Cristina. This was our second visit and again the mall proved to be a good shopping place. The only shop that was a little disappointing was Primark. Comparing it to the \"mother\" shop in Madrid made it pale into insignificance. I would not bother to visit it just for Primark. but there are plenty of places to enjoy a good coffee whilst taking a break from looking at the shops.", "publishedDate": "2019-01-31", "language": "en", "rating": 4}, {"id": 638223543, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d7363048-r638223543-L_illa_Diagonal-Barcelona_Catalonia.html", "text": "We found what we needed but it was not too easy to find a certain stores because of lack of information boards and the confusing structure of the mall. ", "publishedDate": "2018-12-08", "language": "en", "rating": 3}, {"id": 637881673, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d7363048-r637881673-L_illa_Diagonal-Barcelona_Catalonia.html", "text": "One of the biggest malls in Barcelona, but with few nice shops. Good thing about it is a big branch for Sfera there.", "publishedDate": "2018-12-06", "language": "en", "rating": 3}, {"id": 635212267, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d7363048-r635212267-L_illa_Diagonal-Barcelona_Catalonia.html", "text": "Me and my wife were looking for clothes to buy and it has an amazing variety. During that time we were looking for some place to rest but the only places were the coffee shops or restaurants  and we didn't want to eat/drink. Keep that in mind  if you're going shopping there.", "publishedDate": "2018-11-23", "language": "en", "rating": 3}, {"id": 630606691, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d7363048-r630606691-L_illa_Diagonal-Barcelona_Catalonia.html", "text": "Nice mall - have many of the brands - Zara, Primark, Large supermarket, Sports Shop - plenty of niche shops as well.Good food court. Its enough to spend a couple of hours there", "publishedDate": "2018-11-03", "language": "en", "rating": 5}, {"id": 623794093, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d7363048-r623794093-L_illa_Diagonal-Barcelona_Catalonia.html", "text": "The mall had nice stores but there were no map and we got lost all the time. It was not a good experience!", "publishedDate": "2018-10-10", "language": "en", "rating": 2}, {"id": 612942808, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d7363048-r612942808-L_illa_Diagonal-Barcelona_Catalonia.html", "text": "Excellent shopping center in Barcelona. I enjoyed shopping there with many Spanish products. Restaurants & cafes are available too!! Worth to visit!", "publishedDate": "2018-09-01", "language": "en", "rating": 5}, {"id": 612378063, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d7363048-r612378063-L_illa_Diagonal-Barcelona_Catalonia.html", "text": "The shopping mall has a great variety of shops, and has a Primark.  The mall is cool and clean.  There is a food court where you can buy fresh fruit and veg, and meats.  There are a few sit down eateries including a burger place and a Japanese eaterie however we didn't eat here", "publishedDate": "2018-08-30", "language": "en", "rating": 4}, {"id": 606944960, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d7363048-r606944960-L_illa_Diagonal-Barcelona_Catalonia.html", "text": "One of the best shopping malls in Barcelona, Where the atmosphere and diversity of brands and purchases and places to sit for a hot drink, in addition to many restaurants and plant products area ..", "publishedDate": "2018-08-16", "language": "en", "rating": 4}, {"id": 598557522, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d7363048-r598557522-L_illa_Diagonal-Barcelona_Catalonia.html", "text": "I visited this mall at Easter time while at a conference nearby. Nice spacious  mall with a good range of high street shops. Huge primark in the basement which was an added bonus. Staff everywhere were very friendly and helpful however I would advise you to avoid Zara at all costs! Being a loyal Zara customer I have visited their stores all over the world and never been disappointed however this  store had the most unhelpful, disinterested  and generally miserable bunch of staff I have ever come across ... avoid if you want a pleasant shop ...", "publishedDate": "2018-07-22", "language": "en", "rating": 4}, {"id": 585603566, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d7363048-r585603566-L_illa_Diagonal-Barcelona_Catalonia.html", "text": "Very good shopping mall and you will find everything here! Lots of brands and stores to explore. There could be me guidance to help the visitors figure out where they are but other than that, if you are around, it's worth a visit! ", "publishedDate": "2018-06-06", "language": "en", "rating": 4}, {"id": 584098721, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d7363048-r584098721-L_illa_Diagonal-Barcelona_Catalonia.html", "text": "You may find all good brands here , some of them are I felt expensive but you can find everything here ", "publishedDate": "2018-05-31", "language": "en", "rating": 5}, {"id": 583881390, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d7363048-r583881390-L_illa_Diagonal-Barcelona_Catalonia.html", "text": "I only intended to go to the supermarket but the shops were lovely and the area downstairs where the supermarket is is delightful. Artisan shops with local breads, oils, olives, wine bars etc etc. All sparkling and new with a true Spanish feel. All the shops were full of fairly contemporary items, for the home, fashion and more. Wish I had longer or could have carried more. A must on my next visit.", "publishedDate": "2018-05-30", "language": "en", "rating": 5}, {"id": 581183848, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d7363048-r581183848-L_illa_Diagonal-Barcelona_Catalonia.html", "text": "The shopping center is not large but has a good balance of some high-end and reasonably good brands to some fairly average restaurants and cafes and has a pleasant atmosphere. It is relatively new with a number of good hotels such as AC, NC  and Hilton.", "publishedDate": "2018-05-19", "language": "en", "rating": 3}, {"id": 566343778, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d7363048-r566343778-L_illa_Diagonal-Barcelona_Catalonia.html", "text": "One would not expect a shopping mall to be a highlight of a visit to Barcelona, but oh my!  This place is amazing, especially the huge food court on the lower level.  Believe me you have never seen such groceries . . . jambon on the hoof hanging in\ngreat mouth-watering profusion, pyramids of gorgeous produce, wonderful arrays of very fresh seafood on ice,  breads and baked goods to die for, whole kiosks dedicated to decadent candy and chocolate, all of this and more interspersed with a variety of tempting sit-down eating places as well as\nopportunities to buy other stuff such as jewelry, note cards pens and paper, toys, sporting goods, silk scarves, and on and on.  Of course you’ll also find the usual department store anchors, upscale clothing, shoes, etc.  All together a mind-blowing experience.  So don’t limit your exploring to the Ramblas.", "publishedDate": "2018-03-13", "language": "en", "rating": 5}, {"id": 562693294, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d7363048-r562693294-L_illa_Diagonal-Barcelona_Catalonia.html", "text": "Very nice shopping center with everything you need. Like clothes, cafeteria, restaurant and much more. ", "publishedDate": "2018-02-25", "language": "en", "rating": 5}, {"id": 545593009, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d7363048-r545593009-L_illa_Diagonal-Barcelona_Catalonia.html", "text": "From high-end to a grocery store this place has it all. The lower level hosts numerous restaurants and markets.  The crowds are staggering. ", "publishedDate": "2017-12-06", "language": "en", "rating": 4}, {"id": 544169782, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d7363048-r544169782-L_illa_Diagonal-Barcelona_Catalonia.html", "text": "I visited the mall twice last week as it was a walking distance from my hotel. Lots of shops, small restaurants, burger King, coffee shops, not crowded at all. Coming from London you can enjoy variety of shops we don't have here like OYSHO, Desigual, primark with completely different stock,massive Zara, bershka and Massimo. Outside there in a HM too. Recommend ", "publishedDate": "2017-11-30", "language": "en", "rating": 5}, {"id": 538019862, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d7363048-r538019862-L_illa_Diagonal-Barcelona_Catalonia.html", "text": "Oh wow!!! So. Many. Shops!!!!! Beautiful shopping experience of everything from clothes to jewellery and food too 😋 SUPER!!!! This is a must visit!! ", "publishedDate": "2017-11-03", "language": "en", "rating": 5}, {"id": 528749368, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d7363048-r528749368-L_illa_Diagonal-Barcelona_Catalonia.html", "text": "The mall was few mins on foot away from our hotel. There are good restaurants and cafés in and outdoor. There was children playing area a bit pricey but still affordable. It also has The only primark in barcelona. Some of the shops that you can find are: mango, decathlon, bershka, tiger, different local kiosks..etc\nIt is worth a visit if you are staying nearby or passing by.  ", "publishedDate": "2017-10-01", "language": "en", "rating": 5}, {"id": 526586302, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d7363048-r526586302-L_illa_Diagonal-Barcelona_Catalonia.html", "text": "Nice place, not so many people. \nThe shops are easy to find.\nNice to receive a shopping bag and discount card at the info point.", "publishedDate": "2017-09-22", "language": "en", "rating": 4}, {"id": 526382343, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d7363048-r526382343-L_illa_Diagonal-Barcelona_Catalonia.html", "text": "Lots of really nice shops from high end all the way to primark. Friendly and helpful customer service staff where you can pick up a VIP shopping card with a voucher from the city tour bus tickets which gives discounts in a number of the shops.", "publishedDate": "2017-09-21", "language": "en", "rating": 4}, {"id": 524452658, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d7363048-r524452658-L_illa_Diagonal-Barcelona_Catalonia.html", "text": "Big mall , many shops !! Great variety. Didn't  find sales or un ordinary deals , pretty normal.\n The food is very expensive.\n ", "publishedDate": "2017-09-14", "language": "en", "rating": 4}, {"id": 523961368, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d7363048-r523961368-L_illa_Diagonal-Barcelona_Catalonia.html", "text": "I was amazed by the food court in this mall, you can find anything you desire to eat. very well organized and clean with a wide variety of food and shops", "publishedDate": "2017-09-13", "language": "en", "rating": 5}, {"id": 523168451, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d7363048-r523168451-L_illa_Diagonal-Barcelona_Catalonia.html", "text": "Diagonal on its own is full of shops, but this mall helps concentrate them in one place. Plenty of different shops, just make sure to visit both sides.", "publishedDate": "2017-09-10", "language": "en", "rating": 4}, {"id": 520628588, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d7363048-r520628588-L_illa_Diagonal-Barcelona_Catalonia.html", "text": "Easy accessible quite large mall with plenty of shops, restaurants and bars. You can enjoy your time there.", "publishedDate": "2017-09-02", "language": "en", "rating": 5}, {"id": 515924820, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d7363048-r515924820-L_illa_Diagonal-Barcelona_Catalonia.html", "text": "The mall is a great choice for dhopping. It has more than 170 shops and lots of restaurants and cafes. Try it and you will love it. Very neat and easy to explore.", "publishedDate": "2017-08-21", "language": "en", "rating": 4}, {"id": 510670364, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d7363048-r510670364-L_illa_Diagonal-Barcelona_Catalonia.html", "text": "This is great shopping center in Barcelona it has so many shops with great prices as will restaurants. Highly recommend", "publishedDate": "2017-08-09", "language": "en", "rating": 5}, {"id": 506052444, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d7363048-r506052444-L_illa_Diagonal-Barcelona_Catalonia.html", "text": "Nice Shops, very clean and a deversified selection of different stores and food.\nYou can spend hours in it.", "publishedDate": "2017-07-26", "language": "en", "rating": 5}, {"id": 504115460, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d7363048-r504115460-L_illa_Diagonal-Barcelona_Catalonia.html", "text": "There is such a good selection of shops, bars , cafes, food outlets that you can find that gift or item you are looking for and if you don't find it , then it is still a comfortable environment to shop in. It is well located with good transport.", "publishedDate": "2017-07-21", "language": "en", "rating": 4}, {"id": 497052543, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d7363048-r497052543-L_illa_Diagonal-Barcelona_Catalonia.html", "text": "Has an amazing amount of shops to suit all budgets and ages, great rest areas and restaurants all in this building easy to navigate around with lots of space. ", "publishedDate": "2017-06-28", "language": "en", "rating": 5}, {"id": 489018216, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d7363048-r489018216-L_illa_Diagonal-Barcelona_Catalonia.html", "text": "Small mall but with some good offer of stores and some good restaurants as well. Located on the corner of Numancia street and Diagonal Avenue there is also an office tower attached.", "publishedDate": "2017-05-30", "language": "en", "rating": 3}, {"id": 486995480, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d7363048-r486995480-L_illa_Diagonal-Barcelona_Catalonia.html", "text": "Very big shopping centre with loads and loads of stores and nice cafés & restaurants. \n\nThe only downside is that there are close to none maps or signs so it's pretty hard to orientate since it's so big.\n\nFree toilets which were pretty fresh and clean was a big plus! ", "publishedDate": "2017-05-23", "language": "en", "rating": 4}, {"id": 479113135, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d7363048-r479113135-L_illa_Diagonal-Barcelona_Catalonia.html", "text": "Great shops in a very attractive Mall. Needed more time to see everything so get there early. Can be reached using the Hop on Hop off buses. ", "publishedDate": "2017-04-26", "language": "en", "rating": 5}, {"id": 468344244, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d7363048-r468344244-L_illa_Diagonal-Barcelona_Catalonia.html", "text": "Stayed at the AC Hotel there. This plaza with its underground eateries and shop was great. We got everything we needed. With 6 kids with us, we were able to find food to meet everyone's needs. \nSome nice selection of shops too that kept the wives busy. But not too busy.. \nvery nice area. ", "publishedDate": "2017-03-18", "language": "en", "rating": 5}, {"id": 466937743, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d7363048-r466937743-L_illa_Diagonal-Barcelona_Catalonia.html", "text": "Great shopping mall. Visited with family. Went into Primark and had a fun day budget shopping. Many places to have lunch or a snack after walking around the shops. ", "publishedDate": "2017-03-13", "language": "en", "rating": 4}, {"id": 465713675, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d7363048-r465713675-L_illa_Diagonal-Barcelona_Catalonia.html", "text": "I have been living next to that center for 2 years and I used to go there very ofter. I like L'illa a lot, very nice place with a lot of shops, restaurants. My recommendation for you is to visit that center and I am sure you would like it ", "publishedDate": "2017-03-08", "language": "en", "rating": 5}, {"id": 465654910, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d7363048-r465654910-L_illa_Diagonal-Barcelona_Catalonia.html", "text": "i enjoyed very much the shpping mall a great experience with a great food court and everything you need for shopping in one place", "publishedDate": "2017-03-08", "language": "en", "rating": 5}, {"id": 465649490, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d7363048-r465649490-L_illa_Diagonal-Barcelona_Catalonia.html", "text": "It was a pleasant shopping experience\nAfter a very long walk. A local mujer walked us there and we had a nice chat.", "publishedDate": "2017-03-08", "language": "en", "rating": 4}, {"id": 459189800, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d7363048-r459189800-L_illa_Diagonal-Barcelona_Catalonia.html", "text": "The place is a good mall, it's got good restaraunts (bovinum and fish are my favorite) also I like to go to the fnac and grab some good reads. As for shopping it's got the essentials, most of the brands everybody looks for and not too many overpriced stores. Very good cafes. Only thing is missing is a movie theater but there is one very near by just 2 min away walkin if you take diagonal and walk towards the Starbucks across the street. ", "publishedDate": "2017-02-13", "language": "en", "rating": 4}, {"id": 458085393, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d7363048-r458085393-L_illa_Diagonal-Barcelona_Catalonia.html", "text": "You find everything in just one place! Love the stores and the good vibe in the mall. Also very good gastronomy choices.", "publishedDate": "2017-02-08", "language": "en", "rating": 5}, {"id": 458021648, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d7363048-r458021648-L_illa_Diagonal-Barcelona_Catalonia.html", "text": "Interesting and classy , good location, classy restaurants , classy stores.\nBarcelona is beautiful!!!", "publishedDate": "2017-02-08", "language": "en", "rating": 5}, {"id": 457699416, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d7363048-r457699416-L_illa_Diagonal-Barcelona_Catalonia.html", "text": "I liked it because it had a variety of stores. Although the Zara clothes store wasn't there. or didn't have many options like in Placa Catalunya. ", "publishedDate": "2017-02-06", "language": "en", "rating": 4}, {"id": 449073180, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d7363048-r449073180-L_illa_Diagonal-Barcelona_Catalonia.html", "text": "I stayed in Ac diagonal Lilla hotel from 30th December 2016 till January 1st. The hotel is in a great location.. it is conveniently located next to a mall and the metro stop and bus stops are just a few yards away... I stayed in room 411 and it was very spacious and nice.. the reception desk is very helpful and willing to help you with all the information you could ask for...breakfast was not value for money for was good... the 2 nd floor lounge was dull and not too many items in the food menu for room service ... overall would rate it very good", "publishedDate": "2017-01-03", "language": "en", "rating": 4}, {"id": 445940711, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d7363048-r445940711-L_illa_Diagonal-Barcelona_Catalonia.html", "text": "This is a very nice shopping mall with special offers all the time. Ask for the VIP shopping card at the information booth.", "publishedDate": "2016-12-21", "language": "en", "rating": 5}, {"id": 440768154, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d7363048-r440768154-L_illa_Diagonal-Barcelona_Catalonia.html", "text": "This mall is easily reached by the metro from eg Placa de Catalunya and getting off at Maria Cristina. There are a variety of shops from the  more designer to Primark. You could also use the hop-on-off bus if you have a ticket. Probably there is no need to visit as there are plenty of shops in the downtown area. We spent about an hour and a half here-bought things at Disney store for grandchildren-then found same store near cathedral", "publishedDate": "2016-11-28", "language": "en", "rating": 4}, {"id": 440683910, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d7363048-r440683910-L_illa_Diagonal-Barcelona_Catalonia.html", "text": "i was in barcelona fo rbussines trip and i had naroow time for shops as well.\ni found evrything there very fast and easy.the price are fine and you can shop with spanish and other medium level brands as well.\n", "publishedDate": "2016-11-28", "language": "en", "rating": 5}, {"id": 437881570, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d7363048-r437881570-L_illa_Diagonal-Barcelona_Catalonia.html", "text": "There is a mix of upscale stores and dollar type stores (lower level). The items available run the gamut too - designer clothing and shoes, sports ware,craft items,  electronics, books, and all type of food and beverage. Shoppers can easily spend hours here.", "publishedDate": "2016-11-16", "language": "en", "rating": 4}, {"id": 435167915, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d7363048-r435167915-L_illa_Diagonal-Barcelona_Catalonia.html", "text": "This is a new modern area out of the main old town and has a number of restaurants and hotels and parks. The shopping is OK but not special. The hotels are good and include an AC and a Hilton.", "publishedDate": "2016-11-06", "language": "en", "rating": 3}, {"id": 429782049, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d7363048-r429782049-L_illa_Diagonal-Barcelona_Catalonia.html", "text": "Something for everyone here. If you have time highly recommend a visit. Take a break from the sites and hit the wallet!", "publishedDate": "2016-10-19", "language": "en", "rating": 4}, {"id": 425886438, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d7363048-r425886438-L_illa_Diagonal-Barcelona_Catalonia.html", "text": "One of the newly made shopping complexes in Barcelona. Located at less than 10 minutes walking distance from Maria Cristina Metro. It is  also one of the stops on the West Route of Hop On Hop Off City Tour Buses. Its a must visit  - point on every modern tourist`s agenda. This modern mall has a mix of good shopping with international and local brands. Also has PRIMARK one of UK’s popular departmental store, which has recently opened up at L’illa.  One will find a mix of locals, expats and tourists shopping there. Shopping is incomplete without a good dining experience and this mall fulfills that too. It has many restaurants offering  Spanish, Continental and Asian cuisine. Besides the mall, many other tourists attractions located near by. Overall a not to miss location.", "publishedDate": "2016-10-07", "language": "en", "rating": 4}, {"id": 423878802, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d7363048-r423878802-L_illa_Diagonal-Barcelona_Catalonia.html", "text": "Good place for shopping , keep all tax free for airport ... Be sure you have enough time to claim all taxes , global blue and others . ", "publishedDate": "2016-09-30", "language": "en", "rating": 5}, {"id": 421825481, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d7363048-r421825481-L_illa_Diagonal-Barcelona_Catalonia.html", "text": "I wouldn't say this was a must see when going to Barcelona but it was definitely a perk for us! We found it by fluke, our hotel was 5 minutes away. It has a great Primark, Zara, a great food mall and lots of other branded stores. If you're near, it's definitely worth dropping by, even just for a mooch! ", "publishedDate": "2016-09-24", "language": "en", "rating": 5}, {"id": 421308387, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d7363048-r421308387-L_illa_Diagonal-Barcelona_Catalonia.html", "text": "I loved this mall. it's clean, modern and bright. you have all the spanish and european brand names and also some low cost clothing. the ambiance is quite relaxes and each one can find something to buy. you should just know that is isn't centrally located buit it's in a very good and safe area of barcelona.", "publishedDate": "2016-09-22", "language": "en", "rating": 5}, {"id": 413470128, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d7363048-r413470128-L_illa_Diagonal-Barcelona_Catalonia.html", "text": "Fashion stores, food joints and nice hotels on this stretch. Located on the main road of Barcelona. Good place to stay in.\n", "publishedDate": "2016-09-01", "language": "en", "rating": 4}, {"id": 412547239, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d7363048-r412547239-L_illa_Diagonal-Barcelona_Catalonia.html", "text": "The design inside is a little different than usual but smooth and you can't get lost, many many spanish brands that were good and worth buying like leather goods ,jewelry and shoes. Basement floor has a supermarket and a place for food groceries/ restaurants, a salon and some shops. Outside near gate 6 it has a very excellent café, for tapas, and drinks. Shops included Nike, Bershka, Mango, zara home and many other international brands besides the spanish ones which in my opinion were better than the international. ", "publishedDate": "2016-08-29", "language": "en", "rating": 5}, {"id": 411108269, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d7363048-r411108269-L_illa_Diagonal-Barcelona_Catalonia.html", "text": "We are booked at the Hilton , just a 5 minute walk to this 3 level mall . Many brands , from the moderate to high end level , are available . From Sfera , Massimo ,  Zara and Desigual , among others . Authentic brands located only in Spain can also be found. A supermarket at the ground level , which also houses a food court of various cuisines can be found . My spouse liked what she saw , and she'll be coming back to shop for more .  By the way , there is also a Star Wars display at the lobby , nice to check this thing out . ", "publishedDate": "2016-08-26", "language": "en", "rating": 4}, {"id": 408267674, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d7363048-r408267674-L_illa_Diagonal-Barcelona_Catalonia.html", "text": "We visited this mall as we were passing by. Really nice selection of stores on 3 levels. Great coffee shops and eateries inside with more outside  - plenty stores for all ages.", "publishedDate": "2016-08-21", "language": "en", "rating": 4}, {"id": 403288425, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d7363048-r403288425-L_illa_Diagonal-Barcelona_Catalonia.html", "text": "If visiting Barcelona, it is a must.\nIn the mall you will find very well known brands, local and international.\nDo not miss the lower floor where you will find fine food. You should try \"tapas\" at Morro Fi or the croissant at Escriba or fish lunch at Fissssh!", "publishedDate": "2016-08-09", "language": "en", "rating": 5}, {"id": 402137954, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d7363048-r402137954-L_illa_Diagonal-Barcelona_Catalonia.html", "text": "The mall was near the hotel we stayed in, Atenea Aparthotel Barcelona, a walking distance of 7 minutes. The mall has a lot of brands and one of three Primark branches in Barcelona. There is also a big supermarket in the mall where you can grab any needed items easily. It is one of the nicest malls in Barcelona. ", "publishedDate": "2016-08-06", "language": "en", "rating": 5}, {"id": 399832600, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d7363048-r399832600-L_illa_Diagonal-Barcelona_Catalonia.html", "text": "It is a big shopping center. It has a lot of shops but a little bit expensive brands. It has zara, ohyso, decathlon, etc. it also has a big supermarket ", "publishedDate": "2016-07-31", "language": "en", "rating": 5}, {"id": 398185554, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d7363048-r398185554-L_illa_Diagonal-Barcelona_Catalonia.html", "text": "Great shopping. There you can buy fresh fruits down stairs or you can eat excellent food everywhere, hard to choose so many good options. Shop wherever you want here, you can find everything with a very accessible prices. ", "publishedDate": "2016-07-27", "language": "en", "rating": 5}, {"id": 394999014, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d7363048-r394999014-L_illa_Diagonal-Barcelona_Catalonia.html", "text": "Great place for shopping. Here you find both cheap shops (Primark) and more expensive ones.\nIn the basement there is a superb food court where you can find all sorts of Jamon Serrano. Caprabo is also to be found here (huge supermarket).\nIt is located right on Avenida Diagonal with both trams and busses right at the door steps.", "publishedDate": "2016-07-21", "language": "en", "rating": 5}, {"id": 384990936, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d7363048-r384990936-L_illa_Diagonal-Barcelona_Catalonia.html", "text": "Big shopping mall. Includes primark, zara, mango.... Although the primark is not as big as in the Uk. Outside the mall are a few restaurants and it is pretty simple to reach with the metro", "publishedDate": "2016-06-22", "language": "en", "rating": 4}, {"id": 384961580, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d7363048-r384961580-L_illa_Diagonal-Barcelona_Catalonia.html", "text": "L'llac Diagnonal is conveniently situated near our hotel - Melia Barcelon Sarria which was quite in the middle of nowhere so this mall literally saved our day!\n\nThe mall is really self sufficient, they have really good mix of shops - From Supermarkets to Dept store like Primark to Boutiques like Zara etc. \nWe had good time shopping there and it saved us alot of time not having to travel out elsewhere. Its not touristy at all so really enjoyed the space!", "publishedDate": "2016-06-22", "language": "en", "rating": 5}, {"id": 380254548, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d7363048-r380254548-L_illa_Diagonal-Barcelona_Catalonia.html", "text": "If you wanna buy something exclusive you should visit this shopping mall. There are many shops such as Luis Viton, Prada, and etc... Also area is not crowded as city centre. We were luck that we found very good discount in parfumes and electronics. If you are lucky you can find similar discount. Go and try your chance :) ", "publishedDate": "2016-06-06", "language": "en", "rating": 4}, {"id": 379062017, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d7363048-r379062017-L_illa_Diagonal-Barcelona_Catalonia.html", "text": "Great mall for a fun and productive shopping.  Has all the familiar brands and various unique stores.\nDon't miss the Haggen Douz ice cream.", "publishedDate": "2016-06-02", "language": "en", "rating": 5}, {"id": 370003674, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d7363048-r370003674-L_illa_Diagonal-Barcelona_Catalonia.html", "text": "A very nice shopping moll but very expensive\nA vesatile food area that any one can find what to eat.", "publishedDate": "2016-05-03", "language": "en", "rating": 5}, {"id": 365474563, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d7363048-r365474563-L_illa_Diagonal-Barcelona_Catalonia.html", "text": "Great shops, both high street and little unusual boutiques. Had lunch in a place that served the most excellent salads. Excellent experience! ", "publishedDate": "2016-04-19", "language": "en", "rating": 5}, {"id": 365297016, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d7363048-r365297016-L_illa_Diagonal-Barcelona_Catalonia.html", "text": "L'illa Diagonal is a great mall with a good collection of shops and food joints. It\nis well connected and easy to find. Since I was staying at NH Constanza , mall was hardly a minute's walk. It is good place to do some quick shopping or just hang out in general..", "publishedDate": "2016-04-18", "language": "en", "rating": 4}, {"id": 346781514, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d7363048-r346781514-L_illa_Diagonal-Barcelona_Catalonia.html", "text": "Very nice shopping experience within walking distance from Placa de Catalunya. Plenty of nice shops and a great food court in the lower level", "publishedDate": "2016-02-10", "language": "en", "rating": 4}, {"id": 336476796, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d7363048-r336476796-L_illa_Diagonal-Barcelona_Catalonia.html", "text": "A great, big shopping center with all kinds of shops. There's something for everyone at L'illa. The tram and metro stops are very close. The street the mall is on is nice, too. We ended up eating at Burger King because we couldn't find a \"nicer\" place, but if we hadn't been so hungry, maybe we would have had the energy to really walk around and we might have found something. The shopping experience was great, though! ", "publishedDate": "2016-01-01", "language": "en", "rating": 4}, {"id": 321054410, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d7363048-r321054410-L_illa_Diagonal-Barcelona_Catalonia.html", "text": "The Lilla Shopping Center is one of the shopping malls in the Eixample and this one is quite good. There are many quality stores and places to eat in this mall.", "publishedDate": "2015-10-22", "language": "en", "rating": 5}, {"id": 313554727, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d7363048-r313554727-L_illa_Diagonal-Barcelona_Catalonia.html", "text": "Great place for shopping, everything you need in one place. Close to the metro station. There is \"Pandora\" shop on the second floor. :)", "publishedDate": "2015-09-25", "language": "en", "rating": 4}, {"id": 307237510, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d7363048-r307237510-L_illa_Diagonal-Barcelona_Catalonia.html", "text": "This is a great shopping centre and we shopped till we dropped.  All the great stores are here, they even have a Diesel store.  Modern shopping centre, parking, very good food area with lots of restaurants to choose from, the better ones a little expensive.  Safe really nice place to shop at, everything you need including a supermarket.", "publishedDate": "2015-09-05", "language": "en", "rating": 5}, {"id": 301341329, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d7363048-r301341329-L_illa_Diagonal-Barcelona_Catalonia.html", "text": "Shopping under one roof. Excellent cafes. Plus sizes available at violeta by mango. An electronics shop in the basement. ", "publishedDate": "2015-08-19", "language": "en", "rating": 5}, {"id": 298365774, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d7363048-r298365774-L_illa_Diagonal-Barcelona_Catalonia.html", "text": "Nice place to spend your time. Recommended. We had a very nice time. Shopping was also good...there are also 2 smaller shopping centers next to it.", "publishedDate": "2015-08-12", "language": "en", "rating": 4}, {"id": 297152916, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d7363048-r297152916-L_illa_Diagonal-Barcelona_Catalonia.html", "text": "It has almost all kind of shops I needed. And it was big enough for me. I made all my shopping there.\nAnd I liked the atmosphere. It has a good playing area for kids and a food court.", "publishedDate": "2015-08-09", "language": "en", "rating": 5}, {"id": 278722729, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d7363048-r278722729-L_illa_Diagonal-Barcelona_Catalonia.html", "text": "Something for everyone. Great shopping and bustling with people. Diverse shopping which is good. We also had a great value Pizza in a nice traditional eating house, which was clean and had very warm and friendly staff. ", "publishedDate": "2015-06-08", "language": "en", "rating": 5}, {"id": 270366061, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d7363048-r270366061-L_illa_Diagonal-Barcelona_Catalonia.html", "text": "Lilla is such a nice large shopping\nCentre. It has primark, Zara to H & M and it's just nice to be able to do a bit of shopping whilst being on holiday also. There are fresh fruit stalls, candy shops, home shops, coffee shops, jewellery shops etc.\nIt also has a children fun area where they have rides and trampoline and also a little kids park at the back. I love going there and really enjoy it! Highly recommended :))) ", "publishedDate": "2015-05-06", "language": "en", "rating": 5}, {"id": 267565810, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d7363048-r267565810-L_illa_Diagonal-Barcelona_Catalonia.html", "text": "Not only you have to walk almost 1 km from the nearest metro station to get to the mall, in the mall there is not one bench or chair available for people whi want to rest a little. The building is constucted in the most horrible way possible - you got out to the street and than back to the building etc, you can't find the store you want between all the floors, couldn't even find a decent place to drink coffee quietly. My experience was terrible, and I usually find shopping mall to be very convenient, and I think this place will just make your life harder. go shop on the streets, it;s 10 times better.", "publishedDate": "2015-04-23", "language": "en", "rating": 1}, {"id": 266039663, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d7363048-r266039663-L_illa_Diagonal-Barcelona_Catalonia.html", "text": "From clothes, shoes and accessories to cooked meals and freshly sliced Jamón - you will find everything you need there.", "publishedDate": "2015-04-16", "language": "en", "rating": 5}, {"id": 250008686, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d7363048-r250008686-L_illa_Diagonal-Barcelona_Catalonia.html", "text": "All known brand in one place. Very clean and well organized. Not far from Nou stadium and is worth a visit.", "publishedDate": "2015-01-19", "language": "en", "rating": 5}, {"id": 245716384, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d7363048-r245716384-L_illa_Diagonal-Barcelona_Catalonia.html", "text": "An enormous shopping center with all the main firms in Spain: Bershka, Desigual, Zara, Stradivarius, Mango, Primark, El corte Ingles, and many more, you can find everything you want in one place, including food... you have lockers if you wish to leave some of your shopping bags. Very nice, clean, organized mall, worh to visit, and it is close to Nou Stadium, so you can do to visits in one day...", "publishedDate": "2014-12-24", "language": "en", "rating": 5}]}}]