[{"locationId": 8093226, "name": "Jardins de Villa Amelia", "placeType": "ATTRACTION", "reviewListPage": {"reviews": [{"id": 486105643, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d8093226-r486105643-Jardins_de_Villa_Amelia-Barcelona_Catalonia.html", "text": "If you are exhausted from a busy travel itinerary then it is time to stop and smell the roses. This is a great place to do that. There are lots of beautiful plants and flowers, local people enjoying the beautiful weather, people playing with their dogs and kids. A calming place to relax. ", "publishedDate": "2017-05-21", "language": "en", "rating": 5}, {"id": 481087216, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d8093226-r481087216-Jardins_de_Villa_Amelia-Barcelona_Catalonia.html", "text": "I suppose most of the tourists who come to Barcelona are not travelling with a two-year old kid, which was my case. None of the touristic attractions seems to attract them. So I had to search for some funny activity for her. She loved Villa Amelia. It is a neighbourhood park, with lots of families and kids of all ages. My little one particularly enjoyed the playground area. It is simple, well equiped and with a sandy ground (children love to play with sand). Spanish people are very kind, so it is a chance for parents to talk a little with locals while the kids are playing. In the middle of the park there is a small lake with turtles. The park itself is really agreable for adults, green and well maintained. You should also cross the street behind Villa Amelia, and visit Villa Cecilia, which is smaller but has other attractions for the little ones.", "publishedDate": "2017-05-02", "language": "en", "rating": 5}, {"id": 472080550, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d8093226-r472080550-Jardins_de_Villa_Amelia-Barcelona_Catalonia.html", "text": "Lovely park in Sarria/Pedralbes. Nice play area for little ones and space to kick a ball for bigger kids. There's a nice cafe in the middle, although the service there is rubbish. ", "publishedDate": "2017-04-02", "language": "en", "rating": 5}, {"id": 364088967, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d8093226-r364088967-Jardins_de_Villa_Amelia-Barcelona_Catalonia.html", "text": "The salads are good in this lovely sourroundings. We have been a bit snnoyedas  it took 45 minutes to get our salads and the corresponding service was poor. It is well known that staff there is easily stressed if many guests wants to eat but in this case only some people were there. Prices are ok but you pay 1.50 e pp for knife and fork and a bit bread. This seems a bit stingy...  Maybe organization could be improved? Staff just a bit friendlier in general? Would be great in order to come back...", "publishedDate": "2016-04-14", "language": "en", "rating": 2}, {"id": 272706785, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d8093226-r272706785-Jardins_de_Villa_Amelia-Barcelona_Catalonia.html", "text": "This is a nice park because it combines both the green aspects as well as a kid playground. The two are separate enough for people to enjoy some quite and for the kids to enjoy various rides..", "publishedDate": "2015-05-18", "language": "en", "rating": 4}]}}]