[{"locationId": 7021032, "name": "Mossen Costa i Llobera Gardens", "placeType": "ATTRACTION", "reviewListPage": {"reviews": [{"id": 722040282, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d7021032-r722040282-Mossen_Costa_i_Llobera_Gardens-Barcelona_Catalonia.html", "text": "A beautiful garden which was very well maintained. Lots of attentive staff doing maintenance while we were exploring after arriving on the cable car to the area.\n\nWell worth the look.", "publishedDate": "2019-10-28", "language": "en", "rating": 5}, {"id": 676669757, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d7021032-r676669757-Mossen_Costa_i_Llobera_Gardens-Barcelona_Catalonia.html", "text": "Came across this attraction from reviews & felt we needed to visit. We were not dissapointed. This park is situated away from the main City Centre area. We got there by metro & then walked the remaining way. It was fairly quite. The park is free to access & is amazing scenary. It is situated on a slope of a hilltop. You keep walking up to climb higher with lovely unusual plants & trees. From the slope hilltop overlooks the port area. We walked all the way to the top of the hilltop & the airial scenary overlooking parts of the City was really enjoyable. There is a cable car ride & the Miramar Hotel is situated on the hilltop. A definate visit is recommended.", "publishedDate": "2019-05-26", "language": "en", "rating": 5}, {"id": 675405692, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d7021032-r675405692-Mossen_Costa_i_Llobera_Gardens-Barcelona_Catalonia.html", "text": "A short walk from the cable car  and near the Miramar Hotel, there’s this calm park: a plantlady’s heaven! All kinds of cacti and succulents, beautiful flowers and lovely winding roads.\nThere was only one other person in this park when we walked around, while a few minutes away the crowds arrive at the top of Montjuic!\nA must visit for people who love nature, plants and some peace and quiet in a bustling city. ", "publishedDate": "2019-05-21", "language": "en", "rating": 5}, {"id": 653003536, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d7021032-r653003536-Mossen_Costa_i_Llobera_Gardens-Barcelona_Catalonia.html", "text": "It's not easy to find this place. Free entrance, not crowded. There are a lot of palm trees and different kind of cactuses.", "publishedDate": "2019-02-17", "language": "en", "rating": 5}, {"id": 652528006, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d7021032-r652528006-Mossen_Costa_i_Llobera_Gardens-Barcelona_Catalonia.html", "text": "The Cactus Garden is one of my favorite places in Barcelona. It's small, but beautiful, and not very touristic (yet?) I feared that it might not look the same as the photos I saw prior to coming to Barcelona during the winter, but it looks the same.", "publishedDate": "2019-02-15", "language": "en", "rating": 5}, {"id": 646285674, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d7021032-r646285674-Mossen_Costa_i_Llobera_Gardens-Barcelona_Catalonia.html", "text": "One of the most silent places within the catalonyan capital. Spend some hours there, you'll come back!", "publishedDate": "2019-01-16", "language": "en", "rating": 5}, {"id": 615084807, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d7021032-r615084807-Mossen_Costa_i_Llobera_Gardens-Barcelona_Catalonia.html", "text": "A very beautiful garden on the Montjuc hill with various cactuses. Even in very sunny and hot day it's worth to go there. There were few people there so it was nice to walk the paths and listen to the parrots voice.", "publishedDate": "2018-09-09", "language": "en", "rating": 5}, {"id": 567244049, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d7021032-r567244049-Mossen_Costa_i_Llobera_Gardens-Barcelona_Catalonia.html", "text": "After visiting the beach my partner and I caught the cable car up the mountain to the gardens. The gardens are free the cable car was 11 euros each one way (think it's 16 each return)\nThere are 2 restraunts up there too both very pricey but the service was good and the weather was nice allowing us to sit outside and enjoying the stunning views whilst having something to eat.\nThe garden is amazing and some of the cacti were truly spectacular! Part of the area had been cordoned off but you can still get close enough to take pictures. The garden itself seemed pretty well maintained could probably do with some more plant labels to identify species but other than that a great place to visit 👍", "publishedDate": "2018-03-18", "language": "en", "rating": 5}, {"id": 562330836, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d7021032-r562330836-Mossen_Costa_i_Llobera_Gardens-Barcelona_Catalonia.html", "text": "This is a nice cactus and succulent garden, but it could be better maintained. The location is quite nice overlooking Barcelona port, but you end up looking at all the large cruise ships rather than the sea...", "publishedDate": "2018-02-23", "language": "en", "rating": 4}, {"id": 559596718, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d7021032-r559596718-Mossen_Costa_i_Llobera_Gardens-Barcelona_Catalonia.html", "text": "The Garden was not as colorful as it would have been in other seasons, but it was an awesome visit. We took the cable car/lift from the beach and walked around the garden for over 2 hours. It does offer a breathtaking view of the city.", "publishedDate": "2018-02-10", "language": "en", "rating": 5}, {"id": 554117989, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d7021032-r554117989-Mossen_Costa_i_Llobera_Gardens-Barcelona_Catalonia.html", "text": "I stumbled upon this place while looking at maps of the Barcelona area. As a fan of cactus and succulents it seemed like it would be worth the trek. Most of the species were in bloom which made for a great visit. The trails meander along the hillside through large plantings of varying species. I found the trails to be clean with smooth concrete so walking them should be easy for all ages. The location is a bit south of the main tourist areas, but if you are touring the Olympic venue it is worth a visit. There was no cost to enter the gardens.", "publishedDate": "2018-01-15", "language": "en", "rating": 4}, {"id": 549737072, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d7021032-r549737072-Mossen_Costa_i_Llobera_Gardens-Barcelona_Catalonia.html", "text": "Not an easy place to find, but when you eventually fall across it, it is quite magical. The section at the bottom end is a little tired, but further up, time has been spent bringing it back to it's former glory. If you like Cactus's, you will love it here. A lovely way to spend a couple of hours \"chilling out\", Looking out to sea.", "publishedDate": "2017-12-28", "language": "en", "rating": 4}, {"id": 527778064, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d7021032-r527778064-Mossen_Costa_i_Llobera_Gardens-Barcelona_Catalonia.html", "text": "I am a fan of flowers and especially a cactus. This park is a simple paradise.I love this place.....", "publishedDate": "2017-09-27", "language": "en", "rating": 5}, {"id": 493438929, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d7021032-r493438929-Mossen_Costa_i_Llobera_Gardens-Barcelona_Catalonia.html", "text": "As with most of the gardens in Barcelona the entry is free, but despite that we only saw a couple of other people about and we did see some workers. Lower parts of the garden are a bit neglected which is a shame. There are some fabulous specimens of  Echinocactus grusonii (Barrel Cacuts) and Agave victoriae-reginae. Some areas were roped off as some of the plants had got a little out of control. A shame that someone has to fill the Agaves with the lava rock, not easy to remove. There was some naming of plants but not much. \nIt is not that steep a garden as you can walk along the paths and move up and down between them easily, but it was hot enough at the beginning of June for us. It would be overly hot in the summer.\nAlthough it overlooks a busy road and is quite noisy, the plants are a good enough distraction.", "publishedDate": "2017-06-15", "language": "en", "rating": 4}, {"id": 488617096, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d7021032-r488617096-Mossen_Costa_i_Llobera_Gardens-Barcelona_Catalonia.html", "text": "Although the views across Port Vell from these gardens is great, the gadens themselves were rather disappointing. Got the impression they were once carefully prepared and then (possibly due to lack of finance) left to themselves.", "publishedDate": "2017-05-28", "language": "en", "rating": 3}, {"id": 483106962, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d7021032-r483106962-Mossen_Costa_i_Llobera_Gardens-Barcelona_Catalonia.html", "text": "It is very relaxing and amazing especially for the family not from the south contry. So many types of succulents, palms, very big park and the walking is not so hard, even in the sun.", "publishedDate": "2017-05-10", "language": "en", "rating": 5}, {"id": 480004068, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d7021032-r480004068-Mossen_Costa_i_Llobera_Gardens-Barcelona_Catalonia.html", "text": "A really pretty garden, quite small, with the beautiful view - you can chill under the palm tree and stare at the city. All plants are prettily arranged, there is lots of exotic ones, flowers and places to sit. Small but really nice for a walk.", "publishedDate": "2017-04-29", "language": "en", "rating": 4}, {"id": 475469455, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d7021032-r475469455-Mossen_Costa_i_Llobera_Gardens-Barcelona_Catalonia.html", "text": "I had been here before years ago and wanted to take my wife there and she was not dissapointed and nor was I this is a lovely park coming down from the cable car at Mont Juc and the number and variety of cactus plants is amazing so is the wildlife (not captive). It is so quiet and if you have a little imagination you can believe you are in Mexico or the age of the dinosaurs", "publishedDate": "2017-04-14", "language": "en", "rating": 5}, {"id": 435070571, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d7021032-r435070571-Mossen_Costa_i_Llobera_Gardens-Barcelona_Catalonia.html", "text": "We love visiting botanical gardens on all our travels and we were most impressed by this amazing, terraced, quiet and FREE garden of an enormous number of cacti and Mediterranean plants on Montjuic.  Fairly well-groomed, though with not one worker visible during our entire visit, the variety of cacti and the placement within the garden is fascinating.  We enjoyed our leisurely stroll though the grounds having been dropped off at the entry towards the lower section of the garden which is placed on quite a steep slope.  Walkways, though, are nicely designed and easy to maneuver.  There are a series of stairs but all quite manageable.  Upwards we moved comfortably, encountering only 3 people the couple of hours we were there, until we surfaced at the upper part of the gardens to a hotel and a wonderful high perch from which we could surveille this section of Barcelona.", "publishedDate": "2016-11-06", "language": "en", "rating": 5}, {"id": 372271047, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d7021032-r372271047-Mossen_Costa_i_Llobera_Gardens-Barcelona_Catalonia.html", "text": "Great cactus and exotic plants, great views of the city and the sea, l am told that it gets pretty hot here in the summer but luckily we visited in April. Great pictures to be had, these types of cactus are only grown in special parts of the world, a nice place to 'chill out'", "publishedDate": "2016-05-11", "language": "en", "rating": 4}, {"id": 332059988, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d7021032-r332059988-Mossen_Costa_i_Llobera_Gardens-Barcelona_Catalonia.html", "text": "This is must-to-visit place if you like cactuses and other exotic plants.\n\nIMHO: better visit it on the back way home after Montjuic Castle.", "publishedDate": "2015-12-11", "language": "en", "rating": 4}, {"id": 314074226, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d7021032-r314074226-Mossen_Costa_i_Llobera_Gardens-Barcelona_Catalonia.html", "text": "Cactuses everywhere you turn...peace in the middle of loud Barcelona...great views over the city and sea...what more could you want?! \nWe visited Poble Espanyol, Joan Miro, Castle (they all are on one side of the hill) and when we went downhill from Castle, we went through cactus garden and end up close to sea and Raval. I really recommend it to everyone!!!", "publishedDate": "2015-09-27", "language": "en", "rating": 5}, {"id": 297418490, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d7021032-r297418490-Mossen_Costa_i_Llobera_Gardens-Barcelona_Catalonia.html", "text": "The gardens are cool with so many different types of cactuses. But it is really-really hot there in the summer. So if you go there like we did in August, take hats with you. The sun is cruel)", "publishedDate": "2015-08-10", "language": "en", "rating": 4}, {"id": 284178259, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d7021032-r284178259-Mossen_Costa_i_Llobera_Gardens-Barcelona_Catalonia.html", "text": "This is a hidden secret  and worth a visit. It houses a large range of fully grown cacti mainly from South America but other places too.\nThey are attractively displayed and allowed to grown to their full height( which can be pretty big) and labeled.\n\nWe were lucky to visit in June when many of them were in flower.\n\nThe garden is part of the park containing the steps to the top of the cable car over the harbour so the view from the top is splendid.\n\nIt was so nice to escape the bustle of town for a while and the threat of pickpockets as the visitors to the park are minimal.\n\nEntry is free and even for those who are not cactus lovers it is well worth the time spent as I have never seen such a large variety of these plants in one place.", "publishedDate": "2015-06-30", "language": "en", "rating": 5}, {"id": 245901815, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d7021032-r245901815-Mossen_Costa_i_Llobera_Gardens-Barcelona_Catalonia.html", "text": "A small walk from la ramba, the cactus and palm tree gardens give you the opportunity to see many different cacti and some big palm trees in a hilly manicured garden. I walked it in December which is not the best time but saw a number of flowering cacti and enjoyed the exercise of the steps, the view of the waterfalls and fountains. The restaurant at the top wasn't open in the morning when I went but I enjoyed the views over the harbour and a change in scenery from the tourist shops of la rambla. There are ramps as well as stairs and it was interesting to see the middle aged walkers as well as the young joggers and a few cyclists exercising in the morning.", "publishedDate": "2014-12-26", "language": "en", "rating": 4}, {"id": 243974357, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d7021032-r243974357-Mossen_Costa_i_Llobera_Gardens-Barcelona_Catalonia.html", "text": "During our Monjuic Park visit we came across this cactus garden and we wnjoyes a nice one-hour stroll between giant and small cactus plants\nI recommend a visit there, maybe you'll be as impressed as we were\nIt's free of charge and you can take impressive pictures", "publishedDate": "2014-12-10", "language": "en", "rating": 4}, {"id": 239709122, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d7021032-r239709122-Mossen_Costa_i_Llobera_Gardens-Barcelona_Catalonia.html", "text": "This is an amazing and wonderful place to come to get away from the hustle and bustle of Barcelona. Apart from the fascinating array of cactuses there are panoramic views over the port. I don't think many people are aware of its existence as we nearly always have it pretty much to ourselves. Montjuic generally is a great part of Barcelona and the cactus garden is well worth a visit.", "publishedDate": "2014-11-13", "language": "en", "rating": 5}, {"id": 223774543, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d7021032-r223774543-Mossen_Costa_i_Llobera_Gardens-Barcelona_Catalonia.html", "text": "This is one of the largest gardens specializing in cactus and succulent plants in Europe. Looking towards the sea, sheltered under Montjuïc mountain, it enjoys a privileged location just minutes from downtown Barcelona. This unique space offers a unique collection in the world: 3.16 hectares that are a journey through some of the most exotic species on the planet. These are species found in sub-desert areas, deserts and tropical regions, but also in high mountain areas. The area enjoys a special microclimate between two and three degrees above the average temperature of Barcelona. The prime reason is its orientation that protects the area from cold winds. WORTH TO VISIT FOR ALL CACTUS LOVERS!", "publishedDate": "2014-08-23", "language": "en", "rating": 5}]}}]