[{"locationId": 7175296, "name": "Portal de l'Àngel", "placeType": "ATTRACTION", "reviewListPage": {"reviews": [{"id": 368754603, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d7175296-r368754603-Portal_de_l_Angel-Barcelona_Catalonia.html", "text": "I guess we got lucky. I asked our guide where do locals shop, and he gave us the address of this street. And trust me..what a surprise it turned out to be.\n\nGreat street. Full of all fashion brands, global as well as local. Starts at Plaza de Cataluniya and just keep on going right till the port...\n\nMust visit. Less touristy that its famous neighbour and more charming.", "publishedDate": "2016-04-29", "language": "en", "rating": 4}, {"id": 351686489, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d7175296-r351686489-Portal_de_l_Angel-Barcelona_Catalonia.html", "text": "Portal de l'Angel is so much nicer than La Rambla. Just a large block to the East, it does not seem nearly as tourist focused. Here you will find tourists and locals enjoying a scenic walk. It is my favorite spot for shopping in town.\n\nTIP: Start at Plaza de Catalunya and walk downhill all the way to the ocean.", "publishedDate": "2016-02-28", "language": "en", "rating": 4}, {"id": 287798582, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d7175296-r287798582-Portal_de_l_Angel-Barcelona_Catalonia.html", "text": "June weather in Barcelona is amazing and it's a perfect time to go shopping at Portal de I'Angel avenue. It's full of great shopping brands and Spain is a fantastic fashion place- best brands are the Indetex ones ofcourse (Zara, Stradivarius, Bershka, Pull & Bear were significantly more affordable than than in Asia!) Portal de I'Angel was one of my favorite places to just walk around and feel out the Barcelona flare.", "publishedDate": "2015-07-10", "language": "en", "rating": 5}, {"id": 267563120, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d7175296-r267563120-Portal_de_l_Angel-Barcelona_Catalonia.html", "text": "We love outdoor shopping, and in portal de l'angel there are all the central stores you wish to visit when in Barcelona. Most of the stores are very large, very well designed, you can do all your shopping there - no need to go to any mall. Lovely", "publishedDate": "2015-04-23", "language": "en", "rating": 5}]}}]