[{"locationId": 3139274, "name": "Iglesia de San Jaime", "placeType": "ATTRACTION", "reviewListPage": {"reviews": [{"id": 691389533, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d3139274-r691389533-Iglesia_de_San_Jaime-Barcelona_Catalonia.html", "text": "That church was initially a temple dating back to the end of the fourteenth century dedicated to the Very Saint Trinity. After longer than one century the trinitarians set up a community there. Afterwards and during the seventeenth century they enlarged the outbuildings and built around the convent. In the thirties of the nineteenth century, on the occasion of a legally arranged confiscation of the Church assets, the convent was torn down and just the church remained; this turned up into St. James parish church.\nThe street where the church lies is rather narrow, what prevents one from having a good perspective over the church. In spite of that limitation some nice and artistic elements on the main façade can be observed. That gothic style façade consists of three well defined sections separated from one another by elegant semidetached columns topped by two beautiful pinnacles, one for each. The entrance to the temple consists in a monumental portal flanked by two pillars each one of them also ending with a pinnacle. It's a several point arch shaped portal gradually decreasing in size, the outerest one being profusely decorated with foliage whose highest point consists in a fleuron depicting Christ on the Cross. There is also in that part of the façade some sculptural decoration whose more interesting segment is perhaps the pediment reproducing a scene of St. Jacques “Matamoros”. The whole in that portal is of a great beauty thus revealing its elaborate manufacture. The four stained glass windows are also very aesthetic as well as the carving of a flame pointed arch ending with a fleuron. The belfry tower is quite simple. It has an octagonal shape and it's on the left hand side of the building looking at its entrance from across the street. \nOnce inside one can realise that it's a single nave church. The nave in question is considerably high, and it's covered with a ribbed vault. The side chapels, constructed in the XVI century, communicate with each other through semicircle arch passages. The vaults of those chapels are arris ones. Over the side chapels there is an upper storey looking onto the central nave through large cemicirulars arches having a stone balustrade on their lower parts. The temple is a Latin cross church, the chancel being raised several steps above the nave, and it's there where a large gilded reredos is located. This is a splendid meticulously elaborated gothic altarpiece which partly conceals the little rose window behind. Over the crossing there is a large ribbed dome, which is the highest point at the center of the building, with a octagonal shaped base and a skylight.\nIt could be upheld that the church concerned is not a extaordinary monument, apart from a few details such as the stated altarpiece and the portal in the main façade. Notwithstanding that it can't be denied that the visit thereof may turn up to be interesting. Among other things, that may let one observe the coexistence of the gothic exterior with the neoromanesque and partly gothic inner part, and learn a little about the church history, which is related to some historical events having somehow had an impact on the Barcelona urban environment. Moreover, when there is no service or large groups moving around the church interior is very peaceful thus enabling visitors to relax for a while before possibly contiunuing their tour.", "publishedDate": "2019-07-21", "language": "en", "rating": 4}, {"id": 632602807, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d3139274-r632602807-Iglesia_de_San_Jaime-Barcelona_Catalonia.html", "text": "Very nice church. You can spent some time in this silent place and have a rest of the loud city. The architecture is very beautiful", "publishedDate": "2018-11-11", "language": "en", "rating": 5}, {"id": 627478618, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d3139274-r627478618-Iglesia_de_San_Jaime-Barcelona_Catalonia.html", "text": "Iglesia De San Jaime is a beautiful old church located in the wonderful Gothic Quarter  ( Barri Gótic  ).\nAlthough theres been a religious site on this spot since the Medieval times this particular church is relatively new ,rebuilt in 1823,some serious history attached to it but compared to other churches in Barcelona a mere newcomer, that said it's got a beautiful facade which looks interesting, never had time to venture in but will on our next holiday to Barcelona. \nEasy to locate on Carrer Ferran in the magnificent Gothic Quarter were you will find all manner of interesting styles of architecture. \nWell worth checking out. ", "publishedDate": "2018-10-23", "language": "en", "rating": 5}, {"id": 626685262, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d3139274-r626685262-Iglesia_de_San_Jaime-Barcelona_Catalonia.html", "text": "The church Sant Jaime is open and you walk in directly from the street - no admission. There were an open ceremony.", "publishedDate": "2018-10-20", "language": "en", "rating": 3}, {"id": 413489618, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d3139274-r413489618-Iglesia_de_San_Jaime-Barcelona_Catalonia.html", "text": "Lovely church in the centre of the city. Garden was lovely and is a nice place to sit if you want a rest from the hustle bustle of the town. The tower is a good climb to the top. Once you get there the views of Barcelona are stunning.", "publishedDate": "2016-09-01", "language": "en", "rating": 5}, {"id": 362638041, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d3139274-r362638041-Iglesia_de_San_Jaime-Barcelona_Catalonia.html", "text": "One of the most intriguing churches we visited during our trip. I was very impressed with the interior and architecture. Wasnt your standard church/cathedral open to tourists; far more quiet and reverand. Well worth a visit.", "publishedDate": "2016-04-08", "language": "en", "rating": 4}, {"id": 340660376, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d3139274-r340660376-Iglesia_de_San_Jaime-Barcelona_Catalonia.html", "text": "The church is located near the square that is named after it. There was a church here since the medieval times but it was demolished and rebuilt again in 1823 when this whole area was reconstructed to enlarge the way to the city hall.", "publishedDate": "2016-01-17", "language": "en", "rating": 4}, {"id": 329596801, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d3139274-r329596801-Iglesia_de_San_Jaime-Barcelona_Catalonia.html", "text": "As catholic churches go, this one if pretty plain.  Very little ornamentation or statues.  The walls have a cinder block look.  That being said, it's a quiet, restful, pleasant little church.  The highlight for me was a ceramic blue, green and yellow frame behind a virgin mary statue.  Not worth a detour but always we always step into churches when passing and it was worth a quick peek.", "publishedDate": "2015-11-28", "language": "en", "rating": 3}, {"id": 267614984, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d3139274-r267614984-Iglesia_de_San_Jaime-Barcelona_Catalonia.html", "text": "Nice little church near the centre of the barrio gotico. It is worth thd visit inside. On the right they have the trone of Madonna in the same style as the sagrada familia.", "publishedDate": "2015-04-23", "language": "en", "rating": 3}]}}]