[{"locationId": 2394734, "name": "Parque del Laberint d'Horta", "placeType": "ATTRACTION", "reviewListPage": {"reviews": [{"id": 750144377, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d2394734-r750144377-Parque_del_Laberint_d_Horta-Barcelona_Catalonia.html", "text": "We thought it looked further away on the map than it actually was. We even asked a local where it was when we came out the metro station and she pointed out a great huge hill across the road to the left and we thought that's too far! But we went back into the underpass and found a street sign pointing to the right of where she suggested so essentially it was just a little  bit along the street and up behind a building. It is supposed to be for kids but we as big kids wanted to try it. Apart from the disgusting toilets in the park itself it was quite a nice park. The maze was the main attraction for us.", "publishedDate": "2020-03-09", "language": "en", "rating": 3}, {"id": 729567021, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d2394734-r729567021-Parque_del_Laberint_d_Horta-Barcelona_Catalonia.html", "text": "Lovely park with beautiful ornaments from the past. A bit of a shame that the laberinth was closed for maintenance. But even than it was stil a pretty green spot in the City", "publishedDate": "2019-11-28", "language": "en", "rating": 5}, {"id": 727609864, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d2394734-r727609864-Parque_del_Laberint_d_Horta-Barcelona_Catalonia.html", "text": "The sun was shining bright in Barcelona on a beautiful summer morning. She unknowingly hopped on the back of a bright red Vespa as we sped out of town. Little did she know, her life was about to change.\n\nIt was Sept 3rd, 2019 and we were headed to Parc del Laberint d'Horta in Barcelona Spain. It was day three of our eleven day adventure. The country, the city, the beautiful garden and of course, the ring. She didn't see it coming, but I had it planned for months. \n\nI had been going back and forth with my photographer for weeks on deciding the perfect location for my surprise proposal. I wanted a quiet place with a beautiful setting and backdrop. I'm so happy I picked this place as I could not see it beforehand. Coming from the USA, all I had was the internet and social media as my set of eyes.\n\nThe park itself costs roughly $3 per person to get in and it's worth every penny. The gardens are exquisite, the labyrinth was fun and the flowers were in perfect bloom.\n\nWithout giving away all the details of this cozy park, I would mark it off as a must-do when in Barcelona. It would be a great park for a nice lunch or a quite stroll away from the hustle and bustle of the city.", "publishedDate": "2019-11-19", "language": "en", "rating": 5}, {"id": 716978734, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d2394734-r716978734-Parque_del_Laberint_d_Horta-Barcelona_Catalonia.html", "text": "It's a great way to spend your evening or morning. I highly recommend it. It only cost 2,5€. You will need at least 1hour and half to see the whole park with the gardens, the statue if Diana, the labyrinth and the buildings. Some of them were closed and not yet renovated.\nWorth visiting", "publishedDate": "2019-10-10", "language": "en", "rating": 4}, {"id": 715497309, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d2394734-r715497309-Parque_del_Laberint_d_Horta-Barcelona_Catalonia.html", "text": "Cute little park with hidden gems and roads to walk! The labyrinth was cool to try, harder than imagined..\nRemember to bring cash, they don’t take card!", "publishedDate": "2019-10-05", "language": "en", "rating": 3}, {"id": 714498490, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d2394734-r714498490-Parque_del_Laberint_d_Horta-Barcelona_Catalonia.html", "text": "We loved this park. Great fun in the maze- cool and calm vistas and lovely shady walks. Nice to get away from hustle and bustle of city and worth the trip out. Visited at the weekend so lots of locals enjoying the space which was fun to see. Took the V21 bus back to town which was fab as it took us through lots of local towns/ villages.", "publishedDate": "2019-10-01", "language": "en", "rating": 5}, {"id": 713647231, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d2394734-r713647231-Parque_del_Laberint_d_Horta-Barcelona_Catalonia.html", "text": "This was the first place we visited in Barcelona and by the end of our stay remained one of our favourites. Do the left side (wild section) of the park first, it's less exciting that the main formal areas but still really worth seeing - we saw wild boars and lizards, and there's a nice natural waterfall. It's not a huge gardens but that's because it's so packed full of things to see, there's something new at every turn. Took us 60-90 mins at a brisk pace but you could easily spend 2-3 hours seeing everything ", "publishedDate": "2019-09-28", "language": "en", "rating": 5}, {"id": 696091371, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d2394734-r696091371-Parque_del_Laberint_d_Horta-Barcelona_Catalonia.html", "text": "Omg we finally got into a Laberint. Its all you have dreamt of, “one way streets”, mind-**cks and a certificate of passing the Laberint at the end. Well, that last thing is not true but I wish it was!\nEntrance only 2eur and you get to relax in a big park too.", "publishedDate": "2019-08-06", "language": "en", "rating": 5}, {"id": 694757810, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d2394734-r694757810-Parque_del_Laberint_d_Horta-Barcelona_Catalonia.html", "text": "Never seen a labyrinth as big as this one (even though I haven't seen a lot of labyrinths). If you like parks, this one should definetely be on your list.", "publishedDate": "2019-08-01", "language": "en", "rating": 4}, {"id": 689302976, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d2394734-r689302976-Parque_del_Laberint_d_Horta-Barcelona_Catalonia.html", "text": "We really had fun! The park is free in certain days and we were lucky enough to get a free entry on Wednesday so I’d say Wednesday is free access. Some area were not accessible but let me just say that the labyrinth itself is enough. It was a very hot day and it took us more than 20 mins to figure out how to get to the middle of the labyrinth where there’s a statue of Eros. From there it was so funny to finally find the way out. Part of the labyrinth is not fully covered by trees so you can actually see what’s next, but see it doesn’t mean you know how to get there! We had so much fun and I’d recommend this place for families and whoever likes this kind of things. It’s for free so have fun! ", "publishedDate": "2019-07-13", "language": "en", "rating": 5}, {"id": 681952544, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d2394734-r681952544-Parque_del_Laberint_d_Horta-Barcelona_Catalonia.html", "text": "Myself and my husband, Frank, and our son, Clynt, went here for an afternoon excursion. Much to our delight the park was easy to get to and didn’t require a payment to enter. \n\nWe sauntered up to the hedge maze, we weren’t too worried about getting lost as we are quite the hedge maze aficionados and unfortunately we were let down, we expected a double black hexagon level difficulty hedge maze, among the hardest as classified by the hedge maze association of Western Australia however we would rate this one at a meagre single green triangle, among the easiest we have attempted in our careers. \n\nDespite the let down with the hedge maze we did however enjoy the lovely statues decorating the pathways. We would recommend this park for any would be hedge maze aficionados who don’t quite have the confidence they so desire. \n\nSusan, Frank, and Clynt Matthews ", "publishedDate": "2019-06-16", "language": "en", "rating": 3}, {"id": 678422142, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d2394734-r678422142-Parque_del_Laberint_d_Horta-Barcelona_Catalonia.html", "text": "We were getting worn out of typical sightseeing and needed something to fill the afternoon that didn’t involve a museum. We grabbed the train out to this labyrinth park. It’s a number of stops out, but an easy ride and easy walk from the station. \n\nThere is a really nice playground just before you arrive as well as a little snack stand. We had ice cream and sandwiches and let our kids play for awhile.  You might also consider bringing your own picnic supplies as the one snack shack was the only food option we saw at all between the train and the park. \n\nWe went on a weekday afternoon and though it was not crowded, there were a good amount of other visitors. I imagine it could be quite crowded on a weekend. \n\nReally beautiful place, great photo opps. We walked around for a bit more than an hour after playing at the playground for another the same amount of time. \n\nScooters were not allowed but they kindly held them at the front for us with no charge. \n\nThere are restrooms inside and outside of the park. \n\nOverall, not a must do but worth the visit if you have time and want to do something different. ", "publishedDate": "2019-06-02", "language": "en", "rating": 4}, {"id": 678389495, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d2394734-r678389495-Parque_del_Laberint_d_Horta-Barcelona_Catalonia.html", "text": "The labyrinth is not very large, and in multiple sections the hedges are so threadbare that you can easily see through to the next path. The maze takes about 5 minutes  for anyone to get through, so don't expect anything awesome in that regard. It's not worth going out of your way for if you're a maze enthusiast.\n\nThe rest of the park was in poor repair. The manor house is closed & behind a fence. The water features all had green, stagnant water. A few of the statutes & monuments have been vandalized. We visited on a \"free\" Sunday and there were lots of loud locals, some of them smoking throughout the park, especially in the center of the maze- that was where everyone stopped for a smoke.\n\nDo not take a taxi here, no matter what. We did & were stranded for a while afterwards because no taxi company wanted to come out here to pick us up. I hadn't realized how off the beaten path this place was until that happened.\n\nAfter seeing the condition of the park, I understand why it's off the beaten path.", "publishedDate": "2019-06-02", "language": "en", "rating": 2}, {"id": 672278678, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d2394734-r672278678-Parque_del_Laberint_d_Horta-Barcelona_Catalonia.html", "text": "did not end up going in as walked all the way there but with no cash. my friends have said it used to be free. massive queue to pay as well. ", "publishedDate": "2019-05-07", "language": "en", "rating": 1}, {"id": 669244155, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d2394734-r669244155-Parque_del_Laberint_d_Horta-Barcelona_Catalonia.html", "text": "Easily accessible by the Metro, very nice park away from the bustle of the city.  Fun walking through the labyrinth, and wandering around the area.  Very glad we found this, it was a nice and peaceful wind down at the end of our week in Barcelona.", "publishedDate": "2019-04-25", "language": "en", "rating": 5}, {"id": 661940575, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d2394734-r661940575-Parque_del_Laberint_d_Horta-Barcelona_Catalonia.html", "text": "Don't be put off that this park is not easy walking distance from central Barcelona because it is a very easy subway ride, and the stop is just 2 blocks from the entrance.  I echo another reviewer who said there is not much in bloom this time of year, but nonetheless it's a nice park, with a real labyrinth garden that actually does take a bit of time to get through.  Worth the visit.  Pretty nice views of the city too.", "publishedDate": "2019-03-28", "language": "en", "rating": 4}, {"id": 658822257, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d2394734-r658822257-Parque_del_Laberint_d_Horta-Barcelona_Catalonia.html", "text": "A very green place with beautiful sculptures. We had a lot of fun when trying to get out of the labyrinth. Good place to visit.", "publishedDate": "2019-03-16", "language": "en", "rating": 5}, {"id": 656371919, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d2394734-r656371919-Parque_del_Laberint_d_Horta-Barcelona_Catalonia.html", "text": "Not much in bloom in early March: some cyclamen and a touch of forsythia. Nice little rushing creek.  It isn’t that big but the labyrinth maze was not easy to figure out. ", "publishedDate": "2019-03-04", "language": "en", "rating": 3}, {"id": 655753309, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d2394734-r655753309-Parque_del_Laberint_d_Horta-Barcelona_Catalonia.html", "text": "A little bit outside of Barcelona’s center, the Parc del Laberint d’Horta is worth a visit. We got a little lost by ourself in this romantic park. It is very peaceful and quiet. Finding the way through the labyrinth is also a lot of fun. \n\nYou get there by Metro Line L3 (MUNDET). The entrance fee was 2.30€.", "publishedDate": "2019-03-01", "language": "en", "rating": 4}, {"id": 653767102, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d2394734-r653767102-Parque_del_Laberint_d_Horta-Barcelona_Catalonia.html", "text": "Very romantic, unique place to spend a day away from the big City. We had our 10 years wedding anniversary and renewed our vows in this park.", "publishedDate": "2019-02-20", "language": "en", "rating": 5}, {"id": 652090992, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d2394734-r652090992-Parque_del_Laberint_d_Horta-Barcelona_Catalonia.html", "text": "There was less foliiage in the labyrinth and we could see from one alley to the next. With more greens, it would have been better. But, quite serene and worth to spend an hour quietly lazing and walking.", "publishedDate": "2019-02-13", "language": "en", "rating": 4}, {"id": 649301328, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d2394734-r649301328-Parque_del_Laberint_d_Horta-Barcelona_Catalonia.html", "text": "Nice open space of green nature, accompanied by the song of birds and fun to try to get out of the labyrinth, at an affordable price. Recommended to know.", "publishedDate": "2019-01-31", "language": "en", "rating": 4}, {"id": 648979704, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d2394734-r648979704-Parque_del_Laberint_d_Horta-Barcelona_Catalonia.html", "text": "We visited this park on a Wednesday and did not have to pay, but I believe it is very cheap anyway. It is well maintained, lots of little side trails, buildings, flowers, and of course the labyrinth. It was very magical, and I highly recommend it. We also went around 10 or 11 and it was not crowded. You can get some very nice pictures. We took the metro and then you walk just a little bit-as others have described. There is a gradual incline leading up to the park, but the park itself is pretty easy to walk around.", "publishedDate": "2019-01-29", "language": "en", "rating": 5}, {"id": 646067310, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d2394734-r646067310-Parque_del_Laberint_d_Horta-Barcelona_Catalonia.html", "text": "A beautiful garden, a laberynth to discover. Surrounding by the sounds of fountains. Irá a place that times stand still, yours to enjoy.", "publishedDate": "2019-01-15", "language": "en", "rating": 5}, {"id": 633128409, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d2394734-r633128409-Parque_del_Laberint_d_Horta-Barcelona_Catalonia.html", "text": "The park is located far from the city centre thus it is not crowded by tourists. Lovely green area and lots of fountains make you forget about hectic life. I can highly recommend this place to all of you looking for a moment of relaxation close to nature.", "publishedDate": "2018-11-13", "language": "en", "rating": 5}, {"id": 622738676, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d2394734-r622738676-Parque_del_Laberint_d_Horta-Barcelona_Catalonia.html", "text": "In the middle of a crazy-busy tour of Europe and an even busier metropolitan area, the labyrinth at Horta gave me an opportunity to see my three girls (9, 10, 17) simply play.  No iPads, no cell phones, no souvenir shops or tour guides, no gimmicks.  Just an honest game of tag in one of the most charming mazes we have ever seen.  ", "publishedDate": "2018-10-06", "language": "en", "rating": 5}, {"id": 622676313, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d2394734-r622676313-Parque_del_Laberint_d_Horta-Barcelona_Catalonia.html", "text": "I'd always wanted to visit a maze and this, my first, proved I have no sense of direction at all. It took us ages and lots of hysterical laughter at our ineptitude to find the centre. Once we did, we thought we had it sussed. We didn't. It took us just as long to get out!\nSeriously,  we thoroughly enjoyed it but would definintely recommend doing at a cooler times of the day or year.\nThe maze is set in a really pleasant park which is worth a visit for its own sake. It's away from the manic tourist hell that ruins our beautiful city for several months of the year. Take a picnic. There is an open air cafe which we didn't try, but we did use the loos  which were surprisingly clean, so hopefully that says something about the cafe itself!", "publishedDate": "2018-10-06", "language": "en", "rating": 4}, {"id": 621675608, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d2394734-r621675608-Parque_del_Laberint_d_Horta-Barcelona_Catalonia.html", "text": "Nice and peaceful place, a lot of green, great place to escape from the city tempo.\nthe labyrinth is very nice, the kids enjoyed \"getting lost\" in there...\nthe metro gets close the the park (few minutes woking).", "publishedDate": "2018-10-02", "language": "en", "rating": 4}, {"id": 618719296, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d2394734-r618719296-Parque_del_Laberint_d_Horta-Barcelona_Catalonia.html", "text": "Nice way to spend an hour or 2. It stinks that there’s a ton of uphill trekking to get to the place, then the park is set on a hill too. The labyrinth is in the middle and although it’s nice, you can tell it’s heavily visited and has a lot of wear (aka people breaking branches to create holes and cheat at the maze). There’s a nice child’s park and snack booth outside where we spent some time as well.   Nice shady places to sit, a picnic area, bathrooms, a few ponds and a canal. It was nice. ", "publishedDate": "2018-09-22", "language": "en", "rating": 3}, {"id": 610817480, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d2394734-r610817480-Parque_del_Laberint_d_Horta-Barcelona_Catalonia.html", "text": "This is a nice place to walk around and enjoy some peace.  It's pretty and well maintained but really just nice gardens.  I was expecting a castle to explore so I was a little disappointed.  The gardens were beautiful but it may not be worth going way out of your way to visit.", "publishedDate": "2018-08-27", "language": "en", "rating": 4}, {"id": 608722581, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d2394734-r608722581-Parque_del_Laberint_d_Horta-Barcelona_Catalonia.html", "text": "One of the most beautiful green spaces in Barcelona. A big romantic garden with some statuesque points of interest and fun labyrinth. Perfect for a walk!", "publishedDate": "2018-08-21", "language": "en", "rating": 4}, {"id": 607728576, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d2394734-r607728576-Parque_del_Laberint_d_Horta-Barcelona_Catalonia.html", "text": "What a little gem! 10 minute walk from the L3 metro line, absolutely beautiful, not another tourist in sight. Very cheap ( €1.40 an adult) welcome break from the mass tourism of central Barcelona", "publishedDate": "2018-08-18", "language": "en", "rating": 5}, {"id": 604860050, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d2394734-r604860050-Parque_del_Laberint_d_Horta-Barcelona_Catalonia.html", "text": "After a failed attempt at visiting parc guell (too busy and didn’t get tickets in advance) we got back on the metro and headed to mundet metro station. This parc was around 5 minutes walk from the station, and at 10am we were the only people there. \nIt was beautiful, very quiet, very peaceful. We really enjoyed finding our way through the maze - my daughter made us do it twice. \nWe spent much longer here than I thought we would, and would definitely recommend it to anyone visiting Barcelona. ", "publishedDate": "2018-08-09", "language": "en", "rating": 5}, {"id": 603400533, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d2394734-r603400533-Parque_del_Laberint_d_Horta-Barcelona_Catalonia.html", "text": "This is a beautiful park! You find it off of the usual tourist beaten track, making it a lot quieter than anywhere else you visit. However, if you want to visit somewhere a little quieter then this is a must see park! Myself and my boyfriend loved walking through the grounds, and the labyrinth is good fun too. We actually saw a wild boar wandering through the bushes at one point! \nIt’s easy to get here, no more than 10 min walk from the Mundet metro station (L3/green line). I would go as far to say this was my favourite site in Barcelona due to the beauty and peace of the gardens! We spent a good couple of hours wandering around. Entry is free on a Sunday! There is also limited food/water selection (the little cafe was open on the Sunday but unsure the rest of the week, so I’d recommend a picnic if you plan to stay for a long time!)", "publishedDate": "2018-08-06", "language": "en", "rating": 5}, {"id": 603107613, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d2394734-r603107613-Parque_del_Laberint_d_Horta-Barcelona_Catalonia.html", "text": "Finding our way to the centre of the labyrinth took about 45min. I loved every second of it and deliberately went another way to find our way out.\n\nThe maze covers a much larger area than I'd anticipated and is surrounded by gardens, picnic lawns, an adventure playground, historic buildings, magnificent architecture and even a small (alcohol-free) café.\n\nPlenty of car parking spaces: but why bother? The Metro's only a few minutes away!", "publishedDate": "2018-08-05", "language": "en", "rating": 5}, {"id": 602788665, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d2394734-r602788665-Parque_del_Laberint_d_Horta-Barcelona_Catalonia.html", "text": "I rented a car and drove with my teen son to the park, and had a little trouble finding it. However we parked were the GPS indicated, and after walking for a few minutes around the area we found the park entrance. The park is spectacular, very well kept. We took beautiful photos, and went through the maze. It was fun, and we enjoyed being a little lost in trying to exit! We didn't explore the park in its entirety since we had another stop to make (children's museum) before our drive to Cerdanya (Pyrenees mountains, hot air balloon ride the next morning), but the time we spent there was well worth it. Our visit to the park/laberinth was one the best highlights of our trip to Barcelona for our Mediterranean cruise, although we loved everything else too!", "publishedDate": "2018-08-04", "language": "en", "rating": 5}, {"id": 602486970, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d2394734-r602486970-Parque_del_Laberint_d_Horta-Barcelona_Catalonia.html", "text": "Accessible via metro, 10-12 mins walk then\nAmazing park\nReal and true nature\nWorth the FREE visit!!\nA must here, total activity takes 1-2 hours if you walk there, more if you pic-nic", "publishedDate": "2018-08-03", "language": "en", "rating": 5}, {"id": 593350522, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d2394734-r593350522-Parque_del_Laberint_d_Horta-Barcelona_Catalonia.html", "text": "22 acres and a max of 750 people in the park at any given time.  its so peaceful and beautiful.  many of the flowers were just starting to bloom so it will be incredible in August.  lots of shady spots and a nice breeze blowing through,  really peaceful and a great walk about. we spent about 2 hour there just walking around.  will go back for sure. really lovely!  free on wednesday and sunday but only  2.3 eu to get in and probably more crowded on the free days.", "publishedDate": "2018-07-05", "language": "en", "rating": 5}, {"id": 591096744, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d2394734-r591096744-Parque_del_Laberint_d_Horta-Barcelona_Catalonia.html", "text": "We enjoyed the labyrinth, even though we sucked at navigating through it. The place was easy to reach by taking the metro to L3: Mundet, then walking about 300 meters to reach the sports stadium (park is located next to it). From the entrance it's another 400-500 meter walk to the labyrinth. Admission is a bit over 2 euros per person, cash only.", "publishedDate": "2018-06-27", "language": "en", "rating": 4}, {"id": 591020120, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d2394734-r591020120-Parque_del_Laberint_d_Horta-Barcelona_Catalonia.html", "text": "Something about this Park is magical. The history is captivating, I suggest doing a little quick read before visiting. I doubt a guide is needed here, the important this is understanding thatthis park was used as an amusement for visitors and guestsbefore it was open to public. Themes evolve around life and death. The labyrinth was quite entertaining. Many spots in the park to relax and admire the works whilst enjoying a nice breeze. Entrance weekdays are €2.5 and I believe Sundays are free. ", "publishedDate": "2018-06-26", "language": "en", "rating": 5}, {"id": 589881259, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d2394734-r589881259-Parque_del_Laberint_d_Horta-Barcelona_Catalonia.html", "text": "This was a FABULOUS find!  Not flooded with tourists or visitors so it really felt like we stumbled upon something magical. Great hike involved so do dress appropriately. Fantastic opportunity for photo-taking. Great way to escape the city a bit and find yourself in some wilderness. Cool breezes coming through did make the heat way more bearable as well. Easily accessible via Metro.  ", "publishedDate": "2018-06-22", "language": "en", "rating": 5}, {"id": 588056696, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d2394734-r588056696-Parque_del_Laberint_d_Horta-Barcelona_Catalonia.html", "text": "This is a nice place to relax out of the city. \nJust a 10 minuets walk from Mundet metro station. \nVery recommend with kids. Have a nice maze. \nOn Sundays it’s free...", "publishedDate": "2018-06-17", "language": "en", "rating": 5}, {"id": 586719702, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d2394734-r586719702-Parque_del_Laberint_d_Horta-Barcelona_Catalonia.html", "text": "Went with a couple locals and had a relaxing afternoon. The walking paths were shaded and were welcome after dealing with the mid-afternoon heat. The buildings are beautiful and you might catch a wild boar digging through the trash. Totally unexpected.", "publishedDate": "2018-06-11", "language": "en", "rating": 5}, {"id": 586363459, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d2394734-r586363459-Parque_del_Laberint_d_Horta-Barcelona_Catalonia.html", "text": "Our guide told us that this expansive and opulent garden was once privately held, a place to entertain and impress guests.  The Park revolves around two themes, life and death.  The planting’s, sculptures and water features are impressive in their own right, but when combined truly reflect the joy of living and the mourning of death.  We were very pleased to have this park as part of our concierge tour in Barcelona ", "publishedDate": "2018-06-10", "language": "en", "rating": 5}, {"id": 585675336, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d2394734-r585675336-Parque_del_Laberint_d_Horta-Barcelona_Catalonia.html", "text": "This is worth the trip, this is a lush oasis on the outskirts of Barcelona. The nearest metro station is Mundet.\n\nThe gardens are cool in the shade and the historical setting ensures the most beautiful views and vistas.\n\nThe gardens are well managed without being fussy. \n\nWe arrived at 10.00am very good start to the day, as the rest of it was very hectic.", "publishedDate": "2018-06-06", "language": "en", "rating": 5}, {"id": 585086113, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d2394734-r585086113-Parque_del_Laberint_d_Horta-Barcelona_Catalonia.html", "text": "Our friend who is a local recommended this park to us over Parc Guell. We did both parks in the same day and while Parc Guell is definitely worth seeing, this Parc is special and definitely worth the ride. \n\nTo get here we took a taxi from Parc Guell and our driver remarked that he'd been driving a cab for years and had never heard of this park!\n\nBut this place is so beautiful and so worthwhile. It's absolutely gorgeous, lots of roman inspired gardens and architecture. We loved it! Plus the nature features, there are streams and waterfalls. WE SAW A WILD BOAR. I went into the Pyrenees and didn't even see a wild boar there! So neat.\n\nThe real star of this park is the labyrinth and it's no joke! \n\nI walked in super arrogant, claiming I knew the secret to get out of any maze! Whining that it's barely a maze if you don't get to choose your own path. But 20 minutes later I was still in the maze and real cranky about it.\n\nLooking back, it was so fun!\n\nIt is hard to get a taxi out of the park back to the city though, I'd recommend taking the metro.", "publishedDate": "2018-06-04", "language": "en", "rating": 5}, {"id": 584792566, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d2394734-r584792566-Parque_del_Laberint_d_Horta-Barcelona_Catalonia.html", "text": "Beautiful, romantic and relaxing park.\n\nThe labyrinth is fantastic and on Sunday everything is gratis...which makes it a bit crowdy.\n\nDefinetely one of the top 20things to do in Barcelona!", "publishedDate": "2018-06-03", "language": "en", "rating": 5}, {"id": 584003924, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d2394734-r584003924-Parque_del_Laberint_d_Horta-Barcelona_Catalonia.html", "text": "My first thought is to review this as a 1 star, only so it can remain semi-private.  However it is only fair to the upkeep of the park I share this treasure.  My recommendation would be bring a lite picnic and plan to escape from the Gaudi, crowds, did I say escape from the crowds.  Here it really is possible.  Explore waterfalls, foilage, canals and the Labrynith. ", "publishedDate": "2018-05-30", "language": "en", "rating": 5}, {"id": 582104413, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d2394734-r582104413-Parque_del_Laberint_d_Horta-Barcelona_Catalonia.html", "text": "In Barcelona there are a lot of museums or parks which are free of charge during first Sunday in the month. Parc del Laberint d'Horta is one of them. It can be easily reached by metro line L3 and you have to get off the metro line at Mundet stop. Ten minutes walk from there is your final destination. Park is really suitable also for families with children. This place has very romantic atmosphere and you can relax in the shade of tree trunks. There is no bar or restaurants in the park so you can bring something of your own and make picnic there. A few of lawns are protected and you cannot walk there. So try find romantic place and breath the peaceful atmosphere as we were. From us this nice place is fully recommended.", "publishedDate": "2018-05-22", "language": "en", "rating": 4}, {"id": 581279460, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d2394734-r581279460-Parque_del_Laberint_d_Horta-Barcelona_Catalonia.html", "text": "The place is away from all the hustle of downtown Barcelona, yet easy to reach, a 10 minutes walk from Mundet metro station. Can easily be combined with other sights in the Northern part of the city: Cosmocaixa, Bellesguard Tower and Reial Monestir de Santa Maria de Pedralbes. to make up a beautiful day. \n\nThe hedge maze is funny, but don't expect to be lost for long, it is small. However the whole park is beautiful and serene.", "publishedDate": "2018-05-19", "language": "en", "rating": 5}, {"id": 576877049, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d2394734-r576877049-Parque_del_Laberint_d_Horta-Barcelona_Catalonia.html", "text": "The park is close to the metro station but there are many slopes and steps.  The views are wonderful, though it is tempting to wonder why a few of the trees had not been trimmed.  Surely it was set out so you could see the city and the sea not just glimpses through the trees.  The maze is fun, and the temples picturesque.  A little treasure.", "publishedDate": "2018-04-30", "language": "en", "rating": 4}, {"id": 576091490, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d2394734-r576091490-Parque_del_Laberint_d_Horta-Barcelona_Catalonia.html", "text": "The Labyrinth Park of Horta, sometimes named Jardins (Gardens) del Laberint d'Horta) is a historical garden in the Horta-Guinardó district in Barcelona and the oldest of its kind in the city. Located on the former estate of the Desvalls family, next to the Collserola ridge, the park comprises an 18th-century neoclassical garden and a 19th-century romantic garden.\n\nMy friend tool me there and I was fascinated by its size and beauty. It’s like a piece of Italy in Spain. Its creators did a wonderful job and the labyrinth itself is unique in Europe I would like to say. The whole garden is a masterpiece of garden architecture and its history very interesting. It might not be on the « must see » sights of any guided tour but it should be. Take a taxi if you don’t want to invest too much time to get there. It’s absolutely worth it. I was stunned by its beauty. ", "publishedDate": "2018-04-27", "language": "en", "rating": 5}, {"id": 571763649, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d2394734-r571763649-Parque_del_Laberint_d_Horta-Barcelona_Catalonia.html", "text": "Great fun for the whole family, this intricate maze will keep kids entertained and active. Adults enjoy the beautiful setting, too! Very inexpensive (cash only, btw) and unique, we got there via Uber, but walked to the train station (easy 10 minute walk to a clean train station/train) to get back into the main part of the city.\nSeems like most tourists don't know about this, as it was very quiet (at a time when the rest of the city was crowded) and a welcome respite. Locals definitely know about it, as there were several local couples on romantic picnics there.", "publishedDate": "2018-04-07", "language": "en", "rating": 5}, {"id": 569150384, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d2394734-r569150384-Parque_del_Laberint_d_Horta-Barcelona_Catalonia.html", "text": "This park is really a hidden gem in Barcelona, a little bit hard to find however when you get there it is really nice to stroll around with or wthout your kids. Bring your own food because even when it was high season the bar or cafe was closed. They limit the amount of visitors by payment visit, however when the quota is touched the personal disappears.", "publishedDate": "2018-03-27", "language": "en", "rating": 5}, {"id": 567921256, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d2394734-r567921256-Parque_del_Laberint_d_Horta-Barcelona_Catalonia.html", "text": "What a treat only 20mins by metro from city centre. A modest admission fee of €2.20 pp. Maze is fabulous and the gardens are very well kept. Nice picnic areas too but a bit early in the year yet.", "publishedDate": "2018-03-21", "language": "en", "rating": 5}, {"id": 567830021, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d2394734-r567830021-Parque_del_Laberint_d_Horta-Barcelona_Catalonia.html", "text": "Without doubt, my favourite attraction/activity in Barcelona! We throughly enjoyed the stunning visuals and nature walks and would without doubt recommend visiting!", "publishedDate": "2018-03-21", "language": "en", "rating": 5}, {"id": 567278213, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d2394734-r567278213-Parque_del_Laberint_d_Horta-Barcelona_Catalonia.html", "text": "I always loved mazes, and this here is a nice one. But all the park os worth the few euros u have to pay to see it. No gaudi here, however", "publishedDate": "2018-03-18", "language": "en", "rating": 4}, {"id": 565512426, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d2394734-r565512426-Parque_del_Laberint_d_Horta-Barcelona_Catalonia.html", "text": "This is a beautiful landscaped park with a full-size maze inside and a lot of little paths, ponds and follies. It's very easy to reach from central Barcelona (right beside a metro stop) but was blissfully free of other tourists. It felt like a very local place to hangout and a lovely place to spend a little time. The entrance fee is under €2.50, a very decent price given the quality of the park. Really glad we discovered this. ", "publishedDate": "2018-03-09", "language": "en", "rating": 5}, {"id": 564306748, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d2394734-r564306748-Parque_del_Laberint_d_Horta-Barcelona_Catalonia.html", "text": "This place is a bit of a hidden gem. It wasn't as crowded as other attractions, probably because it's not as central as others. However, it's still easy to get to on the metro and it's very affordable. Absolutely worth the trip. The maze is beautiful (and fun!) but so are all the grounds, the sculptures, and the views you get from there.", "publishedDate": "2018-03-04", "language": "en", "rating": 5}, {"id": 563256174, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d2394734-r563256174-Parque_del_Laberint_d_Horta-Barcelona_Catalonia.html", "text": "It's so nice, quite and mysterious that your mind is totally relaxed. Have a walk, picnic or read smth. It's an well done park, beautiful designed. I fell inlove! And the ticket is just about 2.50 €. Be sure you will find much more beautiful places then in my photos ;)", "publishedDate": "2018-02-27", "language": "en", "rating": 5}, {"id": 562985408, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d2394734-r562985408-Parque_del_Laberint_d_Horta-Barcelona_Catalonia.html", "text": "If you choose to take public transportation, take note that it is a full-on uphill walk to the gardens. \nEntrance is only around 2 Euros, which is really nice, but be sure to bring someone with you when you go. I went solo and felt kind of awkward being surrounded by all these couples taking strolls through such romantic gardens.\nOther than that, it's absolutely gorgeous. The labyrinth was fun and just challenging enough without becoming frustrating.", "publishedDate": "2018-02-26", "language": "en", "rating": 3}, {"id": 562782714, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d2394734-r562782714-Parque_del_Laberint_d_Horta-Barcelona_Catalonia.html", "text": "Beautiful gardens and mansion (the mansion is not open for visit), located far from the city center but easily accessible by metro. Built at the end of 18th century, the set has an Italian neo-classical, somewhat decadent touch that gives it a romantic feel. If you want to get away from the city buzzle, it is worth a visit (around 1 h). On Sundays it can get a bit crowded so I'd advice visiting on other days.", "publishedDate": "2018-02-25", "language": "en", "rating": 4}, {"id": 562362279, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d2394734-r562362279-Parque_del_Laberint_d_Horta-Barcelona_Catalonia.html", "text": "Easy to get to, about 20 mins from Place De Catalunya by metro get off at the Mundet  stop. Take the right exit and about 5min walk to the park. Lovely Gardens full of interesting things to see pavilions/waterfall/canals/statues/fountains but the highlight is the cypress-tree hedge maze.\nFree entrance on Wednesday and Sunday. We got there 11am on Sunday in Feb and the place was quite but by the time we left was stating to get busy.  There was a small cafe with a good selection of snacks.\nSpent an enjoyable couple of hours. Search it out!!!", "publishedDate": "2018-02-23", "language": "en", "rating": 5}, {"id": 562183683, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d2394734-r562183683-Parque_del_Laberint_d_Horta-Barcelona_Catalonia.html", "text": "Lovely gardens nice and high up so the view is amazing. The sun was out which made the visit even better. Metro nearby. When we went one part was shut off which was annoying, however, I believe it opens in the summer but through a closed gate, it looked pretty. Very cheap. Worth the visit. Also not too far from the funicular if wanting to visit Tibadio. ", "publishedDate": "2018-02-22", "language": "en", "rating": 4}, {"id": 557021640, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d2394734-r557021640-Parque_del_Laberint_d_Horta-Barcelona_Catalonia.html", "text": "Less than half an hour from center of the city. As for me is the most romantic point in lovely Barcelona. Historical spirit, amazing architecture and offcourse garden. Mountains steps create unique topology. Trees produce pure oxygen and fresh air)) Imho the Marcis house should be reinnovate, imressive building but closed for visit. Would like to listen classical music in the dHorta, imagine how thats will be great in the park iterior))) mandatory will come back!", "publishedDate": "2018-01-28", "language": "en", "rating": 5}, {"id": 554457884, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d2394734-r554457884-Parque_del_Laberint_d_Horta-Barcelona_Catalonia.html", "text": "Not far away from the city center, straight metro line L2. The entrance is free on Wednesdays and Sundays, not crowded (January), but still not empty. Labyrinth is lit, should be in to-do-list if you have some free time in Barca", "publishedDate": "2018-01-17", "language": "en", "rating": 5}, {"id": 553107376, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d2394734-r553107376-Parque_del_Laberint_d_Horta-Barcelona_Catalonia.html", "text": "Not a very populated spot, probably because it is free. But that should not reduce any of its worth. Is a beautiful garden dotted with sculptures, with some great views of Barcelona from over the hedge.", "publishedDate": "2018-01-11", "language": "en", "rating": 4}, {"id": 552007414, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d2394734-r552007414-Parque_del_Laberint_d_Horta-Barcelona_Catalonia.html", "text": "A little bit far from city center ;)) \nBut worth it. If you like to relax in nature here is the perfect spot. Free to visit", "publishedDate": "2018-01-06", "language": "en", "rating": 5}, {"id": 551980041, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d2394734-r551980041-Parque_del_Laberint_d_Horta-Barcelona_Catalonia.html", "text": "One can easily get there with the metro line L3 towards Trinitat Nova ( get off at the Mundet stop). Then a 5 minute walk.\nPark is lovely. It has cute little ponds with gold fish, turtles and a couple of tiny bridges. \nBut the most interesting thing  is the maze. It's loads of fun, not that big, but you easily get lost in it!\n", "publishedDate": "2018-01-06", "language": "en", "rating": 4}, {"id": 551450027, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d2394734-r551450027-Parque_del_Laberint_d_Horta-Barcelona_Catalonia.html", "text": "The maze was great fun for all of us. Many interesting old buildings and statues on the property. Easy to reach by metro. Well worth a visit.", "publishedDate": "2018-01-04", "language": "en", "rating": 5}, {"id": 545620867, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d2394734-r545620867-Parque_del_Laberint_d_Horta-Barcelona_Catalonia.html", "text": "Went here on Tuesday 28/11. Took sandwiches  and wine in case we got lost in the maze!! Unfortunately it was closed for repair. Had a walk round the park which was nice and think it would be a good visit in the summer months.\nQuite a bit out of the city centre but metro L3 takes you close.", "publishedDate": "2017-12-06", "language": "en", "rating": 3}, {"id": 545094409, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d2394734-r545094409-Parque_del_Laberint_d_Horta-Barcelona_Catalonia.html", "text": "Visited here 28/11 only to find the maze was closed due to restoration work. Went round the gardens which were quite nice. \nI think it would be a good relaxing couple of hours if the maze was open. Took sandwiches and wine all the way up there, and all the way back.\nWorth a visit in the summer.", "publishedDate": "2017-12-04", "language": "en", "rating": 3}, {"id": 544692614, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d2394734-r544692614-Parque_del_Laberint_d_Horta-Barcelona_Catalonia.html", "text": "€2.23 to enter the maze. It was my first maze ever so it was pretty fun to go around and get lost in the dead ends. ", "publishedDate": "2017-12-02", "language": "en", "rating": 5}, {"id": 537727260, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d2394734-r537727260-Parque_del_Laberint_d_Horta-Barcelona_Catalonia.html", "text": "A little out of the main city, but easily assessable via metro and worth the visit. The grounds are well kept and the maze is quite fun. Very few people around so it's a great place to relax and/or take photos. ", "publishedDate": "2017-11-01", "language": "en", "rating": 5}, {"id": 532366448, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d2394734-r532366448-Parque_del_Laberint_d_Horta-Barcelona_Catalonia.html", "text": "Located just a few miles outside Barcelona the Parque del Laberinto de Horta should figure into the schedule of any visitor looking to spend a few days outdoors, a mere 2.23Euro admission fee giving guests full access to the grounds containing many sculptures, a moat and tons of foliage including a fairly complex hedge maze that will see persons of all ages reach mostly dead ends before finally getting to the finish.", "publishedDate": "2017-10-12", "language": "en", "rating": 5}, {"id": 525772493, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d2394734-r525772493-Parque_del_Laberint_d_Horta-Barcelona_Catalonia.html", "text": "2.23 euro admission was a bit odd but it REALLY is worth it as it was a lovely area to walk without having to freak out over pickpockets like the rest of Barcelona.  Nice spot to take photos and a clean toilet with toilet paper at the top.  I think like most people, we ended up here on Monday as Park Guell was closed.  There is free wifi but you need to log into your email to activate a link, which is annoying and old fashioned.", "publishedDate": "2017-09-19", "language": "en", "rating": 5}, {"id": 525246463, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d2394734-r525246463-Parque_del_Laberint_d_Horta-Barcelona_Catalonia.html", "text": "Beautiful place to spend a few hours. There's a neoclassical and a romantic garden. The most famous part is the labyrinth. I don't give 5 stars because of the maintenance problems. On Sunday is free.", "publishedDate": "2017-09-17", "language": "en", "rating": 4}, {"id": 525138672, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d2394734-r525138672-Parque_del_Laberint_d_Horta-Barcelona_Catalonia.html", "text": "Really cool maze, which is harder to get out of then you think! Around the maze it is a very well-maintained park too. It is however a little far out of central Barcelona. It cost about 2 euros per person (adult price) to enter and yes, all in all, a good experience! ", "publishedDate": "2017-09-17", "language": "en", "rating": 4}, {"id": 522512955, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d2394734-r522512955-Parque_del_Laberint_d_Horta-Barcelona_Catalonia.html", "text": "this place is different from those recommended as a top tourist attraction but how wonderful anyway! once you are in Barcelona you should visit this beautiful classic and romantic garden full of plants giving nice shadow in summertime. We walked from the coast, which can be far from someone but the view of the city which belongs to its inhabitants was so very nice to see too  ", "publishedDate": "2017-09-08", "language": "en", "rating": 5}, {"id": 519224916, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d2394734-r519224916-Parque_del_Laberint_d_Horta-Barcelona_Catalonia.html", "text": "We went at 11:00 a.m it was pretty empty,  no lines and no crowd. My kids (12,12, 14) enjoy the place, took a lot of pic.. play in the maze (don't expect too much)the entrance fee is very low and worth the trip. There is nothing much to do there you - one hour top.\nworth visit.  ", "publishedDate": "2017-08-29", "language": "en", "rating": 4}, {"id": 513376148, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d2394734-r513376148-Parque_del_Laberint_d_Horta-Barcelona_Catalonia.html", "text": "The park entry is quite inexpensive. Suitable for people who want to do long walks and site seeing. There is some awesome fish ponds and no matter how good your sense of direction is, you'll still get lost in the labyrinth. There's a very nice coffee shop by the exit where you can sit and have a little snack while the kids enjoy the play area.", "publishedDate": "2017-08-15", "language": "en", "rating": 5}, {"id": 512684931, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d2394734-r512684931-Parque_del_Laberint_d_Horta-Barcelona_Catalonia.html", "text": "Laberinto de Horta is truly worth visiting. I loved not to bump in tourist at each step I was taking as basically in any other place in Barcelona. I loved to smell the pine trees, taking a walk in the garden enjoying the beautiful architecture and having fun finding or way out of the labyrinth. The price for the entrance is ridiculously low, but mind to take cash as payment with card or buying ticket online is not an option yet.", "publishedDate": "2017-08-14", "language": "en", "rating": 5}, {"id": 511914810, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d2394734-r511914810-Parque_del_Laberint_d_Horta-Barcelona_Catalonia.html", "text": "A really cheap day out. Just as you enter there is a great play park for children and a snack shack. The park itself is lovely so much to walk around. It is really cheap, costing €2.23 per adult and children 5 and under are free. The maze is fun. There is lots to walk around. Fountains, forests, old buildings and of course the maze. there are lots of picnic benches just by the entrance. Take a picnic and enjoy an afternoon there. It is away from the city. Mundet is the nearest metro station ( Get to Val de Hebron and then a replacement bus service to Mundet.This until 14/8/17) Recommend this if you wish to escape the city. It's the height of the tourist season and it wasn't busy at all so well off the tourist trail. ", "publishedDate": "2017-08-12", "language": "en", "rating": 4}, {"id": 511865955, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d2394734-r511865955-Parque_del_Laberint_d_Horta-Barcelona_Catalonia.html", "text": "This place is great and most likely you will have it all to yourself.  Go on Wednesday or Sunday and the entrance fee is waved.  Built in 1791, there are plenty of places to get lost in but the best place is in the maze.  A wonderful storybook \"hedge\" maze right out of your fairytales.", "publishedDate": "2017-08-12", "language": "en", "rating": 5}, {"id": 511223306, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d2394734-r511223306-Parque_del_Laberint_d_Horta-Barcelona_Catalonia.html", "text": "Parque del Laberinto de Horta is located quite far from the city center and not very far from Tibidabo. You need to walk to it from Valldaura metro station. The park is very green and beautiful. It has several very nice fountains, and of course, Labyrinth itself with the statues. There were just a couple of people in this park, so you can chill here and have some rest. Entrance to the Park is cheap and costs 2 euro.", "publishedDate": "2017-08-11", "language": "en", "rating": 5}, {"id": 510788337, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d2394734-r510788337-Parque_del_Laberint_d_Horta-Barcelona_Catalonia.html", "text": "If you want to get away from the hustle and bustle of the city and stroll through a truly beautiful garden, then this is the place. We took a taxi to get here and it was a bit out of the way. I want to say it was about 15 Euros from Park Güell. The driver brought us right to the entrance and admission this day was free. A great place to stroll, unwind and take some great photos. Upon leaving, we walked down the hill, past the velodrome to the closest bus stop. As a testament to how good the public transportation is in Barcelona, we were able to take the bus back to our apartment in Eixample. For a dad and two kids from suburban NJ this was a huge victory.", "publishedDate": "2017-08-09", "language": "en", "rating": 4}, {"id": 510646271, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d2394734-r510646271-Parque_del_Laberint_d_Horta-Barcelona_Catalonia.html", "text": "As soon as I got there, I knew this was my favorite place. It's a little out of the way but so worth the trip there. There are so many beautiful parts of this park that are absolutely gorgeous and serene. ", "publishedDate": "2017-08-09", "language": "en", "rating": 5}, {"id": 509373089, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d2394734-r509373089-Parque_del_Laberint_d_Horta-Barcelona_Catalonia.html", "text": "It is a brilliant place and in a lovely part of Barcelona away from the main tourist attractions. Very green and luscious, full of open spaces and lots of tree cover. Definitely worth a visit. The maze was a lot of fun as you have to make your way to the centre of the maze and then out the other side.", "publishedDate": "2017-08-06", "language": "en", "rating": 4}, {"id": 507310586, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d2394734-r507310586-Parque_del_Laberint_d_Horta-Barcelona_Catalonia.html", "text": "Went there on our last days in Barceolna. It was Sunday so the entrance was free. A very beautiful park! There is a maze which was our goal there. It's great fun to walk in it. But in the end the park itself was more interesting. Perfect for a nice family walk or just chilling wirh friends. Really enjoyed it!", "publishedDate": "2017-07-31", "language": "en", "rating": 4}, {"id": 505852917, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d2394734-r505852917-Parque_del_Laberint_d_Horta-Barcelona_Catalonia.html", "text": "A small but pleasant park about 30 minutes metro ride from Barcelona city centre, with a small cafe, fun maze & 'romantic garden' area with a waterfall. Nice to visit if you want to get out of the city for an afternoon. ", "publishedDate": "2017-07-26", "language": "en", "rating": 4}, {"id": 503953874, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d2394734-r503953874-Parque_del_Laberint_d_Horta-Barcelona_Catalonia.html", "text": "near to the city, quite and adventurists place. best part is labyrinth park, we spent there mote then hour trying to find an exit :D ", "publishedDate": "2017-07-20", "language": "en", "rating": 5}, {"id": 503483809, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d2394734-r503483809-Parque_del_Laberint_d_Horta-Barcelona_Catalonia.html", "text": "If you are looking for something to do on a Sunday, the Labyrinth Park is a great way to get out and be surrounded by nature.  The park is free on Sundays and is a nice way to spend an afternoon viewing beautiful fountains, statues, and making your way through the labyrinth. There is a nice view of the city from the top so make your way up there. Pack a lunch and camera and enjoy your surroundings.  If you are in the city for a short time, I'd probably say to pass on this stop, but I definitely do not regret going.    Expect to stay there for about 2 hours.", "publishedDate": "2017-07-19", "language": "en", "rating": 4}, {"id": 501976240, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d2394734-r501976240-Parque_del_Laberint_d_Horta-Barcelona_Catalonia.html", "text": "We escaped the hustle and bustle of Barcelona and spent a couple hours in this beautiful city park. It's a nice escape since most of the park is shaded on such a hot summer day. Romantic architecture, lush greens, cute ponds with coy fish, and to our surprise a wild boar was roaming the park and emptying the trash bins in front of our eyes. Entrance fee is ridiculously cheap for such a beautifully maintained park. (We paid less than 10 euros for a family of five: The kids enjoyed the maze (Labyrinth), which was small but still entertaining.\n", "publishedDate": "2017-07-14", "language": "en", "rating": 5}, {"id": 501892400, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d2394734-r501892400-Parque_del_Laberint_d_Horta-Barcelona_Catalonia.html", "text": "Green, green and again green...there are so many green gardens...green path. you are all around of tall bushes with ideal forms. There is small lakes and birds...and park", "publishedDate": "2017-07-14", "language": "en", "rating": 5}, {"id": 500692136, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d2394734-r500692136-Parque_del_Laberint_d_Horta-Barcelona_Catalonia.html", "text": "This place is amazing, beautiful walks through tree shaded paths, lovely landscaping, fountains and buildings. Plus there is a good sized hedge maze which was fun. It was extremely cheap to get into and was very quiet mid afternoon. A real hidden gem up behind the open Olympic velodrome which you can't get into but can see through the gates and look down to from the park.", "publishedDate": "2017-07-11", "language": "en", "rating": 5}, {"id": 498730661, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d2394734-r498730661-Parque_del_Laberint_d_Horta-Barcelona_Catalonia.html", "text": "a beautiful place with so many flowers, lakes and a lot of greenery\nthe lakes have beautiful waterlilies\nis a peaceful and relax place", "publishedDate": "2017-07-04", "language": "en", "rating": 4}, {"id": 497318615, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d2394734-r497318615-Parque_del_Laberint_d_Horta-Barcelona_Catalonia.html", "text": "Neoclassical park with a cypress tree maze, a terraced pavilion, water features and a picnic area.This was really fun!! More challenging than I expected and I really enjoyed the story that you were looking for love in the center of the labyrinth, ie a statue of cupid. The statue is in a clearing in the center with lots of benches so you can relax for a little bit in the shade. The sun is brutal trying to work the labyrinth. The clearing is a circle with 8 or so paths, one of the paths you just came from. You have to retrace your steps to exit because the other ones lead to dead ends. The rest of the park is very beautiful with roses and ponds. Great place to spend a day and very cheap admission, around 2 euros", "publishedDate": "2017-06-29", "language": "en", "rating": 2}, {"id": 496345182, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d2394734-r496345182-Parque_del_Laberint_d_Horta-Barcelona_Catalonia.html", "text": "We found this park from the recommendation of our tour guide Jordi from Rainbow Barcelona Tours. It was about a 40 minute trip from our hotel in the Gothic District. When we got out of the subway station a wild boar was running around the sidewalk. We made our way to the park which was about a 5 minute walk. The park is very nice and cost around $2.23 Euros. We enjoyed it and saw beautiful views of the city. Highly recommend a trip if you enjoy parks.", "publishedDate": "2017-06-26", "language": "en", "rating": 5}, {"id": 495569790, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d2394734-r495569790-Parque_del_Laberint_d_Horta-Barcelona_Catalonia.html", "text": "This place is definitely off the beaten path, but if you're looking for a way to spend a few hours away from the hustle and bustle of the city, then this is a good way to do so. The park has a small entrance fee, but is very nice to walk around and there are a few old monuments to see. There is also of course the hedge maze, which is not very big or difficult, but still a fun little activity. Unfortunately, when I was there none of the fountains were working/turned on.", "publishedDate": "2017-06-24", "language": "en", "rating": 4}, {"id": 492077008, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d2394734-r492077008-Parque_del_Laberint_d_Horta-Barcelona_Catalonia.html", "text": "We had time to kill so we decided last minute to check the place out. I've honestly been to better, similar places. The labyrinth was cute but it's really more for kids. \n\nUnless you want to kill time, skip this place and go to other attractions on your list.", "publishedDate": "2017-06-10", "language": "en", "rating": 3}]}}]