[{"locationId": 191048, "name": "Barcelona Cathedral", "placeType": "ATTRACTION", "reviewListPage": {"reviews": [{"id": 752240671, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d191048-r752240671-Barcelona_Cathedral-Barcelona_Catalonia.html", "text": "\"La Catedral de la Santa Creu i Santa Eulàlia\" is a Gothic cathedral in the Barri Gòtic district. It is not as well known as \"La Sagrada Familia\", but it is a very beautiful and impressive church. And it is much more than a church, it is an imposing building, worth to visit, even when not religious. It is definitely worth a visit. \nThe interior, with its 3 naves, shines wonderfully in the sunlight and is impressively designed with many decorations and with a lot of love for details. At the Catedral de la Santa Creu i Santa Eulàlia you can find many epochs of European architecture - whether romantic or Gothic.\nBesides everything, the cloister (inner courtyard) with its palm trees, the fountain and the swans is a special impression for me.\n\nThe roof is accessible and can be reached via an elevator at the Porta de Sant Iu. It offers a great view of the city, hinterland and sea. A great sight especially at sunrise and sunset.\nThe bags are checked upon entry and you must wear sleeveless, knee-length clothing. So it takes a few minutes to get to the church.\n\nIn summer on the small square in front of the cathedral spontaneous Catalan dances of the ordinary people take place every Sunday morning (\"'Sardanes\"). A few musicians play Catalan music.", "publishedDate": "2020-04-04", "language": "en", "rating": 5}, {"id": 751753089, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d191048-r751753089-Barcelona_Cathedral-Barcelona_Catalonia.html", "text": "I think that La Sagrada Familia gets most of the attention in Barcelona, but this cathedral deserves more.  Construction began in 1298 and took 150 years to complete!    Different guilds (such as a shoemaker's guild) built their own sections in the church along the sides.  We took an audio tour and got a lot out of it.  We enjoyed the 13 geese in the cloister too.  The ancient walls which surround the cathedral bring to mind a walled city.  It's a very worthwhile stop.", "publishedDate": "2020-03-24", "language": "en", "rating": 5}, {"id": 751317925, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d191048-r751317925-Barcelona_Cathedral-Barcelona_Catalonia.html", "text": "It is a very beautiful case of a gothic cathedral. We visited on the day of Santa Eulalia and hence the Cathedral is dedicated to her, the entrance was free for everyone. \nIt is really beautiful and a must see when strolling arount the Gothic Quarter.", "publishedDate": "2020-03-18", "language": "en", "rating": 4}, {"id": 751142789, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d191048-r751142789-Barcelona_Cathedral-Barcelona_Catalonia.html", "text": "Go with a small group tour and skip the line-up!  We learned so much on this tour and our guide pointed out details we never would have noticed on our own.  Very worthwhile!  Skip the tower visit - it's crowded up there and everyone is jostling for views.  You can find lovely views elsewhere.", "publishedDate": "2020-03-16", "language": "en", "rating": 5}, {"id": 750954111, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d191048-r750954111-Barcelona_Cathedral-Barcelona_Catalonia.html", "text": "Must visit in Barcelona. Entrance fee was eur7 and it was worth it. The facade was beautiful, with delicate decoration details. The interior was even more beautiful with it's high ceiling and arches. Walk around slowly to see its treasures that were few centuries old. After that, take the escalator to go up to the roof to see the bell tower and take in the scene of barcelona from the top. The cathedral also featured a cloister, with a fountain and many geese lounging a round. Feeling calm and peaceful after the visit. ", "publishedDate": "2020-03-15", "language": "en", "rating": 5}, {"id": 750816794, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d191048-r750816794-Barcelona_Cathedral-Barcelona_Catalonia.html", "text": "Wow! Definitely a must see if visiting Barcelona. Unfortunately there was work going on when we visited but you could still appreciate the beauty of the place- very impressive. Please be careful around here, we saw lots of dodgy people so hide your valuables!", "publishedDate": "2020-03-14", "language": "en", "rating": 4}, {"id": 750378507, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d191048-r750378507-Barcelona_Cathedral-Barcelona_Catalonia.html", "text": "So much to look at. So much detail in everything. Only €7 after midday and free before. Well worth a visit. The rooftop walk was a bonus ", "publishedDate": "2020-03-10", "language": "en", "rating": 4}, {"id": 750127613, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d191048-r750127613-Barcelona_Cathedral-Barcelona_Catalonia.html", "text": "Beautiful Gothic church located in the heart of the Gothic Quarter. I arrived on a Sunday just as services were ending so I was unable to visit the interior. I walked all around the exterior which contains several lovely arched doorways. ", "publishedDate": "2020-03-09", "language": "en", "rating": 4}, {"id": 748880409, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d191048-r748880409-Barcelona_Cathedral-Barcelona_Catalonia.html", "text": "Seven euro entrance fee. It is amazing.  Made the mistake of walking the mile plus from the hotel on our first day in Barcelona and were jet lagged. I mention this because there is so much amazing detail to take in that my fatigued brain just couldn’t do it. I would have enjoyed it so much more had I been rested. ", "publishedDate": "2020-03-03", "language": "en", "rating": 4}, {"id": 748516906, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d191048-r748516906-Barcelona_Cathedral-Barcelona_Catalonia.html", "text": "Wonderful place not to be missed! The rooftop has wonderful views across the city. The courtyard has 13 white geese. They are related to the legend of the Saint Eulalia whom this church is named after. She was an early christian who refused to denounce Jesus . For this she was torched 13 times by Romas before she died. When her head was removed, a dove flew out of her neck symbolising her spirit rising to heaven. Originally they used to keep 13 white doves in the church but they made too much of a mess. Therefore they were replaced by geese. ", "publishedDate": "2020-03-01", "language": "en", "rating": 5}, {"id": 747953553, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d191048-r747953553-Barcelona_Cathedral-Barcelona_Catalonia.html", "text": "Stunning Cathedral with access to the walled gardens and roof for great views of the city. Both included in the very reasonable admission price. (7€ Feb 2020) Access to the roof is via a lift.", "publishedDate": "2020-02-27", "language": "en", "rating": 5}, {"id": 747819785, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d191048-r747819785-Barcelona_Cathedral-Barcelona_Catalonia.html", "text": "Wonderful church that lets you walk on the rooftop for great views of the city. You do have to pay to get in, but it's well worth it. They have a beautiful courtyard out back too.", "publishedDate": "2020-02-26", "language": "en", "rating": 5}, {"id": 747356035, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d191048-r747356035-Barcelona_Cathedral-Barcelona_Catalonia.html", "text": "Another amazing architectural feat of Barcelona.  The place is magnificent and the art inside is out of this world.", "publishedDate": "2020-02-24", "language": "en", "rating": 5}, {"id": 746768760, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d191048-r746768760-Barcelona_Cathedral-Barcelona_Catalonia.html", "text": "Best to visit the cathedral in the morning as entrance is free. There is nothing special about this cathedral except it is the only one in Barcelona. The adjoining cloister is interesting. Just about worth a visit. ", "publishedDate": "2020-02-22", "language": "en", "rating": 3}, {"id": 746545244, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d191048-r746545244-Barcelona_Cathedral-Barcelona_Catalonia.html", "text": "Didn't book any skip the lines and glad we hadn't! Walked straight up and in! Toured by ourselves with no guide. Don't believe it was necessary. All the altars have English details to read. Very pleasant visit with no hassle and bustle. Church very calm and lovely place to see. The cloister was been renovated. 45mins sufficient to see everything.", "publishedDate": "2020-02-21", "language": "en", "rating": 4}, {"id": 745867377, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d191048-r745867377-Barcelona_Cathedral-Barcelona_Catalonia.html", "text": "Barcelona cathedral\nFree entry and worth a walk around. Architecturally quite amazing. Lovely stained glass and ornate carvings. Looking up you wonder how it was built. Sombre atmosphere and very worth a look just for the architecture and thought provoking contemplation it brings.   Not perhaps a place to ponder too long with teenagers but still an amazing sight. ", "publishedDate": "2020-02-18", "language": "en", "rating": 5}, {"id": 745304747, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d191048-r745304747-Barcelona_Cathedral-Barcelona_Catalonia.html", "text": "Seven Euros each entrance fee. I don't care for the cliché phrase \"must see\" but this cathedral is truly beautiful, and is a \"must see\" in Barcelona. Fee includes an elevator lift to the rooftop walkways with city viewing areas and nice photo opportunities; but the inside is the most spectacular.", "publishedDate": "2020-02-15", "language": "en", "rating": 5}, {"id": 744275939, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d191048-r744275939-Barcelona_Cathedral-Barcelona_Catalonia.html", "text": "It is unbelievable place which is top-high-must-see place in Barcelona. If you visit Sagrda Familia but not this cathedrall you won't be able to understand how amazing Barcelona is. \nThe entrance's cost is 7 euros perperson, but it woth each penny. From the first step you can smel, see and feel this atmosohere which is making you really cry. I was seatting inside more than 40 min just staring on the centre of this magic place and found myself crying. \nThe walls, ceil and each itch is taking you away to thse times when this place bild. \nAnd the square before this cathedrall is huge and even if you do not ger inside of this building, just seat in front of it and just loook.", "publishedDate": "2020-02-10", "language": "en", "rating": 5}, {"id": 744184429, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d191048-r744184429-Barcelona_Cathedral-Barcelona_Catalonia.html", "text": "We just free & easy walk around the city ,exotic view every alley, suddenly we walk out a large square area , saw this cathedral.. wow ! Lovely ", "publishedDate": "2020-02-10", "language": "en", "rating": 5}, {"id": 744066144, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d191048-r744066144-Barcelona_Cathedral-Barcelona_Catalonia.html", "text": "Absolutely Amazing and BREATHTAKING!!! We just couldn’t get enough we stayed there for hours. You can also go to the top which was very nice as well. \n\nI will definitely be back! A must see...\n\nThe pictures say it all! 😃", "publishedDate": "2020-02-09", "language": "en", "rating": 5}, {"id": 744019254, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d191048-r744019254-Barcelona_Cathedral-Barcelona_Catalonia.html", "text": "This cathedral is inside of the gothic district , make sure you see both day and night view. \n7 euro each admission fee, such a worth just to get to rooftop access, like all bathroom in Europe, bathroom visit cost .50 cents euro. ", "publishedDate": "2020-02-09", "language": "en", "rating": 5}, {"id": 743869469, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d191048-r743869469-Barcelona_Cathedral-Barcelona_Catalonia.html", "text": "Not worth the money (7 euros, + 50 cents to use the restrooms). The inside is impressive but not too different from any cathedral you visit in a random town. It’s not as big or fancy as the one in Seville, which I recommend over this. ", "publishedDate": "2020-02-09", "language": "en", "rating": 3}, {"id": 743679038, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d191048-r743679038-Barcelona_Cathedral-Barcelona_Catalonia.html", "text": "We didn’t take a tour. Just walked in and looked around. It was very cool inside but I was more impressed with the exterior personally. Either way it’s worth a stop. We tried to get in 3 times and failed because there were services but eventually made it. Off to the side is a small but nice courtyard area that is sort of an extension of the cathedral’s interior. Even if you can’t enter the cathedral this is open so you can always see at least that much. ", "publishedDate": "2020-02-08", "language": "en", "rating": 4}, {"id": 743038895, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d191048-r743038895-Barcelona_Cathedral-Barcelona_Catalonia.html", "text": "Beautiful cathedral and excellent example of Gothic architecture. Stunning views from the roof, but perhaps health and safety needs a little more consideration up there due to trip hazards etc. The geese in the cloister were quite a surprise! ", "publishedDate": "2020-02-04", "language": "en", "rating": 5}, {"id": 743020881, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d191048-r743020881-Barcelona_Cathedral-Barcelona_Catalonia.html", "text": "The Cathedral si stunning, so beautiful. It cost only 4 euro to to the rooftop. The view over Barcelona from the rooftop is just amazing, breathtaking. It's definitely a MUST.", "publishedDate": "2020-02-04", "language": "en", "rating": 4}, {"id": 742689529, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d191048-r742689529-Barcelona_Cathedral-Barcelona_Catalonia.html", "text": "Getting to Barcelona is very easy you can fly from many airports and it’s a very quick two hour flight. There is a very efficient Aerobus coach that takes you to the Center of the city in half an hour for €6. There’s two buses A1for terminal 1 & A2 for terminal 2, so easy. There are a wide selection of hotels from budget to Posh and so many restaurant/cafes😁. If you are only there for the weekend get to the cathedral and the food market it’s fantastic just for taking pics but also for eating great food. There is a wide selection of food and drinks from traditional tapas to US fast food of course and the bars stay open till the early hours🍺. The only thing to get used to is the seemingly poor customer service attitude in some establishments where some staff seem a reluctant to serve you🤔. Whatever you do you won’t be disappointed so go soon if you haven’t been yet!😎", "publishedDate": "2020-02-02", "language": "en", "rating": 5}, {"id": 742291966, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d191048-r742291966-Barcelona_Cathedral-Barcelona_Catalonia.html", "text": "Just Wow..... an amazing place to visit, mind blowing. Do not miss out on the rooftop experience!! We thoroughly enjoyed watching the sunset up there! 🌅 ", "publishedDate": "2020-01-31", "language": "en", "rating": 5}, {"id": 741882401, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d191048-r741882401-Barcelona_Cathedral-Barcelona_Catalonia.html", "text": "My family and I went to midnight mass on Christmas Eve, and it was a beautiful experience. Prior to mass, the Song of Sybil is song. Wow! Definitely something I will not forget. Now I want all my future Christmas Eve masses to included this traditional Catalonian chant. \n\nAlso, the cathedral is beautiful and the views from the tower are amazing.", "publishedDate": "2020-01-28", "language": "en", "rating": 5}, {"id": 741616661, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d191048-r741616661-Barcelona_Cathedral-Barcelona_Catalonia.html", "text": "Not only is this cathedral incredible on the inside, but the rooftop walk is amazing! Great views of all around Barcelona!", "publishedDate": "2020-01-27", "language": "en", "rating": 5}, {"id": 739836390, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d191048-r739836390-Barcelona_Cathedral-Barcelona_Catalonia.html", "text": "Cathedral is very central, of walking distance to a lot of nice restaurants and shops and it’s super nice to look at!", "publishedDate": "2020-01-18", "language": "en", "rating": 5}, {"id": 739667922, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d191048-r739667922-Barcelona_Cathedral-Barcelona_Catalonia.html", "text": "Some parts of the Cathedral date back to the 11th century. There are numerous small chapels on the outside walls with ornate statues and painted scenes. Make sure you take the elevator up to the roof for some great city views!", "publishedDate": "2020-01-17", "language": "en", "rating": 4}, {"id": 739533326, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d191048-r739533326-Barcelona_Cathedral-Barcelona_Catalonia.html", "text": "This is a must visit on your trip to Barcelona.  Yes everyone goes to the Sagrada Familia, but this cathedral is right in the Gothic Quarter.  For 11 Euros you can tour this with a wonderfully done audio story of the history of this beautiful and majestic cathedral.  It also has one of the best views of Barcelona from the top of the tower and its breathtaking.  The history, artwork, artifacts in the Cathedral are remarkable. While we were touring, a woman was singing in the most beautiful opera voice and it radiated through the cathedral.  Don't miss it.", "publishedDate": "2020-01-16", "language": "en", "rating": 5}, {"id": 738104224, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d191048-r738104224-Barcelona_Cathedral-Barcelona_Catalonia.html", "text": "Beautiful cathedral, very atmospheric, you can see and feel the history. Very cantral busy location Beware pickpockets, rife throughout city, often work in pairs, one bump and phone gone, they got 2 of ours.", "publishedDate": "2020-01-09", "language": "en", "rating": 5}, {"id": 737317588, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d191048-r737317588-Barcelona_Cathedral-Barcelona_Catalonia.html", "text": "Very nice cathedral in center of Gothic Town of Barcelona. Entry is free but there is a ticket (I think €7 pp) to go upto the Tower (via lift) for the city view. Headset information can be purchased inside the cathedral. Decent enough restaurants outside. ", "publishedDate": "2020-01-06", "language": "en", "rating": 5}, {"id": 737148034, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d191048-r737148034-Barcelona_Cathedral-Barcelona_Catalonia.html", "text": "I loved this cathedral but i think that the entry  should be what ever you want to pay ! not a obligatory fee. its not right!\nthe church is very well maintaing ", "publishedDate": "2020-01-05", "language": "en", "rating": 5}, {"id": 737120829, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d191048-r737120829-Barcelona_Cathedral-Barcelona_Catalonia.html", "text": "Visited for second time after 8 years. Appreciated all that has been built since our first visit . Easy access with buying ticket in line before we left Australia . Visited late afternoon this time as sun setting and the light through the stained glass windows amazing. Definitely a wonderful experience .", "publishedDate": "2020-01-05", "language": "en", "rating": 5}, {"id": 736886054, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d191048-r736886054-Barcelona_Cathedral-Barcelona_Catalonia.html", "text": "When we arrived we thought we could get in for free and we were shocked to see that we had to pay 7€ however we are so glad we did. Not only did that get you into the cathedral it also included the museum and the lift up to the rooftop! Wow! The museum was cultural! The rooftop was amazing! I hate heights but so glad that I went up there!! The photos and the memories will stay with us forever. \nI don’t like the electric candles inside the cathedral\nBut if you go into the cloisters you can buy a real candle and choose an area to light it and say your prayers. \nThe nativity scene was beautiful. \nI would highly recommend paying 7€. \n", "publishedDate": "2020-01-04", "language": "en", "rating": 5}, {"id": 736735076, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d191048-r736735076-Barcelona_Cathedral-Barcelona_Catalonia.html", "text": "We passed by the Barcelona Cathedral while we were visiting Barcelona a few months ago and it looked very interesting, at least from the outside, loved the beautiful architecture, it reminded me a bit of Notre-Dame Cahedral in Paris. There was a huge queue at the entry when we arrived so I guess we were unlucky to arrive when there was an entry few (7€), if we arrived earlier (8 to 12:30 pm) or later (5:45 to 7:45 pm) the entry would have been free. Definitely worth a stop if you are in the area, you can also reach the top for a small fee (3€). ", "publishedDate": "2020-01-03", "language": "en", "rating": 4}, {"id": 736472155, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d191048-r736472155-Barcelona_Cathedral-Barcelona_Catalonia.html", "text": "Beautiful gothic cathedral built over 150 years from May 1298. Entrance is 7 euros and well worth it. The stone and wood works are magnificent. Once inside, you can also buy a ticket to take a lift to go on the roof and enjoy Barcelona from above. Don’t skip it if you are in the gothic quarter.", "publishedDate": "2020-01-02", "language": "en", "rating": 5}, {"id": 736430665, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d191048-r736430665-Barcelona_Cathedral-Barcelona_Catalonia.html", "text": "The Cathedral was on my list of things to see in Barcelona but I had stayed on Passeig de Gracia rather than at a hotel close to it. To my delight, the Basilica was still a walking distance from my hotel and I really enjoyed the walk too. There were decorated tree-lined streets as I walked to the Basilica, with lots of people everywhere, and street musicians performing. There was an antique market next to it on the day I visited, and I enjoyed visiting the market and seeing some antique for sale. This is a lovely Gothic style Cathedral. The architectural details are lovely. There was a long line of people waiting to view the interior when I visited, so I could not go in since I had little time but I plan to return here and spend more time at this beautiful church.", "publishedDate": "2020-01-02", "language": "en", "rating": 4}, {"id": 736369892, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d191048-r736369892-Barcelona_Cathedral-Barcelona_Catalonia.html", "text": "This cathedral has many visitors and it is now necessary to pre-book a ticket to enter.  Don't forget to look up outside for the domestic and mythical gargoyles.", "publishedDate": "2020-01-02", "language": "en", "rating": 5}, {"id": 736048537, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d191048-r736048537-Barcelona_Cathedral-Barcelona_Catalonia.html", "text": "The Cathedral of the Holy Cross and Saint Eulalia, also known as Barcelona Cathedral or Le Seu, is a Gothic Cathedral constructed from the 13th to 15th centuries (7 Euros per person senior admission). This was our first encounter with the elaborate use of gold in altarpieces here and elsewhere in the cathedrals we visited in Spain, as well as the beautifully carved choir stalls.  An elevator and a couple of flights of stairs carried us up to the roof, where we caught our first sight of the towers of La Sagrada Familia. This wasn't as impressive as some of he other cathedrals we visited in Spain but was worth a visit.", "publishedDate": "2020-01-01", "language": "en", "rating": 4}, {"id": 735889472, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d191048-r735889472-Barcelona_Cathedral-Barcelona_Catalonia.html", "text": "Make sure you book the internal viewing before you go. We went on spec and only saw the outside.  They say internally it is stunning.", "publishedDate": "2019-12-31", "language": "en", "rating": 5}, {"id": 735825334, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d191048-r735825334-Barcelona_Cathedral-Barcelona_Catalonia.html", "text": "The audioguide was a bit confusing but there were several signs describing the different parts. I always prefer a person conducting the guiding.", "publishedDate": "2019-12-31", "language": "en", "rating": 5}, {"id": 735640475, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d191048-r735640475-Barcelona_Cathedral-Barcelona_Catalonia.html", "text": "Of course everyone is heading to visit La Sagrada, and they should.. but if you want to visit a beautiful gem burrowed in the heart of the Gothic Quarter go here. No fees, beautiful art and architecture. Tons of great photo ops. And the geese in the courtyard is very cool.\n\nAlso had an XMAS village out front which added to beauty of the season.", "publishedDate": "2019-12-30", "language": "en", "rating": 5}, {"id": 735605195, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d191048-r735605195-Barcelona_Cathedral-Barcelona_Catalonia.html", "text": "This is a must place to visit, it’s absolutely awesome, till you see it in person you can’t explain the experience 😀😀", "publishedDate": "2019-12-30", "language": "en", "rating": 5}, {"id": 735412948, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d191048-r735412948-Barcelona_Cathedral-Barcelona_Catalonia.html", "text": "The church is open during the day as well as the courtyard with the geese. There is a giant shepherd scene set up with a village that you can walk around in. (At christmas)\n\nBarcelona is great off season. Its not.cold.....its like fall weather, a jacket and in the middle of the day you can get away with a t shirt for an hour or two.  No snow. No.crowds (except Sagrada Familia is usually busy and Park Guell.can get crowded)  but if you go early, great time for photographs!\nAlso, restaurants are Next to empty except for Friday and Saturday nights which is the same anywhere. People partying. I went because I just needed to take a de-stressing trip pronto and it was cheap. I had been once in the summer but didn't realize how much I would like it in the winter. \n\nTake advantage of all the must sees because you will be able to.enjoy them and take your time in them.", "publishedDate": "2019-12-29", "language": "en", "rating": 5}, {"id": 735174623, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d191048-r735174623-Barcelona_Cathedral-Barcelona_Catalonia.html", "text": "The Barcelona Cathedral is an old Gothic Cathedral. According to record, Christian baptistry was first established here in the 6th century. Later, it was replaced by Romanesque in the 11th century before it became the current Gothic cathedral. Although this is not the most famous landmark in Barcelona, but it is still the most important cathedral in the Gothic Quarter. The main attractions for the Cathedral are:\ni) The Facade: The carved sculptures and the stained-glass windows at the entrance and the twin towers are stunning. It's particularly picturesque under the sunset.\nii) The Nave and Organ: This 16th-century nave is massive and its arches are looming over its Gothic buttresses and a series of beautiful chapels.\niii) The Choirstalls: The colourful goldern and green choirstall is one of the most beautiful features inside the cathedral. \niv) Centre Crypt: Where it lies 1,327 alabaster sarcophagus of Santa Eulària.\nv) The Christ of Lepanto: Inside this 15th-century chapel, it features the legend who guided the Christian fleet in 16th century battle against the Ottoman Empire.\nvi) The Rooftop: With no extra cost, you can use the lift (i.e. which is behind the Choirstalls, on the left-hand side) to take you to the rooftop to give you a bird's eye view of the beautiful neighbourhood of the Gothic Quarter.\nvii) The internal garden: It's a nice & restful place to visit once you're inside the cathedral. You can also see some gooses, a fountain and some lovely trees inside this 14th-century garden.\nWe had a good time in the cathedral and it's highly recommended if you're nearby.\nTips: \n1) The tickets are sold inside the cathedral so there's no need to go to the unofficial \"tickets office\" (i.e. just outside the cathedral) to purchase tickets. Each ticket cost 7 Euro. \n2) There is a toilet inside the internal garden but it'd cost about 20 or 50 cents. (sorry, I can't remember exactly...)", "publishedDate": "2019-12-28", "language": "en", "rating": 4}, {"id": 734983065, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d191048-r734983065-Barcelona_Cathedral-Barcelona_Catalonia.html", "text": "This has really made me stunned. It was incredible absolutely amazing. You need to go otherwise you will be missing a treat.", "publishedDate": "2019-12-27", "language": "en", "rating": 5}, {"id": 734952630, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d191048-r734952630-Barcelona_Cathedral-Barcelona_Catalonia.html", "text": "Beautiful church. Millions of tourists around here. Historical and Marco. Good tourism place to visit if you are in Barcelona.", "publishedDate": "2019-12-27", "language": "en", "rating": 4}, {"id": 733934243, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d191048-r733934243-Barcelona_Cathedral-Barcelona_Catalonia.html", "text": "A very nice peaceful place for free.\nNot many people and very beautiful. We only paid to get up on the roof... nice view over the old gothic city.", "publishedDate": "2019-12-21", "language": "en", "rating": 4}, {"id": 733466185, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d191048-r733466185-Barcelona_Cathedral-Barcelona_Catalonia.html", "text": "Impressive place to visit Worth visiting inside. Much better ( and more  to see) than inside thank La Sagrada Family", "publishedDate": "2019-12-18", "language": "en", "rating": 5}, {"id": 733218206, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d191048-r733218206-Barcelona_Cathedral-Barcelona_Catalonia.html", "text": "To anyone visiting barcelona please beware my daughter has just had her phone stolen from right in front of us a cafe. Man in a blue short coat and blue baseball cap approaches with a piece of paper and shows it you. Dont understand him and wont take no for an answer then just wanders off, by this time he has stolen the phone that is right on front of you under the paper.  All I can say is I hope it brings him mo joy and karma comes back to bite him. But please beware !!!!!", "publishedDate": "2019-12-17", "language": "en", "rating": 1}, {"id": 733062129, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d191048-r733062129-Barcelona_Cathedral-Barcelona_Catalonia.html", "text": "This Cathedral is likely overlooked because it lacks the fame of other grand cathedrals in Europe and is overshadowed by the incomparable La Sagrada Familia. It is well worth a free visit as it is beautiful and historic. It was also nearly empty on a week day morning and quite serene and peaceful.", "publishedDate": "2019-12-16", "language": "en", "rating": 5}, {"id": 732905291, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d191048-r732905291-Barcelona_Cathedral-Barcelona_Catalonia.html", "text": "My 2019 guidebook said I could check out the inside of the cathedral and that there would be traditional dancing (sardanes) outside the cathedral in the plaza at noon on Sundays. Sadly, I was greeted with a guard and a big \"no tourists\" sign. And no dancing.", "publishedDate": "2019-12-15", "language": "en", "rating": 1}, {"id": 732902484, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d191048-r732902484-Barcelona_Cathedral-Barcelona_Catalonia.html", "text": "You can’t miss this as you walk through the Gothic Quarter. Do yourself a favor and pay the money to go up to the roof. Wonderful view and benches to sit on. Even if you are afraid of heights, it is still very manageable. ", "publishedDate": "2019-12-15", "language": "en", "rating": 5}, {"id": 732452258, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d191048-r732452258-Barcelona_Cathedral-Barcelona_Catalonia.html", "text": "Lovely cathedral easy to find as u get off the aerobus turn round so the bus is on ur right cross over the road and walk straight down and u will come across the cathedral I didn’t go in as I didn’t wanna pay but the Christmas market there was lovely lots of lovely stuff to buy ", "publishedDate": "2019-12-13", "language": "en", "rating": 5}, {"id": 731450016, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d191048-r731450016-Barcelona_Cathedral-Barcelona_Catalonia.html", "text": "Lovely architecture. The best view is looking up at the ceiling from the crypt. It's gorgeous. Don't miss the geese by the cloister!", "publishedDate": "2019-12-08", "language": "en", "rating": 5}, {"id": 731276276, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d191048-r731276276-Barcelona_Cathedral-Barcelona_Catalonia.html", "text": "A beautiful cathedral that everyone needs to add to their list of visits! So very interesting and old style!\n", "publishedDate": "2019-12-07", "language": "en", "rating": 5}, {"id": 731004240, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d191048-r731004240-Barcelona_Cathedral-Barcelona_Catalonia.html", "text": "The first sight is awesome.... the grandeur of this cathedral leaves an impression for sure. However, we were put down a bit when we learnt that we have to pay to enter the Basilica. Well, can't say how prudent it is to ticket a basilica. \nAs for the exterior, it is absolutely majestic.... indeed a work of art. The approach to the cathedral through the Gothic Quarters is in itself an activity that needs a separate mention. A must visit place when in Barcelona.", "publishedDate": "2019-12-06", "language": "en", "rating": 4}, {"id": 730651589, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d191048-r730651589-Barcelona_Cathedral-Barcelona_Catalonia.html", "text": "A lot of people go to Barcelona to visit the Basilica de la Sagrada Familia - but don´t forget to go back in history and visit this impressive building in the center of the city. There is so much art and so much history to be seen - you should go there twice ! \nI went there with students - 17-18 years old - they also were impressed !", "publishedDate": "2019-12-04", "language": "en", "rating": 5}, {"id": 730586239, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d191048-r730586239-Barcelona_Cathedral-Barcelona_Catalonia.html", "text": "It is a really beautiful building ! We stumbled upon this looking for Xmas markets. The markets were average but I am Glad we stopped for some photos. ", "publishedDate": "2019-12-04", "language": "en", "rating": 4}, {"id": 730544404, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d191048-r730544404-Barcelona_Cathedral-Barcelona_Catalonia.html", "text": "Classic European Cathedral, with an altar dedicated to Montserrat, the Black Jesus.  Loctated in the center of the older city, near the waterfront, the Picasso Museum, and Barcelona's excellent metro system.", "publishedDate": "2019-12-03", "language": "en", "rating": 4}, {"id": 730033398, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d191048-r730033398-Barcelona_Cathedral-Barcelona_Catalonia.html", "text": "...but still really beautiful with some really nice patios and gardens. Another fantastic place in Barcelona. ", "publishedDate": "2019-12-01", "language": "en", "rating": 5}, {"id": 729786081, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d191048-r729786081-Barcelona_Cathedral-Barcelona_Catalonia.html", "text": "An impactful church, altars to many saints and detail that is awe inspiring. You can donate at a chosen alter. There seemed to only be the option to pay to get in but it was worth it. We are spiritual but I think anyone would appreciate the sculpture and architecture.", "publishedDate": "2019-11-30", "language": "en", "rating": 5}, {"id": 729783305, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d191048-r729783305-Barcelona_Cathedral-Barcelona_Catalonia.html", "text": "We didn't do any formal tour of this cathedral but found it to be beautiful! If you walk around the Gothic Quarter go in here just to appreciate it. Really a beautiful place!! ", "publishedDate": "2019-11-30", "language": "en", "rating": 5}, {"id": 728887412, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d191048-r728887412-Barcelona_Cathedral-Barcelona_Catalonia.html", "text": "Barcelona Catedral dates to starting in 1298 with building continuing through the centuries.  The facade to this Gothic building was added in the 1889 with the spire added in 1913.  It was built in record time, because it is only a facade.  Look closely at the front and you can distinguish the original building from the facade.  Some say the window over the entrance looks like Darth Vader.\nThere is a crypt beneath the main alter with patron Saint Eulalia who at 13 years old was tortured by the Romans in 1339 for her unwavering beliefs in Catholicism.  She was a shepherd of geese and was tortured 13 ways—hence the 13 geese kept inside just before the exit. \nIt is free to enter between 9 am and about noon and then again between 5 pm and 7 pm otherwise payment is 7 euro each.", "publishedDate": "2019-11-25", "language": "en", "rating": 4}, {"id": 728216015, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d191048-r728216015-Barcelona_Cathedral-Barcelona_Catalonia.html", "text": "The Cathedral of the Holy Cross and Saint Eulalia is a beautiful Gothic church built from thirteenth to fifteenth century with a roof famous for its gargoyles featuring many animals.\nThe stained glass windows are awesome.", "publishedDate": "2019-11-22", "language": "en", "rating": 5}, {"id": 727973244, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d191048-r727973244-Barcelona_Cathedral-Barcelona_Catalonia.html", "text": "Not being a very religious person, it is still very interesting to visit a cathedral that was built so many years ago.   Find it just amazing, that structures like this were built without modern technology.  A reasonable fee for entrance which also includes an elevator ride to the roof for a great view of Barcelona!", "publishedDate": "2019-11-21", "language": "en", "rating": 4}, {"id": 727711641, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d191048-r727711641-Barcelona_Cathedral-Barcelona_Catalonia.html", "text": "It is NOT deaf friendly.  Insufficient English scripts.  No booklet in English language for deaf Americans traveling who cannot hear or lipread Catalan language. A brief descriptive of saints.", "publishedDate": "2019-11-20", "language": "en", "rating": 1}, {"id": 727376941, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d191048-r727376941-Barcelona_Cathedral-Barcelona_Catalonia.html", "text": "The cathedral does not come close to other basilicas. Cathedral is mostly neogothic, quite disjointed, not welcoming. Spend your time exploring the neighborhood instead including churches like Santa Maria Del Mar in neighboring Born.", "publishedDate": "2019-11-18", "language": "en", "rating": 2}, {"id": 727362780, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d191048-r727362780-Barcelona_Cathedral-Barcelona_Catalonia.html", "text": "This cathedral looks amazing. Make sure to visit it. Be aware of shady people in the area though! We some people trying to steal purses.", "publishedDate": "2019-11-18", "language": "en", "rating": 5}, {"id": 727067165, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d191048-r727067165-Barcelona_Cathedral-Barcelona_Catalonia.html", "text": "Visiting in November and after lunch, we were able to tour this beautiful Cathedral with no entry fee and without the crowds. A perfect time to come. However, so popular is Barcelona that, at other times, we might have experienced more difficulties so my advice would be to check the internet before deciding when to make that trip. \n\nThe 14th and 15th century paintings are wonderful.", "publishedDate": "2019-11-17", "language": "en", "rating": 4}, {"id": 726448785, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d191048-r726448785-Barcelona_Cathedral-Barcelona_Catalonia.html", "text": "The Barcelona cathedral is beautiful and the bonus is going on the roof for amazing views of Barcelona! Breathtaking!", "publishedDate": "2019-11-14", "language": "en", "rating": 5}, {"id": 726028156, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d191048-r726028156-Barcelona_Cathedral-Barcelona_Catalonia.html", "text": "Make sure you time your visit to avoid the queues, but in saying that it is free entry between 12 - 5.30pm.  We went about 5pm and had no wait, as the queue moved quickly but once inside we did pay the extra 3E to take the lift to the rooftop, which was worth it.  Great view.  The cathedral also has an internal courtyard with geese, which is something different to see.", "publishedDate": "2019-11-12", "language": "en", "rating": 4}, {"id": 725938917, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d191048-r725938917-Barcelona_Cathedral-Barcelona_Catalonia.html", "text": "This Cathedral is beautiful inside and out! Take the lift to the roof top and get amazing 360 degree views of Barcelona! It's worth the entrance fee!", "publishedDate": "2019-11-12", "language": "en", "rating": 5}, {"id": 725780392, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d191048-r725780392-Barcelona_Cathedral-Barcelona_Catalonia.html", "text": "Barcelona Cathedral, is an experience that you need to go of you like to visit beautiful Cathedrals. Awesome location in the heart of the Gothic Quarter, this was the first place that we visited when we arrive to Barcelona, also we give thanks to God for taking us to Barcelona. You will love it", "publishedDate": "2019-11-11", "language": "en", "rating": 5}, {"id": 725696613, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d191048-r725696613-Barcelona_Cathedral-Barcelona_Catalonia.html", "text": "There are many large cathedrals around Barcelona. In my opinion Cathedral Barcelona is definitely worth a visit. Apart from the humongous size it's detailed Gothic arcitecture is incredible and looking up into the done is a most beautiful site.", "publishedDate": "2019-11-11", "language": "en", "rating": 3}, {"id": 725179961, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d191048-r725179961-Barcelona_Cathedral-Barcelona_Catalonia.html", "text": "Stunning architecture and such a tranquil setting. The detailing is exquisite and timeless despite the age of the building. I would recommend visiting here for sure.", "publishedDate": "2019-11-09", "language": "en", "rating": 5}, {"id": 724940167, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d191048-r724940167-Barcelona_Cathedral-Barcelona_Catalonia.html", "text": "The cathedral is free to visit at certain times of the day and we had a quick free visit while on a free walking tour ( Runner Bean Tours - recommended) \nHowever we decided to return on our own to have more time to explore the church. We paid €7 which included a visit to the rooftop.\nThe guide on the walking tour had informed us about St. Eulalia so we were able to understand some of the carvings. Unfortunately the crypt was closed on our second visit.\nThere is a lift to the rooftop and there was no queue when we visited. On leaving the lift there are some metal stairs and walkways supported on scaffolding but it was very safe. We were able to get up close to some of the interesting masonry carvings and also enjoy the view.\nAfterwards we visited the courtyard with fountains and also 13 white geese ( St. Eulalia was 13 years old when she martyred.", "publishedDate": "2019-11-08", "language": "en", "rating": 5}, {"id": 724806138, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d191048-r724806138-Barcelona_Cathedral-Barcelona_Catalonia.html", "text": "This cathedral has magnificent gothic arts. The gothic and baroque altarpieces is really awesome. The baptistery is a must see. The rooftop has gargoyles as well as domestic and mythical animals.This was constructed around the 13th century and is very well preserved.It is also known as The Cathedral of Holy Cross and St. Eulalia.", "publishedDate": "2019-11-07", "language": "en", "rating": 5}, {"id": 724535846, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d191048-r724535846-Barcelona_Cathedral-Barcelona_Catalonia.html", "text": "Can't say enough about this church it's beautiful and the feeling you get when you are there is different from other churches we visited....out front of the church is a wonderful large square where people are eating at outdoor restaurants or just sitting on the benches talking...a antique market was set up one evening and there are performers dancing and music being played on the steps of the church, just loved this area... recommend seeing it if you are in Barcelona.", "publishedDate": "2019-11-06", "language": "en", "rating": 5}, {"id": 724244935, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d191048-r724244935-Barcelona_Cathedral-Barcelona_Catalonia.html", "text": "The Barcelona Cathedral is beautiful but very dark inside.  It was 7 euros to get in and the audio guide was 4 euros.  I strongly recommend getting the audio guide so you will understand the history of the cathedral, the artwork and architecture. The cathedral has a gorgeous choir with beautifully carved stalls.  There are many side chapels and the high alter is impressive.", "publishedDate": "2019-11-05", "language": "en", "rating": 4}, {"id": 724154085, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d191048-r724154085-Barcelona_Cathedral-Barcelona_Catalonia.html", "text": "Cheapest way to travel around Barcelona is by metro. Just buy the 10 tickets pass for €10.20. Please note it’s for trips within zone 1 which is sufficient to cover most attractions but excludes travelling to airport. Also ticket expires not by date but when all 10 trips are made. \n\nUber withdrew from Barcelona n you’re left with Cabify n Freenow. Downloaded the apps, tried them out but found them to be unreliable...couldn’t get a booking for short trips. Used taxis instead, same fares n more reliable n plentiful. \n\nWhen visiting top tourists sites, book online in advance as there’s a limit to number of visitors permitted n given time slots. \n\nFor Sagrada Família, if able, go in the afternoon like around 3pm depending on season. Reason fo that is to be there when the sun starts to set....the warmer sunlight brings out the best of the stained glass windows. \n\nBe careful of pickpockets, take common sense precautions but it wasn’t as bad as what we anticipated, plenty of police n security personnel around. Enjoy!", "publishedDate": "2019-11-05", "language": "en", "rating": 5}, {"id": 724141698, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d191048-r724141698-Barcelona_Cathedral-Barcelona_Catalonia.html", "text": "Barcelona Cathedral draws lots of tourists in and so also lots of street performers which didn't feel too pushy. As for the cathedral there's a small charge to get in which includes a trip to the roof (via a small lift - queue can be quite long if times badly). A nice little shop is within the grounds and there is lots to look at, worth a visit.", "publishedDate": "2019-11-05", "language": "en", "rating": 4}, {"id": 723857201, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d191048-r723857201-Barcelona_Cathedral-Barcelona_Catalonia.html", "text": "We were in Barcelona for my birthday which fell on a Sunday.  We attended 10:30 am high mass.  It was beautiful with ten priests serving mass and a full choir.  Were able to sit right up front.  When mass is going on tourists are not allowed in the church.  It was quite special.  Beautiful cathedral.  Don't miss it.", "publishedDate": "2019-11-04", "language": "en", "rating": 5}, {"id": 723770664, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d191048-r723770664-Barcelona_Cathedral-Barcelona_Catalonia.html", "text": "as a lover of architecture, it's a tradition to go into the cathedral/abbey of the cities i visit and this definitely didn't disappoint. we booked tickets for the rooftop in advance but unfortunately, the tours were cancelled due to the weather. by far the stand out point for me was the garden, it was beautiful to see nature and architecture come together!", "publishedDate": "2019-11-04", "language": "en", "rating": 5}, {"id": 723593517, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d191048-r723593517-Barcelona_Cathedral-Barcelona_Catalonia.html", "text": "They were closing when we arrived so we could only get a quick look of the interior from the entrance.  However, we did get some great photos of the outside.  The cathedral is very large and beautiful.  It is located in the Gothic Quarter, which has a number of shops and restaurants.", "publishedDate": "2019-11-03", "language": "en", "rating": 4}, {"id": 723441345, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d191048-r723441345-Barcelona_Cathedral-Barcelona_Catalonia.html", "text": "We tend to visit a lot of cathedrals when travel and so this was no exception. Very big and interesting place, though 7eu seemed a little steep. Most churches charge nothing. Anyway, it reminded me a lot of the one in Prague next to the castle.", "publishedDate": "2019-11-03", "language": "en", "rating": 4}, {"id": 723362999, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d191048-r723362999-Barcelona_Cathedral-Barcelona_Catalonia.html", "text": "The Barcelona Cathedral is in the midst of the Gothic Quarter and is fronted by a plaza from which you can stand back and admire the entire facade. The building is beautiful both inside and out. We visited during a free entrance period but did pay €3 each to enter the choir. We also enjoyed seeing the geese in the cloister - 13 of them for each year of Santa Eulalias life (she is the patron saint of Barcelona). Apparently there have been geese here for more than 500 years, an impressive tradition! We spent about 40 minutes touring the cathedral and thought it was well worth the short wait (about 10 minutes) in line outside.", "publishedDate": "2019-11-02", "language": "en", "rating": 4}, {"id": 722909230, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d191048-r722909230-Barcelona_Cathedral-Barcelona_Catalonia.html", "text": "The Barcelona Cathedral is situated in the Gothic QuarTer.  We were enthralled by the chapels inside representing different trades.  Each trade competed with the others to make their chapel the most beautiful.  \n\nThe cathedral is still an active church where you can attend mass if you like. While the Barcelona cathedral does not get as much attention as Sagrada Familia, my husband and I both enjoyed our visit to the Barcelona Cathedral more than our visit to Sagrada Familia.", "publishedDate": "2019-10-31", "language": "en", "rating": 4}, {"id": 722609750, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d191048-r722609750-Barcelona_Cathedral-Barcelona_Catalonia.html", "text": "We have been here during the free visiting hours. It was a shame that we were not allowed to visit the monastery. Definitely worth seeing.", "publishedDate": "2019-10-30", "language": "en", "rating": 5}, {"id": 722347174, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d191048-r722347174-Barcelona_Cathedral-Barcelona_Catalonia.html", "text": "Found this a very moving experience. The inside of the building is just awesome and found the visit to the rooftop just stunning", "publishedDate": "2019-10-29", "language": "en", "rating": 5}, {"id": 722343043, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d191048-r722343043-Barcelona_Cathedral-Barcelona_Catalonia.html", "text": "Really enjoyed our trip to the Cathedral today. Nice to have a look around, it’s very different with so many dedications to so many saints as well as the additional chapels to Saint Lucia.\n\nIt was most enjoyable to watch the sunset from the roof, which was a happy accident of timing. ", "publishedDate": "2019-10-29", "language": "en", "rating": 5}, {"id": 722298713, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d191048-r722298713-Barcelona_Cathedral-Barcelona_Catalonia.html", "text": "This is a nice place to go to.  It is always busy.  We was told by a walking tour that at certain times of the day it is free to enter.  Great photo opportunities.", "publishedDate": "2019-10-29", "language": "en", "rating": 3}, {"id": 720910770, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d191048-r720910770-Barcelona_Cathedral-Barcelona_Catalonia.html", "text": "Entry to this place is free during certain times of day which happened to be when we showed up.  Wonderful building full of gargoyles on the exterior and arches, knaves, etc. inside. Always remove your hat before entering any house of worship.", "publishedDate": "2019-10-24", "language": "en", "rating": 5}, {"id": 720766908, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d191048-r720766908-Barcelona_Cathedral-Barcelona_Catalonia.html", "text": "Towering above the center of the Barri Gòtic district in Barcelona's principal cathedral. The Gothic cathedral's construction began in the late 13th century, though it wasn't completed until the mid-15th century. There are 140 statues of saints that call the cathedral home. There was some concert going on at the front so the front view was blocked. \n\nNot saying it’s must but it’s worth your time. You won’t be disappointed. If you have enough time, highly suggest taking advantage of the opportunity to go to the top of the cathedral on the roof. There, you can get an eyeful of the spire up close as well as some prime city views. Whatever you choose to do, make sure to wear the proper attire. According to recent travelers, the dress code here is strict and knees and shoulders must be covered", "publishedDate": "2019-10-23", "language": "en", "rating": 4}, {"id": 720469726, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d191048-r720469726-Barcelona_Cathedral-Barcelona_Catalonia.html", "text": "Great cathedral. Lots to take in plus a fantastic outside space too in the cathedral. \n\nWell worth a visit.", "publishedDate": "2019-10-22", "language": "en", "rating": 5}, {"id": 719480763, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d191048-r719480763-Barcelona_Cathedral-Barcelona_Catalonia.html", "text": "The line to enter went very quickly on the Friday we were there. It's a fascinating structure but the side chapels were all closed with iron gates and dark.", "publishedDate": "2019-10-18", "language": "en", "rating": 4}, {"id": 718880762, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d191048-r718880762-Barcelona_Cathedral-Barcelona_Catalonia.html", "text": "An amazing cathedral in the center of Barcelona. The Cathedral of the Holy Cross and Saint Eulalia, also known as Barcelona Cathedral, is the Gothic cathedral . This picturesque cathedral has a beautiful facade and a fascinating history. The cathedral was constructed from the thirteenth to fifteenth centuries, with the principal work done in the fourteenth century. The cloister, which encloses the Well of the Geese  was completed in 1448. The body of Saint Eulalia is entombed in the cathedral's crypt.The cathedral has a secluded Gothic cloister where 13 white geese are kept, the number explained by the assertion that Eulalia was 13 when she was martyred.  Be sure to visit the cathedral, its interior, the cloister and be sure to go to the viewpoint. The view extends to the whole of Barcelona.  I highly recommend this place for anyone who appreciates architecture. Absolutely loved it.", "publishedDate": "2019-10-16", "language": "en", "rating": 5}, {"id": 718089241, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d191048-r718089241-Barcelona_Cathedral-Barcelona_Catalonia.html", "text": "While Sagridia Famillia gets all the hype, this cathedral was amazing. The baroque architecture was mind blowing. This is a do not miss. \nWe went up in the roof and the view is what you’d expect!", "publishedDate": "2019-10-13", "language": "en", "rating": 5}, {"id": 717654897, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d191048-r717654897-Barcelona_Cathedral-Barcelona_Catalonia.html", "text": "Such a beautiful cathedral that we unfortunately could not go in on the Sunday we were there as Mass was going on. We never got a chance to go back, but from the  outside, it was pretty amazing", "publishedDate": "2019-10-12", "language": "en", "rating": 5}, {"id": 717312408, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d191048-r717312408-Barcelona_Cathedral-Barcelona_Catalonia.html", "text": "It's quite expensive to get in, at €7 a head, with additional charges for the crypt and the rooftop view. The queuing system was wierd, unclear about which to join as one was for advance tickets and one for on-spec visitors.\n  Inside it was a typical catholic cathedral, side chapels with lots of gilding, but if you wanted detail you need to get the audio-guide, also extra charge. There was no written architectural information, not even on sale.\nGuard-geese were fun, in lovely cloisters on the way out.", "publishedDate": "2019-10-11", "language": "en", "rating": 3}, {"id": 717232295, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d191048-r717232295-Barcelona_Cathedral-Barcelona_Catalonia.html", "text": "The Cathedral which was constructed beginning in the 1300’s. The cathedral is dedicated to Eulalia of Barcelona, co-patron saint of Barcelona, a young virgin who, according to Catholic tradition, suffered martyrdom during Roman times in the city. The body of Saint Eulalia is entombed in the cathedral's crypt.\n\nThe Cathedral is a good example of the first Catalan Gothic.  Even if the building is mostly large empty spaces we feel overwhelmed, surrounded by a palm forest that it feels to be among the impressive Gothic columns.  Make it a point to enter the enclosed choir area. The wooden choir stalls retain the coats-of-arms of the knights of the Order of the Golden Fleece.\n\nThe cathedral may be dimly lit but the sunshine from the stained glass windows give a dramatic effect.  Not to be missed in Barcelona. There are also street performers outside the church.", "publishedDate": "2019-10-11", "language": "en", "rating": 5}, {"id": 717166362, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d191048-r717166362-Barcelona_Cathedral-Barcelona_Catalonia.html", "text": "We were staying directly opposite this impressive cathedral and had to go inside to see just how amazing this building is. The beautiful architecture is just breath taking inside just as it is outside. It is incredibly peaceful and calming when you enter, quite easy to spend a couple of hours exploring and taking it all in. It is free entry in the morning, highly recommend a visit when in Barcelona.", "publishedDate": "2019-10-10", "language": "en", "rating": 5}, {"id": 717042771, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d191048-r717042771-Barcelona_Cathedral-Barcelona_Catalonia.html", "text": "An amazing building I would recommend that you pay a visit and if you don't mind heights go up to the roof where you get amazing views of the city great for getting your bearings. Beautiful architecture and a place where I could spend hours walking around.", "publishedDate": "2019-10-10", "language": "en", "rating": 5}, {"id": 716846151, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d191048-r716846151-Barcelona_Cathedral-Barcelona_Catalonia.html", "text": "This cathedral was constructed from th thirteenth and fifteenth centuries. It is the cathedral of St Eulalia and the Holy Cross. It has a.spacious sanctuary and vertical buttresses. It is in the Gothic Quarter. It has 13 white geese in the courtyard. There is also a statue to St.  George the patron saint of Barcelona. ", "publishedDate": "2019-10-09", "language": "en", "rating": 4}, {"id": 716333668, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d191048-r716333668-Barcelona_Cathedral-Barcelona_Catalonia.html", "text": "Loved it, so amazing in so may ways, had to put into words.  LOVED the positive, intense energy and advise doing the audio tour, worth the extra few euros.", "publishedDate": "2019-10-08", "language": "en", "rating": 5}, {"id": 716064499, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d191048-r716064499-Barcelona_Cathedral-Barcelona_Catalonia.html", "text": "My family loved La Sagrada Familia, and some did not think as much of Barcelona Cathedral. I loved the contrast. This Cathedral is gothic, dark, historic, old school. I loved it! The detail, history, art... very beautiful.", "publishedDate": "2019-10-07", "language": "en", "rating": 4}, {"id": 715832508, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d191048-r715832508-Barcelona_Cathedral-Barcelona_Catalonia.html", "text": "We walked around the Cathedral with a tour guide.  The history was very interesting and the streets around the cathedral were charming.  ", "publishedDate": "2019-10-06", "language": "en", "rating": 4}, {"id": 715659778, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d191048-r715659778-Barcelona_Cathedral-Barcelona_Catalonia.html", "text": "My husband and I went along to Barcelona Cathedral last Friday 4th October. We were lucky enough to go in the morning when there was free entry before 12.30pm I believe. You can also visit for free during the evenings too.\n\nThe architecture and stained glass is stunning and I would also recommend taking a lift to the roof of the cathedral. This costs €3 and is really worth it. The lift entrance is situated at the back left-hand side of the Cathedral, I say this as it isn’t easy to spot at first.\n\nOnce on the roof you have wonderful views of the city and there is a collection of bells nearby that frequently chime from one of the nearby rooftops - absolutely beautiful. You can also see the sea in the distance from the top of the Cathedral. There is an area with a bench near the Cross on the roof if you don’t always fancy standing.\n\nThere is also a beautiful area with geese and palm trees upon exiting the Cathedral. You can pick up an audio guide when you first arrive for €4 but this is optional.\n\nHighly recommend a visit but do be prepared to queue when first arriving to gain entry to the Cathedral - we waited approximately 10-15 minutes.\n\nNearest Metro is Jaume.", "publishedDate": "2019-10-05", "language": "en", "rating": 5}, {"id": 715542375, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d191048-r715542375-Barcelona_Cathedral-Barcelona_Catalonia.html", "text": "Barcelona cathedral was a typical hypocritical waste of lives, time and money same as every religious cathedral. It is beautiful but again, being accosted multiple times daily all around the cathedral by poor and starving people is more important to me than a pile of rocks.", "publishedDate": "2019-10-05", "language": "en", "rating": 3}, {"id": 715313320, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d191048-r715313320-Barcelona_Cathedral-Barcelona_Catalonia.html", "text": "FREE. Get there early and go inside! Plan on being fascinated for an hour or two. Beautiful. Architecture statues, GOLD. Get the story behind it, which is also very interesting. BONUS, to the left of the alter, spend the $3 Euro to take the elevator to the roof, see the city and upper spires!", "publishedDate": "2019-10-04", "language": "en", "rating": 5}, {"id": 715221847, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d191048-r715221847-Barcelona_Cathedral-Barcelona_Catalonia.html", "text": "the cathederal is impressive and has free admmision- good to check the history b4- when visited there were renovations but done well so could visit most of cathederal", "publishedDate": "2019-10-04", "language": "en", "rating": 4}, {"id": 715206850, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d191048-r715206850-Barcelona_Cathedral-Barcelona_Catalonia.html", "text": "This is a beautiful building constructed mostly in the 1300s, although the spires and most of the facade are neogothic additions from the late 1800s. Inside though you get a great sense of the past, and from the roof you get a panoramic view of the city. The lineup to get inside moves quickly and you can buy tickets at the door.", "publishedDate": "2019-10-04", "language": "en", "rating": 5}, {"id": 715037827, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d191048-r715037827-Barcelona_Cathedral-Barcelona_Catalonia.html", "text": "As beautiful as the cathedral and the gothic quarter with all its rumblings and excitement; disappointing that one is not able to attend service and go in with paying a pricey fee just to view. Good location where the events and attractions may change outside, yet still one place to see; if you can on your travel wish list.", "publishedDate": "2019-10-03", "language": "en", "rating": 3}, {"id": 715011176, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d191048-r715011176-Barcelona_Cathedral-Barcelona_Catalonia.html", "text": "A really good place to visit - not crowded and worth just taking a bit of time to wander and sit and study. Stained glass lovely and on a sunny day with sun in right place the clours are lovely. Not over the top. Free entrance", "publishedDate": "2019-10-03", "language": "en", "rating": 4}, {"id": 715005764, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d191048-r715005764-Barcelona_Cathedral-Barcelona_Catalonia.html", "text": "Beautiful Cathedral.  We really enjoyed the gardens/cloister and the geese!  Definitely worth taking time to enter and enjoy the beauty inside.", "publishedDate": "2019-10-03", "language": "en", "rating": 4}, {"id": 714833001, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d191048-r714833001-Barcelona_Cathedral-Barcelona_Catalonia.html", "text": "Don't pass this up because you opted for La Sagrada Familia instead. It's beautiful inside and out.  There is no admission charge, but you should buck up the €4 for the audio guide.  It provides so much detail that you would otherwise miss and it's a small price to keep this cathedral open and accessible to all. ", "publishedDate": "2019-10-02", "language": "en", "rating": 5}, {"id": 713899773, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d191048-r713899773-Barcelona_Cathedral-Barcelona_Catalonia.html", "text": "This is another fantastic building with lots of atmosphere in the square. A great guitarist playing beautiful music, several lads doing gymnastics and a few stalls selling small antiques..Really relaxing place to sit and enjoy.", "publishedDate": "2019-09-29", "language": "en", "rating": 5}, {"id": 713807719, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d191048-r713807719-Barcelona_Cathedral-Barcelona_Catalonia.html", "text": "One is not religious but I love to visit cathedral’s absolutely loved it here. So much history and the building it’s self is real good.", "publishedDate": "2019-09-28", "language": "en", "rating": 5}, {"id": 713719740, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d191048-r713719740-Barcelona_Cathedral-Barcelona_Catalonia.html", "text": "Im not usual a church person but the inside is an amazing sight ,the the architecture is wondrous ,and quite awe inspiring", "publishedDate": "2019-09-28", "language": "en", "rating": 5}, {"id": 713709058, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d191048-r713709058-Barcelona_Cathedral-Barcelona_Catalonia.html", "text": "It's certainly a nice gothic cathedral and interesting to view, with plenty of ornate decoration inside, but it doesn't stand out as an amazing cathedral compared to many others in Europe. I'm not sure if it was worth the €7 admission personally, and although the €4 audio guide gave some interesting insights for 90 mins the overall experience for €11 isn't great if you've seen other grand cathedrals. The highlight however was the cloister with its white geese, which is certainly something I've never seen before", "publishedDate": "2019-09-28", "language": "en", "rating": 4}, {"id": 713539477, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d191048-r713539477-Barcelona_Cathedral-Barcelona_Catalonia.html", "text": "The Cathedral was great, amazing👌 there were a lot of turists, viewers. The city, Barcelona was very amazing, briliant👌❤🇪🇸 i was very enjoied🤗😊 ", "publishedDate": "2019-09-27", "language": "en", "rating": 3}, {"id": 713505603, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d191048-r713505603-Barcelona_Cathedral-Barcelona_Catalonia.html", "text": "This cathedral is incredible! The detail and artwork is breathtaking and the views offered from the rooftop could not be more impressive. In a space such as this one cannot help but stand in awe and be humbled by the beauty and the rich history that surrounds you. Highly recommend visiting this treasure! ", "publishedDate": "2019-09-27", "language": "en", "rating": 5}, {"id": 713179771, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d191048-r713179771-Barcelona_Cathedral-Barcelona_Catalonia.html", "text": "Beautiful spires, gargoyles, and statues are on the outside.  Gold-gilded side chapels with Saints behind bars, Cripta De Santa Eulalià (which the room containing it will light up if someone pays), and the elaborate detailed choir stalls, which still retain the coats-of-arms of the knights of the Order of the Golden Fleece are interesting to see.  The highlight was the central courtyard with fountains, fish, and 13 white Geese, which some have tufts of white feathers on the top of their heads.  Everywhere, however, in this cathedral is asking for money including going to the bathroom!", "publishedDate": "2019-09-26", "language": "en", "rating": 4}, {"id": 713081398, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d191048-r713081398-Barcelona_Cathedral-Barcelona_Catalonia.html", "text": "This is a huge building with many rather ostentatious gilded chapels.  It was very busy when we visited in the morning  when entrance was free.  It has got to be seen but not the most tranquil of places.", "publishedDate": "2019-09-26", "language": "en", "rating": 5}, {"id": 712690335, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d191048-r712690335-Barcelona_Cathedral-Barcelona_Catalonia.html", "text": "The exterior is beautiful as you approach it along side alley or the main front side however the interior is very typical. The rooftop is also accessible, it gives you a semi panoramic view of the city, that's all. \nIt definitely doesn't worth paying seven euros, maybe three in my opinion or you know for free.", "publishedDate": "2019-09-24", "language": "en", "rating": 2}, {"id": 712220868, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d191048-r712220868-Barcelona_Cathedral-Barcelona_Catalonia.html", "text": "Quite literally breathtaking. We had to wait in a long queue to get in here but it was without question worth it.\nThe architecture and the height of the spires and the pillars is quite amazing.\nStained glass windows staggeringly beautiful. All the icons aroung too.It also has quite stunning choirstalls that have a beam of light shining down from a stained glass window.\n\nLove that the geese guard it and appear very happy\n", "publishedDate": "2019-09-23", "language": "en", "rating": 5}, {"id": 711693971, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d191048-r711693971-Barcelona_Cathedral-Barcelona_Catalonia.html", "text": "I never miss an opportunity to spend an hour or so wandering through this lovely cathedral.  I think this was my first time taking the elevator to the rooftop.  The rain dampened the experience, but the views were well-worth the visit and it is included in the price of admission.  Be sure not to miss the museum as you head for the exit.  Also included in admission, there are a few  not to be missed treasures .", "publishedDate": "2019-09-21", "language": "en", "rating": 5}, {"id": 711574258, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d191048-r711574258-Barcelona_Cathedral-Barcelona_Catalonia.html", "text": "Phenomenal audio/video guide for 4€. \nBeautiful cathedral, one of key historic sites to see in Barcelona. Make sure to go up on to the terrace for the view. ", "publishedDate": "2019-09-20", "language": "en", "rating": 5}, {"id": 711399009, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d191048-r711399009-Barcelona_Cathedral-Barcelona_Catalonia.html", "text": "This cathedral figures prominently in Barcelona's history. Worth the visit, but not as breathtaking as others in Spain or Barcelona.", "publishedDate": "2019-09-20", "language": "en", "rating": 4}, {"id": 711395482, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d191048-r711395482-Barcelona_Cathedral-Barcelona_Catalonia.html", "text": "The one in Toledo is much more impressive, but this cathedral is worth the price, too. Lots of the chapels are locked behind bars, but they're still visible and most are gorgeous. Perhaps the best part is the view from the roof though that can get a bit busy depending on the time of the day and the season. The view from the courtyard (geese!) was also nice - very relaxing!", "publishedDate": "2019-09-20", "language": "en", "rating": 5}, {"id": 711340397, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d191048-r711340397-Barcelona_Cathedral-Barcelona_Catalonia.html", "text": "It's a beautiful place to take pics. It costs 7€ to go in and well... it's like any other church in my opinion. You get to go up to the roof and have a view of the city but other than that, I would say save those 7€ for something else.", "publishedDate": "2019-09-20", "language": "en", "rating": 3}, {"id": 711188849, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d191048-r711188849-Barcelona_Cathedral-Barcelona_Catalonia.html", "text": "The big, gothic cathedral in Barcelon a is a huge, beautifulky lit building, but 7€ is a bit steep for my taste. My favourite thing about it are the 13 geese they have in the courtyard (:", "publishedDate": "2019-09-19", "language": "en", "rating": 4}, {"id": 710468748, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d191048-r710468748-Barcelona_Cathedral-Barcelona_Catalonia.html", "text": "Having visited hundreds of cathedrals around the world this cathedral had lots of stunning medical features. In typical Spanish style everything is locked behind iron railings; the best part of the visit was going on the roof and seeing the views of the city.", "publishedDate": "2019-09-17", "language": "en", "rating": 3}, {"id": 710341166, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d191048-r710341166-Barcelona_Cathedral-Barcelona_Catalonia.html", "text": "A queue waiting to get in but this moved quickly! Beautiful old church with plenty of places to have some quiet time. The geese looked happy enough living there. Just a shame that the boarding going up outside the front for an event restricted the view a little ", "publishedDate": "2019-09-16", "language": "en", "rating": 5}, {"id": 710205107, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d191048-r710205107-Barcelona_Cathedral-Barcelona_Catalonia.html", "text": "A wonderful Cathedral. There was a queue when we arrived but this moved quite quickly. We were fascinated by the geese! ", "publishedDate": "2019-09-16", "language": "en", "rating": 4}, {"id": 709709034, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d191048-r709709034-Barcelona_Cathedral-Barcelona_Catalonia.html", "text": "Similar to many other churches but has a few interesting statues and paintings.Lovely ceiling and interesting electric candles which you pay money to alight.", "publishedDate": "2019-09-14", "language": "en", "rating": 4}, {"id": 709594890, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d191048-r709594890-Barcelona_Cathedral-Barcelona_Catalonia.html", "text": "This cathedral is very beautiful and also it’s surroundings! I highly recommend going by evening so you can see it with the nice afternoon light. ", "publishedDate": "2019-09-14", "language": "en", "rating": 5}, {"id": 709407862, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d191048-r709407862-Barcelona_Cathedral-Barcelona_Catalonia.html", "text": "The Barcelona Cathedral is small compared to Sagrada Familia.  But it, like most cathedrals in Europe, has beautiful art and architecture.  \nThe Cloister, with it's 13 geese, is a delight.  The cathedral is free to enter (except the roof) in the morning.  So it's a good place to start young travelers on the road to culture appreciation.", "publishedDate": "2019-09-13", "language": "en", "rating": 5}, {"id": 709290806, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d191048-r709290806-Barcelona_Cathedral-Barcelona_Catalonia.html", "text": "The church may want a \"donation\". But don't skimp on money as it is tied intimately to the city's history. Meld it with a visit to Gothic quarter and go in the morning when entry is free and the sun is not harsh. The place needs 20-30 minutes to soak in.\n\nMake sure to walk around to the back too and notice the squiggle in the shop in front is Picasso", "publishedDate": "2019-09-12", "language": "en", "rating": 5}, {"id": 708601779, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d191048-r708601779-Barcelona_Cathedral-Barcelona_Catalonia.html", "text": "Eyes are immediately drawn upwards to the ceilings of the church. So beautiful and all the chapels are so stunning! Take the time to walk by all of them.", "publishedDate": "2019-09-10", "language": "en", "rating": 4}, {"id": 708597165, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d191048-r708597165-Barcelona_Cathedral-Barcelona_Catalonia.html", "text": "Doesn’t beat westminster and the roof is just a few steps in every direction due to renovation being undertaken but a nice visit. Every work of art is behind heavy bars tho, guess it reflects the current state of christianity.", "publishedDate": "2019-09-10", "language": "en", "rating": 4}, {"id": 708547190, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d191048-r708547190-Barcelona_Cathedral-Barcelona_Catalonia.html", "text": "We didn’t need to wait long and bought our ticket at the cathedral. It costs 7€ and includes a visit up the tower in an elevator. We were short on time so weren’t able to go. Besides, we had already seen many views from other high vantage points. It is stunning inside with and a ring of alters around the walls each in their own separate enclosure. Massive inside. Highly recommend.", "publishedDate": "2019-09-10", "language": "en", "rating": 4}, {"id": 708524938, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d191048-r708524938-Barcelona_Cathedral-Barcelona_Catalonia.html", "text": "Very nice cathedral in the Gothic Quarter. Free admission. Extra charge to go up on the roof. 4 Euros for use of a hand held pre-recorded tour. Short line to get in (less than 5 minute wait). We stayed for a mass, which was held in a side chapel. The cathedral is very beautiful. Photographs are permitted (no flash). There is a dress code, ie, no tank tops, bathing suits, etc. We spent 2 hours inside (including the 30 minute mass). ", "publishedDate": "2019-09-10", "language": "en", "rating": 4}, {"id": 708274064, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d191048-r708274064-Barcelona_Cathedral-Barcelona_Catalonia.html", "text": "First. Shoulders and knees covered. There is a box with scarves to borrow or a market stall selling for 1.5 euro. Watch for beggers. Now charging for entry 7 euro. This entitles you to visit the roof via a lift. The most amazing views from the top. Plus loved the 13 geese.", "publishedDate": "2019-09-09", "language": "en", "rating": 5}, {"id": 708073998, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d191048-r708073998-Barcelona_Cathedral-Barcelona_Catalonia.html", "text": "This cathedral was beautiful. The crypt was made available for Mass. Very moving story of St Eulàlia. Loved the geese in the cloisters.", "publishedDate": "2019-09-09", "language": "en", "rating": 5}, {"id": 707604052, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d191048-r707604052-Barcelona_Cathedral-Barcelona_Catalonia.html", "text": "Aside from the other church, this is truly built hundreds of years ago. It is the landmark in the gothic quarter.", "publishedDate": "2019-09-07", "language": "en", "rating": 5}, {"id": 707529617, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d191048-r707529617-Barcelona_Cathedral-Barcelona_Catalonia.html", "text": "This is Gothic and Catalan architecture at its best! The church is a masterpiece and its architecture and art is stunning. Even better is that the ticket includes a visit to the rooftop cathedral, so you get an amazing view of the city and towers in the cathedral, as well as the gardens (Cute ducks are unexpected, but a plus!)\n\nSide note, access to the washroom costs 50 cents so you may want to go to the washroom beforehand.", "publishedDate": "2019-09-07", "language": "en", "rating": 5}, {"id": 707282898, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d191048-r707282898-Barcelona_Cathedral-Barcelona_Catalonia.html", "text": "Stunning cathedral! Unfortunately when we got there it was already closing time, so unfortunately we didn't get to see the inside. But the outside was just beautiful!", "publishedDate": "2019-09-06", "language": "en", "rating": 5}, {"id": 707183048, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d191048-r707183048-Barcelona_Cathedral-Barcelona_Catalonia.html", "text": "Masterpiece of ghotic architecture, great place, need to book online to go inside, definitely worth a visit ", "publishedDate": "2019-09-06", "language": "en", "rating": 4}, {"id": 706872310, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d191048-r706872310-Barcelona_Cathedral-Barcelona_Catalonia.html", "text": "Architecture was wonderful, tickets need to be booked on line so were unable to go inside.  Definitely worth a visit.\n", "publishedDate": "2019-09-05", "language": "en", "rating": 5}, {"id": 706580735, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d191048-r706580735-Barcelona_Cathedral-Barcelona_Catalonia.html", "text": "Gothic architecture gone mad. Gorgeous inside. Go early and just breeze in. Delay going and stand in the sun waiting your turn. ", "publishedDate": "2019-09-04", "language": "en", "rating": 4}, {"id": 706567623, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d191048-r706567623-Barcelona_Cathedral-Barcelona_Catalonia.html", "text": "Very nice attraction, an open space in front, a nice narrow passageway on the left with shops and Rose-ice cream and another open space with fixed armchairs to rest....!", "publishedDate": "2019-09-04", "language": "en", "rating": 5}, {"id": 706357267, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d191048-r706357267-Barcelona_Cathedral-Barcelona_Catalonia.html", "text": "I havent been in the cathedrale itself but the view is great and to sit on the stairs infront of it and listen to some musicians is very nice.", "publishedDate": "2019-09-04", "language": "en", "rating": 4}, {"id": 706297571, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d191048-r706297571-Barcelona_Cathedral-Barcelona_Catalonia.html", "text": "This is a must see when visiting Barcelona, The cathedral was built over between the 13 and 15 centries and is still not complete.. If you need to go inside, its best to buy tickets before going and to avoid the crowd, go early", "publishedDate": "2019-09-03", "language": "en", "rating": 5}, {"id": 706050923, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d191048-r706050923-Barcelona_Cathedral-Barcelona_Catalonia.html", "text": "I spent 1 week at the Hotel Colon which is directly in front of the cathedral & also has a roof top terrace directly overlooking it. \nGorgeous inside, there was no line... 7 euros to enter. ", "publishedDate": "2019-09-03", "language": "en", "rating": 4}, {"id": 706032162, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d191048-r706032162-Barcelona_Cathedral-Barcelona_Catalonia.html", "text": "The Barcelona Cathedral was absolutely breathtaking and mind boggling at the same time-the gothic details in every inch of this beautiful church is astonishing-how did they build these massive churches without modern day machinery?", "publishedDate": "2019-09-03", "language": "en", "rating": 5}, {"id": 705736931, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d191048-r705736931-Barcelona_Cathedral-Barcelona_Catalonia.html", "text": "It's not one of Barcelona's \"top 10\" attractions, but that means you won't have to fight crowds inside. :-) I liked the interesting brick construction, especially the high vaulted ceiling; cool to see the old medieval paving stones in the cloister carved with different emblems. We got a kick out of the 13 white geese in the cloister - one for each of St. Eulalia's years. Admission includes access to the roof. Nice place to spend a quiet hour or so.", "publishedDate": "2019-09-02", "language": "en", "rating": 4}, {"id": 705382099, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d191048-r705382099-Barcelona_Cathedral-Barcelona_Catalonia.html", "text": "Located in the Gothic neighbourhood this must be the epitomy of Old Barcelona. Enjoy a cafe on the plaza and just let the view soak in.", "publishedDate": "2019-09-01", "language": "en", "rating": 5}, {"id": 704679491, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d191048-r704679491-Barcelona_Cathedral-Barcelona_Catalonia.html", "text": "Took about 1 hour to see everything. Beautiful cathedral. Worth going if you have time, but much more important to see Sagrada Familia if your schedule is tight", "publishedDate": "2019-08-30", "language": "en", "rating": 4}, {"id": 704258609, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d191048-r704258609-Barcelona_Cathedral-Barcelona_Catalonia.html", "text": "If you have visited many cathedrals in Europe, then this will just be one of them. What would make it interesting would be the background or history of this place. We had a local companion who told us the significance of some of the features.", "publishedDate": "2019-08-29", "language": "en", "rating": 4}, {"id": 704049186, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d191048-r704049186-Barcelona_Cathedral-Barcelona_Catalonia.html", "text": "So many details you could never see all of them. Take the Julia tours guided trip and ask for Eduardo Serrano, he is filled with knowledge about this masterpiece. ", "publishedDate": "2019-08-28", "language": "en", "rating": 5}, {"id": 703892326, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d191048-r703892326-Barcelona_Cathedral-Barcelona_Catalonia.html", "text": "We could not visit the interior of the Cathedral unfortunately but we wandered around the outside and the surrounding streets.\nWe walked into the Cathedral Square in the evening to be greeting by an amazing atmosphere  There was a band playing and people, local and tourists, dancing traditional Catalonian dances.  A real breathtaking moment.", "publishedDate": "2019-08-28", "language": "en", "rating": 5}, {"id": 703580684, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d191048-r703580684-Barcelona_Cathedral-Barcelona_Catalonia.html", "text": "Well worth the short queue its going to take you to get in. Situated in a large open square with buskers outside (very good ones!) and in midst of the Gothic Quarter.\n\nFully operational church (Unlike Sagrada Familia) and so peaceful. We were lucky enough to catch a choir practising and it really does take you to another world.\n\nBeautiful and ornate ... everything the \"woke\" would object to but a perfect symbol of the fervant past of Catholic Spain.", "publishedDate": "2019-08-27", "language": "en", "rating": 4}, {"id": 702977720, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d191048-r702977720-Barcelona_Cathedral-Barcelona_Catalonia.html", "text": "What an amazing place, our guide was so informative but made it interesting not boring.1\nGaudi had such vision wonderful to see the basilica will be  completed in the next few years.", "publishedDate": "2019-08-25", "language": "en", "rating": 5}, {"id": 702825491, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d191048-r702825491-Barcelona_Cathedral-Barcelona_Catalonia.html", "text": "Beautiful old cathedral, with dozens of side altars to admire along with the main altar.  There is also an elevator to the tower with outstanding views of the city.  Only downside is you have to pay to use the toilet after paying 7e entrance fee for the church.", "publishedDate": "2019-08-25", "language": "en", "rating": 4}, {"id": 702555931, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d191048-r702555931-Barcelona_Cathedral-Barcelona_Catalonia.html", "text": "Queue to get in at most times but not really long. Apparently free to get in before 12.30 and after 5.00. Could get headset guide to say what you were looking at, forget how much, anout 7€. Emtrance ticket also included trip up to roof in lift. Recommend the view. Geese(real live ones) in cloisters a novelty in gothic architecture. Various tradituonal stories about how they belong there. Not the main tbing in Barcelona for me but glad had time for it", "publishedDate": "2019-08-24", "language": "en", "rating": 4}, {"id": 700792308, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d191048-r700792308-Barcelona_Cathedral-Barcelona_Catalonia.html", "text": "Booked this trip months ago, as came on a cruise to the city and wanted to go inside but the cruise ship does not do this .\nIt was booked for 10.30 in the morning got there early and went stright in, need to cover up as a mark of respect, inside is just beautiful expected it to be cold but it was so warm in there with all the stained glass .\nIt was well worth the trip and go early in the morning before the crowds", "publishedDate": "2019-08-19", "language": "en", "rating": 5}, {"id": 699920589, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d191048-r699920589-Barcelona_Cathedral-Barcelona_Catalonia.html", "text": "Fun trip with the girls (I went in July 2018 only posting now) however it is a beautiful place.\nI loved how upon arrival they give you scarves to let the public in and respect the cathedral. it gives everyone a chance to enter. ", "publishedDate": "2019-08-17", "language": "en", "rating": 5}, {"id": 699351219, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d191048-r699351219-Barcelona_Cathedral-Barcelona_Catalonia.html", "text": "We were a 5 minute walk away from here so we visited it a few times during our stay at different times. Our favourite was really early in the morning where there was no one there. We were really able to capture some great photos. Great spot to sit around and have a drink or coffee just down the steps.", "publishedDate": "2019-08-15", "language": "en", "rating": 5}, {"id": 698694752, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d191048-r698694752-Barcelona_Cathedral-Barcelona_Catalonia.html", "text": "The Cathryn is huge, beautiful and inspiring. Tombs dating back to 1080 can be seen as well as separate stations for different saints. ", "publishedDate": "2019-08-13", "language": "en", "rating": 5}, {"id": 697707607, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d191048-r697707607-Barcelona_Cathedral-Barcelona_Catalonia.html", "text": "I loved Sagrada but I loved Barcelona Cathedral just as much and maybe a little more. Is not as tourist oriented, it feels like it is primarily a place of worship. Outside the Gothic and Neo Gothic building is stunning, and I liked the gargoyles guarding the typical Catalonian neo gothic stone work.\nInside there are many alcove chapels dedicated to different saints all beautifully decorated and with impressive statues.\nWe almost missed the option to have a walk around on the rooftop. The cathedral is free to visit but going up it costs a few euros. Worth every cent! You go up on a lift and free to walk around. The 360 views of Barcelona are breathtaking. \nReturning down we visited the Gothic cloister that hosts 13 geese dont miss it. Is so beautiful. And as a catholic I was even able to light a candle.\nI must say the cathedral is a must place to visit.", "publishedDate": "2019-08-11", "language": "en", "rating": 5}, {"id": 697331248, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d191048-r697331248-Barcelona_Cathedral-Barcelona_Catalonia.html", "text": "This building is definitely worth a visit when traveling to Barcelona.  Be sure not to miss the elevator ride to the top for an amazing view.  We went late afternoon and there was a short line ith maybe a ten minute wait to get in.", "publishedDate": "2019-08-09", "language": "en", "rating": 4}, {"id": 697112459, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d191048-r697112459-Barcelona_Cathedral-Barcelona_Catalonia.html", "text": "Very beautiful inside and you can hear mass on schedule. Relics are well preserved and enjoy your quiet time to pray.", "publishedDate": "2019-08-08", "language": "en", "rating": 5}, {"id": 697110407, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d191048-r697110407-Barcelona_Cathedral-Barcelona_Catalonia.html", "text": "So many amazing places to visit in town\nAnother well worth seeing\nMore stunning and more to see than at the Sagrada\nAnd unlike Sagrada its free", "publishedDate": "2019-08-08", "language": "en", "rating": 5}, {"id": 696806251, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d191048-r696806251-Barcelona_Cathedral-Barcelona_Catalonia.html", "text": "Next to the Sacrada familia A lot of people who want to visit this cathedral, so be in time.As impreesive inside as outside. ALso gardens are worth to be visited.", "publishedDate": "2019-08-07", "language": "en", "rating": 4}, {"id": 696557105, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d191048-r696557105-Barcelona_Cathedral-Barcelona_Catalonia.html", "text": "I have never visited such a rich cathedral before.  The gold shone! \nI loved the misericords in the choir stalls and the beautiful stain glass windows! ", "publishedDate": "2019-08-07", "language": "en", "rating": 5}, {"id": 696329826, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d191048-r696329826-Barcelona_Cathedral-Barcelona_Catalonia.html", "text": "An amazing cathedral with a great history behind it (used Rick Steves' Barcelona City Walk).  Side chapels were interesting so do check out these.  Have to know the story of Eulalia to appreciate the tomb area below the altar, and the 13 geese roaming in the cloister area", "publishedDate": "2019-08-06", "language": "en", "rating": 5}, {"id": 696094944, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d191048-r696094944-Barcelona_Cathedral-Barcelona_Catalonia.html", "text": "This is a beautiful cathedral. I especially liked the lovely choir stalls. There are some interesting features - such as the sepulchres high up on the wall.\nI enjoyed the visit but found it (comparatively) quite expensive.", "publishedDate": "2019-08-06", "language": "en", "rating": 4}, {"id": 695330634, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d191048-r695330634-Barcelona_Cathedral-Barcelona_Catalonia.html", "text": "Quite nice cathedral. Woman should be covered so it is good to know when you go there. I liked it! It is definitely one place people should go when they wanted to know the Barcelona.", "publishedDate": "2019-08-03", "language": "en", "rating": 4}, {"id": 695311230, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d191048-r695311230-Barcelona_Cathedral-Barcelona_Catalonia.html", "text": "We attended Sunday Mass when we visited Barcelona a couple weeks ago and it was a beautiful cathedral with  a wonderful Mass even thought we don't speak Spanish. We looked up the mass schedule and arrived for the 10 AM service only to find out the next Mass was at noon. Be sure to get current times before planning to attend. It turned out to be a lucky problem however as we took the opportunity to visit a wonderful cafe right on the cathedral square where we chose our food from a large buffet and each item had a tooth pic which signified how much it cost. Your just left your pics on a tray on your table and paid your server for the total costs. Breakfast tapas-who would have thought! \nAnother delightful surprise was the locals folk dancing in the square before and after church. So much fun-don't miss this!!", "publishedDate": "2019-08-03", "language": "en", "rating": 5}, {"id": 695230683, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d191048-r695230683-Barcelona_Cathedral-Barcelona_Catalonia.html", "text": "This cathedral has a very impressive design and architecture and is quite interesting. I visited it right after seeing Sagrada Familia where the guide said Gaudi designed the columns supporting the roof of the Sagrada Familia like branches of trees reaching up....well the design was also in this cathedral that pre-dates Sagrada Familia by a few centuries. make sure you explore the neighbourhood behind the cathedral.", "publishedDate": "2019-08-03", "language": "en", "rating": 5}, {"id": 694883871, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d191048-r694883871-Barcelona_Cathedral-Barcelona_Catalonia.html", "text": "I do not think anyone should monetize viewing a Christian sanctuary or a church. Although, it is a very magnificent work of art", "publishedDate": "2019-08-02", "language": "en", "rating": 3}, {"id": 694833439, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d191048-r694833439-Barcelona_Cathedral-Barcelona_Catalonia.html", "text": "Beautiful cathedral. Gotta go just to see the swans. That was a favorite for our family. Beautiful architecture. Great bang for the buck (by far the least expensive tour we did). ", "publishedDate": "2019-08-01", "language": "en", "rating": 5}, {"id": 694623284, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d191048-r694623284-Barcelona_Cathedral-Barcelona_Catalonia.html", "text": "A beautiful location to attend Mass. Lovely choir, very welcoming and combines tourist attraction and religious location.", "publishedDate": "2019-08-01", "language": "en", "rating": 4}, {"id": 694484132, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d191048-r694484132-Barcelona_Cathedral-Barcelona_Catalonia.html", "text": "Cathedral is beautiful from outside, but definitely worth the visit inside. You can learn about the Saint Eulalia and cloister geese. ", "publishedDate": "2019-07-31", "language": "en", "rating": 5}, {"id": 694072446, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d191048-r694072446-Barcelona_Cathedral-Barcelona_Catalonia.html", "text": "Beautiful Cathedral, one of the most beautiful. I didn’t see it inside, the entrance costs €7 per person.", "publishedDate": "2019-07-30", "language": "en", "rating": 5}, {"id": 693977291, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d191048-r693977291-Barcelona_Cathedral-Barcelona_Catalonia.html", "text": "I've only visited outside but it is amazing. So many churches in the same area it is amazing. I loved the place.", "publishedDate": "2019-07-30", "language": "en", "rating": 4}, {"id": 693875671, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d191048-r693875671-Barcelona_Cathedral-Barcelona_Catalonia.html", "text": "A beautiful Cathedral that is free in the mornings!  The highlight was the cloister.  It's very beautiful and lots to see from the very old grave markers to the very live geese.  Be sure to bring a cover up if  you have shorts or bare arms.  Worth a visit!", "publishedDate": "2019-07-29", "language": "en", "rating": 5}, {"id": 693253802, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d191048-r693253802-Barcelona_Cathedral-Barcelona_Catalonia.html", "text": "We stopped here while in old town Barcelona.    The only mistake we made was not pre booking entrance tickets.    If you are going here in high season , do yourself a favor and purchase your tickets online .  Please follow the dress code for the churches in Spain.    We were prepared.    The church will loan you a shawl if your shoulders or legs are not covered.  There are several beautiful chapels in this cathedral worth seeing.", "publishedDate": "2019-07-27", "language": "en", "rating": 4}, {"id": 693095602, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d191048-r693095602-Barcelona_Cathedral-Barcelona_Catalonia.html", "text": "The audio guide is good the cathedral is beautiful and the views from the roof are well worth the €3 to go up highly recommend a visit", "publishedDate": "2019-07-27", "language": "en", "rating": 5}, {"id": 692629526, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d191048-r692629526-Barcelona_Cathedral-Barcelona_Catalonia.html", "text": "The cathedral was very beautiful with a large plaza in front for many gathering opportunities.  The architecture is wonderful and very well preserved.  Access is very easy.", "publishedDate": "2019-07-25", "language": "en", "rating": 4}, {"id": 692364260, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d191048-r692364260-Barcelona_Cathedral-Barcelona_Catalonia.html", "text": "Very beautiful place. The structure is gorgeous.  A place that is absolutely spiritual. Also, very informative ", "publishedDate": "2019-07-24", "language": "en", "rating": 5}, {"id": 691851492, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d191048-r691851492-Barcelona_Cathedral-Barcelona_Catalonia.html", "text": "This beautiful cathedral is free (before 12:30 if I remember correctly.)  We almost didn't go in because Rick Steve's guidebook said the dress code was strictly enforced.  There were 4 of us and we were all in shorts.  That ended up being ok..  The place is great inside and out.", "publishedDate": "2019-07-22", "language": "en", "rating": 4}, {"id": 691795569, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d191048-r691795569-Barcelona_Cathedral-Barcelona_Catalonia.html", "text": "We went to see this for my wife's birthday as you can see still a lot of works still to be completed very busy good weather ", "publishedDate": "2019-07-22", "language": "en", "rating": 5}, {"id": 691435275, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d191048-r691435275-Barcelona_Cathedral-Barcelona_Catalonia.html", "text": "What a surprise this was. A beautiful church with wonderful architecture and history going back centuries.", "publishedDate": "2019-07-21", "language": "en", "rating": 5}, {"id": 691417489, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d191048-r691417489-Barcelona_Cathedral-Barcelona_Catalonia.html", "text": "An interesting place to visit, many chapels , courtyard with geese ; peaceful interlude in cosmopolitan Barcelona. Roman Wall remains nearby", "publishedDate": "2019-07-21", "language": "en", "rating": 4}, {"id": 691301794, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d191048-r691301794-Barcelona_Cathedral-Barcelona_Catalonia.html", "text": "Just our personal perception and it may well sound churlish but after an earlier visit to Sagrada Familia we were underwhelmed by the dark medieval interior . What we did enjoy and I thorough recommend is to take the lift up to the roof . Here metal walkways afford visitors spectacular views over the city . There are even benches up there to allow a time to sit and take in the views .", "publishedDate": "2019-07-20", "language": "en", "rating": 4}]}}]