[{"locationId": 1191660, "name": "Casa Calvet", "placeType": "ATTRACTION", "reviewListPage": {"reviews": [{"id": 727372808, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d1191660-r727372808-Casa_Calvet-Barcelona_Catalonia.html", "text": "Made a quick stop here to admire this special building. It's very unique and worth a stop. It seems that you can't enter though.", "publishedDate": "2019-11-18", "language": "en", "rating": 4}, {"id": 719976033, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d1191660-r719976033-Casa_Calvet-Barcelona_Catalonia.html", "text": "The Casa Calvet was built by Antoni Gaudí for the textile manufacturer Pere Màrtir Calvet in 1899.  It is one of Antoni Gaudí's earliest buildings.  Some people hold that it his most conservative work. However,  it also contains markedly modernista elements.The building's ornamentation is classic Gaudí. It has bulging and curved balconies.  Facade which terminates in a curve and the attic balconies, which look like something from a fairy tale.  Architecture is mesmerizing.  Very unique and worth to visit. Beautiful.", "publishedDate": "2019-10-20", "language": "en", "rating": 5}, {"id": 708092594, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d1191660-r708092594-Casa_Calvet-Barcelona_Catalonia.html", "text": "We went for lunch. The service and food were wonderful. The historical significance of this resetaurant were an addition to our trip to Barcelona. Too bad I read that they closed. Boo Hoo!", "publishedDate": "2019-09-09", "language": "en", "rating": 5}, {"id": 657024996, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d1191660-r657024996-Casa_Calvet-Barcelona_Catalonia.html", "text": "This former restaurant was in a fantastic building that we wanted to visit. The restaurant does not exist now.  We have found no clues that it will reopen in the future", "publishedDate": "2019-03-07", "language": "en", "rating": 1}, {"id": 571317912, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d1191660-r571317912-Casa_Calvet-Barcelona_Catalonia.html", "text": "I knew the resturant closed down as I looked up the website to view the menu and found out that it was closed as of 2/28/18. \n\nMy husband and I walked the neighborhood anyway to take some photographs of the architecture. It's so amazing in person, the design, the scale, the materials. If you lift up the huge door knocker, you'll see an insect. I believe it's a bed bug. See photo attached.\n\nFour stars because I couldn't eat there but architecture 5 stars! :)", "publishedDate": "2018-04-05", "language": "en", "rating": 4}, {"id": 550651451, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d1191660-r550651451-Casa_Calvet-Barcelona_Catalonia.html", "text": "This is an unique building for it’s structure and design. Is amazing all the details and pieces you can see on the facade. Is so blended with the rest of the city. It was worth seeing it.", "publishedDate": "2018-01-01", "language": "en", "rating": 5}, {"id": 549745009, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d1191660-r549745009-Casa_Calvet-Barcelona_Catalonia.html", "text": "Casa Calvet was built for the textile manufacturer Pere Màrtir Calvet, who set up his business premises on the ground floor and in the basement, and used the upper floors as his private residence.\n\nThe building is in the baroque Catalan style and is the most conservative of his buildings. So much so that you could walk past it and not realise it is a Gaudi building. However, it did receive a prize for the best building of the year in 1900, from the Barcelona City Council.\n\nThe Restaurant Casa Calvet now occupies a chunk of the ground floor and the entrance to the rest of the building is roped off and marked private. All I could do was take photos of the exterior facade.\n\nThere are much better Gaudi buildings to visit in Barcelona. I recommend Palau Guell as a starting point.", "publishedDate": "2017-12-28", "language": "en", "rating": 3}, {"id": 513701670, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d1191660-r513701670-Casa_Calvet-Barcelona_Catalonia.html", "text": "Restaurant is in a striking building that was originally a private home very close to el Palace Hotel.   Service was excellent and  the selection and quality of the food very good.  The night we were there it was mostly locals dining.", "publishedDate": "2017-08-16", "language": "en", "rating": 4}, {"id": 440634725, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d1191660-r440634725-Casa_Calvet-Barcelona_Catalonia.html", "text": "If it is a Gaudi building it has to be good and worth your time to see it. This one with its stone facade, bay windows and balconies that are a forerunner of the ones in Casa Batllo make it worth seeing.", "publishedDate": "2016-11-28", "language": "en", "rating": 4}, {"id": 438387744, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d1191660-r438387744-Casa_Calvet-Barcelona_Catalonia.html", "text": "We visited for a meal to celebrate my birthday, from the minute we entered to the minute we left we had the most wonderful experience. The Gaudi design was amazing and I couldn't help but look around me in admiration ... well that's until my food came! The staff were extremely pleasant and courteous and looked after us very well ... even to the point of  lit candles in the dessert for my birthday! On to the food ... it was sublime. An explosion of happiness on my palate with every mouthful. I honestly didn't want my meal to end! I highly recommend a visit here, we shall certainly be recommending, AND returning! ", "publishedDate": "2016-11-18", "language": "en", "rating": 5}, {"id": 430967493, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d1191660-r430967493-Casa_Calvet-Barcelona_Catalonia.html", "text": "Calvet is proof that Gaudi could play it straight if it needs be. Well almost. The carved facade and numerous balconies still make it special.", "publishedDate": "2016-10-23", "language": "en", "rating": 4}, {"id": 425016271, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d1191660-r425016271-Casa_Calvet-Barcelona_Catalonia.html", "text": "We celebtrated our 25th wedding anniversary her, wow, what a fantastic experience.\nWe had the banquet, we could not fault any of the courses or the chefs little taster samples.\nthe atmosphere was wonderful, smiles, laughter, warm and very friendly staff.\nA fantastic reccomendation by El Palace Hotel. thank you.", "publishedDate": "2016-10-04", "language": "en", "rating": 5}, {"id": 416735423, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d1191660-r416735423-Casa_Calvet-Barcelona_Catalonia.html", "text": "It's on the ground floor of one of Gaudi's more conventional buildings and it's a very smart place.  The service is excellent, the food is good, but perhaps a bit pricy for the standard", "publishedDate": "2016-09-10", "language": "en", "rating": 4}, {"id": 396936682, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d1191660-r396936682-Casa_Calvet-Barcelona_Catalonia.html", "text": "Casa Calvet is not the most well known Gaudi-Building,\nand Casa Calvet is not the most spectacalar Gaudi-Building.\nBut it is a beautiful building.\nCasa Calvet was built as a dwelling and offices for the textile manufacturer Pere Calvet.\nThe facade have at lot og symbolic elements.\nYou can not visit the Casa Calvet building, but you can go to the restaurant Casa Calvet in the building.\nOBS: Some reviewers have under this ATTRACTION written reviews about the RESTAURANT Casa Calvet. This is a faulty location.", "publishedDate": "2016-07-25", "language": "en", "rating": 4}, {"id": 376791370, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d1191660-r376791370-Casa_Calvet-Barcelona_Catalonia.html", "text": "My adult son and I enjoyed a delicious late lunch in this beautifully decorated Gaudi building. We ate from the prix fix menu which offered several choices. They served a small sausage in two savory sauces, then wen ate the appetizer-tomato soup with prawn garnish for him and vegetables topped with broiler browned goat cheese for me. Next was our entree-tuna steak over ratatouille for him and beef medallions in a savory sauce for me. Wine was included as was dessert-assorted cheese for me, fresh fruit salad with tangerine sauce for him followed with expresso. Service was efficient and friendly. Portion size was modest but just right for us.", "publishedDate": "2016-05-26", "language": "en", "rating": 4}, {"id": 342523548, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d1191660-r342523548-Casa_Calvet-Barcelona_Catalonia.html", "text": "Probably the most conventional of all Gaudi’s works, the house served as a commercial property and a residence for the rich textile manufacturer. Still, there are many details such as the curves, the top gables and facade ornaments that are typical for Catalan modernism.", "publishedDate": "2016-01-25", "language": "en", "rating": 5}, {"id": 330493806, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d1191660-r330493806-Casa_Calvet-Barcelona_Catalonia.html", "text": "Not as famous as his other buildings but I thought it was quite pretty. It has more restraint then his more dramatic buildings but despite the lack of flourish the stone carvings really bring life to this building", "publishedDate": "2015-12-03", "language": "en", "rating": 4}, {"id": 285134173, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d1191660-r285134173-Casa_Calvet-Barcelona_Catalonia.html", "text": "Walk by the building if you are near by. It's a more traditional Gaudi and if you are into Gaudi, it will be interesting. If you are not, stick to the more known buildings.  The interior is very nice.\n\nIf you can, have lunch at Casa Calvet. They offer a \"Market Menu\" for 34 EUROS. The meal was fine but not special. The venue is lovely and I personally liked the fact I could eat in this historical Gaudi building. Service was professional not friendly.", "publishedDate": "2015-07-02", "language": "en", "rating": 4}, {"id": 276577529, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d1191660-r276577529-Casa_Calvet-Barcelona_Catalonia.html", "text": "This was a very special restaurant in a warm rich setting in a space originally designed as offices by Gaudi. There are many different spaces in the restaurant so one has a feeling of privacy wherever one is sitting.  The service is excellent and the food superb. Expect to pay for the quality of the experience.", "publishedDate": "2015-06-01", "language": "en", "rating": 5}, {"id": 264996322, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d1191660-r264996322-Casa_Calvet-Barcelona_Catalonia.html", "text": "My wife and I visited Casa Calvet on the penultimate evening of a flying visit to Barcelona, this wasn't our first visit, we tried it out a year ago and enjoyed the experience so much that we made a point of coming back, I'm delighted to report that we were equally impressed this time!\n\nThe building: It is stunning, almost like entering a time warp and definitely smacks of a dining experience from a by gone era, almost \"private dining\" with the room containing a number of booths, all in all a very relaxed evening, if you are looking for a quick bite to eat this probably isn't it, this more of a fine dining whole evening experience, most enjoyable.\n\nService: Excellent in every way, attentive (but not overbearing) and completely charming, we felt at ease at all times and my complete inability to speak any Spanish was not a problem, also, if you value little things like wine being presented correctly, good wine suggestions and staff who are able to explain/describe the dishes they serve you will like this place.\n\nThe food: Excellent! A wide choice of Catalan cuisine, beautifully cooked and presented, we thoroughly enjoyed all of our dishes; a year ago we had the taster menu, that was excellent, this time we went a la carte, also a stunning collection of delicate flavours, really worthwhile.\n\nThe cost: Ok, now this is the bit the could be a deal breaker for some, this place is not cheap, but I believe in you getting what you pay for, a dinner for two with wine etc will cost in excess of 100 euros but I feel that the quality of food, service and the evening as a whole warrants the price tag, a good example was the 14 euros I payed for a Larios brandy, this is expensive, there were much cheaper options but I chose this because I know it is a fantastic brandy, the bonus was the portion size, it was huge, way larger than anything I have seen our trip so I suppose it wasn't so costly after all!\n\nWould we go again? absolutely, If you like dinner to be a whole evening affair with fine food, well chosen wine, great service... somewhere where you spend an entire evening then Casa Calvet is well worth a look.", "publishedDate": "2015-04-10", "language": "en", "rating": 5}, {"id": 263530342, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d1191660-r263530342-Casa_Calvet-Barcelona_Catalonia.html", "text": "This restaurant is fine dining in a house designed by Gaudi.  The surroundings alone are fantastic but the food the best I tasted in Barcelona.  It is a place to go for a special treat, better than most of the Michelin star places", "publishedDate": "2015-04-04", "language": "en", "rating": 5}, {"id": 259378874, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d1191660-r259378874-Casa_Calvet-Barcelona_Catalonia.html", "text": "Another lovely & impressive Barcelona building designed by Gaudi in the Eixample district. Beautiful as expected, and well worth a visit.", "publishedDate": "2015-03-14", "language": "en", "rating": 4}, {"id": 246121449, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d1191660-r246121449-Casa_Calvet-Barcelona_Catalonia.html", "text": "This lovely building was near our hotel and we opted to have our one fine dining evening to celebrate a special anniversary. We chose the Barcelona taster menu (Euro 49 each) and each of the five courses was, as expected, petite except for the lamb and the dessert.  All courses were enjoyable. The waitress was attentive but the service was not exceptional.  The most disappointing aspect of the evening was that we could hear, all evening, the noise of the children from what seemed to be a room behind the restaurant area. We were given a complimentary sherry to celebrate our special occasion which was a nice touch.", "publishedDate": "2014-12-27", "language": "en", "rating": 4}, {"id": 238826916, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d1191660-r238826916-Casa_Calvet-Barcelona_Catalonia.html", "text": "Even Gaudi's commercial project with a mix of commercial and retail space is unique.\n\nOne could even comment that the facade is tame but then there are the balconies which are indicative of what is to come…it merits its award bestowed in 1900 for most outstanding building.\nAnd endures the test of time.\n\nFor those who enjoy architecture add this property to your Gaudi day.", "publishedDate": "2014-11-08", "language": "en", "rating": 4}, {"id": 229388026, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d1191660-r229388026-Casa_Calvet-Barcelona_Catalonia.html", "text": "All we did was find the building and look at its beautiful façade. I love every building that Gaudi made and try to see them all. It received the Arts Building Annual Award in 1900 for being the most beautiful building constructed that year.", "publishedDate": "2014-09-17", "language": "en", "rating": 4}, {"id": 225581253, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d1191660-r225581253-Casa_Calvet-Barcelona_Catalonia.html", "text": "Casa Calvet is a building, designed by Antoni Gaudí for a textile manufacturer which served as both a commercial property (in the basement and on the ground floor) and a residence. It is located at Carrer de Casp 48, Eixample district of Barcelona.\n How to get there: \nMetro: L1 and L4 stop Urquinaona.\nBus: 39, 45, 47, 62 and V17.", "publishedDate": "2014-08-30", "language": "en", "rating": 4}, {"id": 223927127, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d1191660-r223927127-Casa_Calvet-Barcelona_Catalonia.html", "text": "Beautiful modernists building. Very well preserved and with great interiors.  Hosts a top noche restaurant with excelent service great menu and the atmosphere could not be better.", "publishedDate": "2014-08-23", "language": "en", "rating": 5}, {"id": 220895094, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d1191660-r220895094-Casa_Calvet-Barcelona_Catalonia.html", "text": "We went because this is an original Gaudi building including some of the furnishings. That was just the tip of the iceberg. From the initial greeting to the final bite of the dessert it was an outstanding experience. We ordered from the fixe prix menu and were delighted with the choices, quantity and quality of the presentations. One of our best meals in Barcelona.", "publishedDate": "2014-08-10", "language": "en", "rating": 5}, {"id": 213585253, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d1191660-r213585253-Casa_Calvet-Barcelona_Catalonia.html", "text": "A lovely facade, go and see this Gaudi building if you are near but do not go to the restaurant inside as -\n1. it is a very expensive tourist trap\n2. there is nothing gaudi to see inside.\n\nso enjoy the outside of the building and move on.", "publishedDate": "2014-07-04", "language": "en", "rating": 4}, {"id": 210417014, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d1191660-r210417014-Casa_Calvet-Barcelona_Catalonia.html", "text": "A anniversary treat not only is the building a sight of magnificent splendour , thank you Mr Gaudi but when you enter the Gaudi house and greeted by the most attentive,professional team. When you read the menu your heart will skip a beat and when you taste the food that angels have produced you'll close your eyes and think your in heaven! I liked it no I loved it and the guy who gives out Michelin stars get over there quick.. Truly amazing..", "publishedDate": "2014-06-15", "language": "en", "rating": 5}, {"id": 203247799, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d1191660-r203247799-Casa_Calvet-Barcelona_Catalonia.html", "text": "Once again the Calvet team in a Gaudi house created a fantastic dinner - the steak with foie perfect...the tarte Tatin with toffee ice cream sublime ", "publishedDate": "2014-04-28", "language": "en", "rating": 5}, {"id": 194554329, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d1191660-r194554329-Casa_Calvet-Barcelona_Catalonia.html", "text": "worth a visit just to admire the front of this Gaudi building, beautiful architecture housing a reataurant inside which ive been told is good for a bite to eat ", "publishedDate": "2014-02-18", "language": "en", "rating": 4}, {"id": 153920787, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d1191660-r153920787-Casa_Calvet-Barcelona_Catalonia.html", "text": "Had lunch at Casa Calvet on a Monday. Lovely building inside and out, extremely friendly and professional service, really felt like we were taken care of.  Delicious meal and good value. Best restaurant experience of our four day trip to Barcelona.", "publishedDate": "2013-03-07", "language": "en", "rating": 5}, {"id": 153219217, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d1191660-r153219217-Casa_Calvet-Barcelona_Catalonia.html", "text": "We went for a special birthday and St Valentine's meal and loved it. The restaurant is elegantly furnished. Tables are not squashed together and the service is excellent. The food and wine were also excellent. ", "publishedDate": "2013-02-26", "language": "en", "rating": 5}, {"id": 150137293, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d1191660-r150137293-Casa_Calvet-Barcelona_Catalonia.html", "text": "Multiple courses of lamb, cod, and ham.  Very elegant.  Expensive but good value.  Environment was comfortable and classy.  ", "publishedDate": "2013-01-20", "language": "en", "rating": 5}, {"id": 148459719, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d1191660-r148459719-Casa_Calvet-Barcelona_Catalonia.html", "text": "We had a lovely dinner here and were able to enjoy the interesting interior of Casa Calvet. Service was friendly and attentive without being intrusive. Food and wine were very good. We had a very enjoyable evening here.", "publishedDate": "2012-12-31", "language": "en", "rating": 4}, {"id": 148086284, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d1191660-r148086284-Casa_Calvet-Barcelona_Catalonia.html", "text": "We could not visit the restaurant as it was holiday following Christmas but the exterior was worth the visit on a complete lEimple tour", "publishedDate": "2012-12-26", "language": "en", "rating": 4}, {"id": 144680297, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d1191660-r144680297-Casa_Calvet-Barcelona_Catalonia.html", "text": "This is one of Gaudi's first houses in Barcelona, insede an Excellent restaurant with the interior decoration as Gaudi created it, fancy for a nice night out.", "publishedDate": "2012-11-05", "language": "en", "rating": 5}, {"id": 142296619, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d1191660-r142296619-Casa_Calvet-Barcelona_Catalonia.html", "text": "They not show inside of building. most tourist take aphoto from outside only. We booked table for dinner by web site.\nWe had tasting menu 49 euro inc warter and tea or coffee.\nBeautiful deco inside and staff and manager was friendly.\nI guess all giest was tourist.", "publishedDate": "2012-10-08", "language": "en", "rating": 5}, {"id": 141216876, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d1191660-r141216876-Casa_Calvet-Barcelona_Catalonia.html", "text": "This restaurant was recommended by the hotel we were staying at for a birthday celebration.\nIt was not a bad choice because we had a wonderful time and diner at this restaurant.\nIt’s a quite restaurant were people enjoy their meal, something we really liked about this restaurant.\n\nWe were given a table facing a wall (beautiful wall) at the end of the restaurant.\nThe services and food was good and for just (€ 90)  you could eat good with two persons.", "publishedDate": "2012-09-25", "language": "en", "rating": 4}, {"id": 136774756, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d1191660-r136774756-Casa_Calvet-Barcelona_Catalonia.html", "text": "If your looking for a quiet , boring restaurant , this is the place. We reserved a table for a birthday dinner, and our table was facing a wall in the corner, but it was a pretty corner. This was our least favorite dinner in Barcelona. Very average across the board.", "publishedDate": "2012-08-09", "language": "en", "rating": 3}, {"id": 125870830, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d1191660-r125870830-Casa_Calvet-Barcelona_Catalonia.html", "text": "Casa Calvet is an interesting early Gaudi work.  It is a block down the street from a Humana thrift shop and only a couple of blocks from Playa de Catalunya.", "publishedDate": "2012-03-09", "language": "en", "rating": 4}, {"id": 119498630, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d1191660-r119498630-Casa_Calvet-Barcelona_Catalonia.html", "text": "Early Gaudi, but the eponymous restaurant is the real attraction.  Superior food and great service.", "publishedDate": "2011-10-19", "language": "en", "rating": 5}, {"id": 71654621, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d1191660-r71654621-Casa_Calvet-Barcelona_Catalonia.html", "text": "Casa Calvet houses a restaurant. It´s a quiet, elegant place, with very tasty food and attentive, discrete service. Although a bit expensive, it´s perfect for special occasions. We booked through their website, and asked for a special treat for a birthday. After a fine meal, just on time, the waiter discreetly approached our table with a wonderful desert (apple tartine) with candles on it. It was a nice surprise for the person.\nBesides the food and service, ambiance is also unique, because of the modernista architecture. When you step into the restaurant, you feel like you´re back in an early 20th century restaurant, with art deco details, stained glass and even upholstery. It´s a great experience not to be missed.", "publishedDate": "2010-07-20", "language": "en", "rating": 5}]}}]