[{"locationId": 8865719, "name": "Carrer Petritxol", "placeType": "ATTRACTION", "reviewListPage": {"reviews": [{"id": 722617369, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d8865719-r722617369-Carrer_Petritxol-Barcelona_Catalonia.html", "text": "There are lots of lovely things on this street, one of which was a large number of chocolate shops.\n\nThe children were spoiled with chocolate milkshake and chocolate churros (sneakily it gave them the calorie hit they needed to keep walking, 7.5 miles this day!) If you want a sweet treat make it here. We went to Granja La Pallaresa and it was good!\n", "publishedDate": "2019-10-30", "language": "en", "rating": 5}, {"id": 674387305, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d8865719-r674387305-Carrer_Petritxol-Barcelona_Catalonia.html", "text": "Carrer Petritxol is a narrow street! It's one of the narrowest streets we have walked on! Despite its lack of  ...  depth ..., however, it is full of shops! Shops of all types, some small, some quite small, and some rather large. There are plenty of cafes and the like, too. It is a tourist street, really, but it's worth going there!", "publishedDate": "2019-05-16", "language": "en", "rating": 4}, {"id": 624493124, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d8865719-r624493124-Carrer_Petritxol-Barcelona_Catalonia.html", "text": "Carrer Petritxol is a really nice street located in the Gothic Quarter ( Barri Gótic  ) .\nThe street is very much like many of the old town streets you will find in this part of town ,it's lined with cafes and restaurants and all manner of shopping outlets, it's a street most definitely aimed at the tourist market. \nThis street brings you into the heart of the historic old town of Barcelona with it's many plaza's and outstandingly beautiful architecture. \nA lovely street and well worth checking out. ", "publishedDate": "2018-10-13", "language": "en", "rating": 5}, {"id": 374166348, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d8865719-r374166348-Carrer_Petritxol-Barcelona_Catalonia.html", "text": "The street is definitely a tourist trap. The most expensive drink I bought in Spain was on this street. But even though it is a tourist trap, the chocolate sold on this street is incredible. Some of the best chocolate I have ever had in my life.", "publishedDate": "2016-05-18", "language": "en", "rating": 3}]}}]