[{"locationId": 11932643, "name": "Monument to Romul Bosch i Alsina", "placeType": "ATTRACTION", "reviewListPage": {"reviews": [{"id": 690356749, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d11932643-r690356749-Monument_to_Romul_Bosch_i_Alsina-Barcelona_Catalonia.html", "text": "This monument stands in tribute to Rómulo Bosch i Alsina, a Catalan doctor, politician and businessman. A former mayor of the city and chairman of the Board of Works of the Port of Barcelona where this sculpture stands.\n\nThe sculpture features a larger than life figure of Romul Bosch partly emerging from a large monolith. Only his upper torso and right leg is clearly visible, his shoulders are thrown back, causing his chest to appear disproportionately voluminous. I suppose it's supposed to represent the emergence of progress, but who knows.", "publishedDate": "2019-07-17", "language": "en", "rating": 4}, {"id": 676795200, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d11932643-r676795200-Monument_to_Romul_Bosch_i_Alsina-Barcelona_Catalonia.html", "text": "The Monument to Romul Bosch i Alsina is quite an unusual sculpture. Romul Bosch i Alsina was a doctor , politician and businessman from Catalonia. Among many other things he was directly responsible for the development and modernisation of the port area, hence the presence of his monument there. Worth checking out.", "publishedDate": "2019-05-27", "language": "en", "rating": 4}, {"id": 668785996, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d11932643-r668785996-Monument_to_Romul_Bosch_i_Alsina-Barcelona_Catalonia.html", "text": "Free\n24/7\nVisit Duration: 5 minutes\nLocation: Port of Barcelona \n\nThe monument to Romul Bosch i Alsina\nis standing Ilin front of the building of the port of Barcelona. The location of the monument is there due to his major role in allowing the development and modernization of the port. \n\nThe representation of Romul Bosch i Alsina shows a deformative figure. \n\nRómulo Bosch i Alsina (1853-1923)  was a doctor, politician and Catalan shipbuilder.  at the Port de Barcelona building, Port Vell, Barcelona, Catalonia, Spain, Europe", "publishedDate": "2019-04-23", "language": "en", "rating": 2}, {"id": 451981464, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d11932643-r451981464-Monument_to_Romul_Bosch_i_Alsina-Barcelona_Catalonia.html", "text": "You ought to the background for monuments, you pass on your way.\nMake a stop, and let your thoughts go back.\nRomul Bosch i Alsina (1852-1923) was a catalan physician, politician businessman.\nHe was president of the harbour of Barcelona.\nThe monument is made by Robert Krier in 1992.\nIt is located in front of the majestic building of the harbour of Barcelona.", "publishedDate": "2017-01-14", "language": "en", "rating": 3}]}}]