[{"locationId": 12606976, "name": "Placa de la Sagrada Familia", "placeType": "ATTRACTION", "reviewListPage": {"reviews": [{"id": 752397919, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d12606976-r752397919-Placa_de_la_Sagrada_Familia-Barcelona_Catalonia.html", "text": "This small area outside the massive Sagrada Familia is a fine place to sit and take in the surroundings if you don't intend to go into the Sagrada (which you should).  \n\nThere are a few street sellers around and a few beggars when we were there.\n\nIt will be interesting to see what the area looks like in a few years when the construction is complete.", "publishedDate": "2020-04-08", "language": "en", "rating": 4}, {"id": 739699492, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d12606976-r739699492-Placa_de_la_Sagrada_Familia-Barcelona_Catalonia.html", "text": "Amazing experience. Highly recommend to book tickets online. We booked the tickets for entrance and the guided tour, but we should have just gone with the audioguide. Our tour guide obviously does this over and over again all day, so he basically had to go through all the key points within the allocated time and there was limited time for questions. As it was, we were running a bit behind time and he had to rush the end part. \n\nAdditionally, I didn’t quite appreciate his references to the “creepy family” being the Holy Family (La Sagrada Familia literally translates to the Sacred (or Holy) Family). It kind of took away from the experience of being there at this amazing work which was Gaudi’s life’s work, and he was also reputed to be quite religious, so he probably wouldn’t have appreciated the “creepy family” references either. I understand that our tour guide was probably trying to be humourous, but honestly it wasn’t funny and nobody laughed. \n\nDespite this, it was still an incredible experience and I would absolutely, totally, do this again if I was in Barcelona! ", "publishedDate": "2020-01-17", "language": "en", "rating": 5}, {"id": 737606000, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d12606976-r737606000-Placa_de_la_Sagrada_Familia-Barcelona_Catalonia.html", "text": "The outside of La Sagrada Familia is totally incredible, but to tour the inside of this Cathedral is the only way to get the feel for the total structure and feeling the architects and founders had for this amazing place.  If you go to Barcelona and don't go inside of La Sagrada Familia you have missed on of the greatest works of the world!", "publishedDate": "2020-01-07", "language": "en", "rating": 5}, {"id": 735563292, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d12606976-r735563292-Placa_de_la_Sagrada_Familia-Barcelona_Catalonia.html", "text": "Love gaudis bit of the cathedral but not the new parts. The park is really busy and got street sellers.", "publishedDate": "2019-12-30", "language": "en", "rating": 3}, {"id": 735153670, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d12606976-r735153670-Placa_de_la_Sagrada_Familia-Barcelona_Catalonia.html", "text": "This is the most impressive building in Barcelona and is a must see. Construction machinery spoils the view a little", "publishedDate": "2019-12-28", "language": "en", "rating": 4}, {"id": 732646742, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d12606976-r732646742-Placa_de_la_Sagrada_Familia-Barcelona_Catalonia.html", "text": "Whoever wants to enjoy the masterpiece Sagrada Familia, but don't wish to enter or can't afford the ticket, can stay in the Placa and admire the architecture. \nIt's wonderful.", "publishedDate": "2019-12-14", "language": "en", "rating": 5}, {"id": 731655828, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d12606976-r731655828-Placa_de_la_Sagrada_Familia-Barcelona_Catalonia.html", "text": "We walked around part of this area as guide was explaining about the cathedral. We went in after the talk. Also in the area are vendors hawking their wares. I got 2 pairs of inexpensive earrings. Love to have momentos of the places we visit.", "publishedDate": "2019-12-09", "language": "en", "rating": 3}, {"id": 729659023, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d12606976-r729659023-Placa_de_la_Sagrada_Familia-Barcelona_Catalonia.html", "text": "I have seen many of the famous cathedrals in Europe to include the Vatican.  As a cathedral, inside, it lacks the religious historical character found in most others. Not only does the architecture differ, the feeling and emotions are different as well.  Like many other items in Barcelona, it reflects a modern look at the architecture.  The inside is smaller than expected.  Awesome design and intricate attention to detail.  Very open and light. ", "publishedDate": "2019-11-29", "language": "en", "rating": 3}, {"id": 726065058, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d12606976-r726065058-Placa_de_la_Sagrada_Familia-Barcelona_Catalonia.html", "text": "This small square is a great spot to gaze at the Sagrada Família and take photos. It,s small but relatively quite. It’s a calm spot relax and briefly escape the crowds that are queuing up to visit the Basilica.\n\nNote:  Best photos are probably taken in the morning. The sun tends to wash them out in the late afternoon.", "publishedDate": "2019-11-12", "language": "en", "rating": 5}, {"id": 722614159, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d12606976-r722614159-Placa_de_la_Sagrada_Familia-Barcelona_Catalonia.html", "text": "A lovely park taking up the block next to the Basilica. The space is much needed for children to blow off steam after being constrained by the respect necessary in the Church. A street performer was blowing loads of bubbles and the children (ours and lots of others) were loving running amok in them. ", "publishedDate": "2019-10-30", "language": "en", "rating": 5}, {"id": 714120259, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d12606976-r714120259-Placa_de_la_Sagrada_Familia-Barcelona_Catalonia.html", "text": "One of the most impressive buildings in Barcelona. We really enjoyed it.\nA must see when you are in Barcelona! ", "publishedDate": "2019-09-30", "language": "en", "rating": 5}, {"id": 713935641, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d12606976-r713935641-Placa_de_la_Sagrada_Familia-Barcelona_Catalonia.html", "text": "I've never seen such a detailed embellishment on a construction. It's the master of architecture art. I was fascinated by the magical combination of shapes and colors on the top of domes. However  the construction machines disturb the view of the cathedral and besides busy traffic around the building was so dangerous for tourists and local people.  Due to traffic we couldn't take good photos. ", "publishedDate": "2019-09-29", "language": "en", "rating": 4}, {"id": 713006450, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d12606976-r713006450-Placa_de_la_Sagrada_Familia-Barcelona_Catalonia.html", "text": "Buy your tickets in advance, it’s a major draw card so always busy, get the audio guide, it’s worth the few dollars. Enjoyed the visit allow a couple of hours.", "publishedDate": "2019-09-25", "language": "en", "rating": 5}, {"id": 689305892, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d12606976-r689305892-Placa_de_la_Sagrada_Familia-Barcelona_Catalonia.html", "text": "The Placa de la Sagrada Familia, as it’s name suggests is a garden squares adjacent to Sagrada Familia. There’s not an awful lot to see in the square, but it’s a fantastic spot  to get a good view of the church and for photos too. Just for that alone, I’m giving it a higher store, but otherwise there's little reason to visit the square though.", "publishedDate": "2019-07-13", "language": "en", "rating": 5}, {"id": 688510889, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d12606976-r688510889-Placa_de_la_Sagrada_Familia-Barcelona_Catalonia.html", "text": "Definitely our favorite place in Barcelona. We really loved sitting there with a drink while starring at this iconic building!", "publishedDate": "2019-07-10", "language": "en", "rating": 5}, {"id": 672997798, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d12606976-r672997798-Placa_de_la_Sagrada_Familia-Barcelona_Catalonia.html", "text": "Placa de la Sagrada Familia is a park across the road from La Sagrada Familia. It is not particularly exciting, but it does have lots of trees and bushes and a number of seats. You can walk around it, or you can just sit down and relax a bit. Some visitors tend to wait there for their group tours, but apart from this we did not find it particularly inspiring! But you could get some artistic photos of the cathedral from a good spot from the park.", "publishedDate": "2019-05-10", "language": "en", "rating": 3}, {"id": 660185323, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d12606976-r660185323-Placa_de_la_Sagrada_Familia-Barcelona_Catalonia.html", "text": "Seeing La Sagrada Familia was the highlight of our trip. I strongly recommend visiting this cathedral with a tour guide. There were a lot of unique facets of the church that I would have missed without the tour guide explaining it to us.", "publishedDate": "2019-03-21", "language": "en", "rating": 5}, {"id": 650329277, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d12606976-r650329277-Placa_de_la_Sagrada_Familia-Barcelona_Catalonia.html", "text": "If you have to wait for your tour to start for La Sagrada Familia, head across the street for some tranquility in the short stroll to get the largeness of La Sagrada ", "publishedDate": "2019-02-05", "language": "en", "rating": 5}, {"id": 650139318, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d12606976-r650139318-Placa_de_la_Sagrada_Familia-Barcelona_Catalonia.html", "text": "This is so beautiful inside it takes your breath away!!make sure you book or you may be disappointed. One thing to remember is not to use the bars near by there was 5 of us and we were charged 45euros for 5 beers!!!! It was the only time this happened but it was a lesson learnt!!!", "publishedDate": "2019-02-04", "language": "en", "rating": 5}, {"id": 635105326, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d12606976-r635105326-Placa_de_la_Sagrada_Familia-Barcelona_Catalonia.html", "text": "This is a small park but gives you a view of the Passion side of the Cathedral. Not much here to see and the ground is bare so sloppy if it is wet.", "publishedDate": "2018-11-22", "language": "en", "rating": 3}, {"id": 631958075, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d12606976-r631958075-Placa_de_la_Sagrada_Familia-Barcelona_Catalonia.html", "text": "Very nice square where you can spend some time. The views are just great. You can see the city and the cathedral of course :)", "publishedDate": "2018-11-08", "language": "en", "rating": 5}, {"id": 628383674, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d12606976-r628383674-Placa_de_la_Sagrada_Familia-Barcelona_Catalonia.html", "text": "Plaça De La Sagrada Familia is an open space that in theory is a great idea,a big open space for people to take in the amazing Sagrada Familia but in reality it's an overcrowded mass of tourists shoulder to shoulder trying to get the best views of Gaudi's unfinished masterpiece. \nThat said the views of the Sagrada Familia from here are stunning and the park adjacent is cool looking.\nMy twin brother Stephen and I were heading to The Michael Collins Irish Pub which is located on Plaça De La Sagrada Familia were we enjoyed a lovely pint of guinness looking out over to the amazing cathedral. \nWord of caution, as this is the number one tourist attraction in Barcelona,pickpockets and sneak thieves operate here so be on your guard and be vigilant of your valuables. \nA really nice plaza,well worth checking out for the views alone.\n", "publishedDate": "2018-10-26", "language": "en", "rating": 5}, {"id": 618235149, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d12606976-r618235149-Placa_de_la_Sagrada_Familia-Barcelona_Catalonia.html", "text": "Park is located across the street from the basilica and was packed with pushy tourists, mud and puddles everywhere, and bird droppings on the few benches provided. Saw more than a few panderers and homeless here as well. There are vendors who have set up stalls nearest the street selling souvenirs and snacks. Did not care for the place as it takes away from the solemnity and beauty of the basilica!", "publishedDate": "2018-09-20", "language": "en", "rating": 2}, {"id": 617743777, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d12606976-r617743777-Placa_de_la_Sagrada_Familia-Barcelona_Catalonia.html", "text": "Lovely little park to have a wonder around. You also get some tremendous views of the church if you want some pictures encompassing the entire thing! ", "publishedDate": "2018-09-18", "language": "en", "rating": 4}, {"id": 612700738, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d12606976-r612700738-Placa_de_la_Sagrada_Familia-Barcelona_Catalonia.html", "text": "This is a park opposite the Passion Facade of Sagrada Familia. The are some benches and food stalls but not much else to do here. It can be fairly crowded with people going to or coming from the Basilica. However, it is your best location to get pictures of this facade.  ", "publishedDate": "2018-08-31", "language": "en", "rating": 3}, {"id": 610184556, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d12606976-r610184556-Placa_de_la_Sagrada_Familia-Barcelona_Catalonia.html", "text": "This area is horrendously busy but offers good views of the front of the church and somewhere to but drinks and snacks.\n\nNot somewhere you want to linger dud to the crowds. ", "publishedDate": "2018-08-25", "language": "en", "rating": 3}, {"id": 601536824, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d12606976-r601536824-Placa_de_la_Sagrada_Familia-Barcelona_Catalonia.html", "text": "This is the weirdest church but coolest at the  same time it's not better than the church in Rome or basilica. They are not strict as it say on the website I saw several people with hats and shorts inside the church very disrespectful but that's on the staff .", "publishedDate": "2018-07-31", "language": "en", "rating": 4}, {"id": 593684410, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d12606976-r593684410-Placa_de_la_Sagrada_Familia-Barcelona_Catalonia.html", "text": "We bought tickets for the morning line. I think this was a god choice. Not to much people and the heat was low that early.\nIt is of course a big workign site, so you miss out a lot of the building. It is also closed for people to go inside the church. You just got to see the main hall and museums. \nVisiting the towers cost extra and you need a ticket. \nBut in the end, this place is mangnificent! Absolutly love it, and will come back if the opportunerty gives it. ", "publishedDate": "2018-07-06", "language": "en", "rating": 4}, {"id": 587255248, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d12606976-r587255248-Placa_de_la_Sagrada_Familia-Barcelona_Catalonia.html", "text": "The place is safe, huge space for walking and taking pictures. However, there is nothing much around and you can spend only about 15-20 mins here", "publishedDate": "2018-06-13", "language": "en", "rating": 4}, {"id": 583823006, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d12606976-r583823006-Placa_de_la_Sagrada_Familia-Barcelona_Catalonia.html", "text": "This large plaza surrounds the Cathedral and you can generally get excellent views of the exterior of the structure, at least the parts that are not obstructed by the masses of tourists. The plaza is overwhelmed with buses delivering tourists but they now have to move to an adjacent street for pick-up. Queues everywhere, visitors departing the Cathedral battling with the incoming. Its difficult to give a description of the plaza as you cannot get an unobstructed view, at least not on the occasion of our visit and the three drive pasts/stops on the hop-on-hop-off. We only took essentials from the tour bus on advice from the guide due to the many pickpockets and hawkers mingling with the crowds. Unfortunately one of our group had his mobile phone stolen from a side pocket.", "publishedDate": "2018-05-30", "language": "en", "rating": 4}, {"id": 581040978, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d12606976-r581040978-Placa_de_la_Sagrada_Familia-Barcelona_Catalonia.html", "text": "If you don't want to go inside the Sagrada Familia, the least you can do is visit the Placa de Sagrada Familia and see the Basilica from the outside. It is very impressive and well worth the visit. Go around the Basilica to see it from all sides (each front is different).", "publishedDate": "2018-05-18", "language": "en", "rating": 4}, {"id": 579945205, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d12606976-r579945205-Placa_de_la_Sagrada_Familia-Barcelona_Catalonia.html", "text": "Just one of the most amazing churches/structures ever.  Amazing.  Spectacular.  You really should pay for a guide otherwise you will miss alot of the symbolism.  Gaudi is truly amazing.  Outside is just fantastic and inside is awe inspiring.", "publishedDate": "2018-05-13", "language": "en", "rating": 5}, {"id": 572862139, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d12606976-r572862139-Placa_de_la_Sagrada_Familia-Barcelona_Catalonia.html", "text": "This a vary large park is located adjacent to La Sagrada Familia. Good location to get photos of the facade of the Sagrada. There are paths, benches and a playground with the park limits. There are also ticket kiosks and food stands within the park limits.The park is well lighted at night.", "publishedDate": "2018-04-12", "language": "en", "rating": 3}, {"id": 558460126, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d12606976-r558460126-Placa_de_la_Sagrada_Familia-Barcelona_Catalonia.html", "text": "This beautiful church is amazing, it has so much to see, I wouldn’t have even known the whole underneath is a walk through timeline if I hadn’t been looking for the bathroom, so make sure to go to the back and go down to the right and walk through \n\nI got lost in the detail and was amazed that 1882 was when it was started and going on till 2026 they have had so many end dates but it never happens \nHere are some pictures to enjoy", "publishedDate": "2018-02-04", "language": "en", "rating": 5}, {"id": 555857708, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d12606976-r555857708-Placa_de_la_Sagrada_Familia-Barcelona_Catalonia.html", "text": "We booked our tickets online the morning before going. When we got there, we met hundreds of people waiting to go in too. Whatever time your ticket is for, you need to be there at that time or you will not be let in nor will you get a refund. We saw people being refused entry. (There is a 10 - 15 minute grace period).  Anyway, hoping you get there on time, it is definitely a well worth visit. Such a gorgeous building, very interesting too. definitely pay the extra for the guided tour/audio tour.\n\nDisliked: I am not great with heights, so on the second part of the tour you are taken up one of the bell towers in a lift and then you walk back down. Although the views are amazing, the stair way is very narrow and quite claustrophobic. This was made with the heat too. So take a bottle of water and take your time. \n\nRobbie, Ireland", "publishedDate": "2018-01-23", "language": "en", "rating": 5}, {"id": 555218128, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d12606976-r555218128-Placa_de_la_Sagrada_Familia-Barcelona_Catalonia.html", "text": "100% worth visiting.\nBuy tickets online first as you have to queue separately to buy the ticket and then to enter. \nBUT GO AND SEE IT! ", "publishedDate": "2018-01-21", "language": "en", "rating": 5}, {"id": 540094248, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d12606976-r540094248-Placa_de_la_Sagrada_Familia-Barcelona_Catalonia.html", "text": "Barcelona is an amazing city and la Segrada Familia fits right in!  Approaching from the side I thought, what exactly is this? Gaudi is odd and this structure is odder! Stunning and beautiful inside.  Seeing really is believing! Upon arrival I had no idea that the cathedral was not complete. I believe there are still 9 years estimated to completion. Definitely a combination of art and history. I will definitely return to Barcelona to see it when it is complete. The detail is absolutely fabulous! The stained glass windows are breath-taking and the ceiling is magnificent! A must see!", "publishedDate": "2017-11-10", "language": "en", "rating": 5}, {"id": 539826620, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d12606976-r539826620-Placa_de_la_Sagrada_Familia-Barcelona_Catalonia.html", "text": "Gaudi is exceptional, one day this masterpiece will be finished.  For me it is living history and art entwined.", "publishedDate": "2017-11-09", "language": "en", "rating": 4}, {"id": 539649939, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d12606976-r539649939-Placa_de_la_Sagrada_Familia-Barcelona_Catalonia.html", "text": "Early Access Tour was Excellent and helped to beat the crowds!  Barcelona is unbelievable!  The beauty is breathtaking, the architecture, food, beaches and people are all beautiful.  Walked for miles just to take as much in as possible.  Transit is wonderful and easy, make sure to take your map with you, this is one of those cities that can be tricky to navigate.", "publishedDate": "2017-11-09", "language": "en", "rating": 5}, {"id": 538152655, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d12606976-r538152655-Placa_de_la_Sagrada_Familia-Barcelona_Catalonia.html", "text": "I had the pleasure of visiting Barcelona for the first time in 2008 and fell in love with this magical city. That’s when my love affair began with La Sagrada Familia. I remember the first time I saw the building as we walked up the street from our hotel. I was mesmerized by the quirky intricate details of the building but amazed that the basilica was still being constructed. At that time the exterior wasn’t under scaffolding so we got to really see the details of the exterior and the 2 facades of the resurrection and passion. The interior was under major construction and I distinctly remember touring the main portion of the basilica, the floor of the basilica was dirt and the workmen were sculpting large bunches of grapes. It was hard to imagine what this space would look like when it was complete.\nFast forward to our next visit and this time our visit was much different from the first time in 2008. As we made the same walk from our hotel to the Basilica, we noticed a dramatically different building that was covered with scaffolding. I still got the same magical feeling that I was about to see this amazing structure but in a very different way. We purchased our tickets and stood in line as we waiting to see the interior of the Basilica. As we entered the basilica, I got a small glimmer of color light as we entered and then a flood of multi colored lights that flooded in from the most break taking stain glass windows. The interior of the Basilica was just being finished and all I can say to describe it is Breath Taking!! The once dirt floor that we saw in 2008 had been replaced with beautiful marble flooring that lead you into a room of souring columns that took your eye up to the ceiling that was flooded with the most amazing mix of color from the stain glass windows. The photo that I attached is taken from the floor of the Basilica looking up to the top. On our first trip in 2008, the tours were closed to the public and we weren’t able to go up but this time we were able to get into the towers. This is a MUST DO if you want to see the Basilica from all aspects. It can be a little cloister-phobic at times and you get dizzy going around and around the spiral stairs but it’s so worth it!! Take the time to go up in the towers!!\n\nI can’t wait until my next trip to Barcelona to see what surprises this amazing structure has to unveil!! A MUST SEE if you go to Barcelona!", "publishedDate": "2017-11-03", "language": "en", "rating": 5}, {"id": 535419866, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d12606976-r535419866-Placa_de_la_Sagrada_Familia-Barcelona_Catalonia.html", "text": "First of all the place is enormous.  The detail on the facade is incredible .  Gaudi, the architect, was amazing.  It is so weird and different you can't help but to admire his work. Getting tickets is another story.  They only sell tickets by time slots, so you have to figure out how to get there at the time they give you--  Unless you are willing to pay 49e euros per person--then you can get a personal guide and go in immediately.  You can buy the tickets online--but again it will give you a time slot.  The place is crawling with tourists and its hard to get in.", "publishedDate": "2017-10-23", "language": "en", "rating": 5}, {"id": 534379999, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d12606976-r534379999-Placa_de_la_Sagrada_Familia-Barcelona_Catalonia.html", "text": "The building itself is amazing but their customer service is terrible. We had pre booked tickets for Sept 10th 2017 to go up the passion tower which cost us an extra €15 each on top of the entry price. We had only booked it 2 weeks before we travelled and when we got there they told us the towers were closed for maintenance!!! (You'd think they would know when the maintenance was scheduled for and NOT sell tickets for that time!!)\nWe were told a refund would be made to the card used to pay for it so my friend who had booked the tickets waited patiently and eventually 30 DAYS LATER she got a refund but they had only refunded half the money!!! When she emailed to inform them of the mistake she was told they wouldn't be refunding the cost of the audio guide because that service was still available.....HOW CAN YOU USE AN AUDIO GUIDE FOR SOMETHING YOU CANNOT GET TO? � \n\n18 emails later they are still refusing to refund the entire amount that we paid.\n\nThis was supposed to be a memorable trip for my friend who was celebrating a special birthday but it has been tainted by the, quite frankly, disgusting lack of service we have received from the customer service and I for one will not be recommending a visit!!!", "publishedDate": "2017-10-19", "language": "en", "rating": 1}, {"id": 533887870, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d12606976-r533887870-Placa_de_la_Sagrada_Familia-Barcelona_Catalonia.html", "text": "One of the most fascinating places I've ever been in my life. Every part is appealing and eye catching. You feel like you're part of a fairytale or part of heaven with the large pillars and the fantastical staircases.", "publishedDate": "2017-10-17", "language": "en", "rating": 4}, {"id": 533290028, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d12606976-r533290028-Placa_de_la_Sagrada_Familia-Barcelona_Catalonia.html", "text": "I'm far from a religious person but the pure architecture of this building is fascinating. Walking down the towers is worth it but do becareful, very narrow steps and slightly claustrophobic let alone hot. The actual church is amazing and is a memory that will live forever. Buy your tickets online, best way. Enjoy it. ", "publishedDate": "2017-10-15", "language": "en", "rating": 5}, {"id": 532142132, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d12606976-r532142132-Placa_de_la_Sagrada_Familia-Barcelona_Catalonia.html", "text": "We were there in June 2016 and it is an ongoing construction project. The tower and outside are magnificent and the stain glass windows from inside just breathtaking. Be sure to preorder your tickets. We did ours direct from their website, pretty easy, just be sure to keep to your timetable window, others you are not allowed in. We picked early evening as the sun was lowering down 5:30/6PM and actually had to taxi there from Las Ramblas to get there in time. They are very strict. The interior of the church was not finished, but you can see and appreciate the avant-garde design envisioned by Guadi so long ago.  You must see his \"houses\" as well, he is an artist to perfection.  By those tickets early. I think we did 2 months before our arrival. We stayed across the street and was able to view the towers from the hotel rooftop bar each evening after sightseeing, which was a nice treat as we sipped our sangria on our lounges.", "publishedDate": "2017-10-11", "language": "en", "rating": 5}, {"id": 531846748, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d12606976-r531846748-Placa_de_la_Sagrada_Familia-Barcelona_Catalonia.html", "text": "Running on about 0 hours of sleep we toured La Sagrada de Familia on an organized tour. The facades alone will take your breath away. The stained glass inside is soooo beautiful. When the sun hits the glass it transforms the inside of the cathedral. Truly a beautiful work. You feel the reverence. Would love to see it when it's completed. A must see if you visit Barcelona.", "publishedDate": "2017-10-10", "language": "en", "rating": 5}, {"id": 531314340, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d12606976-r531314340-Placa_de_la_Sagrada_Familia-Barcelona_Catalonia.html", "text": "worth viewing both inside and out, the architecture is amazing and just walking around gave you a sense of the beauty of the building. Check outside also and walk around as there is plenty to see. Magnificent", "publishedDate": "2017-10-09", "language": "en", "rating": 5}, {"id": 530865432, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d12606976-r530865432-Placa_de_la_Sagrada_Familia-Barcelona_Catalonia.html", "text": "This is a must see when in Barcelona.  This is the most amazing cathedral ever built.  Strongly recommend you buy tickets on line to avoid long lines and to make sure you can get in.  They sell out frequently.  Best time to go is early in the morning before most tourists arrive.  Purchase of the audio guide is well worth the money.  The views from the towers are amazing!  The inside is now finished and is incredible.", "publishedDate": "2017-10-07", "language": "en", "rating": 5}, {"id": 530224151, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d12606976-r530224151-Placa_de_la_Sagrada_Familia-Barcelona_Catalonia.html", "text": "I travelled to Barcelona with my daughter and we visited Place de la Sagrada Familia. We had to book tickets ahead of our planned visit. We booked our tickets in advance, which was very easy to book and hassle free. What can I say, Amazing architecture, breath taking, most extravagant. It was long queue to get in but it was worth it. It was very busy with loads of people local and visitors. Antoni Gaudi has done an amazing job.", "publishedDate": "2017-10-05", "language": "en", "rating": 5}, {"id": 526084817, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d12606976-r526084817-Placa_de_la_Sagrada_Familia-Barcelona_Catalonia.html", "text": "Amazing. One of the most beautiful buildings I have ever seen. It's a must!\nTickets need to be booked almost days in advance though so do not leave it until the day you want to go.", "publishedDate": "2017-09-20", "language": "en", "rating": 5}, {"id": 526013698, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d12606976-r526013698-Placa_de_la_Sagrada_Familia-Barcelona_Catalonia.html", "text": "Gaudi is clearly the master of breaking conventions, defying one's experience with cathedrals.  Never made it inside as we had no idea we needed to book in advance, but took it all in as we walked around the block it occupied.  Tough for photos given the constant cranes in several areas, but was able to see the layered towers (18 in total, I think) with various colorful tops to each spire.  A marvel, truly, but not a structure I would call exquisite or graceful or elegant.  Wonder what else will be added before its completion in 2030!", "publishedDate": "2017-09-20", "language": "en", "rating": 4}, {"id": 523902657, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d12606976-r523902657-Placa_de_la_Sagrada_Familia-Barcelona_Catalonia.html", "text": "This pretty green square gives you great views of the Sagrada Familia cathedral, so come and take a photo.  Busy place, always crowded and in the middle of a cool part of town.  Lots and lots of tourists.", "publishedDate": "2017-09-12", "language": "en", "rating": 4}, {"id": 523641013, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d12606976-r523641013-Placa_de_la_Sagrada_Familia-Barcelona_Catalonia.html", "text": "When visiting the sagrada familia there are a couple of things you should bear in mind, book tickets online, if not you will arrive to know that you have to wait at least an hour for the second allowed tickets and they might already be sold out so the wait can be pushed further. And even if you had purchased your tickets online make sure you get there before time so you can be early for the raw, keep in mind to wear comfortable shoes for inside the church there is another wait for the audio visual reception and for the elevator which takes you to one of the towers, once on top you will have 400 stairs to use to get down, so your legs will be sore the next day accordingly make sure you dont have lot of standing to do from the early morning.", "publishedDate": "2017-09-11", "language": "en", "rating": 5}, {"id": 522737326, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d12606976-r522737326-Placa_de_la_Sagrada_Familia-Barcelona_Catalonia.html", "text": "For our latest visit to Barcelona, we had booked a tour of the Sagrada Familia. The meeting point for the beginning of the tour was on one side of the huge square which surrounds the magnificent basilica. \nArriving early for the tour we had the opportunity to have a good look around the square and its park. The most obvious thing about the square was the hordes of people gathered there, taking photos of the Sagrada Familia. The basilica is so huge that it is very difficult to find an angle where you can get most of it in your photograph. Hence, the crowds of people in the square trying to get the best shot of the massive church.\nThe park located in the square, in front of the basilica has some nice shady trees with park benches located under them. The day of our visit was very hot and it was pleasant to be able to shelter from the sun under the shade of the trees.\nA nice square to visit but be prepared for large crowds of tourists!", "publishedDate": "2017-09-08", "language": "en", "rating": 4}, {"id": 521856372, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d12606976-r521856372-Placa_de_la_Sagrada_Familia-Barcelona_Catalonia.html", "text": "This Basilica is one of the most interesting buildings I've ever seen. It's hard to fathom Antoni Gaudi's vision & talent until you see this place. I did a guided tour of both the outside & inside and it was well worth it. Morning wasn't quite as busy. The light from the stained glass inside has to be seen to be believed, cameras cannot do its beauty justice. The museum below is fantastic to gain insight into Gaudi's inspiration & methods. An absolute must do!", "publishedDate": "2017-09-06", "language": "en", "rating": 5}, {"id": 521846408, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d12606976-r521846408-Placa_de_la_Sagrada_Familia-Barcelona_Catalonia.html", "text": "Try and go on a reasonable sunny day and get the audio translation it's amazing especially if you don't even have an interest in either art or architecture as this place combines both. Don't forget to see the catacombs beneath as well you can easily spend several hours here. Plus there are numerous bars and restaurants outside and nearby as well as quite a nice park ", "publishedDate": "2017-09-06", "language": "en", "rating": 5}, {"id": 521797902, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d12606976-r521797902-Placa_de_la_Sagrada_Familia-Barcelona_Catalonia.html", "text": "If you do not intend to visit La Sagrada Familia (you should) take minutes and do a 365º visit all around the basilica and see all the awesome details in the building façada!", "publishedDate": "2017-09-06", "language": "en", "rating": 4}, {"id": 518540014, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d12606976-r518540014-Placa_de_la_Sagrada_Familia-Barcelona_Catalonia.html", "text": "If you have ever been in a cathedral built in the 13th through 17th centuries, be prepared to be awed.  The lighting, the towering columns, and the overall, dramatic effect of this Gaudi vision will blow you away.  Greens and blues in the east-facing side of the basilica, and red and orange on the west-facing side leads to a mind-blowing experience of light.  The exterior is exceptional, with its various statues, but the interior has to be seen to be believed.  AWESOME!!", "publishedDate": "2017-08-28", "language": "en", "rating": 5}, {"id": 517729682, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d12606976-r517729682-Placa_de_la_Sagrada_Familia-Barcelona_Catalonia.html", "text": "We booked an excursion that took us on an all day tour to Barcelona and the surrounding area.\n\nArriving in Barcelona, our group walked to La Sagrada Familia.  We already had entry tickets as part of the excursion but we put €20 euros into the collection box.  It is very beautiful on the outside, but wow, when you go inside, it is utterly amazing!  High high ceilings with long blade-like structures reaching up incredibly high. Pale grey inside.\n\nTheres a model of La Sagrada when it's completed.  All created by Antoni Gaudi and by public donation only.  We spent about an hour in there.  La Sagrada is not Barceloba's Cathedral.  I love the stone carved and painted fruit high up at the base of most of the towers high above the streets.  Stunningly glorious.", "publishedDate": "2017-08-26", "language": "en", "rating": 5}, {"id": 517489707, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d12606976-r517489707-Placa_de_la_Sagrada_Familia-Barcelona_Catalonia.html", "text": "It was a great experience to visit this wonderful place in Barcelona! \nWe had a quick visit to see this historical church. \nIt was already late in the evening when we were around the area and still were people there. I suggest if you wanted to visit this place, make a booking in advance so can go inside the church.\n", "publishedDate": "2017-08-25", "language": "en", "rating": 5}, {"id": 516449655, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d12606976-r516449655-Placa_de_la_Sagrada_Familia-Barcelona_Catalonia.html", "text": "A visit to Barcelona would not be complete without a visit to La Sagrada Familia. Tickets must be purchased ahead of time. During our recent visit, I overheard numerous tourists told they could not gain entry that day or even the next, as all tickets were sold out. Even with a ticket, you must get there at least 15 minutes ahead of time. If you are late, you may be denied entry. The entrance is on the Nativity Facade side of the church i.e., on the opposite side from the Information booth. There are two lines, both will give entry to the same door of the cathedral. Security guards are very helpful and polite considering the number of tourists they speak to daily.\nSeeing the church/cathedral/basilica from the outside is awe inspiring but the interior is even more overwhelmingly and breathtakingly beautiful. An audio guide is a must. While people were there with their children, it is a place of worship and perhaps not appropriate for young children, as it is not an amusement park or typical tourist attraction. The minimum visit would require one to two hours, but we did not visit the tower on this occasion.", "publishedDate": "2017-08-22", "language": "en", "rating": 5}, {"id": 516417341, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d12606976-r516417341-Placa_de_la_Sagrada_Familia-Barcelona_Catalonia.html", "text": "Absolutely breathtaking! If you are even visiting for a short time I recommend going to see La Sagrada what a masterpiece and really special. \n\nWee hint: we bought skip the line tickets online and it came in so handy as the queues were 2hrs long in scorching heat! ", "publishedDate": "2017-08-22", "language": "en", "rating": 5}, {"id": 513359423, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d12606976-r513359423-Placa_de_la_Sagrada_Familia-Barcelona_Catalonia.html", "text": "One of the most beautiful places i have ever been. A must seen place !! Maybe the top attraction of Barcelona.", "publishedDate": "2017-08-15", "language": "en", "rating": 5}, {"id": 510016733, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d12606976-r510016733-Placa_de_la_Sagrada_Familia-Barcelona_Catalonia.html", "text": "The Cathedral is huge and special for those who like architecture and history. All the lines, little details and different styles would be recognized by an specialist. Once in a lifetime opportunity.", "publishedDate": "2017-08-08", "language": "en", "rating": 4}, {"id": 506674050, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d12606976-r506674050-Placa_de_la_Sagrada_Familia-Barcelona_Catalonia.html", "text": "La Sagrada Familia is a very impressive tourist attraction.  I definitely recommend seeing the church if you're in Spain or are a fan of Gaudi.  ", "publishedDate": "2017-07-29", "language": "en", "rating": 4}, {"id": 504928104, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d12606976-r504928104-Placa_de_la_Sagrada_Familia-Barcelona_Catalonia.html", "text": "Even if you are not catholic, this is a special \nPlace you need to visit if you are in Barcelona! \nI was speechless when I got to this magnificent Basilica, which it has not been finished. From what I understand it will be completed by 2020, yet other researches shows 2027!\nThe pictures shows the new part of the outside and also the original part built in the 1800 hundreds! \nThe outside of the Basilica is majestic it touches every fiber of your mind and body!\nThere are monuments-built with carved images of the birth of Jesus and his life events with the apostles in the outside.\nSpecial places also carved with images dedicated to many parts of the Bible.\nAntoni Gandi the last architect gave a gothic look yet it was authentic to the catholic religion!\nThe inside was beautiful but not comparison with the outside of the Basilica! See pictures of the inside as well.\nIf you do not want to get a tour group thru your hotel, you may buy tickets on line but make sure you are there earlier, otherwise you need to comeback later in the day or the next day. \nA must visit!", "publishedDate": "2017-07-23", "language": "en", "rating": 5}, {"id": 504527996, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d12606976-r504527996-Placa_de_la_Sagrada_Familia-Barcelona_Catalonia.html", "text": "Great place to visit. Make sure to order tickets online in advance. On a warm day - take the early sightseeing. Just across the road, is a small playground for kids.   ", "publishedDate": "2017-07-22", "language": "en", "rating": 4}, {"id": 500325981, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d12606976-r500325981-Placa_de_la_Sagrada_Familia-Barcelona_Catalonia.html", "text": "Quite simply, this has become the most magnificent building in the world!  It is absolutely breathtaking and unlike any other church or cathedral.  And it won't be completed until 2026.", "publishedDate": "2017-07-10", "language": "en", "rating": 5}]}}]