[{"locationId": 271008, "name": "Barri de Gracia", "placeType": "ATTRACTION", "reviewListPage": {"reviews": [{"id": 743936810, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d271008-r743936810-Barri_de_Gracia-Barcelona_Catalonia.html", "text": "Barri de Gracia is a really fun area to explore, with wonderful Moderne architecture scattered along the streets, along with a very pleasant local neighbourhood vibe. Nothing particularly touristy about it - just people going about their business in a really lovely place.", "publishedDate": "2020-02-09", "language": "en", "rating": 5}, {"id": 736189659, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d271008-r736189659-Barri_de_Gracia-Barcelona_Catalonia.html", "text": "I can't believe it has taken me 20 years to get to the Gracia district of Barcelona! It has the peaceful atmosphere of a small town with lots of interesting independent shops, bars and restaurants to explore. A slow walk down Carrer de Verdi is a must, Casa Vicens is amazing and look to the roof tops for many more beautiful Modernist buildings.", "publishedDate": "2020-01-01", "language": "en", "rating": 5}, {"id": 733020243, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d271008-r733020243-Barri_de_Gracia-Barcelona_Catalonia.html", "text": "My neighborhood of Garcia is Barcelona’s most charming district – developed as a separate village Gracia has its own personality. Lovely little streets and more than a dozen placas (squares) animate this vibrant district full of shops, restaurants and bars. Take the L3 Metro to Fontana, turn left then immediately right onto Carrer d'Astúries a pedestrian street full of unique shops. In a few minutes you will arrive at Plaça del Diamant. A bit further on the same street is Plaça de la Virreina. Stop for tapas and a drink. At the other side of the square, double back on Carrer de l'Or to Carrer de Verdi – Garcia’s best street for strolling. The street ends at another square Plaça de la Revolució, take a right at the other end of the square and your will arrive at Plaça del Sol, Garcia’s most famous square. From the edge of the square Carrer dels Xiquets de Valls takes you to the heart of the district is Plaça de la Vila de Gràcia. ", "publishedDate": "2019-12-16", "language": "en", "rating": 5}, {"id": 728707886, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d271008-r728707886-Barri_de_Gracia-Barcelona_Catalonia.html", "text": "It is not the most glamorous or the most historic, but is now full of young people out and about, eating and drinking.  Full of unique bars and restaurants, some ethnic, all at reasonable prices.  Street life is cool and amazing and there is some lovely Modernista design here as well.  We love this area.", "publishedDate": "2019-11-24", "language": "en", "rating": 5}, {"id": 723522055, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d271008-r723522055-Barri_de_Gracia-Barcelona_Catalonia.html", "text": "Loaded with great inexpensive restaurants and bars, some open squares where young people sit on the pavement with their drinks and chat the night away, lots of pedestrian streets full of strollers.  This is our favorite part of town.", "publishedDate": "2019-11-03", "language": "en", "rating": 5}, {"id": 709410907, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d271008-r709410907-Barri_de_Gracia-Barcelona_Catalonia.html", "text": "The Gracia Festival is not much frequented by tourists. So I hesitate to let the secret out.  But it's only a week in August, so I can't do too much harm.  But if, when you travel, you like to do the local things, then this is for you.  The neighborhood is largely closed to traffic.  Streets have a theme decorating contest and they really go all out.  My favorite was a Harry Potter theme.  There is outdoor music, food, drink, dancing.  We joined in learning a line dance with the locals.  We still had time to do a little shopping.", "publishedDate": "2019-09-13", "language": "en", "rating": 5}, {"id": 706359528, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d271008-r706359528-Barri_de_Gracia-Barcelona_Catalonia.html", "text": "In this quarter there is a lot of night live. And also a lot of restaurants. It is nice to sit there.", "publishedDate": "2019-09-04", "language": "en", "rating": 4}, {"id": 705346126, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d271008-r705346126-Barri_de_Gracia-Barcelona_Catalonia.html", "text": "Highly recommend spending a few hours wandering around Barri de Gracia. There are plenty of shops, restaurants and bars to check out as well as alleyways and streets to get lost in, take in the sights and get a feel for the local life.", "publishedDate": "2019-09-01", "language": "en", "rating": 5}, {"id": 702924879, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d271008-r702924879-Barri_de_Gracia-Barcelona_Catalonia.html", "text": "Take time, on the evening, full of life, small yards, dozen of bars and small restaurants, boutiques, self made small silverpieces to sell,, crowded with young people . Enjoy it. You need not to be bussy ir pressed on time, This part is an important historical corner from Barcelona, annexed to the city on the end of XIX century. Cars restricted. Bicycles and foot walking is welcome", "publishedDate": "2019-08-25", "language": "en", "rating": 5}, {"id": 701894121, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d271008-r701894121-Barri_de_Gracia-Barcelona_Catalonia.html", "text": "If you're there at the time for Fiesta de Gracia, this is a must. Each block seems to have its own theme, there are many stages set for live music, and there is cold draft beer (as well as other drinks) everywhere. It's a bit like a giant, crazy block party, and is well worth the visit!", "publishedDate": "2019-08-22", "language": "en", "rating": 5}, {"id": 696373085, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d271008-r696373085-Barri_de_Gracia-Barcelona_Catalonia.html", "text": "Very cute neighborhood with a charming and modest feel to it.  Full of little gift shops, cafes, restaurants, and benches to sit and watch passersby.  Not frequented by tourists much, but it has a casual and comfortable feel to it.", "publishedDate": "2019-08-06", "language": "en", "rating": 4}, {"id": 695474207, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d271008-r695474207-Barri_de_Gracia-Barcelona_Catalonia.html", "text": "Great place to stay very central and not crazy touristy. Great food and shopping too. Must go to Hofman restaurant loved the lunch options at most restaurants Mon - Fri between 1 and 3 pm. fixed price.. ", "publishedDate": "2019-08-04", "language": "en", "rating": 5}, {"id": 690551491, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d271008-r690551491-Barri_de_Gracia-Barcelona_Catalonia.html", "text": "We stayed in Gracia during our time in Barcelona and we really enjoyed it. Its almost like a little seperate town to Barcelona. Very quaint ", "publishedDate": "2019-07-18", "language": "en", "rating": 5}, {"id": 685727021, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d271008-r685727021-Barri_de_Gracia-Barcelona_Catalonia.html", "text": "The area is popular with artists and a generally bohemian crowd, it also has a high ethnic population and the highest concentration of foreign restaurants in Barcelona. Plaça de Sol is the most renowned area of the neighbourhood, it's lined with terrace cafes and at night this is where the people convene to drink and be merry. ", "publishedDate": "2019-07-01", "language": "en", "rating": 5}, {"id": 685568719, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d271008-r685568719-Barri_de_Gracia-Barcelona_Catalonia.html", "text": "If you go to Barcelona, get here before it becomes so \"gentrified\" it is no longer genuine. So far, it has managed to do the perfect dance between being trendy while still being mostly a local-based neighborhood. El Born is going to a similar transformation with less success.\nVibliolteca is a local gem. Tiny, but awesome. Bobby Gin and the Old Fashioned are two of the very best cocktail bars in the entire city. The main plaza on a sunday morning feels like a true neighborhood. Local families enjoying each other's company while their kids play.\nI will be sad to see it disappear, so enjoy it while it lasts.", "publishedDate": "2019-06-30", "language": "en", "rating": 4}, {"id": 682656667, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d271008-r682656667-Barri_de_Gracia-Barcelona_Catalonia.html", "text": "My favourite spot in the city. Lose yourself for hours, or even days in the \"city of liberty\". It's all about Barcelona. ", "publishedDate": "2019-06-19", "language": "en", "rating": 5}, {"id": 682274899, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d271008-r682274899-Barri_de_Gracia-Barcelona_Catalonia.html", "text": "Gracia is like a little bohemian village full of hipsters, yogis, and artisans. A wonderful place where families and expats live. Like most barrios Gracia has, it's own shopping district as well as tons of independent stores. In Summer the Gracia festival is the place to be to soak up lots of live music, drink, and dance into the early hours of the morning. This is a must see spot in the city that is not too far from the central area. Why not grab a bike and check it out or jump on the metro.", "publishedDate": "2019-06-17", "language": "en", "rating": 4}, {"id": 680036265, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d271008-r680036265-Barri_de_Gracia-Barcelona_Catalonia.html", "text": "Perhaps a good place to live, but probably not of great touristic interest except for the Park Güell.", "publishedDate": "2019-06-08", "language": "en", "rating": 3}, {"id": 677555836, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d271008-r677555836-Barri_de_Gracia-Barcelona_Catalonia.html", "text": "if you go before 8 it's free and you miss the crowds, otherwise you have to book a time and pay\n\nlovely architecture and lovely gardens to wonder around", "publishedDate": "2019-05-30", "language": "en", "rating": 5}, {"id": 676767029, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d271008-r676767029-Barri_de_Gracia-Barcelona_Catalonia.html", "text": "It gets crowded very easily, but we really liked this area, there were some nice shops and restaurants, it’s not a very touristic area yet but there are still some people. Some very nice walks and a lot to see with this beautiful architecture!", "publishedDate": "2019-05-27", "language": "en", "rating": 5}, {"id": 584173811, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d271008-r584173811-Barri_de_Gracia-Barcelona_Catalonia.html", "text": "The Gracia area is small streets north of Diagonal and around Passieg de Garcia and is worth a visit . It is quite different to the area below Diagonal and it has small stores and restaurants and interesting squares.Worth a visit.", "publishedDate": "2018-05-31", "language": "en", "rating": 3}, {"id": 583989814, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d271008-r583989814-Barri_de_Gracia-Barcelona_Catalonia.html", "text": "This is a must see and you'll keep going back.  So much history, restaurants, quaint stores. Really cool", "publishedDate": "2018-05-30", "language": "en", "rating": 5}, {"id": 583808441, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d271008-r583808441-Barri_de_Gracia-Barcelona_Catalonia.html", "text": "The area of Gracia represents one of  the most traditional  and eclectic neighborhoods in Barcelona.  It was only absorbed by the City in the late 19th century and, some say, still retains its village character. It is the area where we arrived unintentionally. There are cobblestone streets, laneways, plazas, shady trees, restaurants, cafes, artisan workshops and more. It seems to be a backpackers paradise judging by the numbers of teens and older with backpacks and a variety of luggage, maps in and, going about their business. Many Catalan flags in evidence fluttering proudly from the houses..", "publishedDate": "2018-05-30", "language": "en", "rating": 5}, {"id": 583524763, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d271008-r583524763-Barri_de_Gracia-Barcelona_Catalonia.html", "text": "We thought that we were heading towards our hotel, but, after asking for assistance, found that we were heading in the opposite direction; we were in the Gracia neighbourhood. It was similar to Eixample in many aspects but for the narrower streets. There were many shops, some of them upmarket, restaurants, artisan shops, etc. It seemed that most restaurant customers were eating outside, the place had a real casual feel. There are many small plazas to enjoy, tree lined streets and more of Gaudi's creations. We finally arrived at Passeig de Gràcia and headed to the hotel.", "publishedDate": "2018-05-28", "language": "en", "rating": 5}, {"id": 579734994, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d271008-r579734994-Barri_de_Gracia-Barcelona_Catalonia.html", "text": "There are excellent free audio guides for this area eg Rick Steve’s which I really recommend. Beautiful architecture ", "publishedDate": "2018-05-12", "language": "en", "rating": 4}, {"id": 576819076, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d271008-r576819076-Barri_de_Gracia-Barcelona_Catalonia.html", "text": "this area is very beautiful and diferent than others areas in the city, it seems like another town into the city, we saw a lot of catalonian flags, it seems more catalan area", "publishedDate": "2018-04-30", "language": "en", "rating": 4}, {"id": 576442733, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d271008-r576442733-Barri_de_Gracia-Barcelona_Catalonia.html", "text": "Lots of things to see and do as you visit this area of Barcelona.  It was actually an independent town until the late 19th century and people who live there don't say they are from Barcelona but from Gràcia. It has the largest concentration of foreign restaurants in the city so if you're ready to try something different...be sure to visit!", "publishedDate": "2018-04-29", "language": "en", "rating": 5}, {"id": 573375066, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d271008-r573375066-Barri_de_Gracia-Barcelona_Catalonia.html", "text": "This is one of Barcelona's most interesting quarters, full of good food, markets and beautiful architecture, some lovely squares.  Served by the Metro.  I would like to live here one day.  Lots to see & do, life is good.", "publishedDate": "2018-04-14", "language": "en", "rating": 5}, {"id": 572277944, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d271008-r572277944-Barri_de_Gracia-Barcelona_Catalonia.html", "text": "The Gracia is the place to stay in Barcelona.  It's right on the Metro line so you are in the thick of things within minutes but it's removed from the chaos of the Ramblas, Gothic and the Eixample.  We stayed by a quaint little plaza with only one or two tourists, inlcuding us.  Families, school friends, and neighbors visited the two cafes.  After a day of seeing all that Barcelona has to offer, it was great to come 'home' to the Gracia and enjoy the peace and quiet of a small community.  It will make your vacation a dream if you stay here but visit it for sure while you are here.", "publishedDate": "2018-04-09", "language": "en", "rating": 5}, {"id": 570969834, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d271008-r570969834-Barri_de_Gracia-Barcelona_Catalonia.html", "text": "Excellent urban area within reach of the city centre and all nearby metros. Worth a visit, a walk and admiration of the local architecture ", "publishedDate": "2018-04-04", "language": "en", "rating": 4}, {"id": 569121098, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d271008-r569121098-Barri_de_Gracia-Barcelona_Catalonia.html", "text": "gorgeous buildings and art to explore. spend the day photographing local streets and individual buildings", "publishedDate": "2018-03-27", "language": "en", "rating": 4}, {"id": 568296791, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d271008-r568296791-Barri_de_Gracia-Barcelona_Catalonia.html", "text": "This whole area is nice. I like to walk around. Different people will see different things in this barrio. Three are many bars, restaurants and just the feeling of the area is good.\n\nThere are nice places to sit and admire", "publishedDate": "2018-03-23", "language": "en", "rating": 5}, {"id": 567352093, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d271008-r567352093-Barri_de_Gracia-Barcelona_Catalonia.html", "text": "To the north and up on rising ground, but easy to get to by metro and city bus. Once a small independent town, but  absorbed by the \"expansion\" when the city fathers set out the grid iron pattern of roads that is now modern Barcelona. Gracia retained it's street pattern and quirky little back alleys.\n\nNow suffering heavy over gentrification and climbing rents a lot of the original character is fast going, More gift shops, trendy wine bars but you will find some bits left alone. Placa del Sol the most well known a popular spot to meet, chat and eat, A huge under ground car park has turned the placa itself into a concrete car park roof.\n\nThere are smaller more intimate open spaces, and a community of artists, writers, musicians of all nationalities. Also a tradition of theatre, dance and film. Take an good walk around on a nicer day.", "publishedDate": "2018-03-18", "language": "en", "rating": 4}, {"id": 566315961, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d271008-r566315961-Barri_de_Gracia-Barcelona_Catalonia.html", "text": "Marked by its unique narrow streets and small public squares, this old district of Gracia was an independent town until 1897. You will experience the lively essence of Barcelona as you walk through this area with its mix of  traditional shops, bars, restaurants and houses of modernista architecture such as Gaudis Casa Vicens and Montaners Casa Fuster. During the month of August a traditional festival called Festes de Gracia is held. During these eight days the area springs to like with color, streamers, decorations, parades and lot of fun-n-frolic. A unique neighborhood of Barcelona indeed !", "publishedDate": "2018-03-13", "language": "en", "rating": 3}, {"id": 562936846, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d271008-r562936846-Barri_de_Gracia-Barcelona_Catalonia.html", "text": "Today is part of the city and is where tourists who want to spend a little longer season in the city visit.close to everything but a little away from the noise of the center. is very friendly with vegetarians", "publishedDate": "2018-02-26", "language": "en", "rating": 5}, {"id": 559143232, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d271008-r559143232-Barri_de_Gracia-Barcelona_Catalonia.html", "text": "I loved Gracia! It's well connected to the city centre, but it's a city on its own. Delicious places and bars, funny people, great stores (I'm a vinyl addicted and I found good place to shop, Lostracks Record, in Carrer de Vic, 5 minutes away from our B&B).\n\nI can't wait to go back to Gracia!", "publishedDate": "2018-02-07", "language": "en", "rating": 5}, {"id": 558935976, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d271008-r558935976-Barri_de_Gracia-Barcelona_Catalonia.html", "text": "Barri de Gracia is the area just below the Park Guell. The metro doesn't go to the park so if you're on public transportation, you'll probably walk through this neighborhood. It's not very touristy, with shops for the locals. Most of the architecture is pretty utilitarian. The area around the sanitarium is a little nicer and starts the climb up the hill to the park.", "publishedDate": "2018-02-06", "language": "en", "rating": 4}, {"id": 556179104, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d271008-r556179104-Barri_de_Gracia-Barcelona_Catalonia.html", "text": "This is a cute, lively area.  Small, narrow streets, lots of plazas.  Lots of restaurants with and without out door dining.  Good accepts to transportation.  Walk down passeig de Gracia. Go to Casa Vincens (Gaudi's first house recently re-opened)", "publishedDate": "2018-01-24", "language": "en", "rating": 5}, {"id": 553617045, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d271008-r553617045-Barri_de_Gracia-Barcelona_Catalonia.html", "text": "All the fun stores and restaurants are minutes away. Once you leave Las Ramblas, this area is great to stroll, eat and shop.", "publishedDate": "2018-01-13", "language": "en", "rating": 5}, {"id": 552227674, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d271008-r552227674-Barri_de_Gracia-Barcelona_Catalonia.html", "text": "Catalan version of Camden Town in London: labyrinth of cobbled roads and narrow alleyways. \nThe many squares are frequented by the many young folk that gather on the steps, benches or just sit on the pavements. People watching from the coffee shops, bars and tapas houses is a very effortless pastime ", "publishedDate": "2018-01-07", "language": "en", "rating": 4}, {"id": 550804656, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d271008-r550804656-Barri_de_Gracia-Barcelona_Catalonia.html", "text": "If you search a place to sit and chill or to relax a little bit, go to Barri de Gracia, a nice area to walk, nice reposant restaurants, a charming place to explore and relax.", "publishedDate": "2018-01-01", "language": "en", "rating": 5}, {"id": 540276608, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d271008-r540276608-Barri_de_Gracia-Barcelona_Catalonia.html", "text": "I wouldn't say this is a must do or really special but it's a charming neighbourhood to walk around. Go if you near by.", "publishedDate": "2017-11-11", "language": "en", "rating": 4}, {"id": 537961438, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d271008-r537961438-Barri_de_Gracia-Barcelona_Catalonia.html", "text": "Get a map of the area so you dont miss all the Plazas, about 5. Lovely interesting streets with good food and drink establishments mixed throughout. If you are lucky go when the town  festival is being celebrated. Great decorations and activities. Lovely area, easy access with metro or buses. ", "publishedDate": "2017-11-02", "language": "en", "rating": 5}, {"id": 533753834, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d271008-r533753834-Barri_de_Gracia-Barcelona_Catalonia.html", "text": "We love the barri de Gracia, very quaint, less crowded, and plenty to see. We did a lot of walking around the area, restaurants galore, locals, and shopping. Favorite part of the city. ", "publishedDate": "2017-10-17", "language": "en", "rating": 5}, {"id": 533655209, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d271008-r533655209-Barri_de_Gracia-Barcelona_Catalonia.html", "text": "Just a fun place to be and wander around a bit. Low pressure, great places to have something to eat and just hang out a bit! It lets you feel as though you are in a real living town, not just a tourist site! Watch out for opening times, you can find yourself looking at a locked doors as we did, until we found the Sabio Infante cafe and relaxed for a while till the shops reopened.", "publishedDate": "2017-10-17", "language": "en", "rating": 5}, {"id": 532525551, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d271008-r532525551-Barri_de_Gracia-Barcelona_Catalonia.html", "text": "Want some tapas? Want to get away from all those tourists? Go to Barri de Gracia!!! Here you'll find many restaurants, bars and tapas places to sit and chill in a tourist free atmosphere. Visit Carrer de Verdi, famous for its restaurants and tapas bar. Make sure you go early as it tends to be crowded at night. After tapas, go to plaza del sol and just blend with locals doing the traditional spanish botellon (many people drinking in public spaces directly from the bottle). You'll have the time of your life. ", "publishedDate": "2017-10-13", "language": "en", "rating": 5}, {"id": 528544413, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d271008-r528544413-Barri_de_Gracia-Barcelona_Catalonia.html", "text": "Barri de Gracia is a city inside the city of Barcelona. The hood is like a small city with not so high buildings nice squeres and lovely restaurants. You should go there.", "publishedDate": "2017-09-30", "language": "en", "rating": 3}, {"id": 528124443, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d271008-r528124443-Barri_de_Gracia-Barcelona_Catalonia.html", "text": "I was so charmed by this neighborhood that I hope to return and stay here in a tourist apartment.  Full of interesting cafes and restaurants, lots of ethnic food.  Some splendid architecture and lots of street life.  Away from the tourist bustle.", "publishedDate": "2017-09-28", "language": "en", "rating": 5}, {"id": 526622123, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d271008-r526622123-Barri_de_Gracia-Barcelona_Catalonia.html", "text": "This area of Barcelona is a fun area to visit to escape some of the tourist crowds.  It has more of a true Barcelona feel.  It also is somewhat hipster and urban chic, yet entirely unpretentious.  This would be the kind of neighborhood that if you lived in Barcelona, you would want to hang out in.", "publishedDate": "2017-09-22", "language": "en", "rating": 4}, {"id": 525847920, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d271008-r525847920-Barri_de_Gracia-Barcelona_Catalonia.html", "text": "We had a great walking tour conducted free, buy a company that meets at the Catalunya plaza, and accepts tips for the tour guide if you are pleased at the end of the tour. Our guide was Zoe, and she did a great job of showing us points of interest throughout the Barri de Gracia. Wonderful history and stories, and just enough to set you off in the areas that you want to explore further ", "publishedDate": "2017-09-19", "language": "en", "rating": 5}, {"id": 525725624, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d271008-r525725624-Barri_de_Gracia-Barcelona_Catalonia.html", "text": "Different guidebooks tell the story about Gracia previous being a separate village. However, today it is part of the metropolitan area of Barcelona. Of course, it still has special traits, but that is also the case for other districts in Barcelona, e.g. my favourite district Poblenou.", "publishedDate": "2017-09-19", "language": "en", "rating": 4}, {"id": 525694332, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d271008-r525694332-Barri_de_Gracia-Barcelona_Catalonia.html", "text": "A visit to the neighbourhood of Gracia was recommended to us by the receptionist at our hotel.  We walked through this traditional but  vibrant section of Barcelona after visiting Park Guell.  The “village” is self sufficient and its inhabitants like to think of themselves as separate from Barcelona.  We ate our lunch in one of many cafes dotted throughout the neighbourhood.  Casa Vicens, the first house designed by Gaudi, is also located in Barri de Gracia.", "publishedDate": "2017-09-19", "language": "en", "rating": 5}, {"id": 524406641, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d271008-r524406641-Barri_de_Gracia-Barcelona_Catalonia.html", "text": "This whole area is a bit of a local gem.  Doesn't seem to be too many tourists.  Lots to see in this area.  It is full of small shops, restaurants, cafes, bars.  The atmosphere of the tiny streets with very little to no cars was truly the highlight of our trip.  We spent several days and nights in this area never really tiring of the walking and experiencing.  At night this place comes alive.  At midnight and later during the week there are thousands of people out having a drink with friends, a few snacks, some good times.  I travel almost continuously and it is hard to find a place with so much to offer in a small area.  The feel and character was so nice.  Will be back for sure, maybe to live down the road, who knows.", "publishedDate": "2017-09-14", "language": "en", "rating": 5}, {"id": 522775137, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d271008-r522775137-Barri_de_Gracia-Barcelona_Catalonia.html", "text": "Our most recent visit to Barcelona saw us take another long walk from La Rambla to visit the Sagrada Familia. During a previous stay in Barcelona, we had done the same long walk. On that occasion we had particularly enjoyed walking through the Barri de Gracia neighbourhood. \nTherefore whilst on this most recent walk, we allowed ourselves a bit more time to take in some more views of the fascinating and unique architecture of many of the buildings to be found in this area.\nThe wide tree-lined boulevards in this locale maintained, the same charm and appeal for us, as they had, on our previous visit.\nCertainly take some time to have a look at this delightful neighbourhood, if you are making your way from central Barcelona to the Sagrada Familia, on foot.", "publishedDate": "2017-09-09", "language": "en", "rating": 5}, {"id": 522512421, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d271008-r522512421-Barri_de_Gracia-Barcelona_Catalonia.html", "text": "One of the things I liked the most in Barcelona is to walk around an area to find nice buildings, plazas and charming cafeterias and international restaurants. Barri de Gràcia is one of those places where you like to get lost and just see what is around the corner. You can drink sangria in a sunny plaza or eat a portion of pizza to go. Besides, this area is not as crowded as the rest of the city.", "publishedDate": "2017-09-08", "language": "en", "rating": 4}, {"id": 518237957, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d271008-r518237957-Barri_de_Gracia-Barcelona_Catalonia.html", "text": "Lots of individual, quirky shops, bars & restaurants. Full of locals, so a good sign! A good area to just wander around and soak up some local atmosphere. ", "publishedDate": "2017-08-28", "language": "en", "rating": 5}, {"id": 514613457, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d271008-r514613457-Barri_de_Gracia-Barcelona_Catalonia.html", "text": "I was lucky enough to visit them through Festa de Gracia, an annual festival held for a week after the 15th August, featuring plently of beautiful sights. Gracia is a very pretty place in Barcelona, definitely worth getting lost in the streets or drinking a beer at Plaza del Sol.", "publishedDate": "2017-08-17", "language": "en", "rating": 4}, {"id": 513130866, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d271008-r513130866-Barri_de_Gracia-Barcelona_Catalonia.html", "text": "This place is crazy. It is like a little suburb in the middle of a huge city.\n\nJust a couple of metro stops from Plaza Catalunya, it's like walking into another place. It's tranquil and calming, you would never believe it if you don't see it for yourself.\n\nMake sure you visit during the fiestas in August. All the streets are decorate and there is just the best party atmosphere.", "publishedDate": "2017-08-15", "language": "en", "rating": 5}, {"id": 507085176, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d271008-r507085176-Barri_de_Gracia-Barcelona_Catalonia.html", "text": "Experience a glimpse of village life within the bustling tourist chaos of Barcelona. \nJust a short walk up the Passeig de Gracia and you end up in Gracia - explore the placas and enjoy the authenticity of an area less exposed to tourism.", "publishedDate": "2017-07-30", "language": "en", "rating": 5}, {"id": 505221861, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d271008-r505221861-Barri_de_Gracia-Barcelona_Catalonia.html", "text": "Last time in Baracelona, I never made it to Gracia.  So I planned to spent some time walking through it while on my way to Tibidabo and going by Casa Vicens. I had a nice walk through the neighborhood and enjoyed seeing Casa Vicens as well as Placa de Trilla.", "publishedDate": "2017-07-24", "language": "en", "rating": 3}, {"id": 500679261, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d271008-r500679261-Barri_de_Gracia-Barcelona_Catalonia.html", "text": "Interesting neighborhood, fighting against globalization to keep its traditions (uneven battle unfortunately). Great festivity in August: Festes de Gràcia", "publishedDate": "2017-07-11", "language": "en", "rating": 4}, {"id": 495988021, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d271008-r495988021-Barri_de_Gracia-Barcelona_Catalonia.html", "text": "Situated in the central southern part, this really is the heart of the city, with the cathedral amid many narrow streets full of life, shops and old houses. A great place to start your visit of Barcelona.", "publishedDate": "2017-06-25", "language": "en", "rating": 5}, {"id": 490591855, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d271008-r490591855-Barri_de_Gracia-Barcelona_Catalonia.html", "text": "The Barcelona district known as “Barri de Gràcia” is formed in its entirety by a group of houses in streets usually narrower than the average Barcelona streets, some buildings in that district dating back to the nineteenth century or the beginning of the twentieth. Until the end of the nineteenth century, Gràcia used to be a borough autonomous from the city of Barcelona at a municipal level, with its own authorities and local municipal system. Due to the fact that Barcelona spread out considerably Gracia was then embraced by that city thus becoming a part of its urban ensemble. Still nowadays there is what is called the Gràcia Town Hall in the Plaça Vila de Gràcia where a council holding limited powers sits from time to time to deal with matters in connection with the district.\nAs stated, most of the district streets are relatively narrow with no much traffic. Therefore, strolling along those streets is rather pleasant. Sometimes one can even have the feeling that he is not in a big city like Barcelona but rather in a village as the atmosphere of past times is somehow preserved. Of course there are some urban roads where the traffic is heavier, such as Gran de Gràcia, Travessera de Gràcia, Travessera de Dalt and carrer Escorial. In order to have a nice walk it’s recommendable to avoid such roads. It’s possible to go to that district by tube. Then it’s advisable to get out at Fontana station and one is already full in the district. One of the streets where that station stands is carrer Asturias, which is a pedestrian road and starting from there it’s a good way to commence a tour within the district. Another possibility would be to get out at Diagonal tube station and then walk up towards the Plaça Vila de Gràcia along, for instance, carrer St. Pere Martir and from the said square towards carrer Verdi sauntering along Ramón y Cajal and Plaça de la Revolució and continue towards travessera de Dalt. Some beautiful squares appear from time to time when walking at random in the district: the already stated Plaça Vila de Gràcia, as well as the Plaça del Sol, Plaça de la Virreina, Plaça del Diamant, Plaça Rovira I Trias, Plaça del Nord, etc. In those squares there are usually some good terraces where it’s very pleasant to sit for a while and have a drink. In the first one of those just mentioned, the terrace of the Bar Nou Candanchú is particularly agreeable.\nThe district concerned is plenty of cafés, bars and restaurants. It’s currently in fashion so that many youngsters abound in its streets, squares and in the said commercial premises. Apart from the interest that the district itself arouses one can come across some interesting buildings when taking a stroll in its streets. For example, in carrer Carolinas, on the left hand side of carrer Gran de Gràcia going towards Plaça Lesseps there is a beautiful modernist building by Gaudi (Casa Vicens). Likewise there are two markets, one on each side of the said carrer Gran de Gràcia. It’s advisable to visit them and even to buy some fruit there. Some churches, such as that of St. Pere, and small parks are also worth being visited.\nSometimes special events are held in that district and occasionally some streets or parts of them are closed to the traffic so that pedestrians can walk freely on the roadway with no risk whatsoever. In summer, from August 15th and for a whole week there are the district festivities (fiestas de Gracia) and then manifold events take place in the open air: music, dance, companionship repasts, games for children and for adults, fireworks, etc. At that time many streets or sections of them are closed to the traffic and they are decorated in a very peculiar, funny, clever and witty manner. A ceiling-like scheme is placed at a certain height. It’s made of slips of paper or some other objects such as plastic bottles or cans or incredible items. Besides, some figures made of cardboard or papier mâché and over elevated platforms representing ships, castles, houses, etc. made of wood, cloth or also cardboard are placed somewhere in the middle or the sides of the streets concerned. Some plastic swimming pools for the children are also displayed and the whole is very colourful, showy, gay and interesting. During that time of course the saunter along the streets adorned in the way described is even exciting and a highly recommendable activity so as to observe a unique pageantry which exists pretty much nowhere else. Unfortunately, most of those papier mâché or cardboard figures don’t last untouched until the end of the festivities as they are subject to vandalism. Therefore one or two days after their having been set up just a few remain unscathed and it’s a shame to see that many of them have been therefore mutilated, maltreated or abused. This can of course be considered as an example of the primitive and uneducated temperament of most of Spanish people.", "publishedDate": "2017-06-05", "language": "en", "rating": 5}, {"id": 486101433, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d271008-r486101433-Barri_de_Gracia-Barcelona_Catalonia.html", "text": "Short walk from Passeig de Gracia/Diagonal.  All restaurants/bars/tour bus very accessible.  Lovely quiet bohemian area with late night bars but never rowdy or too noisy.  Recommend.", "publishedDate": "2017-05-21", "language": "en", "rating": 5}, {"id": 484682934, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d271008-r484682934-Barri_de_Gracia-Barcelona_Catalonia.html", "text": "BoHo/creative/neighborhood area. A bit slower pace and more locals. Less people than the main tourist areas. Lots of great shops and restaurants to explore. I would definitely recommend wandering through here.", "publishedDate": "2017-05-16", "language": "en", "rating": 5}, {"id": 482419568, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d271008-r482419568-Barri_de_Gracia-Barcelona_Catalonia.html", "text": "Old district of Barcelona with special atmosphere. Day or night always is interesting. Just walk, enter in any small shop, or just take some tapas in any bistrot!", "publishedDate": "2017-05-07", "language": "en", "rating": 5}, {"id": 482030112, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d271008-r482030112-Barri_de_Gracia-Barcelona_Catalonia.html", "text": "Originally outside the city of Barcelona, Gracia still retains a village feel with lots of quirky independent shops and some great squares to visit. It's a really lovely neighbourhood and a great area to stay in and a bit quieter and slow paced although still pretty accessible to everywhere you would want to see. ", "publishedDate": "2017-05-06", "language": "en", "rating": 5}, {"id": 476194212, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d271008-r476194212-Barri_de_Gracia-Barcelona_Catalonia.html", "text": "This is a great area. A maze of streets and small squares with small shops, bars and restaurants. There is the odd collection of market stalls, interesting architecture, colour and graffiti. \nWorth a visit but take a map- it's easy to lose your bearings!", "publishedDate": "2017-04-16", "language": "en", "rating": 4}, {"id": 474999292, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d271008-r474999292-Barri_de_Gracia-Barcelona_Catalonia.html", "text": "North of Diagonal, there is this neighbourhood where you can feel a little bit more of the real Barcelona life. You are most welcome along the locals, children come out after school and play in the streets or on the places... Food is day to day food and lovely streets with coloured buildings and more approachable people. Little markets all around !", "publishedDate": "2017-04-12", "language": "en", "rating": 5}, {"id": 472874865, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d271008-r472874865-Barri_de_Gracia-Barcelona_Catalonia.html", "text": "if POBLENOU wasnt my favorite neighboorhoud because of the non-touristic area and the proximity to the beach, then GRACIA would definitely be! It is so wonderful to walk through the small streets that are all so colorful. You have so many diverse restaurants and Gracias offers a lot of festivals and festivities throughout the year. ", "publishedDate": "2017-04-05", "language": "en", "rating": 5}, {"id": 472393279, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d271008-r472393279-Barri_de_Gracia-Barcelona_Catalonia.html", "text": "This quarter of the city has a fashion level and artistic prestigious ambient focused in their squares", "publishedDate": "2017-04-03", "language": "en", "rating": 5}, {"id": 468628250, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d271008-r468628250-Barri_de_Gracia-Barcelona_Catalonia.html", "text": "It's worth taking a metro to visit this REAL neighbourhood not inundated with tourists where real Catalonians live.  Pretty streets with many squares, cafes, and very neat shops to poke one's head into.  There's even a storefront cat shelter where prospective new parents can sit with various candidates over coffee on sofas to see if they're compatible. Sundays most things are closed so pick another day. There's so much to see in Barcelona so maybe save this for your second or third visit.", "publishedDate": "2017-03-19", "language": "en", "rating": 4}, {"id": 466618242, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d271008-r466618242-Barri_de_Gracia-Barcelona_Catalonia.html", "text": "We visited on a Sunday and it was very quiet. The shops were not open, there were few people and bars were hard to find. My advice is go during the week!", "publishedDate": "2017-03-12", "language": "en", "rating": 3}, {"id": 459949289, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d271008-r459949289-Barri_de_Gracia-Barcelona_Catalonia.html", "text": "Gracia is an almost 'un-touristy' barri in Barcelona. Most tourists stalk Born, Barceloneta and the Ramblas. Once you move higher up Pg Gracia, you discover a more quiet area, with incredible architecture and ambiance! It also has fantastic little bars, restaurants and shops. But, the architecture is what gets my attention every time.  ", "publishedDate": "2017-02-15", "language": "en", "rating": 4}, {"id": 451290255, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d271008-r451290255-Barri_de_Gracia-Barcelona_Catalonia.html", "text": "Nice architecture, great bars, and a very interesting alternative environment are elements of one of the most interesting places in Barcelona.", "publishedDate": "2017-01-11", "language": "en", "rating": 5}, {"id": 448113650, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d271008-r448113650-Barri_de_Gracia-Barcelona_Catalonia.html", "text": "This is one of the many places we found by getting lost . It's a lovely area of the city . Lots of nice restaurants here and great for a stroll.", "publishedDate": "2016-12-31", "language": "en", "rating": 4}, {"id": 448036839, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d271008-r448036839-Barri_de_Gracia-Barcelona_Catalonia.html", "text": "We walked around this neighborhood. There's no itinerary, you just need to get lost! There are a few restaurants around for a stop.", "publishedDate": "2016-12-31", "language": "en", "rating": 5}, {"id": 447681562, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d271008-r447681562-Barri_de_Gracia-Barcelona_Catalonia.html", "text": "Nice neighborhood feel with lots of local shops, plazas and places to eat.  This is North of the Born and has a much more open and less intense feel to it.  Lovely architecture and less touristy.", "publishedDate": "2016-12-29", "language": "en", "rating": 4}, {"id": 446787336, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d271008-r446787336-Barri_de_Gracia-Barcelona_Catalonia.html", "text": "Gracia is a calm area in normal time but in August there s gracia festival and it's fantastically awesome for young people", "publishedDate": "2016-12-26", "language": "en", "rating": 5}, {"id": 445645916, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d271008-r445645916-Barri_de_Gracia-Barcelona_Catalonia.html", "text": "Gracia is north of Born and is another old part of the city full of little plazas, tree lined side streets and some gorgeous old buildings. I love the area, it is chilled, lots of nice cafes, shops and quirky quaint buildings. Saying that the plazas are great but not the best I have seen in Spain but still a lovely place all in all.", "publishedDate": "2016-12-20", "language": "en", "rating": 4}]}}]