[{"locationId": 313695, "name": "Plaça Reial", "placeType": "ATTRACTION", "reviewListPage": {"reviews": [{"id": 757067652, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d313695-r757067652-Placa_Reial-Barcelona_Catalonia.html", "text": "The square is famous for its nightlife, restaurants, beautiful palm trees and impressive streetlamps designed by Antonio Gaudi. One of the most beautiful squares in the Gothic Quarter.", "publishedDate": "2020-06-08", "language": "en", "rating": 5}, {"id": 744675508, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d313695-r744675508-Placa_Reial-Barcelona_Catalonia.html", "text": "The Placa Reial is one of my most favourite squares in the city. So sitting here and looking is a great way to spend some time!", "publishedDate": "2020-02-12", "language": "en", "rating": 5}, {"id": 744419618, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d313695-r744419618-Placa_Reial-Barcelona_Catalonia.html", "text": "After almost being ripped off on las rambles, for 2 drinks, and telling the asian stallholder so, we turned into the real square, it was beautiful, a place to relax, chat, and fall in love, at everyday prices for beer and gin,", "publishedDate": "2020-02-11", "language": "en", "rating": 5}, {"id": 744192872, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d313695-r744192872-Placa_Reial-Barcelona_Catalonia.html", "text": "Every visit to Barcelona I find myself back in this square a little bit by accident and this time it was beckoning me whilst I was wandering in the Gothic Quarter. Through an arch those tall palm trees wave a welcome and once you are in the square the fountain is an attractive focus.\nIt is always good to walk along the enclosing arcades or dip fingers into the fountain.", "publishedDate": "2020-02-10", "language": "en", "rating": 5}, {"id": 735912712, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d313695-r735912712-Placa_Reial-Barcelona_Catalonia.html", "text": "It is a beautiful square with cafes and restaurants where you can take a break while appreciating Gaudi’s work.\n", "publishedDate": "2019-12-31", "language": "en", "rating": 5}, {"id": 728401226, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d313695-r728401226-Placa_Reial-Barcelona_Catalonia.html", "text": "Loved the feeling of being out of the tourist masses on the Las Ramblas when we entered this lovely plaza from the alleys to the south , lots of cafes and bars to relax in and watch the world go by , stately buildings surround the square and families relax by the fountains", "publishedDate": "2019-11-23", "language": "en", "rating": 5}, {"id": 728334566, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d313695-r728334566-Placa_Reial-Barcelona_Catalonia.html", "text": "Nice open placa with palm trees. Lots of restaurants to find here. Feels like a small oasis next to busy La Rambla. Go there for lunch or dinner.", "publishedDate": "2019-11-23", "language": "en", "rating": 4}, {"id": 722334781, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d313695-r722334781-Placa_Reial-Barcelona_Catalonia.html", "text": "This is a nice place to go to.  There are a range of restaurants to choose from.  I had only been there in the evening when it is all lit up.  Nice atmosphere.", "publishedDate": "2019-10-29", "language": "en", "rating": 3}, {"id": 720203272, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d313695-r720203272-Placa_Reial-Barcelona_Catalonia.html", "text": "I like city squares.  And this one is really nice.  The buildings surrounding it are very beautiful, there are palm trees, and it offers a sense of calm right off the bustle of La Rambla.  I've heard that all of the restaurants on the square are mediocre.  Ours was.  But we stilled enjoied stopping for a snack and a drink and enjoying this space", "publishedDate": "2019-10-21", "language": "en", "rating": 4}, {"id": 718982016, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d313695-r718982016-Placa_Reial-Barcelona_Catalonia.html", "text": "My hotel was a prat of this Plaza and I would do both again in an instant. To sit for any meal at one of the restaurants that circle the Plaza is true relaxation.", "publishedDate": "2019-10-16", "language": "en", "rating": 5}, {"id": 718891855, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d313695-r718891855-Placa_Reial-Barcelona_Catalonia.html", "text": "Plaça Reial  is a square in de middle of the Gothic Quarter in  Barcelona. It is close to La Rambla, and is a popular tourist attraction. It's very beautiful square. There are plenty of good restaurants there. Its pretty a pretty cool place.Very lively and cozy. The square's lampposts were designed by the Catalan architect, Antoni Gaudí.", "publishedDate": "2019-10-16", "language": "en", "rating": 5}, {"id": 717802060, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d313695-r717802060-Placa_Reial-Barcelona_Catalonia.html", "text": "Barcelona as a city is great.  We stayed off of Las Ramblas, a very busy area which is popular with tourists.  We could access the Metro very easily. we used it to get around to see all the sites,  Get a 10 trip pass for 10 euros.  That is the best value,  The medieval old city is really beautiful with many small shops and eateries.  Next time I would stay in a hotel that is in the old part of city, but in a quieter section.  There are several beautiful small hotels that never make it onto the web sites.  That is the downside of the internet sites.  You would never know about them.  We spent 10 days there and there was plenty to keep us busy.", "publishedDate": "2019-10-12", "language": "en", "rating": 5}, {"id": 717545939, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d313695-r717545939-Placa_Reial-Barcelona_Catalonia.html", "text": "Our hotel was fortunately close to this beautiful square. The square is not far from the Ramblas. This square is for me the real Barcelona. Artists, live music, beautiful buildings, cosiness and a lot of places to eat or drink something. Note that the restaurants are not cheap at this square and it are also not the best places to eat regarding quality.", "publishedDate": "2019-10-12", "language": "en", "rating": 5}, {"id": 716436250, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d313695-r716436250-Placa_Reial-Barcelona_Catalonia.html", "text": "Great mix of upmarket and more affordable restaurants set around a pretty square.\nSome bars are nicer than others regards decor and seating but this is also reflected in their prices.\nWe were lucky to be there during Festa and enjoyed some free entertainment whilst enjoying some great cocktails.\nWe were a party of 5 females of varying age ranges and were warned to be careful of pickpockets by one of the staff in a bar we visited but we didn't have any issues and always felt safe although we didn't stay until late into the evening so maybe it has a different vibe after 11pm.\nWe really enjoyed our time in Barcelona and Placa Reial is great for people watching.", "publishedDate": "2019-10-08", "language": "en", "rating": 4}, {"id": 716037646, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d313695-r716037646-Placa_Reial-Barcelona_Catalonia.html", "text": "This is just off Las Ramblas. It’s a good place to sit in the shade and grab a bite especially if your cruise ship people. A nice size plaza away from the crowded Las Ramblas ", "publishedDate": "2019-10-07", "language": "en", "rating": 3}, {"id": 714017093, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d313695-r714017093-Placa_Reial-Barcelona_Catalonia.html", "text": "Nice plaza to visit for a sit down and it feels a little safer than Las Ramblas nearby. Metal gates blocking the fountain ruined the scenery a little for us but I suspect this is more a place to visit for nightlife anyway", "publishedDate": "2019-09-29", "language": "en", "rating": 4}, {"id": 708242880, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d313695-r708242880-Placa_Reial-Barcelona_Catalonia.html", "text": "Nice plaza located off La Rambla. The location includes a hotel and lots of restaurants. Great place to take a break. ", "publishedDate": "2019-09-09", "language": "en", "rating": 3}, {"id": 707240046, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d313695-r707240046-Placa_Reial-Barcelona_Catalonia.html", "text": "Tall palm trees, beautiful lamp posts, buildings around and cafés below! Simply the best!\nSit and enjoy a beer or Sangria... \nLove to people watch while my kids run around and play in the square! No worries about cars! ", "publishedDate": "2019-09-06", "language": "en", "rating": 5}, {"id": 705570747, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d313695-r705570747-Placa_Reial-Barcelona_Catalonia.html", "text": "Watch the world go by in one of the cafes and restaurants that surround this placa. Just off the Ramblas.", "publishedDate": "2019-09-02", "language": "en", "rating": 5}, {"id": 704334026, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d313695-r704334026-Placa_Reial-Barcelona_Catalonia.html", "text": "A very nice area to walk around and hang out, have coffee, wine, and people watch. Has many restaurants to chose from. We enjoyed it.", "publishedDate": "2019-08-29", "language": "en", "rating": 5}, {"id": 702401839, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d313695-r702401839-Placa_Reial-Barcelona_Catalonia.html", "text": "found this Placa while walking thru to La Rambla its worth stopping off find a bar sit at the tables with a glass of Spanish Rose palm and plant cool the square in the afternoon heat.", "publishedDate": "2019-08-24", "language": "en", "rating": 5}, {"id": 695331500, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d313695-r695331500-Placa_Reial-Barcelona_Catalonia.html", "text": "It is good to see and this is a nice place. There has a lot of cafeterias and it is nice place to have a cup of coffee and cake and just enjoy the day. This is a good place to see during the visit of Barcelona. ", "publishedDate": "2019-08-03", "language": "en", "rating": 4}, {"id": 694072022, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d313695-r694072022-Placa_Reial-Barcelona_Catalonia.html", "text": "Very nice place to have a meal or a drink. Many restaurants are placed there. Near the Cathedral. Recommended for chilling.", "publishedDate": "2019-07-30", "language": "en", "rating": 5}, {"id": 691030625, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d313695-r691030625-Placa_Reial-Barcelona_Catalonia.html", "text": "This old square is off Las Ramblas and is a real mecca for tourists. Bit touristy but still worth a visit.\nLots of restaurant choices and places to enjoy a drink.", "publishedDate": "2019-07-19", "language": "en", "rating": 4}, {"id": 690307858, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d313695-r690307858-Placa_Reial-Barcelona_Catalonia.html", "text": "Discovered this area after walking around the little streets of the Gothic quarter. We sat out in one of the restaurants drinking sangria and watching the world go by. Was lovely and chilled, sat here for hours at a time. ", "publishedDate": "2019-07-17", "language": "en", "rating": 5}, {"id": 690178550, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d313695-r690178550-Placa_Reial-Barcelona_Catalonia.html", "text": "The Plaça Reial is a public square in the Gothic Quarter of Barcelona and close to the southern end of La Rambla. The whole of the square is surrounded by arcades and buildings, which reminds me a lot of Plaza Mayor in Madrid. This is a popular tourist attraction, especially at night. The plaza has a large number of cafe, restaurants and several nightclubs, including Sidecar, Jamboree, and Karma.\n\nWhen you’re in the square, make sure to look out for the Gaudi designed lampposts.", "publishedDate": "2019-07-16", "language": "en", "rating": 5}, {"id": 687146369, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d313695-r687146369-Placa_Reial-Barcelona_Catalonia.html", "text": "If you love to sit and people watch, then this is the place to do it. I love this square. There are multiple restaurants with a variety of foods to choose from. Along with a beautiful fountain, gorgeous lampposts, and lots of benches to sit and enjoy the scenery. If you love the night life, then there are clubs for late night entertainment.  You will not be dissatisfied if you visit this area.", "publishedDate": "2019-07-06", "language": "en", "rating": 5}, {"id": 686929760, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d313695-r686929760-Placa_Reial-Barcelona_Catalonia.html", "text": "This plaza is really a hidden gem. Close to the Ramblas but a feels bit tucked away from the crowd. It feels a bit cozy with the restaurants, bars, palm trees and the people walking around. I would recommend everybody to go to this wonderful plaza but hoping it does get over-crowed with the risk it will loose it's charme.", "publishedDate": "2019-07-05", "language": "en", "rating": 5}, {"id": 685539024, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d313695-r685539024-Placa_Reial-Barcelona_Catalonia.html", "text": "We were simply out for a walk after dinner and found this beautiful Placa. Completely squared in by buildings with a central fountain and many palm trees. Great place for photos. If I were to return to Barcelona I would seek out more Placas. Mayne spend a day walking around and finding as many as I can. ", "publishedDate": "2019-06-30", "language": "en", "rating": 5}, {"id": 684465263, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d313695-r684465263-Placa_Reial-Barcelona_Catalonia.html", "text": "Traditional Spanish plaza..feels tucked away even tho just off la rambla..places to eat and fountain and relaxing..hasn’t been touched in years..which is how it should be ", "publishedDate": "2019-06-26", "language": "en", "rating": 4}, {"id": 681321325, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d313695-r681321325-Placa_Reial-Barcelona_Catalonia.html", "text": "Nice elegant place, great architecture, slightly secluded from Las Ramblas with better restaurants than the latter! Dine here rather than overpriced restaurants in Las Ramblas!", "publishedDate": "2019-06-13", "language": "en", "rating": 5}, {"id": 679086050, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d313695-r679086050-Placa_Reial-Barcelona_Catalonia.html", "text": "It’s was my first visit but not the last, love the city.. Too much people for the third month of year..", "publishedDate": "2019-06-05", "language": "en", "rating": 4}, {"id": 677561443, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d313695-r677561443-Placa_Reial-Barcelona_Catalonia.html", "text": "Barca is full of these lovely squares, you can see them all by walking around the city\n\nthis is a great one to enjoy", "publishedDate": "2019-05-30", "language": "en", "rating": 4}, {"id": 677259964, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d313695-r677259964-Placa_Reial-Barcelona_Catalonia.html", "text": "We found Placa Reial on a side street off of the Las Ramblas. It is a beautiful square with palm trees,an artistic fountain and numerous restaurants. There are decorative lamposts that were early works of Gaudi.It is a refreshing stop after busy Las Ramblas.You can take a table at one of the bars or restaurants surrounding the square. Enjoy your food and drinks. If you get lucky,there should be lively music coming from an entertainer at the square. Just relax at this very inviting square in the middle of busy Barcelona.", "publishedDate": "2019-05-28", "language": "en", "rating": 5}, {"id": 675593242, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d313695-r675593242-Placa_Reial-Barcelona_Catalonia.html", "text": "One of the nicest places in the city. Lovely square with restaurants all the way round the square.  Great for people watching. ", "publishedDate": "2019-05-21", "language": "en", "rating": 5}, {"id": 675294624, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d313695-r675294624-Placa_Reial-Barcelona_Catalonia.html", "text": "Placa Reial is a nice square that contains some of Gaudi's first public works-2 colorful helmeted lampposts.  We wandered into this square on 7/19/2018 while on our way to Palau Guell.  \n\nMany yellow buildings.  Colonial feeling.  Saw a Runner Bean tour group here.  Fountain.  Good for a drink, people watching, or just relaxing.  Lots of restaurants and bars with outside patio seating.", "publishedDate": "2019-05-20", "language": "en", "rating": 3}, {"id": 675279920, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d313695-r675279920-Placa_Reial-Barcelona_Catalonia.html", "text": "Lots of restaurants and one of the best night clubs, Jamboree, on this square.\nLes quinze Nits is the place to eat breakfast (9am-12pm), Cafe Expat is very good place for drinks and tapas.\nRestaurants are little bit expensive here comparing to restaurants further away from La Rambla. But not too expensive.\n\nBeautiful square.\nLots of people performing everything from singing and playing to juggling. ", "publishedDate": "2019-05-20", "language": "en", "rating": 5}, {"id": 674704744, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d313695-r674704744-Placa_Reial-Barcelona_Catalonia.html", "text": "This is a busy square surrounded by bars and restaurants. The bars tend to fill up by day depending on where the sun is shining. You can have a beer and people watch. A few rowdy stag dos slightly irritated me, but most people there were laid back and just enjoying themselves. Worth a visit, but very touristy. Having said that, it’s a pretty square and there’s plenty of venues to choose from.", "publishedDate": "2019-05-17", "language": "en", "rating": 4}, {"id": 674335030, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d313695-r674335030-Placa_Reial-Barcelona_Catalonia.html", "text": "Plaza Real inaugurated in the mid-nineteenth century, the old center of the city of Barcelona, is located very close to La Rambla. It is one of the few closed squares that Barcelona has. The buildings that surround it form a uniform set with the ground floor porticoed, decorated the facades. There are two lampposts designed by Gaudí, the source of the Three Graces in the center surrounded by palm trees.\nThere are numerous bars and restaurants around the square.", "publishedDate": "2019-05-16", "language": "en", "rating": 3}, {"id": 674027457, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d313695-r674027457-Placa_Reial-Barcelona_Catalonia.html", "text": "This is a beautiful square filled with fountain, street lamp and palm trees, which is also known as the royal square. At this popular square there are 2 street lamps located beside the central fountain that was designed by the young Antoni Gaudi back in the 1879. Today, the square is a busy nightlife hub surrounded by restaurants, bars and Barcelona’s most popular nightspots.", "publishedDate": "2019-05-14", "language": "en", "rating": 3}, {"id": 673633164, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d313695-r673633164-Placa_Reial-Barcelona_Catalonia.html", "text": "If in Barcelona city centre, Place Reial is a must visit. \n\nA huge square tucked away from Las Ramblas, it is a great place to have a drink for an hour or two and watch life go by. \n\nWe had a few drinks in Karma, but there are plenty of other places all around this impressive square. \n\nDon't visit Barcelona without spending a relaxing time here. Recommended and would return.", "publishedDate": "2019-05-13", "language": "en", "rating": 5}, {"id": 672586049, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d313695-r672586049-Placa_Reial-Barcelona_Catalonia.html", "text": "nice to watch people, lovely terraces, some entertainment, very close to Ramblas. \nNeed to see when in Barcelona", "publishedDate": "2019-05-08", "language": "en", "rating": 4}, {"id": 672517164, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d313695-r672517164-Placa_Reial-Barcelona_Catalonia.html", "text": "Lots of eating places in this square . It’s vibrant with street performers and tourists . You can sit on the benches or at one of the bar / restaurants and watch the world go by . It’s set in the Gothic quarter which is a particular favourite of mine", "publishedDate": "2019-05-08", "language": "en", "rating": 4}, {"id": 671573524, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d313695-r671573524-Placa_Reial-Barcelona_Catalonia.html", "text": "Placa Reial is a very popular plaza, and with good reason. It is a meeting place for just about anybody who wants to live it up! There are numerous entertainment areas, shops and other attractions. There are many cafes, restaurants, bars and other shops. This a the perfect spot to have some fun!", "publishedDate": "2019-05-05", "language": "en", "rating": 5}, {"id": 671173691, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d313695-r671173691-Placa_Reial-Barcelona_Catalonia.html", "text": "This square is perfect for a few drinks or a meal. We visited most evenings and had lovely meals which were not too expensive. It is very handy for Las ramblas  for a little exercise after the restaurant which ends in the word 'nits'.", "publishedDate": "2019-05-03", "language": "en", "rating": 4}, {"id": 670198340, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d313695-r670198340-Placa_Reial-Barcelona_Catalonia.html", "text": "Stayed at hotel on corner. Many cafes, bars, restaurants- from good, through awful, all overpriced.\n\nBut the views off the terraces, the people watching, the street entertainment.\n\nMarket stalls, hawkers. Great atmosphere.", "publishedDate": "2019-04-29", "language": "en", "rating": 5}, {"id": 669950413, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d313695-r669950413-Placa_Reial-Barcelona_Catalonia.html", "text": "I visited this place a few times to stop and eat.  I enjoyed paella at Cerveseria Canaria and Ambos Mundos Tapes.  It’s a great place to sit and people watch with a sangria. You may even see live entertainment such as accordion players, acrobats, or singers.  Because it is right off of Las Ramblas it can get a little busy and touristy, but overall I enjoyed eating here.", "publishedDate": "2019-04-28", "language": "en", "rating": 4}, {"id": 668920876, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d313695-r668920876-Placa_Reial-Barcelona_Catalonia.html", "text": "pretty good, large open square with plenty of restaurants, entertainers and shops. definitely feels touristy-y, but what else would one expect. close to Gothic Quarter and marina and Christopher Columbus statue/circle. definitely worth a stop for coffee and people-watching when in Barcelona", "publishedDate": "2019-04-24", "language": "en", "rating": 4}, {"id": 667915876, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d313695-r667915876-Placa_Reial-Barcelona_Catalonia.html", "text": "While having a nice coffee in the square we watched a lady have her handbag stolen while sitting doing the same. Please look after your bags if stopping here!", "publishedDate": "2019-04-20", "language": "en", "rating": 3}, {"id": 667385275, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d313695-r667385275-Placa_Reial-Barcelona_Catalonia.html", "text": "This is a beautiful square in the old part of town, close to the lower half of Las Ramblas. In the evening, it's a great place to hang out and have a drink and a few tapas and enjoy the atmosphere.", "publishedDate": "2019-04-18", "language": "en", "rating": 5}, {"id": 667053889, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d313695-r667053889-Placa_Reial-Barcelona_Catalonia.html", "text": "it is much like other plazas in Spain.  Cafes on the edges with some retail. We visited the plaza as part of a city walking tour.  I am not a big fan of plazas and this did not change my mind.", "publishedDate": "2019-04-16", "language": "en", "rating": 3}, {"id": 665347726, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d313695-r665347726-Placa_Reial-Barcelona_Catalonia.html", "text": "The nicest Placa in Barcelona.  A number of good looking cafes ring the square.  We chose Les Quinze Nits and were not disappointed.", "publishedDate": "2019-04-10", "language": "en", "rating": 4}, {"id": 665302383, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d313695-r665302383-Placa_Reial-Barcelona_Catalonia.html", "text": "There are so many nice parks and squares in Barcelona and it's one of them. We liked it after the crowed and busy Ramblas. You can sit on a bench and relax or drink or eat something in the cafes and bars. You can see the beautiful historic buildings around you or green palm trees. I can imagine: it's very romantic at night. We shoud go back!", "publishedDate": "2019-04-10", "language": "en", "rating": 4}, {"id": 664931273, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d313695-r664931273-Placa_Reial-Barcelona_Catalonia.html", "text": "I was expecting a humidifier house full blown plaza like Madrid's Plaza Mayor.\nNothing alike.\nThe actual surrounding area of barrio gótico is lovely.\nThis is part of a historic charming area but it's not worth much on its own", "publishedDate": "2019-04-08", "language": "en", "rating": 3}, {"id": 664542919, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d313695-r664542919-Placa_Reial-Barcelona_Catalonia.html", "text": "Quiet, traffic free place to stop in the sun or shade for a drink or meal.  We had a great time there.", "publishedDate": "2019-04-07", "language": "en", "rating": 4}, {"id": 663601328, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d313695-r663601328-Placa_Reial-Barcelona_Catalonia.html", "text": "It will only take you a few minutes to appreciate the place. Try not to miss it. Only 1 minute walk from La Rambla.", "publishedDate": "2019-04-03", "language": "en", "rating": 4}, {"id": 663371124, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d313695-r663371124-Placa_Reial-Barcelona_Catalonia.html", "text": "Amazing and very historically square at heart of barcelona that you can enjoy spanish cafe and bars and restaurants around it,unique experience,you can walking and breath and enjoyed it", "publishedDate": "2019-04-03", "language": "en", "rating": 5}, {"id": 660783020, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d313695-r660783020-Placa_Reial-Barcelona_Catalonia.html", "text": "Placa Reial is a jewel for those seeking an entertaining,  safe, open, and variety restaurant choices. There are several restaurants interior & exterior seating to walk by to check the vibe, see their menus and decide what your craving for the evening. While having dinner enjoy viewing the architecture, the local bands playing music or singers visiting each restaurant or just people watch for kicks. It’s a very international vibe with an easy background setting. A lot of seafood choices and authentic Catalan cuisine especially paellas. Prices vary from restaurant to restaurant but in my opinion are very moderately reasonable. ", "publishedDate": "2019-03-24", "language": "en", "rating": 5}, {"id": 660341629, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d313695-r660341629-Placa_Reial-Barcelona_Catalonia.html", "text": "There are so many nice squares in Barcelona (and Spain) that this one didn't stand out to me as so special.  It was very nice and it would be a very enjoyable place to spend a leisurely hour with a drink and a tapas.", "publishedDate": "2019-03-22", "language": "en", "rating": 3}, {"id": 659830369, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d313695-r659830369-Placa_Reial-Barcelona_Catalonia.html", "text": "On top of the architectural beauty of the square, you can find in it: bars, restaurant, music lounges, terraces, ajazz/blues live music cave and a flamenco dancing place. Ready for fun?", "publishedDate": "2019-03-20", "language": "en", "rating": 5}, {"id": 659254999, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d313695-r659254999-Placa_Reial-Barcelona_Catalonia.html", "text": "Diverted off the crowded Las Ramblas to this pretty square with lots of palm trees and a fountain in the middle.  Lots of restaurants to sit and watch the world go by whilst enjoying a drink or meal.  A few street beggars walking round the restaurants at the time of our visit.", "publishedDate": "2019-03-18", "language": "en", "rating": 4}, {"id": 656907684, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d313695-r656907684-Placa_Reial-Barcelona_Catalonia.html", "text": "Lots of restaurants around the side to have a rest and have a drink/eat however too many hawkers and beggars around on the day we visited.", "publishedDate": "2019-03-06", "language": "en", "rating": 3}, {"id": 654550275, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d313695-r654550275-Placa_Reial-Barcelona_Catalonia.html", "text": "Nice spot to sit and relax for a while. Afterwards, stand up and walk around, such as going visit the history museum and surroundings.", "publishedDate": "2019-02-24", "language": "en", "rating": 4}, {"id": 653350611, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d313695-r653350611-Placa_Reial-Barcelona_Catalonia.html", "text": "This is a lovely square, full of young and old alike enjoying their outing.  It's very centrally located just off Las Ramblas and has many restaurants, sitting areas, as well as fountains and palm trees to enjoy.", "publishedDate": "2019-02-18", "language": "en", "rating": 4}, {"id": 649916250, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d313695-r649916250-Placa_Reial-Barcelona_Catalonia.html", "text": "Lovely place to explore! There is a lovely fountain to get some rest and to check the lampposts - designed by Gaudi! Located at the heart of Barri Gotic - vibrant neighbourhood, there are lots of cafes, restaurants and bars around!", "publishedDate": "2019-02-03", "language": "en", "rating": 4}, {"id": 646991698, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d313695-r646991698-Placa_Reial-Barcelona_Catalonia.html", "text": "Located just off of Las Ramlba this popular square, contains several fountains, lots of palm trees and is surrounded by restaurants and bars, I took the opporunity to stop while on a walking tour of the city", "publishedDate": "2019-01-19", "language": "en", "rating": 4}, {"id": 646842049, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d313695-r646842049-Placa_Reial-Barcelona_Catalonia.html", "text": "We arrived there by accident walking through the Gothic district. It was night and we were amazed. It's a place to love and to be loved. Romantic, beautiful with a sense of mystery. Worth visiting at night", "publishedDate": "2019-01-18", "language": "en", "rating": 5}, {"id": 646281232, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d313695-r646281232-Placa_Reial-Barcelona_Catalonia.html", "text": "If you are a bit tired of crowds on Rambla, turn to Placa Reial to find some rest, enjoy the picturesque square with the fountain in the center, lanterns by Gaudi and big palms.", "publishedDate": "2019-01-16", "language": "en", "rating": 5}, {"id": 643351448, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d313695-r643351448-Placa_Reial-Barcelona_Catalonia.html", "text": "This is a beautiful and picturesque square with traditional Catalan buildings, architecture, central fountain and Gaudi lantern. There are many restaurants that surround the square for you to enjoy too.", "publishedDate": "2019-01-03", "language": "en", "rating": 4}, {"id": 642785572, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d313695-r642785572-Placa_Reial-Barcelona_Catalonia.html", "text": "Place was packed. Everyone friendly. Lots of South American types hawking beer cans and cheap fizz, but big police presence, so no trouble. \n\nHuge roar at midnight.\n\nGreat atmosphere.", "publishedDate": "2019-01-01", "language": "en", "rating": 5}, {"id": 640993988, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d313695-r640993988-Placa_Reial-Barcelona_Catalonia.html", "text": "One of my favourites in Barcelona - great for people watching, grabbing a drink, simply - enjoying life!", "publishedDate": "2018-12-22", "language": "en", "rating": 5}, {"id": 640972311, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d313695-r640972311-Placa_Reial-Barcelona_Catalonia.html", "text": "Another of the many plazas in the city.  This one is in the old part of town so it has a bit more charm than the Plaza de Espanya.  Worth as visit when you're in the old city and many restaurants if you're hungry.", "publishedDate": "2018-12-22", "language": "en", "rating": 4}, {"id": 640069416, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d313695-r640069416-Placa_Reial-Barcelona_Catalonia.html", "text": "This is a lovely square full of places to eat, there is some live entertainment and plenty of people.", "publishedDate": "2018-12-17", "language": "en", "rating": 4}, {"id": 639073105, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d313695-r639073105-Placa_Reial-Barcelona_Catalonia.html", "text": "Visit this location on Sunday and you will a flea market of collectibles there to admire and perhaps grab one vintage antiques.  I found mine there and it is a steal.  Highly recommend.", "publishedDate": "2018-12-11", "language": "en", "rating": 5}, {"id": 635811058, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d313695-r635811058-Placa_Reial-Barcelona_Catalonia.html", "text": "Beautiful plaza with a lot of restaurants but mostly for tourists... Generally there is a lot of people to meet and talk", "publishedDate": "2018-11-26", "language": "en", "rating": 3}, {"id": 634485171, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d313695-r634485171-Placa_Reial-Barcelona_Catalonia.html", "text": "The Placa Reial is a beautiful square located in the Gothic Quarter of Barcelona. This large square is lined with porticoes which conceals the bars, restaurants and nightclubs that inhabit this square. Originally built to honor King Ferdinad VII, Reial means Royal in Cantalan. One interesting side note is that the lamps adjacent to the water fountain where designed by Antonio Gaudi. Jolly Chriss", "publishedDate": "2018-11-19", "language": "en", "rating": 5}, {"id": 634158975, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d313695-r634158975-Placa_Reial-Barcelona_Catalonia.html", "text": "Wander a block off of La Rambla into the Placa Reial any evening and find a table under a big umbrella and order a glass of wine.  Sit back and people watch.  Or enjoy a great meal at Marisco or Rossini or any of the restaurants that line the square.  A nice way to unwind from a day of sightseeing in a lovely setting.", "publishedDate": "2018-11-18", "language": "en", "rating": 5}, {"id": 633830837, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d313695-r633830837-Placa_Reial-Barcelona_Catalonia.html", "text": "Lots of good restaurants to choose from.  Neat square lots of street entertainment clean and felt safe. Open very late", "publishedDate": "2018-11-16", "language": "en", "rating": 4}, {"id": 633546391, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d313695-r633546391-Placa_Reial-Barcelona_Catalonia.html", "text": "We stumbled across the Place Reial whilst wandering around the little side streets along Las Ramblas. Lots of big palm trees, a big fountain - plenty of places to eat & flying around were very noisy (but not in a bad way) little birds that looked like tiny parrots.\nA stunning square.", "publishedDate": "2018-11-14", "language": "en", "rating": 5}, {"id": 632088833, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d313695-r632088833-Placa_Reial-Barcelona_Catalonia.html", "text": "The venue is located near “Las Ramblas”. The architecture of the place is very interesting and the ambience is nice. Around the square are numerous cafes and restaurant, probably not cheap ones.", "publishedDate": "2018-11-08", "language": "en", "rating": 4}]}}]