[{"locationId": 191052, "name": "Casa Batllo", "placeType": "ATTRACTION", "reviewListPage": {"reviews": [{"id": 755538881, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d191052-r755538881-Casa_Batllo-Barcelona_Catalonia.html", "text": "The inside is as amazing as the outside of the building. If you are a fan of Gaudi. it is a must see, especially if you are an art lover... AMAZING !", "publishedDate": "2020-05-27", "language": "en", "rating": 5}, {"id": 753498654, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d191052-r753498654-Casa_Batllo-Barcelona_Catalonia.html", "text": "Admission to Casa Batlló is expensive, as is everything in Barcelona. Of all the attractions, this was the one I liked the most. The architecture is full of curves and colors, and every corner of the house has some detail that delights you. The problem is that it is always crowded ...  But don't miss it!", "publishedDate": "2020-05-13", "language": "en", "rating": 5}, {"id": 752857918, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d191052-r752857918-Casa_Batllo-Barcelona_Catalonia.html", "text": "From the minute you see the house, you can tell it was created by Gaudi.  It was incredible.  I am not usually even interested in extensive architecture, but this place was unreal! Each room had such a great story behind it.  The only reason I marked it down a star was because I think it was expensive for a tour of a house, even if it was created by Gaudi. ", "publishedDate": "2020-04-23", "language": "en", "rating": 4}, {"id": 752534489, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d191052-r752534489-Casa_Batllo-Barcelona_Catalonia.html", "text": "This is one of the best known of Gaudi’s houses and becomes very busy and overcrowded even though numbers are limited. It is expensive to go in and you may have to book in advance, but it’s still worth seeing, especially at night when the fabulous exterior is lit. The quieter areas like the laundry corridor and back stairs are the most memorable elements for me. There is quite an aggressive photographer pushing you to have your photo taken up on the roof and a large gift shop.\nThere are many alternative Gaudi sites that are a nicer experience.", "publishedDate": "2020-04-12", "language": "en", "rating": 3}, {"id": 752462015, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d191052-r752462015-Casa_Batllo-Barcelona_Catalonia.html", "text": "One unique building downtown where once again Gaudi left his mark!!! Just stunning. We didn't get inside because of lack of time but it's amazing from the outside as well. ", "publishedDate": "2020-04-10", "language": "en", "rating": 5}, {"id": 752250454, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d191052-r752250454-Casa_Batllo-Barcelona_Catalonia.html", "text": "I HIGHLY recommend this early entry option. It is totally worth the extra $$. \n\nI was amazed at how I could get a full panoramic shot in one room (with no people in the photo!!) This was truly a luxury. We entered right around 8, and I noticed right when they opened the doors at 9, the place was flooded with people. I was so thankful to be able to walk around and take my time in each space, looking at the details and not moving with a crowd of tourists. Overall, this is an architectural work of art by Gaudí. I was taken aback by all the beautiful design and detail. And, as part of your admission, you have an audio guide that takes you through the space with all kids of fun facts and information. \n\nIf you’re someone looking for good photo opportunities, I definitely recommend this early entry pass. Worth it!!! ", "publishedDate": "2020-04-04", "language": "en", "rating": 5}, {"id": 752250077, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d191052-r752250077-Casa_Batllo-Barcelona_Catalonia.html", "text": "I booked this a couple of weeks in advance just to be on the safe side (cost £43.00 for 2 adults), not knowing much about the place other than its fascinating appearance I asked a guide if she recommended going and was surprised to hear that if you see the outside that is all you really need.\n\nTo say I disagree is an understatement, sure the outside is remarkable, but going inside the building has so much to offer with each room showing amazing lines and layouts.  The audio guide adds to the experience and is a little more than just audio, putting animations around the room and adding furniture as you look at the screen.\n\nI can't recommend this enough and just us going here inspired us to go the next day to Casa Mila to take in more of this geniuses work.", "publishedDate": "2020-04-04", "language": "en", "rating": 5}, {"id": 752168648, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d191052-r752168648-Casa_Batllo-Barcelona_Catalonia.html", "text": "In other opportunity (without my sons) I visited inside the building and was very interesting, but the most amazing of this work of art is the frontage, with the masks/balconies, the changing of colors and tones with the lights at night.", "publishedDate": "2020-04-02", "language": "en", "rating": 5}, {"id": 752019772, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d191052-r752019772-Casa_Batllo-Barcelona_Catalonia.html", "text": "Absolutely WOW!  My 3rd visit to Barcelona and this time Gaudi's Casta Batllo was at the top of the list.  Well researched we booked early afternoon, a time that was not so busy and the sun light is at an optimum to show this magnificent work of art to it's best.  \nI'd forgotten just how detailed the exterior of the building was and the interior certainly did not disappoint.  \nI am a huge Gaudi fan and after a disappointing visit to Park Guell which is under huge repairs, my faith was restored.\nMy advice is to take your time, when it's manic, take a minute and the crowd will disperse enough to get those special photos and enjoy the master's work.\nThe ticket we had also have us access to the Salon - I hadn't been aware of this and we very nearly missed it - that is a lovely, more conventional space where you can dress up in period costume and get a free photo.", "publishedDate": "2020-03-29", "language": "en", "rating": 5}, {"id": 751705612, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d191052-r751705612-Casa_Batllo-Barcelona_Catalonia.html", "text": "Casa Battlo is truly one of Gaudi’s Catalan Art Nouveaux masterpieces. His organic style was inspired by nature and is totally magical.  We took an audio tour with an amazing device that not only gave us descriptions and history of what we were seeing, but also the ability to see (virtually) the furnishings and the overall look of each room, as it appeared when the Battlo family lived here. (There was no real furniture in the house.)  The initial staircase wound up to the 1st floor in typical Gaudi style—no straight lines. We passed through a reception room decorated in brilliant golds, with a small mushroom-shaped cubby on one side containing a fireplace with benches on either side—presumably for “chaperoned” visits with the daughters of the house. Beautiful honey-colored, art deco-style carved doors (with upper transoms of stained glass in blue, green, yellow, and rose-violet) led to a sitting room and then to the main living room facing the street.  It had an expansive three-coved set of windows with intricately carved frames and magnificent multi-colored glass.  They were surrounded by pillars and domes of plaster reminiscent of a Tolkein hobbit house.  Opposite the windows there had been a huge chest that opened into an altar when the family wanted to pray. The house was not just a work of art, but also an engineering masterpiece.  Gaudi included a large central double shaft that opened all the way from the ground floor to the roof skylights to allow air and light to filter down.  Rooms on upper levels had beautiful, uniquely-shaped stained-glass windows opening onto the central light shaft. Windows on lower floors were larger (to let in more light), while those higher up were smaller (since they were closer to the light source). A series of slats that could be opened or closed to regulate the air flow was installed under each window. The shaft was tiled in blue—darker blue on the highest level and gradually fading to lighter blue on lower floors to make the whole shaft appear to be the same color.  Passing through the family dining room (much like the living room), we found ourselves in a beautiful garden courtyard, with mosaic sculptures, fountains, floors, and walls—all covered with multi-colored broken tile and glass pieces.  The back façade of the house had wonderful curved balconies with flower pots, grillwork, and a fanciful frieze of colorful flowers and shapes.  Back into the house and up the stairs, we finally reached the attic level with beautiful rib-arched hallways and the rooms used for laundry and storage. Climbing the small spiral staircase, we emerged on the rooftop to find the most spectacular views of the surrounding city and the most breathtaking mosaic sculptures of all.  Each chimney was a fanciful work of art.  There was also a colorful dragon—or at least part of him (the spine and tail) and a beautiful cross.  Exiting through the gift shop, we also got to see a number of original chairs designed by Gaudi.  It was an amazing tour!", "publishedDate": "2020-03-23", "language": "en", "rating": 5}, {"id": 751626364, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d191052-r751626364-Casa_Batllo-Barcelona_Catalonia.html", "text": "Most unusual place, defintely worth visiting.  The roof expecially good.  If you want ot see some of what Gaudi achieved go there.  Ps, cheaper if you book online", "publishedDate": "2020-03-22", "language": "en", "rating": 4}, {"id": 751290007, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d191052-r751290007-Casa_Batllo-Barcelona_Catalonia.html", "text": "This house build by Antoni Gaudi is a beautiful piece of architecture. In every season the house is changing in colours. Sometimes with flowers and sometimes with colourful lights. Strongly recommend everyone to see this house when you are in Barcelona!", "publishedDate": "2020-03-18", "language": "en", "rating": 5}, {"id": 751282097, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d191052-r751282097-Casa_Batllo-Barcelona_Catalonia.html", "text": "Amazing! It's like journey through a magical dream! Dragon landing on top of the roof? Ocean water interior? Knight in armor chimney? Customized room door with secret alphabet system? Be amazed by the creativity and imagination of Gaudi. I think this must be among the top of his works. The audio guide is quite interesting and incorporated some virtual reality as part of the introduction to the house. A must visit in Barcelona!", "publishedDate": "2020-03-17", "language": "en", "rating": 5}, {"id": 751214848, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d191052-r751214848-Casa_Batllo-Barcelona_Catalonia.html", "text": "We didn’t go inside we are not much of a admiral of architecture. But it is cool to see this piece of art in the middle of a busy shopping avenue.\n", "publishedDate": "2020-03-17", "language": "en", "rating": 4}, {"id": 751008840, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d191052-r751008840-Casa_Batllo-Barcelona_Catalonia.html", "text": "After hitting several other Gaudi sites, I wasn't expecting Batllo to impress, but it is worth the stop. The house is deceptively massive and an enviable home showcasing Gaudi's attention to detail in this commissioned residence. ", "publishedDate": "2020-03-15", "language": "en", "rating": 5}, {"id": 750817546, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d191052-r750817546-Casa_Batllo-Barcelona_Catalonia.html", "text": "This was the attraction I was looking forward to the most in Barcelona and it didn’t disappoint. The architecture was astounding. Something that you’ll never see anywhere else, I’m so glad we visited! ", "publishedDate": "2020-03-14", "language": "en", "rating": 5}, {"id": 750736441, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d191052-r750736441-Casa_Batllo-Barcelona_Catalonia.html", "text": "We visited this after visiting the Segrada Familia which gave us the two sides of Gaudi. It is hard to comprehend the two completely different sides and styles of Gaudi.\n\nWe paid at the door and got the audio guide which was a great assistance. It was also interactive and showed what the inside was like in its heyday.\n\nTo say it’s fantastically weird is and understatement. It’s a colourful building, parts of it going under conservation. You simply let your imagination runaway with you.\n\nThere are stairs leading to the rooftop as well as a lift. \n\nIt is an amazing building, well worth visiting and very colourful.", "publishedDate": "2020-03-13", "language": "en", "rating": 5}, {"id": 750479925, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d191052-r750479925-Casa_Batllo-Barcelona_Catalonia.html", "text": "We visited the Casa Batllo structure during a trip to Baccelona last year.  We had heard about Antoni Gaudi and his unique architectural skills and were interested in seeing some of his work.  Casa Batllo is one of them and we were very impressed.  The tour of the mulit-level facility is indeed a unique experience and should not be missed if you are ever in Barcelona.   We truly enjoyed our time visiting this unique Gaudi structure.THe truly pushed the architectural envelop.", "publishedDate": "2020-03-11", "language": "en", "rating": 5}, {"id": 750444501, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d191052-r750444501-Casa_Batllo-Barcelona_Catalonia.html", "text": "Self guided tour of a very  interesting house. It was nice to have the audio guide to help explain everything we were seeing.", "publishedDate": "2020-03-11", "language": "en", "rating": 4}, {"id": 750326818, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d191052-r750326818-Casa_Batllo-Barcelona_Catalonia.html", "text": "One of the best work of Gaudi, that's for sure! Every room is so different from the other and yet in the same style. This house is very much inspired by the sea creatures. If you visit it, you will get a device with headphones - enjoy the tour! The audio guide was with augmented reality so you could see things moving around in every room.", "publishedDate": "2020-03-10", "language": "en", "rating": 5}, {"id": 750278096, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d191052-r750278096-Casa_Batllo-Barcelona_Catalonia.html", "text": "It speaks for itself. Color full building , you would not miss it. Stained glass when the sun strikes put a smile on you.", "publishedDate": "2020-03-10", "language": "en", "rating": 5}, {"id": 750249811, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d191052-r750249811-Casa_Batllo-Barcelona_Catalonia.html", "text": "The beautifully planned architectural beauty is spectacular. It takes you back in time when it was inhabited by one of the great bussiness man of Italy. ", "publishedDate": "2020-03-10", "language": "en", "rating": 4}, {"id": 750197640, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d191052-r750197640-Casa_Batllo-Barcelona_Catalonia.html", "text": "It was a excellent and rewarding experience. The staff were helpful the cortuos. My trip to Barcelona was to see Gaudi's creation. It was more satisfying and rewarding.", "publishedDate": "2020-03-09", "language": "en", "rating": 5}, {"id": 750162890, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d191052-r750162890-Casa_Batllo-Barcelona_Catalonia.html", "text": "A must when in Barcelona! Im\nNo architect but I was most certainly captivated and intrigued by this creative genius. Went in March and didn’t have to wait at all to in. ", "publishedDate": "2020-03-09", "language": "en", "rating": 5}, {"id": 750150188, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d191052-r750150188-Casa_Batllo-Barcelona_Catalonia.html", "text": "This was a great attraction. Visited using the Barcelona Card so it was 'free'. Arrived just before 9 and there was a queue of only a handful of people. Easy entry, given an audio/ video guide which was really informative. Lots of photo ops, but even with the small (?) number of people visiting at this time of year, it still took a while to get clear shots. \n\nWatch out at the local metro, Passeig de Gracia, as it seems to be a pickpocketing hotspot. Only just managed to stop some little scumbag from stealing my phone out of my pocket as I left the station.", "publishedDate": "2020-03-09", "language": "en", "rating": 4}, {"id": 750141779, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d191052-r750141779-Casa_Batllo-Barcelona_Catalonia.html", "text": "The house itself is super interesting and shows the mind of Gaudi, I'm glad we were here first as a background to the Sangrada Familia.", "publishedDate": "2020-03-09", "language": "en", "rating": 5}, {"id": 750137450, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d191052-r750137450-Casa_Batllo-Barcelona_Catalonia.html", "text": "We truly loved this building. The tiles and Windows are all quite unusual. We paid for a silver ticket so that entitled us to visit the private hall. We were also given complimentary small bottles of water.", "publishedDate": "2020-03-09", "language": "en", "rating": 5}, {"id": 750135547, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d191052-r750135547-Casa_Batllo-Barcelona_Catalonia.html", "text": "Great audio guide, very interesting. All of the elements you have to see to believe how beautiful and clever they are. Gives you the background info and reasoning behind the madness of this place. Only negative is that it is Quite pricy for a couple of hours visit. ", "publishedDate": "2020-03-09", "language": "en", "rating": 5}, {"id": 750096354, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d191052-r750096354-Casa_Batllo-Barcelona_Catalonia.html", "text": "It can't be described, you have to visit it yourself and see :-)\nMajka i Ryszard from Poland\n \nTego się nie da opisać, sam musisz to odwiedzić i zobaczyć :-)\nMajka i Ryszard z Polski", "publishedDate": "2020-03-09", "language": "en", "rating": 5}, {"id": 749894474, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d191052-r749894474-Casa_Batllo-Barcelona_Catalonia.html", "text": "Really amazing. A masterpiece in every detail. Do visit this fairytale house. The audioguide was well composed and luckily tha house was not too crowded.", "publishedDate": "2020-03-08", "language": "en", "rating": 5}, {"id": 749734061, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d191052-r749734061-Casa_Batllo-Barcelona_Catalonia.html", "text": " rooftop so be prepared for that.  The home is very interesting and offers insight into Gaudi's work as well as great photo opportunities.  Well worth the visit which took approx 1 hour.  There is a nice gift shop inside as well.", "publishedDate": "2020-03-07", "language": "en", "rating": 5}, {"id": 749729466, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d191052-r749729466-Casa_Batllo-Barcelona_Catalonia.html", "text": "The building is really impressive and the smart guide is good as you get to hear about the interesting facts in respect of the house. Gaudí was such an amazing creator and we especially loved the courtyard and rooftop where he had even made the chimneys fit in with the design of the house. Well worth a visit", "publishedDate": "2020-03-07", "language": "en", "rating": 5}, {"id": 749630595, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d191052-r749630595-Casa_Batllo-Barcelona_Catalonia.html", "text": "We visited late morning and had a short wait in the queue. It is pricy to get in but we decided overall it was worth it.\nGood spoken and pictorial guide included in the entry fee, informative and interesting.\nWe spent a good two hours there and it completed our overall picture of the work of Gaudi.\nYes, worth a visit if you are interested in the work of Gaudi.", "publishedDate": "2020-03-06", "language": "en", "rating": 5}, {"id": 749537132, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d191052-r749537132-Casa_Batllo-Barcelona_Catalonia.html", "text": "I didn't know exactly what to expect. It was so impressive, the house, Gaudi. What an imagination! This tour makes you realize this artist had the opportunity to do whatever his imagination imagined. Beautifully designed furnishings to the tours projections of sea creatures and underwater views floating from floor to ceiling. A bonus is a picture at the end. Very nice. The music rooftop was a jazz singer, lovely. And a glass of cava! A memorable evening shared with friends.", "publishedDate": "2020-03-06", "language": "en", "rating": 5}, {"id": 749419905, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d191052-r749419905-Casa_Batllo-Barcelona_Catalonia.html", "text": "Recently visited Casa Batllo. I found it strange but very interesting at the same time. Some of the features were way ahead of their time and the use of natural light was fantastic. The smart guide was useful. Recommended.", "publishedDate": "2020-03-05", "language": "en", "rating": 4}, {"id": 749275289, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d191052-r749275289-Casa_Batllo-Barcelona_Catalonia.html", "text": "This was one of my favourite Gaudi stops. The stained glass and overall design is just fabulous! Really gave an insight into his appreciation of colour and nature. Take time to really take in the details.", "publishedDate": "2020-03-05", "language": "en", "rating": 5}, {"id": 749074524, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d191052-r749074524-Casa_Batllo-Barcelona_Catalonia.html", "text": "Without a doubt the most beautiful work of art I've seen in my life. I recommend visiting. Better to have audioguide to understand it.", "publishedDate": "2020-03-04", "language": "en", "rating": 5}, {"id": 749060543, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d191052-r749060543-Casa_Batllo-Barcelona_Catalonia.html", "text": "We were definitely hesitant about going inside because of the cost, but decided to do it anyway and are glad that we did. The inside does not disappoint compared to the outside. I really enjoyed the smart guide which enables you to look around the room through the device and see how it was decorated and creatively highlights some of the shapes that are based in nature.", "publishedDate": "2020-03-04", "language": "en", "rating": 4}, {"id": 749032430, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d191052-r749032430-Casa_Batllo-Barcelona_Catalonia.html", "text": "Gaudi architecture is the important must see destintation in Barcelona, and top them with Casa Batllo.\nLittle expensive, but impressive.\nA view from the outside itself i great.", "publishedDate": "2020-03-04", "language": "en", "rating": 4}, {"id": 748905251, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d191052-r748905251-Casa_Batllo-Barcelona_Catalonia.html", "text": "Before visiting Casa Batllo I didn't know very much about Gaudi design.  I was blown away by the detail of the design throughout this very large home (basically the size of a small apartment building).  Well worth the visit.  Very glad we visited Casa Batllo before visiting Sagrada Familia as it was a great way to learn more about Gaudi before seeing the master piece.", "publishedDate": "2020-03-03", "language": "en", "rating": 5}, {"id": 748897383, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d191052-r748897383-Casa_Batllo-Barcelona_Catalonia.html", "text": "The tour was wonderful and easy with the self guided phones -easy and very professional-loved this tour -it is my second time", "publishedDate": "2020-03-03", "language": "en", "rating": 5}, {"id": 748863397, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d191052-r748863397-Casa_Batllo-Barcelona_Catalonia.html", "text": "We went to visit this place but was put off by the excessive entry fees and decided that a view from outside would suffice.", "publishedDate": "2020-03-03", "language": "en", "rating": 1}, {"id": 748647924, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d191052-r748647924-Casa_Batllo-Barcelona_Catalonia.html", "text": "I lived quite near from it and passed by few times daily.Very many people were waiting to enter inside.Im satisfied with outside view.Very impressive and not standard ", "publishedDate": "2020-03-01", "language": "en", "rating": 5}, {"id": 748641987, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d191052-r748641987-Casa_Batllo-Barcelona_Catalonia.html", "text": "Enjoyed visiting an architectural masterpiece.  Definitely worth an hour of time.  Tix are cheaper If buying online.  VR technology is cool with the audio.  If you like architecture, worth the visit.  ", "publishedDate": "2020-03-01", "language": "en", "rating": 4}, {"id": 748385821, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d191052-r748385821-Casa_Batllo-Barcelona_Catalonia.html", "text": "Extortionately expensive. Beautiful building but far far too expensive (€102 for two adults and a teenager - and that was with an online discount !). Audio was quite difficult to use. Cannot recommend it - purely because of price 😢", "publishedDate": "2020-02-29", "language": "en", "rating": 3}, {"id": 748317129, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d191052-r748317129-Casa_Batllo-Barcelona_Catalonia.html", "text": "It might be a bit on the expensive side, but you get a lot of information on the self guided auditour whilst making your way around this incredible building. If you don't know much about Gaudi you certainly will by the time you leave here! ", "publishedDate": "2020-02-29", "language": "en", "rating": 5}, {"id": 748258922, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d191052-r748258922-Casa_Batllo-Barcelona_Catalonia.html", "text": "We paid a few € extra to get the gold pass. You can get blue silver or gold basically. Gold means you get in first and you get some time to yourself. So so worth the extra. We had rooms to ourselves and could get photos with no one in. We can back at the end when everyone had been let in and you then have 20 people in a room. This place is simply stunning. The attention to detail is incredible. The terrace at the top give your a couple of amazing photos while the regular floors give you stunning woodwork and tile work. This place is a must see for me. Amazing. ", "publishedDate": "2020-02-28", "language": "en", "rating": 5}, {"id": 747896888, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d191052-r747896888-Casa_Batllo-Barcelona_Catalonia.html", "text": "We had a Gaudi day during our stay and the Casa Batllo was one of the highlights. Very immersive audio tour, we booked the Gold Tour, which we thoroughly enjoyed and would recommend to anyone.", "publishedDate": "2020-02-27", "language": "en", "rating": 5}, {"id": 747496420, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d191052-r747496420-Casa_Batllo-Barcelona_Catalonia.html", "text": "We spent almost no time in line waiting to get into the Casa Batllo.  Once in, we received our headsets and we were kept informed along the way.  There is so much to see and learn inside the house with beautiful views abound.  Highly recommend checking this place out on your visit to Barcelona.", "publishedDate": "2020-02-25", "language": "en", "rating": 5}, {"id": 747488484, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d191052-r747488484-Casa_Batllo-Barcelona_Catalonia.html", "text": "Casa Batlo is amazing, it is very busy but well worth visiting.\nGaudi was absolutely brilliant.\nBuy your tickets in advance, we bought blue and had no wait to get in.\n", "publishedDate": "2020-02-25", "language": "en", "rating": 5}, {"id": 747403954, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d191052-r747403954-Casa_Batllo-Barcelona_Catalonia.html", "text": "Went to Casa Batilo late in the afternoon. There was a couple of different options for entrance price wise. We chose the cheapest which was 20 euro each. Headset included. I loved walking around this building.  Gaudi was a genius & his work on this building was just simply stunning. We opted for an extra near the end of the tour for a photo for 12.00 euro. This was taken on the balcony by a photographer & was worth it. ", "publishedDate": "2020-02-24", "language": "en", "rating": 5}, {"id": 747400254, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d191052-r747400254-Casa_Batllo-Barcelona_Catalonia.html", "text": "As Gaudi Fan I couldn’t miss casa batllo .\nWe took the early access ticket and we were very  happy With the tour. The place is simply amazing !", "publishedDate": "2020-02-24", "language": "en", "rating": 5}, {"id": 747343125, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d191052-r747343125-Casa_Batllo-Barcelona_Catalonia.html", "text": "Book the early access ticket for less crowds and optimal photos. The details are so though out and every thing also has an architectural purpose. It’s a must-see!", "publishedDate": "2020-02-24", "language": "en", "rating": 5}, {"id": 747309926, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d191052-r747309926-Casa_Batllo-Barcelona_Catalonia.html", "text": "Is a nice place to visit when you visit Barcelona because is in the city center. I really had a good time there. Easy to get there with tram and metro bus.", "publishedDate": "2020-02-24", "language": "en", "rating": 4}, {"id": 747261277, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d191052-r747261277-Casa_Batllo-Barcelona_Catalonia.html", "text": "The inside is as amazing as the outside of the building. If you are a fan of Gaudi, or not, it is a must see especially if you are an art lover.", "publishedDate": "2020-02-24", "language": "en", "rating": 5}, {"id": 747022657, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d191052-r747022657-Casa_Batllo-Barcelona_Catalonia.html", "text": "We liked being able to see more of the interior as opposed to La Pedrera; however, the roof was a bit disappointing. It was nothing special compared to La Pedrera. If you were wondering about choosing between the two, I'd pick La Pedrera. We had the time so we decided to see what the inside was like of Casa Batllo. The view of the Sagrada Familia is blocked by a building. ", "publishedDate": "2020-02-23", "language": "en", "rating": 4}, {"id": 747021723, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d191052-r747021723-Casa_Batllo-Barcelona_Catalonia.html", "text": "We pre-booked tickets to Casa Batllo for an evening visit, which included a rooftop concert. This is a great way to see Gaudi at his best. Very unusual, but truly ahead of its time, architecture. You can meander through the different rooms of this very interesting building at your own pace using the accompanying audio tour provided though the headphones. If you like Gaudi, and something a little different, this is worth a visit.\nThe rooftop concert was very relaxed and Gisela Novais was really good, she engaged with the audience well and has a great voice that suited the rhythm and blues repetoire of easy listening. A great night out. ", "publishedDate": "2020-02-23", "language": "en", "rating": 4}, {"id": 746773806, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d191052-r746773806-Casa_Batllo-Barcelona_Catalonia.html", "text": "Has to be seen to be believed. Flanked by regular straight edged buildings it looks like it was dreamt up and plopped in. You could stare for hours just taking it in as each bit looks different. Worth a look as you meander through Barcelona’s streets.  ", "publishedDate": "2020-02-22", "language": "en", "rating": 5}, {"id": 746717426, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d191052-r746717426-Casa_Batllo-Barcelona_Catalonia.html", "text": "Amazing place, Gaudi is a genius, his architecture is stunning and extremely clever. I can’t wait to go back for another visit. I did the Gold ticket where you get to go into Gaudi’s private rooms and have an old fashioned photo taken. It was well worth the visit.", "publishedDate": "2020-02-22", "language": "en", "rating": 5}, {"id": 746712027, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d191052-r746712027-Casa_Batllo-Barcelona_Catalonia.html", "text": "We had a free morning and decided to visit since this was super close to the apartment and the outside was so pretty. I am so glad we toured inside - this ended up being my favorite of all the Gaudi spots beating Park Guell and Sagrada Família. I loved the audio tour and so did my 3 teens/tweens. It kept them engaged the whole time and they took their time in each room. We tried to buy tickets on line (definitely do this so you don’t have to wait and it was cheaper) but the online tickets didn’t go through must have been a glitch on their site however we asked and they gave us the cheaper online price. So glad we did this tour - loved all the color and the picture at the end was one of my favorite souvenirs of the trip!", "publishedDate": "2020-02-22", "language": "en", "rating": 5}, {"id": 746634861, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d191052-r746634861-Casa_Batllo-Barcelona_Catalonia.html", "text": "Easily accessible with a fast track pass - straight in to collect our headphones and English explanation of the wonderful building. Spectacular interiors well worth a visit.", "publishedDate": "2020-02-21", "language": "en", "rating": 5}, {"id": 746557796, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d191052-r746557796-Casa_Batllo-Barcelona_Catalonia.html", "text": "The house of bones fascinated all the family especially our 14 year old grandson who learned a lot to share with his classmates after half-term!", "publishedDate": "2020-02-21", "language": "en", "rating": 5}, {"id": 746521060, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d191052-r746521060-Casa_Batllo-Barcelona_Catalonia.html", "text": "Another architectural wonder made by Antonio Gaudi. You should not miss Gaudi's architecture in Barcelona as its one of its kind in the world.", "publishedDate": "2020-02-21", "language": "en", "rating": 4}, {"id": 746485345, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d191052-r746485345-Casa_Batllo-Barcelona_Catalonia.html", "text": "This house tour is not to be missed and worth every penny. We purchased tickets online standing outside approx €25 per person (with headset). Gaudi's architecture is well ahead of time, how something can be old yet modern at the same time begs belief. You will not be dissappointed.", "publishedDate": "2020-02-21", "language": "en", "rating": 5}, {"id": 746460955, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d191052-r746460955-Casa_Batllo-Barcelona_Catalonia.html", "text": "The architecture is different.Is something that you don’t see everyday...is definitely the most interesting hous I have see", "publishedDate": "2020-02-21", "language": "en", "rating": 5}, {"id": 746459029, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d191052-r746459029-Casa_Batllo-Barcelona_Catalonia.html", "text": "we booked online as it was cheeper, the admission included headphones with an audio guide, and a handheld guide you press where you are along the tour and it explains in clear detail waht youre looking at and what the space would have been used for,\nmost rooms are not accessable but the whole building is awesome, you must do it x\n", "publishedDate": "2020-02-21", "language": "en", "rating": 5}, {"id": 746458367, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d191052-r746458367-Casa_Batllo-Barcelona_Catalonia.html", "text": "we booked online as it was cheeper, the admission included headphones with an audio guide, and a handheld guide you press where you are along the tour and it explains in clear detail waht youre looking at and what the space would have been used for,\nmost rooms are not accessable but the whole building is awesome, you must do it x", "publishedDate": "2020-02-21", "language": "en", "rating": 4}, {"id": 746275171, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d191052-r746275171-Casa_Batllo-Barcelona_Catalonia.html", "text": "Gaudi designed this house with elements that represented the sea.  It is unique and amazing to see.  Used the audio guide, which was enough information.  Plan time to just soak in the details of his work in the design, and you will not be sorry.  A definite must with a visit to Barcelona, and only a short walk from his other house La Pedrera, so easily done on the same day.", "publishedDate": "2020-02-20", "language": "en", "rating": 5}, {"id": 746171773, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d191052-r746171773-Casa_Batllo-Barcelona_Catalonia.html", "text": "Magnifique villa of Gaudi, wonderful architecture , just unique in Barcelona, I love this style romantique; a must to visit .", "publishedDate": "2020-02-19", "language": "en", "rating": 5}, {"id": 745951752, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d191052-r745951752-Casa_Batllo-Barcelona_Catalonia.html", "text": "As we didn't purchase the tickets in advance, it was nice to discover no queues on a February afternoon.  \nThe audio guide tries to fill in the gaps, by displaying some firnishings etc, as the house itself is completely bare.  \nIt clearly once was a fabulous home, but the current maintenance does it little justice.  From broken skirtings, to faded woodwork and some damaged walls, the building is sadly not looking its best.  \nThe entry charge is steep, and no concessions (which makes it a very dear experience with 3 children in tow).  There are further attempts to make you part with even more money, as entry to some areas is an extra €10 (yes, children are chareged too), and a photo opportunity, which could be nice,starts at €12 a pic(though the pgotographer assured me it would be only €6).  Again, I would have been happier to support the conservation of this interesting structure had it been treated better.", "publishedDate": "2020-02-18", "language": "en", "rating": 3}, {"id": 745946195, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d191052-r745946195-Casa_Batllo-Barcelona_Catalonia.html", "text": "I feel truly blessed to have visited Casa Batllo. The audio guide was great and I was very pleasantly surprised with the level of access granted to visitors.\nSuperb!!", "publishedDate": "2020-02-18", "language": "en", "rating": 5}, {"id": 745873387, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d191052-r745873387-Casa_Batllo-Barcelona_Catalonia.html", "text": "I loved it! The windows were so exquisitely beautiful. The audio description was well done. Gaudi was truly a genius. I had seen the outside of his masterpieces in the past. It is well worth it to pay the extra to get inside and truly experience his works.", "publishedDate": "2020-02-18", "language": "en", "rating": 5}, {"id": 745713517, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d191052-r745713517-Casa_Batllo-Barcelona_Catalonia.html", "text": "This is a fascinating insight into Gaudi. The audioguide (included in the price of admission)  is very informative, and takes you through the entire house explaining his thoughts and plans. It also has a visual component which help to appreciate each component, with animations for how it once was - especially good to keep children’s attention. Staff nice.  Nice gift shop too. Well worth 1-2 hours. Ticket queue super long , so make sure you book. As ever, early entrance means crowds much less. ", "publishedDate": "2020-02-17", "language": "en", "rating": 4}, {"id": 745407158, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d191052-r745407158-Casa_Batllo-Barcelona_Catalonia.html", "text": "This incredible building is well worth a visit, I’ve been twice now, there’s so much to take in with every twist and turn within this incredible creation, fantastic views from the roof top gardens too, allow at least 2 hours for your visit.", "publishedDate": "2020-02-16", "language": "en", "rating": 5}, {"id": 745300627, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d191052-r745300627-Casa_Batllo-Barcelona_Catalonia.html", "text": "The building and architecture are fascinating and incredible, even if you're not into architecture. I don't always get audio guides, but I would definitely recommend getting one for Casa Batllo. Tons of rooms to explore, as well as the rooftop. The temperature inside the building was somewhat hot and stuffy, and it was very crowded which almost made me bring my overall rating down to a 4. We were there about 1.5 hours. It has an elevator if needed or lots of steps for good excercise.", "publishedDate": "2020-02-15", "language": "en", "rating": 5}, {"id": 745218361, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d191052-r745218361-Casa_Batllo-Barcelona_Catalonia.html", "text": "Interesting and fascinating as expected, you hope to see more and more every step you take. If you do not take a super priced tour you feel you haven't seen enough. It's an investment, I think it became too expensive. It's expensive to maintain it clearly, but still.\nIt's worth visiting, it's a good option to experience history in town. ", "publishedDate": "2020-02-15", "language": "en", "rating": 4}, {"id": 745066707, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d191052-r745066707-Casa_Batllo-Barcelona_Catalonia.html", "text": "We really enjoyed visiting Casa Batllo.  Going at just the right time lets the sun come in and illuminate certain parts of the museum.  You can go all the way up to the terrace and see the views (and more of Gaudis art).  We had our daughter with us in a stroller.  There is an elevator but it is a VERY tight squeeze.  Make sure to purchase tickets beforehand to avoid the lines because they stretch outside of the building.", "publishedDate": "2020-02-14", "language": "en", "rating": 4}, {"id": 745042676, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d191052-r745042676-Casa_Batllo-Barcelona_Catalonia.html", "text": "Can't imagine the mind of Gaudi! Beautiful tour with electronics that show the rooms as they were furnished originally. Well done, very nice staff.", "publishedDate": "2020-02-14", "language": "en", "rating": 5}, {"id": 744805453, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d191052-r744805453-Casa_Batllo-Barcelona_Catalonia.html", "text": "This is another Gaudi's buildings worth to discover. It's a smaller building than La Pedrera but for me it's even more beautiful. Moreover you have right beside this building another important city landmark: Casa Amatller, Built by another famous architect. It's curious to see how different are those buildings to each other.", "publishedDate": "2020-02-13", "language": "en", "rating": 5}, {"id": 744678568, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d191052-r744678568-Casa_Batllo-Barcelona_Catalonia.html", "text": "Get the audio tour for this because they have it set up with video of what the rooms in the house looked like at the time. Very creative way to see the exhibit. The details in the architecture are whimsical and beautiful. Must be experienced. Highly recommend. With all destinations like this, you should get your tickets in advance online. This will save you standing in long lines or even being dissapointed that they have sold out. We always reserved in advance and were happy we did. ", "publishedDate": "2020-02-12", "language": "en", "rating": 5}, {"id": 744665651, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d191052-r744665651-Casa_Batllo-Barcelona_Catalonia.html", "text": "A dream home. Unique, bright, cheerful, functional. I suggest getting the \"Early Morning\" tickets online. It was worth the extra cost. We were there before opening and already a lineup.", "publishedDate": "2020-02-12", "language": "en", "rating": 5}, {"id": 744638971, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d191052-r744638971-Casa_Batllo-Barcelona_Catalonia.html", "text": "We arrived at 9.30am with our pre-booked tickets and went straight in. This was a good time to go as it seemed to get busier as we were leaving around an hour or so later.\nWe were given our headset and smartphone for the tour. Wow - what a fabulous way to bring it to life. As you entered different areas and clicked the number on the screen the app showed the room full of furniture and decor. As you turned round the app also showed the room from the angle you were looking. Most people seemed to grasp how it worked but I saw a few people who were just listening to the audio and not looking at the screen so I think they missed out.", "publishedDate": "2020-02-12", "language": "en", "rating": 5}, {"id": 744601694, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d191052-r744601694-Casa_Batllo-Barcelona_Catalonia.html", "text": "It was an amazing experience. The exterior of the house was one of the most beautiful I have ever seen. The inside of the house was different from what you usually see. The audio and visual guide was very explanatory. Definitely a must see!", "publishedDate": "2020-02-12", "language": "en", "rating": 5}, {"id": 744600871, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d191052-r744600871-Casa_Batllo-Barcelona_Catalonia.html", "text": "We visited the Casa Batllo after getting off the hop on, hop bus outside the building. We purchased the ticket at the gate and entered the building straight away and there were no queue at the time we visited. The audio guide was excellent and really helped around the building. Would definitely recommend a visit while in Barcelona.", "publishedDate": "2020-02-12", "language": "en", "rating": 5}, {"id": 744497715, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d191052-r744497715-Casa_Batllo-Barcelona_Catalonia.html", "text": "It is a marvelous residential building with many interesting rooms and a beautiful rooftop. Book tickets in advance and walk on the roof to see the unique combination of colors used by Gaudi!", "publishedDate": "2020-02-11", "language": "en", "rating": 5}, {"id": 744478647, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d191052-r744478647-Casa_Batllo-Barcelona_Catalonia.html", "text": "Gaudi’s creative architecture is extraordinary. His use of colorful mosaics is delightful throughout the staircase, and there are unique details everywhere in the building. Worth the price of admission!", "publishedDate": "2020-02-11", "language": "en", "rating": 5}, {"id": 744440553, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d191052-r744440553-Casa_Batllo-Barcelona_Catalonia.html", "text": "The entrance fee is just too expensive and the line to get in was horrendous. My opinion is admire the work of Gaudi on the exterior of that building, which was more enjoyable than be in an always crowded space inside.", "publishedDate": "2020-02-11", "language": "en", "rating": 4}, {"id": 744428055, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d191052-r744428055-Casa_Batllo-Barcelona_Catalonia.html", "text": "One of the architectural works of Gaudi that deserves to be enjoyed in detail, step by step, room by room, floor to floor.", "publishedDate": "2020-02-11", "language": "en", "rating": 5}, {"id": 744420423, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d191052-r744420423-Casa_Batllo-Barcelona_Catalonia.html", "text": "When traveling it is a must to walk by this beautiful building.  I don't believe you will be disappointed.  Plus there are fun little neighborhoods to explore.", "publishedDate": "2020-02-11", "language": "en", "rating": 4}, {"id": 743989426, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d191052-r743989426-Casa_Batllo-Barcelona_Catalonia.html", "text": "We had an audio/visual guide and paid 25€ per person to get the tickets. Despite having the purchase the title and had an appointment, we still had to cue on the line like those without tickets.\n\nWhat's the point on purchasing the ticket online then?\n\nDespite this nonsense, the house is beautiful but the guide is disappointing. At some point I stopped playing the audio.", "publishedDate": "2020-02-09", "language": "en", "rating": 4}, {"id": 743924223, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d191052-r743924223-Casa_Batllo-Barcelona_Catalonia.html", "text": "We booked tickets in advance online before we traveled. It was a very unexpected and unusual place! The outside is like nothing you have seen before and the tour of the inside is amazing too. A bit too expensive for what you get but a must see in my opinion. You would spend about an hour and a half here on average. I would recommend it if it was a little less expensive but I guess it is a treat to see something so different.", "publishedDate": "2020-02-09", "language": "en", "rating": 4}, {"id": 743642656, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d191052-r743642656-Casa_Batllo-Barcelona_Catalonia.html", "text": "We liked it. Impressive Gaudi architecture. But even if it is a very spectacular building, we felt it is a bit overpriced. Expensive ticket for a relatively small building", "publishedDate": "2020-02-07", "language": "en", "rating": 4}, {"id": 743521208, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d191052-r743521208-Casa_Batllo-Barcelona_Catalonia.html", "text": "An excellent sight, we spent 1.5 hour to walk all over. The staff didn't help us much but it was ok . It could be less expensive.", "publishedDate": "2020-02-07", "language": "en", "rating": 5}, {"id": 743444190, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d191052-r743444190-Casa_Batllo-Barcelona_Catalonia.html", "text": "Casa Batllo is an architectural treasure, but you probably should pass on paying the exorbitant fee to visit the interior of this house. My wife and I paid the 25 euro each fee, buying tickets online in advance. This saved us 4 euro each to buy online and the price included an  audio/video guide:  Our take: even during the low season, the place is too crowded and 25 euro each is too expensive. Unless you’re a huge architecture or Gaudí fan (or are not worried about money at all), save your money, see the exterior of the building, and visit some of the other sights in the city instead, including the less costly and far more essential Sagrada Família. \n\nTo management: An appropriate fee for Casa Battlo would be around 10-15 euro each given pricing for other sights in the city. ", "publishedDate": "2020-02-06", "language": "en", "rating": 2}, {"id": 743438803, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d191052-r743438803-Casa_Batllo-Barcelona_Catalonia.html", "text": "If you come to Barcelona, you must visit Antoni Gaudi's works of which Casa Batllo is one of them. We went during the day and there are already many tourists outside taking pictures of the unique front. I do recommend going back at night as it does look quite different and is worth another picture.\nUpon entering, I recommend taking your time with the audio tour. It is quite entertaining learning the history and inspiration of Antoni Gaudi. His works are certainly unlike any other buildings you will see and it is difficult to describe it unless you visit it in person.", "publishedDate": "2020-02-06", "language": "en", "rating": 5}, {"id": 743256570, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d191052-r743256570-Casa_Batllo-Barcelona_Catalonia.html", "text": "I'm not arquittec but this building continues the style that we've been looking in our trip. Gaudí were a genius. Maybe, as usual, out of time with his designs, but the same happen with DaVincci, Michael Angelo, Raphael, and other, that their work was recognized after their death. All Gaudí art have the same form. Or deform. Is imppresive and beautiful. In Barcelona, you'll see art of Gaudí even when you don't want to see it.", "publishedDate": "2020-02-05", "language": "en", "rating": 5}, {"id": 743235206, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d191052-r743235206-Casa_Batllo-Barcelona_Catalonia.html", "text": "Well worth a visit and would certainly recommend buying tickets as it does get busy. A wonderful work of architecture and the audio guide provides insight. An impressive building, inside and out. ", "publishedDate": "2020-02-05", "language": "en", "rating": 5}, {"id": 743228991, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d191052-r743228991-Casa_Batllo-Barcelona_Catalonia.html", "text": "Casa Batllo was my favorite of all the Gaudi sites in Barcelona.  The whole building is unique and imaginatively created.  The colors, the architecture, even the neighborhood are phenomenal.", "publishedDate": "2020-02-05", "language": "en", "rating": 5}, {"id": 743220730, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d191052-r743220730-Casa_Batllo-Barcelona_Catalonia.html", "text": "Audio tour was great. I found this place interesting but not necessarily worth the cost. I think the exterior is more spectacular than the interior. However, if you like Gaudi and find his work interesting, you will probably appreciate it more than I.", "publishedDate": "2020-02-05", "language": "en", "rating": 4}, {"id": 743056646, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d191052-r743056646-Casa_Batllo-Barcelona_Catalonia.html", "text": "Amazing place. The virtual reality tour is great. They dont pack the place so you can enjoy the space.\n\nTake your time to view the building.", "publishedDate": "2020-02-04", "language": "en", "rating": 5}, {"id": 743044865, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d191052-r743044865-Casa_Batllo-Barcelona_Catalonia.html", "text": "We visited Cassa Batllo in January and there is no issue with getting tickets and walking right in.\n\nThe building was amazing and they did a fantastic job with the audio guide.  The device also serves as a virtual reality view of what the room looked like when furnished and allowed you to 'look around' and view the different items in the room.\n\nThe building is from the genius of Gaudi who was whimsical and practical all rolled into one.   All of his works were amazing to visit.", "publishedDate": "2020-02-04", "language": "en", "rating": 5}, {"id": 742952183, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d191052-r742952183-Casa_Batllo-Barcelona_Catalonia.html", "text": "To think of this as a mere house is too reductive. This is a true masterpiece and Gaudì is just a genius. there is note one door, or window, or wall, or brick that has a straigh line to it... just mindblowing.", "publishedDate": "2020-02-03", "language": "en", "rating": 5}, {"id": 742894392, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d191052-r742894392-Casa_Batllo-Barcelona_Catalonia.html", "text": "While the building itself is pretty, the tour is all virtual so the furniture and pieces were not actually there but a virtual simulation shown on a small phone they provide for the tour. The English audio guide also seemed lacking and found myself bored by the explanations in many times. \n\nBe sure to book online as they will charge you more for  getting tickets in person.  booking online also reduces your wait time. \n\nAnother note I had was The headset is reused from each person and didnt seem clean. With the coronavirus outbreak it would seem they would clean these with all the tourists coming through", "publishedDate": "2020-02-03", "language": "en", "rating": 1}, {"id": 742769390, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d191052-r742769390-Casa_Batllo-Barcelona_Catalonia.html", "text": "I really enjoyed this Gaudi tour, and like any of his works, what you see inside is hard to describe except it’s definitely his and every design has a purpose. If you liked his other works you’ll like this. It’s that same style but different, of course. \n\nMy only gripe is the price. My wife and I decided to splurge and pay for the gold level tickets. WAY too much money for this. There were 3 levels, general, silver, and gold. I don’t recall what each one came with or the prices but I think we would have been fine with the cheapest/ general level. \n\nThe modern salon access you get with the gold is just a single room outfitted with antiques of the period.  A guy there had us dress up in old timey clothes for one of those silly old fashioned photos like you can do at some amusement parks. We actually got two poses and the prints and digital codes were free. So that was something I guess but it’s more stupid/silly than cool and not worth it. We also got a tiny bottle of water each. So, yeah. Just get the general ticket and you’ll see the important stuff. ", "publishedDate": "2020-02-03", "language": "en", "rating": 4}, {"id": 742759424, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d191052-r742759424-Casa_Batllo-Barcelona_Catalonia.html", "text": "We booked via the Julia bus tour-hop on/off. Really good value with the bus ticket plus 2 attractions included for 85 euros.\nI wasn't really sure if I would enjoy Gaudi's work but it is absolutely amazing. Highly recommended to see such colour, imagination, quality workmanship and style. The queues, end of January, were minimal. There are a lot of stairs involved although I did see a lift. Don't think it was for visitors use though...worth asking if it means you get to experience, first hand the beauty of Casa Batllo. After visiting I could not wait to see more of this brilliant man's work.\nStaff were friendly and helpful. The audio guide was very informative.There is a gift shop and toilets available for visitors. No one rushed us but allow at least an hour...linger to enjoy the light, colours and just \"flow\" of the house. Captivating.", "publishedDate": "2020-02-03", "language": "en", "rating": 5}, {"id": 742604950, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d191052-r742604950-Casa_Batllo-Barcelona_Catalonia.html", "text": "We were supposed to be on a tour to Girona and Figueres but terrible rain and winds caused the tour operator to cancel the trip, so instead we went to the Gaudi houses. We are very glad that we had the opportunity to go inside and fully learn about Casa Batlo. Seeing the curves in the woodwork and attention to detail and the beautiful mosaics and colorful glass was truly a wonderful experience. When in Barcelona you must explore this beautiful house for yourself. To think a family actually lived in this house at one time. The balconies and courtyard were amazing!", "publishedDate": "2020-02-02", "language": "en", "rating": 5}, {"id": 742531111, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d191052-r742531111-Casa_Batllo-Barcelona_Catalonia.html", "text": "Just the thought of someone being so avant garde, and having these ideas of aesthetics in the late XIX century and in the early XX century is astonishing. The man was simply a genius. The house itself is so detailed that you really need the Smart guide to appreciate the detalis. Fantastic.", "publishedDate": "2020-02-01", "language": "en", "rating": 5}, {"id": 742473638, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d191052-r742473638-Casa_Batllo-Barcelona_Catalonia.html", "text": "One cannot leave Barcelona without going to Casa Batllo, truly amazing. Gaudí was a genius and the average person really gets to see and feel his work. A true work of love and art. Go during the day but also go at night. If visiting during the summer and weekend go to a night concert. ", "publishedDate": "2020-02-01", "language": "en", "rating": 5}, {"id": 742448720, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d191052-r742448720-Casa_Batllo-Barcelona_Catalonia.html", "text": "What a privilege to be able to visit this place! It's absolutely awesome! Gaudi was undoubtedly a genius and to have one of his masterpieces (now a private residence) available to visit is just remarkable. \n\nBarcelona is full of such treasures but this one is just so completely accessible. Don't miss it!", "publishedDate": "2020-02-01", "language": "en", "rating": 5}, {"id": 742356871, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d191052-r742356871-Casa_Batllo-Barcelona_Catalonia.html", "text": "I had seen the Casa Battlo from the outside multiple times, but visiting (silver ticket) was an addition beyond my expectations. When you are open to multi sensory experience and live architecture this will be well spend time and money. ", "publishedDate": "2020-02-01", "language": "en", "rating": 5}, {"id": 742314776, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d191052-r742314776-Casa_Batllo-Barcelona_Catalonia.html", "text": "The queues went forever the day I visited so I lashed out on a Gold ticket, jumped the queue and after visiting the astonishingly beautiful building using the self tour headsets provided I had my photo taken from the top of the building, visited the fabulous Gaudi shop and then, as part of the Gold Pass, was given access to one of the private apartments with a stunning array of furniture and lighting and dress ups provided for a free photo shoot inside the apartment.  Well worth the extra $$ if you can stretch.", "publishedDate": "2020-01-31", "language": "en", "rating": 5}, {"id": 742141717, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d191052-r742141717-Casa_Batllo-Barcelona_Catalonia.html", "text": "Casa Batllo is a beautiful building created by Gaudi.  The facade is stunning, the interior is even more breathtaking.  I was really surprised to see all those fine detail it has in every corner of the house.  It is not just a beautiful building, but a very functional and practical house to live in, even for today.  It was not too crowded when we were there early in the morning.  We went up to the roof top directly.  It was stunning and we took lots of photo here.  Many has mentioned that Casa Mila and Casa Batllo are very similar and visiting one of them is good enough  To me, both are different.  Visitor would get amazed by the detail of Casa Mila's architecture and structure, while Casa Batllo offers a even more refine touches to the already beautiful structure.  Anyway, this is definitely another must visit place while you are in Barcelona.", "publishedDate": "2020-01-30", "language": "en", "rating": 5}, {"id": 741890684, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d191052-r741890684-Casa_Batllo-Barcelona_Catalonia.html", "text": "Absolutely loved this architectural masterpiece by Gaudi. The exterior looks stunning. Inside is even more beautiful. \nWe got the basic tickets. Waiting line wasn’t too bad. Moved very quickly. Be aware there is a lot walking and climbing stairs. And it was very crowded! Rooftop is truly breathtaking!", "publishedDate": "2020-01-29", "language": "en", "rating": 5}, {"id": 741613869, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d191052-r741613869-Casa_Batllo-Barcelona_Catalonia.html", "text": "We did not go inside, but stopped to see it from the outside.  It is absolutely incredible to see in-person.  It is crazy that you walk up from the Metro and are suddenly standing in front of this exquisite work!", "publishedDate": "2020-01-27", "language": "en", "rating": 5}, {"id": 741540990, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d191052-r741540990-Casa_Batllo-Barcelona_Catalonia.html", "text": "The audio tour is interesting and informative with the AR. A tad expensive but Gaudi fans should go if you have time...", "publishedDate": "2020-01-27", "language": "en", "rating": 4}, {"id": 741497253, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d191052-r741497253-Casa_Batllo-Barcelona_Catalonia.html", "text": "The house is very special and a great place to visit for anyone who is a fan of art nouveau. One thing to keep in mind is that Casa Batllo is definitely overpriced as are most Gaudi experiences. As long as you understand this, the visit will be enjoyable.\n\nOur visit took place on a rainy Tuesday. Remember that you still have to queue even if you have paid in advance - unless you specifically pay to skip the line (yes, they will make money any possisble way here).\n\nThe audio guide is fun and uses AR to present how the rooms previously looked like. However it'll constantly push the wrong audio on unless you have it all the time in your hand. Still very informative and nice touch with the AR.", "publishedDate": "2020-01-27", "language": "en", "rating": 4}, {"id": 741459308, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d191052-r741459308-Casa_Batllo-Barcelona_Catalonia.html", "text": "My son and I are photographers.  There were so many interesting images that presented themselves to our view.  What an imagination Gaudi had!", "publishedDate": "2020-01-26", "language": "en", "rating": 4}, {"id": 741440812, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d191052-r741440812-Casa_Batllo-Barcelona_Catalonia.html", "text": "What an amazing historical house! The architectural designs are well before their time. I enjoyed seeing the pictures of the house with its original inhabitants.  I recommend buying your tickets ahead of time on-line and purchasing the old fashioned picture at the end. The picture is taken in a room furnished with historical furnishings and provides a better sense of when the house was originally inhabited.", "publishedDate": "2020-01-26", "language": "en", "rating": 5}, {"id": 741423558, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d191052-r741423558-Casa_Batllo-Barcelona_Catalonia.html", "text": "We paid for Gold Tickets, but actually were no different special in normal days which is not crowded.\nI recommend to have picture in last floor in balcony which they offer and pay for it because it's good special for couple, friends and families.", "publishedDate": "2020-01-26", "language": "en", "rating": 5}, {"id": 741076248, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d191052-r741076248-Casa_Batllo-Barcelona_Catalonia.html", "text": "Once again Gaudi turns to nature to create the Batllò house.  Beautiful organic shape abound everywhere and even the light well is a thing of beauty.  The audio guide is what makes this tour special as they use virtual reality so that you can see how each room would be furnished and used.  Well worth it!", "publishedDate": "2020-01-24", "language": "en", "rating": 5}, {"id": 741027348, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d191052-r741027348-Casa_Batllo-Barcelona_Catalonia.html", "text": "Excellent tour which is magnified with the use of Augmented Reality cell phone app that they provide.  You can see what it was like in Gaudi's time", "publishedDate": "2020-01-24", "language": "en", "rating": 5}, {"id": 740933784, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d191052-r740933784-Casa_Batllo-Barcelona_Catalonia.html", "text": "Incredible building like Gaudi himself. January is good for visit because not crowd. The building and style are very unique. Audio guide is great with depicting furniture and scenes from the times when living in the home. The ticket price is too high like every ticket in Barcelona", "publishedDate": "2020-01-24", "language": "en", "rating": 4}, {"id": 740846159, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d191052-r740846159-Casa_Batllo-Barcelona_Catalonia.html", "text": "€22 just to look around an empty house \nThere was nothing particularly interesting to look at and it was over quickly.", "publishedDate": "2020-01-23", "language": "en", "rating": 2}, {"id": 740634058, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d191052-r740634058-Casa_Batllo-Barcelona_Catalonia.html", "text": "Inside and outside, stunning architecture and design. Seems like there is a hidden surprise in every corner. We came early in the day. Short line and not a lot of people inside. Well worth it.", "publishedDate": "2020-01-22", "language": "en", "rating": 5}, {"id": 740503339, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d191052-r740503339-Casa_Batllo-Barcelona_Catalonia.html", "text": "100% worth seeing, do not miss this. Get your tickets in advance, skip the line and go right in! The audio tour and virtual tour are included in the basic ticket price and it is exceptional. It is interesting, easy to follow and gives a ton of info. I can’t imagine walking through the house with out it. ", "publishedDate": "2020-01-21", "language": "en", "rating": 5}, {"id": 740466218, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d191052-r740466218-Casa_Batllo-Barcelona_Catalonia.html", "text": "The building is a true masterpiece - outstanding facade and unique interior. The two problems we had during the visit are: 1) The price for tickets is more expensive in person, which is not mentioned online on the page for ticket info. We could totally buy it online but we didn’t see a necessity, so we didn’t. Then we found out on the spot about the difference when it was too late already. In my opinion this should be written on the website when you check the price and the hours. 2) The house was extremely overcrowded. We visited on Monday around 11 AM and there were no timed tickets. Everybody was entering. Inside you couldn’t move and it was a real struggle to take photos. People were pushing. I got very irritated at some point. Couldn’t fully enjoy the architecture and design that I came for. \nSo my advice is to buy tickets online and maybe try lunch time, when everybody goes to eat. ", "publishedDate": "2020-01-21", "language": "en", "rating": 3}, {"id": 740396221, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d191052-r740396221-Casa_Batllo-Barcelona_Catalonia.html", "text": "This house was just 100m from our hotel and it was a very windy rainy day so perfect for a visit. It was busy with a steady stream of people. To state the obvious the design, style, architecture and the building was very unique and way ahead of its time concerning the use of natural light and air conditioning. The audio guide was very good and it shed light on many aspects of the designer ideas, Mr. Gaudi. The ticket price is on the high side but worth it. ", "publishedDate": "2020-01-21", "language": "en", "rating": 4}, {"id": 740323996, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d191052-r740323996-Casa_Batllo-Barcelona_Catalonia.html", "text": "This is a very pretty and interesting building - we haven't toured inside, but the outside is lovely.  ", "publishedDate": "2020-01-20", "language": "en", "rating": 4}, {"id": 740263403, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d191052-r740263403-Casa_Batllo-Barcelona_Catalonia.html", "text": "We paid for our admission and audio guide at the Barcelona tourist info and were happy to get a 5:30 admission which allowed us to see the incredible rooftop in daylight as well as at night.  There were beautiful views of Barcelona from up there in all directions.  Inside we were mesmerized by how Gaudi married beauty and function in designing this amazing house.  The audio guide was informative and we found that the Casa Batllo wasn't nearly as crowded as some of his other properties but allowed us to appreciate his work at our own pace.  It was definitely much more pallatable to the crowds and noise at the other more popular properties.", "publishedDate": "2020-01-20", "language": "en", "rating": 4}, {"id": 740183825, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d191052-r740183825-Casa_Batllo-Barcelona_Catalonia.html", "text": "It was super interesting! The shapes, colors, all captivating! I would reccomend it to everyone! It was a nice experience.", "publishedDate": "2020-01-20", "language": "en", "rating": 5}, {"id": 740178098, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d191052-r740178098-Casa_Batllo-Barcelona_Catalonia.html", "text": "My one main problem with the attractions of this type in Barcelona are the high costs to go inside. My best advice is just look at it from the outside, you don't need to pay the money to go inside.", "publishedDate": "2020-01-20", "language": "en", "rating": 3}, {"id": 740051728, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d191052-r740051728-Casa_Batllo-Barcelona_Catalonia.html", "text": "This is a must see in Barcelona. Loved it! I actually enjoyed more than Casa Melia. The snow falling was a nice touch.", "publishedDate": "2020-01-19", "language": "en", "rating": 5}, {"id": 739969550, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d191052-r739969550-Casa_Batllo-Barcelona_Catalonia.html", "text": "Great building to look at. Have been in in the past but not on this trip, the entry price is ok for what’s included. \nIt wasn’t busy when we visited so would have been a great time to go in", "publishedDate": "2020-01-19", "language": "en", "rating": 4}, {"id": 739823279, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d191052-r739823279-Casa_Batllo-Barcelona_Catalonia.html", "text": "Perhaps one of the less viewed Gaudi buildings, but well worth braving the crowds to get a close-up look at his genius for planning details on top of details. For instance, the color of the tiles in the central atrium changes from top to bottom to help evenly distribute the light (see my photo). ", "publishedDate": "2020-01-18", "language": "en", "rating": 4}, {"id": 739625351, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d191052-r739625351-Casa_Batllo-Barcelona_Catalonia.html", "text": "Beautiful house!  It was so special to see it in person!  10/10 would recommend!  The auditory guide was very informative!", "publishedDate": "2020-01-17", "language": "en", "rating": 5}, {"id": 739251931, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d191052-r739251931-Casa_Batllo-Barcelona_Catalonia.html", "text": "Empty house which you walk around in which they give you a phone you can stand in each room and look at the phone to see what it was like. The phone they give you doesnt work that well it's often showing you the room back to front. Good information given. Lots of little kids around sitting on the floor bored. Very busy they let too many people in at the same time making it more time consuming to get around the house. Brought a copy one of the photos that was taken and was given a receipt told to go online so we could download our photo but once I went online they had obviously given the wrong receipt as I have someone elses photo. Very disappointed wanted to give a copy to family. Tried to contact via email and on Instagram no reply. Reading the reviews alot of people have the same opinion I wish I had maybe looked more into the reviews rather than looking at the high score this place has!", "publishedDate": "2020-01-15", "language": "en", "rating": 1}, {"id": 739023632, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d191052-r739023632-Casa_Batllo-Barcelona_Catalonia.html", "text": "25 euros to enter an EMPTY house with no furnitures... looks like a scam actually... inside the architecture is really not amazing, nothing compared to the facade.... but the facade can be seen from outside for free so don't pay, it doesn't worth it at all.", "publishedDate": "2020-01-13", "language": "en", "rating": 2}, {"id": 739003828, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d191052-r739003828-Casa_Batllo-Barcelona_Catalonia.html", "text": "This was the highlight of my trip.\n\nI went to the Casa Batllo not knowing how to pronounce the name of it and a little in awe. I walked away knowing how to pronounce the name and still in awe.\n\nThe early line access was great - recommend this. First through the doors on a Saturday morning and having the entire place to yourself is well worth it. No others to get in your way of pictures and taking in each entire rooms is very peaceful.\n\nThe audio guide is great to give you all the history of each room and looking at the screen shows how the room looked like with furniture in it - some rooms had the furniture removed.\n\nThe first-floor living room with its wide glass windows is impressive. No straight lines here and it does remind you of an undersea adventure.\n\nEach floor and room is magical and you have to admire the talent of Gaudi. Ahead of his times.\n\nEven the door handles impressed me. Purpose guilt out of his own hand. \n\nThe lightwells flood the entire building and highlight the interior design work and tiling. There was thought and personal touch in every part of the place.", "publishedDate": "2020-01-13", "language": "en", "rating": 5}, {"id": 738874366, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d191052-r738874366-Casa_Batllo-Barcelona_Catalonia.html", "text": "What a beautiful building placed in the middle of busy shops. \n\nIt is a must when in barcalona, just to see its beauty ", "publishedDate": "2020-01-13", "language": "en", "rating": 4}, {"id": 738737191, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d191052-r738737191-Casa_Batllo-Barcelona_Catalonia.html", "text": "A must do while in Barcelona. Some of the most beautiful architecture in the city! The only downside was the slightly high prices.", "publishedDate": "2020-01-12", "language": "en", "rating": 5}, {"id": 738702118, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d191052-r738702118-Casa_Batllo-Barcelona_Catalonia.html", "text": "A very beautiful house and very interesting balconies in the shape of human scules . We didn't went inside because of the very expensive ticket", "publishedDate": "2020-01-12", "language": "en", "rating": 5}, {"id": 738674812, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d191052-r738674812-Casa_Batllo-Barcelona_Catalonia.html", "text": "We were not prepared for the awesomeness of this masterpiece.\nWe want to go back in 6 years when it is finished. \nNo hassle ticketing and entrance.", "publishedDate": "2020-01-12", "language": "en", "rating": 5}, {"id": 738525190, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d191052-r738525190-Casa_Batllo-Barcelona_Catalonia.html", "text": "There was room to move around in this house. The tour guide noted that during high-season everyone is falling over each other. This day it was snowing inside. The top of the \"casa\" offers a panoramic view of the city. ", "publishedDate": "2020-01-11", "language": "en", "rating": 5}, {"id": 738334560, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d191052-r738334560-Casa_Batllo-Barcelona_Catalonia.html", "text": "We went on the night visit and it was truly amazing, extremely worth it. We drank a glass of wine while walking in the museum wearing flashlights on our heads and headphones everything was really interesting and the view from the rooftop was also really nice. ", "publishedDate": "2020-01-10", "language": "en", "rating": 5}, {"id": 738311731, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d191052-r738311731-Casa_Batllo-Barcelona_Catalonia.html", "text": "Went here after visiting the Pederas, another Gaudì house.  Wonderful and the audioguide was terrific, really brought the place alive.  Don't waste your money on the extra Salas Moderne, not worth it, just another opportunity to take your photo, this time in period clothes.  If that's your thing, go for it.  Otherwise, just enjoy this absolutely amazing house.", "publishedDate": "2020-01-10", "language": "en", "rating": 4}, {"id": 738154005, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d191052-r738154005-Casa_Batllo-Barcelona_Catalonia.html", "text": "Casa Batllo was probably my favorite part of visiting Barcelona. We booked directly through the Casa Batllo website and opted for the “Gold” self guided tour for €35/each. \n\nWhen we arrived just before 10am there was already a bit of a queue going, but with the gold tour you completely skip the line and go right in. I recommend scheduling as early as possible because the house does get really crowded. \n\nThe gold tour allowed us to enter a room that wasn’t available to any of the other tours - make sure you get your photo taken on the settee! They also gave us a free bottle of water when we exited the room. \n\nThe audio guide was great and I really liked the augmented reality part. I’m normally a huge fan of private guides, but we thought the audio guide they provided was perfect and I don’t think the tour is really long enough to warrant getting a guide. \n\nEven the gift shop was awesome. I never (ever!!!) buy souvenirs but I bought a few pieces of fun Gaudi inspired jewelry and even an illustrated print of Casa Batllo. \n\nI absolutely love Gaudi and to me, Casa Batllo is his most whimsical and fun work. It really is magical - make sure you don’t skip it when you visit Barcelona!\n\n", "publishedDate": "2020-01-09", "language": "en", "rating": 5}, {"id": 738111747, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d191052-r738111747-Casa_Batllo-Barcelona_Catalonia.html", "text": "This is a good looking townhouse - originallly constructed in the late 19th century by the genius architect Antoni Goudi. It is very beautifully decorated with lights from outside. The inside of the building is full of asymetrical floors, stairs and balconies.", "publishedDate": "2020-01-09", "language": "en", "rating": 4}, {"id": 738084445, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d191052-r738084445-Casa_Batllo-Barcelona_Catalonia.html", "text": "One of the most significant houses concerning the architecture of Gaudi, Casa Batllo is located next to Casa Amatller. It is a fascinating building that you need to visit in case you visit Barcelona.", "publishedDate": "2020-01-09", "language": "en", "rating": 5}, {"id": 738055812, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d191052-r738055812-Casa_Batllo-Barcelona_Catalonia.html", "text": "Buy the gold passes directly from their website.  You truly are front of the line.  The audio tour is terrific too.", "publishedDate": "2020-01-09", "language": "en", "rating": 5}, {"id": 738041918, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d191052-r738041918-Casa_Batllo-Barcelona_Catalonia.html", "text": "On my last trip to Barcelona, I saw the exterior of Batllo, checked it off my list, and moved on.\n\nI missed out!\n\nThis time, I took the tour.  It's amazing!  *Everything* is designed - the walls, the doors, the furniture, the windows.  I have to say again - amazing.  There is even snowfall.\n\nTake the tour.  Make sure you get all the way to the attic so you can see the vaults... an innovation Gaudi perfected and brought to Sagrada Familia.", "publishedDate": "2020-01-09", "language": "en", "rating": 5}, {"id": 737985953, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d191052-r737985953-Casa_Batllo-Barcelona_Catalonia.html", "text": "Worth visiting if you have the time. The 3d guide is very useful and helps you imagine how life in the early 20th century in Barcelona would have been like. ", "publishedDate": "2020-01-08", "language": "en", "rating": 4}, {"id": 737901606, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d191052-r737901606-Casa_Batllo-Barcelona_Catalonia.html", "text": "Visited the Casa Batlló which was so beautiful and loved the architecture and lighting in the house. It is a beautiful building and loved the details with stained glass and wood throughout the property.", "publishedDate": "2020-01-08", "language": "en", "rating": 5}, {"id": 737879202, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d191052-r737879202-Casa_Batllo-Barcelona_Catalonia.html", "text": "beautiful site with audio guide that is somewhat helpful\nenjoy!  very crowded but seems to move through fairly efficiently", "publishedDate": "2020-01-08", "language": "en", "rating": 5}, {"id": 737814800, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d191052-r737814800-Casa_Batllo-Barcelona_Catalonia.html", "text": "Visit to  know more about Gaudi style. Visit with Audio tour and try early morning with less crowd ..", "publishedDate": "2020-01-08", "language": "en", "rating": 4}, {"id": 737636880, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d191052-r737636880-Casa_Batllo-Barcelona_Catalonia.html", "text": "This building is now a museum with a curving roof created by architect Antoni Gaudi. It is along the same street of many well known shops.", "publishedDate": "2020-01-07", "language": "en", "rating": 4}, {"id": 737569693, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d191052-r737569693-Casa_Batllo-Barcelona_Catalonia.html", "text": "Loved it. You cannot miss it even when you do some shopping.Incredible architecture everyone have to see.", "publishedDate": "2020-01-07", "language": "en", "rating": 4}, {"id": 737566813, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d191052-r737566813-Casa_Batllo-Barcelona_Catalonia.html", "text": "Perhaps one of the less viewed Gaudi buildings, but well worth braving the crowds to get a close-up look at his genius for planning details on top of details. For instance, the color of the tiles in the central atrium changes from top to bottom to help evenly distribute the light (see my photo).", "publishedDate": "2020-01-07", "language": "en", "rating": 4}, {"id": 737553920, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d191052-r737553920-Casa_Batllo-Barcelona_Catalonia.html", "text": "This was a very well curated attraction.  the house itself id without doubt an absolute gem and well worth a visit even if you are on a tight schedule.  But the presentation of the house on the audio guide merits special praise.  This is interesting, well timed and provides a wealth of additional background that helps to enrich the visit.", "publishedDate": "2020-01-07", "language": "en", "rating": 5}, {"id": 737513024, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d191052-r737513024-Casa_Batllo-Barcelona_Catalonia.html", "text": "Another Gaudi masterpiece. Its beautiful and different. We spent around 30 minutes. If accompanied with kids, it could get a bit boring. The neighborhood is lovely though. ", "publishedDate": "2020-01-07", "language": "en", "rating": 4}, {"id": 737427306, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d191052-r737427306-Casa_Batllo-Barcelona_Catalonia.html", "text": "Great experience. Completely worth the time and money. So glad we didn’t miss this or Casa Mila as part of our trip to Barcelona. Highly recommend!  Purchasing tickets in advance was very helpful and saved us time and effort!", "publishedDate": "2020-01-06", "language": "en", "rating": 5}, {"id": 737386671, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d191052-r737386671-Casa_Batllo-Barcelona_Catalonia.html", "text": "Great place really worth the visit. It's so interesting to see all the work and imagination that's been out in.", "publishedDate": "2020-01-06", "language": "en", "rating": 5}, {"id": 737350797, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d191052-r737350797-Casa_Batllo-Barcelona_Catalonia.html", "text": "Architectural masterpiece. Stays open till late and you can spend as much time as you wish. In my opinion is a very interesting and magical place that feeds your imagination. ", "publishedDate": "2020-01-06", "language": "en", "rating": 5}, {"id": 737332274, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d191052-r737332274-Casa_Batllo-Barcelona_Catalonia.html", "text": "We went to the Casa Batilo with Context Walking Tours.  The building itself is remarkable in detail, spaces, inventive solutions, and our guide was an expert in art history and architecture.  It's a don't miss adventure into the vision of an incredible architectural mind.", "publishedDate": "2020-01-06", "language": "en", "rating": 5}, {"id": 737326549, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d191052-r737326549-Casa_Batllo-Barcelona_Catalonia.html", "text": "This building or I would say House is worth going to. Smart guide is alsi good and show some Real life experience of old times. Overall house is well shown and show real Gaudi's work. Completely attracted towards nature. ", "publishedDate": "2020-01-06", "language": "en", "rating": 4}, {"id": 737298390, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d191052-r737298390-Casa_Batllo-Barcelona_Catalonia.html", "text": "You have to arrive early (8:30am) but the benefit is an uncrowded, unrushed visit to this amazing venue.  We were 3rd and 4th in line and in most rooms had the rooms entirely to ourselves - to take picture, to look at the detail, and take in what the audio guide was saying.\n\nThe guide is very good but I definitely recommend bringing your own headphones.", "publishedDate": "2020-01-06", "language": "en", "rating": 5}, {"id": 737110564, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d191052-r737110564-Casa_Batllo-Barcelona_Catalonia.html", "text": "There are currently 2 different visits on offer. One is the torchlight visit and the other is the daytime visit. There are different levels of daytime visits available offering priority access and access to an additional area. The restoration is being funded by paid tourist visits and the audio guide provides some fascinating information about the project. It also superimposes furniture into the rooms to show how they may have looked in the past. What a fascinating structure!", "publishedDate": "2020-01-05", "language": "en", "rating": 5}, {"id": 737097499, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d191052-r737097499-Casa_Batllo-Barcelona_Catalonia.html", "text": "You can really see the genius of architect Antonio Gaudí in this house. All the details he thought of. All the different designs and even engineering aspects of the house. All in his head! Outstanding! If you appreciate architecture and art, and like modernism, you should definitely go to this place. Also, if you want a nice souvenir and skip the line, I recommend the gold option.", "publishedDate": "2020-01-05", "language": "en", "rating": 5}, {"id": 736975019, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d191052-r736975019-Casa_Batllo-Barcelona_Catalonia.html", "text": "I skipped the line, and was amongst the first viewers of the day. It is, of course the most wonderful building, and in many rooms I was one of just a few visitors. I have even taken a photograph of the front living area with its magnificent Windows without anyone else present. By the time I was reluctantly leaving, the crowds were in most rooms and there was a long queue of people waiting to get inside. Skipping the line and go first thing in the morning. HIghly recommended.", "publishedDate": "2020-01-04", "language": "en", "rating": 5}, {"id": 736953391, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d191052-r736953391-Casa_Batllo-Barcelona_Catalonia.html", "text": "We bought the Gold ticket online to skip the queue due to our very limited time in Barcelona and it was worth it. You really skip the long queue! The whole tour was mesmerising! The audio worked very well and the sound was perfect. Loved the virtual experience on the audio device. Taking a vintage photo was a nice experience. We were only few people there and had lots of time to choose our dress and didn't feel we were rushed. A must see place in Barcelona.", "publishedDate": "2020-01-04", "language": "en", "rating": 5}, {"id": 736931855, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d191052-r736931855-Casa_Batllo-Barcelona_Catalonia.html", "text": "Curved walls, fantastic colors, unusual furniture, tile, and history.  Antonio Gaudi's vision and talent are showcased in this home. ", "publishedDate": "2020-01-04", "language": "en", "rating": 5}, {"id": 736916949, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d191052-r736916949-Casa_Batllo-Barcelona_Catalonia.html", "text": "Looks stunning and took some great pics outside.  Didn’t bother with buying tickets to go in as it’s rather overpriced for what you actually see inside. However great photo opportunity outside with the facade the real star here.", "publishedDate": "2020-01-04", "language": "en", "rating": 4}, {"id": 736909085, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d191052-r736909085-Casa_Batllo-Barcelona_Catalonia.html", "text": "I saw this building as part of a Gaudi walking tour. I did not go inside as all Gaudi buildings are expensive to enter and thusly are not tourist friendly. It seems like it's an effort to make as much money as possible off the tourist.", "publishedDate": "2020-01-04", "language": "en", "rating": 3}, {"id": 736902124, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d191052-r736902124-Casa_Batllo-Barcelona_Catalonia.html", "text": "I was surprised to see the apartment building bang on the heart of Barcelona's commercial street. And was also surprised to understand that an apartment can also be designed like this.\nVisit from the street was contentful.", "publishedDate": "2020-01-04", "language": "en", "rating": 4}, {"id": 736871380, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d191052-r736871380-Casa_Batllo-Barcelona_Catalonia.html", "text": "One of Barcelona's landmarks. Magical. Mesmerizing. Watch walk away, return and rediscover the details you have missed earlier. Repeat endlessly or until your flight is up!", "publishedDate": "2020-01-04", "language": "en", "rating": 5}, {"id": 736858651, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d191052-r736858651-Casa_Batllo-Barcelona_Catalonia.html", "text": "Barcelona has many lovely houses built by the famous architect Gaudi and this one may be the most beautiful of all. The blue facade and the dancing balconies are simply lovely. It is possible to visit all the houses that Gaudi designed but we chose only one, Casa Milà, or La Pedrera and saw this one from the outside. The house next to it is also famous and beautiful. Shouldn’t be missed. ", "publishedDate": "2020-01-04", "language": "en", "rating": 5}, {"id": 736822948, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d191052-r736822948-Casa_Batllo-Barcelona_Catalonia.html", "text": "I believe this place was over hyped. Until and unless you are art or architecture fanatic, this is not truly worth visiting if you have other things to do.", "publishedDate": "2020-01-04", "language": "en", "rating": 4}, {"id": 736627452, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d191052-r736627452-Casa_Batllo-Barcelona_Catalonia.html", "text": "Is is a face and a soul of the city - Gaudi’s creation! Smart guide, nice trip route and great beauty of this place would give you great experience and great impression about Gaudi and Barcelona )", "publishedDate": "2020-01-03", "language": "en", "rating": 5}, {"id": 736548723, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d191052-r736548723-Casa_Batllo-Barcelona_Catalonia.html", "text": "The architecture is just amazing from outside and even better at night time with all the lights etc. But I couldnt convince myself to spend €90 for a family of 4. It is shockingly expensive even more than Sagrada which is the No.1 attraction in Barcelona. \n", "publishedDate": "2020-01-03", "language": "en", "rating": 4}, {"id": 736383337, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d191052-r736383337-Casa_Batllo-Barcelona_Catalonia.html", "text": "The building is certainly an architectural Gaudi masterpiece. It’s very sad to see that it’s used in a very business oriented manner. The smart guide was very disappointing. Very overrated. I expected much more, much better technology, much more content, especially given the price that was payed for it.", "publishedDate": "2020-01-02", "language": "en", "rating": 3}, {"id": 736356959, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d191052-r736356959-Casa_Batllo-Barcelona_Catalonia.html", "text": "The audio tour is well worth the time and money and took about an hour.  You get to see the first floor, the back courtyard, the roof, and more.  The highlights are the front room and the roof.  So much color and form and function all rolled together.  Be sure to get your photo on the top balcony - one of the best tour photos I’ve ever had taken.  I wish they had something showing the “before” that Guadí had to work with.  The transformation is pretty incredible.  There is a model of it at La Pedrera, which I’ve included in the attached photos.  Oh yeah, there is artificial snow falling down through the covered center courtyard, which was pretty interesting.", "publishedDate": "2020-01-02", "language": "en", "rating": 5}, {"id": 736063893, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d191052-r736063893-Casa_Batllo-Barcelona_Catalonia.html", "text": "Splendid house ! If you must visit one of Gaudi’s work of art, this is the one you shouldn’t miss. Each and every  corner of this house is a surprise for the visitor. Original and unique ! The audio guide is included and really useful. The only downsides : a lot of visitors and too expensive : 81 euros for 2 adults and a junior) !!!!", "publishedDate": "2020-01-01", "language": "en", "rating": 5}, {"id": 735916057, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d191052-r735916057-Casa_Batllo-Barcelona_Catalonia.html", "text": "Because of the uncertain political conditions in Barcelona around the time of our visit, we hadn’t purchased tickets to the two Gaudi-designed houses on Passeig de Gracia, and we had already seen long lines forming at Casa Batllo (remodeled by Gaudi 1904-1906) during our walks to the Metro station. We checked online and knew that tickets were available, so we purchased them just before we went there (22 Euros per person senior admission). An interesting audiovisual tour was included in the ticket price and included a device that showed how each room would have looked when it was furnished and decorated. There were a lot of stairs to climb as we ascended to the various floors but we were rewarded with interesting sights, including the fanciful structures on the roof. If you are a lover of blue in your decor, you will love this place! I do think it is overpriced, especially when compared with other Gaudi attractions such as the more interesting Casa Mila (La Pedrera), Parc Guell, and Sagrada Familia. Try to visit early or late as the lines can get long even with a ticket.", "publishedDate": "2019-12-31", "language": "en", "rating": 5}, {"id": 735703421, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d191052-r735703421-Casa_Batllo-Barcelona_Catalonia.html", "text": "Worth going inside for a tour with their very well done audio guide. As someone who enjoys architecture this building was a fun experience and an impressive demonstration.", "publishedDate": "2019-12-30", "language": "en", "rating": 5}, {"id": 735691800, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d191052-r735691800-Casa_Batllo-Barcelona_Catalonia.html", "text": "I wouldn't deny Casa Batllo is a beautiful architecture, but it's certainly overpriced in two aspects: 1. compared with other sightseeings in Barcelona (can you believe tickets for Casa Batllo cost as much as La Sagrada Familia?) 2. compared with the living cost in Barcelona. It's very crowded inside and I seriously think the experience would be much better if they further restrict the amount of visitors in each session. Whoever runs Casa Batllo, in my opinion, only cares about money. \n\nMy suggestion: if you have adequate budget and time, it probably still worths a visit, but if you are planning an inexpensive trip, I would recommend visiting 1 or 2 sites designed by Domonique besides Sagrade Familia, such as Santa Creu and Sant Pau hospital or Catalonia music hall. Gaudi is AMAZING, but Barcelona doesn't only have Gaudi.", "publishedDate": "2019-12-30", "language": "en", "rating": 3}, {"id": 735690819, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d191052-r735690819-Casa_Batllo-Barcelona_Catalonia.html", "text": "Gaudi is a real genius architect who knew how to design buildings ergonomically and thought of sustainability way back in his time, while people in 21st century still need to gain a more awareness of sustainability. Despite all the crowds, you will eventually get to enjoy every tiny piece Gaudi designed.\n\nP.S I would recommend buying a gold ticket to avoid a long line at the entrance.", "publishedDate": "2019-12-30", "language": "en", "rating": 5}, {"id": 735646003, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d191052-r735646003-Casa_Batllo-Barcelona_Catalonia.html", "text": "They do a great job with the interactive features.  You get to go on your own through the house.  We did the early morning which is the best because no one is there.  Buy tickets on line.", "publishedDate": "2019-12-30", "language": "en", "rating": 5}, {"id": 735641980, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d191052-r735641980-Casa_Batllo-Barcelona_Catalonia.html", "text": "Sadly we did not have enough time to go on the tour, and quite frankly I think it a bit overpriced, we did visit the outside of this Gaudi gem and just looking up at this awesome building was enough for us.\n\nWe were lucky to arrive in the early AM in low season so there no crowds and easy to find up-close views from all angles. And some mighty fine pix ops.\n\nDon't miss this gem. Even if you can;t afford the time or money to go inside.", "publishedDate": "2019-12-30", "language": "en", "rating": 4}, {"id": 735518652, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d191052-r735518652-Casa_Batllo-Barcelona_Catalonia.html", "text": "I was really amazed! If you love art, Casa Batlló is perfect. I was there in April 2019. I haven't bought the ticket before, the line was long, but it took only 30 minutes to buy the ticket.", "publishedDate": "2019-12-29", "language": "en", "rating": 5}, {"id": 735505408, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d191052-r735505408-Casa_Batllo-Barcelona_Catalonia.html", "text": "We purchased 4 tix and I assumed, wrongly, that they would allow us to bypass the long lines. We still, even with tickets in hand, had to wait in a line that stretched around the block. It doesn't make sense to buy the tickets ahead of time as the ticket buying line had no line! The exhibit was spectacular and audio guide was informative but their organization of ticket selling/lines is terrible.", "publishedDate": "2019-12-29", "language": "en", "rating": 2}, {"id": 735409832, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d191052-r735409832-Casa_Batllo-Barcelona_Catalonia.html", "text": "Colorful and lively designs all over the site.  Amazed by the detailed artwork everywhere even the door knob.", "publishedDate": "2019-12-29", "language": "en", "rating": 5}, {"id": 735297124, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d191052-r735297124-Casa_Batllo-Barcelona_Catalonia.html", "text": "Very Nice... one of best ghaudi's works of art. You should visit while In Barcelona and make sure to book skip the line ticket ", "publishedDate": "2019-12-29", "language": "en", "rating": 4}, {"id": 735287233, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d191052-r735287233-Casa_Batllo-Barcelona_Catalonia.html", "text": "Cannot visit Barcelona without seeing Gaudi creations. Book in advance your tickets. Choose early morning hours as it gets quite busy later on.", "publishedDate": "2019-12-29", "language": "en", "rating": 4}, {"id": 735252976, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d191052-r735252976-Casa_Batllo-Barcelona_Catalonia.html", "text": "This home was the most beautiful I’ve ever seen, and I’ve been to the Vanderbilt mansions in Rhode Island.  The venue provided the equivalent of iPhones that you could use to see how it once was when it was in use.  Highly recommend!", "publishedDate": "2019-12-28", "language": "en", "rating": 5}, {"id": 735247730, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d191052-r735247730-Casa_Batllo-Barcelona_Catalonia.html", "text": "With Sagrada Familia and La Perdera, the 3 can’t miss Gaudí structures.  The tour inside is a little strange with some unnecessary use of VR.  But the guide does share some very useful context for the house’s design, and the structure itself is amazing.  ", "publishedDate": "2019-12-28", "language": "en", "rating": 5}, {"id": 735073910, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d191052-r735073910-Casa_Batllo-Barcelona_Catalonia.html", "text": "Architecture is good but perhaps not as amazing as portrayed. It’s a good tour to understand Catalan style of architecture. I don’t think there is much to see beyond 1 hr. The audio guide doesn’t work well. Overpriced! Best part was gold member access to the living rooms etc where one can take some good pics.", "publishedDate": "2019-12-28", "language": "en", "rating": 3}, {"id": 734981877, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d191052-r734981877-Casa_Batllo-Barcelona_Catalonia.html", "text": "Amazing looking house. But too many people at once they need to control the numbers as not a nice experience. We turned up without a ticket and then bought a gold ticket which meant we walked straight in . The que was very long even for those with tickets so this was worth it, However once inside it was over crowded. The main problem was people trying to take photos of everything which was just stupid. Many people standing in the very narrow hallways holding everyone up. I got sick of it after a while and ended up barging through. Honestly people it is just a door knob.", "publishedDate": "2019-12-27", "language": "en", "rating": 4}, {"id": 734977349, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d191052-r734977349-Casa_Batllo-Barcelona_Catalonia.html", "text": " Gaudi’s genius is on display here and it is a quick introduction the the magic you will experiene throughout Barcelona.", "publishedDate": "2019-12-27", "language": "en", "rating": 4}, {"id": 734926709, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d191052-r734926709-Casa_Batllo-Barcelona_Catalonia.html", "text": "The building was amazing, the experience was terrible. This review has nothing negative to say about the building itself - the architecture is amazing, and Gaudi truly was a genius. My experience of the building, however, was ruined by the way visitors were managed within the building and the smartguide. I know the building is popular, and for good reason, but when I went (on a winter morning) the building was heaving with visitors and made moving through the space very difficult and actually quite distressing (can't begin to think how it is in summer). I am usually fine with crowds but I found this to be a very anxious experience due to the volume of people in the building. Numbers should be limited for the safety of people and the historic architecture. The audio and visual guide I found to be very strange and quite unnecessary, and actually resulted in a lot of people viewing the building solely through the screen of the phone which defeats the purpose of visiting a place. The screen literally showed you the same view of the room but with furniture in - what was the point? They could have just displayed old photographs. The building is still breathtakingly beautiful without needing to be shown that there was once furniture in it! The audio was pretty useless too and gave you very little historical information (which I would have liked) and instead just told you where to look and when in each room, meaning that everybody ended up looking in the same places and made thoroughfare very congested and the rooms crowded. I understand the motivation behind having a 'smart guide' that allows people to interact with the building but for me having both audio and smartphone combined to make it useless. After Casa Batllo I went to La Pedrera and their audioguide was simple and much more effective, as well as still being 'smart'. Overall, I was extremely disappointed and quite freaked out at the experience of Casa Batllo, and it prevented me from enjoying a building that is rightfully a UNESCO World Heritage site. I can't help but think that if Gaudi could see Casa Batllo now he would be disappointed at how it has become digitised, and monetised, and aims only to make profit off as much footfall as possible. It was like being in a Black Mirror episode.\nI have never written a negative review before and I don't like them, but I felt so strongly about my experience in Casa Batllo that i just had to say something. I am glad that so many people have a lovely experience enough to write a positive review, but next time I know that I will just admire the beauty from the outside.", "publishedDate": "2019-12-27", "language": "en", "rating": 1}, {"id": 734915598, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d191052-r734915598-Casa_Batllo-Barcelona_Catalonia.html", "text": "There are lots of great details, and lots of beauty. The guide is quite good, although the AR aspect is merely okay. We were lucky that it wasn't too full -- I fear trooping up the stairs with full crowds wouldn't be too fun. The views from the roof, the mosaics overall, the beautiful play with light and use of natural shapes and curves were some of my highlights.\n\nThe one star removal is for the high price -- it is worth seeing, I think, and a great example of Gaudi \"in the small\" (e.g. vs Sagrada Familia), but quite costly for the two floors of the house and stairwell, and those were often rather empty.", "publishedDate": "2019-12-27", "language": "en", "rating": 4}, {"id": 734822005, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d191052-r734822005-Casa_Batllo-Barcelona_Catalonia.html", "text": "The building and architecture are interesting, but the virtual guide is no substitute for having real decor and furnishings. The augmented reality was not enough to offset the empty rooms and holes in the walls. Some of the audio commentary was very informative, some of it clearly guesswork.", "publishedDate": "2019-12-26", "language": "en", "rating": 3}]}}]