[{"locationId": 10209665, "name": "Monument al general Prim", "placeType": "ATTRACTION", "reviewListPage": {"reviews": [{"id": 690586413, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d10209665-r690586413-Monument_al_general_Prim-Barcelona_Catalonia.html", "text": "This statue stands in tribute to Joan Prim i Prats, a Spanish soldier, politician and briefly Prime Minister of Spain for 6 months until his assassination. He is known for his leadership in the First Carlist War, the office of Captain General of Puerto Rico and for siding with the liberals against an increasingly authoritarian and conservative government.\n\nThe monument is a equestrian statue of Prim in military uniform. The sculpture sits upon a pedestal, with scenes of his life shown around it in reliefs including scenes of the military feats, the retirement of Mexico and the Battle of Castillejos.\n\nWorth a detour if in Parc de la Ciutadella or visiting Barcelona Zoo.", "publishedDate": "2019-07-18", "language": "en", "rating": 4}, {"id": 676493044, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d10209665-r676493044-Monument_al_general_Prim-Barcelona_Catalonia.html", "text": "This is a fitting monument to a great Catalan son. The equestrian sculpture depicts the famous military man and politician Joan Prim i Prats, who was President of the Council of Ministers of Spain and one of the architects of the Revolution of 1868, in all his glory. It is worth stopping by for a few moments.", "publishedDate": "2019-05-26", "language": "en", "rating": 4}, {"id": 675872910, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d10209665-r675872910-Monument_al_general_Prim-Barcelona_Catalonia.html", "text": "General Prim was the prime minister in the 1870s but was assassinated.  This is a nice statue to him in the park.", "publishedDate": "2019-05-23", "language": "en", "rating": 3}, {"id": 667745721, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d10209665-r667745721-Monument_al_general_Prim-Barcelona_Catalonia.html", "text": "Free.\nVisit Duration: 5 minutes.\nLocation: Entrance of the Parc de la Cituadella (Zoo side).\n\nJuan Prim y Prats was the Prime Minister of Spain for a short period (18 June 1869 – 27 December 1870) because he was assacinated. \n\nPart of the eight tons of bronze that were necessary to raise the monument came from fifteen mortars preserved in the castle of Montjuïc. The work was inaugurated on May 26, 1887, date of the anniversary of the peace achieved by Prim in the war in Morocco. \n\nOn December 20, 1936, the monument was demolished. After the war, the monument was rebuilt, but only one leg of the horse was preserved and a \"similar but not equal\" reproduction was made.\n\n Prim had searched to find a monarch who was not opposed to being democratically elected. He is quoted for saying that \"looking for a democratic monarch in Europe is like trying to find an atheist in Heaven\".", "publishedDate": "2019-04-19", "language": "en", "rating": 4}, {"id": 558647691, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d10209665-r558647691-Monument_al_general_Prim-Barcelona_Catalonia.html", "text": "This is a lovely and imposing monument, greeting you on your arrival to the main entrance of the park.", "publishedDate": "2018-02-05", "language": "en", "rating": 4}, {"id": 492190113, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d10209665-r492190113-Monument_al_general_Prim-Barcelona_Catalonia.html", "text": "Nice monument, but the plaza is a bit bare. There are nicer ones with benches and trees around the city. Okay if you happen by. ", "publishedDate": "2017-06-11", "language": "en", "rating": 3}, {"id": 460859219, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d10209665-r460859219-Monument_al_general_Prim-Barcelona_Catalonia.html", "text": "This is a lovely monument, located at the entrance to the beautiful Ciutadella park.\nGeneral Juan Prim was a 19th century military man and later politician and this lovely monument is a tribute to him.", "publishedDate": "2017-02-18", "language": "en", "rating": 4}]}}]