[{"locationId": 6116743, "name": "Mercat Abaceria", "placeType": "ATTRACTION", "reviewListPage": {"reviews": [{"id": 687623179, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d6116743-r687623179-Mercat_Abaceria-Barcelona_Catalonia.html", "text": "If you wish to taste the best local foods with reasonable prices, here is the place.  After the meal, you can also walk around the market to buy Spanish ham, sausages, nuts, dates, etc., etc.  You can also walk the old city and newly developed area near by.", "publishedDate": "2019-07-07", "language": "en", "rating": 5}, {"id": 687088475, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d6116743-r687088475-Mercat_Abaceria-Barcelona_Catalonia.html", "text": "If you are taking a stroll down La Rambla street you should not miss this food market.  There are many different vendors to let you experience many foods you might not normally try.  An authentic Barcelona experience. Also be aware of pickpockets there are many in the city.", "publishedDate": "2019-07-05", "language": "en", "rating": 4}, {"id": 671767323, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d6116743-r671767323-Mercat_Abaceria-Barcelona_Catalonia.html", "text": "Wow such a vibrant and welcoming market to visit. Very clean and inviting. Would highly recommend you visit this place.", "publishedDate": "2019-05-06", "language": "en", "rating": 5}, {"id": 611409375, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d6116743-r611409375-Mercat_Abaceria-Barcelona_Catalonia.html", "text": "Visited this market with my boyfriend. It was lovely walking around and trying different foods. We tried a fresh fruit drink and chorizo mmm. ", "publishedDate": "2018-08-28", "language": "en", "rating": 5}, {"id": 554227789, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d6116743-r554227789-Mercat_Abaceria-Barcelona_Catalonia.html", "text": "I visited this local food market while on a food tour in the Gracia neighborhood. While at this market, you must stop at La Trobada del Gourmet. They have the best selection of Spanish and Catalan Cheeses. Also visit Pairo Design while at the market for a wonderful assortment of local olives.", "publishedDate": "2018-01-16", "language": "en", "rating": 5}, {"id": 499675179, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d6116743-r499675179-Mercat_Abaceria-Barcelona_Catalonia.html", "text": "We wandered upon this wonderful indoor market.  It was very similar to Les Halles in Avignon, France.  Every purveyor having their own stall selling cheese, meats, olives, fish, etc.  And they were not catering to tourists - this was a Saturday in Barcelona with families shopping for fresh products.  You need to go into one of these markets to get a sense of local living.  This market was great.", "publishedDate": "2017-07-08", "language": "en", "rating": 5}, {"id": 496060225, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d6116743-r496060225-Mercat_Abaceria-Barcelona_Catalonia.html", "text": "This is a perfect market walking home from the M3 Green Line. Clean and well stocked. I found this market was open when most were closed.", "publishedDate": "2017-06-25", "language": "en", "rating": 5}, {"id": 479375994, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d6116743-r479375994-Mercat_Abaceria-Barcelona_Catalonia.html", "text": "Better not to go at saturdays. The Ajuntament want to rebuild soon all the market. Besides the typicall stuff, there at least 8 fish shops that are very good. It's a place to buy food to prepare at home (not to eat)", "publishedDate": "2017-04-26", "language": "en", "rating": 5}, {"id": 475230459, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d6116743-r475230459-Mercat_Abaceria-Barcelona_Catalonia.html", "text": "Some reviewers might have mis-tagged this for st Joseph market in la ramblas from the picture posted here.  It is simply a local market local people go to buy their daily food.  Interesting to see if you pass by but not worth making a trip .   There's also no food stall like in st Joseph.  However you can easily find food amongst the surrounding streets .", "publishedDate": "2017-04-13", "language": "en", "rating": 3}, {"id": 469747801, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d6116743-r469747801-Mercat_Abaceria-Barcelona_Catalonia.html", "text": "I went to the market on 2 occasions, once after dark and it was empty. Then on Saturday morning when the locals were out and about and the market was decorated for Carnival. In fact the shopkeepers had their faces painted like zombies. Not sure if that is a tradition or some fun quirky local event.", "publishedDate": "2017-03-23", "language": "en", "rating": 5}, {"id": 466419882, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d6116743-r466419882-Mercat_Abaceria-Barcelona_Catalonia.html", "text": "We were just walking home from La Sagrada Familia and stumbled upon this place. It was in the morning and leading up to it were some flea market looking booths.  Then i saw the entrance to this market.  It was great I think we were the only tourist there.  It was almost only locals there and it had everything catalonian.\n\nIf your into this type of thing you will like this place.", "publishedDate": "2017-03-11", "language": "en", "rating": 5}, {"id": 440082534, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d6116743-r440082534-Mercat_Abaceria-Barcelona_Catalonia.html", "text": "Staying close by and popped in to have a quick look. Ended up staying for 2 hours. Had some tapas and local made vermouth (delicious and cheap 1.50€) Lots of locals doing their daily shopping. I like being away fro the traditional tourist stuff sometimes and this was it.", "publishedDate": "2016-11-26", "language": "en", "rating": 4}, {"id": 395051872, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d6116743-r395051872-Mercat_Abaceria-Barcelona_Catalonia.html", "text": "Local market with local foods.  Way away from the tourist sights!  For those that want to be immersed in the culture this is the place to go!\n\nWander around and sample some food.  Take a stab and speaking Espanol/catauyan. \n\nViva Barcelona!", "publishedDate": "2016-07-21", "language": "en", "rating": 5}, {"id": 386577912, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d6116743-r386577912-Mercat_Abaceria-Barcelona_Catalonia.html", "text": "Small local market pretty much frequented only by locals. Nice experience but one visit was enough for me ", "publishedDate": "2016-06-27", "language": "en", "rating": 4}, {"id": 381693807, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d6116743-r381693807-Mercat_Abaceria-Barcelona_Catalonia.html", "text": "We stayed in Gracia (near the Joanic Metro) and this was the fresh market we shopped at.  I couldn't really figure out the hours - but the bakeries surrounding it were so good, I didn't really mind that it was closed sometimes.  When it was open it was full of bounty!  A dozen eggs for a euro, fresh local cheese, a great olive guy, fresh bread, plus lots of meat and seafood.  This is a real local mercat, not that over priced nonsense on the Rambla.  Everyone is so nice and it was a pleasure to be able to experience this part of Barcelona.", "publishedDate": "2016-06-11", "language": "en", "rating": 5}, {"id": 379770180, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d6116743-r379770180-Mercat_Abaceria-Barcelona_Catalonia.html", "text": "We visited on a weekday and the place was hoping.  There are lots of different vendors including fresh fruits, fish, nuts and restaurants.  This is a great place to go midday for a snack and to soak up the locals. ", "publishedDate": "2016-06-04", "language": "en", "rating": 5}, {"id": 376633101, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d6116743-r376633101-Mercat_Abaceria-Barcelona_Catalonia.html", "text": "Although we came here during standard opening hours, most of the market was closed and the other half was just an ordinary and quite boring produce market. ", "publishedDate": "2016-05-25", "language": "en", "rating": 2}, {"id": 365861038, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d6116743-r365861038-Mercat_Abaceria-Barcelona_Catalonia.html", "text": "Make sure you don't go there hungry 'cause you'll end up stopping and eating at every booth. If you can't find what you are looking, then it doesn't exist.  ", "publishedDate": "2016-04-20", "language": "en", "rating": 4}, {"id": 329783344, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d6116743-r329783344-Mercat_Abaceria-Barcelona_Catalonia.html", "text": "This is my local market, it sells delicious food. Go near the end of the day to get good deals on fish.", "publishedDate": "2015-11-29", "language": "en", "rating": 5}, {"id": 329217671, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d6116743-r329217671-Mercat_Abaceria-Barcelona_Catalonia.html", "text": "They have everything. It is bright, vibrant and if you can't find it here it doesn't exist. Great people watching what a great time. ", "publishedDate": "2015-11-26", "language": "en", "rating": 5}, {"id": 323272753, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d6116743-r323272753-Mercat_Abaceria-Barcelona_Catalonia.html", "text": "Tons of fresh produce, meats and cheeses. Shop & feel like a local in this busy, little market. For great cheeses, check out \"La Trobada Del Gourmet\". For an amazing olive-salt cod skewer, visit the \"Conserves Glòria\" booth. Picturesque place all around!! ", "publishedDate": "2015-10-30", "language": "en", "rating": 5}, {"id": 303893240, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d6116743-r303893240-Mercat_Abaceria-Barcelona_Catalonia.html", "text": "The joy of the old Gracia district is its working class roots.  Mercat Abaceria is a great example.  Unlike La Boqueria, which is crowded and expensive, Mercat Abaceria is not.  It's where you will find locals shopping and having conversations with the vendors.  For foodies who like to take photos, it's easier to navigate with its wide, quieter aisles.  Shop like a local.", "publishedDate": "2015-08-26", "language": "en", "rating": 5}]}}]