[{"locationId": 2223690, "name": "Reial Monestir de Santa Maria de Pedralbes", "placeType": "ATTRACTION", "reviewListPage": {"reviews": [{"id": 740012721, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d2223690-r740012721-Reial_Monestir_de_Santa_Maria_de_Pedralbes-Barcelona_Catalonia.html", "text": "Definitely worth a stop to get a dose od serenity into a busy Barcelona trip.\n\nI thought the film on the history of the convent was particularly worthwhile.", "publishedDate": "2020-01-19", "language": "en", "rating": 4}, {"id": 737566589, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d2223690-r737566589-Reial_Monestir_de_Santa_Maria_de_Pedralbes-Barcelona_Catalonia.html", "text": "What a hidden gem, such an old building (school) having such vast history and old style architecture, it's worth going 5o this place. It's out of town, so need to plan to go there Or city bus tour takes u there. ", "publishedDate": "2020-01-07", "language": "en", "rating": 5}, {"id": 733930940, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d2223690-r733930940-Reial_Monestir_de_Santa_Maria_de_Pedralbes-Barcelona_Catalonia.html", "text": "We live near the monestir and have visited it only a couple times before for specific events. Recently we were able to have a guided visit and we loved every minute of it. The cloister merits a sit just to relax in its quietness and the church a visit for its splendor. We recently went to the Christmas concert in the church and the acustics were incredible. We would suggest reading about it before visiting.", "publishedDate": "2019-12-21", "language": "en", "rating": 5}, {"id": 711192881, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d2223690-r711192881-Reial_Monestir_de_Santa_Maria_de_Pedralbes-Barcelona_Catalonia.html", "text": "It is a lovely building but the audio guide didn't say how many people lived there, etc., and gave little real information.  Church was closed which, as is part of the monatry was odd. Still, interesting building and some nice artefacts.", "publishedDate": "2019-09-19", "language": "en", "rating": 5}, {"id": 706615362, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d2223690-r706615362-Reial_Monestir_de_Santa_Maria_de_Pedralbes-Barcelona_Catalonia.html", "text": "If you would like to take a break from the typical monastery landmarks, then this is the place! The monastery is a quiet place up on the hill with lush scenery and a rich history (it was founded in 12th century) in Medieval and Romanesque architecture styles, with exhibitions and garden.", "publishedDate": "2019-09-04", "language": "en", "rating": 5}, {"id": 693611041, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d2223690-r693611041-Reial_Monestir_de_Santa_Maria_de_Pedralbes-Barcelona_Catalonia.html", "text": "This monestir is fantastic. In general you feel the atmosphere of medieval barcelona because of a well preserved place. Then you lost your mind in the interior garden. Indeed the masterpiece are colonnade and wlakway around the interior garden.\nIf you want beautiful pictures go there and in plus threre no tons of tourists :)", "publishedDate": "2019-07-28", "language": "en", "rating": 5}, {"id": 691418474, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d2223690-r691418474-Reial_Monestir_de_Santa_Maria_de_Pedralbes-Barcelona_Catalonia.html", "text": "Please do take time to visit Monestir de Pedralbes.\nWonderful cloisters, interesting museum. The peaceful, quiet setting is just what is needed in the middle of a weeks stay in Barcelona! Not to be missed .", "publishedDate": "2019-07-21", "language": "en", "rating": 5}, {"id": 690859312, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d2223690-r690859312-Reial_Monestir_de_Santa_Maria_de_Pedralbes-Barcelona_Catalonia.html", "text": "This small cloister a bit outside of the main area of Barcelona but easy enough from the blue line of the Hop On/Hop Off busturistic bus or by metro was a wonderful, quiet gem to find in the midst of the busy ness of the city.  It had real old world charm in the area and was refreshing after the other churches and Gaudi museums.  The history was very interesting and the artefacts that are still part of the collection from the beginning of the cloister from the 14th century was amazing.  Entrance fee is also reasonable.  I found it a relaxing way to spend an afternoon.  ", "publishedDate": "2019-07-19", "language": "en", "rating": 5}, {"id": 689587363, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d2223690-r689587363-Reial_Monestir_de_Santa_Maria_de_Pedralbes-Barcelona_Catalonia.html", "text": "The Monastery of Pedralbes is a superb religious building complex formed basically by a church and the Monastery itself. It was founded in the fourteenth century by Queen Elisenda de Montcada with the support of her husband King James II. It became immediately the house of the Poor Clare Order. It's in gothic style and in this respect it can be considered as a good example of Catalan gothic architecture as regards both the church and the Monastery cloister.\nThe church outer façade is quite sober though its octagonal belfry tower, its beautiful portal by the tower base and the stained glass windows have undeniably some charm. Its great simplicity contrasts its grandeur, altogether reflecting the characteristics of the mendiant architecture of southern Europe. It's a single nave church whose interior is quite impressive precisely because of its sobriety and also its lighting. The side chapels are very interesting and the ribbed vault is quite attractive. Special attention deserves the sepulchre of Queen Elisenda, housed in the presbitery, which has two sides, one facing into the church, where she is dressed in royal attire, and the other one looking onto the cloister where she is represented as a penitent widow. Other interesting features of that church are: the already mentioned stained glass windows (they date back from the sixteenth century when they were replaced following the introduction of the reform of the Strict Observance during that century), other sepulchres and the three choirs (triforium choir loft, chancel choir and the central monks' choir).\nHalf a way between the church and the cloister there is a small chapel dedicated to St. Michael which is an exciting lieu to be observed particularly on account of its frescoes depicting some scenes of Jesus and Mary's lifes.\nThe cloister is really marvellous. It has three floors, the two higher ones supported by columns whose capitals are decorated with emblems of the King of Aragon and the House of Montcada. The pointed arches between every two of those columns are really beautiful. In the cloister center there is a garden with a fountain in the middle. Altogether it forms a gorgeous ensemble. The place is in general rather peaceful, thus adequate to spend a long while in an oasis of peace in a city whose bustle is by the way remarkable.\nThe monument concerned is a bit far from the city center but it's easily accessible particularly by bus. The visit of the monastery is worth the while anyway. Apart from the parts thereof already pointed out one can likewise have the possibility to visit different Monastery rooms such as the kitchen, the refectory and the nursery. There is even a museum in the former dormitory of the monastery. There one can behold sacred and everyday objects from the 14th to the 20th centuries. In addition to Queen Elisenda's grave referred to above there one can see other graves appertaining to superiors of the Monastery and cells on the northern side of the cloister.\nBy and large therefore, it's an interesting as well as stunning place to visit in Barcelona, which shouldn't be missed while being on tour in the mentioned city.", "publishedDate": "2019-07-14", "language": "en", "rating": 5}, {"id": 681836055, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d2223690-r681836055-Reial_Monestir_de_Santa_Maria_de_Pedralbes-Barcelona_Catalonia.html", "text": "Nice architecture. Monastery is very old and has interesting history. Not expensive. \nHighly recommend.", "publishedDate": "2019-06-16", "language": "en", "rating": 5}, {"id": 679397454, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d2223690-r679397454-Reial_Monestir_de_Santa_Maria_de_Pedralbes-Barcelona_Catalonia.html", "text": "My wife and I visited the Santa Maria monastery during a recent visit to Barcelona. We were dropped off by the hop-on-hop-off bus and spent about 40 minutes looking around. The seniors' entry fee was only €3.50 each.  There were some interesting displays and the setting is rather beautiful. Definity worth popping in to if going past.", "publishedDate": "2019-06-06", "language": "en", "rating": 4}, {"id": 676312263, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d2223690-r676312263-Reial_Monestir_de_Santa_Maria_de_Pedralbes-Barcelona_Catalonia.html", "text": "I took 2 trains to get here and I’m so glad I did, the grounds are absolutely stunning, so peaceful and quiet, so fascinating and drenched in history, I absolutely loved it and highly recommend when in Barcelona. ", "publishedDate": "2019-05-25", "language": "en", "rating": 5}, {"id": 674462850, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d2223690-r674462850-Reial_Monestir_de_Santa_Maria_de_Pedralbes-Barcelona_Catalonia.html", "text": "Staying in Tres Torres, this is within walking distance, but also on the tourist bus routes. A world away from the hustle and bustle of Barcelona central, a quiet and serene architectural masterpiece - could easily be a location for Game of Thrones!  The history and well preserved artefacts is interesting without being too over the top.  Combine this visit with Bellesguard and you will not be disappointed.  ", "publishedDate": "2019-05-16", "language": "en", "rating": 5}, {"id": 674461300, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d2223690-r674461300-Reial_Monestir_de_Santa_Maria_de_Pedralbes-Barcelona_Catalonia.html", "text": "We didn’t know about this place and monastery until some locals told us about it and advised to go and have a look. We had an amazing walk in this beautiful place with lovely architecture. Really recommended!", "publishedDate": "2019-05-16", "language": "en", "rating": 5}, {"id": 674417289, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d2223690-r674417289-Reial_Monestir_de_Santa_Maria_de_Pedralbes-Barcelona_Catalonia.html", "text": "This is a lovely historic building with a range of exhibits, many of which have been here for hundreds of years. The highlight for me was the painted cell with the depictions of scenes from the life of Christ, with women playing a starring role.\nIt is a bit of a way from the centre, but not too far from the football ground and is an oasis of calm in a bustling city. Restful and relaxing, and well worth a visit. Free entry with a Barcelona card.", "publishedDate": "2019-05-16", "language": "en", "rating": 5}, {"id": 673787124, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d2223690-r673787124-Reial_Monestir_de_Santa_Maria_de_Pedralbes-Barcelona_Catalonia.html", "text": "If I could only see one thing in Barcelona, I would choose this. I visit every time I am in Barcelona, although mobility issues are now limiting me. However,  there is a lift/ elevator to take you to the upper floors, and the ground floor and outside is wheelchair accessible. It is utterly beautiful, simple, atmospheric, not at all crowded. It is a wee bit out of town, we took two buses, but worth the trouble.", "publishedDate": "2019-05-13", "language": "en", "rating": 5}, {"id": 671654222, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d2223690-r671654222-Reial_Monestir_de_Santa_Maria_de_Pedralbes-Barcelona_Catalonia.html", "text": "A monastery in a Gothic style, cloisters on three levels created by arches and columns; there is a courtyard in the middle.\nIn the chapel dedicated to Saint. You can find many paintings by Feerer Bassy.\nInteresting place worth visiting.", "publishedDate": "2019-05-05", "language": "en", "rating": 4}, {"id": 670778051, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d2223690-r670778051-Reial_Monestir_de_Santa_Maria_de_Pedralbes-Barcelona_Catalonia.html", "text": "This place is a gem and is definitely underrated in Barcelona. It’s quiet, everyone is respectful and not too expensive. It’s not exactly in the center but it’s worth to go and have a look!", "publishedDate": "2019-05-01", "language": "en", "rating": 5}, {"id": 669461135, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d2223690-r669461135-Reial_Monestir_de_Santa_Maria_de_Pedralbes-Barcelona_Catalonia.html", "text": "This place is not very touristic, so it's not really crouded and it's very convenient. Not a must see, but if you have free time, i advise you to visit it!", "publishedDate": "2019-04-26", "language": "en", "rating": 5}, {"id": 664538254, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d2223690-r664538254-Reial_Monestir_de_Santa_Maria_de_Pedralbes-Barcelona_Catalonia.html", "text": "This monastery is out of the way (we got the metro and then we had a 15 minute walk uphill), but it is beautiful and interesting and it's always nice to find somewhere off the beaten track.", "publishedDate": "2019-04-07", "language": "en", "rating": 4}, {"id": 661734397, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d2223690-r661734397-Reial_Monestir_de_Santa_Maria_de_Pedralbes-Barcelona_Catalonia.html", "text": "Pedralbes isn't convenient to the tourist part of Barcelona and that's a good thing. It does reward the visitor who makes the effort to get out to visit. We found it a refreshingly quiet counterpoint after spending several hours at Parc Guell. Pair your visit with a meal at the nearby Abessess' Garden for a memorable afternoon in Barcelona.", "publishedDate": "2019-03-27", "language": "en", "rating": 5}, {"id": 649151017, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d2223690-r649151017-Reial_Monestir_de_Santa_Maria_de_Pedralbes-Barcelona_Catalonia.html", "text": "The monastery is located a little bit further from the city center and not that many people know about it so as a result it’s not overcrowded. It’s precious with the green garden, beautiful arcades and the peace and quiet. The architecture is in good condition and many rooms have some small exhibitions, however usually with only catalan descriptions. On Sundays it’s free of charge as it belongs to city council. ", "publishedDate": "2019-01-30", "language": "en", "rating": 4}, {"id": 647213733, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d2223690-r647213733-Reial_Monestir_de_Santa_Maria_de_Pedralbes-Barcelona_Catalonia.html", "text": "I did not go inside, due to my schedule, BUT we did a slow motion drive-by ...  and it;s heavenly when lit up at night.. When I get back to Barcelona I will make the time to get inside and walk the grounds.  So, if you don’t have time, at least make a note to drive past it....slowly so you soak it up.", "publishedDate": "2019-01-20", "language": "en", "rating": 4}, {"id": 643350025, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d2223690-r643350025-Reial_Monestir_de_Santa_Maria_de_Pedralbes-Barcelona_Catalonia.html", "text": "I only saw this monastery from the outside as I couldn't afford the five euros to enter. It's difficult to get nice photos for the outside so you really have to pay to enter. It has old style buildings, turrets, and a large perimeter wall all in stone and situated on a cobbled street.", "publishedDate": "2019-01-03", "language": "en", "rating": 4}, {"id": 642472303, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d2223690-r642472303-Reial_Monestir_de_Santa_Maria_de_Pedralbes-Barcelona_Catalonia.html", "text": "My wife and I have been to many monasteries in many different countries. They all have one theme in common: they are very quiet and peaceful. This Monastery was the complete opposite. Unfortunately, we were there while a primary school was visiting. The kids were extremely loud and were running all over the place. Very, very disrespectful. What made things even worse was that the adults who were supposed to be supervising them were not doing so. What was really bad, was that the so-called security who was working there also did not do anything. There was one point where a child was running and yelling right by a security officer and he did not even look up while he was playing around on his mobile phone. We wanted to stay longer, but we finally left whenever we were trying to relax in the courtyard area and the kids were being loud and obnoxious.\n\nThe front staff members were not exactly friendly either. The washrooms reeked like cigarette smoke. ", "publishedDate": "2018-12-30", "language": "en", "rating": 2}, {"id": 633093008, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d2223690-r633093008-Reial_Monestir_de_Santa_Maria_de_Pedralbes-Barcelona_Catalonia.html", "text": "We were doing the hop on hop off ride but determined to stop here and visit - so pleased we did - the beauty and peace away from the bustle of the town was very welcome.", "publishedDate": "2018-11-12", "language": "en", "rating": 5}, {"id": 618458967, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d2223690-r618458967-Reial_Monestir_de_Santa_Maria_de_Pedralbes-Barcelona_Catalonia.html", "text": "Hopped off the tourist bus and went to visit the Monastery. It was absolutely beautiful. I did find that quite a few places were closed off for renovation and new exhibits being sorted. But the grounds themselves and the exhibition rooms were interesting (altho everything was in Spanish - you would need a guide or the audio guide). I just went to wander around and get some peace. The church itself is lovely too. I can't tell you what exciting art etc is there as i didnt get a guide. I just wanted to wander around and enjoy my time there. Easy to hop back on the bus virtually outside.", "publishedDate": "2018-09-21", "language": "en", "rating": 4}, {"id": 614672948, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d2223690-r614672948-Reial_Monestir_de_Santa_Maria_de_Pedralbes-Barcelona_Catalonia.html", "text": "This monastery is just of the blue route bus tour and well worth stopping. A quiet prayerful spot in a busy city. Also a fascinating range of artefacts though hundreds of years of religion and community.", "publishedDate": "2018-09-07", "language": "en", "rating": 5}, {"id": 607982972, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d2223690-r607982972-Reial_Monestir_de_Santa_Maria_de_Pedralbes-Barcelona_Catalonia.html", "text": "by checking on here before we left for BARCA we found a few reviews for this place and it was really good.... i dont like churches so much BUT love old buildings and this had the living quarters and we were even allowed inside the church.  it was a good hour or so out of the heat.  use the hop on and off bus!!!", "publishedDate": "2018-08-19", "language": "en", "rating": 5}, {"id": 592683818, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d2223690-r592683818-Reial_Monestir_de_Santa_Maria_de_Pedralbes-Barcelona_Catalonia.html", "text": "Beautiful way beyond what we expected. In a small neighborhood less than a mile from the hotel (AC Victoria  Suites by Marriott—highly recommended) so we got a little exercise after coming off the cruise ship. Very small attendance so easy to get around—rent information headset to understand the exhibits. Save and hour for the museum which was fantastic. ", "publishedDate": "2018-07-03", "language": "en", "rating": 5}, {"id": 589139161, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d2223690-r589139161-Reial_Monestir_de_Santa_Maria_de_Pedralbes-Barcelona_Catalonia.html", "text": "this monastery was on our list of things to do in barcelona and getting there was made all the more easy because it was a stop on the blue route of the bus touristic hop on/hop off tour.\n\nin a city as hectic as barcelona, this monastery is a must-do. the architecture is beautiful but it's the overwhelming sense of tranquility that sets it apart. it all begins as you walk up to the monastery on the old cobblestone road. it just feels like a step back in time. of course there are many parts of barcelona that feel like a step back in time, but there's usually hundreds of people there at the same time having that same thought.\n\nthis is a relatively quiet spot with only a handful of people visiting when we were there. it's a tricky scenario actually. i want to encourage more people to go but at the same time, it was so nice to visit somewhere without crowds.", "publishedDate": "2018-06-20", "language": "en", "rating": 4}, {"id": 583806615, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d2223690-r583806615-Reial_Monestir_de_Santa_Maria_de_Pedralbes-Barcelona_Catalonia.html", "text": "The monastery was lovely and very quaint. It was a nice way to spend an afternoon. The audio guide is good but very long and not always full of interesting information. The museum in the monastery has beautiful works of art and could take an hour to go through on its own. Definitely try and time your visit so you can see the main chapel (it is closed for service at certain hours). It was great getting to see the recreations and depictions of daily life in the monastery, coupled with hearing about its rich history via the audio guide.", "publishedDate": "2018-05-30", "language": "en", "rating": 4}, {"id": 580684833, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d2223690-r580684833-Reial_Monestir_de_Santa_Maria_de_Pedralbes-Barcelona_Catalonia.html", "text": "Sick of the crowded streets and typical tourist sites? Head for the hills and the beautiful Monastery of Pedralbes. (This destination was a great tourist tip from our Spanish Trails guide.  Thanks, José!) The gothic monastery provides a break from Barcelona’s heat as you stroll through the peaceful 14th century spaces. Be warned that access to the chapel and the well-preserved paintings is only available from 11am - 1pm. If you don’t know Spanish the 60 cent English audio guide is a good idea. Getting there can be part of the adventure. If you decide to hoof it as we did, it’s a long, but interesting walk through Barcelona’s various residential neighborhoods. Stop and shop or have lunch along the way.   Or it’s just a short walk from the nearest subway station.", "publishedDate": "2018-05-16", "language": "en", "rating": 4}, {"id": 571082824, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d2223690-r571082824-Reial_Monestir_de_Santa_Maria_de_Pedralbes-Barcelona_Catalonia.html", "text": "At the time of visit (Feb), the Chapel of St Michael was closed for restoration. The opening hours were shorter, and I had a quick tour. Entrance fee is €5 (free Sunday afternoon). The audioguide (€0.6) gives very detailed information (some parts too detailed for the general public, unless you are very interested in the rather esoteric historical bits). There were few visitors at that time. The place was quiet and tranquil. In the three level cloister, there are cells where nuns formerly lived/prayed/worked (different according to their status), kitchen, refectory, dormitory, halls. There were some temporary exhibitions (including one on women and furniture in the medieval time, how women found their niche in a patriarchal world back them).\nIt's easy to get to using public buses.", "publishedDate": "2018-04-04", "language": "en", "rating": 4}, {"id": 570097243, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d2223690-r570097243-Reial_Monestir_de_Santa_Maria_de_Pedralbes-Barcelona_Catalonia.html", "text": "This unique monastery built in Gothic style is located just ahead of the famous Sarria district in a posh neighborhood of Barcelona. An old gate and cobbled pathway takes up a small slope to the Museum, church and gardens and for some time you might not even remember you are in a city but in an ancient walled city area like Mdina. Close to the entrance is a Museum (steep ticket) which takes you for a tour of the monastery and the cloister. To the right is a garden while to the left is a beautiful old church. Steps lead up the hill to presumably the residential areas of the monastery and streets above. The chapel of St Michael was closed for renovations when we visited but due to be ready by March 2018. We were lucky that the church gates were open to let in some flower decorators/contractors and we got a chance to slip in. We were in total awe and spellbound by the beauty of the inner precincts. We spent a few minutes in prayer, took some photos for memories and quietly exited. Lovely place to visit !", "publishedDate": "2018-04-01", "language": "en", "rating": 4}, {"id": 567389190, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d2223690-r567389190-Reial_Monestir_de_Santa_Maria_de_Pedralbes-Barcelona_Catalonia.html", "text": "Started 14c under Queen of Aragon direction, a nunnery as most religious building of a that period a self contained small town in itself. Now firmly located within Barcelona suburbs and an easy ride towards the top of Avenida Diagonal. Blue bustram runs up that way, And be careful to check on opening times,\n\nOnce inside a tranquil and relaxing place with perhaps some of the best gothic architecture preserved and lovingly restored. The three level cloisters an absolute gem. A work in progress so be prepared for  things going on and still part used by the nuns, so the church side does function on a daily basis. Well worth a bit of time away from the bustle of the city for a look around at another era completely.", "publishedDate": "2018-03-19", "language": "en", "rating": 5}, {"id": 551077387, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d2223690-r551077387-Reial_Monestir_de_Santa_Maria_de_Pedralbes-Barcelona_Catalonia.html", "text": "Located Baixada del Monestir, we find very nice Moorish/Catalan architecture, with arcs and wonderful courtyards; this majestic Monastery was founded 1326, a royal place to visit.", "publishedDate": "2018-01-02", "language": "en", "rating": 5}, {"id": 539180055, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d2223690-r539180055-Reial_Monestir_de_Santa_Maria_de_Pedralbes-Barcelona_Catalonia.html", "text": "The area is amazingly clean and very luxurious. The streets are very clean, we enjoyed wandering around the Monestir. I advice you to go be either of the hop-on-hop-off buss or by the blue tram and enjoy your ride up to the Monastery.\n\nIt's really wonderful.", "publishedDate": "2017-11-07", "language": "en", "rating": 5}, {"id": 534582717, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d2223690-r534582717-Reial_Monestir_de_Santa_Maria_de_Pedralbes-Barcelona_Catalonia.html", "text": "We were very excited to make the trip on two trains to see the monastery. Arrived walked around the building to try to get in then came across a tiny plaque with the opening times- it closed at 2pm! 😡\nStill, at least we got our daily exercise! ", "publishedDate": "2017-10-20", "language": "en", "rating": 1}, {"id": 522001370, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d2223690-r522001370-Reial_Monestir_de_Santa_Maria_de_Pedralbes-Barcelona_Catalonia.html", "text": "I don't believe anything about god but when I visited there and listening the guide machine I can felt I kind of life when ppl life there and now I know more about trial Monestir de Santa Maria de pedralbes ", "publishedDate": "2017-09-06", "language": "en", "rating": 5}, {"id": 517823843, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d2223690-r517823843-Reial_Monestir_de_Santa_Maria_de_Pedralbes-Barcelona_Catalonia.html", "text": "After visiting the Palau real, we headed there (like 15 minutes walking from there). The price is 5 Euros and it's worth it. Everything is in good shape, there are a few temporary expositions. There are rooms that were used by the nuns, a huge hall that looks impressive when you are entering from the stairs. Depending on the time the church is opened (we were at 12:00 and it was closed), as it's managed by the nuns and not by the same that manage the monastery.\nIf you go there walking, the area is nice.\n", "publishedDate": "2017-08-26", "language": "en", "rating": 5}, {"id": 515407323, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d2223690-r515407323-Reial_Monestir_de_Santa_Maria_de_Pedralbes-Barcelona_Catalonia.html", "text": "An old convent and church which is now a museum of monastic life.  Catalan Gothic style, built in 14th century. There is a 3 storey cloister.\n2 hours is recommended for the visit.", "publishedDate": "2017-08-20", "language": "en", "rating": 5}, {"id": 505216458, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d2223690-r505216458-Reial_Monestir_de_Santa_Maria_de_Pedralbes-Barcelona_Catalonia.html", "text": "We stayed at the Hilton in the Pedralbes area and had some time before catching our train to Paris at Barcelona Sants, also near by. We ran up to the Monastery around 3:00 and we able to have a nice if not abbreviated visit. The site itself is a 14 Century in the middle of a 20th century neighborhood and its exterior is a beautiful Catalan Gothic. I mentioned the time because in the afternoon the sisters use the church building and it was not open to the public. Still we were able to visit the amazing 3 story Gothic cloister as well as the treasury which displayed incredible Gothic art work. We also were able to see the nun side of the featured grave of its found Elisenda, Queen of Aragon. (Queen side is inside the chapel.)\n\nWhile there were a few other people there, this is a real hidden gem that is off the tourist path and rarely visited. If you are in Pedralbes for your hotel or shopping take the time to visit. You will be rewarded with a great Baracelona site.", "publishedDate": "2017-07-24", "language": "en", "rating": 5}, {"id": 497317955, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d2223690-r497317955-Reial_Monestir_de_Santa_Maria_de_Pedralbes-Barcelona_Catalonia.html", "text": "Beautiful place and lots of history. My favourite parts were the kitchen and the dioramas in Sala Joan Mari i Oliva. €5 adult and €3.50 reduced entry (without audio guides)Nice place to go & relax. Cheap admission fee", "publishedDate": "2017-06-29", "language": "en", "rating": 4}, {"id": 495549151, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d2223690-r495549151-Reial_Monestir_de_Santa_Maria_de_Pedralbes-Barcelona_Catalonia.html", "text": "Before you visit check the opening hours. My visit was a little rushed as I arrived an hour before closing and within ten minutes the staff were making preparations for closing. Lights out doors being closed etc. It is still occupied by Poor Clare nuns since 1326.\nIt has a beautiful three storey cloister and an interesting treasure museum. Monks cells are on view as are tombs of previous luminaries including Queen Elisendra who founded the monastery in 1326. I was not able to visit the attached church.", "publishedDate": "2017-06-24", "language": "en", "rating": 5}, {"id": 495457594, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d2223690-r495457594-Reial_Monestir_de_Santa_Maria_de_Pedralbes-Barcelona_Catalonia.html", "text": "There is a long time I've wanted to visit this place but due to the fact it's a little out of the city, I've always postponed the visit. Finally as there was a guided tour in Spanish, I decided to go. Wow, this is an incredible building full of history, pieces of art... An amazing example of Catalan gothic art. It's a former convent which was still in service until the 80's... Unfortunately, the beautiful St. Michael chapel is closed again to restore the beautiful murals. After the guided tour, I rented an audio guide to deepen the visit. The entrance is 5 Euros (and it was including the 1hour guided tour) and the audio guide 1 or 2 Euros. Really worth a visit, especially to escape from the the bustling center. The cloister and the fountain are so charming. The former dormitory is now a huge exhibit room and in terms of architecture Woww !!! what a place.", "publishedDate": "2017-06-23", "language": "en", "rating": 5}, {"id": 493195390, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d2223690-r493195390-Reial_Monestir_de_Santa_Maria_de_Pedralbes-Barcelona_Catalonia.html", "text": "The Real Monasterio de Pedralbes is one of the best examples of Cathalan Gothic Architecture and History. The monastery keeps works of art, such as paintings, sculptures, goldsmiths, and an extensive library that holds documents since 1937. Figuring as a significant element in the history of Barcelona for its numerous works of art, liturgical objects and furniture that the community of the clarises nuns has held since its founding in 1937 and until 1983, when the historic set was opened to the public.", "publishedDate": "2017-06-14", "language": "en", "rating": 4}, {"id": 488300413, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d2223690-r488300413-Reial_Monestir_de_Santa_Maria_de_Pedralbes-Barcelona_Catalonia.html", "text": "This is a little out of the way for most tourists which means it is exceptionally quiet.  There is a wonderful art gallery here with excellent religious art and relics from the monastery's past.  The building itself has a relaxing and meditative atmosphere.  If you're tired of crowds and want to get away for a restful afternoon, this is the place!  The audioguide is recommended.", "publishedDate": "2017-05-27", "language": "en", "rating": 5}, {"id": 482429960, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d2223690-r482429960-Reial_Monestir_de_Santa_Maria_de_Pedralbes-Barcelona_Catalonia.html", "text": "Her indoors passed this on from knowledge passed on by our son who lives down the hill in Les Corts. (gotta love Catalan, The Pig Sties!) Green metro line to Zona Universitaria. Then a bit of a slog on foot. Buses do go past, but are a bit infrequent. Essentially, the building is a former 14c convent, and is so tranquil compared to Av Diagonal nearby.", "publishedDate": "2017-05-07", "language": "en", "rating": 4}, {"id": 482170519, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d2223690-r482170519-Reial_Monestir_de_Santa_Maria_de_Pedralbes-Barcelona_Catalonia.html", "text": "A little bit off the main beaten track (but actually not far from Camp Nou). Pedralbes Monastery is worth a trip if you have exhausted all of Barcelona's other charms. There are some truly outstanding monasteries in Catalonia but sadly this isn't one of them. I would still recommend the trip but take the subway to Zona Universitaria and walk the rest of the way and you can take in Parc de Pedralbes and Palau Reial and the Gaudi buildings of Guell Pavilions with the famous Dragon Gate. As for the monastery it's very peaceful and only 5 Euros entrance fee and the cloisters are quite impressive but don't expect something like Poblet or Montserrat.", "publishedDate": "2017-05-06", "language": "en", "rating": 3}, {"id": 481625992, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d2223690-r481625992-Reial_Monestir_de_Santa_Maria_de_Pedralbes-Barcelona_Catalonia.html", "text": "An interesting medieval monastery located away from the main sights. It is easily reached by the tourist buses.\nThere is a very interesting chapel painted with medieval drawings.\nI'm not sure it's worth the trip if you do not use the tourist bus because it's far away.", "publishedDate": "2017-05-04", "language": "en", "rating": 4}, {"id": 475480060, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d2223690-r475480060-Reial_Monestir_de_Santa_Maria_de_Pedralbes-Barcelona_Catalonia.html", "text": "We loved this place, away from the crowds and very beautiful. The cloister and gardens are well-kept. It has an excellent collection of artifacts and paintings in the restored main hall. The Chapel of Sant Miguel (Saint Michael) is a minor masterpiece well worth a visit. It's on a hill in the suburbs, so you need to use the underground trains to go to the station called Reina Elisanda and then it's only a short walk from there.", "publishedDate": "2017-04-14", "language": "en", "rating": 5}, {"id": 475447124, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d2223690-r475447124-Reial_Monestir_de_Santa_Maria_de_Pedralbes-Barcelona_Catalonia.html", "text": "If you want to spend a couple of hour in a spiritual visit, it's a good morning plan (in a sunny day it's perfect)", "publishedDate": "2017-04-13", "language": "en", "rating": 4}, {"id": 473817841, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d2223690-r473817841-Reial_Monestir_de_Santa_Maria_de_Pedralbes-Barcelona_Catalonia.html", "text": "It is a pity that one has to pay to access this lovely monastery, but it goes to a good cause - do not be put off by the small fee. This is an incredible space, I was lucky enough to have a guided tour through it, and enjoyed every moment of it. Although the cloister is probably my favourite area. ", "publishedDate": "2017-04-09", "language": "en", "rating": 4}, {"id": 471925717, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d2223690-r471925717-Reial_Monestir_de_Santa_Maria_de_Pedralbes-Barcelona_Catalonia.html", "text": "I was there with a group and we all loved it. Beautiful medieval arquitecture, huge cloister and quait area. You could not hear any noise but the birds!", "publishedDate": "2017-04-01", "language": "en", "rating": 5}, {"id": 468484431, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d2223690-r468484431-Reial_Monestir_de_Santa_Maria_de_Pedralbes-Barcelona_Catalonia.html", "text": "Peaceful, beautiful and with a uniquely rich history of the women of Barcelona.  Well worth an hour or two of anyone's time.", "publishedDate": "2017-03-19", "language": "en", "rating": 5}, {"id": 463217018, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d2223690-r463217018-Reial_Monestir_de_Santa_Maria_de_Pedralbes-Barcelona_Catalonia.html", "text": "Not popular, but very interesting monastery, nice piece of architecture with arches. It's little further away from the city centre, but for history lovers and people who know the \"popular\" sights, its worth to see!", "publishedDate": "2017-02-27", "language": "en", "rating": 4}, {"id": 461183318, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d2223690-r461183318-Reial_Monestir_de_Santa_Maria_de_Pedralbes-Barcelona_Catalonia.html", "text": "If you like art and architecture, then this is a must! It is a bit outside of the tourist radar, so you'll see none of the crowds that flood to the city center. The cloister is simply beautiful, and the monastery also.hosts a nice art collection. Be sure to.visit on sunday starting from 3 PM: it's free.", "publishedDate": "2017-02-19", "language": "en", "rating": 5}, {"id": 460208028, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d2223690-r460208028-Reial_Monestir_de_Santa_Maria_de_Pedralbes-Barcelona_Catalonia.html", "text": "unconvinience its a bit far from the classic touring downtown , but if staying for a few days it's worth to see the art collection and the building itself, Great fresco from Bassa our catalan Giotto ", "publishedDate": "2017-02-15", "language": "en", "rating": 5}, {"id": 459231542, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d2223690-r459231542-Reial_Monestir_de_Santa_Maria_de_Pedralbes-Barcelona_Catalonia.html", "text": "The Monastery is a bit out of the city center, but still easy to reach by underground or hop-on hop-off bus. The Monastery is a peaceful place, worth while to visit and to get a different view of Barcelona away from the hordes of tourists.", "publishedDate": "2017-02-13", "language": "en", "rating": 5}, {"id": 456933023, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d2223690-r456933023-Reial_Monestir_de_Santa_Maria_de_Pedralbes-Barcelona_Catalonia.html", "text": "Beautiful in a word. Take the audio tour and you won't be disappointed. Such a peaceful and spiritual place.", "publishedDate": "2017-02-03", "language": "en", "rating": 5}, {"id": 456679823, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d2223690-r456679823-Reial_Monestir_de_Santa_Maria_de_Pedralbes-Barcelona_Catalonia.html", "text": "Went there 2/1/17 and they were closed --I think the hours are 10-2 during the winter and longer on weekends. (Double check this information and they change seasonally) . Stellar idea: You could jump off the blue or red sit on top buses and first visit the lovely neighborhood called Sarra that is the stop before it on both buses. (I loved the blue bus touristic!!) Wander the neighbor of Sarra and eat some of their famous sweets and see their great free church on the main square. From there could take a local bus if you like down to the monastery. I bought the five day transportation pass and it is been great. Get shorter term passes too. From the monastery It is a short walk from there to the Palau Reial and Royal Gardens downhill (check hours on it too!) . You can catch the next blue to his bus at the Diagnol/ Les Cortes stop. You never answered the phone and I couldn't find out the hours of operation easily on the Internet. Someone knows them, it would be good to add it to the trip advisor information.", "publishedDate": "2017-02-02", "language": "en", "rating": 3}, {"id": 445519982, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d2223690-r445519982-Reial_Monestir_de_Santa_Maria_de_Pedralbes-Barcelona_Catalonia.html", "text": "An interesting and relaxing visit, slightly outside of Barcelona city centre but easy to get to.  \n\nThe exhibits were interesting but the text is all in Spanish (English language audio is available, along with many other languages) and the gardens are particularly lovely.", "publishedDate": "2016-12-19", "language": "en", "rating": 4}, {"id": 438669704, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d2223690-r438669704-Reial_Monestir_de_Santa_Maria_de_Pedralbes-Barcelona_Catalonia.html", "text": "A short ride on the metro brings you to the Monestir, a welcome break from the busy city. We visited on a Sunday and it was not overcrowded. The cloister gardens were serene and the art works beautiful. Also interesting was the convent living quarters of centuries past. However, the murals from the 1300s awaiting restoration, but still with gloriously bright colours, really were wonderful. This Monestir is only a short walk from the station a little uphill but nothing at all strenuous. Do not miss this place if you need a quiet moment to reflect on beauty.", "publishedDate": "2016-11-19", "language": "en", "rating": 5}, {"id": 438563554, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d2223690-r438563554-Reial_Monestir_de_Santa_Maria_de_Pedralbes-Barcelona_Catalonia.html", "text": "We went here with a friend who lives locally. It is on the edge of the city and easily accessible by taking the metro to Palau Reial and walking up Av. Pedralbes through an upmarket residential area. The monastery is as peaceful escape from the busy city, and within it there are some excellent exhibitions covering the history of the monastery from its foundation until the present.", "publishedDate": "2016-11-19", "language": "en", "rating": 5}, {"id": 435849074, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d2223690-r435849074-Reial_Monestir_de_Santa_Maria_de_Pedralbes-Barcelona_Catalonia.html", "text": "We needed a quiet outing after being in the city for a few days and the monastery was a perfect destination. There weren't many tourists and the monastery was very pretty. A few rooms were under restoration when we went, so weren't accessible to the public. Also there was a historical exhibit only in Spanish which would have been nice to have English translations. Overall very nice visit.", "publishedDate": "2016-11-09", "language": "en", "rating": 4}, {"id": 434453602, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d2223690-r434453602-Reial_Monestir_de_Santa_Maria_de_Pedralbes-Barcelona_Catalonia.html", "text": "We decided to stop at the monastery when we took the Bus Turistoco Tour. The bus stops right at the corner of the street leading to the monastery. The grounds are breathtaking and the quietness was much appreciated after a day of sightseeing. The history is fascinating and you are allowed to take pictures and visit at your own pace. The area around the monastery is beautiful and there are some nice places to stop and eat in the Sarria district. It is also a safe area of the city.", "publishedDate": "2016-11-03", "language": "en", "rating": 5}, {"id": 432243228, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d2223690-r432243228-Reial_Monestir_de_Santa_Maria_de_Pedralbes-Barcelona_Catalonia.html", "text": "Such nice and peaceful place to visit. and it's easy to reach by bus. Entry price is very reasonable. It's worth to have audio guide. ", "publishedDate": "2016-10-27", "language": "en", "rating": 4}, {"id": 430727637, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d2223690-r430727637-Reial_Monestir_de_Santa_Maria_de_Pedralbes-Barcelona_Catalonia.html", "text": "I had read about this monastery a bit and was very curious about it. With very limited time, I had to choose between this sight and a couple others in Barcelona. I definitely chose right. \n\nIt is a ride from the metro and then a bit of a walk, but it certainly worth it. very well preserved and very well illustrated and guided via the earphones, this monastery has definitely a WOW factor! The central courtyard is an oasis with fragrant flowers, fruits, and lovely places to sit and reflect. \n\nThe cost of the ticket included ear phones and also included entrance to other sights in Barcelona, good deal.  \n\nBarcelona is NOT by far my favorite city, but this place remains a great and welcome surprise.", "publishedDate": "2016-10-22", "language": "en", "rating": 4}, {"id": 428524166, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d2223690-r428524166-Reial_Monestir_de_Santa_Maria_de_Pedralbes-Barcelona_Catalonia.html", "text": "This was a wonderful and unexpected sight in the suburbs of Barcelona.  We took the metro and got off at Palau Reall and walked uphill about 20 minutes.  The signs were easy to spot.  The Monasterio was a convent founded by Queen Reina Elisenda for Clarist nuns in 1326.  Inside the Monasterio (which in Spanish could mean a monastery or a convent), it was quiet and serene.  The place is beautifully preserved, and the exhibits are very well done with explanations in multiple languages.  Be sure to pay the extra 0.6 euro for the head-phones - as they will really add to your understanding and significance of the Monasterio.  The frescoes are nicely preserved.  The gardens are well-kept and inviting.  The place was not crowded - even on a Sunday.  A hidden gem not to be missed.", "publishedDate": "2016-10-16", "language": "en", "rating": 5}, {"id": 425738894, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d2223690-r425738894-Reial_Monestir_de_Santa_Maria_de_Pedralbes-Barcelona_Catalonia.html", "text": "Even though it's a bit out of the way, this monastery is definitely worth a visit. The cloisters are gorgeous, as is the exhibition of the monastery's art collection upstairs. There is lots of information, with cards with English translations of the Catalan/Spanish exhibits. Even in June, when attractions like the Sagrada Familia are packed, the monastery is quiet. It's a beautiful place to go on a sunny Barcelona day!", "publishedDate": "2016-10-06", "language": "en", "rating": 5}, {"id": 422300136, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d2223690-r422300136-Reial_Monestir_de_Santa_Maria_de_Pedralbes-Barcelona_Catalonia.html", "text": "This building is a little out of the central area of Barcelona but can be accessed quite easily by taxi, city bus or tourist bus.\nIn Spanish the word \"monastir\" applies to both monasteries and convents and this building was founded as a convent for royal and noble ladies who were unmarried or widowed.\nThe order of nuns still exists but since 1983 the nuns live nearby in a modern convent and the original building is a monument.\nIt has a beautiful cloister with a well kept garden, small chapels adjoining the cloister, a  kitchen, refectory and meeting room that can be visited freely. The audio tour explains the history and use of the various parts of the building and is well worth the small extra cost.", "publishedDate": "2016-09-25", "language": "en", "rating": 4}, {"id": 421805025, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d2223690-r421805025-Reial_Monestir_de_Santa_Maria_de_Pedralbes-Barcelona_Catalonia.html", "text": "Despite the name this was actually a former convent of the Poor Clares.  It was founded by a former Queen where she could retire to, possibly to avoid be used as a marriage pawn.  She did not stay in the convent itself but in a palace alongside it, which she ordered demolished on her death.  No nuns could thereby benefit or be corrupted from using the palace.  \n\nThe main attraction is the frescoes in the St. Michael Chapel.  These are extremely well done but show some damage from their 600 years.  Also of interest is the former dormitory now used for displaying the remaining treasures of the convent.  Some of the sculptures and ecclesiastical objects are quite good.  The paintings are of lesser quality, some of them third hand versions of Flemish works.  \n\nThe cloister and refectory are also worth seeing.\n\nGetting there:  This lies outside of the centre of Barcelona.  There are bus links and metro.  For the metro take the L6 to Sarria, then switch to the L12 to Reina Elsinada (the only station on this line).  When you leave the station take a left.  On the intersection take a left onto Carrer de Monestir.  Follow this road and the convent will be at the end of it.", "publishedDate": "2016-09-24", "language": "en", "rating": 3}, {"id": 421725494, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d2223690-r421725494-Reial_Monestir_de_Santa_Maria_de_Pedralbes-Barcelona_Catalonia.html", "text": "The upper floors seem unchanged from the medieval period. The atmosphere in the cloister is lovely. I was not expecting such a well preserved site.", "publishedDate": "2016-09-24", "language": "en", "rating": 5}, {"id": 419094939, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d2223690-r419094939-Reial_Monestir_de_Santa_Maria_de_Pedralbes-Barcelona_Catalonia.html", "text": "This is so well set out-there is plenty to see in a  peacefull setting.A very well put together attraction.", "publishedDate": "2016-09-16", "language": "en", "rating": 5}, {"id": 419067305, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d2223690-r419067305-Reial_Monestir_de_Santa_Maria_de_Pedralbes-Barcelona_Catalonia.html", "text": "It was a peaceful runaway from all the buzz of the city and overcrowded tourist attractions with beautiful architecture and a cozy garden. \n\nTake a note that in summer scheduling the entrance is free from 15:00.\n\nAs a point of improvement - more English translations for the exposition as for non-Spanish/Catalan speakers it might be tricky to understand the history of the monastery without buying audio guide.", "publishedDate": "2016-09-16", "language": "en", "rating": 5}, {"id": 415166014, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d2223690-r415166014-Reial_Monestir_de_Santa_Maria_de_Pedralbes-Barcelona_Catalonia.html", "text": "This was one of the highlights of our week.   We took the cable car to the monastery, the funicular to the top and then hiked all the way up.  The view is incredible as there is no other mountain nearby that is anywhere near as high.  Really fun day and the food in the buffet was surprisingly good", "publishedDate": "2016-09-05", "language": "en", "rating": 5}, {"id": 411297601, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d2223690-r411297601-Reial_Monestir_de_Santa_Maria_de_Pedralbes-Barcelona_Catalonia.html", "text": "This is one of the high point of my two weeks in Barcelona. If you like old rocks, quiet place and cloisters, you should come here. It's a little out of the way but it is worth the detour. So peaceful and beautiful.", "publishedDate": "2016-08-27", "language": "en", "rating": 5}, {"id": 411049569, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d2223690-r411049569-Reial_Monestir_de_Santa_Maria_de_Pedralbes-Barcelona_Catalonia.html", "text": "A bit of a truck off the tourist beat unless one is using the obsequious hop on hop off bus. A truck by metro and an up hill track in hot sunshine got us there finally. The main entrance is not well marked and is through a narrowish entrance then up a lane and finally into the monestir . They have clean washrooms and a small area with lockers so that one does not have to lug you packs with you. They also have vending machines where you can get an ice cold auga for 0.40 EUR, a bargain at any tourist site. We visited mid day on a Wednesday and practically had the place to ourselves. It is an amazing break from the modern Hussle of the city and tranquility at its finest. Do not miss the treasure room , in the re done dormitories . Ultra modern, air conditioned, to protect the antiques. The fact that many tourists miss this gem is their great loss. This should be on everyone's must see list. Admission was a very reasonable around 5 EUR and there are audio headsets available to tell you the history. Though we just went with the tranquility of the complex.", "publishedDate": "2016-08-26", "language": "en", "rating": 5}, {"id": 409635922, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d2223690-r409635922-Reial_Monestir_de_Santa_Maria_de_Pedralbes-Barcelona_Catalonia.html", "text": "Take a bus from Plaça Catalunya and travel through the city, up the mountain, to this gem of Barcelona´s Gothic architecture. It is a fascinating place, with much to offer --gorgeous paintings, beautiful trees and plants, interesting insights into medicinal plants and monastic life. Not a bad idea to walk downhill back into town through some of the more affluent neighbourhoods of the city.", "publishedDate": "2016-08-23", "language": "en", "rating": 5}, {"id": 407598804, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d2223690-r407598804-Reial_Monestir_de_Santa_Maria_de_Pedralbes-Barcelona_Catalonia.html", "text": "I've been here twice now and can never understand why everyone else does not go there too! \nIt's a bit of a walk after the metro station, but nothing demanding and it's in a nice location. \nThe monastery is charming and beautiful. I'd go again because it's simply a lovely place to spend time. ", "publishedDate": "2016-08-19", "language": "en", "rating": 5}, {"id": 405483625, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d2223690-r405483625-Reial_Monestir_de_Santa_Maria_de_Pedralbes-Barcelona_Catalonia.html", "text": "The place is quite and nice as a break from other activities, we did a hop on/off bus that dropped us very close to the entrance.  From the looks of things, they need a bit more funding as a number of exhibits were needed some TLC.  Also, there is a fountain and pond outside but the fountain had bees living in it so we had to steer clear of that area of the yard.  With the moss and fungus growing on it, no one had really looked to try to clean it up in some time.", "publishedDate": "2016-08-14", "language": "en", "rating": 3}, {"id": 404572056, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d2223690-r404572056-Reial_Monestir_de_Santa_Maria_de_Pedralbes-Barcelona_Catalonia.html", "text": "Once a year we visit this monastry, it has nice surroundings, some exibitions inside and a nice small botanical garden. Simple, quiet and peaceful. Sunday afternoon is free, as well as the fisrt Sunday morning of the month.", "publishedDate": "2016-08-12", "language": "en", "rating": 4}, {"id": 402622734, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d2223690-r402622734-Reial_Monestir_de_Santa_Maria_de_Pedralbes-Barcelona_Catalonia.html", "text": "I made my way to the monastery by the big bus. Was very interested in visiting mainly duebto its history dating back to the 1200's. Being from Australia we have no architecture close to this age! Beautiful inside & tranquil gardens in courtyard. I found the kitchen the nuns used very interesting. Well worth a visit", "publishedDate": "2016-08-07", "language": "en", "rating": 4}, {"id": 401777690, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d2223690-r401777690-Reial_Monestir_de_Santa_Maria_de_Pedralbes-Barcelona_Catalonia.html", "text": "As a history lover, this was a great stop on my motorbike tour. I love to see how people lived, more or less, in the past centuries. It has a nice quiet inner garden. It is worth the visit.", "publishedDate": "2016-08-05", "language": "en", "rating": 5}, {"id": 397226162, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d2223690-r397226162-Reial_Monestir_de_Santa_Maria_de_Pedralbes-Barcelona_Catalonia.html", "text": "First of all, don't go there if you're short on time as it's not near the center.\n\nI had Barcelona Card but totally missed that I could go inside freely. I didn't even paid attention to the attraction's entrance. So if you have the card go inside.\n\nAs for the outside, the monastery is big and beautiful, and one can take some pictures at the garden in front of it.", "publishedDate": "2016-07-26", "language": "en", "rating": 4}, {"id": 395814034, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d2223690-r395814034-Reial_Monestir_de_Santa_Maria_de_Pedralbes-Barcelona_Catalonia.html", "text": "Reial Monestir de Santa Maria de Pedralbes is a huge gothic monastery complex dating back to the 1300’s. Visiting does require a little effort, as it is in the north of city near the university area. From the area of Las Ramblas, we took the metro to the Maria Cristina station and then took a taxi up the hill to the monastery. \n\nThe small entrance fee provides you access to the entire grounds; which include the amazing three-level cloisters, the Chapel of St. Michael and a small museum. The museum is modern and well done with paintings and religious relics from the monastery’s collection. The chapel was interesting and beautiful, but lacked the grandeur of the cathedrals in Barri Gòtic. The highlight of the visit is the amazing cloisters, surrounding a central courtyard of orange trees. The atmosphere leaves you with a sense of serenity when you visit.  \n\nIf you have several days in Barcelona, it is definitely worth a few hours excursion to visit.", "publishedDate": "2016-07-23", "language": "en", "rating": 4}, {"id": 391463078, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d2223690-r391463078-Reial_Monestir_de_Santa_Maria_de_Pedralbes-Barcelona_Catalonia.html", "text": "stopped off the bus and we decided to have a look,\nbargain price 5.00 euro's each  and it was a great place to visit and well worth the money.", "publishedDate": "2016-07-11", "language": "en", "rating": 5}, {"id": 383603948, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d2223690-r383603948-Reial_Monestir_de_Santa_Maria_de_Pedralbes-Barcelona_Catalonia.html", "text": "Just off a busy road there is a medieval gate to one of the quietest attractions in Barcelona. It is easilty accessible by bus of by ferrocarril (Reina Elisenda). The admission fee is very reasonable and it comes with an audioguide. However, if travelling with children or teenagers I highly recommend reading about the place before the visit, and run a self-guided tour. That will save you time and they will be more likely to engage with the visit.", "publishedDate": "2016-06-18", "language": "en", "rating": 5}, {"id": 372851108, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d2223690-r372851108-Reial_Monestir_de_Santa_Maria_de_Pedralbes-Barcelona_Catalonia.html", "text": "Visiting the monastery was not on my agenda because it's a bit far from city center. however since I was already nearby at the Cervantes park I decided to give it a try. \nThe monastery is not very large. It has this wonderful serenity feel. \nAn interesting collection of treasures is on display which brings to life the history and life in this place. ", "publishedDate": "2016-05-14", "language": "en", "rating": 4}, {"id": 348779241, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d2223690-r348779241-Reial_Monestir_de_Santa_Maria_de_Pedralbes-Barcelona_Catalonia.html", "text": "After all the hustle and bustle of central Barcelona it was a joy to come out here and wander round in peaceful surroundings. It's very interesting to see the monks' cells and the old frescoes.", "publishedDate": "2016-02-18", "language": "en", "rating": 5}, {"id": 340919073, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d2223690-r340919073-Reial_Monestir_de_Santa_Maria_de_Pedralbes-Barcelona_Catalonia.html", "text": "Is a beautiful place, quiet and peaceful. Even if is a little far from the center, definitely worth to go. Also have a little art collection", "publishedDate": "2016-01-18", "language": "en", "rating": 5}, {"id": 328159146, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d2223690-r328159146-Reial_Monestir_de_Santa_Maria_de_Pedralbes-Barcelona_Catalonia.html", "text": "So what was  going in Catalonia during the early  Renaissance?  \nYou can visit this monastery in order  to get a glimpse.  This beautiful cloister well on the side of the over-beaten Barcelonian tourist track  might re-charge your spirit.  The temporary  exhibitions are also surprising  (i.e.  the  expulsion of the nuns  throughout Catalan monasteries during the civil war), unique and worthwhile.", "publishedDate": "2015-11-21", "language": "en", "rating": 4}, {"id": 326772575, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d2223690-r326772575-Reial_Monestir_de_Santa_Maria_de_Pedralbes-Barcelona_Catalonia.html", "text": "a must visit place in Barcelona. nice expositions and lovely building visit. you can go back in the history learning about the ancient BCN", "publishedDate": "2015-11-14", "language": "en", "rating": 5}, {"id": 323686276, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d2223690-r323686276-Reial_Monestir_de_Santa_Maria_de_Pedralbes-Barcelona_Catalonia.html", "text": "Used the tourist bus and arrived just after 3 when its free to enter on a Sunday. After all the crowds and noise this place is lovely just to walk, take your time and relax. Beautiful architecture, plenty of history and a real sense of calmness. ", "publishedDate": "2015-11-01", "language": "en", "rating": 5}, {"id": 320965349, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d2223690-r320965349-Reial_Monestir_de_Santa_Maria_de_Pedralbes-Barcelona_Catalonia.html", "text": "Monastery of Padralbes, was founded by King James II of Aragon for his wife Elisenda de Montcada in 1326.\nOne of the finest examples of Catalan Gothic Art. The monastery is build around a three storey cloister, with a central garden of orange trees and palms. There is still a small community of nuns still live there.\nThe location is in the uptown district, away from the hustle and bustle of the city. It's on the blue route of the tourist bus.\nWe enjoyed our visit.\nThe entry cost was 5 euro.", "publishedDate": "2015-10-22", "language": "en", "rating": 4}, {"id": 318560044, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d2223690-r318560044-Reial_Monestir_de_Santa_Maria_de_Pedralbes-Barcelona_Catalonia.html", "text": "Free admission on the day we visited so a few tourists but not busy. Easy to get to on the Metro or Tourist Bus.  Nice to wander round for an hour or so. I didn't notice any cafés nearby. Beautiful place if you have time, but not a ' must see' if time is limited", "publishedDate": "2015-10-14", "language": "en", "rating": 4}, {"id": 316634906, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d2223690-r316634906-Reial_Monestir_de_Santa_Maria_de_Pedralbes-Barcelona_Catalonia.html", "text": "This is a stop on the Bus Turistic well out of the centre but worth getting off for (there is also a Gaudi site at the next stop so you could make a morning of it and stop for some coffee before plunging into the centre).\nRather austere but attractive style which predates gothic. Founded by a queen, it was well endowed initially and has a fine treasury. There is a spectacular frescoed little chapel as you go in which is almost overwhelming and echoes the Scrivini in Padua. The highlights are the little chapel and an exhibit about the frescoes, and the treasury/museum. The church is pretty but nothing special. We were in a hurry and so missed the other displays that looked worthwhile. Some lovely old carvings over the windows and doors of a building opposite the entrance.", "publishedDate": "2015-10-06", "language": "en", "rating": 4}, {"id": 309463059, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d2223690-r309463059-Reial_Monestir_de_Santa_Maria_de_Pedralbes-Barcelona_Catalonia.html", "text": "A few blocks from the U.S. Consulate and the Reina Eislenda Metro stop this place is a gem of mideval architecture and art. Beautiful cloister garden and lovely chapel. Very quiet and serene. Few tourists hence a welcome contrast to the circus around the Sagrada Familia.", "publishedDate": "2015-09-12", "language": "en", "rating": 5}, {"id": 306631391, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d2223690-r306631391-Reial_Monestir_de_Santa_Maria_de_Pedralbes-Barcelona_Catalonia.html", "text": "Cost 5€. Worth it. Very old monastery with peaceful atmosphere and some interesting exhibition. Also the area around it's really nice. ", "publishedDate": "2015-09-03", "language": "en", "rating": 5}]}}]