[{"locationId": 10600103, "name": "Casa Golferichs", "placeType": "ATTRACTION", "reviewListPage": {"reviews": [{"id": 690181578, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d10600103-r690181578-Casa_Golferichs-Barcelona_Catalonia.html", "text": "Casa Golferichs is a quirky mansion on Gran Via de les Corts Catalanes, close Rocafort metro station, and just opposite Tono Bagno design store. Although I’m told that it’s a Modernista building, I actually think it’s close to Neo-Gothic with it long strait lines, ribbed windows frames and mock medieval bay windows. True, there are the characteristic sumptuous ceramic tiles on the roofs of the arched entrance and house. It still looks like something like a building out of the middle ages, which I suppose is part of it’s charm.\n\nIf you have a love of Modernism or have time, then this is worth a look. Otherwise, there are plenty of buildings Modernism that are truly monumental and must-see in Barcelona.\n\nNote: I only realised afterwards that this building was in fact also a museum with a mix of permanent and changing exhibitions and I only saw this building from the outside.", "publishedDate": "2019-07-16", "language": "en", "rating": 4}, {"id": 672771235, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d10600103-r672771235-Casa_Golferichs-Barcelona_Catalonia.html", "text": "This house of Catalan Modernism can be found from the main street Gran Via de les Corts Catalanes. It was built in 1901. At the moment it is a civic center of the Eixample District.", "publishedDate": "2019-05-09", "language": "en", "rating": 4}, {"id": 589619701, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d10600103-r589619701-Casa_Golferichs-Barcelona_Catalonia.html", "text": "We went out for our daily 6 k walk and just around the corner from our hotel we came across this amazing building.It was built in 1901 and was the family home of the Barcelona civil engineer until the spanish war It then became a university Then a religious school .Since 1989 it has been a civic centre  and a childrens play centre .We walked past it again in the afternoon and by the noise coming from inside from the children it seems to be a very happy place.An absolutely beautiful building.Dont miss it.", "publishedDate": "2018-06-21", "language": "en", "rating": 5}, {"id": 528087055, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d10600103-r528087055-Casa_Golferichs-Barcelona_Catalonia.html", "text": "The most beautifful building I ever seen. For sure, is one of the place one must visit when in the great city of Barcelona. \nGo and see it you will not be disappointed.", "publishedDate": "2017-09-28", "language": "en", "rating": 5}]}}]