[{"locationId": 17750898, "name": "Gallery Ex Machina", "placeType": "ATTRACTION", "reviewListPage": {"reviews": [{"id": 704866097, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d17750898-r704866097-Gallery_Ex_Machina-Barcelona_Catalonia.html", "text": "This gallery has really unique items mostly related to human-technology interactions. You have to see this place before leave Barcelona!", "publishedDate": "2019-08-31", "language": "en", "rating": 5}, {"id": 692264576, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d17750898-r692264576-Gallery_Ex_Machina-Barcelona_Catalonia.html", "text": "I was a bit doubtful, as usual, when my significant other \"forced\" me to go visit yet another museum during our trip to Spain.\nHow wrong was I. The gallery was facinating, the explainations riveting, and for once, time flew by ! I didn't think art and technologies could work so well together.\nI highly recommend it if you're bored of art galleries where everything seems to always be the same (\"Look, a dude from 300 years ago painted another half naked dude in drapes...\", or even worse, contemporary art \"But it's just... blue. Like a monochrome blue painting ? My kitchen walls are exactly the same. How come nobody pays to see my kitchen\").", "publishedDate": "2019-07-24", "language": "en", "rating": 5}, {"id": 692153623, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d17750898-r692153623-Gallery_Ex_Machina-Barcelona_Catalonia.html", "text": "I loved this gallery! It was really interesting seeing the link between men and machines trough the vision of 3 different artists. The interior of the gallery is really nice too! The mix of old stones and old metalic mechanics gives a real cyberpunk feeling! Don't forget to take a selfie with Michael the lightened robot!", "publishedDate": "2019-07-23", "language": "en", "rating": 5}, {"id": 692151007, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d17750898-r692151007-Gallery_Ex_Machina-Barcelona_Catalonia.html", "text": "This is an amazing art gallery. You can spend two or three hours just looking at all the items on display. Great!", "publishedDate": "2019-07-23", "language": "en", "rating": 5}, {"id": 691945828, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d17750898-r691945828-Gallery_Ex_Machina-Barcelona_Catalonia.html", "text": "Before all, I love the location. Barri Gotic is where you can let yourself meander when you are in Barcelona. It has a magic on its own. This gallery is like a jewel, hidden in that historical urban texture. The concept of the Gallery Ex Machina begins already with the style of restoration of the gallery. Very interesting for the ones who have an eye for 'creating spaces'. The free entrance to the gallery allows one to leave the narrow streets of Barri Gotic and step into the hidden, private part of this city. As it is often the case in this amazing city, again with the help of art. Steam Punk is quite new field for me, I guess I will pass by every time I am in Gotic, to get to know this culture better.", "publishedDate": "2019-07-23", "language": "en", "rating": 5}, {"id": 691759197, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d17750898-r691759197-Gallery_Ex_Machina-Barcelona_Catalonia.html", "text": "Good to see that the level is high. Good selection and good place. Can’t wait to see the next exhibition!", "publishedDate": "2019-07-22", "language": "en", "rating": 5}, {"id": 691658450, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d17750898-r691658450-Gallery_Ex_Machina-Barcelona_Catalonia.html", "text": "We found this place while wandering around Barri gotic. The gallery has free entrance. It has some cool steampunk pieces inside. We had never been in a place with cyberpunk-steampunk concept.", "publishedDate": "2019-07-22", "language": "en", "rating": 5}, {"id": 691530527, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d17750898-r691530527-Gallery_Ex_Machina-Barcelona_Catalonia.html", "text": "First time been in a Steampunk Gallery, If you have plenty of time you should definitely visit. Staff is welcoming.", "publishedDate": "2019-07-21", "language": "en", "rating": 5}]}}]