[{"locationId": 244202, "name": "Fundacio Antoni Tapies", "placeType": "ATTRACTION", "reviewListPage": {"reviews": [{"id": 538101916, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d244202-r538101916-Fundacio_Antoni_Tapies-Barcelona_Catalonia.html", "text": "Without knowing what to expect, I was captivated by the work on display. Unfamiliar with Tapies, I found his work (described here as “objects”) powerful, cerebral, aggressively and confidently executed. I would have liked to see much more of his work. Desperate for more, I bought a big heavy book filled with images. There was also featured a very moving display of the photography work of Susan Meiselas. The combination of the two exhibits was thoroughly satisfying. Plus the Tapies sculpture on the roof is exhilarating.", "publishedDate": "2017-11-03", "language": "en", "rating": 5}, {"id": 535452445, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d244202-r535452445-Fundacio_Antoni_Tapies-Barcelona_Catalonia.html", "text": ". . . . but the roof of the building is spectacular-- absolutely worth looking up at--swirling metal, unconventional art that sweeps across the roof and into the sky.", "publishedDate": "2017-10-23", "language": "en", "rating": 3}, {"id": 523634371, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d244202-r523634371-Fundacio_Antoni_Tapies-Barcelona_Catalonia.html", "text": "The exterior design is striking, so we were intrigued to see what is inside.  Unfortunately it's a lot of installation art that is not very inspiring and not in great displays.  Boring and left me cold.  We did not stay for long.", "publishedDate": "2017-09-11", "language": "en", "rating": 3}, {"id": 512834238, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d244202-r512834238-Fundacio_Antoni_Tapies-Barcelona_Catalonia.html", "text": "This has a tiny collection of Tapies objects, I was surprised it was called the Fundacio Antoni Tapies, I would have liked more Tapies! I think there was probably less than 20 of of his conceptual art pieces in the basement, spread over two rooms - I don't think the second floor was open, we weren't really given much information when we arrived. The rest of the space was for temporary exhibitions, on this occasion one about the sea, which was fairly interesting. We ended up visiting as it was a few buildings away from our hotel and also included as part of the Barcelona art card, which has 5 other (much better) museums included in the ticket. Not a waste of time but not the most thrilling attraction.", "publishedDate": "2017-08-14", "language": "en", "rating": 2}, {"id": 496750394, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d244202-r496750394-Fundacio_Antoni_Tapies-Barcelona_Catalonia.html", "text": "What a big disappointment!\nTapies being one of the greatest Catalan international artist and his own Foundation doesn't honour him.\nA great building with a great space to hold exhibitions but some how the current one didn't impress me at all. Got the feeling they don't have a good eye to choose the right ones.\nCome on guys, it could be a great space to attract the best of the world!! At least try with our contemporary ones, known or unknown, would be sooooo much more interesting.\nAnd so conveniently located, by the SUPERB Paseo de Gracia!!\nSorry curators, do you need help? I can certainly help you.\nA tiny part on the basement only dedicated to Tapies.", "publishedDate": "2017-06-28", "language": "en", "rating": 2}, {"id": 490468417, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d244202-r490468417-Fundacio_Antoni_Tapies-Barcelona_Catalonia.html", "text": "Seen it I was 2015. Definitely worth going there. Tapies was local artist and you can have great opportunity to see it here. Good luck place if you are in Barcelona or 2nd or 3rd time. ", "publishedDate": "2017-06-04", "language": "en", "rating": 5}, {"id": 482457646, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d244202-r482457646-Fundacio_Antoni_Tapies-Barcelona_Catalonia.html", "text": "This was the worst museum we have ever visited in Europe and we've been to many. One of the exhibits was two floors of postcards glued to the walls. That's it! On the third floor there was an exhibit of household junk stacked together. We spent about 15 minutes in the museum. Thank goodness they had toilets or it would have been a total waste of time.", "publishedDate": "2017-05-07", "language": "en", "rating": 1}, {"id": 480749251, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d244202-r480749251-Fundacio_Antoni_Tapies-Barcelona_Catalonia.html", "text": "A somewhat interesting space, with the Tapies pieces being in the basement and on the second floor and a temporary exhibit on the main floor. Found the temporary exhibit somewhat meh, but liked the Tapies pieces, just wish there were more of them. Want to offer a kudo for the write-ups on the Tapies art, they were excellent.\n\nSince I had an Articket and was staying nearby, it was a worthwhile 30 minute visit for me, but not sure if that would be the case for someone who does not match those two conditions.", "publishedDate": "2017-05-01", "language": "en", "rating": 3}, {"id": 473325158, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d244202-r473325158-Fundacio_Antoni_Tapies-Barcelona_Catalonia.html", "text": "Should be free entrance for what it offers.\nWith so many thing to see and do in Barcelona,  don't waste your time and money visiting this.", "publishedDate": "2017-04-07", "language": "en", "rating": 1}, {"id": 460696483, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d244202-r460696483-Fundacio_Antoni_Tapies-Barcelona_Catalonia.html", "text": "I have long been an ardent admirer of Tapies and was so looking forward to seeing some of his work.  I have to echo a previous review.....this was a disappointment putting it mildly.  The temporary exhibit was forgettable - lots of flea market postcards by another artist and only a few prints of tapies' work....definitely check before going.", "publishedDate": "2017-02-17", "language": "en", "rating": 1}, {"id": 433297865, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d244202-r433297865-Fundacio_Antoni_Tapies-Barcelona_Catalonia.html", "text": "Of all the artists and architects celebrated in Barcelona, Tapies is one of my favorites. I was so looking forward to seeing his work in person after admiring it in books for years. What a disappointment to be told there was no temporary exhibition on the lower floor, nor any sign of his personal collection of other famous artists' work as described in most tourist publications and then to go upstairs and find so few of his own works on display. I don't even know why they bothered to open. I had paid for my entrance on the ArtTicket Passport program but if anyone paid for an individual admission at the desk they should surely have asked for their money back. Now that I think of it I feel the same way.\nThis truly was the low point of my Barcelona visit.", "publishedDate": "2016-10-31", "language": "en", "rating": 1}, {"id": 432442717, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d244202-r432442717-Fundacio_Antoni_Tapies-Barcelona_Catalonia.html", "text": "Antoni Tapies was a radical twentieth century artist. The lovely space is devoted to art and art education.", "publishedDate": "2016-10-28", "language": "en", "rating": 5}, {"id": 427556624, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d244202-r427556624-Fundacio_Antoni_Tapies-Barcelona_Catalonia.html", "text": "Imagine the Picasso or the Miro museums in Barcelona having exhibitions almost without works by the artist. But that was the case with works by AT at our visit (Oct 8). Such an exhibition policy is very hard to understand. Why not show at least 10 of ATs major works? The special exhibition (Harun Farocki) was interesting and has a clear linkage to the political parts of AT's oeuvre, but we expected much more than that.", "publishedDate": "2016-10-13", "language": "en", "rating": 1}, {"id": 421492681, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d244202-r421492681-Fundacio_Antoni_Tapies-Barcelona_Catalonia.html", "text": "This is a nice gallery but we didn't thrill at the exhibits. I was disappointed that there was so little work by Tapies. We got in free with the Barcelona Card. Glad we didn't pay.\nThe library was the best bit.\n", "publishedDate": "2016-09-23", "language": "en", "rating": 3}, {"id": 419802750, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d244202-r419802750-Fundacio_Antoni_Tapies-Barcelona_Catalonia.html", "text": "Having travelled to Barcelona specifically to visit this museum I was gutted to discover how little of Tapies' own work was on display. It was extremely upsetting in fact. I am not sure i will visit again in case it is still as upsetting.", "publishedDate": "2016-09-18", "language": "en", "rating": 3}, {"id": 418374570, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d244202-r418374570-Fundacio_Antoni_Tapies-Barcelona_Catalonia.html", "text": "Interesting to visit Antoni Tapies and see some of his art, although the collection was limited. It is very spacious, making it easy for disabled. Must bring your own wheelchair thought.", "publishedDate": "2016-09-14", "language": "en", "rating": 4}, {"id": 417941457, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d244202-r417941457-Fundacio_Antoni_Tapies-Barcelona_Catalonia.html", "text": "Being a major Tapies fan I was really looking forward to revisiting some of his works and showing my wife what he was about. Today we visited and there was a small collection of his work from when he was messing around trying to be political.\n\n The gallery of combinations was closed.\n\n The auditorium had a selection of small prints you could by in the shop.\n\nThe rest of the exibition was given over to an exhibition of videos of \"political symbolism\". Read someone taking themselves far to seriously. I can view this sort of tosh at any \" contemporary art\" gallery in the world. And usually for free as it has probably been put together by an art major to impress \"his\" 60 year old professor who hasn't quite forgotten the sixties.\n\nThere was not a single major work of Tapies to be seen.\nIt took longer to get change at the front desk than to view this gallery. So as a polical statement on capitalism this was far more significant than the exhibition.\n", "publishedDate": "2016-09-13", "language": "en", "rating": 1}, {"id": 416067593, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d244202-r416067593-Fundacio_Antoni_Tapies-Barcelona_Catalonia.html", "text": "This museum didn't offer us much in terms of interest. I wouldn't recommend unless you are familiar with the artist. Some of the exhibition sound didn't work and the works were a bit sparse. The exterior was interesting and right around the corner from Casa Batllo.", "publishedDate": "2016-09-08", "language": "en", "rating": 2}, {"id": 414299216, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d244202-r414299216-Fundacio_Antoni_Tapies-Barcelona_Catalonia.html", "text": "If you want to know what type of art was going on under the fascist Franco this is a good introduction. I'm glad I read about this museum in a travel book I purchased; I probably would have missed it. Antoni Tapies created a lot of his art while living under the thumb of Gen. Franco and I believe it perfectly captures the feeling of the average citizen that had to endure Franco's reign.  It may be sparce but it is vert impactful. And it's a hidden gem for the average traveler to Barcelona. ", "publishedDate": "2016-09-03", "language": "en", "rating": 4}, {"id": 396090970, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d244202-r396090970-Fundacio_Antoni_Tapies-Barcelona_Catalonia.html", "text": "For someone like me and my wife, the museum itself wasn't nothing special. We couldn't appreciate the collection of this artist.\n\nI'd rather advice everyone to checkout the front outside layout of the museum which is rather great.\n\nAs for entering, search firstly the artist's galleries.", "publishedDate": "2016-07-24", "language": "en", "rating": 3}, {"id": 385650188, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d244202-r385650188-Fundacio_Antoni_Tapies-Barcelona_Catalonia.html", "text": "Some people say, that they can see something interesting in Antoni Tapies' works.\nI can't.\nBe sure, that you like such things before you spend money and time here", "publishedDate": "2016-06-24", "language": "en", "rating": 2}, {"id": 373127986, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d244202-r373127986-Fundacio_Antoni_Tapies-Barcelona_Catalonia.html", "text": "Another small art oasis in the middle of Barcelona - the building itself is an awesome photo opportunity - Inside the foundation there is an amazing library - if you're studying art and want to arrange a trip to see their collection - go right ahead and book an appointment. There are some Tapies works on display - and some from private collections. Always great to see Internationally important pieces, well presented in a stunning building.", "publishedDate": "2016-05-15", "language": "en", "rating": 4}, {"id": 364209806, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d244202-r364209806-Fundacio_Antoni_Tapies-Barcelona_Catalonia.html", "text": "The works of Tapies were not to our taste, being rather dull: all brown, ochre and grey. Other displays in the Fundacio were more appealing, including those by Japanese artists of the Gutai movement. The large canvas \"The Battle of Hastings\" by Georges Mathieu is rather fine, ?abstract expressionist.", "publishedDate": "2016-04-14", "language": "en", "rating": 3}, {"id": 348564746, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d244202-r348564746-Fundacio_Antoni_Tapies-Barcelona_Catalonia.html", "text": "Antoni Tapies is well known abstract artist and this is probably one of the most comprehensive collections of his work it will give you a great insight into a very interesting artist. This is a purpose built gallery which houses this collection.It is right in the heart of Barcelona so this can be combined with shopping and eating and there are plenty of good restaurants nearby and also very good shopping so this is an ideal family visit.", "publishedDate": "2016-02-17", "language": "en", "rating": 5}, {"id": 327516340, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d244202-r327516340-Fundacio_Antoni_Tapies-Barcelona_Catalonia.html", "text": "The Tapies Foundation is a small gallery established by and featuring the art of Antoni Tapies, a well known Spanish contemporary artist. The work is interesting, and other artists' work is shown in various shows. The small sculpture terrace is attractive. You can't miss the building in the Eixample district - it's the one with the large Tapies sculpture on the roof.", "publishedDate": "2015-11-17", "language": "en", "rating": 5}, {"id": 323934314, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d244202-r323934314-Fundacio_Antoni_Tapies-Barcelona_Catalonia.html", "text": "Part of the Articket passport. Yes, it's abstract art, you will need to think and analyse, we found it stimulating and I added an artist I knew little about to my art world.  It's not pretentious, the art is hung in large rooms that suit the scale of the pieces and let you stand back to see them properly. For us as newcomers to the artist, some analysis/biography/influences/museuography would have been welcome. I'll check him out in our library when we get home.\n There's no cafe. ", "publishedDate": "2015-11-02", "language": "en", "rating": 5}, {"id": 322489401, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d244202-r322489401-Fundacio_Antoni_Tapies-Barcelona_Catalonia.html", "text": "Antoni Tapies was a terrific Catalan artist of the 20th century. The Museum dedicated to his work is very definitely worth a visit by those who like abstract art. He was a contemporary of painters like Motherwell and Rauschenberg. His work is beautiful, thoughtful, surprising and much more. A visit is both worth the time and will lift your spirits. There is also an extensive library, begun with his collection and expanded upon since, that can be used by appointment only. ", "publishedDate": "2015-10-27", "language": "en", "rating": 5}, {"id": 321821029, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d244202-r321821029-Fundacio_Antoni_Tapies-Barcelona_Catalonia.html", "text": "I really admire and respect Antoni Tapies and his paintings. Put these in an impressive and lovely space, and you really do have a very worthwhile visit on your hands. If you like contemporary abstract painting, then you will love this museum and the artists work. Well worth a visit.", "publishedDate": "2015-10-26", "language": "en", "rating": 4}, {"id": 321699765, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d244202-r321699765-Fundacio_Antoni_Tapies-Barcelona_Catalonia.html", "text": "I know that Tapies is a well-loved Catalonian artist, but we found the collection to be dull and minimal.  Not worth a visit.  The Montaner-designed building is of some interest.", "publishedDate": "2015-10-25", "language": "en", "rating": 3}, {"id": 317151862, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d244202-r317151862-Fundacio_Antoni_Tapies-Barcelona_Catalonia.html", "text": "the place is nice, the art is weird and the entrance is expensive, 2 things were good: the library and some of the paintings from miro, picasso, pollock and other. still not really worth it.", "publishedDate": "2015-10-08", "language": "en", "rating": 2}, {"id": 316948636, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d244202-r316948636-Fundacio_Antoni_Tapies-Barcelona_Catalonia.html", "text": "We were first interested in Tapies because it's included in the Articket group (6 museums for one price).  It turned out that we visited on September 24, when admission was free, but I'd gladly pay to go.\n\nThe majority of work is Tapies' own, but the museum also owns work by Kandinsky, a Klee, a Picasso--you get the drift--and they allow photos of everything.\n\nThe building is open and light, with the wood paneled library as a counterpoint.\n\nAs an earlier reviewer pointed out, Tapies is not for everyone, but I found the texture and balance of works compelling.", "publishedDate": "2015-10-07", "language": "en", "rating": 5}, {"id": 316389597, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d244202-r316389597-Fundacio_Antoni_Tapies-Barcelona_Catalonia.html", "text": "A \"nice\" building for sure in a city that has numerous \"nice\" buildings on every block.  The only worthwhile part of the museum is its rooftop mesh of metal- easily seen from the street.  While I am a lover of modern art (and the Modern Art Museum in Barcelona is a worthwhile destination), this collection would not hold up positively in a kindergarten class of abstract artists.  There is a reason why the museum was nearly vacant on a Sunday free day.", "publishedDate": "2015-10-05", "language": "en", "rating": 1}, {"id": 314073867, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d244202-r314073867-Fundacio_Antoni_Tapies-Barcelona_Catalonia.html", "text": "Was there for the second time and again impressed. Well organised exhibition and the building of the foundation itself very interesting with its strange roof construction. The exhibition does not only show works of Antoni Tapies but also paintings from other artists he was collecting.", "publishedDate": "2015-09-27", "language": "en", "rating": 5}, {"id": 309719264, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d244202-r309719264-Fundacio_Antoni_Tapies-Barcelona_Catalonia.html", "text": "What a great collection both of the work of Tapies and his own personal collection. Lovely space and hardly any people there which makes viewing the work a complete pleasure. One of the best kept secrets of Barcelona's museums. Don't miss it.", "publishedDate": "2015-09-13", "language": "en", "rating": 5}, {"id": 299631309, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d244202-r299631309-Fundacio_Antoni_Tapies-Barcelona_Catalonia.html", "text": "Not expensif, not to many visitors, no queues but most of all, an excellent collection of a painter what is less known outside of Spain. Advice: look the documentary movie about the painter before looking at the paintings.", "publishedDate": "2015-08-15", "language": "en", "rating": 5}, {"id": 294675945, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d244202-r294675945-Fundacio_Antoni_Tapies-Barcelona_Catalonia.html", "text": "I am not a huge fan of Tapies, but I found some pictures I liked. The museum covered 4 floors, and had different styles and techniques. To someone interested in abstract art, it was worth a visit.", "publishedDate": "2015-08-01", "language": "en", "rating": 3}, {"id": 285582763, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d244202-r285582763-Fundacio_Antoni_Tapies-Barcelona_Catalonia.html", "text": "quiet museum, no crowds. Most remarkable are the large sizes of the collages and paintings. Photography is allowed.", "publishedDate": "2015-07-04", "language": "en", "rating": 3}, {"id": 284978508, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d244202-r284978508-Fundacio_Antoni_Tapies-Barcelona_Catalonia.html", "text": "Found this gallery by accident, and discovered Tapies. Great exhibition in an open and available space - no crowds. It's not a large\nExhibition, but there are some good pieces by, and collected by, Tapies. Definitely worth an hour of your time. ", "publishedDate": "2015-07-02", "language": "en", "rating": 4}, {"id": 281466986, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d244202-r281466986-Fundacio_Antoni_Tapies-Barcelona_Catalonia.html", "text": "Avant- Garde  Gallery & research library devoted to the \nwork of Antoni Tapies, a Barcelona native son and a\nsignificant  Catalan artist of the 20th Century.  The\nbuilding is around the block from the 'block of discord'\noff the Passeig de Gracia and has the distinctive  wire\nand metal sculpture on the roof.\n\nThis is one of Barcelona's few places to see edgy\ncontemporary art.  The work of Tapies is also on\ndisplay.  These exhibits of his work are limited in\nscope to a few years at a time or to a specific period\nin the artist's career, so you will see a relatively\nsmall but cohesive group of works.\n\nThe gallery may not be for everyone, so please check\nthe exhibition schedule to be sure.  The neighborhood\nin this area is loaded with tapas bars, bakeries, &\nother food  items.", "publishedDate": "2015-06-19", "language": "en", "rating": 4}, {"id": 269129150, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d244202-r269129150-Fundacio_Antoni_Tapies-Barcelona_Catalonia.html", "text": "I like modern art very much, but did not find this exhibit particularly exciting. It is a relatively small collection in a building in central Barcelona. I went there because it was a part of the Articket BCN art passport, but am unlikely to return or recommend it.", "publishedDate": "2015-04-30", "language": "en", "rating": 3}, {"id": 268470420, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d244202-r268470420-Fundacio_Antoni_Tapies-Barcelona_Catalonia.html", "text": "Good collection on Tapies on the permanent exhibition and i was lucky to get a nice one to on the temporary. Included in the Bracelona Card free entries.", "publishedDate": "2015-04-28", "language": "en", "rating": 4}, {"id": 259904627, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d244202-r259904627-Fundacio_Antoni_Tapies-Barcelona_Catalonia.html", "text": "Second time I visited this very modern and beautiful foundation. I find it one of the most interesting Barcelona attraction. The Intervalo Acciones Sonoras is a must if you like experiment sound.", "publishedDate": "2015-03-16", "language": "en", "rating": 5}, {"id": 256085346, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d244202-r256085346-Fundacio_Antoni_Tapies-Barcelona_Catalonia.html", "text": "In the middle of Barcelona if you like modern art and Tapies this is a nice place to visit. It is a beautiful space with very good Tapies on view", "publishedDate": "2015-02-23", "language": "en", "rating": 4}, {"id": 241633340, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d244202-r241633340-Fundacio_Antoni_Tapies-Barcelona_Catalonia.html", "text": "This was my last stop on the Art ticket stop.  Not sure what to say about it.  There were not a lot of Tapies works on view, though I am not sure how prolific an artist he in fact was.  There was an interesting sound and art exhibit when I visited that seemed to overwhelm Tapies, at least to me.  The space is quite spacious and airy, so rather a pleasant place to visit.  While I visited in November, it was a Sunday and I thought there would be more people.  That said, it is not off the beaten track and worth a visit if you have the Art ticket in hand.  It is, to be sure, contemporary, so if that isn't your thing, this might not be for you.  All that said, I am happy to have added it to my museum visits in Barcelona.", "publishedDate": "2014-11-26", "language": "en", "rating": 3}, {"id": 237952152, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d244202-r237952152-Fundacio_Antoni_Tapies-Barcelona_Catalonia.html", "text": "A beautiful, inspiring and rich collection. I am so glad I came here! The painter Antoni Tàpies is a genius. And of course, their Library is also worth to visit.", "publishedDate": "2014-11-04", "language": "en", "rating": 5}, {"id": 237325166, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d244202-r237325166-Fundacio_Antoni_Tapies-Barcelona_Catalonia.html", "text": "This is a small museum that was located quite close to our hotel. It was lovely with its contemporary presentations and modern exhibits. ", "publishedDate": "2014-10-31", "language": "en", "rating": 5}, {"id": 235277706, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d244202-r235277706-Fundacio_Antoni_Tapies-Barcelona_Catalonia.html", "text": "There is nothing much to see in this museum.  I am not sure it just happens this time of the year.  The Articket BCN costs 30 Euros.  There are 3 out of 6 museums you can skip which are included in Articket BCN.  The museums which are worth seeing are Museu Picasso, Museu Nacional D'Art De Catalunya, and Fundacio Joan Miro (if you like Miro). If you are over 60 years old, Museu Nacional D'Art De Catalunya is free and you also get discount to the other 2 museums. You can do the math.", "publishedDate": "2014-10-19", "language": "en", "rating": 1}, {"id": 235007815, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d244202-r235007815-Fundacio_Antoni_Tapies-Barcelona_Catalonia.html", "text": "I visited in August 2014 when it was hosting a Kerry James Marshall exhibition (i saw another KJM exhibition in Madrid a few days later!) and whilst I liked it, it was an incredibly small space with very little else on offer and if i had dedicated a day to visiting it i would have been disappointed. Weave it into a day of other activities in the same area but if you are pushed for time you could skip it", "publishedDate": "2014-10-18", "language": "en", "rating": 3}, {"id": 234955220, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d244202-r234955220-Fundacio_Antoni_Tapies-Barcelona_Catalonia.html", "text": "It is at Paseo de Gracia and the gallery is very interesting. I like his work and I think that if you are close to Paseo de Gracia you can not miss this place. i recommend you to book the Art ticket that is a passaport ticket for the most important meuseum in Barcelona. If you have this ticket you avoid the long lines. Book it at internet.", "publishedDate": "2014-10-17", "language": "en", "rating": 5}, {"id": 226485002, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d244202-r226485002-Fundacio_Antoni_Tapies-Barcelona_Catalonia.html", "text": "This museum housed an interesting exhibition by the US artist Kerry James Marshall. However, there were very little Tapies works (Reina Sofia Museum was much more impressive in this respect).\nA bit overpriced all in all.", "publishedDate": "2014-09-02", "language": "en", "rating": 4}, {"id": 223404533, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d244202-r223404533-Fundacio_Antoni_Tapies-Barcelona_Catalonia.html", "text": "Well, I knew Tapies when I was in Art-College.\nMàààn, he's heavy duty. \n\nBut his compositions are so powerful, that as a graphic design-student you should take notice of this artist. \nAnd study his work.\nSo I did.\n\nAnd then I went to Barca...\nand again...and again... (course good friends of my live there) I went to visit his museum several times.\n\nIt's like a hidden secret some tourists know about. But you'll notice the difference as you go to the Picasso Museum. You can't wonder about without bumping into annoying tourists with the booklet before their eyes like the whole time :) (what's that about?).\n\nIt's a silent, classical building to begin with.\nIt's built between 1881 and 1885 by the architect Lluís Domènech i Montaner, and is one of the landmarks of Barcelona Art Nouveau. It's gorgeous!\n\nVery impressive and the work of the master suits here. It's a compliment for the building.\n\nI can't put my finger on it what happens... But every time I came out of the museum something else occurred, the first time his work was so impressive, I almost cried. The second time I was feeling so heavy down that it was too much.\nEvery time it's Bingo!\n\nPlease, nobody should know about this museum...\n\nSo better keep it a secret!\nIf you can't handle heavy stuff: don't go!\n\nStay away please. \n\nBye!", "publishedDate": "2014-08-21", "language": "en", "rating": 5}, {"id": 220895995, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d244202-r220895995-Fundacio_Antoni_Tapies-Barcelona_Catalonia.html", "text": "Great artist but very small collection. Only about 15 masterpieces, that's all !\nExpensive for a small exposition. It is not up to the importance of his work.", "publishedDate": "2014-08-10", "language": "en", "rating": 3}, {"id": 213880693, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d244202-r213880693-Fundacio_Antoni_Tapies-Barcelona_Catalonia.html", "text": "after seeing all the great works of artists in Barcelona, this was a little bit of a joke. we are not fan of abstract art but I respect works of Miro and picasso. this was not abstract, I don't know what this was. \nwe called it \"oh I spilled my ink!\"\ndon't waste your time.\nP.S: the temporary exhibition was horrible too! it was called \"Black Power\". I'll leave the rest for you to figure out.", "publishedDate": "2014-07-06", "language": "en", "rating": 1}, {"id": 206324508, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d244202-r206324508-Fundacio_Antoni_Tapies-Barcelona_Catalonia.html", "text": "I expected to see a lot of works by Tapies for the 7 Euro entrance charge - installations, sculptures, printed books etc - a career overview. Barcelona has some great galleries and the entrance fee is usually very low. So I was surprised and very disappointed to see only one floor with about ten paintings - a couple of significant pieces but quite a few minor ones - and a collection of rather repetitive prints. It's a great building (in a city with lots of great buildings) but the place looks neglected. The guard on the Tapies floor was asleep. There was an almost empty fast food dispenser where there was supposed to be a cafe, a roof terrace strewn with litter and overturned chairs. I suspect it costs a lot to run and there just aren't the visitors. Only one other person arrived during my visit and I overheard her ask a where she could see the rest of the work.", "publishedDate": "2014-05-20", "language": "en", "rating": 1}, {"id": 206238567, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d244202-r206238567-Fundacio_Antoni_Tapies-Barcelona_Catalonia.html", "text": "Housed in a very fine downtown building is this homage to Spain's finest artist, with no exceptions. The spaces are excellent and the collection is sublime. If you are a devotee, this is a must. If you are unaware of the man and his work, let the scales drop from your eyes. ", "publishedDate": "2014-05-19", "language": "en", "rating": 5}, {"id": 204987848, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d244202-r204987848-Fundacio_Antoni_Tapies-Barcelona_Catalonia.html", "text": "An entire building, a dedicated foundation and a 7€ museum to exhibit a dozen pieces of cardboard stained by black paint. This really is what its about. I'm not really into modern art, nor do I understand it at all, but really? This is literally pieces of cardboard, old crumbled newspapers and bits of trash pasted on frames and stained with black paint or random other trash. I wish I could say that there is probably a hidden meaning behind all of this, but deep down, I'm pretty sure that's a fraud disguised as modern art.", "publishedDate": "2014-05-10", "language": "en", "rating": 1}, {"id": 203737663, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d244202-r203737663-Fundacio_Antoni_Tapies-Barcelona_Catalonia.html", "text": "The building was interesting from outside, the visit was included in the BCN card so we tried.\nVery dispointed but we are not big fans of modern art.\nThe interior of building has nothing special.\nExpensive and not worth a visit.", "publishedDate": "2014-05-02", "language": "en", "rating": 2}, {"id": 203304887, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d244202-r203304887-Fundacio_Antoni_Tapies-Barcelona_Catalonia.html", "text": "everyone talks about and wants to see the Picasso Museum but go to see Antoni Tapies his work is just awe inspiring so if you like art go to the Antoni Tapies Gallery. This under estimated artists work just blew me away. watching the short film about his life moved me so much that it reduced me to tears, he was a genius and wonderful abstract artist.It was so much better than the Picasso Museum. go and there were no queues!!!   ", "publishedDate": "2014-04-29", "language": "en", "rating": 5}, {"id": 196740093, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d244202-r196740093-Fundacio_Antoni_Tapies-Barcelona_Catalonia.html", "text": "The museum has interesting collection of art. It is worth a visit. It is located very close to Casa Batllo. ", "publishedDate": "2014-03-09", "language": "en", "rating": 4}, {"id": 182980480, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d244202-r182980480-Fundacio_Antoni_Tapies-Barcelona_Catalonia.html", "text": "We visited this museum after visiting the Casa Batllo just around the corner, and because we had entry on our Articket.  I found that I was more interested in the Tapies in the MACBA than here.  I am not a fan of his.", "publishedDate": "2013-10-30", "language": "en", "rating": 2}, {"id": 181302335, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d244202-r181302335-Fundacio_Antoni_Tapies-Barcelona_Catalonia.html", "text": "Tàpies' works are united in this beautiful building (look up on the roof!). A number of great works, some 'interesting', some stunning.", "publishedDate": "2013-10-16", "language": "en", "rating": 4}, {"id": 180493372, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d244202-r180493372-Fundacio_Antoni_Tapies-Barcelona_Catalonia.html", "text": "The Tapies Foundation hosts contemporary art collections the quality of which varies depending upon what is currently installed.  On a tight schedule I would skip this one in Barcelona.", "publishedDate": "2013-10-10", "language": "en", "rating": 4}, {"id": 163240846, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d244202-r163240846-Fundacio_Antoni_Tapies-Barcelona_Catalonia.html", "text": "I am an expert in art connoisseurship, and I find this museum extremely unattractive.  The main collection comprises the work of Antoni (or \"Antonio\") Tàpies, a mediocre artist whose star is on the wane.  Since the main collection of so poor, the museum is careful, in my view, to avoid temporary exhibitions that might eclipse it.  So those are bad too.  I can't understand how anyone could've expected a building full of work by Tàpies to compete with museums dedicated to important artists like Picasso and Miró.", "publishedDate": "2013-06-07", "language": "en", "rating": 1}, {"id": 160183195, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d244202-r160183195-Fundacio_Antoni_Tapies-Barcelona_Catalonia.html", "text": "Didn't really get the art in here. Unless you're a Great fan of tapies or have free entry with a barcelona Card - I would avoid this ", "publishedDate": "2013-05-09", "language": "en", "rating": 2}, {"id": 153300332, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d244202-r153300332-Fundacio_Antoni_Tapies-Barcelona_Catalonia.html", "text": "I enjoy art and am quite open minded about things but I find myself at crossroads with modern art. And unfortunately, this foundation fell into my 'not again' category. The work was based on the same concepts of other contemporary work I had seen elsewhere and was not appealing or surprising for me. The building however is fantastic.\n\nThe temporary exhibition was about feminism, but required you to go through the paper archives in white gloves, choosing what you wanted to watch before asking an assistant to play it for you. I guess this is great if you are studying or are seriously interested, otherwise it felt like you were going to watch females rant all afternoon about something or the other. (I would like to state here that as a female, I totally understand understand the importance of feminism but this just wasn't what I was expecting when I was told about the foundation).\n\nWe had free entry with the BCN card thank goodness, but I would highly recommend paying visitors to research his work first before you decide whether to go or not, as it is about €7 entry.", "publishedDate": "2013-02-27", "language": "en", "rating": 2}, {"id": 151168859, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d244202-r151168859-Fundacio_Antoni_Tapies-Barcelona_Catalonia.html", "text": "but then I'm rather biased on this one... my favourite and in my opinion underrated Spanish artists. So having said that if abstract art isn't your bag then maybe its not for you. Reasonable entrance fee and good gift shop stocked with a lot of books on the great man.\n\nEasy to find, around the corner from Casa Battlo, with the metal roof sculpture giving a good clue:D Slightly disappointing Terrace, although the giant sock was worth a closer inspection. The signs promising refreshment, unfortunately entailed 2 rather lonely looking vending machines... still I don't go to galleries to eat, so onto my next review...", "publishedDate": "2013-02-01", "language": "en", "rating": 5}, {"id": 144679725, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d244202-r144679725-Fundacio_Antoni_Tapies-Barcelona_Catalonia.html", "text": "This is a building of the beginnings of the modernista style, the building is gr4eat, and the museum really ice, Tapies is a contremporari artist, I don nnot undertand him, On top of the building a large structurre and a chair...", "publishedDate": "2012-11-05", "language": "en", "rating": 3}, {"id": 141370498, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d244202-r141370498-Fundacio_Antoni_Tapies-Barcelona_Catalonia.html", "text": "If  you're near the Gaudi apartments, you're near the Fundacio Antoni Tapies. (RIP), he died at age 87 or so March 2012.\n\nSeeing his art all in one place changed my life. Once I scraped my jaw off the floor......I knew what I wanted to do for the rest of my life, and I'm at least attempting to paint like he did. I've had several shows borrowing his style, as best I can anyway, more of a tribute......there was no better mid century painter in my opinion. Just genius. \n\nThis building is his own museum, there is one of his sculptures on top of the building called \"chair and hair\", it's a bit hard to miss but it IS on a side street going away from the Gaudi apartments about a block. If you can possibly go there, GO. It's just wonderful. I'll add photos when I can. Google images Antoni Tapies paintings. They are HUGE.\n\nhttp://www.fundaciotapies.org", "publishedDate": "2012-09-26", "language": "en", "rating": 5}, {"id": 139264975, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d244202-r139264975-Fundacio_Antoni_Tapies-Barcelona_Catalonia.html", "text": "i usually really enjoy modern art but Taipes work just doesn't make sense to me or appeal in any way. Check out his style first before shelling out the entrance fee. ", "publishedDate": "2012-09-03", "language": "en", "rating": 1}, {"id": 131700096, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d244202-r131700096-Fundacio_Antoni_Tapies-Barcelona_Catalonia.html", "text": "Loved the work of Antonio Tapies. Also loved the building which houses the art. Both worth the visit! Very inspiring!", "publishedDate": "2012-06-10", "language": "en", "rating": 5}, {"id": 131587593, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d244202-r131587593-Fundacio_Antoni_Tapies-Barcelona_Catalonia.html", "text": "This museum is very special as it gives an insight into one of Spain's greatest Contemporary artists.  But even more than that, we enjoyed the building itself and learning about its history and renovation.  We had no trouble finding it and spent a few hours there.  Highly recommend it to all.", "publishedDate": "2012-06-08", "language": "en", "rating": 5}, {"id": 130961337, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d244202-r130961337-Fundacio_Antoni_Tapies-Barcelona_Catalonia.html", "text": "I am a huge fan of Antoni Tapies and his work and I was very excited to be in Barcelona for the first time just so I could see this place. I'm happy to say that it was worth the trip! If you are a fan of Tapies or of any form of abstract expressionism, you will not be disappointed. \n\nAdmission is 10 Euro. The gallery is small but is well laid out on 3 levels with a tiny rooftop area. I wish more works had been on display, but what was on view was fantastic. The museum rotates their exhibits 4 times per year but each one presents a good overview of Tapies' works. This particular display (Exhibition #3) featured several of the artist's early surrealist drawings, a few bronze sculptures and paintings that spanned several decades (from the 1940s to present). The exhibit illustrated the evolution of Tapies' techniques and showcased his ability to create inspired works with varied materials. \n\nThe artwork here is breathtaking. I had only seen a few very small canvas works at some U.S. art museums and I was overwhelmed with the sheer size of some of the works on display here (they are really larger than life). They are absolutely stunning! Although the museum is small, I easily spent 3 hours here and could've stayed even longer in contemplation. The museum also had a screening of a documentary on Tapies that was included in the admission cost. \n\nThe museum gift shop is top notch with all sorts of great items for art lovers on a budget (postcards run about 1 Euro each, notecards are around 5 Euro, t-shirts 20 Euro; while you can get gorgeous lithographs, silk scarves and more if you are willing to drop a lot of money). I purchased a few notecards, postcards, a t-shirt and a full color book with selected art for about 32 Euro total. \n\nMy husband, who is not an art lover, was not very impressed with this place. He really tried to enjoy the art but just kept saying \"I don't get it.\" I know that Tapies is an aquired taste but even if you aren't a fan, this museum is worth a visit just to see works by one of the most influential Spanish artists. And if you are a fan like me, you will be in pure art heaven!", "publishedDate": "2012-05-30", "language": "en", "rating": 5}, {"id": 129682841, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d244202-r129682841-Fundacio_Antoni_Tapies-Barcelona_Catalonia.html", "text": "If you are interested in contemporary art, then this must be on your list. It was quite difficult to find - we walked for miles - but worth it.  ", "publishedDate": "2012-05-10", "language": "en", "rating": 4}, {"id": 129667068, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d244202-r129667068-Fundacio_Antoni_Tapies-Barcelona_Catalonia.html", "text": "Personally I did not like the art in here, only two floor were open (mostly empty too) and it's full of modern / contemporary art (I'm not sure what the difference really is). Unless you're really into that sort of thing don't spend your money here, as an example of some of the hi-lights there is a piece of packaging cardboard with black spray paint on it and an old wooden chair with dirty rags over it.\n\nI know some people like this kind of thing but I fail to see how it can be considered art.", "publishedDate": "2012-05-09", "language": "en", "rating": 1}, {"id": 129189490, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d244202-r129189490-Fundacio_Antoni_Tapies-Barcelona_Catalonia.html", "text": "We hadn't plan to visit this museum, but we're really glad we did. It was nice to see Tapies different kind of works. The film down in the basement when you see how he create one of his pieces is very interesting even though it was in catalan or spanish (which we don't understand). And the guest artist was a real hit - a work by Xavier Le Roy. It was art performance at it's very best. A really nice surprise for us!", "publishedDate": "2012-05-01", "language": "en", "rating": 4}, {"id": 128351454, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d244202-r128351454-Fundacio_Antoni_Tapies-Barcelona_Catalonia.html", "text": "Perhaps because we were there on a Saturday, many of the exhibit rooms were cordoned off.  What was on display was limited, although very interesting.  There was a room dedicated to performance art, which was not to my taste.", "publishedDate": "2012-04-22", "language": "en", "rating": 3}, {"id": 127726720, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d244202-r127726720-Fundacio_Antoni_Tapies-Barcelona_Catalonia.html", "text": "Even though recently passed away, Antoni Tapies has made his fame as one of the most important contemporary artists coming from Barcelona. This place is a good start to get to know his ideas and thoughts and to see his work whether you like this or not. One of the first to use everyday objects (e.g. for cooking) and construction materials (plaster, cement) to create works of art and established his own trade mark in the history of art. It's a shame they don't have more of his work on display since the place is big enough. The foundation is part of the Articket for Barcelona. There are also several temporary exhibitions by young artists like video art etc. There is also a small shop (not many things in English though) and a restaurant. Overall this is worth a visit though it is not comparable to Picasso museum or Miro foundation which are a must see for a first Barcelona trip at least.", "publishedDate": "2012-04-12", "language": "en", "rating": 4}, {"id": 126249298, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d244202-r126249298-Fundacio_Antoni_Tapies-Barcelona_Catalonia.html", "text": "A superb small scale modern art venue that also show cases Antoni Tapies' work. Curatorship of temporary shows is international, the building- topped by a huge wire sculpture- is superb- an old modernista publishing house. a few steps from Gaudi's buildings.", "publishedDate": "2012-03-17", "language": "en", "rating": 5}, {"id": 1489759, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d244202-r1489759-Fundacio_Antoni_Tapies-Barcelona_Catalonia.html", "text": "The Tapies Foundation is a must do visit in Barcelona. The Museum has a substancial selection of his work on permanent show, as well as hosting the artworks of other contemporary artists from around the world. Since returning to Sydney I have been in contact with the Foudation by email and they have sent me a substancial amount of English texts on Tapies work. All Antoni Tapies enthusiasts should make the pilgrimage to Barcelona to visit the Museum. It was a wonderful experience.", "publishedDate": "2003-11-15", "language": "en", "rating": 5}]}}]