[{"locationId": 2577943, "name": "Biblioteca de Catalunya", "placeType": "ATTRACTION", "reviewListPage": {"reviews": [{"id": 720686779, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d2577943-r720686779-Biblioteca_de_Catalunya-Barcelona_Catalonia.html", "text": "I read a lot of good things about the biblioteca, so I decided to go there, but there was no entry possible for me. I was simply said 'no', when I asked to get in. The 'jardin' also is said to be a beautiful oase, but there are just a few trees and a lot of 'no good people' hanging around. (There also is a smell of garbage in the air.) The building was nice to look at,.. I admit, but I really wished I had the same experience as the rest of the visitors here.", "publishedDate": "2019-10-23", "language": "en", "rating": 1}, {"id": 666378786, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d2577943-r666378786-Biblioteca_de_Catalunya-Barcelona_Catalonia.html", "text": "Tucked away in a hidden corner of El Raval, the Biblioteca de Catalunya is one of Barcelona's most beautiful secrets. The public section is free to enter and contains a wealth of reading material for those for whom the city's museums aren't enough, and whilst the main library itself (up the big stairs on the left upon entering the gardens from Carrer del Hospital) requires a pass to enter, this is both free and easily obtained at the main desk, for both passing and more lengthy visits.", "publishedDate": "2019-04-14", "language": "en", "rating": 4}, {"id": 621537633, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d2577943-r621537633-Biblioteca_de_Catalunya-Barcelona_Catalonia.html", "text": "Spaceful library with an enormous catalogue and helpful staff. A quiet place where to read or to work with your computer. You need to apply for a free membership though.", "publishedDate": "2018-10-02", "language": "en", "rating": 5}, {"id": 508750259, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d2577943-r508750259-Biblioteca_de_Catalunya-Barcelona_Catalonia.html", "text": "Passed by by accident and fell in love with the garden. Saw local people playing huge chess and it's super fun!", "publishedDate": "2017-08-04", "language": "en", "rating": 5}, {"id": 468173632, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d2577943-r468173632-Biblioteca_de_Catalunya-Barcelona_Catalonia.html", "text": "It was alight (looks better in pictures), you could hang out if walked too much but nothing much to write home to", "publishedDate": "2017-03-17", "language": "en", "rating": 3}, {"id": 456708077, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d2577943-r456708077-Biblioteca_de_Catalunya-Barcelona_Catalonia.html", "text": "Second chance I have the opportunity to enjoy a play at the beautiful gothic building in the library. This time a play called L'Hostelera, the set was fab, the wwhole theatre was a restaurant, an italian fonda, with wine, and dishes on teh table, because at break, they served food! And it was really something! great idea and a joy as usual!", "publishedDate": "2017-02-02", "language": "en", "rating": 5}, {"id": 433318708, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d2577943-r433318708-Biblioteca_de_Catalunya-Barcelona_Catalonia.html", "text": "The library is housed in a former medieval hospital and looks incredible. it is very relaxing and worth a visit.", "publishedDate": "2016-10-31", "language": "en", "rating": 5}, {"id": 417428327, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d2577943-r417428327-Biblioteca_de_Catalunya-Barcelona_Catalonia.html", "text": "Biblioteca de Catalunya (the National Library of Catalunya) is situated in Jardins de Rubió i Lluch. Both the outside and the inside takes your breath away. When Gaudi was run down by a tram, he was taken here. At that time this was a hospital, which moved to Sant Pau Hospital near Sagrada Familia.", "publishedDate": "2016-09-12", "language": "en", "rating": 4}, {"id": 386856693, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d2577943-r386856693-Biblioteca_de_Catalunya-Barcelona_Catalonia.html", "text": "Library of Catalonia is located in El Raval between Carrer de l'Hospital and Carrer del Carme.\nIt is a beautiful old building.\nThe Library-garden is an idyllic oasis. For rest, reading, playing. A wondeful place.\nOne of many oasis in the metropolitan.", "publishedDate": "2016-06-27", "language": "en", "rating": 4}, {"id": 320605239, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d2577943-r320605239-Biblioteca_de_Catalunya-Barcelona_Catalonia.html", "text": "I loved this building, and the way it stands as an old-world structure among the newer buildings all around.", "publishedDate": "2015-10-21", "language": "en", "rating": 5}, {"id": 304435013, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d2577943-r304435013-Biblioteca_de_Catalunya-Barcelona_Catalonia.html", "text": "This is where Gaudi was taken after the tram accident. No longer a paupers hospital, its now the Library. The square is beautiful, a real gem. I recommend that you find it! Also, on a hot day, why not walk into the AIR-CON Library, walk up and down the aisles for a few minutes and regain your composure then head into the square refreshed? hint hint", "publishedDate": "2015-08-28", "language": "en", "rating": 5}, {"id": 275689847, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d2577943-r275689847-Biblioteca_de_Catalunya-Barcelona_Catalonia.html", "text": "How lucky these students are to learn in a such ancient place.\nfew hundreds meters from ramblas and a total different atmosphere ...\nhave a coffee here", "publishedDate": "2015-05-30", "language": "en", "rating": 4}, {"id": 264847247, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d2577943-r264847247-Biblioteca_de_Catalunya-Barcelona_Catalonia.html", "text": "The library of Catalonia is mainly meant for researchers, however, access was granted to us with the qualification that we should give room for those who need the materials of the library. You need to provide an ID and fill in a form to register to the library and to receive the access card to get in. There are quite a many hotspots and there's a Wifi in the library. On top of this there is a nice inner courtyard and cafe for breaks. During our visit there was room to study and work.", "publishedDate": "2015-04-10", "language": "en", "rating": 4}, {"id": 219823812, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d2577943-r219823812-Biblioteca_de_Catalunya-Barcelona_Catalonia.html", "text": "The building is in a traditional style with a courtyard in the middle. There's two large size chess where people crowded watching the game.", "publishedDate": "2014-08-05", "language": "en", "rating": 4}, {"id": 208775711, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d2577943-r208775711-Biblioteca_de_Catalunya-Barcelona_Catalonia.html", "text": "Just off the Rambla is this medieval library that is free and an oasis of calm amid the bustle of the Rambla.  The arched entrance saved me and a bunch of others during a sudden thunderstorm with no umbrella.  There is also an art space right next door called La Capella that is part of the library and hospital complex (for convalescing priests in the 15th and 16th century).", "publishedDate": "2014-06-03", "language": "en", "rating": 5}]}}]