[{"locationId": 190163, "name": "Las Ramblas", "placeType": "ATTRACTION", "reviewListPage": {"reviews": [{"id": 757443141, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d190163-r757443141-Las_Ramblas-Barcelona_Catalonia.html", "text": "A very artistic road. Full of flowers and beautiful buildings. It is basically the centre of barcelona to me.", "publishedDate": "2020-06-15", "language": "en", "rating": 3}, {"id": 756936345, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d190163-r756936345-Las_Ramblas-Barcelona_Catalonia.html", "text": "In my opinion, La Rambla is the blood vessel of Barcelona and possibly one of the most important boulevards in the city. It runs from north to south, starting from Placa De Catalunya, through the heart of the old Barcelona (Barri Gotic and El Raval) and finishing at Monument of Columbus by the seafront. The total length is 0.75mile and the street is located between Catalunya, Liceu and Drassanes metro stations. \nLa Rambla is a wide pedestrian street filled with various stalls selling cheap souvenirs, bouquets and the round the clock kiosks selling anything that you'd find from a corner shop. It also has many outdoor seating areas which their restaurants are located on both sides of the road. Passers-by shouldn't be surprised if they see restaurant staffs trying to pull them to sit down at one of their tables. This street is also well-known for pickpockets so please be extra careful with your wallets when you got there. \nLa Rambla is also a hub for entertainment, souvenirs and food and it's almost a \"Must-Visit\" place for tourists due to its prime location. Although I don't think this street has any special or has anything that you can't find anywhere elsewhere in Barcelona. ", "publishedDate": "2020-06-05", "language": "en", "rating": 3}, {"id": 753397903, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d190163-r753397903-Las_Ramblas-Barcelona_Catalonia.html", "text": "This marketplace is fantastic, so much food to choose from. The vendors are so friendly and welcoming. ", "publishedDate": "2020-05-09", "language": "en", "rating": 5}, {"id": 753176634, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d190163-r753176634-Las_Ramblas-Barcelona_Catalonia.html", "text": "We took a stroll the day we flew in from UK and it was simply great enjoyed every minute of it lots of stalls and food places all the way up the street. ", "publishedDate": "2020-05-06", "language": "en", "rating": 5}, {"id": 752764737, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d190163-r752764737-Las_Ramblas-Barcelona_Catalonia.html", "text": "The Adventure Buddies recommends Las Ramblas for the various food stands, souvenir stands all along the street. There are shops and restaurants along the way as well and an open air food market with wonderful samples of fresh fruit, smoothies and various other food items. It is a nice place to walk during the night or day just be sure to have your purse/personal items protected from potential pick pocketers! It is a touristy spot.", "publishedDate": "2020-04-19", "language": "en", "rating": 4}, {"id": 752687326, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d190163-r752687326-Las_Ramblas-Barcelona_Catalonia.html", "text": "Las Ramblas is a 1.2 kilometer pedestrian walking boulevard in Barcelona. The boulevard runs north and south and cars have a one lane road each way.  Las Ramblas runs  from Christopher Columbus Memorial in the south to Placa de \n Catalunya in the north.  If you are staying in the northern area you will have easy access to the Aerobus Express which can take you to the airport. It is also where the Barcelona Tour Buss departs from. If you need camera batteries, an adapter or stationary, El Ingles, a department store is located in the north end.  The southern end has the Port Veil, the cruise ship terminal. The Liceu theater is roughly the  half way point from north to south.\n\nIf you are looking south to the Christopher Columbus Memorial on left is the Gothic Quarter and the right the Ravalazal area.  The Gothic Quarter should not be visited  at night.\n\nLas Ramblas features hotels, shops and restaurants which command premium prices. I stayed in one one the hotels right on Las Rambas. The Spanish people like to party late in the evening and the street is noisy  until 3 am in the morning.  Notable are the many  late night clubs, street performers and La Boqueria market.  If you stay in one of the hotels you will be warned  that pick pockets and scam artists abound.", "publishedDate": "2020-04-16", "language": "en", "rating": 3}, {"id": 752622822, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d190163-r752622822-Las_Ramblas-Barcelona_Catalonia.html", "text": "Overall found las ramblas, nothing special. The market was pretty cool but that’s about the extent of it. Lots of market stalls all selling the same thing. Visited but wouldn’t feel the need to see again. ", "publishedDate": "2020-04-14", "language": "en", "rating": 3}, {"id": 752508681, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d190163-r752508681-Las_Ramblas-Barcelona_Catalonia.html", "text": "This major avenue in Barcelona is always busy and full of tourists and local residents dining at the many restaurants and cafes, shopping at the various stores and taking part in the many activities that line the avenue. When my wife and I explored Las Ramblas there was a fair open to the public that had amusement rides as well as lots of carnival treats for sale. Las Ramblas was a great place to take a stroll as well as people watch and window shop along the way.", "publishedDate": "2020-04-11", "language": "en", "rating": 5}, {"id": 752508514, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d190163-r752508514-Las_Ramblas-Barcelona_Catalonia.html", "text": "We stayed in Barcelona for 5 days before a cruise on Princess lines. The city I remember from 4 years before no longer was inviting and clean. The streets we smelly and after 2 days a rash appeared around my left ankle after walking around the streets and it took a course of anti-biotics to clear it up and several days of a painful leg and ankle. We shopped around and could not really find a suitable place to eat where we felt comfortable with hygiene and then when shopping the attitude to us was rather concerning as many of the tourist places and shops were no very friendly and we were even told that many of the people in Barcelona no longer wanted the tourists from ships as it made their lives difficult and they then went on to say they would prefer more refugees rather than tourists. I can honestly say that the stay there then made more sense and my wife did not feel very safe there with the refugees drunk and fighting all hours of the night in the streets. We went on the trip and found Italy, especially Florence, had the same attitude to tourists from ships as well and on several occasions I and my wife were deliberately pushed around by very aggressive locals not happy that we were there.", "publishedDate": "2020-04-11", "language": "en", "rating": 2}, {"id": 752462122, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d190163-r752462122-Las_Ramblas-Barcelona_Catalonia.html", "text": "I could easily stay there all day long. Drinking coffee and dilly dalling with my friends, relatives and family. Great walk and amazing experience. So many things to do. Shopping walking etc. Even if you don't like walking seating on  a bench is ideal , observing the thousands of people passing by. Amazing buildings once again. ", "publishedDate": "2020-04-10", "language": "en", "rating": 5}, {"id": 752211879, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d190163-r752211879-Las_Ramblas-Barcelona_Catalonia.html", "text": "Las Ramblas is great to walk around it and then go down to the port and mall. Other than that, resturants are expensive and NOT tasty! The food quality is less than average in resturants. And you can spend less money in local streets or malls. We sat in one of the resturants close to the sea, there was a group of tourists (asians) circling a singing band of three, the band robbed the tourists camera and handbag and ran away, right in front of us, while at the resturant, the scene was terrible, no one did anything, robbery is normal in Barcelona so keep an eye on your stuff. Also, one night we sat in a cafè, outside, a person who claimed to need money, stole my phone (it was on the table), luckily the waiter saw him and caught the thief before running!", "publishedDate": "2020-04-03", "language": "en", "rating": 4}, {"id": 752167916, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d190163-r752167916-Las_Ramblas-Barcelona_Catalonia.html", "text": "If Passeig de Grácia is the aristrocatic face of the city with the amazing modernist architecture of her buildings, Las Ramblas is the heart of the city, always crowded with locals and tourists, food, music (sometimes), souvenirs and newspapers.", "publishedDate": "2020-04-02", "language": "en", "rating": 4}, {"id": 752043175, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d190163-r752043175-Las_Ramblas-Barcelona_Catalonia.html", "text": "Leonardo Hotel is based in Las rambles not far from shops or tourist information centre and metro station ", "publishedDate": "2020-03-30", "language": "en", "rating": 5}, {"id": 752021453, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d190163-r752021453-Las_Ramblas-Barcelona_Catalonia.html", "text": "It's more than 10 years since I was in Barcelona last.  One of my favourite places in the world, I was totally shocked at the change in Las Ramblas.  Once an eclectic mix of street performers, artists and inhumane pet kiosks, that area has now been replaced by eateries. \nStill a must do for a wander, admiring the architecture, monuments and people watching, but I really missed the vibrant atmosphere it was years ago.  I totally get that the street performers took over these places and could get aggressive and I was pleased to see the back of the pet kiosks, but it had changed.", "publishedDate": "2020-03-29", "language": "en", "rating": 3}, {"id": 751952965, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d190163-r751952965-Las_Ramblas-Barcelona_Catalonia.html", "text": "At time of our visit, a lot of people visited this place. Good weather, nice atmosphere, la boqueria market. A lot of shops. Everything for a good mood.", "publishedDate": "2020-03-28", "language": "en", "rating": 5}, {"id": 751715973, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d190163-r751715973-Las_Ramblas-Barcelona_Catalonia.html", "text": "We strolled along the wide pedestrian street, shaded by lush green trees, and surrounded on both sides by beautiful historic buildings, watching people eating tapas and drinking wine in the tented restaurants along the way.  We passed caricature artists, strolling entertainers, and interesting people, and finally reached the historic Columbus Monument at the port side of the Ramblas. We sat down at an outside table in a small restaurant to enjoy dinner, wine, and people watching.  It was the perfect end to a busy day of sightseeing for us—and just the beginning of the exciting night life in Barcelona.  This is the place to be for food, entertainment, and excitement.", "publishedDate": "2020-03-23", "language": "en", "rating": 5}, {"id": 751394521, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d190163-r751394521-Las_Ramblas-Barcelona_Catalonia.html", "text": "Bustling, electric, great for night life, shopping and people watching. Fun place to visit and take in a flamenco show, sit at an outdoor cafe and have a drink a bite, or just people watch. ", "publishedDate": "2020-03-19", "language": "en", "rating": 5}, {"id": 751290540, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d190163-r751290540-Las_Ramblas-Barcelona_Catalonia.html", "text": "Visit at least once for tourist in Barcelona. Very crowded, very lively, very touristy street. There are tons of activities happening at once here: street vendors trying to sell you something from souvenir stuff like fan, key chain, scarf... to plants/flowers, concert tickets, counterfeit club jersey...; street artist performing for your pocket change; people touting tourists to the one of the many places offering tapas/beers, drinks along the street. Be ware of pick pocket here. Enjoy the atmosphere and remember to visit the popular drinking fountain (legend has it if you drink from this fountain, you will always return to Barcelona).", "publishedDate": "2020-03-18", "language": "en", "rating": 3}, {"id": 751052559, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d190163-r751052559-Las_Ramblas-Barcelona_Catalonia.html", "text": "Las Rambles sits between Catalunya Plaza and Colum (Christopher Columbus) Plaza. This is a happening area. Just be careful of pick pockets and individuals trying to get money on the streets. We had no problems communicating in English with shop owners. ", "publishedDate": "2020-03-15", "language": "en", "rating": 5}, {"id": 750821768, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d190163-r750821768-Las_Ramblas-Barcelona_Catalonia.html", "text": "Iconic place to walk down just be careful keep your wits about you as thieves and pick pockets love this area. Lots of places to eat drink shop. Close to the gothic quarter", "publishedDate": "2020-03-14", "language": "en", "rating": 5}, {"id": 750816316, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d190163-r750816316-Las_Ramblas-Barcelona_Catalonia.html", "text": "Ok so it’s a place you have to go if you visit Barcelona & there is a great atmosphere as you walk down las Ramblas BUT be careful! Many people including the locals will tell you about pick pockets & scams. Keep your wits about you, don’t walk down there drunk, keep your valuables hidden! We were absolutely fine but we witnessed a lot of dodgy characters so please be careful. You must try the huge beers, sangrias & cocktails- yes, a lot more expensive than the rest of Barcelona but worth the experience! Go off down the side roads from las ramblas & explore all the little bars & restaurants- we found lots of great places! ", "publishedDate": "2020-03-14", "language": "en", "rating": 4}, {"id": 750791493, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d190163-r750791493-Las_Ramblas-Barcelona_Catalonia.html", "text": "I always find Las Ramblas too crowded. It seems to be THE hotspot for tourists, which I do not understand. Locals in general do not like the tourists and write things like: tourism destroys the city and guiri’s go home. ", "publishedDate": "2020-03-13", "language": "en", "rating": 1}, {"id": 750739309, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d190163-r750739309-Las_Ramblas-Barcelona_Catalonia.html", "text": "Really good area. Las Ramblas is busy with a good vibe and there is a spiders web of adjoining streets with restaurants bars and shops. Great to spend a few hours. ", "publishedDate": "2020-03-13", "language": "en", "rating": 4}, {"id": 750727662, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d190163-r750727662-Las_Ramblas-Barcelona_Catalonia.html", "text": "Las Ramblas is a large kilometre long street. It is famous but I personally found it an overrated tourist trap. There are cafes along the side along with tourist stalls selling tacky gifts. There are many beggars in the vicinity as well so be aware.\n\nOn the positive side there are some superb buildings along the sides including the Escriba bakery and The Umbrella Building.\n\nDo visit it simply for the buildings along the sides but be aware of the beggars and in the summer the pickpockets.", "publishedDate": "2020-03-13", "language": "en", "rating": 3}, {"id": 750429565, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d190163-r750429565-Las_Ramblas-Barcelona_Catalonia.html", "text": "The main parade of a tourist trap.  You need to go there at least once. most places are overpriced and underperform.  Oh there are a few gems but they are not the norm", "publishedDate": "2020-03-11", "language": "en", "rating": 4}, {"id": 750299429, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d190163-r750299429-Las_Ramblas-Barcelona_Catalonia.html", "text": "Las Ramblas is a great area.  It was a little crowded but to be expected.  We needed directions and asked a police officer and he was very nice, very pleasant and helpful.  This area is a must see when in Barcelona", "publishedDate": "2020-03-10", "language": "en", "rating": 5}, {"id": 750161048, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d190163-r750161048-Las_Ramblas-Barcelona_Catalonia.html", "text": "Famous strip has ur bars cafes and restaurants always check prices go off the side roads and plenty for to see there’s tobacco shops souvenir shops street ppl main strip at the end will take u to the harbour aerobus for the airport is at the end of the strip or beginning which ever u wanna look at it it’s by Hard Rock Cafe always worth going ", "publishedDate": "2020-03-09", "language": "en", "rating": 4}, {"id": 750150525, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d190163-r750150525-Las_Ramblas-Barcelona_Catalonia.html", "text": "Along with all the rest of the highlights in the city this is a must do for your visit. It's full of character right from the top (at Placa Catalunya) all the way down to Columbus' Column near the water. This time when we walked it there seemed to be even more human statues than ever 'performing' and causing endless amusement. No point in going on about everything else you'll witness as no doubt hundreds of reviewers will have already mentioned them.", "publishedDate": "2020-03-09", "language": "en", "rating": 5}, {"id": 750133024, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d190163-r750133024-Las_Ramblas-Barcelona_Catalonia.html", "text": "Nice tree-lined street featuring shops, restaurants and countless cafes. Lots of places to dine alfresco. The older buildings lining the street are full of character. This is one of the most popular sights in Barcelona and it can get crowded. Be mindful of your belongings and enjoy.", "publishedDate": "2020-03-09", "language": "en", "rating": 4}, {"id": 750105838, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d190163-r750105838-Las_Ramblas-Barcelona_Catalonia.html", "text": "I love the feel of walking down Las Ramblas. There is a real mix of people around and seeing how everyone interacts is great. There is a great waffle icecream cart too which is a recommendation!", "publishedDate": "2020-03-09", "language": "en", "rating": 5}, {"id": 750086385, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d190163-r750086385-Las_Ramblas-Barcelona_Catalonia.html", "text": "Las Ramblas accommodates everybody with a very wide range of bars, cafes, restaurants, banks, hostels, shops. It’s very authentic and also very busy. There are lots of little side streets off Las Ramblas which also offer bars, restaurants, shops so look out for them. Some lovely souvenir shops. A couple of negatives is beware of pick pockets and also people offering you drugs but once you say no they do leave you alone. Lots of lucky lucky men who again leave you alone once you say no. ", "publishedDate": "2020-03-09", "language": "en", "rating": 5}, {"id": 750047255, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d190163-r750047255-Las_Ramblas-Barcelona_Catalonia.html", "text": "Stayed in a small hotel on the street with a balcony overlooking the main drag.  So close to everything - transport and places to visit.  Walked up and down at various times of the day and night and had no problems.  Have to be aware of what is around you just like any other city - buzzing atmosphere and lots going on.  \nGreat places to eat and people watch whilst sitting outside with a mojito.", "publishedDate": "2020-03-09", "language": "en", "rating": 5}, {"id": 749759480, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d190163-r749759480-Las_Ramblas-Barcelona_Catalonia.html", "text": "Pick pocket central - very unnerve place on an evening! \n\nBeggars pestering you and getting abit too close for comfort!  ", "publishedDate": "2020-03-07", "language": "en", "rating": 1}, {"id": 749741008, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d190163-r749741008-Las_Ramblas-Barcelona_Catalonia.html", "text": "Great place to wander, lots of shops, the market, definitely the center of Barcelona either day or night ", "publishedDate": "2020-03-07", "language": "en", "rating": 5}, {"id": 749669001, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d190163-r749669001-Las_Ramblas-Barcelona_Catalonia.html", "text": "Very popular among tourists it’s a nice place for walk, but I wouldn’t recommend staying for a drink as the prices are quite high!", "publishedDate": "2020-03-07", "language": "en", "rating": 5}, {"id": 749569948, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d190163-r749569948-Las_Ramblas-Barcelona_Catalonia.html", "text": "We stayed in las Ramblas recently. Having never being to Barcelona before we heard this was the main area for tourists. We were shocked to find what las Ramblas actually was like in this month. Full of people standing and just looking at us- we were offered drugs countless times and it just felt very unsafe. We started taking taxis everywhere to avoid the walk. Would not bring children here. ", "publishedDate": "2020-03-06", "language": "en", "rating": 2}, {"id": 749292661, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d190163-r749292661-Las_Ramblas-Barcelona_Catalonia.html", "text": "Some bars you pay 4 euros for a beer and a small tapas then next door its 20 euros for 2 beers!  Maybe look at the prices on the menus etc before you commit to getting any drinks.  Not as many street performers as before however still really good. The market is a must and has a great fish restaurant that serves excellent sea food.\n", "publishedDate": "2020-03-05", "language": "en", "rating": 4}, {"id": 749213516, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d190163-r749213516-Las_Ramblas-Barcelona_Catalonia.html", "text": "Wonderful location, fun atmosphere and great people watching.  The open air restaurants serve good food and drinks.  Don’t miss walking off the main path. Great finds along the side streets. ", "publishedDate": "2020-03-05", "language": "en", "rating": 5}, {"id": 749026131, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d190163-r749026131-Las_Ramblas-Barcelona_Catalonia.html", "text": "Wow.. the happening place.. Really liked the walk from the city centre vai the Las Ramblas to the sea side. Its a great experience. To top it up with some good bargaining shopping.", "publishedDate": "2020-03-04", "language": "en", "rating": 4}, {"id": 748480613, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d190163-r748480613-Las_Ramblas-Barcelona_Catalonia.html", "text": "We have walked up and down a couple of times it's an invigorating experience  great for people watching.  There are lots of places to eat or just have a drink.  It leads you down to the Marina where you can admire the huge yachts or do some shopping   Would highly recommend ", "publishedDate": "2020-03-01", "language": "en", "rating": 5}, {"id": 748381913, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d190163-r748381913-Las_Ramblas-Barcelona_Catalonia.html", "text": "The Columbus monument lies at the end of the famous Las Ramblas street and we walked the whole length from there. Being only around 10 AM a lot of the shops were just opening up and the crowd was not as huge as I had read online.\n\nWe stopped by Boqueria market for some bites and it was a memorable experience visiting this market.", "publishedDate": "2020-02-29", "language": "en", "rating": 3}, {"id": 748261041, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d190163-r748261041-Las_Ramblas-Barcelona_Catalonia.html", "text": "Unfortunately this street has become less quant and beautiful over time and more noisy and commercial. There are far more beautiful streets in the gothic quarter of Barcelona. Saying that it’s still quite a nice wander down to the beach. Just keep your valuables hidden away as it’s popular with pick pockets especially in high season ", "publishedDate": "2020-02-29", "language": "en", "rating": 4}, {"id": 748132892, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d190163-r748132892-Las_Ramblas-Barcelona_Catalonia.html", "text": "Las Rambles was fun to stroll down in both the evening and day. You can walk the whole length with ease. We had no problem with pic pockets as we were warned and I only wore a money belt...no purse. We had no problems but beware, they are there.", "publishedDate": "2020-02-28", "language": "en", "rating": 5}, {"id": 748118983, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d190163-r748118983-Las_Ramblas-Barcelona_Catalonia.html", "text": "But that's enough.  Lots of touristy shops and crowds which ramp up the risk of pickpockets.  Not really much to see ok the street itself", "publishedDate": "2020-02-28", "language": "en", "rating": 3}, {"id": 748062519, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d190163-r748062519-Las_Ramblas-Barcelona_Catalonia.html", "text": "Very nice to wander down the street and see the different stalls and blanket traders.\nKeep you wallet and bag safe as you should in any busy area. We felt safe and saw a lot of police about", "publishedDate": "2020-02-27", "language": "en", "rating": 4}, {"id": 747895159, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d190163-r747895159-Las_Ramblas-Barcelona_Catalonia.html", "text": "Las Ramblas would be a wonderful place to enjoy a walk, take n the architecture, do some shopping, enjoy a beer, if it were not for the pick pockets.\n\nThey work in teams. A lady drops a bag in front of you, as a gentleman you try to help, and your pockets are emptied whilst you are distracted. Or they simply make off with your bag, should you be foolish enough to put it down whilst helping the \"lady in distress\". \n\nAlternatively, they bump into you in the crowd. Your reaction is to shield that side of yourself, whilst an accomplice empties your pockets from the other side.\n\nEnjoy Las Ramblas, but do so early in the day before the crowds build up. And if a lady does suddenly trip and fall in front of you, look around to see if she has any accomplices watching you before offering assistance.\n\nWe witnessed one \"Runner\" and two \"old ladies\" trip, during our one hour walk. It was a busy day, the street was packed, I am guessing the gangs covered their daily overheads.", "publishedDate": "2020-02-27", "language": "en", "rating": 5}, {"id": 747844175, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d190163-r747844175-Las_Ramblas-Barcelona_Catalonia.html", "text": "Las Ramblas in Barcelona is a bit like Times Square in New York; when you think about it, there’s not much going on other than walking. But it is a walk you must do. It requires such little effort you’d expel more energy avoiding it than strolling it.\n\nTo make this street lined with food stalls and souvenir kiosks more than what it seems, download Rick Steves’ Las Ramblas walk audio guide onto your phone, put in your headphones, and follow along. You’ll hear tidbits of information about the buildings you’re passing and the history of this area. Soon you won’t even see the stalls anymore as you’re so engrossed in the tour.\n\nI recommend doing this walk twice: once in the morning (7-8am) and once in the early evening (6-8pm). Two completely different crowds using the same street for different purposes. Plus, you’ll need more than one visit to try all the inventive ice cream flavors!", "publishedDate": "2020-02-26", "language": "en", "rating": 3}, {"id": 747632623, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d190163-r747632623-Las_Ramblas-Barcelona_Catalonia.html", "text": "If your looking for a cool street to check out and wander around this is definitely for you. Plenty of shops and bistros to check out and try. Could easily walk around this city for hours. Enjoy", "publishedDate": "2020-02-25", "language": "en", "rating": 4}, {"id": 747404872, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d190163-r747404872-Las_Ramblas-Barcelona_Catalonia.html", "text": "Las ramblas is a very busy street filled with shops & restaurants. It goes all the way down to the harbour. You need to be careful & watch out for the pickpockets. Nice bars & restaurants off on the side streets. ", "publishedDate": "2020-02-24", "language": "en", "rating": 3}, {"id": 747346262, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d190163-r747346262-Las_Ramblas-Barcelona_Catalonia.html", "text": "this is an interesting area – very busy but filled with a lot of tourists and people ready take advantage of tourists. We walked into one bar and saw the prices and walked right back out, if you go two blocks into the Gothic Quarter, you can find cooler bars and restaurants at a fraction of the cost.", "publishedDate": "2020-02-24", "language": "en", "rating": 3}, {"id": 747278438, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d190163-r747278438-Las_Ramblas-Barcelona_Catalonia.html", "text": "This is the main part.. has tourist resturants.. some.of the streets from this road are a bit weird, dont trust the people.. other parts are lovely.. well worth a visit.", "publishedDate": "2020-02-24", "language": "en", "rating": 4}, {"id": 747086264, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d190163-r747086264-Las_Ramblas-Barcelona_Catalonia.html", "text": "A stroll between the Columbus Statue at the shoreline at Passeig de Colom to the Plaça de Catalunya. Crowded, and full of shops and restaurants, this is a very simple activity that affords great pictures and access to some tasty food and memories.\nIt also summarizes everything about Barcelona...great place, picturesque, fun...but watch out for pickpockets. I guarantee mre than half of the reviews here will say to watch out for pickpockets. While this area is fun, the concern taints the time here.\nThe road also skirts the Gothic Quarter, so easy enough to pop in...but it's labyrinthian and easy to get lost.\nResearch ahead of time. Go to the stalls at Mercado de La Boqueria. Check out the Erotic Museum, with a young woman dressed as Marilyn Monroe on the balcony. Check out the Guell Palace, a mansion designed by Gaudi.\nOverpriced. Yes. Stressful because of pickpocket concerns? Yes.\nBut still a fun walk!", "publishedDate": "2020-02-23", "language": "en", "rating": 4}, {"id": 747024900, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d190163-r747024900-Las_Ramblas-Barcelona_Catalonia.html", "text": "Apart from its reputation for pickpockets and overpriced restaurants - and that it is really busy - it is definitely worth a stroll along Las Ramblas. You do need to do your homework as it can be easy to become overwhelmed by the vast choices of places to eat and drink. In saying that, Las Ramblas is full of character. Shops and stalls, bars and restaurants It does have everything. There are also couple of small markets in the side streets. It is a bustling place day and night with plenty to do, that is for sure. ", "publishedDate": "2020-02-23", "language": "en", "rating": 3}, {"id": 746990034, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d190163-r746990034-Las_Ramblas-Barcelona_Catalonia.html", "text": "The heart of activity, people, and shopping. Unique art and clothing designs. Tourist stop and worth it!", "publishedDate": "2020-02-23", "language": "en", "rating": 5}, {"id": 746819513, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d190163-r746819513-Las_Ramblas-Barcelona_Catalonia.html", "text": "We were in Barcelona for less than 24 hours and caught a bus here for a leisurely wander. Great selection of shops, cafes, restaurants and bars to explore. Very crowded but colourful area with lots to see. As always, be aware in the crowds and double check prices before making a purchase. Easy to navigate on foot.", "publishedDate": "2020-02-22", "language": "en", "rating": 4}, {"id": 746663825, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d190163-r746663825-Las_Ramblas-Barcelona_Catalonia.html", "text": "Beautiful weather and you must take a stroll where you will see a little bit of everything. Best people watching! Local art, music - and wonderful food in the cafes. Watch our for the oversized drinks with multiple straws - huge hidden price tag!  Even saw the little green parrots. Fun!", "publishedDate": "2020-02-22", "language": "en", "rating": 4}, {"id": 746588046, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d190163-r746588046-Las_Ramblas-Barcelona_Catalonia.html", "text": "Starts from a beautiful square, good for chilling, throughout a street full of restaurants, small sellers of all kind of stuff and street performers, leading to a beautiful port, mall and aquarium..just be aware of pick pocketers and take care of your belongings!!!", "publishedDate": "2020-02-21", "language": "en", "rating": 5}, {"id": 746475321, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d190163-r746475321-Las_Ramblas-Barcelona_Catalonia.html", "text": "Pirates operating here...offer you bread and ham with your drink and charge you 35 euros.   Nothing but food pirates here.", "publishedDate": "2020-02-21", "language": "en", "rating": 1}, {"id": 746399680, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d190163-r746399680-Las_Ramblas-Barcelona_Catalonia.html", "text": "This is a great shopping and dining area. Buying souvenirs here is a good time, as you get to haggle. I saw a sho owner with an awesome toupee, do I bought a sweatshirt from him. You could easily spend an entire day here, lots of dude streets and alleys to wander. The drug dealers like to hang out in front of the KFC. ", "publishedDate": "2020-02-20", "language": "en", "rating": 5}, {"id": 746181207, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d190163-r746181207-Las_Ramblas-Barcelona_Catalonia.html", "text": "Felt like the whole of Barcelona was out in Las Ramblas. Lots of shops, lots of places to eat and great at atmosphere. We stumbled across market on one of the side streets that was absolutely brilliant too. A great place to walk in the early to late evenings", "publishedDate": "2020-02-19", "language": "en", "rating": 5}, {"id": 746175316, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d190163-r746175316-Las_Ramblas-Barcelona_Catalonia.html", "text": "Loved walking up and down Las Ramblas always saw something different happening \nWould not recommend eating from any of the outdoor restaurants not cheap and food second rate \nTake yourself down the side streets visit temple bar Irish pub €5.90 for 2 beers and lovely food \nAlso paelleria st gomose wonderful food ", "publishedDate": "2020-02-19", "language": "en", "rating": 5}, {"id": 745951491, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d190163-r745951491-Las_Ramblas-Barcelona_Catalonia.html", "text": "Some lovely little shops and restaurants but also a lot of tat\nIt’s quite quiet in Feb but I imagine it would be heaving in summer months", "publishedDate": "2020-02-18", "language": "en", "rating": 3}, {"id": 745948438, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d190163-r745948438-Las_Ramblas-Barcelona_Catalonia.html", "text": "We walked along Las Ramblas pedestrian street multiple times over multiple days in the daytime and the nighttime, and we never encountered anyone very sketchy. As in any large city, just be congnizant of your surroundings.", "publishedDate": "2020-02-18", "language": "en", "rating": 4}, {"id": 745935203, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d190163-r745935203-Las_Ramblas-Barcelona_Catalonia.html", "text": "Although the street itself is worth a visit with lots to see and shops to visit, I felt quite unsafe at times due to the numerous shady looking men around. We also got cheated when we agreed to have what I thought would be a small cocktail but turned out to be a 2 litre one! We stupidly had not asked the price beforehand and were shocked that they were 25 euros each! A sharp lesson learned and it won’t happen again! ", "publishedDate": "2020-02-18", "language": "en", "rating": 2}, {"id": 745843351, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d190163-r745843351-Las_Ramblas-Barcelona_Catalonia.html", "text": "Las ramblas\nLots of pop up restaurant sections, character portrait artists and souvenir shops. Nothing really special, a road with a variety of shops and food outlets. Worth walking down on your way to the marina. Pavement is wavy making it look like it is made of crests and troughs. Quite discombobulating!  ", "publishedDate": "2020-02-17", "language": "en", "rating": 3}, {"id": 745725102, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d190163-r745725102-Las_Ramblas-Barcelona_Catalonia.html", "text": "A busy long street with lots of restaurants, stalls and sovereigns. Other major shops in this locality. ", "publishedDate": "2020-02-17", "language": "en", "rating": 4}, {"id": 745721176, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d190163-r745721176-Las_Ramblas-Barcelona_Catalonia.html", "text": "Reading the reviews, you'd think you were reading about Alcatraz...drugs, criminals, shady people. I was there on a Sunday morning and saw mums, couples, okdpeople,prams, dogs, the disabled, black, white, evetyone. No beggars and no drugs. Just a street with all sorts of people and restaurants.", "publishedDate": "2020-02-17", "language": "en", "rating": 5}, {"id": 745709272, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d190163-r745709272-Las_Ramblas-Barcelona_Catalonia.html", "text": "It’s the main drag in Barcelona with lots of shops and cafes around etc., but really nothing additional to lots of other places in Barcelona. If you’re nearby, check it out. But I wouldn’t recommend going there without a specific reason. ", "publishedDate": "2020-02-17", "language": "en", "rating": 3}, {"id": 745695740, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d190163-r745695740-Las_Ramblas-Barcelona_Catalonia.html", "text": "If you like walking this is the place to come beautiful sites old buildings plenty of history everywhere ", "publishedDate": "2020-02-17", "language": "en", "rating": 4}, {"id": 745652140, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d190163-r745652140-Las_Ramblas-Barcelona_Catalonia.html", "text": "We'd heard rumours of the deterioration of this once beautiful street and unfortunately this was true. Its massively commercial but the worst thing is that once the sun starts to say goodbye, people seem to think it's ok to offer weed, Charlie, etc every 5 yards. It actually made us divert to other routes. ", "publishedDate": "2020-02-17", "language": "en", "rating": 1}, {"id": 745593027, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d190163-r745593027-Las_Ramblas-Barcelona_Catalonia.html", "text": "We stayed in a hotel just two minutes walk from Las Ramblas, so we walked the street every day.\nIt’s a lovely walk yet the real interest more often lies in the streets behind, adjacent or close by.\nAt one end is the sea and 1.2 kilometres away, at the other, lies Catalunya Place. The former is beautiful and the latter interesting for people watching and shopping.\nIt’s at this point that I should add a health warning... even as you are watching the crowds of people, so some of them are watching you! This area is notorious for its pick pockets and bag snatchers; there is more risk from these people than almost any other area in Europe! \nDo your homework, however, and you should be safe. Google “pickpockets or petty crime in Barcelona” and discover the most common means of stealing from strangers. Take the advice that you find and the thieves will usually target easier victims.\nThat said, don’t avoid the area out of fear. Just be sensible, Barcelona is a beautiful city and there is much to be admired.\nSo, this short street is going to take a long time if you’re really going to search out its many treasures. The fascinating Gothic quarter is very close, the incredible Boqueria Food market which has an entrance on Las  Ramblas, the Liceu Opera House, the hundreds of tempting shops, coffee houses and restaurants which line the road for its entire length. There’s always something enticing to see and you’ll need to leave plenty of time to investigate the maritime area.\nDon’t forget your (well concealed) credit card and don’t take much cash. Always leave your passport in the hotel safe and remember that you can probably get your purchases elsewhere for fewer Euros.\nWe absolutely loved just wandering Las Ramblas and taking in the sites. We recommend the area heartily and, despite a very close encounter with one of its (perhaps less expert pickpockets), will want to revisit as soon as possible.", "publishedDate": "2020-02-16", "language": "en", "rating": 4}, {"id": 745094766, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d190163-r745094766-Las_Ramblas-Barcelona_Catalonia.html", "text": "Las Ramblas is a first class tourist trap, full of shady people, drug dealers, pick-pockets and overpriced restaurants. Don't go there, you will not miss anything. Spend your time and your hard earned money in the rest of beautiful Barcelona instead. There are a million better places around.", "publishedDate": "2020-02-14", "language": "en", "rating": 1}, {"id": 744451343, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d190163-r744451343-Las_Ramblas-Barcelona_Catalonia.html", "text": "If you are in Barcelona, this is THE place to be. So it is very crowded. It is good to have the experience walking up or down, checking out the vendors, watch the street performers, or have a light meal. Just be very careful of pick pockets though. I actually enjoyed the side streets and plaza better.", "publishedDate": "2020-02-11", "language": "en", "rating": 4}, {"id": 744388623, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d190163-r744388623-Las_Ramblas-Barcelona_Catalonia.html", "text": "Walked with my sis, I felt uneasy due to the stalls and many people. Do not leave your bag in view out of your sight. As pick pocketers are around which is not nice.\n\n", "publishedDate": "2020-02-11", "language": "en", "rating": 4}, {"id": 744200149, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d190163-r744200149-Las_Ramblas-Barcelona_Catalonia.html", "text": "This is a centralize area, tourist area,  accommodations are more expensive here, but very centralized if you wanted this way. \nTheaters are here, mercets here, gothic district is walking distance, Barcelona cathedralalso around the corner, restaurants, clubs are everywhere.. \n So if you wanted this but we don’t mind a bit outside of the noise but still within area.. we choose surrounding areas. ", "publishedDate": "2020-02-10", "language": "en", "rating": 4}, {"id": 743873396, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d190163-r743873396-Las_Ramblas-Barcelona_Catalonia.html", "text": "2nd visit to this place lots of bars, shops and restaurants/ cafeterias. We visited on a Sunday when the fresh food market was closed. A must place to visit if visiting Barcelona. ", "publishedDate": "2020-02-09", "language": "en", "rating": 5}, {"id": 743843496, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d190163-r743843496-Las_Ramblas-Barcelona_Catalonia.html", "text": "I spent a few days strolling up and down here on my own and loved it.\nAt any time of the day it has plenty of visitors, lots of stalls to browse and seats along the side to sit and read in the sun when it was out!\nIf you walked down to the bottom one end you come to the pier which is fab to walk around", "publishedDate": "2020-02-08", "language": "en", "rating": 5}, {"id": 743771557, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d190163-r743771557-Las_Ramblas-Barcelona_Catalonia.html", "text": "It's very crowded and you have to find your way through. There are many restaurants and shops and the architecture of the surrounding houses is worth seeing. Also, check out the side-streets", "publishedDate": "2020-02-08", "language": "en", "rating": 5}, {"id": 743414450, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d190163-r743414450-Las_Ramblas-Barcelona_Catalonia.html", "text": "Highly recommend taking a stroll here in the evening for a meal and drinks.\nThere will be reps for certain restaurants who will be keen to nab you into their venues.\nFeel free to ask for info from them, but don't be afraid to refuse if not interested! ", "publishedDate": "2020-02-06", "language": "en", "rating": 4}, {"id": 743340918, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d190163-r743340918-Las_Ramblas-Barcelona_Catalonia.html", "text": "I didn’t do much on La Ramblas other than walk on it to get to other places. And that is why it gets 4 stars. It’s a good channel to get to a lot of other places to see in Barcelona that are NOT Las Ramblas. \n\nI have no real experience with the businesses on this street itself. Before going on the trip I read or heard from pretty much every source I used that Las Ramblas is to be avoided. Walk it, fine. But the restaurants are overpriced, the food items are poor reflections of the city cuisine, and the shops are just there to gouge tourists from as much extra money as possible. Which is true of any tourist shop but I got the impression you’d be charged more here for the same thing you could buy a block away. I didn’t test this theory, as I heeded the advice and never shopped or ate anywhere on Las Ramblas. \n\nThe pick pockets are another thing. Look, people talk about this happening in Barcelona like these pickpockets are almost supernatural or something. It isn’t like that. You just have to pay attention to your surroundings. There is no reason to shop or eat here. Even if the side-street businesses are just as touristy/money holes, they are less populated and easier to catch on if someone is marking you. So don’t stop on Las Ramblas. Use it to get somewhere else. Keep moving. Get it behind you. \n\nI never had an issue because I never stopped moving here and I have very good situational awareness. When some guy tries to get your attention and get you to slow down or stop to talk to him (happened to me a few times here)  he is most likely trying to distract you so his buddy you don’t see can pick your pocket. DONT STOP.    Don’t slow down for him.  Say no thank you as you keep on your way. Keep your distance from everyone and don’t let people brush you. Frequently check tour pockets. Keep your hands on or near them to keep other hands out. \n\nThis might sound like too much but really all you have to do is be a little vigilant. If you start to get drawn in and forget where you are, youre more at risk. But pay attention and you should be okay. There are pickpockets but it isn’t like an epidemic. Stay alert but dont be afraid.  \n\nAnyway, this brings me to why this street is good. It’s long and wide and it is sort of central to A LOT of the popular stuff to see in Barcelona. There are cathedrals, good restaurants, the gothic quarter, the erotic museum, Palau Guell, etc. I’m talking fairly short walking distance. We stayed just off Las Ramblas and it got a little loud at night on occasion (guy puking his guts out for example) but not bad. Definitely worth it for the location.  And the same can be said for Las Ramblas; worth it for the location, which is close to a lot that is not Las Ramblas.", "publishedDate": "2020-02-06", "language": "en", "rating": 4}, {"id": 742621419, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d190163-r742621419-Las_Ramblas-Barcelona_Catalonia.html", "text": "If you start at the top of this street, branch off exploring the little streets, markets, buildings and then head down to the monument, you can’t go wrong.\n", "publishedDate": "2020-02-02", "language": "en", "rating": 5}, {"id": 742583644, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d190163-r742583644-Las_Ramblas-Barcelona_Catalonia.html", "text": "It is a nice walk but from my point of view is not the best known street in the world (as some of the Catalans say). It is very nice indeed, plus the atmosphere there when close to the port, but ... It's just a street.", "publishedDate": "2020-02-02", "language": "en", "rating": 4}, {"id": 742446468, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d190163-r742446468-Las_Ramblas-Barcelona_Catalonia.html", "text": "Please be aware everyone when travelling to Barcelona. Pickpockets everywhere. Weather its day or night.\nLots of people flogging everything they can to distract your attention. My husband had his phone stolen. Yes like most citys thefts like this are comman. But as you read. Barcelona is the top place for the pickpockets.", "publishedDate": "2020-02-01", "language": "en", "rating": 1}, {"id": 742359194, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d190163-r742359194-Las_Ramblas-Barcelona_Catalonia.html", "text": "Loved it here and felt quite safe - had been warned about pick pockets but didn’t experience anything and felt very safe whilst walking through the hustle and bustle. It’s a must place in Barcelona and a great place to see the architecture ", "publishedDate": "2020-02-01", "language": "en", "rating": 4}, {"id": 742348082, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d190163-r742348082-Las_Ramblas-Barcelona_Catalonia.html", "text": "This street has so many things, coffee,.pubs, restaurants, sight seeing..\n\nIt's long but the side streets off it have loads also", "publishedDate": "2020-01-31", "language": "en", "rating": 4}, {"id": 742087933, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d190163-r742087933-Las_Ramblas-Barcelona_Catalonia.html", "text": "We have visited this street on 31st Dec, we found music, entertainment, amazing food and drinks everywhere. If u really like local food and famous Sangria then u must visit this street, There were souvenirs shops, chocolate shops etc...it is a must visit street .", "publishedDate": "2020-01-30", "language": "en", "rating": 5}, {"id": 741617938, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d190163-r741617938-Las_Ramblas-Barcelona_Catalonia.html", "text": "Cool to see, but all the restaurants looked awful.  It was nice for an evening walk and to stroll.  However, wouldn't recommend the restaurants when there are so many wonderful places to eat that are not so touristy!", "publishedDate": "2020-01-27", "language": "en", "rating": 3}, {"id": 741405561, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d190163-r741405561-Las_Ramblas-Barcelona_Catalonia.html", "text": "Interesting stroll, we did it at night, holding tightly to wallets. Lots of interesting people watching and a myriad of souvenirs available from booths as well as hawkers. I would recommend doing it, but avoid restaurants on the street in favor of those off the path, maybe in the gothic area or similar.", "publishedDate": "2020-01-26", "language": "en", "rating": 3}, {"id": 741202923, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d190163-r741202923-Las_Ramblas-Barcelona_Catalonia.html", "text": "So many amazing places to eat and buy.. You have to visit the market for the fresh produce. Sat back and breathe and watch the world go by too ", "publishedDate": "2020-01-25", "language": "en", "rating": 5}, {"id": 741002098, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d190163-r741002098-Las_Ramblas-Barcelona_Catalonia.html", "text": "Las Ramblas is very busy as a massive tourist attraction in Barcelona. We had been warned about pick pockets before we went, and upon walking up and down it was easy to spot the gangs who were on the look out for tourists to pick pocket with no police anywhere to be seen! We were also offered drugs every single time we walked up/down Las Ramblas. I would definitely avoid if possible, much nicer places to visit than this! ", "publishedDate": "2020-01-24", "language": "en", "rating": 3}, {"id": 740769834, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d190163-r740769834-Las_Ramblas-Barcelona_Catalonia.html", "text": "Walked around here all day taking in the atmosphere and a bit of shopping... Rained the first day so went back... put your walking shoes on as it's going to be a day out ", "publishedDate": "2020-01-23", "language": "en", "rating": 5}, {"id": 740762466, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d190163-r740762466-Las_Ramblas-Barcelona_Catalonia.html", "text": "This place has a great open market as well as several shops and stores and restaurants and such. Pretty much everything you need is right here. I copped stuff here and the guy was friendly, professional, had good weights, and even told me he would take USD, so I took his number down. Good to have a plug when you travel. ", "publishedDate": "2020-01-23", "language": "en", "rating": 5}, {"id": 740479073, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d190163-r740479073-Las_Ramblas-Barcelona_Catalonia.html", "text": "To be fair the weather was pretty vile with strong winds and rain.\nThere are a huge amount of shops and eateries all around, with little streets and alleys criss crossing everywhere.\nThere does seem to be a lot of rubbish about with overflowing bins and rubbish blowing about unfortunately helped by the strong wind.\nThere are some very good shops some high end priced but others that were not as bad.\nThere are a lot of beggars and rough sleepers wandering about, we even saw one go after two young ladies who wouldn’t give him any money and he was shouting at them then spat towards them that was disgusting.\nThere are groups of obviously immigrant males wandering about and they block some areas and shop entrances and just by doing this they are quite intimidating and oblivious to the obstruction they are causing.\nI did expect more but hopefully the rest of my stay will perhaps change my mind once the weather improves I don’t know.", "publishedDate": "2020-01-21", "language": "en", "rating": 3}, {"id": 740395831, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d190163-r740395831-Las_Ramblas-Barcelona_Catalonia.html", "text": "One ofthe main thoroughfares in the city and a \"must do\" but for this reason take care. There are both elegant and touristy shops here and also street stalls in the centre selling in the main the lower end goods like football shirts and scarves. Thereare many small and inteesting alleys going off the main drag, including the famous food hall. It pays to keep you wits about you and your bage zipped-and locked if youi can. It may not be a good idea to sit on the seats at the Place Catalunya end towards the late afternoon. Both we and two other members of our tour group did so and were approached by unsavoury looking men offering to \"deal\" in something concealed in a plastic bag. There is no obvious police presence and I would not want to be in the central section after dark though you should be safe enough on the main pavements. That being said, if normal precautions are taken and you do not advertise yourself as a gawping tourist you should be alright. A Spanish newspaper tucked under your arm is as good as the proverbial garlic!", "publishedDate": "2020-01-21", "language": "en", "rating": 4}, {"id": 740325423, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d190163-r740325423-Las_Ramblas-Barcelona_Catalonia.html", "text": "We enjoy walking Las Ramblas on every visit at least once.  Its a good walk, with central tree-lined boulevard that's pedestrian only.  Be aware of your belongings as this is known to be a spot for pick-pockets, but we've never had an issue.  We've always felt safe, and use common sense.  There are many restaurants along here, but many are geared to tourists and don't have the best food IMO.  Go off into a side street to find better, more authentic, options.  And of course, visit the Market while you're here.", "publishedDate": "2020-01-20", "language": "en", "rating": 4}, {"id": 740021882, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d190163-r740021882-Las_Ramblas-Barcelona_Catalonia.html", "text": "There's not really anything here to draw me.  The merchandise is mostly cheap junk, although there are a few artisans with better quality items.  Goods are generally overpriced.  The area is also loaded with pickpockets. Although it's an interesting place to stroll, its not worth the risk, really.  Better to wander through the Gothic Quarter or other areas where you'll find great merchandise, good prices, and wonderful coffee shops and restaurants too.", "publishedDate": "2020-01-19", "language": "en", "rating": 2}, {"id": 739967882, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d190163-r739967882-Las_Ramblas-Barcelona_Catalonia.html", "text": "While las ramblas itself is fine. We were pick pocketed and had to argue with 2 men to get a phone back. \nThere isn’t enough police about especially in the train stations and this is where most instances happen. Yes they warn you, we had all bags zipped and in view. \nWe were separated getting on the train by one while another body blocked my friend and unzipped her bag. \nNot one person intervened and nobody of authority on the train or platform. \n", "publishedDate": "2020-01-19", "language": "en", "rating": 1}, {"id": 739843909, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d190163-r739843909-Las_Ramblas-Barcelona_Catalonia.html", "text": "There is only one Last Ramblas....it is here where one must come to get that real \"feel\" of Barcelona's unique Catalonia Culture!  From Las Ramblas one will experience many aspects of what makes this city one of the world's greatest adventures! The shops, the market, the kiosks, the foods....all here and more! Just make sure sure your wallet and I'd is carefully stowed away there are skilled pickpockets in the crowds!!", "publishedDate": "2020-01-18", "language": "en", "rating": 5}, {"id": 739701560, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d190163-r739701560-Las_Ramblas-Barcelona_Catalonia.html", "text": "It was very close to our hotel and we walked up and down the boulevard a couple of times.  It's loaded with pedestrian traffic taking in the sites, shops and restaurants.  There are street performers too.  We were advised several times to guard our valuables since I here it's a pickpocket paradise.  Our favorite stop was Le Boqueria, a large public market.", "publishedDate": "2020-01-17", "language": "en", "rating": 4}, {"id": 739676761, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d190163-r739676761-Las_Ramblas-Barcelona_Catalonia.html", "text": "Definitely visit here, anything and everything for sale, can definitely barter the prices we went from 20 euros to 2 🤣 great atmosphere and plenty to see and do. Great choice for places to eat. We enjoyed walking up and down of an evening ", "publishedDate": "2020-01-17", "language": "en", "rating": 5}]}}]