[{"locationId": 9821686, "name": "Jardins de Rubió i Lluch", "placeType": "ATTRACTION", "reviewListPage": {"reviews": [{"id": 653513800, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d9821686-r653513800-Jardins_de_Rubio_i_Lluch-Barcelona_Catalonia.html", "text": "We loved the garden and we love to walk around and check everything. We will recommend this garden to any one ", "publishedDate": "2019-02-19", "language": "en", "rating": 5}, {"id": 650507357, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d9821686-r650507357-Jardins_de_Rubio_i_Lluch-Barcelona_Catalonia.html", "text": "El Jardin is a hidden gem! It has the feel of a pop up bar or maybe it even is, but at the same time it’s very classy. Would recommend ", "publishedDate": "2019-02-06", "language": "en", "rating": 4}, {"id": 641250355, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d9821686-r641250355-Jardins_de_Rubio_i_Lluch-Barcelona_Catalonia.html", "text": "After wondering around the Mercat La Boqueira and picking up a cone of Iberico Ham and Manchego, we set off done the twisting roads of the Gothic Quarter in search for a quiet place to sit.\n\nWe were nearly ready to give up when we were captivated by two beautiful arches glowing under the soft Siesta sun. Inside there were birds tweeting, children playing and otherwise it was quiet amongst this soft ambience. There were mandarin trees with fresh oranges ready to pick and the architecture of the gardens (a former hospital) was stunning. A welcome respite from the hustle and bustle all around it. \n\nWe couldn’t quite believe our luck finding Jardins de Rubió, where we enjoyed our cone and wondered further into the square where we found another hidden gem, a homely terrace cafe and tapas bar called El Jardí, where we had a Rosé and a pint of Estrella Damn!\n\nWhilst this isn’t on any of the tourist guides of Barcelona, it will absolutely remain one of our most memorable occasions. We will definitely return on our next visit to BCN.", "publishedDate": "2018-12-23", "language": "en", "rating": 5}, {"id": 609890102, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d9821686-r609890102-Jardins_de_Rubio_i_Lluch-Barcelona_Catalonia.html", "text": "This small garden is right inside Hospital de la Santa Creu. It was quiet as there were only a few visitors. I was visiting the hospital and chanced upon this simple garden. A good place to rest, relax before moving on.", "publishedDate": "2018-08-24", "language": "en", "rating": 3}, {"id": 505236165, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d9821686-r505236165-Jardins_de_Rubio_i_Lluch-Barcelona_Catalonia.html", "text": "This is a wonderful garden in the middle of the old historic Hospital that operated on site from 1400 until 1930s. It has a series of blooming plants surrounding an inner orchard of orange trees around a fountain. The whole garden is set in a Gothic cloister of the old Hospital. If you are visiting the hospital, you will see the garden and it will enhance your experience at a great El Raval sight. It is a hidden gem in Barcelona's historic center.", "publishedDate": "2017-07-24", "language": "en", "rating": 4}, {"id": 495913384, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d9821686-r495913384-Jardins_de_Rubio_i_Lluch-Barcelona_Catalonia.html", "text": "We visited here today as we had lunch close by.  It is a pretty spot, but the attraction of the architecture and the garden was marred somewhat by the sensation of not feeling safe.  There were a lot of homeless people there, either sleeping rough (they were not threatening in any way), but also congregating in small groups and these latter folk were quite aggressive via voice and body language. We did not stay long as we felt, as tourists, that we were impinging on their space (we probably were). I would have loved to have taken some photos of some of the building details, fountain etc. but felt it was inappropriate to even consider getting my camera out.", "publishedDate": "2017-06-25", "language": "en", "rating": 3}, {"id": 491778396, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d9821686-r491778396-Jardins_de_Rubio_i_Lluch-Barcelona_Catalonia.html", "text": "Beautiful orange trees, a magnificent jacaranda and medieval architecture - what else do you need? There's hardly any people there in the morning so it's a good spot to chill after breakfast. Also a perfect stop to take a little rest while you walk between la Rambla, La Boqueria (food market), MACBA (museum) etc.", "publishedDate": "2017-06-09", "language": "en", "rating": 5}, {"id": 480006038, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d9821686-r480006038-Jardins_de_Rubio_i_Lluch-Barcelona_Catalonia.html", "text": "Yet another example of beautifully arranged greenery in Barcelona - in the middle of the city, surrounded by old buildings, a perfect place to rest - can be hard to find, so make sure you will check the map before going there.", "publishedDate": "2017-04-29", "language": "en", "rating": 4}, {"id": 452789478, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d9821686-r452789478-Jardins_de_Rubio_i_Lluch-Barcelona_Catalonia.html", "text": "Jardins de Rubio i Llunch is an idyllic oasis in El Raval.\nIt is located between Carrer del Carme og Carrer de l'Hospital.\nThe oasis/garden is surrounded by Library of Catalonia, Institute of Catalan Studies and La Massna School.\nJardins de Rubio i Llunch is a wonderful place for a silent rest in El Raval.", "publishedDate": "2017-01-17", "language": "en", "rating": 4}, {"id": 423557615, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d9821686-r423557615-Jardins_de_Rubio_i_Lluch-Barcelona_Catalonia.html", "text": "It takes just a minute to walk through, but this is a pleasant place to hang out for just a little longer. You can play chess with large pieces, have a coffee in the small café or just relax a little while in the shade. It's not a major sight, but it's a nice place to include in a walk. ", "publishedDate": "2016-09-29", "language": "en", "rating": 4}, {"id": 417426102, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d9821686-r417426102-Jardins_de_Rubio_i_Lluch-Barcelona_Catalonia.html", "text": "Walking around in Raval we stumbled upon this beautiful garden, which is so hard to find. It is so peaceful and quiet, and people are just sitting and reading. Everybody seem to be enjoying the time here. Inside the garden resides the National Library of Catalunya.", "publishedDate": "2016-09-12", "language": "en", "rating": 4}, {"id": 381444568, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d9821686-r381444568-Jardins_de_Rubio_i_Lluch-Barcelona_Catalonia.html", "text": "As we were staying in a hotel on Carrer del Carme we took the opportunity to walk through this lovely little garden space.  It was actually the first place we visited on our first walk around the city and we were duly rewarded with a lovely tranquil spot to amble through on a sunny June morning on our way to Mercado de la Boqueria from Hotel Curious.", "publishedDate": "2016-06-10", "language": "en", "rating": 4}, {"id": 375864451, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d9821686-r375864451-Jardins_de_Rubio_i_Lluch-Barcelona_Catalonia.html", "text": "We were walking down Carrer de Hospital towards Las Ramblas when we saw a lovely archway in  wall on the left of the street.  It said at the side of it (in Spanish) something like Pharmacy Academy so of course we went into explore.  We were surprised to see what a big space it is through the arch. We assumed that building to the left was the Pharmacy Academy.  In the middle of the garden there are lots of white roses which were just starting to bloom and further on a beautiful water feature with orange trees.  Also in the square the Bibliotecta de Catalunya.   We were very impressed to see this lovely garden.  The exit at the other end of garden is into Carrer Carme.   If  you are in this area of Lower Raval it is worth visiting this hidden gem of a garden.  The surrounding buildings are nice too!", "publishedDate": "2016-05-23", "language": "en", "rating": 5}]}}]