[{"locationId": 2359212, "name": "Parc de Montjuic", "placeType": "ATTRACTION", "reviewListPage": {"reviews": [{"id": 757185712, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d2359212-r757185712-Parc_de_Montjuic-Barcelona_Catalonia.html", "text": "We loved the view! And I fully recommend walking up the hill which is not that tiring as we thought before. The only problem is time. You need a lot of it to see all the things this place offers and going there on the last day, having only a couple of hours, was definitely not the best idea...", "publishedDate": "2020-06-10", "language": "en", "rating": 4}, {"id": 753071898, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d2359212-r753071898-Parc_de_Montjuic-Barcelona_Catalonia.html", "text": "Beautiful park to explore and spend an afternoon.  We were on a mission to find a pair of giant slides that we had stumbled upon our last visit to Barcelona in 2010.  We had a picture from that trip our son saw and he had to find them.  It took what seemed like an eternity (playground slide in Spanish is tobogan, btw), but we found them.  Our son immediately wiped out, they're very steep!!  Still a fun day with just a few bruises.", "publishedDate": "2020-05-01", "language": "en", "rating": 5}, {"id": 751939102, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d2359212-r751939102-Parc_de_Montjuic-Barcelona_Catalonia.html", "text": "Venetian Towers, Palau Nacional, Magic Fountain are the highlights here.  Located next to the Olympic Stadium.  Metro stop Espanya, L1 Red, L3 Green, L8 Dark Blue lines", "publishedDate": "2020-03-28", "language": "en", "rating": 4}, {"id": 751290433, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d2359212-r751290433-Parc_de_Montjuic-Barcelona_Catalonia.html", "text": "This parc is is a beautiful piece of architecture, viev and  gardens. Take the local bus or a good walk up to the mountain in the afternoon. You will get a marwellous view and sunset over Barcelona when you are here.\nStrongly recommend everyone to see this house when you are in Barcelona!", "publishedDate": "2020-03-18", "language": "en", "rating": 5}, {"id": 751117629, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d2359212-r751117629-Parc_de_Montjuic-Barcelona_Catalonia.html", "text": "We got the cable car from the underground station, so it isn't a cable car, it is an underground, that was the normal price. But when you get off and get on the cable car it is Barcelona prices, so we walked up. The gardens just up the road on the left are nice to walk through, you then go through a car park, but only cutting across it. When you get to the top it is worth going into the castle because you get above the trees and have a great view of the city and the port. There is also a nice little cafe, but it takes a while to get served, so send someone in as soon as you get a table.\nOverall a nice break from the bustle of the city.", "publishedDate": "2020-03-16", "language": "en", "rating": 4}, {"id": 750623657, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d2359212-r750623657-Parc_de_Montjuic-Barcelona_Catalonia.html", "text": "Besides the palace and palace gardens, there are many parks that are worth visiting. Take minimally half a day to see the most you can!", "publishedDate": "2020-03-12", "language": "en", "rating": 5}, {"id": 750586863, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d2359212-r750586863-Parc_de_Montjuic-Barcelona_Catalonia.html", "text": "A very interesting place to see, lovely gardens also very interesting building designs. It must be very busy in the summer, best to tickets online in advance.", "publishedDate": "2020-03-12", "language": "en", "rating": 4}, {"id": 750135287, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d2359212-r750135287-Parc_de_Montjuic-Barcelona_Catalonia.html", "text": "Hard climb up. But great views from the very top. Cable car, funicular and then onto the metro. All in quick succession to get back down.", "publishedDate": "2020-03-09", "language": "en", "rating": 5}, {"id": 747798047, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d2359212-r747798047-Parc_de_Montjuic-Barcelona_Catalonia.html", "text": "Wonderful to fill in a few hours just taking in the good weather and the nature, whilst we walked a 3 month old in pram !", "publishedDate": "2020-02-26", "language": "en", "rating": 4}, {"id": 747264448, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d2359212-r747264448-Parc_de_Montjuic-Barcelona_Catalonia.html", "text": "The park has so much that you will truly need to spend an entire day. We took our time and did it in two days. There are two Cable cars, we took the Port Cable Car and it drops you off near Hotel Miramar. There is a cafe as you get off and it is fun to have a drink and spend half an hour enjoying the view. \n\nThe other Cable car you can get to using the funicular. It was closed during the time we were there. You could take this one going up to Montjuic and the Port Cable Car going down. \n\nThere is so much to see that you really should plan your time and not rush it. Museu Nacional d'Art de Catalunya is a must see.", "publishedDate": "2020-02-24", "language": "en", "rating": 5}, {"id": 747108393, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d2359212-r747108393-Parc_de_Montjuic-Barcelona_Catalonia.html", "text": "The Palace at the top has stunning views of the city.  Not much up there.  But there is a coffee shop which has lovely food.  There are some gardens but don't bother buying the tickets it is quite a walk away down the hill and directions are not clear.  We ended up missing them.  However we did walk down to Olymic Stadium which is good to walk around and the grounds are nice too.  This is where the Magic Fountain is but the water was turned off so very disappointing.\nWe took the Open top bus to the cable car then took the cable car up to the top.  Views are stunning.", "publishedDate": "2020-02-23", "language": "en", "rating": 4}, {"id": 746845126, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d2359212-r746845126-Parc_de_Montjuic-Barcelona_Catalonia.html", "text": "Nice area to walk around and to get some great views of the city, not to mention an opportunity to walk around the Olympic area from 1992. Great museum, with an energetic area in front of it, and the Olympic area is quiet and all but empty.\nWell worth a visit.", "publishedDate": "2020-02-22", "language": "en", "rating": 4}, {"id": 746524586, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d2359212-r746524586-Parc_de_Montjuic-Barcelona_Catalonia.html", "text": "So much to see and do here from ther grand entrance on Plaza Espanya up to the huge building at the top of the hill with domes, turrets etc and an unbeatable view of Barcelona. Just behind lies the 1992 Olympic Stadium", "publishedDate": "2020-02-21", "language": "en", "rating": 5}, {"id": 743503466, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d2359212-r743503466-Parc_de_Montjuic-Barcelona_Catalonia.html", "text": "Lovely peaceful park overlooking Barcelona. The architectural aspects are beautiful as are the views over the city. ", "publishedDate": "2020-02-06", "language": "en", "rating": 5}, {"id": 743022861, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d2359212-r743022861-Parc_de_Montjuic-Barcelona_Catalonia.html", "text": "The ticket is 5 euro just for the castle or you can get tickets for the castle and the botanic gardens for 7 euro (prices for January). We got the tickets only for the castle as the botanic gardens are 25 min away and we were very tired. The castle is nice, like all other castles. Impressive view over Barcelona. There is a small coffee shop inside the castle were you can sit and enjoy the sunshine. I'm sure the surroundings and the castle look much nicer in the spring or summer, but they were ok in January too.", "publishedDate": "2020-02-04", "language": "en", "rating": 4}, {"id": 741569098, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d2359212-r741569098-Parc_de_Montjuic-Barcelona_Catalonia.html", "text": "Very pleasant and enjoyable afternoon,  with nice views of Barcelona.  First Sunday of the month has free admission!", "publishedDate": "2020-01-27", "language": "en", "rating": 4}, {"id": 741498196, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d2359212-r741498196-Parc_de_Montjuic-Barcelona_Catalonia.html", "text": "This is one of the best places to visit in Barcelona. My favourite areas are close to the Greek amphitheater or around Laribal Garden. It's just very beautiful area with a lot to see. You can easily spend a whole day exploring it.", "publishedDate": "2020-01-27", "language": "en", "rating": 5}, {"id": 740408280, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d2359212-r740408280-Parc_de_Montjuic-Barcelona_Catalonia.html", "text": "Montjuic Hill overlooking Barcelona offers a superb panoramic view over the city and a range of attractions which makes it a full day destination, including the National Art gallery and th 1992 Olympic stadium nearby. More air and breze up here on very hot summer days when the city itself can be oppressive.", "publishedDate": "2020-01-21", "language": "en", "rating": 5}, {"id": 740389303, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d2359212-r740389303-Parc_de_Montjuic-Barcelona_Catalonia.html", "text": "Went to use the cable car and took a left turn instead of a right turn at the bottom only to find ourselves in this stunning park. views are awesome. just got to the actual building which closed as we arrived. but the views are awesome. and we wondered down the many many steps to the bottom always looking back to see the different views. a must see & do spot whilst your in Barcelona. and it's FREE ", "publishedDate": "2020-01-21", "language": "en", "rating": 5}, {"id": 740131520, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d2359212-r740131520-Parc_de_Montjuic-Barcelona_Catalonia.html", "text": "We walked all the way up to the art museum and turned around to look back at the city and the fountains. We took the cable car to the top to see an even better view of the city and harbor. We went past the buildings used in the Olympic Games in 1992. We could see the big cruise ships in the harbor too. It was all really interesting and the long walk up the hill gave us a good workout! ", "publishedDate": "2020-01-19", "language": "en", "rating": 4}, {"id": 738525562, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d2359212-r738525562-Parc_de_Montjuic-Barcelona_Catalonia.html", "text": "Again, this activity offers a panoramic view of Barcelona. Nice smooth ride to the top. Going with a tour guide, this activity will be attached to other sights.", "publishedDate": "2020-01-11", "language": "en", "rating": 4}, {"id": 738474381, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d2359212-r738474381-Parc_de_Montjuic-Barcelona_Catalonia.html", "text": "This hill can be visited by metro or bus. But if you take the the metro, you have to again take a cable car or a bus from there to reach the castle.\nView of the Mediterranean sea & the city of Barcelona from the castle is eye catching! Especially the walk round the castle was great. Visiting inside the fort is a personal choice, which I did not prioritise.\nThe Olympic sports arenas add to the memorable tour of the Montjuic.!", "publishedDate": "2020-01-11", "language": "en", "rating": 4}, {"id": 738114585, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d2359212-r738114585-Parc_de_Montjuic-Barcelona_Catalonia.html", "text": "This area hosted the 1992 Olympic games in Barcelona. The park is huge with a lot of steps with many sports facilities built around it. However it is not very well lighted and lacks maintenance.", "publishedDate": "2020-01-09", "language": "en", "rating": 3}, {"id": 736990984, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d2359212-r736990984-Parc_de_Montjuic-Barcelona_Catalonia.html", "text": "This is one of the most popular places to visit is Barcelona. Some nights they put on a show with the fountain playing with music. Huge fountains, and you can walk up to the museum at the top we’re they have additional fountains. Great place to take some awesome photos while spending a few hours here. The metro is only about 1 block away so getting to and from is very easy. ", "publishedDate": "2020-01-05", "language": "en", "rating": 5}, {"id": 736275930, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d2359212-r736275930-Parc_de_Montjuic-Barcelona_Catalonia.html", "text": "Not eaven a castle there. Only ruins. If you do not climb with telecabine (wicb is very expensive) you will be extenuated.\nNot much to see in the castle. Only the view.", "publishedDate": "2020-01-02", "language": "en", "rating": 2}, {"id": 734913297, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d2359212-r734913297-Parc_de_Montjuic-Barcelona_Catalonia.html", "text": "Some great view and lovely walks in this area which doesn't seem to attract the crowds. Great fun on the cable cars both on Montjuic and also, if you are brave, across the harbour too", "publishedDate": "2019-12-27", "language": "en", "rating": 4}, {"id": 734093712, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d2359212-r734093712-Parc_de_Montjuic-Barcelona_Catalonia.html", "text": "A very nice Barcelona´s view if you go up along the Montjuic Cable Car (Teleferic); and then you walk down through Mirador´s & Verdaguer´s Garden. A nice walking experience !", "publishedDate": "2019-12-22", "language": "en", "rating": 5}, {"id": 733778566, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d2359212-r733778566-Parc_de_Montjuic-Barcelona_Catalonia.html", "text": "the Mount of Jesus is called Montjuic, It has a very beautiful fort on the hilltop, which can be reached by a cable car. It offers stunning view of the whole city, its port and the fishing harbour, its airport etc from the top. ", "publishedDate": "2019-12-20", "language": "en", "rating": 4}, {"id": 733700984, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d2359212-r733700984-Parc_de_Montjuic-Barcelona_Catalonia.html", "text": "A tranquil and peaceful place to walk around in everytime of the day. Love the panorama view of the city from Monjuic park.", "publishedDate": "2019-12-19", "language": "en", "rating": 5}, {"id": 733645035, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d2359212-r733645035-Parc_de_Montjuic-Barcelona_Catalonia.html", "text": "Arrived from metro transfer to the teleferic fernicular railway.  The views from the top of the whole of Barcelona were wonderful.  Can visit Olympic park and fountains.  Bought a return ticket and took the cable car to the Castle which was great fun and quite a long ride.  Walked down hill to a cafe with terrace overlooking Barcelona, then took the Transbordador aerial car across the port area to the beach, again, great views and a fun way to travel.", "publishedDate": "2019-12-19", "language": "en", "rating": 4}, {"id": 733249537, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d2359212-r733249537-Parc_de_Montjuic-Barcelona_Catalonia.html", "text": "This was not the afternoon event that I thought we had, and decided to take a chance on the combination of Cable Car, and hike to the castle area. It was spectacularly panoramic, both the car ride, which was a lot of fun, but also the hike  afterwards on a warm sunny day.", "publishedDate": "2019-12-17", "language": "en", "rating": 5}, {"id": 733034180, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d2359212-r733034180-Parc_de_Montjuic-Barcelona_Catalonia.html", "text": "We wandered our first morning in Barcelona a found this park, enjoyed seeing lots of dogs walking their owners and loved the views of the city from here.", "publishedDate": "2019-12-16", "language": "en", "rating": 5}, {"id": 732691335, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d2359212-r732691335-Parc_de_Montjuic-Barcelona_Catalonia.html", "text": "The fountains of Montjuic are amazing and a Bar elona tradition. I never get tired of watching them and sharing them with family and friends.", "publishedDate": "2019-12-14", "language": "en", "rating": 5}, {"id": 731969855, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d2359212-r731969855-Parc_de_Montjuic-Barcelona_Catalonia.html", "text": "Very beautiful park with a great view of the city. Easy access with the teleferic and the funicullar. I didn't like the fact that you have to pay to enter the castle. Fortunately we had visited the place 9 years ago, when it was FREE!", "publishedDate": "2019-12-10", "language": "en", "rating": 4}, {"id": 731664009, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d2359212-r731664009-Parc_de_Montjuic-Barcelona_Catalonia.html", "text": "We had a tour and they drove us up to Montjuic, showed us old olympic sites that are still being used. Great views of the city from on top.", "publishedDate": "2019-12-09", "language": "en", "rating": 4}, {"id": 731039524, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d2359212-r731039524-Parc_de_Montjuic-Barcelona_Catalonia.html", "text": "We were here in November on a very windy day. The place is nice to stroll and the view is pretty, but, honestly, I’ve seen much better. There was a cute cafe with the view on Barcelona but we didn’t stay because of the extreme wind. It was convenient for us to visit this point of view because our next stop was the Miró museum. Otherwise, I wouldn’t make a special stop. ", "publishedDate": "2019-12-06", "language": "en", "rating": 4}, {"id": 730920332, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d2359212-r730920332-Parc_de_Montjuic-Barcelona_Catalonia.html", "text": "Montjuïc Castle is an old military fortress from 1640, built on top of Montjuïc hill in Barcelona. Views are spectacular.", "publishedDate": "2019-12-05", "language": "en", "rating": 5}, {"id": 730879879, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d2359212-r730879879-Parc_de_Montjuic-Barcelona_Catalonia.html", "text": "This is another must see for Barcelona. The water is lit up in different colors and moves to the beat of very tasteful music selections.", "publishedDate": "2019-12-05", "language": "en", "rating": 4}, {"id": 730874332, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d2359212-r730874332-Parc_de_Montjuic-Barcelona_Catalonia.html", "text": "This is the area that surrounds the Castle. It is really maintained and has historical weaponry like canons as well as beautiful gardens. You could easily spend a half hour to an hour just on the grounds of the castle. When we were there we also saw archers practicing. This is also the area outside the castle where the cable car drops off.", "publishedDate": "2019-12-05", "language": "en", "rating": 5}, {"id": 730517678, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d2359212-r730517678-Parc_de_Montjuic-Barcelona_Catalonia.html", "text": "We took the skylift up to get a panoramic high level view of the city and then walked down and explored all of the little niches and flowers. Simply lovely and if you are staying nearby they are great trails for running or hiking. ", "publishedDate": "2019-12-03", "language": "en", "rating": 5}, {"id": 730116352, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d2359212-r730116352-Parc_de_Montjuic-Barcelona_Catalonia.html", "text": "I had no plans to go here as I am afraid of heights so did not want to take the cable car up. However, when I saw it would be just my family of 6 going in one car, I reconsidered! I just kept my eyes closed most of the time. The cable car did not sway, and the ride was about 5 minutes long. When we got to the fort, I saw taxis pulling up the driveway, and I think there is a bus that runs here. \nThere is  good movie that you can watch at the entrance, and also a museum which explains the history. There is a cafe with sandwiches, drinks and ice cream. \nThe views from the fort are quite impressive...city, ocean, port with ships, etc. It's an enormous fort! There were 3,000 soldiers living here, so you can imagine the size. There are 3 levels, so if you are short on time, just go to the top level right away for the best views. \nThere are other things to see up on Monjuic but we did not have time to see anything else. You could easily spend a whole day up there. We spent about 90 mins at the fort itself. The ride to and from adds a bit also. (You have to take the funicular to get to the cable car station, then ride the cable car to the fort). ", "publishedDate": "2019-12-01", "language": "en", "rating": 4}, {"id": 729983718, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d2359212-r729983718-Parc_de_Montjuic-Barcelona_Catalonia.html", "text": "Walked up the hill which I guess is the park. Various small parks, botanical gardens, museums, art galleries, great viewpoints and the Olympic stadium. Has some of the best views of the city at various different locations in the park. Really enjoyed visiting here just taking our time to stroll around enjoying the great January weather and all the park has to offer. Stopped at the top to eat a spot of lunch we had bought from a bakery on the way up.", "publishedDate": "2019-12-01", "language": "en", "rating": 4}, {"id": 729719710, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d2359212-r729719710-Parc_de_Montjuic-Barcelona_Catalonia.html", "text": "There is much to see and do at this park, including viewing the Olympic stadium, other parts of the Barcelona Olympic Games venue, having a ride on a funicular railway, great views of the city from the elevated location, and more.", "publishedDate": "2019-11-29", "language": "en", "rating": 5}, {"id": 729210742, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d2359212-r729210742-Parc_de_Montjuic-Barcelona_Catalonia.html", "text": "There is not enough information on the tourists guides about this place! Easy to reach even if you don´t like to use the steps, they have escalators!!! It is well maintained, wonderfull viewpoints and it was the sight of the olympic games. Do not miss a visit here.", "publishedDate": "2019-11-27", "language": "en", "rating": 5}, {"id": 729049192, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d2359212-r729049192-Parc_de_Montjuic-Barcelona_Catalonia.html", "text": "This place was also one of the most beautiful areas I have ever seen. You really can’t miss this if you are in Barcelona", "publishedDate": "2019-11-26", "language": "en", "rating": 5}, {"id": 728868018, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d2359212-r728868018-Parc_de_Montjuic-Barcelona_Catalonia.html", "text": "This is easy to get to. We got great views over the city showing off how tall the cathedrals are compared to other buildings. Its worth to spend the extra five Euros to tour the old fort as it offers even better views over the city.", "publishedDate": "2019-11-25", "language": "en", "rating": 5}, {"id": 728780376, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d2359212-r728780376-Parc_de_Montjuic-Barcelona_Catalonia.html", "text": "Great funicular and cable car rides to get to the Parc. We went to the fortress which is amazing and the views of Barcelona and the Mediterranean are amazing.", "publishedDate": "2019-11-25", "language": "en", "rating": 5}, {"id": 728239218, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d2359212-r728239218-Parc_de_Montjuic-Barcelona_Catalonia.html", "text": "A huge park, fantastic for a walk. Remember to get some energy before walking up the hill, it can be quite steady. ", "publishedDate": "2019-11-22", "language": "en", "rating": 5}, {"id": 727795711, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d2359212-r727795711-Parc_de_Montjuic-Barcelona_Catalonia.html", "text": "This park is full of surprises from music hall to museums and palace.\nyou will enjoy the views that are fantastic.\ndo have good choose and great ready to climb stairs but worth it for sure.", "publishedDate": "2019-11-20", "language": "en", "rating": 5}, {"id": 726448049, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d2359212-r726448049-Parc_de_Montjuic-Barcelona_Catalonia.html", "text": "This historic fort is not liked by the locals but very populal with tour groups just like ours. The tour guide gave a great  over view of this place and the role it played over the centuries. It certainly defended the city and when you tour it will certainly get a feel on the role it played in Spainish history. Toured the old jail cells and has a mesuem insiide the fort. Food and coffee is available in their cafe with outside eating. Since I love history this is a must see for history loves just like myself. It will not disappoint you if you take the time to tour this whole site!", "publishedDate": "2019-11-14", "language": "en", "rating": 4}, {"id": 726358390, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d2359212-r726358390-Parc_de_Montjuic-Barcelona_Catalonia.html", "text": "We saw the whole complex on a small tour bus with a great \"backdrop\" presented about its history of hosting the International Exhibition and the 1992 Olympics. Barcelona was ingenuous to use its many beautiful structures for museums etc. However, it covers a huge expanse of space, so it's worth a visit if you review all of the opportunities and choose what you would most like to see.", "publishedDate": "2019-11-14", "language": "en", "rating": 5}, {"id": 725968199, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d2359212-r725968199-Parc_de_Montjuic-Barcelona_Catalonia.html", "text": "Before setting out take a look at the map and choose the sights you want to see. There is so much to see that you need a lot of time and still need to choose. Good for families, art lovers, history fans, and sports fans. Every stop of the bus there is a sight to visit.", "publishedDate": "2019-11-12", "language": "en", "rating": 5}, {"id": 725607190, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d2359212-r725607190-Parc_de_Montjuic-Barcelona_Catalonia.html", "text": "i thought as it was little dull that day my photos,wife loved it took many many tphotos and the building was fantastic to look at and experience , worth a look we did it via hop on hop off rewirew to follow not a good company .", "publishedDate": "2019-11-11", "language": "en", "rating": 3}, {"id": 725358104, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d2359212-r725358104-Parc_de_Montjuic-Barcelona_Catalonia.html", "text": "Wherher walking, biking, using the efficient transport system, this area offers a wonderful perspective of this great city - the castle, the Olympic site, the walk down to Plaza Espanya, a meal at Martinez are just a few of the main activities.....best to route plan well, decide how you will get up there (taxi, funicular from Para-lel, bike which is hard work, walk via Plaza Espana also a little steep, bus.....). The views up here are spectacular and this is a lovely way to spend a few hours either as a family, couple or alone and get a real feel for the city with views of the key landmarks all around you.", "publishedDate": "2019-11-10", "language": "en", "rating": 5}, {"id": 725005465, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d2359212-r725005465-Parc_de_Montjuic-Barcelona_Catalonia.html", "text": "We started with the magic fountains, unfortunately during the day - 10 am, there was no water. Continued with the Olimyc stadium and surroundings - we liked that a lot. Managed to reach the castle - the view is astonishing. E5 admission. The cable car is expensive. If you are on a budget - not worth it unless you want to see Barcelona from a different point.", "publishedDate": "2019-11-08", "language": "en", "rating": 4}, {"id": 725001241, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d2359212-r725001241-Parc_de_Montjuic-Barcelona_Catalonia.html", "text": "This is a mere walk from the Gothic Quarter or the oceanfront area of Barcelona. Site of the Olympic swimmong pools and stadiums from the 1992 games. Once up top you will have amazing views of Barcelona.", "publishedDate": "2019-11-08", "language": "en", "rating": 5}, {"id": 724994801, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d2359212-r724994801-Parc_de_Montjuic-Barcelona_Catalonia.html", "text": "The stop at Montjuic Hill was part of a Panoramic tour&shopping I booked with MSC Excursions.\nThe hill is situated near the city center and offers a stunning image of the city and the harbor.\nWe stopped at the Museum of art of Catalunya and enjoyed the walk in the beautiful park.\nWe had an excellent guide who familiarized us with the rich history of the place.", "publishedDate": "2019-11-08", "language": "en", "rating": 5}, {"id": 724986109, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d2359212-r724986109-Parc_de_Montjuic-Barcelona_Catalonia.html", "text": "i got recommended by a couple of people to visit this park for the cable car, little did i know how much was here aside from that! the palace is beautiful, we sadly missed the magic fountain light show as it clashed with our flight, but it was lovely to sit by and have an ice cream in the daytime. the cable car was definitely worth the price, and the views were stunning! we were really expecting to be crammed into a pod with several other people just to keep the queues short, however we got a pod to just the two of us and it seemed many other pods only had 2-4 people in - so if this is a concern of yours, don't worry!", "publishedDate": "2019-11-08", "language": "en", "rating": 4}, {"id": 724437438, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d2359212-r724437438-Parc_de_Montjuic-Barcelona_Catalonia.html", "text": "The Olympics village with individuals practicing sports still. Fantastic view of the city, port & turquoise water. You can spend hours here and the cable car adds to more views of the city. One way is expensive (8.5€), Careful what you wish for! ", "publishedDate": "2019-11-06", "language": "en", "rating": 5}, {"id": 724223308, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d2359212-r724223308-Parc_de_Montjuic-Barcelona_Catalonia.html", "text": "This park is enormous, hence to say we did not see it all.  You could visit different parts on different days if you wanted.  We took the funicular up and bought tickets to Montjuic castle, which was worth it alone for the views of the port and Barcelona in general.  We then caught the funicular back down, and walked along to the Barcelona Olympic stadium (free) and visited the Olympic museum (fee).  All in all an interesting half day spent in the park.", "publishedDate": "2019-11-05", "language": "en", "rating": 4}, {"id": 723489236, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d2359212-r723489236-Parc_de_Montjuic-Barcelona_Catalonia.html", "text": "Not bad for a half day visit. Not a lot to see but a super walk. Not expensive so for a afternoon, worth a visit.", "publishedDate": "2019-11-03", "language": "en", "rating": 4}, {"id": 722841804, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d2359212-r722841804-Parc_de_Montjuic-Barcelona_Catalonia.html", "text": "Very large and green - and steep. Has the great Miro museum and the surprisingly good Catalonia art museum - in the amazing huge palace. ", "publishedDate": "2019-10-31", "language": "en", "rating": 4}, {"id": 722038556, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d2359212-r722038556-Parc_de_Montjuic-Barcelona_Catalonia.html", "text": "We took the cable car from the coast (Teleferica) to Montjuïc. Once there we got some ice creams from the plaza in front of the Miramar hotel and then explored the park. It’s a lovely spot for a stroll. As a tip I would come here for an early morning walk and then take the cable car back to the coast. Rather than the way we did it.", "publishedDate": "2019-10-28", "language": "en", "rating": 4}, {"id": 721779302, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d2359212-r721779302-Parc_de_Montjuic-Barcelona_Catalonia.html", "text": "Even without paying extra to go inside the castle grounds, it’s a lovely walk through the park and outside the castle walls.\nThe cable cars look busy, but the queue moves at a reasonable rate.", "publishedDate": "2019-10-27", "language": "en", "rating": 4}, {"id": 721778790, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d2359212-r721778790-Parc_de_Montjuic-Barcelona_Catalonia.html", "text": "This whole area is on a hill overlooking the city.  Lots to see there too.  Olympics. Museum and the castle. ", "publishedDate": "2019-10-27", "language": "en", "rating": 4}, {"id": 721269529, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d2359212-r721269529-Parc_de_Montjuic-Barcelona_Catalonia.html", "text": "Well, the magic fountain show is here only. This hilltop neighborhood is on the site of an old Jewish cemetery, explaining its name, \"Mont Juïc,\" which translates to \"Mountain of the Jews.\" Standing 213 meters above the sea, the hillside is crowned by a fortress on its top and slopes steeply down to the Mediterranean.\n\nThis scenic area of the city is known for its beautiful natural park with great views and superb museums. The National Art Museum of Catalonia is there having a collection of sculptures, paintings, drawings, engravings, and photography. View from the top is absolutely great. Panoramic views of both the city and the Mediterranean. \n\nI Was there at night so I did not get much chance to explore. I enjoyed the light show, strolled around a bit and called it a day. \n\nNote: if you have even the slightest interest in history, make sure to add Montjuic Castle to your Barcelona itinerary. Montjuic Castle at the hilltop ended up defending the city from many attacks in the past, including those carried out during the War of the Spanish Succession. It also served as a prison during the War of the Pyrenees and was occupied by Napoleon’s troops in the early 1800s.", "publishedDate": "2019-10-25", "language": "en", "rating": 4}, {"id": 721202500, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d2359212-r721202500-Parc_de_Montjuic-Barcelona_Catalonia.html", "text": "We didn't realise that there were two different cable cars - we did the lower one, but realised afterwards there was another one which took you right up to the top. But the cable car over the sea gave us amazing views of the port and the mountains. ", "publishedDate": "2019-10-25", "language": "en", "rating": 4}, {"id": 720536670, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d2359212-r720536670-Parc_de_Montjuic-Barcelona_Catalonia.html", "text": "Go to the top via the funicular then the cable car!   Had a great meal at the fort!  And the view can't be beat!", "publishedDate": "2019-10-22", "language": "en", "rating": 5}, {"id": 720527186, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d2359212-r720527186-Parc_de_Montjuic-Barcelona_Catalonia.html", "text": "Climb up and Take Tram Down!\nTake a tour of the fort, it's well worth it.\nViews from the top are stunning.  The tram ride down gives you the chance to really take it all in.", "publishedDate": "2019-10-22", "language": "en", "rating": 5}, {"id": 720274910, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d2359212-r720274910-Parc_de_Montjuic-Barcelona_Catalonia.html", "text": "Spend a day hiking down this mountain from the fort!  Don't miss the Joan Miro museum and the cat restaurant!", "publishedDate": "2019-10-21", "language": "en", "rating": 5}, {"id": 719956170, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d2359212-r719956170-Parc_de_Montjuic-Barcelona_Catalonia.html", "text": "I enjoy walking and the gardens make the walk up to the castle really enjoyable.\nThey aren't looking their best now though and lots of areas could do with a bit of tlc!\nIt's still really nice and most go up by cable car or bus so it's been pretty quiet when we've walked up. ", "publishedDate": "2019-10-20", "language": "en", "rating": 4}, {"id": 719674647, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d2359212-r719674647-Parc_de_Montjuic-Barcelona_Catalonia.html", "text": "We were hosting a dinner in the pueblo village and were dropped off outside the park.  Pretty impressive. Lots of steps and also escalators. Haven’t got a clue what you can see inside, but would return to find out as it looks amazing!", "publishedDate": "2019-10-19", "language": "en", "rating": 4}, {"id": 719624574, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d2359212-r719624574-Parc_de_Montjuic-Barcelona_Catalonia.html", "text": "We followed Rick Steves guide and took the funicular up and strolled down to the museum and park.  This way, we walked mostly down hill.  Great views of Barcelona.", "publishedDate": "2019-10-19", "language": "en", "rating": 4}, {"id": 719409134, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d2359212-r719409134-Parc_de_Montjuic-Barcelona_Catalonia.html", "text": "Spent some time here. Beautiful parc. Great photo ops. Nice little bars for a quick drink. Bring your camera", "publishedDate": "2019-10-18", "language": "en", "rating": 5}, {"id": 718922481, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d2359212-r718922481-Parc_de_Montjuic-Barcelona_Catalonia.html", "text": "We had a glorious sunny day and the views were amazing. Our tour guide Ramon had a lot of energy and interest in the area, which he shared with us. Definitely a delightful place to visit.", "publishedDate": "2019-10-16", "language": "en", "rating": 5}, {"id": 718887048, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d2359212-r718887048-Parc_de_Montjuic-Barcelona_Catalonia.html", "text": "With the ''underground'' you can reach Park de Montjuic. It is a nice area for a walk and there is a lot of green. Also the Olympic Park is located in this park. While walking down you will also pass Magic Fountains. Really beautiful!", "publishedDate": "2019-10-16", "language": "en", "rating": 5}, {"id": 718611428, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d2359212-r718611428-Parc_de_Montjuic-Barcelona_Catalonia.html", "text": "If you get a chance, do go up to the top of the park, well worth the time for a gorgeous view over the whole city.", "publishedDate": "2019-10-15", "language": "en", "rating": 5}, {"id": 717609907, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d2359212-r717609907-Parc_de_Montjuic-Barcelona_Catalonia.html", "text": "Visit the place where the 1992 Olympics were held, and watch the views of the city below.  A must see when you visit Barcelona.", "publishedDate": "2019-10-12", "language": "en", "rating": 5}, {"id": 717233009, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d2359212-r717233009-Parc_de_Montjuic-Barcelona_Catalonia.html", "text": "This is my second visit to the vast Montjuic Park.  This time around the tour brought us to the front of the National Museum of Catalunya. The elevated view from the steps of the museum to the Placa de Espanya on ground level is  simply amazing.  \n\nNearest to see is the Plaça de les Cascades.  Next  comes Plaça de Josep Puig i Cadafalch where the Four Columns (\"Les Quatre Columnes\") are located. The four Ionic columns symbolize the four stripes of the Catalan senyera, and they were intended to become one of the main icons of Catalanism. \n\nFollowing this is Font Màgica de Montjuïc-The Magic Fountain of Montjuïc. The final landmark on street level are the Torres Venecianes- the pair of Venitian inspired towers before the Placa de Espanya roundabout.", "publishedDate": "2019-10-11", "language": "en", "rating": 5}, {"id": 716830347, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d2359212-r716830347-Parc_de_Montjuic-Barcelona_Catalonia.html", "text": "Went all the way up and down and around by foot. Great walk, great view, very nice. Take a moment to read about the history of the name.", "publishedDate": "2019-10-09", "language": "en", "rating": 5}, {"id": 716766846, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d2359212-r716766846-Parc_de_Montjuic-Barcelona_Catalonia.html", "text": "We had a lovely visit,  riding the cable car to get to the castle. \nWe spent a while looking out at the amazing views over Barcelona and the port. There were 2 cruise ships in the port which was really nice to see.\nThe castle was inexpensive and worth a visit, mainly for more views.", "publishedDate": "2019-10-09", "language": "en", "rating": 4}, {"id": 716549392, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d2359212-r716549392-Parc_de_Montjuic-Barcelona_Catalonia.html", "text": "We visited Parc de Montjuic during our hop on hop off bus tour. It was a very enjoyable stop with a cable car, great views over the port, lovely gardens and an interesting castle. Highly recommended.", "publishedDate": "2019-10-08", "language": "en", "rating": 5}, {"id": 716064784, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d2359212-r716064784-Parc_de_Montjuic-Barcelona_Catalonia.html", "text": "We rode the train to the end of the line up the hill.  Quite a fun experience.  At the top we headed right toward the Olympic stadium which was cool.  We did meander along some pretty park paths along the way but I think we missed most of the park by going that way.  I'd suggest turning left if you want more park walking.", "publishedDate": "2019-10-07", "language": "en", "rating": 4}, {"id": 715835478, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d2359212-r715835478-Parc_de_Montjuic-Barcelona_Catalonia.html", "text": "Park Montjuic is wonderful and gives you the opportunity to better understand Barcelona's history from its early beginnings, providing great views of the city from the scenic points. ", "publishedDate": "2019-10-06", "language": "en", "rating": 5}, {"id": 715548116, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d2359212-r715548116-Parc_de_Montjuic-Barcelona_Catalonia.html", "text": "A nice bus ride through the park to the castle on top with stunning views of the city below. A nice break from the busy city.\n", "publishedDate": "2019-10-05", "language": "en", "rating": 5}, {"id": 715070111, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d2359212-r715070111-Parc_de_Montjuic-Barcelona_Catalonia.html", "text": "This is not one specific place but a large region filled with parks on a large hill. It's better to walk up and explore the parks than to pay for the expensive and busy cable car. We found love music, some nice gardens and some live musicians walking down from the fort at the top", "publishedDate": "2019-10-03", "language": "en", "rating": 5}, {"id": 714536791, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d2359212-r714536791-Parc_de_Montjuic-Barcelona_Catalonia.html", "text": "The Parc de Montjuic was our first stop after checking into our hotel in Barcelona. The history is very interesting, wonderful gardens and the view of the city is fabulous.  Even riding up in the cable cars was fun.  ", "publishedDate": "2019-10-01", "language": "en", "rating": 4}, {"id": 713471024, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d2359212-r713471024-Parc_de_Montjuic-Barcelona_Catalonia.html", "text": "Completely awful experience. The railway was completely forgettable. Would recommend getting the bus - much more reliable.", "publishedDate": "2019-09-27", "language": "en", "rating": 1}, {"id": 713172254, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d2359212-r713172254-Parc_de_Montjuic-Barcelona_Catalonia.html", "text": "We took the funicular from Paral lel ( very short unfinished looking ride up to the cable car station. The ride up to the top ( unusual right angle bend half way up!) is quite spectacular, and if not too busy you can have a gondola to yourself! Some lovely views across the city and the port - a bit pricey though!\nThe citadel is what it says it is : massive but nothing inside , but some good views across the harbour. Nicely laid out gardens in the former most.", "publishedDate": "2019-09-26", "language": "en", "rating": 3}, {"id": 713137774, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d2359212-r713137774-Parc_de_Montjuic-Barcelona_Catalonia.html", "text": "There is a lot to see in this vast hillside park.  We got the Metro to Paral-lel and then the funicular up the hill.  The funicular is accessed visa the Metro station and is actually in a tunnel.  We did Joan Miro, Museu National art Catalunya and Greek theatre.  \n\nThere are numerous gardens and trails to walk.  You can also get a bus here.", "publishedDate": "2019-09-26", "language": "en", "rating": 5}, {"id": 712681028, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d2359212-r712681028-Parc_de_Montjuic-Barcelona_Catalonia.html", "text": "No money? No problem! Just go to this park and enjoy the free view. It is really amazing and there’s a lot to see. You can also use the cable car/gondola. It is realy great no matter if you’re alone or with the family!", "publishedDate": "2019-09-24", "language": "en", "rating": 5}, {"id": 712063094, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d2359212-r712063094-Parc_de_Montjuic-Barcelona_Catalonia.html", "text": "We took public transportation ( metro, funicular and then bus) to get to top of mountain. Then walked down, winding through beautiful parks, past museums and finally ending up at fountains. Stopped along the way at little cafe kiosk and had a delicious sandwich and salad. A lovely day. Wonderful views of city.", "publishedDate": "2019-09-22", "language": "en", "rating": 5}, {"id": 711989709, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d2359212-r711989709-Parc_de_Montjuic-Barcelona_Catalonia.html", "text": "This was a brief stop on our way to other attractions.  I was told that we were less than 300 ft from the highest accessible peak (via the cable car).  The views are nice but it was not anything extraordinary.  The distant views were hazy and I didn't think it was much of a stop.  Maybe if we had time to visit the rest of the park, it may have been different.  I gather that if you go, there are gardens and a museum to visit.  However, we only stopped for a photo op, which was not really anything impressive so my review may be unfair to the rest of the park area.", "publishedDate": "2019-09-22", "language": "en", "rating": 3}, {"id": 711676249, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d2359212-r711676249-Parc_de_Montjuic-Barcelona_Catalonia.html", "text": "The fortress itself isn't very impressive, but the views from the top level are outstanding.  You can see the port and the ocean on one side and the City of Barcelona on the other side.  What really impressed us was the size of Sagrada Familia when seen from a distance.", "publishedDate": "2019-09-21", "language": "en", "rating": 4}, {"id": 711620392, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d2359212-r711620392-Parc_de_Montjuic-Barcelona_Catalonia.html", "text": "You got a good view of Barcelona on top of the mountain. But not a lot of things to see and do. I would rather get lost in Gothic quarter. ", "publishedDate": "2019-09-21", "language": "en", "rating": 3}, {"id": 710603691, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d2359212-r710603691-Parc_de_Montjuic-Barcelona_Catalonia.html", "text": "Get the cable car 🚠 by buying tickets online. Amazing views going up and from the top. We didn’t go in the castle but the views were just as good from the pathway around the castle. ", "publishedDate": "2019-09-17", "language": "en", "rating": 5}, {"id": 710238123, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d2359212-r710238123-Parc_de_Montjuic-Barcelona_Catalonia.html", "text": "A must see in an area of Barcelona away from some of the other sights.   This is a good place for anyone to walk around.", "publishedDate": "2019-09-16", "language": "en", "rating": 5}, {"id": 709817492, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d2359212-r709817492-Parc_de_Montjuic-Barcelona_Catalonia.html", "text": "Very nice parc with plenty of grass to sit on and relax for a minute. We went on a little rowing boat and you can get very close to ducks, geese, etc. Not expensive either as we paid €6 for two and for 30mins (which is plenty of time). very nice touch! ", "publishedDate": "2019-09-14", "language": "en", "rating": 5}, {"id": 707588135, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d2359212-r707588135-Parc_de_Montjuic-Barcelona_Catalonia.html", "text": "My wife and I visited this place by taking the cable car all the way to the top. It has great views and tasty food is within a reasonable walking distance", "publishedDate": "2019-09-07", "language": "en", "rating": 5}, {"id": 707224120, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d2359212-r707224120-Parc_de_Montjuic-Barcelona_Catalonia.html", "text": "On our first evening four of us took the train to the Parc. We arrived around 8:30, the first light show starts at 9:30 and there is a second at 10:00. \n\nIt was already very busy and hard to find seating due people saving chairs with bags which coincidentally didn’t get used! We were lucky enough to be given a couple of chairs by some people who were leaving.\n\nThere were lots of snack places on site so refreshments were easily obtained.\n\nThe light show was awesome and worth the wait, we ended up staying for both. The first was popular music and the second classical. The fountains were awesome, I imagine being higher up would have afforded a better view.", "publishedDate": "2019-09-06", "language": "en", "rating": 4}, {"id": 706871261, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d2359212-r706871261-Parc_de_Montjuic-Barcelona_Catalonia.html", "text": "After a costly cable car ticket (11 euro each) which does have incredible views over the city of Barcelona you get to the top of the mountain. There is very little to do except the castle and it's a bit if a forgotten space. It's a cracking view point but other than that very little to do. You can walk (if able) up and down if you fancy. We opted to cable car up and walk back down via the port cable car, a single ticket over the dock to Barcelonetta to make it a round trip", "publishedDate": "2019-09-05", "language": "en", "rating": 3}, {"id": 706569051, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d2359212-r706569051-Parc_de_Montjuic-Barcelona_Catalonia.html", "text": "Beautiful park and castle.  The whole area is a great place to soak up the culture and architecture. A must see", "publishedDate": "2019-09-04", "language": "en", "rating": 5}, {"id": 706352942, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d2359212-r706352942-Parc_de_Montjuic-Barcelona_Catalonia.html", "text": "On Montjuic, there are a lot of things to see. It has a good view over the city and beautiful gardens. Go and check it out!", "publishedDate": "2019-09-04", "language": "en", "rating": 5}, {"id": 704638904, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d2359212-r704638904-Parc_de_Montjuic-Barcelona_Catalonia.html", "text": "This is a very nice park with a good view of the city.  I took the cable car up the mountain and walked down.  I liked the view from the cable car but I would probably walk both ways next time.\n\nThe castle is cheap to get into and there is a little cafe/bar selling drinks inside.  We got beers which were very refreshing on a hot day and they let us walk around with them.  \n\nWe only spent about 45 minutes here and it was very nice.  I recommend this tour.", "publishedDate": "2019-08-30", "language": "en", "rating": 5}, {"id": 703928711, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d2359212-r703928711-Parc_de_Montjuic-Barcelona_Catalonia.html", "text": "Had a fantastic experience visiting this great site, along with the caste which only cost 5 Euros. If you are getting the cable car up, be sure to get off at the right bus stop, as this bus takes you most of the way.  Some great walks to do once you are up, and the views of the port are amazing!!  Great day!!", "publishedDate": "2019-08-28", "language": "en", "rating": 5}, {"id": 703711152, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d2359212-r703711152-Parc_de_Montjuic-Barcelona_Catalonia.html", "text": "I did not go inside the castle, but the outside is neatly manicure! There's a nice long path for a walk. It has trees shaded from the sun so it makes a more comfortable walk in the heat! ", "publishedDate": "2019-08-27", "language": "en", "rating": 3}, {"id": 703035467, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d2359212-r703035467-Parc_de_Montjuic-Barcelona_Catalonia.html", "text": "It will take you all day here so please come early in the morning. It is very wide and has many beautiful corners.", "publishedDate": "2019-08-25", "language": "en", "rating": 5}, {"id": 701897015, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d2359212-r701897015-Parc_de_Montjuic-Barcelona_Catalonia.html", "text": "Visiting this castle is a great way to spend an afternoon. If I had my time back however, I would go in the earlier morning because there is little escape from the blazing sun. Having said that, there is always a wonderful breeze blowing up on the mountain. The castle itself is typical of the remnants of a fort. The ride up there is half the fun on the tram and funicular.   There is a small restaurant and bar inside the castle walls with very reasonably priced beers and sandwiches. You need no more than an hour to an hour and a half to wander around and catch the great views it offers. Definitely recommended.", "publishedDate": "2019-08-22", "language": "en", "rating": 4}, {"id": 701601477, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d2359212-r701601477-Parc_de_Montjuic-Barcelona_Catalonia.html", "text": "The walk to parc is beautiful with one photo op after another. With many stairs or escalators which culminates at the top to the national art museum of catalunya. The long walk up the stairs are well worth it as the view of the city is truly spectacular. It’s a quiet, beautiful contemplative location to just sit and drink in the amazing view.\nThere are restaurants and the museum gift shop.", "publishedDate": "2019-08-21", "language": "en", "rating": 5}, {"id": 700321150, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d2359212-r700321150-Parc_de_Montjuic-Barcelona_Catalonia.html", "text": "We biked to get there” which I only recommend if you use ebikes.  Views of the city are unbelievable.", "publishedDate": "2019-08-18", "language": "en", "rating": 3}, {"id": 698942779, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d2359212-r698942779-Parc_de_Montjuic-Barcelona_Catalonia.html", "text": "Going up by cable car and reaching the top is amazing. You get an incredible view of all the city and get to see a beautiful fort.", "publishedDate": "2019-08-14", "language": "en", "rating": 5}, {"id": 698692355, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d2359212-r698692355-Parc_de_Montjuic-Barcelona_Catalonia.html", "text": "Culminating the park is the castle Montjuïc. It’s history dates back to 1080. If you like history and magnificent views this is a must. An introductory films stars your self guided tour. ", "publishedDate": "2019-08-13", "language": "en", "rating": 5}, {"id": 697860654, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d2359212-r697860654-Parc_de_Montjuic-Barcelona_Catalonia.html", "text": "Go to the cable cars it’s 12€ for return and 8€ for one way you can enjoy the view all over Barcelona from there \nThe castle was boring ", "publishedDate": "2019-08-11", "language": "en", "rating": 5}, {"id": 697711125, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d2359212-r697711125-Parc_de_Montjuic-Barcelona_Catalonia.html", "text": "We went here via the Metro and the vernacular. The castle was very interesting as the history spanned a long period in Spanish history. English translations were available as each exhibit which made it much more enjoyable. The views from the battlements were great.", "publishedDate": "2019-08-11", "language": "en", "rating": 4}, {"id": 696858189, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d2359212-r696858189-Parc_de_Montjuic-Barcelona_Catalonia.html", "text": "We visited on a Sunday afternoon and admission was free. Stunning setting with beautiful views over Barcelona. Get the bus from the funicular as it’s quite a climb", "publishedDate": "2019-08-08", "language": "en", "rating": 5}, {"id": 695420530, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d2359212-r695420530-Parc_de_Montjuic-Barcelona_Catalonia.html", "text": "We paid for the cable car up to the top of Montjuic and the views going up are really nice so worth doing that. However, we expected to be able to go up to the castle as part of the ticket and that wasn’t the case, it required another ticket. To be honest I wouldn’t bother going up to the castle and I would recommend visiting Turo de la Rovira which has much better views. ", "publishedDate": "2019-08-04", "language": "en", "rating": 3}, {"id": 695017134, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d2359212-r695017134-Parc_de_Montjuic-Barcelona_Catalonia.html", "text": "Our metro tickets here included the funicular—a great deal. We walked through gardens and past the Miro museum (which was closed by evening). A picnic near the Catalan Art Museum was a great spot for people watching in the shade of huge trees. Sunset from the steps of the museum was grand. Our only disappointment was the Magic Fountain show below didn’t materialize that week night.", "publishedDate": "2019-08-02", "language": "en", "rating": 4}, {"id": 694622971, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d2359212-r694622971-Parc_de_Montjuic-Barcelona_Catalonia.html", "text": "Very interesting to see the historic location both early and late 20th Century. Fantastic views of the city, harbour and airport provides something for everyone!", "publishedDate": "2019-08-01", "language": "en", "rating": 5}, {"id": 694193560, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d2359212-r694193560-Parc_de_Montjuic-Barcelona_Catalonia.html", "text": "I recommend Parc de Montjuic to all those who enjoy nature, views and walking. You can walk up to a castle, then walk all around the castle atop a hill. On the way up, you will have beautiful views and can stop in lovely parks for a drink or a snack. \n\nThere are surprisingly few tourists here and it's free unless you want to enter the Castle.", "publishedDate": "2019-07-30", "language": "en", "rating": 5}, {"id": 694176068, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d2359212-r694176068-Parc_de_Montjuic-Barcelona_Catalonia.html", "text": "This was the first place we visited after arriving in Barcelona we visited on a Sunday and it was free entry after 3pm and luckily we arrived at 2:40pm so only had a 20 min wait to get in for free . Its a nice castle and has good 360 views of Barcelona and the port . We got the bus to the castle as we got a 3 day metro pass the bus stop is only about 100m away", "publishedDate": "2019-07-30", "language": "en", "rating": 3}, {"id": 693820704, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d2359212-r693820704-Parc_de_Montjuic-Barcelona_Catalonia.html", "text": "Took a ride up the cable car to get here. Very cheap to get in. Fab 360 views from the top. €5 adult €3 reduced. \nThe rooms in the fort have some displays in although not much time and attention has gone into much other than preserving the fort. I think this is fine as the entrance fee is so cheap you’re just paying for the lovely views from the top. \nNice cafe inside. ", "publishedDate": "2019-07-29", "language": "en", "rating": 4}, {"id": 693784400, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d2359212-r693784400-Parc_de_Montjuic-Barcelona_Catalonia.html", "text": "I think this was overrated. You need a special guided tour to get into most parts and I don't think it's worth it.", "publishedDate": "2019-07-29", "language": "en", "rating": 3}, {"id": 693656882, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d2359212-r693656882-Parc_de_Montjuic-Barcelona_Catalonia.html", "text": "This is a great area for a picnic and leisurely walk. My husband and I took our time and visited the many sites to see on Montjuic. ", "publishedDate": "2019-07-29", "language": "en", "rating": 5}, {"id": 693610406, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d2359212-r693610406-Parc_de_Montjuic-Barcelona_Catalonia.html", "text": "first a lovely parc, then a tour in funicular and finaly the castle of pirate of the caribbean, what do you need more ?", "publishedDate": "2019-07-28", "language": "en", "rating": 5}, {"id": 693386110, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d2359212-r693386110-Parc_de_Montjuic-Barcelona_Catalonia.html", "text": "Lots of history here!!! very affordable to see and incredible views to take photos. This is a most see!!!", "publishedDate": "2019-07-28", "language": "en", "rating": 5}, {"id": 692970112, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d2359212-r692970112-Parc_de_Montjuic-Barcelona_Catalonia.html", "text": "Nice castle, entry fees is 3 euro and Teleferic is around 12.5 euro two ways. will have nice view of the city.", "publishedDate": "2019-07-26", "language": "en", "rating": 5}, {"id": 692387146, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d2359212-r692387146-Parc_de_Montjuic-Barcelona_Catalonia.html", "text": "We have been scared to go for years as we thought you had to get the cable car but you don’t you can walk or take a bus/car/taxi ( we decided to do the cable car and it was great) when you get to the top there is stuff to do outside and great photo opportunities. We decided to take the tour which was €2 more expensive than doing it yourself and you got to sea the dungeon, the watch tower and other hidden stuff. The staff are very passionate about what they do and are great. We really enjoyed our tour and on the way back down you can visit the Olympic stadium and the museum which agin was very cheap and great inside with interactive stuff so great for kids! We overall really enjoyed our trip to Castell Montjuic and would definitely go again!!!!!", "publishedDate": "2019-07-24", "language": "en", "rating": 5}, {"id": 692255242, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d2359212-r692255242-Parc_de_Montjuic-Barcelona_Catalonia.html", "text": "The views of the city are fantastic and the cable car ride is fun. Not much else to do or see here though.", "publishedDate": "2019-07-24", "language": "en", "rating": 3}, {"id": 692068793, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d2359212-r692068793-Parc_de_Montjuic-Barcelona_Catalonia.html", "text": "We had a hot walk up to Montjuic Castle. The view from the top is worth the sweat and tears it takes to get there. Also the castle itself is fascinating. ", "publishedDate": "2019-07-23", "language": "en", "rating": 5}, {"id": 690857329, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d2359212-r690857329-Parc_de_Montjuic-Barcelona_Catalonia.html", "text": "We enjoyed the aerial ride along with the Miró Museum.  It is a nice place to visit with the gardens and the castle is free after 3 on Sundays which makes the castle area also worth a visit.", "publishedDate": "2019-07-19", "language": "en", "rating": 5}, {"id": 690154423, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d2359212-r690154423-Parc_de_Montjuic-Barcelona_Catalonia.html", "text": "I’m very glad we took the time to explore Parc De Montjuic during our visit to Barcelona.\n\nWe took the first set of cable cars from the beach and followed the signs to explore the park from there. There are some amazing views from here but they get even better if you continue to walk up to the castle and second set of cable cars. It’s quite steep, but plenty of places to stop off for a rest en-route. \n\nWe took the newer cable cars back down and went on to walk to the Olympic Park from here. \n\nI would highly recommend a visit for the best views of Barcelona! ", "publishedDate": "2019-07-16", "language": "en", "rating": 5}, {"id": 690115008, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d2359212-r690115008-Parc_de_Montjuic-Barcelona_Catalonia.html", "text": "I got to visit Montjuic on my most recent trip to Barcelona. I was something to do for a few hours, but the castle isn't much to see. There are other, more interesting, things to do in Barcelona. That said, we did not visit the Botanical Garden. I would have liked to see that but we didn't have time. ", "publishedDate": "2019-07-16", "language": "en", "rating": 3}, {"id": 689890778, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d2359212-r689890778-Parc_de_Montjuic-Barcelona_Catalonia.html", "text": "We spent the whole day in the Parc de Montjuic and enjoyed the Joan Miro gallery, cable car to the castle, visited the Olympic stadium and wandered through the gardens. ", "publishedDate": "2019-07-15", "language": "en", "rating": 5}, {"id": 689612233, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d2359212-r689612233-Parc_de_Montjuic-Barcelona_Catalonia.html", "text": "I didn't have nearly enough time to explore all of what this park holds, but just strolling around was very enjoyable. There are flowers of all colors, there are many different views of the city from above, there is the gondola you can take down to Barcoleneta, and there is the Castle Montjuic at the top (make sure you come after 2 pm and the entrance is free). I missed the magic fountains on the other side, definitely on my list for next time.", "publishedDate": "2019-07-14", "language": "en", "rating": 5}, {"id": 689550664, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d2359212-r689550664-Parc_de_Montjuic-Barcelona_Catalonia.html", "text": "Beautiful park but very large grounds to cover.  We never did find the castle. Maybe if it hadn't been so hot, we may have had more patience to keep searching. I recommend if you visit during the summer, head out early in the morning, as it only gets hotter as the day goes on.", "publishedDate": "2019-07-14", "language": "en", "rating": 5}, {"id": 689307324, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d2359212-r689307324-Parc_de_Montjuic-Barcelona_Catalonia.html", "text": "What a great way to take a break from the hustle and bustle of Barcelona itself.   \nWe walked up the steps from the fountains to the Museu Nacional D'Art de Catalunya, and then kept going around all the various areas of the Parc.   \nSo pretty in the late Springtime on a sunny afternoon/evening.   So peaceful as well.", "publishedDate": "2019-07-13", "language": "en", "rating": 5}, {"id": 689055309, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d2359212-r689055309-Parc_de_Montjuic-Barcelona_Catalonia.html", "text": "Just the ride up is worth it, but the views and the history inside really make you appreciate the structure..  Good for anyone. (unless maybe you don't like to walk much)", "publishedDate": "2019-07-12", "language": "en", "rating": 5}, {"id": 688471596, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d2359212-r688471596-Parc_de_Montjuic-Barcelona_Catalonia.html", "text": "We almost didn't go because we had so many ther sights to see but we finally managed to get there and it was worth it. The views are amazing. The tram ride is a bit pricey but you can always walk up the hill afer taking the funicular. There is also a bus that goes up there. ", "publishedDate": "2019-07-10", "language": "en", "rating": 5}, {"id": 688224468, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d2359212-r688224468-Parc_de_Montjuic-Barcelona_Catalonia.html", "text": "The Montjuic Parc has the Castle it's more like a fortress. This fortress is very similar to St. Augtine fortress in Florida. The Parc has other things to see but after the fortress we walked to the National Museum which was worth seeing. From the museum there is a nice view of the city and taking the stepsdown you can easily get to the metro stations.", "publishedDate": "2019-07-09", "language": "en", "rating": 5}, {"id": 688176366, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d2359212-r688176366-Parc_de_Montjuic-Barcelona_Catalonia.html", "text": "Get the cable car/funicular up to the grounds of the fortress, you will be greeted with beautiful well maintained gardens, inside the fortress itself there is not a great deal to look at, but if you have a tour guide, it will make it much more informative. There are views of Barcelona from every angle though, these views alone are worth it!", "publishedDate": "2019-07-09", "language": "en", "rating": 4}, {"id": 687910532, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d2359212-r687910532-Parc_de_Montjuic-Barcelona_Catalonia.html", "text": "In Barcelona you will see and have to visit so many monuments, statues, and places of interest. One of those near to Espana swuare is the Parc de Mountjuic.\nLots os shopping centers, restaurants and bars and cafes.\nPeople filling the streets all day and night.", "publishedDate": "2019-07-08", "language": "en", "rating": 4}, {"id": 687894122, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d2359212-r687894122-Parc_de_Montjuic-Barcelona_Catalonia.html", "text": "A great place to see the view of the harbour and all the cruise ships.. An amazing structure with a fascinating history ", "publishedDate": "2019-07-08", "language": "en", "rating": 5}, {"id": 687280810, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d2359212-r687280810-Parc_de_Montjuic-Barcelona_Catalonia.html", "text": "To get to this castle, you take the metro's Montjuic funicular and then either catch the aerial tram (which is quite expensive!) or take the bus which stops in front of the funicular station and costs very little. You can walk, but it's uphill, and in the summer, not a great idea! And what's at the top when you get there? Well, it's a castle with a spectacular view and some information about its history in exhibits inside. There's not a lot to do here, other than read some of the history and take in the view. There are 2 daily tours that you can add to your ticket which might enhance the visit if you time yourself to catch one. There is a restaurant, but it doesn't take advantage of the view, oddly enough. I enjoyed our visit, it was a pleasant way to spend an afternoon, but don't expect reenactments or interactive exhibits.", "publishedDate": "2019-07-06", "language": "en", "rating": 3}, {"id": 687037776, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d2359212-r687037776-Parc_de_Montjuic-Barcelona_Catalonia.html", "text": "Went here on our first day to get an overview of the city from up high.  The cable car ride up provided a great view.  Very interesting history of the various used of this location throughout Barcelona's history.  ", "publishedDate": "2019-07-05", "language": "en", "rating": 5}, {"id": 686753540, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d2359212-r686753540-Parc_de_Montjuic-Barcelona_Catalonia.html", "text": "Of historical interest and great for kids to run around.  360 views on the city and the port.  Nice park surrounding it for walks if it’s not too hot.  Difficult to get to on the cheap.  Entry cost was only €5, but tram ride one way was €8.", "publishedDate": "2019-07-04", "language": "en", "rating": 4}, {"id": 686552943, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d2359212-r686552943-Parc_de_Montjuic-Barcelona_Catalonia.html", "text": "Take the cable car up to visit the fort and soak in the views. Hiking and seasonal entertainment. If you have time, hike down the hill.", "publishedDate": "2019-07-03", "language": "en", "rating": 4}, {"id": 686492979, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d2359212-r686492979-Parc_de_Montjuic-Barcelona_Catalonia.html", "text": "We walk to the Palace of Montjuic (10 minutes walk from our hotel) its a very steep walk  up the hill, we could have taken the gondola but we decided agains it.  When we arrived we saw a beautiful fort type of construction and had no idea what to spect, but definitely didn't expect it to be \"empty\", there is nothing there to see other than the views of the port of Barcelona \"docking\" and the city itself, but there is nothing more, ahhh there was an expo of \"The art of war in China\", we though it was weird, nothing from their spanish history but from China, it was disappointing, you only need 30 minutes and you are done with the place.", "publishedDate": "2019-07-03", "language": "en", "rating": 4}, {"id": 686214225, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d2359212-r686214225-Parc_de_Montjuic-Barcelona_Catalonia.html", "text": "Nice hike up the hlll and rewarding views from the top.  Lots to see and do at the top. You will not regret the nice gardens and activities available at the summit.  If you wish to skip the walking, taxi can also drop you off up there too.", "publishedDate": "2019-07-02", "language": "en", "rating": 5}, {"id": 686085557, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d2359212-r686085557-Parc_de_Montjuic-Barcelona_Catalonia.html", "text": "Highly recommend visiting this spot for the excellent views. I did not actually enter the castle, but just walked around the outside. There is a lot to see in this general area, so you can spend a couple hours just exploring. There are many museums and parks you can also enter if you'd like. If you take the metro to the parallel stop, there is a tram that takes you the rest of the way up, and there is also a bus that accepts your metro card. ", "publishedDate": "2019-07-02", "language": "en", "rating": 5}, {"id": 685759363, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d2359212-r685759363-Parc_de_Montjuic-Barcelona_Catalonia.html", "text": "We took a taxi to the Parc and were very happy with the view and the information on the evolution of the castle. Staff were less than friendly and not very helpful but we managed to figure things out ourselves. Took the cable car down part way and that was quite nice. The views of the city were quite spectacular and worth the trip.", "publishedDate": "2019-07-01", "language": "en", "rating": 4}, {"id": 684999365, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d2359212-r684999365-Parc_de_Montjuic-Barcelona_Catalonia.html", "text": "We decided to take the aerial cars to Parc de Montjuic, mainly to wander the park and take in the views. On a whim we also decided to visit the fort, located near the end of the aerial tramway. It's somewhat interesting and offers excellent views of Barcelona and the Mediterranean Sea but otherwise to me didn't seem worth the price of admission.", "publishedDate": "2019-06-28", "language": "en", "rating": 3}, {"id": 684802797, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d2359212-r684802797-Parc_de_Montjuic-Barcelona_Catalonia.html", "text": "We stopped here for an hour and enjoyed the views. Would recommend going here to enjoy the high side of the city", "publishedDate": "2019-06-27", "language": "en", "rating": 4}, {"id": 684021211, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d2359212-r684021211-Parc_de_Montjuic-Barcelona_Catalonia.html", "text": "Recommend\nto see the show which held in the evening but please review the working hours , i visited many times", "publishedDate": "2019-06-24", "language": "en", "rating": 4}, {"id": 683927910, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d2359212-r683927910-Parc_de_Montjuic-Barcelona_Catalonia.html", "text": "We enjoyed the tour of the castle and walking our way down to the Placa Espanya. As others have said, the cable car was probably a little overrated, but what the heck? We're on vacation!", "publishedDate": "2019-06-24", "language": "en", "rating": 4}, {"id": 683719107, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d2359212-r683719107-Parc_de_Montjuic-Barcelona_Catalonia.html", "text": "It was fun taking the funicular and then the teleferico to Montjuic. We saw a bit of the castle, but to see the dungeon and other specific areas, you need to be sure your ticket is for all of those.", "publishedDate": "2019-06-23", "language": "en", "rating": 4}, {"id": 683512604, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d2359212-r683512604-Parc_de_Montjuic-Barcelona_Catalonia.html", "text": "Cable car and park were great. Worth visiting! Can walk half the way downhill and take the cable car from the middle station.", "publishedDate": "2019-06-22", "language": "en", "rating": 5}, {"id": 683454807, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d2359212-r683454807-Parc_de_Montjuic-Barcelona_Catalonia.html", "text": "Our family used Hop on Hop off bus and walked up the road through the park to Montjuic. Stopped for the view. Wonderful park.", "publishedDate": "2019-06-22", "language": "en", "rating": 5}, {"id": 682908437, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d2359212-r682908437-Parc_de_Montjuic-Barcelona_Catalonia.html", "text": "The venue of the Olympics is very well maintained and gives you miles of walkways with fantastic views over the city of Barcelona. Worth to visite, worth to explore.  ", "publishedDate": "2019-06-20", "language": "en", "rating": 5}, {"id": 682825316, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d2359212-r682825316-Parc_de_Montjuic-Barcelona_Catalonia.html", "text": "We sat under the shade of broad trees watching the port in action ... ferries, freighters, sailboats, people. Plus the castle site was great tho we did not buy entrance tux. I swam in the Olympic pool and it was wonderful to swim outdoors. A great respite from the busy city\n", "publishedDate": "2019-06-19", "language": "en", "rating": 5}, {"id": 682782735, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d2359212-r682782735-Parc_de_Montjuic-Barcelona_Catalonia.html", "text": "To just relax walk or jogging beautiful place great views you just can sit under the trees or just enjoy the panoramic views ", "publishedDate": "2019-06-19", "language": "en", "rating": 5}, {"id": 682055506, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d2359212-r682055506-Parc_de_Montjuic-Barcelona_Catalonia.html", "text": "You dont need to book in advance.  best to wait for a clear day so you can take in all of the spectacular views.  Only a short ride but its well worth it.", "publishedDate": "2019-06-16", "language": "en", "rating": 4}, {"id": 681828136, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d2359212-r681828136-Parc_de_Montjuic-Barcelona_Catalonia.html", "text": "Must visit in Barcelona. From the top you will find nice view to the city. Just take a minute for sitting on the bench and look around how amazing that place.", "publishedDate": "2019-06-16", "language": "en", "rating": 5}, {"id": 681022157, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d2359212-r681022157-Parc_de_Montjuic-Barcelona_Catalonia.html", "text": "We got there on the hop on hop off bus and walked around the paerk. we took the cable car up to the castle which was lovely and had wonderful views around the city. The jacaranda trees were in bloom anss as they are my favourites it was a bonus.", "publishedDate": "2019-06-12", "language": "en", "rating": 5}, {"id": 679991241, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d2359212-r679991241-Parc_de_Montjuic-Barcelona_Catalonia.html", "text": "Ride up to the top in the cable car on a sunny day & enjoy the views of the city and the waterfront.  Like everything in Barcelona, this gets very crowded, so buy your tickets ahead of time.", "publishedDate": "2019-06-08", "language": "en", "rating": 4}, {"id": 679819700, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d2359212-r679819700-Parc_de_Montjuic-Barcelona_Catalonia.html", "text": "If you are going to the Magic Fountain, Parc de Montjuic is a good place to start.  Next to the fountain, you also have the botanical gardens, an art museum, the olympic stadium, and several more stops.  A great tour while you wait for dark to see the fountain lit up.", "publishedDate": "2019-06-07", "language": "en", "rating": 5}, {"id": 679629837, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d2359212-r679629837-Parc_de_Montjuic-Barcelona_Catalonia.html", "text": "Another great spot to visit while in Barcelona. Enjoyed the ride to Montjuic and the history explained on our headphones. Include this destination in your tour of the city.", "publishedDate": "2019-06-06", "language": "en", "rating": 4}, {"id": 679572052, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d2359212-r679572052-Parc_de_Montjuic-Barcelona_Catalonia.html", "text": "A nice parc, easy to relax, just perfect to spend a great afternoon there and in the neighborhood. Really recommend you to come and have a look at it if you still never did.", "publishedDate": "2019-06-06", "language": "en", "rating": 5}, {"id": 679095157, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d2359212-r679095157-Parc_de_Montjuic-Barcelona_Catalonia.html", "text": "We loved our cable car ride to the top of the Montjuic. We spent over 2 hours walking the trails and taking in the sights. The Parc is quite large so even when there are many people there you can find some solitude.", "publishedDate": "2019-06-05", "language": "en", "rating": 4}, {"id": 679014514, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d2359212-r679014514-Parc_de_Montjuic-Barcelona_Catalonia.html", "text": "Our favorite diversion on Montjuic was the Poblo esagnol which is an architectural park of each region of Spain.  Since we were only traveling to Barcelona, and we wanted to expose the family to more of Spain, this was the place to go.  Each region has building, flowers, foods and arts/crafts typical of that area of the country,  There is also an art museum, a movie, cafes, and exhibits.\nAfter that, we walked up to the Olympic fields of 1992.  We loved looking over the remnants of that wonderful time.\nThe best part was taking the gondola down from the top of the mountain to the ocean side riding some 200' over the city of Barcelona.  What a thrill!", "publishedDate": "2019-06-04", "language": "en", "rating": 4}, {"id": 678750110, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d2359212-r678750110-Parc_de_Montjuic-Barcelona_Catalonia.html", "text": "We spent an entire day at Montjuic and could easily have filled a second day.  The funicular is again up and running.  The castle was fun and interesting.  If you enjoy strolling in the park, be sure to visit some of the parks in the area.  They are beautiful.  Wear your walking shoes and allow yourself plenty of time.  It is a huge area.  Well worth visiting,  ", "publishedDate": "2019-06-04", "language": "en", "rating": 5}, {"id": 678701793, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d2359212-r678701793-Parc_de_Montjuic-Barcelona_Catalonia.html", "text": "We walked from Passeig de Gracia up to Montjuic castle and through the Parc to the Miramar Hotel for coffee looking back at the town ", "publishedDate": "2019-06-03", "language": "en", "rating": 4}, {"id": 677905049, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d2359212-r677905049-Parc_de_Montjuic-Barcelona_Catalonia.html", "text": "After a picnic in the park and a visit to the hilltop castle, we walked down to find the Montjuic cementary.  Its a huge area, some 57 acres, laid out in stone walled blocks of what look like flats but are in fact tombs.  In addition to these communal blocks are individual graves, some ornately decorated, some magnificent mausaleums. As we came in from the back, what we didn't realise is that you can get route plans from the main entrance and follow an artistic, historical or architectoral tour.  Over 152,000 people have been buried here since it opened in 1883.", "publishedDate": "2019-05-31", "language": "en", "rating": 4}, {"id": 677778973, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d2359212-r677778973-Parc_de_Montjuic-Barcelona_Catalonia.html", "text": "Going up to Parc de Montjuic is quite an experience. We walked rather than taking the bus or the cable car, which are probably exciting ways to go there as well. Walking up gave us the opportunity to see and experience the surroundings from close quarters. At the park itself you have the chance to do a number of things. We walked and looked around and just had a relaxing time.  The views are  stunning, depending on where you go or where you stand. This is worth your time and effort.", "publishedDate": "2019-05-31", "language": "en", "rating": 5}, {"id": 677556975, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d2359212-r677556975-Parc_de_Montjuic-Barcelona_Catalonia.html", "text": "great views and cool park to walk around and enjoy and take plenty of photos\n\nwear your walking shoes and enjoy the scenery and the people watching", "publishedDate": "2019-05-30", "language": "en", "rating": 4}, {"id": 677432859, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d2359212-r677432859-Parc_de_Montjuic-Barcelona_Catalonia.html", "text": "We did not pay anything to walk in this lovely area.  Lovely view of the port and natured. Make certain that you wear your walking shoes.", "publishedDate": "2019-05-29", "language": "en", "rating": 4}, {"id": 676868275, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d2359212-r676868275-Parc_de_Montjuic-Barcelona_Catalonia.html", "text": "I didn't have time to go inside, but just walking around the exterior was worth the cable car ride up. Super views, giving one a terrific sense of the city's layout and the huge port. I had hoped to wind through gardens on my walk down, but the maps are underwhelming. They never show you where you are, so I ended up walking down mostly on the road and quite circuitously.", "publishedDate": "2019-05-27", "language": "en", "rating": 4}, {"id": 676858493, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d2359212-r676858493-Parc_de_Montjuic-Barcelona_Catalonia.html", "text": "Go up by the cable car and sample the views on the way up as well as those at the top. Take your time to stroll about and take it all in. Only 5 Euros to get in and well worth it! The views from the top all around Barcelona were terrific :-)", "publishedDate": "2019-05-27", "language": "en", "rating": 4}, {"id": 676732271, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d2359212-r676732271-Parc_de_Montjuic-Barcelona_Catalonia.html", "text": "You have to pay entrance fee to see the beautiful view over the city. Otherwise castle is quite boring.", "publishedDate": "2019-05-27", "language": "en", "rating": 3}, {"id": 676029445, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d2359212-r676029445-Parc_de_Montjuic-Barcelona_Catalonia.html", "text": "Took a bus to go all way to the castle.Then walked around to enjoy great views of the sea and the city.Lots of flowers,interesting bushes and trees;you can spend hours there;and enjoy the quietness after a busy city.", "publishedDate": "2019-05-23", "language": "en", "rating": 5}, {"id": 675992702, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d2359212-r675992702-Parc_de_Montjuic-Barcelona_Catalonia.html", "text": "Lovely park with the arts museum, botanical garden, palace, Olympic stadium, castle and much more.\n\nWell worth a visit! ", "publishedDate": "2019-05-23", "language": "en", "rating": 4}, {"id": 675982734, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d2359212-r675982734-Parc_de_Montjuic-Barcelona_Catalonia.html", "text": "Awesome panoramic view from the top, worth the trip.  You can see a pretty good view of Barcelona from here.", "publishedDate": "2019-05-23", "language": "en", "rating": 5}, {"id": 675609751, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d2359212-r675609751-Parc_de_Montjuic-Barcelona_Catalonia.html", "text": "The red bus route takes you here from the open top buses but there were multiple local buses which had the route “montjuic on them” so easy access. \nWe were here for a few hours, got lost looking for toilets but in a good way. There are so many views and every time you go up you think you’ve seen it all but then you go up higher and there’s more. \nLoved all the water fountains near the Olympic swimming pool, there were nice pictures there. \nA lot of the area was barred off when we were there due to a car show as F1 was on which was a bit disappointing but we saw many other beautiful views and smaller fountains. \nThere are even escalators which is perfect for when you start getting a bit too tired!", "publishedDate": "2019-05-21", "language": "en", "rating": 5}, {"id": 675508796, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d2359212-r675508796-Parc_de_Montjuic-Barcelona_Catalonia.html", "text": "Lovely place to visit and walk around, was a bit disappointed that you have to pay extra to get access to the highest point with a guided tour. The cable car ride up is brilliant.", "publishedDate": "2019-05-21", "language": "en", "rating": 4}, {"id": 675076630, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d2359212-r675076630-Parc_de_Montjuic-Barcelona_Catalonia.html", "text": "The palace is beautiful and the museum very interesting... we had a very bad experience because of the rain... (take un umbrella with you just in case the weather is not so sunny). The security of the museum kicked us out... in the rain...because they were closing... they didn't let us stand outside the museum under a cover patio! ", "publishedDate": "2019-05-19", "language": "en", "rating": 4}, {"id": 674780813, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d2359212-r674780813-Parc_de_Montjuic-Barcelona_Catalonia.html", "text": "We stayed in a B&B near Montjuic and had time to walk several of the park areas surrounding the area.  Each of the gardens had a distinctive character and we enjoyed our tours of each one.  There are statues, fountains, and many fascinating gardens.", "publishedDate": "2019-05-18", "language": "en", "rating": 4}, {"id": 674093205, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d2359212-r674093205-Parc_de_Montjuic-Barcelona_Catalonia.html", "text": "We only got the cable car up-over as there was a strike on and they were being taken off at 1500, however, well worth going up.  We didn’t go into the castle but the views, which was why we went, were incredible.  Walked down to the cable car down to the port which was also worth doing.", "publishedDate": "2019-05-14", "language": "en", "rating": 4}, {"id": 674053191, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d2359212-r674053191-Parc_de_Montjuic-Barcelona_Catalonia.html", "text": "Great fort constructed in 1500s & was often revised.  Used to protect city.  Originally the Jewish cemetery. It’s fun  to take the cable car up the mountain.", "publishedDate": "2019-05-14", "language": "en", "rating": 4}, {"id": 673946646, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d2359212-r673946646-Parc_de_Montjuic-Barcelona_Catalonia.html", "text": "After a ride up on the cable car you can walk around the outside of the castle before entering. The views are fantastic of both Barcelona city and port. At 5 Euros it is well worth it.", "publishedDate": "2019-05-14", "language": "en", "rating": 5}, {"id": 673867242, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d2359212-r673867242-Parc_de_Montjuic-Barcelona_Catalonia.html", "text": "We rode the Teleferic Montjuic up to the Castillo, and the views were worth the cost.\n\nThe castle has a commanding view of the harbor, so it was a great location to build a fortress whose role was to protect that harbor !\n\nWould suggest that you not drive here, parking is limited and it is simpler and faster to ride the bus (or taxi) here.", "publishedDate": "2019-05-13", "language": "en", "rating": 5}, {"id": 673622314, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d2359212-r673622314-Parc_de_Montjuic-Barcelona_Catalonia.html", "text": "This is one of the best places in my opinion. We went there on foot and yes, it's quite a challenge to reach the top, but well worth it. The views are spectacular and you could see all of Barcelona. I totally disagree with the people who reviewed it as \"impossible to reach by walking\", this is so untrue. The lift is about 8 euro and is for miserable 3 stops.....you can see the views when there anyway and maybe have picnic if the weather is nice, why not? There's this medieval castle too. Overall, a really nice place for taking photos, I loved it.", "publishedDate": "2019-05-13", "language": "en", "rating": 5}, {"id": 673563327, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d2359212-r673563327-Parc_de_Montjuic-Barcelona_Catalonia.html", "text": "Great view and the caste is quite interesting, but I recommend you take the bus or the cable car.  We walked it, it was long and tiresome, especially on a warm day.", "publishedDate": "2019-05-12", "language": "en", "rating": 5}, {"id": 673331157, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d2359212-r673331157-Parc_de_Montjuic-Barcelona_Catalonia.html", "text": "We liked the two museums but the park itself was interesting but not a must see.  Take the metro to Parallel and don’t leave the station but correspond to the funicular. ", "publishedDate": "2019-05-11", "language": "en", "rating": 4}, {"id": 672452192, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d2359212-r672452192-Parc_de_Montjuic-Barcelona_Catalonia.html", "text": "The castle is well maintained and easily accessible by bus No. 150. There is a funicular which leaves from near the bus stop..\nBEWARE of the ticket for the Botanical Gardens. We paid Eros each for the garden to be included. When we asked for directions, we were told \"Around the corner.\" There was one sign pointing in a vague direction. No-one could give us any help until we asked a Polish couple with a map.It actually took us 30 minutes walking to arrive.", "publishedDate": "2019-05-08", "language": "en", "rating": 4}, {"id": 672099145, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d2359212-r672099145-Parc_de_Montjuic-Barcelona_Catalonia.html", "text": "I went there early, which was probably wise.. 'cause the place got crowded after a while, when buses started arriving. \n\nI walked alone without a guide, and enjoyed that the most. \nI also took the 2 different cable cars from the city.\n\nQuite a view over BArcelona, but the harbour is a soar sight...", "publishedDate": "2019-05-07", "language": "en", "rating": 4}, {"id": 671507354, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d2359212-r671507354-Parc_de_Montjuic-Barcelona_Catalonia.html", "text": "Beautiful view of Barcelona but that's pretty much it. Still worth a look though but probably wouldn't prioritize it.", "publishedDate": "2019-05-04", "language": "en", "rating": 3}, {"id": 670733396, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d2359212-r670733396-Parc_de_Montjuic-Barcelona_Catalonia.html", "text": "I enjoyed the views and fresh air in Montjuic park and it was a nice break from the city bustle. I didn’t enter the castle but the views from outside were nice", "publishedDate": "2019-05-01", "language": "en", "rating": 5}, {"id": 670690919, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d2359212-r670690919-Parc_de_Montjuic-Barcelona_Catalonia.html", "text": "Very nice experience, you can take the cable car up to Montjuic and after visit the castle. It has nice views over the city of Barcelona.\n\nEnjoy it!", "publishedDate": "2019-05-01", "language": "en", "rating": 5}, {"id": 670181052, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d2359212-r670181052-Parc_de_Montjuic-Barcelona_Catalonia.html", "text": "Amazing park, great for long walks in sunny days, it has Barcelona's beautiful palms and vegetation that will give you a positive vibe; absolutely lovely and relaxing", "publishedDate": "2019-04-29", "language": "en", "rating": 5}, {"id": 670078614, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d2359212-r670078614-Parc_de_Montjuic-Barcelona_Catalonia.html", "text": "I didn't get the ski lift up , but wish I did. Beautiful views of the city and marina. Nice little cafe and clean toilets. Go on a nice sunny day for amazing views.", "publishedDate": "2019-04-29", "language": "en", "rating": 5}, {"id": 669931984, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d2359212-r669931984-Parc_de_Montjuic-Barcelona_Catalonia.html", "text": "This is an amazing place. .It is big and you will get your work out here. The art Museum, the Miro Foundation, the olympic stadium and museum. Spanish Village is so fun....we spent a whole morning here...", "publishedDate": "2019-04-28", "language": "en", "rating": 5}]}}]