[{"locationId": 244206, "name": "Museum of Archaeology of Catalonia (Museu Arqueologic de Catalunya)", "placeType": "ATTRACTION", "reviewListPage": {"reviews": [{"id": 740259671, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d244206-r740259671-Museum_of_Archaeology_of_Catalonia_Museu_Arqueologic_de_Catalunya-Barcelona_Catal.html", "text": "We have been in Archeology museums all over the world and this one is so impressive in how it is organized and quality of exhibits. We did the audio tour, Senior discount, very inexpensive. The layout is starting in Neolithic period moving forward. Not only does it have some impressive artifacts, but includes an easy to use virtual reality sections where you have 360 view of where the the artifacts were found with narrative. Plan to spend about 2 hours. No crowd. We took the hop on hop off and stopped somewhere on Montjuic. Then a short walk to museum. Not so easy to find. I am sure a city bus would get near. Do not miss this gem.", "publishedDate": "2020-01-20", "language": "en", "rating": 5}, {"id": 716729133, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d244206-r716729133-Museum_of_Archaeology_of_Catalonia_Museu_Arqueologic_de_Catalunya-Barcelona_Catal.html", "text": "This museum is packed with information and artifacts. The exhibits are displayed with wonderful lighting. The audio guide was hard to follow at times. But worth seeing area artifacts and unique history.", "publishedDate": "2019-10-09", "language": "en", "rating": 5}, {"id": 648266758, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d244206-r648266758-Museum_of_Archaeology_of_Catalonia_Museu_Arqueologic_de_Catalunya-Barcelona_Catal.html", "text": "This museum was very interesting. It displayed artifacts from the region's prehistoric cultures, all the way to the post Roman cultures. There were detailed descriptions in both languages, though some artifacts required the audio guide. But it seemed to to have a lot less exhibits than what was labeled on the map, and it was divided in such a way that we had to backtrack, and I felt like maybe we missed something. Also, we never found the bathroom. But the fee was very cheap, I think only 5 Euros, so I definately recommend it.", "publishedDate": "2019-01-25", "language": "en", "rating": 5}, {"id": 645169775, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d244206-r645169775-Museum_of_Archaeology_of_Catalonia_Museu_Arqueologic_de_Catalunya-Barcelona_Catal.html", "text": "This museum has very well done displays of human history in this part of Spain. Some of the rooms provide information in English, but not all, and you lose something  especially in the sections of earliest human history in this area. The audio guide was helpful but sometimes we didn’t know where the objects were that the narrator referenced.  Still, it was a worthwhile visit. You can always learn something from how a place tells its story.", "publishedDate": "2019-01-11", "language": "en", "rating": 4}, {"id": 622236987, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d244206-r622236987-Museum_of_Archaeology_of_Catalonia_Museu_Arqueologic_de_Catalunya-Barcelona_Catal.html", "text": "Walked here easily from the central city.  The audio guide was interesting and informative.  Not up there with Madrids but still really worth a visit.  It was easy to navigate and had a good collection. Lovely looking building too.", "publishedDate": "2018-10-04", "language": "en", "rating": 4}, {"id": 614434515, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d244206-r614434515-Museum_of_Archaeology_of_Catalonia_Museu_Arqueologic_de_Catalunya-Barcelona_Catal.html", "text": "The museum is reasonably organised with the archeology arranged from earliest time through to post-Roman. There was supposed to be a display of medieval material starting today but the area was still roped off in the late afternoon and it was a case of back-tracking and asking directions to continue past that gallery.\n\nOne room has multi-lingual signage including English and many rooms have 1 page cards in English giving the big picture, but or the most part, the only information is in Spanish & Catalan (I'm guessing). The audio guide in English is dreadful - intended for 8 year olds with no prior exposure to archeology.\n\nUnless you are really keen, spend your time elsewhere.", "publishedDate": "2018-09-06", "language": "en", "rating": 3}, {"id": 604255129, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d244206-r604255129-Museum_of_Archaeology_of_Catalonia_Museu_Arqueologic_de_Catalunya-Barcelona_Catal.html", "text": "For those who travel a lot, this will not mean much nor be an impressive experience. Nevertheless, it is really good for kids who have never been to a museum of archaeology thanks to nice installations and well organized information.", "publishedDate": "2018-08-08", "language": "en", "rating": 3}, {"id": 584811062, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d244206-r584811062-Museum_of_Archaeology_of_Catalonia_Museu_Arqueologic_de_Catalunya-Barcelona_Catal.html", "text": "Not much English on the signage, the Roman area had none at all. Good to look at some things but we couldn't appreciate much of it as we couldn't read about the history. Left afte rhalf an hour. Nice area to walk around though", "publishedDate": "2018-06-03", "language": "en", "rating": 3}, {"id": 568000854, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d244206-r568000854-Museum_of_Archaeology_of_Catalonia_Museu_Arqueologic_de_Catalunya-Barcelona_Catal.html", "text": "Very well organised museum. An interesting way of descovering the history of the area. Worth spending at least an hour.", "publishedDate": "2018-03-21", "language": "en", "rating": 4}, {"id": 562439708, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d244206-r562439708-Museum_of_Archaeology_of_Catalonia_Museu_Arqueologic_de_Catalunya-Barcelona_Catal.html", "text": "Great museum for archaeology. If you want to know about the archaeology of Catalonia, and enjoy museums, don't miss this one. Well worth a visit. Nicely laid out exhibitions.", "publishedDate": "2018-02-24", "language": "en", "rating": 5}, {"id": 552078782, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d244206-r552078782-Museum_of_Archaeology_of_Catalonia_Museu_Arqueologic_de_Catalunya-Barcelona_Catal.html", "text": "The museum houses mostly Greek and Roman artifacts. Makes sense since the Greeks and Romans occupied Spain for quite a few years. The place is worth about 1 1/2 hour visit/tour.", "publishedDate": "2018-01-06", "language": "en", "rating": 4}, {"id": 534038131, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d244206-r534038131-Museum_of_Archaeology_of_Catalonia_Museu_Arqueologic_de_Catalunya-Barcelona_Catal.html", "text": "This museum is a must for any fan of Archaeology. As you wander the lower halls, you will be taken from the origins of man through stone tool development and the later bronze and iron ages.", "publishedDate": "2017-10-18", "language": "en", "rating": 5}, {"id": 505301784, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d244206-r505301784-Museum_of_Archaeology_of_Catalonia_Museu_Arqueologic_de_Catalunya-Barcelona_Catal.html", "text": "We discovered this museum by chance many years ago when we had only a little one. We loved the museum, the little one had fun in the interactive space and the museum is on our wishlist ever since. This year we took the journey in time with both girls and we totally enjoyed it. Most displays are in Catalan only, but we took the audio guides in English and we learned a lot of interesting histories. I particularly liked The Bridge of the Blue Sea (El Pont de la Mar Blava) and the parallel between the ancient Mediterranean seafaring history with Gibraltar as the last frontier and today’s space exploration,", "publishedDate": "2017-07-24", "language": "en", "rating": 5}, {"id": 503842008, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d244206-r503842008-Museum_of_Archaeology_of_Catalonia_Museu_Arqueologic_de_Catalunya-Barcelona_Catal.html", "text": "This was a lovely museum with many exhibits. It was totally deserted when we arrived on a Saturday morning. The staff was friendly and the museum is quite extensive.", "publishedDate": "2017-07-20", "language": "en", "rating": 5}, {"id": 474121954, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d244206-r474121954-Museum_of_Archaeology_of_Catalonia_Museu_Arqueologic_de_Catalunya-Barcelona_Catal.html", "text": "Nice, compact museum away from the crowds elsewhere in Barcelona. Many of the displays are up to date, with the best one (hands-on displays on ancient boat construction techniques) less than a year old. Make sure not to miss the excellent sculpture and mosaik displays on the upper floor.\nUnfortunately, as in many other musea in the city, displays in most rooms are Catalan-only. Knowing Spanish will not help you here - much less English. This is probably a political statement related to the Catalan nationalist movement, but does little to increase the appeal of their cultural institutions for international visitors. For this museum specifically, it reduces much of the museum content to ever so many broken pot displays.", "publishedDate": "2017-04-10", "language": "en", "rating": 4}, {"id": 469784727, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d244206-r469784727-Museum_of_Archaeology_of_Catalonia_Museu_Arqueologic_de_Catalunya-Barcelona_Catal.html", "text": "Very interesting museum for the past of Catalunya and Iberia too. It is made in a modern way and it is accesible to hanticap persons.", "publishedDate": "2017-03-24", "language": "en", "rating": 4}, {"id": 436081967, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d244206-r436081967-Museum_of_Archaeology_of_Catalonia_Museu_Arqueologic_de_Catalunya-Barcelona_Catal.html", "text": "Excellent archaeological exhibition, beautifully curated in modern and up-to-date (oh, the irony) facilities. \n\nThe collection is thematically organized within a broad, chronological framework covering prehistory, antiquity and the Middle ages. However, the installations theselves are thematically oriented, covering topics as diverse as death, social structure, technology, medicine and so on, whic was really enjoyable. \n\nThe exhibition could well do with some english texts, and they kinda lost me in the antiquity sections (y'know, the traditional busts, statues and amphoraes-way of exhibiting). Additionally, the medieval part is perhaps a bit gruelling, focusing on osteological finds, medicine, corporal punishment and so on. However - the rich prehistoric collection covers large swaths of essential European archaeology, and is well worth a visit. ", "publishedDate": "2016-11-10", "language": "en", "rating": 4}, {"id": 435616748, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d244206-r435616748-Museum_of_Archaeology_of_Catalonia_Museu_Arqueologic_de_Catalunya-Barcelona_Catal.html", "text": "Broad collection of artefacts from prehistoric times, stone/bronze, Phoenician , Greek, Roman, and Iberic times found in Catalonia.", "publishedDate": "2016-11-08", "language": "en", "rating": 4}, {"id": 430525921, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d244206-r430525921-Museum_of_Archaeology_of_Catalonia_Museu_Arqueologic_de_Catalunya-Barcelona_Catal.html", "text": "I know we're in Spain, but I imagine they would get a large number of non-Spanish speaking visitors. For the first part (prehistoric) they provided a large booklet in English, but this was difficult to follow because there was no numbering system or key. Only Spanish booklets were provided for the rest of the museum. Tempered the overall experience.", "publishedDate": "2016-10-22", "language": "en", "rating": 4}, {"id": 424116446, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d244206-r424116446-Museum_of_Archaeology_of_Catalonia_Museu_Arqueologic_de_Catalunya-Barcelona_Catal.html", "text": "This museum deals with Catalonia's history or prehistory from the Stone Age to the Roman period.  Early parts of the period have a great deal of objects but few labels in English.  Some of these especially on the construction of passage tombs looked interesting but was hard to tell as could not read the labels.  \n\nIt changes when it comes to the influence of Greeks, Carthaginians and Romans.  There are a number of Greek vases and other objects as well as Carthaginian artefacts.  Presumably this is the most popular part of the museum and labels are multi lingual.  Also, there are a number of finds relating to the native Iberian culture before the Carthaginian and Roman conquests.\n\nThe objects from this period are quite good.  Some of the Roman objects are high quality with some mosaics, statues and sarcophagi.\n\nEntrance price is included in cost of the Barcelona card.  \n\nIt is close to a number of other museums on Montjuic hill.", "publishedDate": "2016-10-01", "language": "en", "rating": 3}, {"id": 416193167, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d244206-r416193167-Museum_of_Archaeology_of_Catalonia_Museu_Arqueologic_de_Catalunya-Barcelona_Catal.html", "text": "This museum is pretty good, with a lot of interesting exhibits well displayed and a very small admission price. There was very little in English, but about half way through the museum we noticed a group of young people reading from printed pages which we assumed were room guides. We had missed them, so most of the time we weren't sure what we were looking at. But at that point the tour moved to a section of the museum which either wasn't air-conditioned or the air-con wasn't working properly. The maximum outside temperature that day was 28 degrees, but it was so hot inside at that point we left, it was much too uncomfortable to stay.", "publishedDate": "2016-09-08", "language": "en", "rating": 3}, {"id": 413092400, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d244206-r413092400-Museum_of_Archaeology_of_Catalonia_Museu_Arqueologic_de_Catalunya-Barcelona_Catal.html", "text": "This museum tells the story of the region, from Prehistory until the early middle ages! It has a lot of exhibits and the explanations are clear, although almost entirely in Catalan and Spanish. It was very interesting to visit! However, we were basically the only visitors!!!", "publishedDate": "2016-08-31", "language": "en", "rating": 5}, {"id": 412344084, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d244206-r412344084-Museum_of_Archaeology_of_Catalonia_Museu_Arqueologic_de_Catalunya-Barcelona_Catal.html", "text": "The museum is located away from many other popular museums. We took a bus there from Juan Miro Foundation. It was a Wednesday afternoon and to our surprise we were the only visitors there. The exhibition halls are vast and the displays are adequate and well arranged. The labels could be improved a little. Still, a good museum worthy of a visit.", "publishedDate": "2016-08-29", "language": "en", "rating": 4}, {"id": 392079942, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d244206-r392079942-Museum_of_Archaeology_of_Catalonia_Museu_Arqueologic_de_Catalunya-Barcelona_Catal.html", "text": "The theme of this museum was very interesting and the displays looked interesting too. That's why it was a shame there was nothing to describe the displays in English, only the main guides on the wall, so it wasn't a very good experience for me. Not even booklets were offered in English. There was a video display of the arcaeological history of Catalonia that was probably 20 years old - that was subtitled in English at least! \n\nAir-conditioning didn't work and the building seemed liked it's not cared for very well.", "publishedDate": "2016-07-13", "language": "en", "rating": 3}, {"id": 379946315, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d244206-r379946315-Museum_of_Archaeology_of_Catalonia_Museu_Arqueologic_de_Catalunya-Barcelona_Catal.html", "text": "This museum requires a bit of effort in locating, being on the edge of the more popular Montjuic site with its other museums of art, ethnology, Spanish Village and Castl. When we visited on a Tuesday afternoon, apart from one small school group we were almost the only visitors, which was nice for us but suggests it is well down in the ranking of places to visit in Barcelona, which is a shame as it really is most impressive. Beautifully laid out with stunning exhibits, re-creations and videos it more than justifies the modest entrance fee of only 4.5 euros. Sculptures, artefacts, mosaics, models covering prehistoric Catalonia to the Romans and beyond. All housed in a wonderful building - the upper floor with library gallery is particularly impressive. There is no cafe and only a rudimentary shop but this doesn't detract from the serious business of enjoying Catalonia's rich and diverse history. Personally, I would put it in the top five of places to visit but perhaps it is best kept as a secret!", "publishedDate": "2016-06-05", "language": "en", "rating": 5}, {"id": 350838865, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d244206-r350838865-Museum_of_Archaeology_of_Catalonia_Museu_Arqueologic_de_Catalunya-Barcelona_Catal.html", "text": "As a fan of archaeology and ancient history, I was anxious to visit this museum. However, its displays are few, badly described or written, and full of facsimiles. There is a movie shown that is frankly either high camp or poorly made film. My husband and I had a good laugh at it. There are no places to sit down should one need to do so.", "publishedDate": "2016-02-25", "language": "en", "rating": 2}, {"id": 340238613, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d244206-r340238613-Museum_of_Archaeology_of_Catalonia_Museu_Arqueologic_de_Catalunya-Barcelona_Catal.html", "text": "It is a very interesting museum dedicated to illustrate the evolution of Catalonia through its archeological relics. I presume that this is interesting only to history buffs, like me, but give it a chance, you won’t regret. Further more, the museum is situated in former Palace of Graphic Arts, a magnificent building which was built for the 1929 International Exposition, just like so many others in the neighborhood.", "publishedDate": "2016-01-15", "language": "en", "rating": 5}, {"id": 334683092, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d244206-r334683092-Museum_of_Archaeology_of_Catalonia_Museu_Arqueologic_de_Catalunya-Barcelona_Catal.html", "text": "Very well laid out museum with superb exhibits . Original artefacts , videos and replicas all well labeled . Good use of modelling . Walked down from the art museum but on a bus route .", "publishedDate": "2015-12-23", "language": "en", "rating": 5}, {"id": 329438819, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d244206-r329438819-Museum_of_Archaeology_of_Catalonia_Museu_Arqueologic_de_Catalunya-Barcelona_Catal.html", "text": "This museum is interesting to visit if you are interested in history.  It must be noted that a lot of the signage is not in English.  Entry is free with the Barcelona Card.", "publishedDate": "2015-11-27", "language": "en", "rating": 4}, {"id": 328639577, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d244206-r328639577-Museum_of_Archaeology_of_Catalonia_Museu_Arqueologic_de_Catalunya-Barcelona_Catal.html", "text": "We enjoyed this museum which is not too far from the Catalonian Art Museum.  The exhibits range from pre history, to  Greeks, Romans and Visigoths.  They are displayed in chronological order.  We enjoyed it all but there was very little in English.  There is wonderful exhibit of Roman glass which is a particular favourite of mine.  This is displayed in a circular room.   It is amazing that the Romans were so skilful at glass blowing and that such delicate pieces are still intact.  Some must be 2000 years old.   There are colourful Greek vases and some wonderful mosaics.  What patience to make the tiny tiles, choose the colours and put then in place.  I think that we paid a seniors price of €3.10 to go in.", "publishedDate": "2015-11-23", "language": "en", "rating": 5}, {"id": 318185377, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d244206-r318185377-Museum_of_Archaeology_of_Catalonia_Museu_Arqueologic_de_Catalunya-Barcelona_Catal.html", "text": "The museum was really interesting, good exhibitions. But please note-there is no information in English, all explanations and descriptions next to showpieces are in Spanish and Catalan. ", "publishedDate": "2015-10-12", "language": "en", "rating": 4}, {"id": 316194187, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d244206-r316194187-Museum_of_Archaeology_of_Catalonia_Museu_Arqueologic_de_Catalunya-Barcelona_Catal.html", "text": "This wonderful museum is about a 10-15 minute downhill walk from the big Art Museum on Mt. Juic. It was quite empty on the Sat. we visited.  Very nice collection of old stuff from the early days of Spain thru Greek-Roman periods, & up to modern times.\nA couple of good films worth watching.  Especially liked the fertility God statue, with its\nimpressive endowment.  Another 10 minute downhill walk takes you to a couple of Metro stops, and a non-touristy working class neighborhood.", "publishedDate": "2015-10-04", "language": "en", "rating": 4}, {"id": 314245387, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d244206-r314245387-Museum_of_Archaeology_of_Catalonia_Museu_Arqueologic_de_Catalunya-Barcelona_Catal.html", "text": "A fantastic selection of artefacts laid out in orders from Stone Age through Iberian Neolithic settlers, through to Greek & Romans, so you can walk around as if travelling through time. Some items were with English information but not many, which is the only fault I have with this rather excellent museum. If you have only a passing interest in this sort of museum it is still an essential place to visit whilst in Barcelona. Some great mosaics, and wonderful condition pieces on display, all very well presented. Delightful!!", "publishedDate": "2015-09-28", "language": "en", "rating": 5}, {"id": 303933323, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d244206-r303933323-Museum_of_Archaeology_of_Catalonia_Museu_Arqueologic_de_Catalunya-Barcelona_Catal.html", "text": "A somehow modest but interesting museum where you can spend close to 2 hours admiring the artifacts and various objects held there.\nMany explications given all along the tour with the origins of the different people and animals who lived in the region, their evolution, tools, housing etc...\nThey offer family rate to make it affordable and attractive.\nA good museum to visit.", "publishedDate": "2015-08-26", "language": "en", "rating": 4}, {"id": 288009283, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d244206-r288009283-Museum_of_Archaeology_of_Catalonia_Museu_Arqueologic_de_Catalunya-Barcelona_Catal.html", "text": "First the pros: this is a nice little museum, well laid out, and is a wonderful alternative to some of the more crowded sites on a busy day - we practically had the place to ourselves on a Saturday afternoon. There were some nice displays, and in particular the Greek & Roman artifacts were plentiful. I felt the location easy to find, and would definitely recommend it for either the way down the hill from fort (climbing up would be rough!) or else in conjunction with the Art museum and/or fountains, which are very close.\n\nThe cons: Everything is in Catalan, most things are also in Spanish, and a very small number of things are in English. The entire first section can't really be understood if you're a tourist, although you can get the gist of it. The A/C in the first half is nice, but when you get to the big room, it doesn't have any, which makes the last room (on the second floor) hot. The Roman artifacts aren't in the best shape, and the timeline rather bluntly stops after them - I was really hoping for some Moorish history too. The pricing was unusual - only kids under 8 were free. We had to pay for our 10 year-olds for the first time on the trip, so for our family of 5 the \"reduced\" rate was 17.50 Euros, which is a tad high for one of the lesser museums.\n\nAll-in-all, I'd say this is a nice little side stop, esp. if you have time to kill before the fountains.", "publishedDate": "2015-07-11", "language": "en", "rating": 3}, {"id": 286999883, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d244206-r286999883-Museum_of_Archaeology_of_Catalonia_Museu_Arqueologic_de_Catalunya-Barcelona_Catal.html", "text": "This museum is a great find. I took a hop on hop off bus here as it was on Montjuc Hill. The views were the best in the city and the exhibits inside the museum were very educational and interesting.", "publishedDate": "2015-07-08", "language": "en", "rating": 4}, {"id": 275328695, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d244206-r275328695-Museum_of_Archaeology_of_Catalonia_Museu_Arqueologic_de_Catalunya-Barcelona_Catal.html", "text": "Yes, if you find it you are lucky. We were visiting with a Barcelona friend and the taxi driver, also a Barcelonian, couldn't find the place. She let us off at the Ethnological Museum! It wasn't in her guide book which she surfed as she drove; that's like a Six Flags ride! The museum was very empty of humans, just like the reviews indicated. At times the lights were too dim, the labels were in Catalonian or Spanish and the director of this museum has truly missed the boat when it comes to attracting visitors. It was well designed, well organized and small enough to enjoy within an hour or two. You got a picture of life in Catalonia from neolithic times to the middle ages and having a Spanish friend help with the descriptions was an asset. If you like museums you'll appreciate this one. All you have to do is find it!", "publishedDate": "2015-05-28", "language": "en", "rating": 5}, {"id": 259382562, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d244206-r259382562-Museum_of_Archaeology_of_Catalonia_Museu_Arqueologic_de_Catalunya-Barcelona_Catal.html", "text": "The Museum of Archaeology of Catalonia (Museu Arqueologic de Catalunya) is a beautiful museum located on the Montjuic hill. It is just before the Teatre Grec and the Fundacio Miro and the MNAC. Good exhibits, a nice ambience and a pleasant, un-rushed experience. The building is a lovely art deco structure with Greek, Roman and prehistoric exhibits on display. Recommended!", "publishedDate": "2015-03-14", "language": "en", "rating": 4}, {"id": 241084824, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d244206-r241084824-Museum_of_Archaeology_of_Catalonia_Museu_Arqueologic_de_Catalunya-Barcelona_Catal.html", "text": "Excellent and all is well maintened here.... not like in Italy! Clean ambiente, the guide was young and perfect in telling us all what we needed to know. We had also dinner there, and this was not as good as the visit... but this will be another review. 100% reccomended.", "publishedDate": "2014-11-23", "language": "en", "rating": 4}, {"id": 228835498, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d244206-r228835498-Museum_of_Archaeology_of_Catalonia_Museu_Arqueologic_de_Catalunya-Barcelona_Catal.html", "text": "This museum is not shown on the free tourist map and there are few directional signs for it in the park.  Other reviewers say it's very quiet.  I think that's because no one can find it.\n\nTake the metro to Espanya.   Start walking on Av. Paral lel toward the metro stop, Poble Sec. Turn right on Lleida, a major street.  Continue walking on Lleida until you see the Teatre Lliure on your left.  Turn the corner to go to the front of Teatre Lliure  The archeological museum is directly across the street.\n\nUnfortunately, all the labelling in the museum is in Catalan.  Some rooms also have Spanish and a couple, for reasons unknown, actually have English, which makes viewing much more enjoyable.  \n\nLots of old things but I would appreciate them much more if I knew what they were.\n\nThere's a discount for seniors.", "publishedDate": "2014-09-14", "language": "en", "rating": 3}, {"id": 211104200, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d244206-r211104200-Museum_of_Archaeology_of_Catalonia_Museu_Arqueologic_de_Catalunya-Barcelona_Catal.html", "text": "We toured this building all on our own. The place was devoid of tourists - which was nice - but obviously it is not a big eye catcher. The site is expansive and shows the history of the region in sequences of time - as most archeological sites do. Much of interest, much to see and touch. The only negative we had was the lack of translation for foreign visitors - some displays had notices or placards in other languages but most were in Spanish thus limiting the understanding to us tourists - an unfortunate oversight and perhaps contributing to the vacant atmosphere.", "publishedDate": "2014-06-19", "language": "en", "rating": 3}, {"id": 207524927, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d244206-r207524927-Museum_of_Archaeology_of_Catalonia_Museu_Arqueologic_de_Catalunya-Barcelona_Catal.html", "text": "Don t Go here before 31 August 2014. The modern art section and the Baroq are closed for renovation. So you Miss Gaudí, miro, dali, Picasso and Just have the prehistorie and religious art. Well mayby thats your thing...\nTo Go here or see miro foundation THE metro parallel and than the free funiculaire (Same ticket As metro). Just a 10 minutes walk to miro, 15 to catalunya museum.\n", "publishedDate": "2014-05-28", "language": "en", "rating": 1}, {"id": 202935838, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d244206-r202935838-Museum_of_Archaeology_of_Catalonia_Museu_Arqueologic_de_Catalunya-Barcelona_Catal.html", "text": "A rather large but seemingly overlooked place given only a few locals and no tourists visited at the same time as us. This gave the place a nice atmosphere and plenty of calmness to enjoy the objects on exhibit. Everything is very well organised and they have a very impressive neolithic collection. The Balearic and Iberian collections were also good and the top floor has a large beautiful room with Roman objects from Barcino. Drawbacks were the poor information in English and an almost non-existing Visigoth collection. Also missing some Moorish and Cathaginian collections to match the historical chronography of the region. ", "publishedDate": "2014-04-27", "language": "en", "rating": 4}, {"id": 180966462, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d244206-r180966462-Museum_of_Archaeology_of_Catalonia_Museu_Arqueologic_de_Catalunya-Barcelona_Catal.html", "text": "Okay, so there were drawbacks - the first section on prehistoric archeology was only in Catalan (though my knowledge of Castellano is strong enough that I was able to get the gist of it), and it can be hard to find, but it is so worth it!  One of my favorite archeological museums of all time.  And so worth the price, which is super cheap.  Also, never busy.  So, if you're in Barcelona and are interested in archeology, visit this museum!  You may be the only one there, which is pretty cool.  And because I'm biased - be sure to check out the room dedicated to the archeology of the Balearic Islands.  That is some awesome and little-known history.  So, for all you hard-core archeology geeks and nerds out there - add this to your itinerary!", "publishedDate": "2013-10-14", "language": "en", "rating": 5}, {"id": 175502726, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d244206-r175502726-Museum_of_Archaeology_of_Catalonia_Museu_Arqueologic_de_Catalunya-Barcelona_Catal.html", "text": "Enjoyed our visit. Exhibit reasonably large. Most descriptions of items are not in english, so that was a challenge since we do not speak spanish , italian or french. If you do, you will probably be ok. We understood some french, so that helped. Reasonable entrance fee.  Not crowded with tourists and that was just so nice on its own. Whole area surrounding museum is lovely with lots of other attractions to see. Very enjoyable afternoon.", "publishedDate": "2013-09-03", "language": "en", "rating": 4}, {"id": 156146806, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d244206-r156146806-Museum_of_Archaeology_of_Catalonia_Museu_Arqueologic_de_Catalunya-Barcelona_Catal.html", "text": "It is a very interesting museum to look round particularly if you have any interest in Archaeology. Having come from the UK, where museums are focused on UK and Northern Europe it was refreshing to see a focus on the Mediterranean, which has had different influences in its development (particularly the climate). The museum offered artefacts in a modern setting but it did not overly push the interactive displays. I would recommend the museum to anyone who enjoys looking round a museum and is in the area. The entry price is very reasonable compared to many attractions in Barcelona. Around a third of the displays do not have an English translation, which some English speakers may find frustrating but it appears that newer displays and visiting exhibitions are getting English translations.\n\nI would recommend visiting this museum if you are in the area and looking for something to do.", "publishedDate": "2013-03-31", "language": "en", "rating": 4}, {"id": 149966707, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d244206-r149966707-Museum_of_Archaeology_of_Catalonia_Museu_Arqueologic_de_Catalunya-Barcelona_Catal.html", "text": "The historical implications and roman influences are worth the time to see as the basic culture of Barcalona (different from the rest of Spain) is attributed. give your self 2-3 hours minimum though you could spend more.", "publishedDate": "2013-01-18", "language": "en", "rating": 4}, {"id": 141802633, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d244206-r141802633-Museum_of_Archaeology_of_Catalonia_Museu_Arqueologic_de_Catalunya-Barcelona_Catal.html", "text": "The Archaeological Museum is located at the foot of Montjuic and is located in the Palace of Graphic Arts that was constructed for the 1929 International Exhibition. The museum traces the roots of Catalunya since prehistoric times. There is a terracotta sculpture of the Lady of Tanit, from Phoenician times. The Roman remains are some of the more interesting exhibits in the museum. On the ground floor are two Roman mosaics that are inset into the floor. The second floor has a very large mosaic, called the Circus Mosaic, that is incomplete, that shows men and animals that were in the circus. There are sarcophagi that have beautiful sculptures on the sides. Another masterpiece is the mosaic of the Three Graces. Another important work is the Visigothic votive crown that is made of gold and jewels. This is part of the treasure of Torredonjimeno of Jaen, that was discovered in 1926 in an olive field.", "publishedDate": "2012-10-01", "language": "en", "rating": 4}, {"id": 136707554, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d244206-r136707554-Museum_of_Archaeology_of_Catalonia_Museu_Arqueologic_de_Catalunya-Barcelona_Catal.html", "text": "Surprising, only few visitors, many artifacts, in time of my visit was a temporary Otzi (Austrian mummy) exhibit, clean and good organized.", "publishedDate": "2012-08-09", "language": "en", "rating": 4}, {"id": 135334298, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d244206-r135334298-Museum_of_Archaeology_of_Catalonia_Museu_Arqueologic_de_Catalunya-Barcelona_Catal.html", "text": "With one simple walk you go from.the beginning of mankind to ancient civilizations. Well organized, with a great story to follow it's an several hours of information and enjoyment. Loved it :-)", "publishedDate": "2012-07-25", "language": "en", "rating": 5}, {"id": 121967979, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d244206-r121967979-Museum_of_Archaeology_of_Catalonia_Museu_Arqueologic_de_Catalunya-Barcelona_Catal.html", "text": "on a wet , windy day i was the only visitor to this comprehensive museum .If you like neolithic pottery or ancient Roman statues this is the place for you.For an hour i enjoyed viewing this fantastic collection in complete solitude ! and it was free", "publishedDate": "2011-12-21", "language": "en", "rating": 4}, {"id": 114772278, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d244206-r114772278-Museum_of_Archaeology_of_Catalonia_Museu_Arqueologic_de_Catalunya-Barcelona_Catal.html", "text": "To begin with, everything is in Catalan, with no translation whatsoever. It was empty on a Saturday afternoon, so the air conditioner was off and there was a lady cleaning the glasses as we weren't there. Useless!", "publishedDate": "2011-06-26", "language": "en", "rating": 1}, {"id": 718066, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d244206-r718066-Museum_of_Archaeology_of_Catalonia_Museu_Arqueologic_de_Catalunya-Barcelona_Cataloni.html", "text": "The Museu Arqueologic is situated away from the busy port area and tourist centre, on a hillside to the west. It features clearly displayed artefacts from the eneoloithic period through to the Visigothic (7th century AD). On my \nvisit (October, 2002) the museum was nearly empty, allowing me to study the materials in some detail.\nThe museum's main disadvantages for the tourist are the lack of English captions for most displays (all in Catalan), lack of refreshments onsite and the distance from the city centre.\nHowever, the 'guide' leaflet is available in English and taxis are very cheap (about EUR 3 from the Placa de Catalunya) and the walk back is mostly downhill! With so many bars and cafes in the area, there would be no sense in \ncreating one just for museum visitors.\nI enjoyed the museum very much (I wanted to see the Visigothic finds) and found the staff friendly and helpful. While not to everyone's taste, the facility deserves to be better known.\n", "publishedDate": "2002-10-16", "language": "en", "rating": 4}]}}]