[{"locationId": 8692638, "name": "Edifici de la Caixa de Pensions", "placeType": "ATTRACTION", "reviewListPage": {"reviews": [{"id": 690183040, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d8692638-r690183040-Edifici_de_la_Caixa_de_Pensions-Barcelona_Catalonia.html", "text": "Not sure why this is on TripAdvisor as the Facade of the building belonging to Caixa bank. The building is built in a mixture of Catalan Modernism, Art Deco, Neo-Mudejar and Neo-Gothic. The spire on the south west corner clearly takes it’s cue from Art Deco with it’s long straight crisp clean soaring lines. Two of the corners on the south-east and north west takes it cue from Neo-Mudejar. The rest of the building is influenced by Neo-Gothic especially the design of the windows and stained glass.\n\nIt’s exterior is exceptionally intricate for it's Gothic themes, but don’t go out of the way to see it.", "publishedDate": "2019-07-16", "language": "en", "rating": 4}, {"id": 672061117, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d8692638-r672061117-Edifici_de_la_Caixa_de_Pensions-Barcelona_Catalonia.html", "text": "This Pension Fund building is located on the busy Via Laietana street near Palau de la Musica Catalana.\n\nIt is an emblematic modernist building with Gothic inspiration. It was completed in 1917 to be the headquarters of the Caixa de Pensions. \n\nThe tower is inspired by the Central European gothic churches.", "publishedDate": "2019-05-07", "language": "en", "rating": 4}, {"id": 505257287, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d8692638-r505257287-Edifici_de_la_Caixa_de_Pensions-Barcelona_Catalonia.html", "text": "If you go to the Palace of Catalan Music look up Via Laietana to see this building. It was Designed by Enric Sagnier who does not get much recognition behind Gaudi, Domenech and Puig but did several great building like this one and Sagrat Cor on  Tibidabo.  It is another great building in a city with so much architectural greats.", "publishedDate": "2017-07-24", "language": "en", "rating": 3}]}}]