[{"locationId": 13154025, "name": "Prision La Modelo", "placeType": "ATTRACTION", "reviewListPage": {"reviews": [{"id": 715726171, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d13154025-r715726171-Prision_La_Modelo-Barcelona_Catalonia.html", "text": "Interesting prison with dark past of political executions. Worthwhile if you are interested in Civil War era history. But bring your Google translate app because the interpretative signs are not in English and staff was not able to help.", "publishedDate": "2019-10-06", "language": "en", "rating": 3}, {"id": 626744669, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d13154025-r626744669-Prision_La_Modelo-Barcelona_Catalonia.html", "text": "Entrance is free but only open certain times interesting for those interested in the history of Barca.", "publishedDate": "2018-10-20", "language": "en", "rating": 4}, {"id": 583395420, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d13154025-r583395420-Prision_La_Modelo-Barcelona_Catalonia.html", "text": "I was specially invited by a colleague who gave my students and I a personalized tour of this former prison. The city is in the process of deciding what to do with this place, whether to use it for housing, as a greenway or as a museum or some combination of all three. I think they should strongly consider making it a tourist attraction ala Alcatraz and Eastern Penitentiary in the US. While now it is really just an empty prison, it is also a time capsule of 20th Century Spanish/Catalunyan history and it should be preserved and enhanced, but it needs considerable investment for that to happen. But I think they will find it worth the effort and expense.", "publishedDate": "2018-05-28", "language": "en", "rating": 4}, {"id": 574793598, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d13154025-r574793598-Prision_La_Modelo-Barcelona_Catalonia.html", "text": "This prision counts with 113 years, now is closed, but it was running until las year. It's a mysterious and dark place. Here the anarchist Puig Antich was murderes, so it's a sad place. Also when you go in the atmosphere is sad. But it deserves a visit to understand what is a prison.", "publishedDate": "2018-04-21", "language": "en", "rating": 5}, {"id": 566008461, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d13154025-r566008461-Prision_La_Modelo-Barcelona_Catalonia.html", "text": "The prison La Modelo was a visit to experience the sensation of living behind bars. There are no guided tours, so if you want to know anything about it you should read up about it before you go. At present its only open Friday pm and all day Saturday. \nYou can see the old barbers, library, some of the cells, visitors room with glass partition to talk to your visitor, patio for exercise and the control hub.", "publishedDate": "2018-03-12", "language": "en", "rating": 3}]}}]