[{"locationId": 244208, "name": "Museo Egipci de Barcelona", "placeType": "ATTRACTION", "reviewListPage": {"reviews": [{"id": 745828298, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d244208-r745828298-Museo_Egipci_de_Barcelona-Barcelona_Catalonia.html", "text": "It was a great pleasure to take my 11 years old daughter with me and see her face watching mummies, ancient utensils, decorations and clothes. The museum is very well organized. Advice: before you go check working hours!", "publishedDate": "2020-02-17", "language": "en", "rating": 5}, {"id": 736041124, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d244208-r736041124-Museo_Egipci_de_Barcelona-Barcelona_Catalonia.html", "text": "The wonderful museum is in a great location close by La Pedrera ,exhibits are very interesting.The entry fee 12 eur. audioguide provided , friendly staff , nice gift shop and cafe on the rooftop... plenty of stairs", "publishedDate": "2020-01-01", "language": "en", "rating": 5}, {"id": 723226106, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d244208-r723226106-Museo_Egipci_de_Barcelona-Barcelona_Catalonia.html", "text": "So very easy to find, this museum displays the exhibits to beautifully and you can get up really close to the artefacts.  A great variety but not too big, kept our attention to the end.  A must do.", "publishedDate": "2019-11-02", "language": "en", "rating": 5}, {"id": 713146603, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d244208-r713146603-Museo_Egipci_de_Barcelona-Barcelona_Catalonia.html", "text": "A wonderful collection founded by Jordi Clos to promote the awareness of ancient art and culture of Ancient Egypt.  A must for Egyptology buffs....pieces not seen in most museums along with excellent explanations in English, Catalonian and Spanish.  The \"temporary\" King Tut exhibit has apparently been there for 5 years and is a great collection of photographs of the discovery of the King Tut tomb.....separate laminated cards explain the story of photos in different languages.  A nice little gift shop to round things out.  Your ticket is good for the entire day so you can leave for lunch and return if you want.", "publishedDate": "2019-09-26", "language": "en", "rating": 5}, {"id": 694195416, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d244208-r694195416-Museo_Egipci_de_Barcelona-Barcelona_Catalonia.html", "text": "I visited the museum with my 9 years old son who had just studied the ancient Egyptian civilization and How old Egyptians could brilliantly keep and preserve their bodies for thousands of years and prepare for the journey to the after life .. He also learned about many king and queens , Gods and Goddess in the time of pharos .. all that and more he saw with his awn eyes in a great presentation in that wonderful museum in the heart of Barcelona .. that surely was worth the visit .", "publishedDate": "2019-07-30", "language": "en", "rating": 5}, {"id": 656284787, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d244208-r656284787-Museo_Egipci_de_Barcelona-Barcelona_Catalonia.html", "text": "Some very interesting pieces and a must for anyone interested in Egyptology. A nice quiet few hours of rest bite from the hustle and bustle on the streets. I was enthralled, but you may need a specialist interest in Ancient Egypt to fully appreciate this museum. Luckily it’s one of my great passions so I had a ball!", "publishedDate": "2019-03-04", "language": "en", "rating": 4}, {"id": 654807005, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d244208-r654807005-Museo_Egipci_de_Barcelona-Barcelona_Catalonia.html", "text": "This is a beautiful collection with many items that I have not seen before even in the British Museum or Tutankhamun exhibits.  It's quiet and you can download an app to listen to information about the items. Sadly our phones were out of power so we had to make do with the translated written material. One floor has no translation at all, leaving non-Spanish speakers to guess where items came from and represent.  Small gift shop has some interesting items, many of which come from the British Museum gift shop. Worth a visit.", "publishedDate": "2019-02-25", "language": "en", "rating": 5}, {"id": 654730375, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d244208-r654730375-Museo_Egipci_de_Barcelona-Barcelona_Catalonia.html", "text": "The museum is fairly small but interesting, probably not worth the entrance fee if your not too into Ancient Egypt though.\n\nI know it was a temporary exhibition but the bottom floor didn’t have any English translations which was a pity. ", "publishedDate": "2019-02-25", "language": "en", "rating": 4}, {"id": 647997772, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d244208-r647997772-Museo_Egipci_de_Barcelona-Barcelona_Catalonia.html", "text": "We visited the Museo Egipcio (Egyptian Museum) during our recent visit to Barcelona. The museum is centrally located near Plaça de Catalunya. It is, in fact, not really a museum but more of a collection. There are only two main floors with an area for special exhibitions. This might not be a good place for those who do not have an interest in the subject, but it is a fun way to spend a couple of hours if you do.", "publishedDate": "2019-01-24", "language": "en", "rating": 4}, {"id": 639370919, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d244208-r639370919-Museo_Egipci_de_Barcelona-Barcelona_Catalonia.html", "text": "Nice little place with permanent collection. We were told that the entrance is free of charge which is not completely true. I attach a photo with categories of people for whom the entrance is free of charge and also those who need to pay and what are the charges. Irregardless of the price, this little museum is a worth visiting place. ", "publishedDate": "2018-12-13", "language": "en", "rating": 4}, {"id": 632188803, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d244208-r632188803-Museo_Egipci_de_Barcelona-Barcelona_Catalonia.html", "text": "The museum is located close to Passeig de Gracia and the entry is free with Barcelona Card. \nThe museum offers a nice insight in the Egyptian history and culture. The permanent exhibits are displayed on on ground floor and 1st floor, temporary exhibits being located in the lower ground floor. \nThe permanent exhibits deals with the figure of the Pharaoh and the royal family, jewelry, stonework & pottery, funerary practices, temple cult and gods of Egypt.", "publishedDate": "2018-11-09", "language": "en", "rating": 5}, {"id": 631222575, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d244208-r631222575-Museo_Egipci_de_Barcelona-Barcelona_Catalonia.html", "text": "Our visit to the Museum was good.  They had a decent organization of artifacts but still felt like some context was missing.  Several language translations were offered, so getting information on each artifact was ok.  The app which is available via wifi did not quite live up to the hype - I had hoped to gain a lot more insight into the exhibits but found little information at all.  The space is not large (three small floors) but there is some density of display.  A new display about Carter's discovery of Tutankhamun was not quite completed.", "publishedDate": "2018-11-06", "language": "en", "rating": 4}, {"id": 618091201, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d244208-r618091201-Museo_Egipci_de_Barcelona-Barcelona_Catalonia.html", "text": "A small museum but nice. Not many pieces but good quality of the ones that are. A shop with egyptian statues.", "publishedDate": "2018-09-19", "language": "en", "rating": 3}, {"id": 608732912, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d244208-r608732912-Museo_Egipci_de_Barcelona-Barcelona_Catalonia.html", "text": "Old fashioned small museum. \n\nNot bad experience but there are many much more interesting places to visit in Barcelona.", "publishedDate": "2018-08-21", "language": "en", "rating": 2}, {"id": 604333085, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d244208-r604333085-Museo_Egipci_de_Barcelona-Barcelona_Catalonia.html", "text": "Great museum! Very interesting collections, some of the objects are very rare. A big thank you to the curator for the installations of the tomb, the chapel and one of the inner chambers with an offering table;this type of visualiisation helps the learning process and understanding immensely!", "publishedDate": "2018-08-08", "language": "en", "rating": 5}, {"id": 575703637, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d244208-r575703637-Museo_Egipci_de_Barcelona-Barcelona_Catalonia.html", "text": "While this is a small museum, (you can see it all in 30 minutes to an hour), the price is higher than other local museums. This makes it a poor value. For example a trip to the National Museum of Catalunya cost 8 € and we spent hours upon hours there. Compared to other national museums in the world that is a small one. This Egyptian museum cost 22€ to enter. It had some very interesting items and reproductions, it is not plentiful enough to warrant the price. Particularly for students/children. This museum needs to grow and add something more substantial to the experience or do something more engaging. ", "publishedDate": "2018-04-25", "language": "en", "rating": 3}, {"id": 573459327, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d244208-r573459327-Museo_Egipci_de_Barcelona-Barcelona_Catalonia.html", "text": "For a museum with such a good reputation (at least so it seems online), I was surprised by the rather small size of it.  The next surprise was the amount of time I end up spending in that small museum.  I don't often read a lot of the descriptions in a museum (tending to get bored easily), but in this case I kept reading: for me it was the perfect middleground between too general and too detail-oriented.", "publishedDate": "2018-04-15", "language": "en", "rating": 4}, {"id": 571487236, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d244208-r571487236-Museo_Egipci_de_Barcelona-Barcelona_Catalonia.html", "text": "Barcelona and it rained. What to do? I was close to the Egyptian Museum. The entry fee was 12 EUR but included an audio guide. Quite expensive but it rained. Better dry and warm inside than wet and cold outside. Friendly staff at the reception which asked me all the possible reasons to get a reduction but I had to deny all. Paid 12 EUR and got the entry ticket with a password for the internet in order to use the app with the audio guide. Tried at the entrance the password several times, it did not work. Another visitor had the same problems. We got the advice to go a little bit inside, the signal should be better there. I went inside but still no connection. Back to the entrance counter and I got the explanation that the internet encounters difficulties when it is raining. Thus, I visited without an audio guide which was not really fun. Also because the written information for interesting pieces was mainly in Catalan, the English or Spanish text was very small. Very client oriented for a museum which will attract visitors who have no knowledge of Catalan! I had better gone to take a coffee somewhere.", "publishedDate": "2018-04-06", "language": "en", "rating": 2}, {"id": 571113388, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d244208-r571113388-Museo_Egipci_de_Barcelona-Barcelona_Catalonia.html", "text": "This museum although might be a nice choice on a rainy day is just too expensive for what it is. \nIt has three small floors and although it might not be a problem, the descriptions of the items are in English only in the first two while the last one has them only in Català but you can read the translation in some sheets displayed at the very beginning of the exhibit. Of course, you can't take the sheet with you otherwise, the rest of the people there won't be able to read them and that might be uncomfortable. I like to read while having the artefact/mummy/pottery piece right in front of me.\nI am not sure if that happens all the time or it was just that time I went.\nIt was nice and interesting but it was surely pricy for what it is. ", "publishedDate": "2018-04-04", "language": "en", "rating": 3}, {"id": 570819584, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d244208-r570819584-Museo_Egipci_de_Barcelona-Barcelona_Catalonia.html", "text": "It's quite a small museum. We were done in 30 minutes of looking around and taking pictures. We didn't read much of the information. The collection is a reasonable quality with some good looking pieces. It's worth visiting if you get a combined ticket with another attraction but I'm not sure it's worth the entrance fee alone", "publishedDate": "2018-04-03", "language": "en", "rating": 4}, {"id": 570784423, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d244208-r570784423-Museo_Egipci_de_Barcelona-Barcelona_Catalonia.html", "text": "A small museum but with a very good collection of exhibits and with rotatign temporary exhibitions.\nWell worth a visit", "publishedDate": "2018-04-03", "language": "en", "rating": 4}, {"id": 557334052, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d244208-r557334052-Museo_Egipci_de_Barcelona-Barcelona_Catalonia.html", "text": "If you are a fan of Egyptian history you will enjoy the museum. It is relatively small but with quality exhibits. Worth spending an hour + and get some additional insight and education about the very reach culture of the Egyptian dynasties.", "publishedDate": "2018-01-30", "language": "en", "rating": 4}, {"id": 543778879, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d244208-r543778879-Museo_Egipci_de_Barcelona-Barcelona_Catalonia.html", "text": "Stairs. A bit confusing, not a straight guided path. Not everything is in English. For interested minds.", "publishedDate": "2017-11-28", "language": "en", "rating": 3}, {"id": 543718266, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d244208-r543718266-Museo_Egipci_de_Barcelona-Barcelona_Catalonia.html", "text": "This is my 1st visit and I'll do it again every time I'm in Barcelona , well organized details about the Egyptian history and information about most of the important details of our fascinating art and history .", "publishedDate": "2017-11-27", "language": "en", "rating": 4}, {"id": 538606986, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d244208-r538606986-Museo_Egipci_de_Barcelona-Barcelona_Catalonia.html", "text": "We heard about the Egyptian Museum while on the Hop on Hop off Bus .. So as we love History we had to visit. So glad we did . The Museum is not Huge but covers 4 floors . Very modern building . It is very informative with exhibits on 3 floors and a Café on the Rooftop Terrace . As Tourists with limited Spanish we were pleased to find most of the signage is in English as well as Spanish . The Exhibits are very interesting . They even have a couple of Mummies .Overall a very interesting and enjoyable visit , recommended for anyone interested in Egyptian History . Well priced .", "publishedDate": "2017-11-05", "language": "en", "rating": 4}, {"id": 538486429, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d244208-r538486429-Museo_Egipci_de_Barcelona-Barcelona_Catalonia.html", "text": "We were staying at Hotel Claris, which offers admission to the museum. We were pleasantly surprised. This is a well curated museum on two floors, with a library/special exhibits area. It is not huge, but is very well done. I’d give it about 90 minutes for a cursory view, more if you are truly into Egyptian artifacts. ", "publishedDate": "2017-11-05", "language": "en", "rating": 5}, {"id": 532591113, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d244208-r532591113-Museo_Egipci_de_Barcelona-Barcelona_Catalonia.html", "text": "This was mostly a waste of time on our part.  Two medium sized rooms with no audio guide as a permanent exhibition and a room with no English translation holding a temporary exhibition. The exhibits have just a short description, the museum tells no tale. If you are short on time,  choose something else. ", "publishedDate": "2017-10-13", "language": "en", "rating": 2}, {"id": 528462331, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d244208-r528462331-Museo_Egipci_de_Barcelona-Barcelona_Catalonia.html", "text": "Ok so I’m biased as an Egyptologist, but this small looking museum which is from a mainly private collection is truly stunning. There actually three levels and on my visit there were two temporary exhibitions on to compliment the main artifacts on permanent display. Sacred Animals and Tutankhamen the discovery are currently on. Check their website for details! The museum itself is well laid out with a paper map and audio tour if required. Most labels were in Spanish/English but not the temporary exhibitions. There is a small shop next to and around the ticket desk and at €12 this place rocks!", "publishedDate": "2017-09-30", "language": "en", "rating": 5}, {"id": 526305381, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d244208-r526305381-Museo_Egipci_de_Barcelona-Barcelona_Catalonia.html", "text": "We were very impressed with this museum. It has some beautiful and fascinating artefacts from ancient Egypt, including a few mummies and some stunning jewellery!", "publishedDate": "2017-09-21", "language": "en", "rating": 5}, {"id": 510942589, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d244208-r510942589-Museo_Egipci_de_Barcelona-Barcelona_Catalonia.html", "text": "This museum was one of the best curated museums I've been to; it was beautifully presented, seemed brand new and super modern, with small descriptions that weren't overwhelming but were very interesting. All of the descriptions were in Spanish and English except for the temporary exhibit which only had Spanish descriptions (but we were ok with that as much of it was self explanatory). The variety of items on display is good, with a few mummies and organ jars, as well as everyday items such as make up pots and beds. Overall the focus was on death and the afterlife as many Egyptian exhibits are, and it was genuinely fascinating! ", "publishedDate": "2017-08-10", "language": "en", "rating": 4}, {"id": 504034049, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d244208-r504034049-Museo_Egipci_de_Barcelona-Barcelona_Catalonia.html", "text": "Many mummies, many many burial artifacts. One of the best Egyptian collections I've seen.\nIncludes a section on animals in Egyptian art, and another that presents artifacts that are similar to those found in King Tut's tomb - along with pictures that illustrate those similarities. ", "publishedDate": "2017-07-20", "language": "en", "rating": 4}, {"id": 501937641, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d244208-r501937641-Museo_Egipci_de_Barcelona-Barcelona_Catalonia.html", "text": "A number of artifacts can be appreciated in this museum however the bottom floor did not have and translations into English.", "publishedDate": "2017-07-14", "language": "en", "rating": 3}, {"id": 491284909, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d244208-r491284909-Museo_Egipci_de_Barcelona-Barcelona_Catalonia.html", "text": "One of my favorite stops in Barcelona.\n\nDifferent...but really worth a visit.\n\nSmall...well displayed....tons of information....a hidden gem.\n\nKeep in mind it's closed from 14:00 - 16:00.", "publishedDate": "2017-06-07", "language": "en", "rating": 5}, {"id": 481313493, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d244208-r481313493-Museo_Egipci_de_Barcelona-Barcelona_Catalonia.html", "text": "Looking forward to visiting this museum based on reviews. Brought two kids (5 and 8) and initial expectations good as they had a childrens pack (albeit €3) so thought it was going to be suitable, Museum layout very nice and informative in 3 languages (catalan, castellano and english), BUT, the most interesting floor based around tutenkanum is ONLY in Catalan. A strange choice given it is supposedly for tourists, We spent only half an hour here as the cafeteria on the top floor was closed. €32 for the family was an expensive option for little entertainment overall. Disappointing. Better for adults and as I say, top two floors interesting but small.", "publishedDate": "2017-05-03", "language": "en", "rating": 2}, {"id": 479649803, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d244208-r479649803-Museo_Egipci_de_Barcelona-Barcelona_Catalonia.html", "text": "Probably wouldn't have visited if it hadn't been raining, but we would have missed out.  This collection is presented in a very accessible way with information in Spanish and English, except in the temporary Tutankhamun exhibition where it is only Spanish.  There is a cafe but I think it was shut when we visited.  The entry price isn't cheap but the museum is good and well worth it.", "publishedDate": "2017-04-27", "language": "en", "rating": 4}, {"id": 470075041, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d244208-r470075041-Museo_Egipci_de_Barcelona-Barcelona_Catalonia.html", "text": "This is a small and charming museum full of wonderful treasures that are thoughtfully displayed. There is a great mixture of sculptures, sarcophagi, jewelry, weapons, art and other treasures. The older I get, the more I love museums of this size. You can see everything and not feel sensory overload. Brief explanations in English accompany each item. Non-flash photography allowed. Fantastic, small gift shop with unique treasures for children and adults. Highly recommend. An hour could be enough time.", "publishedDate": "2017-03-25", "language": "en", "rating": 5}, {"id": 445511058, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d244208-r445511058-Museo_Egipci_de_Barcelona-Barcelona_Catalonia.html", "text": "I would describe this as a boutique museum with very high quality pieces going back to more than 1500 BC.   The description are also in English for the permanent collection.   It's worth at least an hour.   It's very central near the main shopping street of Psg de Garcia.   I'm glad I went.  ", "publishedDate": "2016-12-19", "language": "en", "rating": 4}, {"id": 437254213, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d244208-r437254213-Museo_Egipci_de_Barcelona-Barcelona_Catalonia.html", "text": "Ever wonder about ancient Egyptians and how they lived, what they wore, what they used from day to day or more about mummies? This is the place to visit! I thought I knew a lot about ancient Egypt, well, I learned a lot more about them in this Museum! They have a lot of goodies in their museum store, from books in most languages to rulers with different images on them for kids to write ancient glyphic characters. ", "publishedDate": "2016-11-14", "language": "en", "rating": 5}, {"id": 434862871, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d244208-r434862871-Museo_Egipci_de_Barcelona-Barcelona_Catalonia.html", "text": "Well laid out collection of Egyptian artefacts properly interpreted and accessible (to those of us who read neither Spanish or Catalonian). \n\nOne curator (?) was slightly 'officious' - 'hovering' perhaps rather excessively (at our age I don't know what he imagined we might be going to get up to), but then with collections so valuable, I suppose they can't take any risks.\n\nThe museum is 'central' (in Barcelona, a lot is) and easily reached. Inside, displays are well spaced and illuminated and there are stair AND lifts to all levels. Photographs ARE allowed - but NO FLASH (damages the artefacts).\n\nWell worth a visit if at all interested in such things - and if you buy a Barcelona Card, it's yet another thing you can get into for free.\n\nWe enjoyed as a couple but I can imagine a lot of little boys (and maybe girls) enjoying seeing the mummies.\n\nWould this be good on a sunny day? - Well if the heat gets so much you want to get inside, this air-conned exhibition could be just the thing for a couple of hours relief from the heat!", "publishedDate": "2016-11-05", "language": "en", "rating": 4}, {"id": 434670946, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d244208-r434670946-Museo_Egipci_de_Barcelona-Barcelona_Catalonia.html", "text": "It seems small at first but it has a great collection; it took us almost 2 hours to see everything. Very interesting. We loved it. ", "publishedDate": "2016-11-04", "language": "en", "rating": 5}, {"id": 428357659, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d244208-r428357659-Museo_Egipci_de_Barcelona-Barcelona_Catalonia.html", "text": "This museum kept us busy for hours. Great place, plenty of facts. This museum seems to know what they are talking about. ", "publishedDate": "2016-10-16", "language": "en", "rating": 5}, {"id": 423878451, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d244208-r423878451-Museo_Egipci_de_Barcelona-Barcelona_Catalonia.html", "text": "This is a small Egyptian museum but which has a good collection of objects.  It is spread out over two floors with temporary exhibits.  The objects are arranged thematically; Pharaoh, Gods, etc.  There are some very good objects in the collection, in particular some early mace heads.  Artefacts date from early Naqadan to Faiyum portraits\n\nEntrance is included with the cost of a Barcelona card.", "publishedDate": "2016-09-30", "language": "en", "rating": 4}, {"id": 420002868, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d244208-r420002868-Museo_Egipci_de_Barcelona-Barcelona_Catalonia.html", "text": "Surprising and impressive collection of Egyptian antiquities in the heart of the most fashionable area of Barcelona.\nBeautiful modern building housing artifacts from jewelry to mummies.\nInteresting and fascinating exhibit of King Tuts tomb discovery.\nVery well presented and explained.", "publishedDate": "2016-09-18", "language": "en", "rating": 5}, {"id": 419962759, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d244208-r419962759-Museo_Egipci_de_Barcelona-Barcelona_Catalonia.html", "text": "We went because the hotel gave us free tickets. It's not a must see  because almost everything is photographs of artifacts. Can see it on the Internet. But if you have plenty of time in Barcelona and have seen all the other sights, then go see it. Otherwise skip it. ", "publishedDate": "2016-09-18", "language": "en", "rating": 2}, {"id": 419499106, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d244208-r419499106-Museo_Egipci_de_Barcelona-Barcelona_Catalonia.html", "text": "Tickets were free as we had booked our stay at the Derby Hotel chain Astoria hotel, direct.\n\nUsual price would have been 11 euros each for an adult. Museum was very interesting - the temporary exhibit was Tutankhamen, but the info boards were only in Spanish so feel we missed out on the true quality of the exhibits but still found them of great interest.\n\nThe roof top café/terrace was closed when we visited", "publishedDate": "2016-09-17", "language": "en", "rating": 5}, {"id": 418538626, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d244208-r418538626-Museo_Egipci_de_Barcelona-Barcelona_Catalonia.html", "text": "Anyone interested in egyptology will love this museum. It has many unique items that no other museum have, such as a bead dress. Three floors; two were part of the permanent exhibition, with the lowest floor being the temporary exhibition. When I visited there was a great photo exhibit on Howard Carters discovery of Tutankhamen's tomb. \n\nOne tiny problem, whilst all of the permanent exhibition had excellent labelling in multiple languages, the temporary exhibition did not include English in its labelling, which was a shame.", "publishedDate": "2016-09-14", "language": "en", "rating": 5}, {"id": 411379209, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d244208-r411379209-Museo_Egipci_de_Barcelona-Barcelona_Catalonia.html", "text": "If you want to experience the Egyptian collection of Cairo then go there , if you want to experience the Egyptian chaos and strife then go there. If you want to see a world class private collection of high quality Egyptian antiquities then this is the museum for you. Three floors of beautifully displayed artifacts indicating a very important period in Egypt's past. Easily overlooked in the Hussle and Hussle of Barcelona but well worth the time, admission is a very reasonable 11 euro and it is a private foundation so your euro go to support this collection and the education of people about Egypt.\n\nHighly recommended.", "publishedDate": "2016-08-27", "language": "en", "rating": 5}, {"id": 405157560, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d244208-r405157560-Museo_Egipci_de_Barcelona-Barcelona_Catalonia.html", "text": "There are three floors of exhibits.  The lower floor has a temporary exhibition which changes.  It was Tutankhamen when we visited.\n\nThe exhibits had English expect the temporary one, but it was interesting anyway.\n\nThere are lifts to each floor \n\nThe air conditioning is good and  the building cool when hot outside\n\n", "publishedDate": "2016-08-14", "language": "en", "rating": 3}, {"id": 394694077, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d244208-r394694077-Museo_Egipci_de_Barcelona-Barcelona_Catalonia.html", "text": "Having been to Egypt I dont expect to see much in museums outside that I havent seen before. However, this museum was a nice surprise, with easy layout, fantastic and interesting exhibits including the xray layout under the actual mummy so you can how the body is arranged. Free with Barcelona card(at least something was). But do visit this museum, didnt use the cafe on the terrace on top floor but it did look relaxing. ", "publishedDate": "2016-07-20", "language": "en", "rating": 5}, {"id": 394612322, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d244208-r394612322-Museo_Egipci_de_Barcelona-Barcelona_Catalonia.html", "text": "Main exhibition of artefacts is very basic, the temporary exhibition of tutenkhamun was ok. The library and the roof terrace were closed.  ", "publishedDate": "2016-07-20", "language": "en", "rating": 3}, {"id": 384983697, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d244208-r384983697-Museo_Egipci_de_Barcelona-Barcelona_Catalonia.html", "text": "Really cool artifacts but check opening hours before you visit. Displays do have English translation. Very enjoyable would recommend", "publishedDate": "2016-06-22", "language": "en", "rating": 4}, {"id": 383598007, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d244208-r383598007-Museo_Egipci_de_Barcelona-Barcelona_Catalonia.html", "text": "This is a relatively quiet museum, compared to the main Barcelona attractions. The pieces diplayed are quite extraordinary, such as the gold jewellery, the mummies, and sculptures. It is well worth a visit.", "publishedDate": "2016-06-18", "language": "en", "rating": 5}, {"id": 382086963, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d244208-r382086963-Museo_Egipci_de_Barcelona-Barcelona_Catalonia.html", "text": "Because we were staying at Hotel Claris, we had free admission to the Egyptian Museum across the street. This is a private collection, and is the best in Spain. Best collection I have ever seen. Never been to Egypt and probably never will. \nMust see if you are interested in ancient Egyptian collection.", "publishedDate": "2016-06-13", "language": "en", "rating": 4}, {"id": 375129005, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d244208-r375129005-Museo_Egipci_de_Barcelona-Barcelona_Catalonia.html", "text": "My daughter and I went to this little museum on a rainy day and loved it. It is set over a couple of floors (or maybe 3, I can't remember) and the exhibits are well laid out. I had no idea of the links with the Egyptians and was fascinated to learn more about one of our favourite cities.", "publishedDate": "2016-05-21", "language": "en", "rating": 4}, {"id": 372702664, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d244208-r372702664-Museo_Egipci_de_Barcelona-Barcelona_Catalonia.html", "text": "I love Egyptian history so this was a must see for me. Its not big , but it has some very unique pieces in it. An hour or so and you are done , not very expensive and close to many other things so , definitely if you are into Egyptian history , worth stopping .", "publishedDate": "2016-05-13", "language": "en", "rating": 5}, {"id": 370917462, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d244208-r370917462-Museo_Egipci_de_Barcelona-Barcelona_Catalonia.html", "text": "3 floor museum, with couple artifacts, mummy's. i would recommend this museum for the ancient egypt fans but not for the average tourist looking for adventure.\nDont expect it to be thrilling but hey its a private museum... i would say its quite good for a museum that depends on donations from the visitors for expanding the exhibition.\n\nThe only thing that i found annoying was that some of the text was not available in English. (only Spanish or Catalan).\n\nPersonally i found the price a bit high, it was 11€ normally but a thing worth to mention is that it is free with the Barcelona Card.", "publishedDate": "2016-05-07", "language": "en", "rating": 4}, {"id": 370068359, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d244208-r370068359-Museo_Egipci_de_Barcelona-Barcelona_Catalonia.html", "text": "Don't expect huge swathes of great Breathtaking tombs mummies  and stunning stuff.  Do expect a well curated collection run by people passionate about their subject.\n\nSmall but fun . Run by a private not for profit foundation. \n\nIf €11 is too much for you, why not see it for free as part of the package in your Barcelona card. Pack in MNAC, museu Frederic mares and this place free using your BCN card and you have some of the best museums Barca has to offer. And that's before you even begin to enjoy free using the BCN card\n\nDo expect a small (two floors and a temporary exhibition space)!but well curated collection telling a serious story with some great original artefacts, some great sculptures, jewellery (gorgeous) pottery, funerary exhibits (and yes some good mummy cases and two\nMummies as well as lots of animal\nMummies) well reconstructed tombs, some copies of things like the Rosetta Stone and a good hour and a half of a slow wander with some real surprises round this serious and enjoyable collection. \n\nCairo it is not, but some of this stuff ranks alongside the best of what other museums have to offer.\n\nIt won't ever rival the British museum, the kunsthistorisches museum or neues museum and unlike the louvre doesn't throw anything and everything on display regardless of whether it's remotely interesting. But it is an important collection. \n\nI will be back\n\n", "publishedDate": "2016-05-04", "language": "en", "rating": 4}, {"id": 364067453, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d244208-r364067453-Museo_Egipci_de_Barcelona-Barcelona_Catalonia.html", "text": "I'm drawn to Egyptian museums like a moth to a flame so when the audio guide in the tourist bus mentioned it we immediately jumped off to go see it.. but I wish we didn't. \n\nWhile the museum itself is on the small side, it does have a few nice pieces and its pretty well laid out. What we didn't expect though was that their highly advertised Tutankhamon exhibit wasn't multilingual, as the explanations were only available in spanish.\n\nThis is only worth it if you're really into this kind of thing, and perhaps not even then.", "publishedDate": "2016-04-14", "language": "en", "rating": 2}, {"id": 362010488, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d244208-r362010488-Museo_Egipci_de_Barcelona-Barcelona_Catalonia.html", "text": "I really didn't like this museum. The museum is really small, expensive, very few pieces and didn't have anything new to add. The Tutankhamen exhibition was only on Spanish or Catalan (at least no English) and very little was explained (counts for the rest as well). I was very disappointed.", "publishedDate": "2016-04-06", "language": "en", "rating": 1}, {"id": 355395734, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d244208-r355395734-Museo_Egipci_de_Barcelona-Barcelona_Catalonia.html", "text": "I'm an Egyptologist so I was very interested in seeing this small, private museum. It's well worth a visit if you are interested in ancient Egypt with some lovely pieces. \nMost artefacts are from the Late or Greco-Roman Periods, but that mustn't put you off! There are also a lot from the Pharaonic period which help show the contrast in artistic styles over the 3000-odd years of ancient Egyptian history.\nIt's very well laid out & the main exhibition has tri-lingual (including English!), brief but helpful explanations to every piece as well as general explanations.", "publishedDate": "2016-03-14", "language": "en", "rating": 4}, {"id": 348866674, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d244208-r348866674-Museo_Egipci_de_Barcelona-Barcelona_Catalonia.html", "text": "This was free entry with the Barcelona card. The museum is small and took us about an hour to do the whole thing. A few interesting artifacts. Nice break from the hustle of the city. ", "publishedDate": "2016-02-18", "language": "en", "rating": 3}, {"id": 342453658, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d244208-r342453658-Museo_Egipci_de_Barcelona-Barcelona_Catalonia.html", "text": "This is the worst egyptian museum I have ever visited in my whole life. Very expensive, very few pieces, and very poorly designed and organized. No explanations whatsoever are provided (there are literally just the items and nothing else). Their advertised tutankamon exhibit was not even ready yet.", "publishedDate": "2016-01-24", "language": "en", "rating": 1}, {"id": 332001954, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d244208-r332001954-Museo_Egipci_de_Barcelona-Barcelona_Catalonia.html", "text": "We tried to visit this museum twice. The first time they were closed for no apparent reason. There were no signs either. So we went back a few days later, and they were open. This is a small museum. When we went there we were the only ones in the whole museum, so it was a nice break form the busy city. This is an attraction where you don't have to wait for hours in line. The exhibits were interesting. The employees didn't speak english, so nobody could answer the questions we had. There is also a cafe on the roof of this museum, but it was closed when we went there.", "publishedDate": "2015-12-11", "language": "en", "rating": 3}, {"id": 329800520, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d244208-r329800520-Museo_Egipci_de_Barcelona-Barcelona_Catalonia.html", "text": "We were supposed to be at the Louvre in Paris visiting the Egyptian exhibit. Because of the terrorist attacks we had to scramble at the last minute and go to Barcelona. We found this museum. Not the most impressive collection. But, if you want a taste of ancient Egypt you won't be disappointed.", "publishedDate": "2015-11-29", "language": "en", "rating": 4}, {"id": 323612400, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d244208-r323612400-Museo_Egipci_de_Barcelona-Barcelona_Catalonia.html", "text": "I didn't expect too much when I wandered in but this museum has quite a store of artifacts from the Tut tomb.  I especially enjoyed the jewelry.", "publishedDate": "2015-11-01", "language": "en", "rating": 4}, {"id": 321022339, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d244208-r321022339-Museo_Egipci_de_Barcelona-Barcelona_Catalonia.html", "text": "We found this place on a rainy day and were pleasantly surprised at all of the artifacts and copies of artifacts which were available for viewing.   It is not a MUST place to visit for first timers to Barcelona but is a nice diversion when it rains.", "publishedDate": "2015-10-22", "language": "en", "rating": 4}, {"id": 313024467, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d244208-r313024467-Museo_Egipci_de_Barcelona-Barcelona_Catalonia.html", "text": "A good little stop of the Egyptophile.  I was surprised how large the collection was for a private collector.  Quite a few artifacts that I hadn't seen the like of in any other museums.  May not be interesting to the casual observer, but the enthusiast may like this.", "publishedDate": "2015-09-23", "language": "en", "rating": 4}, {"id": 296418550, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d244208-r296418550-Museo_Egipci_de_Barcelona-Barcelona_Catalonia.html", "text": "2 or 3 interesting pieces, but more like the collection you'd expect in a smaller city I think\nLovely building and facilities, worth a visit, but don't come to this part of town solely for this museum", "publishedDate": "2015-08-06", "language": "en", "rating": 3}, {"id": 280692094, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d244208-r280692094-Museo_Egipci_de_Barcelona-Barcelona_Catalonia.html", "text": "Interesting little museum, modern, well set out, clear descriptions, well-organised into topics like jewellery. I liked it - not overwhelming like some places, I looked at everything and enjoyed the video of the investigation into the Lady of Kemet mummy and the mummification process. There is a café on the terrace and a very handy lift to get back down to the shop. Lovely café across the street with cheap, freshly made food.", "publishedDate": "2015-06-16", "language": "en", "rating": 5}, {"id": 279620184, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d244208-r279620184-Museo_Egipci_de_Barcelona-Barcelona_Catalonia.html", "text": "Even though I've been to many of the large Egyptian museums around the world, I never hesitate to check out the less known ones as you never know what you'll find. The Museu Egipci de Barcelona is a small museum with items over three floors- definitely not overwhelming which was nice. It was very relaxing to slowly look over different items and notice the details. Nothing really blew me away but we spent over one hour taking everything in and I enjoyed the time. They have some nice mock-ups and dioramas showing tombs and excavations. Items are described nicely in several languages.\n\nThe entrance fee is 11€ which may be a lot unless you are really into Egyptian artifacts (ok for me, my wife got about 5€'s worth). The Discovery of Tutankhamun 'Special Exhibit' was a little misleading as it was a photographic tour without any artifacts. The photos were great and there were a few I had not seen before.", "publishedDate": "2015-06-11", "language": "en", "rating": 4}, {"id": 276743511, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d244208-r276743511-Museo_Egipci_de_Barcelona-Barcelona_Catalonia.html", "text": "It's an ok place to go, but like most Egyptian museums, its rather dry and can be boring.  I think that the most interesting part was the gift shop.  Very nice and welcoming staff though.", "publishedDate": "2015-06-01", "language": "en", "rating": 3}, {"id": 269721871, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d244208-r269721871-Museo_Egipci_de_Barcelona-Barcelona_Catalonia.html", "text": "This was a great and unexpected find on our trip to Barcelona. I'm fascinated by Ancient Egyptian history/mythology so the exhibits were so interesting to me. It was very good value and the majority of information was available in English. A couple of large texts weren't provided in English, but we were in Spain! The only downside was we had entered the museum at 1pm and it shut at 2pm for two hours for siesta time. We were told if we kept our tickets we could come back but felt like I was being pushed out. I could have stayed in there for at least another hour and was having a really great time!", "publishedDate": "2015-05-03", "language": "en", "rating": 4}, {"id": 266218814, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d244208-r266218814-Museo_Egipci_de_Barcelona-Barcelona_Catalonia.html", "text": "An interesting show of Egyptian life but the special exhibit of the discovery of king Tut's sarcophagus  by Howard Carter would have been great if there had been an English text.  ", "publishedDate": "2015-04-17", "language": "en", "rating": 4}, {"id": 265118460, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d244208-r265118460-Museo_Egipci_de_Barcelona-Barcelona_Catalonia.html", "text": "Didn't expect to find a Egyptian museum in Barcelona but glad I went  not a big selection but enough to keep you interested well worth a visit", "publishedDate": "2015-04-11", "language": "en", "rating": 4}, {"id": 247537046, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d244208-r247537046-Museo_Egipci_de_Barcelona-Barcelona_Catalonia.html", "text": "I thoroughly enjoyed my experience there, the collection is rather comprehensive, and I went at a low traffic time, so I could casually go through the museum. ", "publishedDate": "2015-01-05", "language": "en", "rating": 5}, {"id": 241303252, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d244208-r241303252-Museo_Egipci_de_Barcelona-Barcelona_Catalonia.html", "text": "Not exactly the type of museum one would think to find in Barcelona. It is a small collection on two floors of the building. It contains a couple of mummies and several items from the tombs of Egypt.  Not sure the price to get in, we had free passes from our hotel.  Seems the gentleman who owns \nThe Claris is pretty much the owner of this collection. We spent about an hour or so looking at everything.  If this is your kind of thing I would check it out.", "publishedDate": "2014-11-24", "language": "en", "rating": 4}, {"id": 234024721, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d244208-r234024721-Museo_Egipci_de_Barcelona-Barcelona_Catalonia.html", "text": "A focused museum on Egypt that I did not expect and found to be pretty comprehensive although small, worth a full morning visit.", "publishedDate": "2014-10-12", "language": "en", "rating": 4}, {"id": 228731266, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d244208-r228731266-Museo_Egipci_de_Barcelona-Barcelona_Catalonia.html", "text": "Had free entry for two people due to our hotels affiliation with the museum. We went on our last day. It was an very interesting collection. Spent about 90 minutes there. Learnt something new. I don't think it is an all day activity, but you can certainly enjoy an hour or two here. ", "publishedDate": "2014-09-13", "language": "en", "rating": 4}, {"id": 221529051, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d244208-r221529051-Museo_Egipci_de_Barcelona-Barcelona_Catalonia.html", "text": "Having read good reviews on this museum I was disappointed.  \n\nThe collection was quite small.  The cafe was also closed which was a real shame given that it's on the roof - don't know whether it's ever been used?\n\nIt was interesting but I wouldn't necessarily recommend it.  ", "publishedDate": "2014-08-13", "language": "en", "rating": 2}, {"id": 216462479, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d244208-r216462479-Museo_Egipci_de_Barcelona-Barcelona_Catalonia.html", "text": "If you're at all interested in Egyptian history then this is definitely worth a visit. It's free to get into and there weren't that many people there so it was nice to browse the collection free of crowds. They've got a nice range of artefacts and some interesting exhibits.", "publishedDate": "2014-07-20", "language": "en", "rating": 4}, {"id": 216211851, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d244208-r216211851-Museo_Egipci_de_Barcelona-Barcelona_Catalonia.html", "text": "It's a good time for who never been in another Egyptian museum. For those who have already visited some Egyptian museum, it's  \"more of the same\". ", "publishedDate": "2014-07-19", "language": "en", "rating": 4}, {"id": 215310565, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d244208-r215310565-Museo_Egipci_de_Barcelona-Barcelona_Catalonia.html", "text": "There were some interesting exhibits in this museum, but it was expensive in comparison to some of the other sites I visited. The biggest disappointment was that the Tutankhamun exhibition had no English signposting at all. Only worth it if you are very keen on Egyptology. ", "publishedDate": "2014-07-14", "language": "en", "rating": 2}, {"id": 210713694, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d244208-r210713694-Museo_Egipci_de_Barcelona-Barcelona_Catalonia.html", "text": "I am personally a fan of the Barcelona Egyptian museum. I go there at least 3 times a year.\nFrom the permanent exposition to the temporary ones.\nThere is a fee to go in not really expensive although you can find sometimes discounts in some magazines or newspapers.\nOne thing I did last year was the night visit! it was awesome, there was a guide explaining us a brief story about the egyptians while we covered all the rooms. at the end they gave us a glass of cava, nice!", "publishedDate": "2014-06-17", "language": "en", "rating": 5}, {"id": 199981934, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d244208-r199981934-Museo_Egipci_de_Barcelona-Barcelona_Catalonia.html", "text": "The Egyptian museum is not one of those crowded popular places in Barcelona. It is relatively small but I think it hosts some fascinating artefacts. I am not an expert in Egyptology so I can't say if the exhibition was unique or rare, but I had a nice time in this museum. For me it was interesting to see the mummies, the burial masks, the jewellery, the coffins, etc. \nThe visit is free with the Barcelona card and it is easy to find (near Passeig de Gracia).", "publishedDate": "2014-04-05", "language": "en", "rating": 4}, {"id": 181367304, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d244208-r181367304-Museo_Egipci_de_Barcelona-Barcelona_Catalonia.html", "text": "In the heart of Barcelona, we visited this most interesting museum where we met the director who briefed us on their expedition in Menya , Egypt which discovered a necropolis dating back to the fifth dynasty.The work is done jointly with a German institution. The museum houses also a research center in Egyptology. The treasures are well displayed in three levels with photos of the discovery of King Tut tomb.Maria Angela Delor ,the Director , was friendly and helpful. She is a staunch patriot of Catalonya.Entry fee is €11. Exemptions for certain categories including Egyptians.", "publishedDate": "2013-10-17", "language": "en", "rating": 4}, {"id": 172014023, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d244208-r172014023-Museo_Egipci_de_Barcelona-Barcelona_Catalonia.html", "text": "Very nicely displayed Egyptian items. It felt a bit odd to visit an Egyptian museum in Spain, but it was well worth the visit - although the entrance fee was surprisingly expensive. Very different from all those crowded Gaudi sites, with few people and very quiet atmosphere. Visited with my 24 year old daughter.", "publishedDate": "2013-08-13", "language": "en", "rating": 5}, {"id": 164648941, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d244208-r164648941-Museo_Egipci_de_Barcelona-Barcelona_Catalonia.html", "text": "There are certainly better examples in The Cairo Museum but for my 2 cents these are preserved like the treasures they truly are. I went because Spain & France & the rest of the world were \"trash talked\" by those in the Cairo, but this museum displays all of these ancient items beautifully. If you have time it is worth a look here, but not instead of any of the Gaudi!\nAll Gaudi are \"must see\" this is beautiful but in my mind not as important.", "publishedDate": "2013-06-20", "language": "en", "rating": 4}, {"id": 153186489, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d244208-r153186489-Museo_Egipci_de_Barcelona-Barcelona_Catalonia.html", "text": "I felt wrong going to an Egypt museum whilst in Barcelona, but we were in the vicinity and had free entry with our BCN cards. It is actually a great little museum to learn about mummification and the general understanding of Ancient Egypt with many interesting little facts on how the artefacts were researched to gather more information about the times. Not the most substantial of museum but a pleasant find. \n\nWe were lucky enough to be there whilst their temporary exhibit is about the finding of Tutankhamun, so you could see how the tomb was extracted, and with a computer generated image of what he would have looked like. Unfortunately, as a temporary exhibition, there was no English information, so I'm sure I missed out on a lot of vital information. All in all, very interesting.", "publishedDate": "2013-02-26", "language": "en", "rating": 4}, {"id": 138456781, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d244208-r138456781-Museo_Egipci_de_Barcelona-Barcelona_Catalonia.html", "text": "Great for those who are interested in Egypt culture. Adult ticket is 11 Euro though museum is not so big. For those who are travelling by \"Bus turistic\": it's closer to get off the bus near Casa Batlo, NOT Pedrera as Bus guide recommends.", "publishedDate": "2012-08-26", "language": "en", "rating": 4}, {"id": 135622366, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d244208-r135622366-Museo_Egipci_de_Barcelona-Barcelona_Catalonia.html", "text": "it's not really a museum but a collection. but i recomend not to go after british museum, a big deception.", "publishedDate": "2012-07-28", "language": "en", "rating": 2}, {"id": 135175727, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d244208-r135175727-Museo_Egipci_de_Barcelona-Barcelona_Catalonia.html", "text": "If the grandour you are after, you won't find it here for it is a small/medium size museum that has a lot to offer. In quite nice layout you get to see a lot about ancient Egypt... Only one downside to it...not all descriptions are given in english or spanish, so the non-catalan visitor is losing a bit... all in all.great place to visit. Ill take you around an hour to visit it slowly...", "publishedDate": "2012-07-23", "language": "en", "rating": 4}, {"id": 133508681, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d244208-r133508681-Museo_Egipci_de_Barcelona-Barcelona_Catalonia.html", "text": "Take a break from the Barcelona boutiques and beach and visit this museum. The displays are excellent and there is a roof terrace to eat your picnic with the family", "publishedDate": "2012-07-05", "language": "en", "rating": 5}, {"id": 130218896, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d244208-r130218896-Museo_Egipci_de_Barcelona-Barcelona_Catalonia.html", "text": "One of the greatest collections of all of Europe, only rivalled by Turin museum.", "publishedDate": "2012-05-19", "language": "en", "rating": 5}, {"id": 130011594, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d244208-r130011594-Museo_Egipci_de_Barcelona-Barcelona_Catalonia.html", "text": "Compared to other museums, it is very small, and not crowded. Most of the items are just nice collections showing the ancient Egyptians period. to be honest, I didnt go with a guided tour.", "publishedDate": "2012-05-15", "language": "en", "rating": 1}, {"id": 129800170, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d244208-r129800170-Museo_Egipci_de_Barcelona-Barcelona_Catalonia.html", "text": "For those of you who have been to the big Museums, the Met, Cairo, Berlin, London, Brooklyn and understand their pull in getting quality pieces, this little museum really does have some unusual quality pieces for a private collection. The Ramses II Statue is quite unique in that we are not aware of seeing one in which he has a smile (smirk) which is quite rare in Egyptian Carvings. It is definitely worth your time for an hour or two if you enjoy Egyptian Art and history to stop in an take a look. If your not into Egyptian history wait until you get to one of the big cities and see a larger museum to see a little bit of everything.", "publishedDate": "2012-05-12", "language": "en", "rating": 4}, {"id": 127357257, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d244208-r127357257-Museo_Egipci_de_Barcelona-Barcelona_Catalonia.html", "text": "not too big. there are many other musuems in barcelona that offer better collection. but the museum is nice.", "publishedDate": "2012-04-06", "language": "en", "rating": 2}, {"id": 124464657, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d244208-r124464657-Museo_Egipci_de_Barcelona-Barcelona_Catalonia.html", "text": "...obiously this is not the top.\nJust a small taste of Egypt, 3 rooms with some objects... maybe not a good way to spend 1 hour and money !                                                                                                                                                                                                                                                                                                                                                                                                                                       .", "publishedDate": "2012-02-12", "language": "en", "rating": 1}, {"id": 124013175, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d244208-r124013175-Museo_Egipci_de_Barcelona-Barcelona_Catalonia.html", "text": "It is not the biggest nor the best Egyptian Museum in the world, I know, but if you are lucky and you can follow one of the guided tours, this is a good experience (and it's a very interesting place for kids)", "publishedDate": "2012-02-02", "language": "en", "rating": 5}, {"id": 123711647, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d244208-r123711647-Museo_Egipci_de_Barcelona-Barcelona_Catalonia.html", "text": "We were pleasantly surprised to find this Egyptian Museum in Barcelona.   This is a small museum which has a lsurprisingly arge collection of Egyptian artifacts!  Within easy walking distance of the downtown !    ", "publishedDate": "2012-01-27", "language": "en", "rating": 5}, {"id": 120117740, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d244208-r120117740-Museo_Egipci_de_Barcelona-Barcelona_Catalonia.html", "text": "The museum has more than 2000 square meters of gallery space, with about a thousand exhibits. These include mummies, sarcophagi, jewelry, and amulets. The museum has one of Europe's largest private collections of Egyptian art. \n\nThe Clos Archaeological Foundation is the owner of the museum and this was founded in 1993 by Jordi Clos, who was passionate about Egyptian art and started his private collection.\nThe Foundation does research and publishes works about Egypt. It is actively involved in education about Egyptian art and life and also has a travel agency to promote travel to Egypt. \n\nAs others have said, the entrance fee is surprisingly high. That is the only thing wrong with this museum, that it is not accessible to those who cannot pay the entrance fee.", "publishedDate": "2011-11-03", "language": "en", "rating": 4}]}}]