[{"locationId": 2272433, "name": "Santa Anna Church", "placeType": "ATTRACTION", "reviewListPage": {"reviews": [{"id": 694349101, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d2272433-r694349101-Santa_Anna_Church-Barcelona_Catalonia.html", "text": "Love this little old church, we stumbled across it and can't wait to return to it again - very peaceful and quaint.", "publishedDate": "2019-07-31", "language": "en", "rating": 5}, {"id": 683785246, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d2272433-r683785246-Santa_Anna_Church-Barcelona_Catalonia.html", "text": "Accidentally, while walking around the center of the city, years ago I came across this old church.  Among all the noise outside, I found myself inmersed in peace.  Love it", "publishedDate": "2019-06-23", "language": "en", "rating": 5}, {"id": 677557084, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d2272433-r677557084-Santa_Anna_Church-Barcelona_Catalonia.html", "text": "if you're into churches you'll like this, if not there are more interesting ones to see in Barcelona", "publishedDate": "2019-05-30", "language": "en", "rating": 3}, {"id": 675722917, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d2272433-r675722917-Santa_Anna_Church-Barcelona_Catalonia.html", "text": "The church definitely has some great history. It’s very old and could be kept better in some ways. It’s a bit small tho, so when there were a lot of people inside of it, it was a bit complicated to see everything", "publishedDate": "2019-05-22", "language": "en", "rating": 5}, {"id": 650536891, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d2272433-r650536891-Santa_Anna_Church-Barcelona_Catalonia.html", "text": "If you are in this area of Barcelona, you should take a few minutes to stop in and see this church.  It is very well-maintained and has some great architecture both inside and outside. Easy to get to and worth a visit for sure!", "publishedDate": "2019-02-06", "language": "en", "rating": 4}, {"id": 645310617, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d2272433-r645310617-Santa_Anna_Church-Barcelona_Catalonia.html", "text": "This Church is beautiful the atmosphere is thrilling but please be careful when you come out of the church to the street there are few roadside sellers,most of them admitted that they hate English speaking people and they are a rip off,I bought a hat from one of them for 20 EUR to find for less than 8 EUR few meters after,when I went back to tell him that the price I paid was not fair,he kept swearing and carrying on.please be careful.", "publishedDate": "2019-01-12", "language": "en", "rating": 5}, {"id": 643346237, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d2272433-r643346237-Santa_Anna_Church-Barcelona_Catalonia.html", "text": "This is a quaint little church just off of La Rambla. It looks awful from the outside but it's stone walled interior, alter and two alcoves are very pretty. However, don't go out of your way to see it!", "publishedDate": "2019-01-03", "language": "en", "rating": 3}, {"id": 620804715, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d2272433-r620804715-Santa_Anna_Church-Barcelona_Catalonia.html", "text": "The Santa Ana Church is somewhat concealed betwixt carrer de Santa Ana and Plaça de Catalunya. It used to be a part of a monastery which was founded by canons appertaining to the religious order of the Saint Sepulchre of Jerusalem. In the church a mixture of romanesque and gothic styles can be observed. As a matter of fact, the construction of the temple started in the Xii century but in the following centuries the nave and the vault were enlarged introducing gothic pointed arches.\nThe church exterior is quite sober, being the belfry tower the most conspicuous element thereof. It's much taller than the main building and its appearance is that of a narrow architectural complement with an artistic spike. The belfry contains three bells, two of them under the spike and the third one above the other two and equidistant from each one of them. The bell strokes are very pleasant to hear. By the building in question there is a yard within the enclosure which is usually very calm and peaceful. It's a delight to sit on a bench in that yard for a while and enjoy the peacefulness of the lieu.\nThe Curch is a very simple but nice single-nave one with a rectangular apse in which the Cistercian influence is outstanding. The nave is sober but elegant. At the entrance there is a chapel dating back to the twelve century which is dedicated to the Immaculte Conception. In that chapel there is a splendid gothic reredos depicting St. John the Evangelist. The paintings housed in the Church about some events regarding S. Josep Oriol's life were made by the painter Josep Llimona. They are also worth being watched. At the end of the transept there is the St. Sepulchre chapel containing a sculptural group representing the burial of Christ. Although it's a replica of the original work which is in the Barcelona Diocesan  Museum, it's an attractive sculpture full of beauty.\nThe cloister was built in the fifteenth century. It has a square shape and on each side  there are ten arches. In some of the corbels the renaissance influence is apparent.\nThe visit to that church is recommendable.Before of after admiring the marvels which the Church harbours remaining some minutes in the yard can confort the solul owing to the calmness and beauty of the site.", "publishedDate": "2018-09-30", "language": "en", "rating": 4}, {"id": 619831962, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d2272433-r619831962-Santa_Anna_Church-Barcelona_Catalonia.html", "text": "Wished I had more time to explore this but time was against me. Lots to see and loved the. Stone carving and statues ", "publishedDate": "2018-09-26", "language": "en", "rating": 3}, {"id": 612062245, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d2272433-r612062245-Santa_Anna_Church-Barcelona_Catalonia.html", "text": "Santa Anna Church is a beautiful old church.\nIt was built year 1000-1100.\nThe church is situated in the north part of Barri Cotic, close to Palca de Catalunya.\nYou find Santa Anna Church in a hidden backyard in the narrow street Carrer Santa Anna.\nIt is a silent place and an oasis the hectic city", "publishedDate": "2018-08-29", "language": "en", "rating": 4}, {"id": 591479303, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d2272433-r591479303-Santa_Anna_Church-Barcelona_Catalonia.html", "text": "On an extremely busy Easter weekend in Barcelona, we found this lovely church and its tiny square to be almost empty. Santa Anna is not touted like the cathedral and some other churches in the city, which likely played a part in the lack of visitors. But we thought that Santa Anna was well worth seeing, and we enjoyed having most of this church to ourselves. \n\nAs an architecture buff, I liked the simplicity of the Romanesque structure. But the cloister and roof are Gothic. The cloister actually shows the evolution of style from Catalan Gothic to Renaissance. Different styles relate to the church's beginning as a monastery for centuries and then a 3-century building project for its transformation to a church. Striking Romanesque features include windows that display scenes from the Book of Genesis. The central nave shows off Catalan Gothic style.\n\nSanta Anna Church is quite close to Placa Catalunya. We entered the square through Santa Anna Street.", "publishedDate": "2018-06-28", "language": "en", "rating": 4}, {"id": 588509366, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d2272433-r588509366-Santa_Anna_Church-Barcelona_Catalonia.html", "text": "great place to make some prayers and light a whisper candle\nvisited this place on my last tour to Barcelona ", "publishedDate": "2018-06-18", "language": "en", "rating": 5}, {"id": 578852952, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d2272433-r578852952-Santa_Anna_Church-Barcelona_Catalonia.html", "text": "This Socially active church is situated in the heart of Barcelona close to Plaza Catalunya. A social worker is present every afternoon to help the needed. In the evening guitar concerts are organised", "publishedDate": "2018-05-08", "language": "en", "rating": 4}, {"id": 571089892, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d2272433-r571089892-Santa_Anna_Church-Barcelona_Catalonia.html", "text": "Our US high school choir had the experience of performing in this beautiful little church.  It's a lovely little parish to visit regardless of your religious beliefs.  Just the thought of it existing for more than 1500 years is awe-inspiring.  Take a few minutes to look at the floor and the carvings to see what you discover!", "publishedDate": "2018-04-04", "language": "en", "rating": 5}, {"id": 565037814, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d2272433-r565037814-Santa_Anna_Church-Barcelona_Catalonia.html", "text": "This was my fifth trip to Barcelona and I thought I had seen everything in the city. I downloaded the free Rick Steves audio walking tour and discovered this little gem only a few steps off of La Rambla. What an incredibly beautiful little church! It’s definitely worth a visit and it’s only a few seconds off the road quite close to Plaza Catalunya.", "publishedDate": "2018-03-07", "language": "en", "rating": 4}, {"id": 549031157, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d2272433-r549031157-Santa_Anna_Church-Barcelona_Catalonia.html", "text": "I have been in Barcelona on 3 holidays and had walked past this hidden off the main drag church without noticing it until recently.\nWalk into its courtyard and you realise you are about to enter something wonderful after stumbling on it by accident.\nOnce inside you enter a beautiful church which you can freely walk around, paying not a penny.\nAt long last I have found a church which has a sealed off area, where members of this church welcome the homeless, feed them, give them a place of warmth, access to barbers and computers, and promote inclusion and friendship, rather than loneliness and separation.\nMany collection boxes around the church, which is not dripping in gold, but use the cash given to help those who have fallen on hard times....much better than feeding the clergy and the well off.\nDefiinately worth a visit", "publishedDate": "2017-12-24", "language": "en", "rating": 5}, {"id": 536786298, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d2272433-r536786298-Santa_Anna_Church-Barcelona_Catalonia.html", "text": "Visiting Barcelona has to include a couple of churches and Santa Anna is one of the nice ones, where you can end up thinking about life and your loved ones and lighting a candle for them", "publishedDate": "2017-10-29", "language": "en", "rating": 5}, {"id": 508227741, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d2272433-r508227741-Santa_Anna_Church-Barcelona_Catalonia.html", "text": "Amazing experience. Was a good choice to buy a ticket for a Spanish guitar concert hold in this chapel, atmosphere was lovely, acoustic as well. Totally recommend a concert here.", "publishedDate": "2017-08-02", "language": "en", "rating": 5}, {"id": 505241713, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d2272433-r505241713-Santa_Anna_Church-Barcelona_Catalonia.html", "text": "I had really wanted to visit this church after reading so much about its history and connection to the Holy Seplecure. I booked a ticket, 2 Euros, online and planned to visit on a Thursday at 4:15 PM, a time clearly shown everywhere as open. However, when I reached the church entrance from the street, it was closed and gate locked.  I was so disappointed but that simply means I will have to come back. I will say I did get to at least see it through the gate as this is probably the most hidden of all attractions in Barcelona.", "publishedDate": "2017-07-24", "language": "en", "rating": 3}, {"id": 497317832, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d2272433-r497317832-Santa_Anna_Church-Barcelona_Catalonia.html", "text": "Santa Anna is an absolutely stunning hidden gem. We walked past the entrance a few times; that's how hidden it is. As soon as you walk the through the gates, it is like stepping away from the busy Gothic quarter into another world. From the outside, the church looks very basic but please do not be deceived. The Santa Anna has many different rooms and also a lovely back to it with an old well", "publishedDate": "2017-06-29", "language": "en", "rating": 3}, {"id": 476458232, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d2272433-r476458232-Santa_Anna_Church-Barcelona_Catalonia.html", "text": "Santa Anna is an absolutely stunning hidden gem. We walked past the entrance a few times; that's how hidden it is. As soon as you walk the through the gates, it is like stepping away from the busy Gothic quarter into another world. From the outside, the church looks very basic but please do not be deceived. The Santa Anna has many different rooms and also a lovely back to it with an old well. This church was built in the 1100's and has different parts to it built in different eras. The details of this church is beautiful. My partner and I visited in July 2016 and also in April 2017. We loved this church so much that we booked it for our wedding next year. Definitely give this church a look.", "publishedDate": "2017-04-17", "language": "en", "rating": 5}, {"id": 473602510, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d2272433-r473602510-Santa_Anna_Church-Barcelona_Catalonia.html", "text": "We stumbled upon the courtyard to the church one day and saw a brochure for the upcoming spanish guitar concerts. So glad we did! On the appointed evening, after a cocktail at the Hotel 1898 on La Ramblas, we found the concert to be held in the chapel, I believe. It is a small, medieval looking space with perfect acoustics and room enough for about 30 chairs. We were lucky to see BCN duo de Guitarra, Carmen. The couple were mesmerizing. Highlight of our trip!", "publishedDate": "2017-04-08", "language": "en", "rating": 5}, {"id": 473009520, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d2272433-r473009520-Santa_Anna_Church-Barcelona_Catalonia.html", "text": "Hidden off the main drag , this little church is a gem. We were there early in the morning and the air was thick with incense. It added to the charm.", "publishedDate": "2017-04-05", "language": "en", "rating": 5}, {"id": 471970308, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d2272433-r471970308-Santa_Anna_Church-Barcelona_Catalonia.html", "text": "Stumbled on this ticked away off la ramblas... walked in on a small service in italian....\n\nSimple and pretty inside..very nice", "publishedDate": "2017-04-01", "language": "en", "rating": 4}, {"id": 460354666, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d2272433-r460354666-Santa_Anna_Church-Barcelona_Catalonia.html", "text": "Santa Anna Church is somewhat hidden in an interior courtyard, so it would be easily missed if you weren't looking for it. That, however, does not mean it should be missed.  It does not take long to explore as it is not all that large, but there is much beauty to it and it is worth a short detour as you wander the Barcelonian streets.  There are concerts there most (every?) night and I can imagine it would be a magical place to have this experience. ", "publishedDate": "2017-02-16", "language": "en", "rating": 4}, {"id": 447284646, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d2272433-r447284646-Santa_Anna_Church-Barcelona_Catalonia.html", "text": "I bought tickets online for one of Joan Benejam's concert. We enjoyed 1 hour of lovely guitar music and explanations in a very exquisite space. I can only recommend.", "publishedDate": "2016-12-28", "language": "en", "rating": 5}, {"id": 445713217, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d2272433-r445713217-Santa_Anna_Church-Barcelona_Catalonia.html", "text": "The oldest church in Barcelona. Close to Barri Gotic and Shops with all brands and original. The church was in the back of our hotel ( Hotel Cortes)", "publishedDate": "2016-12-20", "language": "en", "rating": 5}, {"id": 445110196, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d2272433-r445110196-Santa_Anna_Church-Barcelona_Catalonia.html", "text": "What a wonderful way to finish our first ever day in Barcelona , at Santa Anna Church listening to the classical guitar recital , Fandango . \nThe church is even more beautiful than online and recital was fantastic . \n\nA night spent in a beautiful space listening to a world class guitarist followed by a wine in the garden . My kids were enchanted (12/15) .\n", "publishedDate": "2016-12-18", "language": "en", "rating": 5}, {"id": 442187701, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d2272433-r442187701-Santa_Anna_Church-Barcelona_Catalonia.html", "text": "We personally like this one more than the Cathedral. It is truly spiritual and full of small things and artifacts to discover. Definitely worth visiting. ", "publishedDate": "2016-12-05", "language": "en", "rating": 5}, {"id": 441396667, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d2272433-r441396667-Santa_Anna_Church-Barcelona_Catalonia.html", "text": "This beautiful little church is tucked away, I just came across it.  It looks very understated outside, but is lovely inside.  It has a cloister to enjoy also.  My favourite part has to be The Chapel of the Blessed Sacrament.  The fresco painted here is not that old, it was painted in 1945, but it's lovely.\n\nI would recommend a visit to this quiet corner.", "publishedDate": "2016-12-01", "language": "en", "rating": 4}, {"id": 441224388, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d2272433-r441224388-Santa_Anna_Church-Barcelona_Catalonia.html", "text": "This quiet and peaceful church tucked in just off the Ramblas is a world away from the tourist hustle and bustle. Just before the Placa de Catalunya, turn down the Carrer Santa Anna and not far along in between two buildings you will see the lovely courtyard. The church itself is worth the visit and the photo ops.", "publishedDate": "2016-11-30", "language": "en", "rating": 4}, {"id": 437450397, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d2272433-r437450397-Santa_Anna_Church-Barcelona_Catalonia.html", "text": "A very charming little church where one can attend one of the best Spanish guitar concerts by the guitarist Robert Majure who dominates both Classical and Flamenco guitar; really worthwhile seeing in Barcelona.", "publishedDate": "2016-11-15", "language": "en", "rating": 5}, {"id": 418464666, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d2272433-r418464666-Santa_Anna_Church-Barcelona_Catalonia.html", "text": "A small place of quiet in the center of Barcelona.  The cloister is particularly lovely and peaceful.  Anyone wandering around old Barcelona should stop by.", "publishedDate": "2016-09-14", "language": "en", "rating": 4}, {"id": 409763423, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d2272433-r409763423-Santa_Anna_Church-Barcelona_Catalonia.html", "text": "nice church and nice local area, I took lots of pictures, walked and there are many other attractions if you walk", "publishedDate": "2016-08-23", "language": "en", "rating": 3}, {"id": 409068555, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d2272433-r409068555-Santa_Anna_Church-Barcelona_Catalonia.html", "text": "Santa Anna Church is very close to Placa Catalunya and is surrounded by the old town attractions. To be able to economize our time in Barcelona, we went to an evening classical guitar concert in one of the chapels. Drinks were served in the cloister after the event, and if you arrive early, you can wander around the church and surrounds beforehand. It made for a great night out.", "publishedDate": "2016-08-22", "language": "en", "rating": 5}, {"id": 368561413, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d2272433-r368561413-Santa_Anna_Church-Barcelona_Catalonia.html", "text": "Made all the better in that I found this wonderful and ancient place by accident, and upon entering, felt certain that I had been here before. The old stones vibrate with the prayers of ages past, and I feel so honored to have found the peaceful cloisters and a singing bird, who flew down and accompanied my slow transit all the way around the tranquil square.", "publishedDate": "2016-04-28", "language": "en", "rating": 5}, {"id": 364725764, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d2272433-r364725764-Santa_Anna_Church-Barcelona_Catalonia.html", "text": "Before leaving home for Barcelona, I did a search of shows and concerts in the city during the days we'll be in town. I came across a show called Art de Guitarra. It described a Spanish guitar duet performed in a unique and intimate environment - the relatively small Church of Santa Ana, a church just east of Plaza Catalunya. \n\nWe had no trouble finding the entrance to the small church. Once there, we were greeted by a girl handing out the actual concert tickets with my confirmation printout. Upon entering, we were directed to the small chapel inside where there may have been just 40-50 seats arranged in rows. \n\nThe guitar duet, performed by a man and woman, was fabulous. The dark setting of the chapel at night set a stunning, and quaint, stage for them. The acoustics of the little chapel added to the depth of the music they performed. \n\nThis couple performed an array of songs, and between each described the song in detail - its story, its meaning, and its feeling. The guy described the music in Catalán while the woman translated it to English for the crowd. \n\nIf you have an opportunity to attend a Spanish guitar duet during your visit to Barcelona, you will assuredly remember it as a special experience.", "publishedDate": "2016-04-16", "language": "en", "rating": 5}, {"id": 364005567, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d2272433-r364005567-Santa_Anna_Church-Barcelona_Catalonia.html", "text": "I came upon this hidden gem of a church quite by  accident. The church is located just off  Las Ramblas and Santa Anna Street. The Church is austere but beautiful in its own way.  This is more of a local church and an excellent place to visit especially for some quite time and prayers.  The church houses three excellent artworks in side alters: 1) a Black Madonna 2) an artwork of the crucifixion Mary holding Christ  3)  A statuary of Christ laid in the tomb surrounded by Mary shown who is not the typical youthful fashion but as a mature women. Mary is joined by others in this depiction of Christ being laid to rest after the crucifixion.", "publishedDate": "2016-04-13", "language": "en", "rating": 5}, {"id": 362963410, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d2272433-r362963410-Santa_Anna_Church-Barcelona_Catalonia.html", "text": "We took a stop at Santa Anna Church and it was beautiful and so peaceful. The church is worth a look around but outside the small courtyard is really calm and relaxing. With the sun shining on it, it looked great. Really good visit if you just want 10 minutes away from the tourists.", "publishedDate": "2016-04-10", "language": "en", "rating": 5}, {"id": 359852104, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d2272433-r359852104-Santa_Anna_Church-Barcelona_Catalonia.html", "text": "I visited here during the week in my visit to Barcelona - can be a little tricky to find however Google maps will be a good guide if you have it. There is an entry fee (about 2 eur) which is a little silly considering the massive cathedral is free - but all the same this church is a good stop after you have done all the other \"must see\" sights and have some time to kill. You will only need to spend maybe 15-30 minutes here as it is a smaller size church, but quite nice and you will get some good photos.", "publishedDate": "2016-03-29", "language": "en", "rating": 4}, {"id": 349373694, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d2272433-r349373694-Santa_Anna_Church-Barcelona_Catalonia.html", "text": "If you've been on Las Ramblas, and who hasn't now and again, you may have gone off to the left or the right to explore the streets of El Raval or El Barri Gòtic. Please tell me you have gone off to the left or the right to explore the streets of El Raval or El Barri Gòtic. Just one street down from Plaça de Catalunya is a small but delightful little monastery, Parròquia de Santa Anna. The church part is nice, but the real treat here is the cloister, which is small and quiet and you'll very likely be the only person there.", "publishedDate": "2016-02-20", "language": "en", "rating": 4}, {"id": 330199756, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d2272433-r330199756-Santa_Anna_Church-Barcelona_Catalonia.html", "text": "Went here several times for wonderful guitar concerts. This intimate candlelight concert in the chapel is recommended. You can buy tickets online or at the door. Concerts are for roughly 80 persons, so really intimate.", "publishedDate": "2015-12-01", "language": "en", "rating": 4}, {"id": 322564679, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d2272433-r322564679-Santa_Anna_Church-Barcelona_Catalonia.html", "text": "If you have visited most of the familiar tourist sites and are looking for something special to do on a week-end evening, you can't go wrong listening to a great Spanish guitar concert in the setting of Iglesia de Santa Anna. The church and adjoining cloister date back to the 11th and 15th century so arrive early to look around a little before the concert. The church is located just off Placa Catalunya and easily reached by Metro. The concert lasts around an hour and at the end you can enjoy a complimentary glass of wine in the yard. Price was around $20 pp.\n\nTickets can be booked online through classictic and they will promptly answer any questions you may have. Once booked, just print out your tickets prior to the event. Also a good source for booking classic concert tickets, ballet, and jazz in other cities around the world.", "publishedDate": "2015-10-28", "language": "en", "rating": 4}, {"id": 315390479, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d2272433-r315390479-Santa_Anna_Church-Barcelona_Catalonia.html", "text": "I can't comment too much on the church, because we went there at night for a concert, which was held in a small chapel with only 25 seats.  It was a beautiful setting for a divine guitar concert. We saw Nadim Majure, who played classical and flamenco guitar. He was brilliant! The intimate setting was just perfect for the music that was played. The staff were lovely and friendly to talk to after the show when we were served a glass of wine. They also answered our many questions about Barcelona, history, politics etc. A wonderful evening for only 20 Euros.", "publishedDate": "2015-10-01", "language": "en", "rating": 5}, {"id": 303627755, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d2272433-r303627755-Santa_Anna_Church-Barcelona_Catalonia.html", "text": "Santa Ana Church is located in a quiet small square in the downtown area near the shopping streets , when visiting make sure that you go to the very unique garden.", "publishedDate": "2015-08-26", "language": "en", "rating": 5}, {"id": 282104978, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d2272433-r282104978-Santa_Anna_Church-Barcelona_Catalonia.html", "text": "We went purposefully to see this delightful church and cloisters because it was listed in an off the beaten track article.  It was well worth it.  The church is small and costs two euros to visit which is much less expensive than almost anything in Barcelona.  It is a tranquil oasis in the midst of the chaos of the outside world.  Visit the main chapel and see the many different statues and markings, wander into the cloister which feels like a place time forgot and visit the small chapel off the cloister. This is a very old church (we saw the date 1141 on it somewhere) and is austere with flashes of decoration throughout.", "publishedDate": "2015-06-22", "language": "en", "rating": 5}, {"id": 260461354, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d2272433-r260461354-Santa_Anna_Church-Barcelona_Catalonia.html", "text": "Out of several  churches in Spain we found, this is one of the nicer churches in Barcelona.  The alter was littered with golden artifacts.  A small turnout made it a leisurely  look at several of the quite scenes.", "publishedDate": "2015-03-18", "language": "en", "rating": 3}, {"id": 253700435, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d2272433-r253700435-Santa_Anna_Church-Barcelona_Catalonia.html", "text": "Just off the chaos of the Plaza Catalunya is this little church. Entrance fee of two euros. The cloister alone is worth the visit.", "publishedDate": "2015-02-11", "language": "en", "rating": 4}, {"id": 250129924, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d2272433-r250129924-Santa_Anna_Church-Barcelona_Catalonia.html", "text": "This was the highlight of our weekend break - the recital in the church of St Anna was wonderful. Two extremely accomplished guitarists (lovely to look at as well as to listen to!) playing traditional pieces and a glass of wine after - all for E20 !", "publishedDate": "2015-01-20", "language": "en", "rating": 5}, {"id": 245998126, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d2272433-r245998126-Santa_Anna_Church-Barcelona_Catalonia.html", "text": "We did not tour the church, but attended the Art de Guitarra Concert. It was a lovely evening in which the soloist masterfully performed classical and Spanish pieces.  It was a nice change and introduction to Spanish composers. Highly recommend for music lovers.", "publishedDate": "2014-12-26", "language": "en", "rating": 5}, {"id": 235938988, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d2272433-r235938988-Santa_Anna_Church-Barcelona_Catalonia.html", "text": "The music in art de guitara is good. However wep urchased through the internet a ticket for music and dinner. ... They cheated us: after one hour of concert they send you to a near by restaurant . Th einternet deal cost 86?.while the concert is 20? and the restaurant menu 17?. So we paid 200%. Real fall", "publishedDate": "2014-10-23", "language": "en", "rating": 1}, {"id": 232423227, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d2272433-r232423227-Santa_Anna_Church-Barcelona_Catalonia.html", "text": "Upon entering, this church seemed slightly cold and intimidating. However, upon exploring each corner, there were several interesting, warmly illuminated rooms to appreciate. At the rear entrance, there is even a pretty courtyard with some greenery to discover. Overall, our visit was peaceful and humbling.", "publishedDate": "2014-10-03", "language": "en", "rating": 5}, {"id": 226804089, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d2272433-r226804089-Santa_Anna_Church-Barcelona_Catalonia.html", "text": "This is not one of the advertised old church’s of Barcelona but worth a visit. Inside is so unique with so many small areas that make you calm.  \nCheap ticket (2 euro) is a very good stop for some peaceful time within the crowd city!", "publishedDate": "2014-09-03", "language": "en", "rating": 4}, {"id": 216078177, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d2272433-r216078177-Santa_Anna_Church-Barcelona_Catalonia.html", "text": "Beautiful little church! The cloister is amazing. Really worth the visit, specially if you like to explore things \"off the beaten track\"!", "publishedDate": "2014-07-18", "language": "en", "rating": 5}, {"id": 213015012, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d2272433-r213015012-Santa_Anna_Church-Barcelona_Catalonia.html", "text": "Just off the chaos of the Plaza Catalunya is this little church.  The cost is 2 euros, but the Cloister alone is worth the peaceful interlude.", "publishedDate": "2014-07-01", "language": "en", "rating": 5}, {"id": 196848008, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d2272433-r196848008-Santa_Anna_Church-Barcelona_Catalonia.html", "text": "If you like to wander around old churches do not miss this one,   It's beautiful in every sense and no great line ups to get in !", "publishedDate": "2014-03-10", "language": "en", "rating": 5}, {"id": 191640633, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d2272433-r191640633-Santa_Anna_Church-Barcelona_Catalonia.html", "text": "First see and experience it. Come back for a service or one of the periodic concerts that they have.\nIt is not too far from the Picasso Museum and it's in the Gothic quarter for more waling and sight seeing.", "publishedDate": "2014-01-21", "language": "en", "rating": 5}, {"id": 189960693, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d2272433-r189960693-Santa_Anna_Church-Barcelona_Catalonia.html", "text": "For only two euro you can enter this quiet and religious church. There are several great alters and secluded reflection areas. This is a nice find and a great place to take a break from the hustle and bustle of the city.", "publishedDate": "2014-01-06", "language": "en", "rating": 4}, {"id": 179024674, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d2272433-r179024674-Santa_Anna_Church-Barcelona_Catalonia.html", "text": "You can find this ancient church off St. Anna street, and only off that street.  Very small by comparison to the massive cathedrals, but it also has a cloister area.  Good site for a quick 30 minute visit.", "publishedDate": "2013-09-29", "language": "en", "rating": 5}, {"id": 162465287, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d2272433-r162465287-Santa_Anna_Church-Barcelona_Catalonia.html", "text": "We attended a candle-lit classical guitar concert one evening in the small chapel off the cloisters.   The Friday Rambla crowd was quickly forgptten as we spent an hour in a 900 year old room, followed by wine in the cloister.  If you are interested in Barcelona history, certainly Santa Anna is worth a stop. ", "publishedDate": "2013-05-30", "language": "en", "rating": 4}, {"id": 161717050, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d2272433-r161717050-Santa_Anna_Church-Barcelona_Catalonia.html", "text": "Prior to my arrival to Barcelona, I found a website in Germany called classictic.com.  I was able to research the various musical groups and soloists performing at different venues, including smaller venues such as the churches in Barcelona.  The Musica Reservata de Barcelona was performing one night at Santa Anna.  It was easy to arrange tickets for three adults, but the confirmation time may take several days for smaller venues.  The church was just around the corner from Placa de Catalunya.  This was a 10-12 member choral group performing ancient music of the 16th and 17th centuries.  Beautiful vocal performance enhanced by the acoustics of the church setting.  In Barcelona, you may see performances advertised by many of the churches: usually solo or small group guitarists or vocalists.  Check them out and enjoy all the sights...and sounds.", "publishedDate": "2013-05-24", "language": "en", "rating": 5}, {"id": 159222565, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d2272433-r159222565-Santa_Anna_Church-Barcelona_Catalonia.html", "text": "this small church was down a back alley and we only found it by mistake. It was beautiful.It was closed at the time we found it but we will return to view it next time we visit Barcelona.", "publishedDate": "2013-04-30", "language": "en", "rating": 5}, {"id": 158398320, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d2272433-r158398320-Santa_Anna_Church-Barcelona_Catalonia.html", "text": "Basically went there because of the novel, and found a great romanesque and gothic church with very nice cloisters in the heart of barcelona", "publishedDate": "2013-04-21", "language": "en", "rating": 4}, {"id": 157201075, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d2272433-r157201075-Santa_Anna_Church-Barcelona_Catalonia.html", "text": "Let the crowds go to the Sagrada family, their flip flops will drop off, yet 50 meters from the Rambles and Placa Catalunya there is this jewel of a church and Cloister belonging to the Equestrian order of the knights of the Sepulchre of Jerusalem.", "publishedDate": "2013-04-09", "language": "en", "rating": 5}, {"id": 149748425, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d2272433-r149748425-Santa_Anna_Church-Barcelona_Catalonia.html", "text": "As we were walking in Barcelona we saw this nice small church advertised, so we went through patio with a flower shop and into the Church honoring Santa Anna.  It was not very large, but was nice to sit for a while and pray away from the bustling crow of the city.  It had a lovely statue of the Santa Anna.", "publishedDate": "2013-01-15", "language": "en", "rating": 5}, {"id": 149363231, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d2272433-r149363231-Santa_Anna_Church-Barcelona_Catalonia.html", "text": "A medieval church with its exquisite cloister, tucked away 50 metres from the hustle and bustle of the heart of the city. Incredible!", "publishedDate": "2013-01-10", "language": "en", "rating": 5}, {"id": 147514366, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d2272433-r147514366-Santa_Anna_Church-Barcelona_Catalonia.html", "text": "One hour of marvelous evocative guitar in the candlelit Sala Capitular of Santa Anna from 9 - 10pm. Buy the tickets in advance (?18) at the florist at the entrance.", "publishedDate": "2012-12-15", "language": "en", "rating": 5}, {"id": 144331228, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d2272433-r144331228-Santa_Anna_Church-Barcelona_Catalonia.html", "text": "Very nice and quiet place to visit, we were happy to visit it, if it is open you should go in. We did the gothic trail and we found this old church. Nice person at the entry", "publishedDate": "2012-11-02", "language": "en", "rating": 4}, {"id": 143903842, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d2272433-r143903842-Santa_Anna_Church-Barcelona_Catalonia.html", "text": "The oldest church in Barcelona. Surrounded by thebest Commercial area, with all brands and original and different shops all around.", "publishedDate": "2012-10-28", "language": "en", "rating": 5}, {"id": 140042506, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d2272433-r140042506-Santa_Anna_Church-Barcelona_Catalonia.html", "text": "As the other reviews say, this show was amazing.  We bought their CDs and we are glad we did becuase they songs that they played are on the CDs.", "publishedDate": "2012-09-11", "language": "en", "rating": 5}, {"id": 132664641, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d2272433-r132664641-Santa_Anna_Church-Barcelona_Catalonia.html", "text": "If you are in Barcelona, you HAVE to find this place.  Its down an alley (more like a narrow street with shops).  It was a GREAT concert in a fabulous setting.  We ordered the tickets through www.classitic.com ahead of time and were able to just walk up and enjoy some wonderful music in a wonderful setting.  Can't say enough.   even the wine was good after.  ", "publishedDate": "2012-06-24", "language": "en", "rating": 5}, {"id": 123892264, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d2272433-r123892264-Santa_Anna_Church-Barcelona_Catalonia.html", "text": "On Saturdays they have a spanish guitar duo playing in the church.  The tickets are 24 Euros and include a glass of wine after the show where you can meet the artists.  It was an enjoyable evening.  ", "publishedDate": "2012-01-30", "language": "en", "rating": 4}, {"id": 118247203, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d2272433-r118247203-Santa_Anna_Church-Barcelona_Catalonia.html", "text": "We were given tickets to the performance by Duo de Guitarra as a silver wedding anniversary present during our week long stay in Barcelona and it was the highlight of our holiday. The soft lighting and small audience (about 70 persons maximum) in the chapter house definitely help create a magical atmosphere, but as soon as the guitarists started playing I felt a shiver down my spine. You feel transported back in time with traditional Spanish guitar at its best. The pieces by Sor, Ibanez and others, and the duo's rendition of 4 movements from Bizet's Carmen were awe inspiring. \nTickets for the performances can be purchased through the Barcelona Tourisme website, and for anyone who has an interest in Spanish guitar, this is not to be missed", "publishedDate": "2011-09-17", "language": "en", "rating": 5}, {"id": 117975804, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d2272433-r117975804-Santa_Anna_Church-Barcelona_Catalonia.html", "text": "My husband, my sixteen year old daughter and myself went to a concert here on our first night in Barcelona. We had found the event - The Art of the Spanish Guitar -  on the Barcelona Tourism web page and booking on line was quick and easy. The candlelit performance which is held in the 15th century chapterhouse is magical. We saw the Barcelona Duo de Guitarra and their playing was brilliant. Wine is available after the concert, which lasted around an hour , and also the opportunity to meet the artists. A wonderful way to spend our first night in Barcelona and experience a bit of the real Spain.", "publishedDate": "2011-09-12", "language": "en", "rating": 5}]}}]