[{"locationId": 10340402, "name": "Gran Lago del Parque de la Ciudadela", "placeType": "ATTRACTION", "reviewListPage": {"reviews": [{"id": 722301158, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d10340402-r722301158-Gran_Lago_del_Parque_de_la_Ciudadela-Barcelona_Catalonia.html", "text": "A lake in the centre of the park, we had hoped to take out a rowing boat, but they were all tied up when we were there. Early risers with children. Still had a lovely time in the park though.", "publishedDate": "2019-10-29", "language": "en", "rating": 4}, {"id": 580543442, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d10340402-r580543442-Gran_Lago_del_Parque_de_la_Ciudadela-Barcelona_Catalonia.html", "text": "It’s a really nice place for pictures, having a picnic, hanging about and meeting people. The improvised dancing classes are great fun!", "publishedDate": "2018-05-15", "language": "en", "rating": 5}, {"id": 565295937, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d10340402-r565295937-Gran_Lago_del_Parque_de_la_Ciudadela-Barcelona_Catalonia.html", "text": "I surprised at the size of this lake, it's really very large for what is essentially supposed to be a pond in a park.  Impressive.  It's surrounded in birdlife and even has an island or two in the middle where the birds make nests, rest up and of course the banks of this lake also provide areas for birds to rest (see pics).\n\nPeople hire row boats and row around the lake (see pic) - there were many boats in the lake on the day I was there, yet there was still plenty of room in the lake for even more.  \n\nAround the lake there are various benches to sit and enjoy the scene, as well as a life size sculpture of a woolly mammoth (see pics).", "publishedDate": "2018-03-08", "language": "en", "rating": 4}, {"id": 559582570, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d10340402-r559582570-Gran_Lago_del_Parque_de_la_Ciudadela-Barcelona_Catalonia.html", "text": "Visiting the pond during winter proved to be a much less exciting experience than during the summer, obviously.\nMost of the trees looked completely bare and most of the ducks and other birds have flown to warmer places.", "publishedDate": "2018-02-10", "language": "en", "rating": 3}, {"id": 475330696, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d10340402-r475330696-Gran_Lago_del_Parque_de_la_Ciudadela-Barcelona_Catalonia.html", "text": "Well planted out and it was a nice feature to have the area jutting out into the middle. The bridge with a waterfall coming down either side gave some good opportunities for rowers to make their passengers worried about getting soaked!", "publishedDate": "2017-04-13", "language": "en", "rating": 5}, {"id": 460859666, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d10340402-r460859666-Gran_Lago_del_Parque_de_la_Ciudadela-Barcelona_Catalonia.html", "text": "This is a lovely pond at the Ciutadella  park, where you can rent a paddle boat and enjoy 30 minutes of exercise (or romance, depending on how you look at it).\nThe pond is very tranquil and the view of the park and the occasional swan make it a solid choice for couples.", "publishedDate": "2017-02-18", "language": "en", "rating": 4}, {"id": 437609375, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d10340402-r437609375-Gran_Lago_del_Parque_de_la_Ciudadela-Barcelona_Catalonia.html", "text": "It doesn't cost much and it's a great way to get up close with the birds and sneak up on the basking Terrapins which live I the lake. Even in November the flowering bushes were lovely. We were lucky enough to be close by when a heron flew in and landed on the tree near us. Things seem to happen when you're in a boat and you see all sorts of things! ", "publishedDate": "2016-11-15", "language": "en", "rating": 5}, {"id": 400140512, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d10340402-r400140512-Gran_Lago_del_Parque_de_la_Ciudadela-Barcelona_Catalonia.html", "text": "The lake is situated In the centre of the Ciutadella Park.\nCiutadella Park is impessive beautiful, and the lake is idyllic.\nDon't forget Ciutadella Park", "publishedDate": "2016-08-01", "language": "en", "rating": 4}]}}]