[{"locationId": 10230999, "name": "Playa de la Mar Bella", "placeType": "ATTRACTION", "reviewListPage": {"reviews": [{"id": 751624252, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d10230999-r751624252-Playa_de_la_Mar_Bella-Barcelona_Catalonia.html", "text": "My wife and I came here without knowing it was a naturist beach. It’s a really nice clean sandy beach with some racks you can lean against if you want some shelter. It only took us a few mins to realise it was a naturist beach for obvious reasons. We were about the only ones clothed. If you’re open minded and it’s not busy it’s a real nice beach. Some naked guys were getting a bit friendly with each other in view of everyone so if you can turn a blind eye you’ll be fine. If not, definitely go to the beach up the road 5 minute away. ", "publishedDate": "2020-03-22", "language": "en", "rating": 4}, {"id": 723168629, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d10230999-r723168629-Playa_de_la_Mar_Bella-Barcelona_Catalonia.html", "text": "It was a cool 16deg so maybe not the best day for a beach visit. That being said it was nice to walk on the promenade. Saw a few cafes too.\nClean beach chilled vibes enjoyed the sunset too.", "publishedDate": "2019-11-01", "language": "en", "rating": 3}, {"id": 699954116, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d10230999-r699954116-Playa_de_la_Mar_Bella-Barcelona_Catalonia.html", "text": "We took the metro from the city out to this gay friendly beach. It was about a 15 minute walk form the metro. The sand was very clean and the water warm but still refreshing. We decided to walk back into La Barceloneta. It was a good 45 - 1 hour walk but the board walk is beautiful.", "publishedDate": "2019-08-17", "language": "en", "rating": 4}, {"id": 675523736, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d10230999-r675523736-Playa_de_la_Mar_Bella-Barcelona_Catalonia.html", "text": "They seem to be adding sand at the moment so very restricted access. Probably very nice when not restricted.", "publishedDate": "2019-05-21", "language": "en", "rating": 3}, {"id": 637414024, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d10230999-r637414024-Playa_de_la_Mar_Bella-Barcelona_Catalonia.html", "text": "\nLovely beautiful area plenty to see and do for all the family. Great for cycling and lovely clean beaches! 👍 \n\nPlenty of bike hire available.\n", "publishedDate": "2018-12-04", "language": "en", "rating": 4}, {"id": 626872232, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d10230999-r626872232-Playa_de_la_Mar_Bella-Barcelona_Catalonia.html", "text": "There are signs  and maps along the promenade so when you see the sign for this beach take the short path to the beach and the rest is up to you. A sandy cove at one end, a narrow slightly shingle bit in the middle and a wider sandy area at the North East end.", "publishedDate": "2018-10-20", "language": "en", "rating": 5}, {"id": 607830755, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d10230999-r607830755-Playa_de_la_Mar_Bella-Barcelona_Catalonia.html", "text": "Spent a wonderful day at this beautiful beach, Warm, smooth water, hot sand (it's August, after all!) and all types of people mixed together--all shapes and sizes, ages,  suited up, unsuited (nude or partially nude), singles, couples, families, gays, straight, newbies, tourists,and regulars...all smiling,enjoying the freedom and joys of the sun and water. Total relaxation. Ahh, can life be any better?? I took a taxi from the historic old city center, for about 10 euros. Snacks and drinks available from roaming vendors as well as at food stands. Restrooms and outdoor showers near the beach. Lots of room (it was a Monday) if you want to spread out, or be closer to others if that is your preference. Everyone is friendly and respectful. Ahh, can life be any better??", "publishedDate": "2018-08-18", "language": "en", "rating": 5}, {"id": 600992794, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d10230999-r600992794-Playa_de_la_Mar_Bella-Barcelona_Catalonia.html", "text": "A bit further away from the first main beach in Barcelona, the Mar Bella beach is less busy and really nice. There is a real mixture of people, everything from 2-3 generation families to gay couples, and a mixture of naked and swimming gear clad people. Everything goes here, and it’s all very comfortable and easy going. I think only one part of the beach is nudist, but even there, some people have swimming gear on. A very relaxed atmosphere, and a very good mixture of people, to celebrate diversity and tolerance.", "publishedDate": "2018-07-30", "language": "en", "rating": 5}, {"id": 597916687, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d10230999-r597916687-Playa_de_la_Mar_Bella-Barcelona_Catalonia.html", "text": "A very nice beach with very nice beach bars for snacks and drinks. \nThe area right behind the cars parking lot is the family beach area. The beach on the right also Mar Bella beach is more of a nude area. \nDefinitely we liked the family beach at Mar Bella more than Barceloneta beach. ", "publishedDate": "2018-07-20", "language": "en", "rating": 5}, {"id": 593695356, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d10230999-r593695356-Playa_de_la_Mar_Bella-Barcelona_Catalonia.html", "text": "Playa de la Mar Bella is an easily-accessible beach, and the clothing-optional area spans roughly between the signs 30 and 31. When I got close to the area heading down from Nova Mar Bella beach, a friendly guy gave us a hand-out that said, \"Welcome to Mar Bella Beach. This is a clothing-optional beach so take your swimsuits off!\"\nAs many nudist beaches in major cities are, it's also a gay beach, meaning that there are a lot more men than women. That said, everybody was respectful and there were no obscene PDAs in sight, just simply FKK.\nThere was one restaurant/bar where they rented out parasols and sunchairs. Water was warm enough to get in and cool enough to help you cool down. There are shower stations (no foaming products) and toilets nearby.\nIf you want to spend some time in the sun, all natural, this is the perfect beach for you.", "publishedDate": "2018-07-07", "language": "en", "rating": 5}, {"id": 547316935, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d10230999-r547316935-Playa_de_la_Mar_Bella-Barcelona_Catalonia.html", "text": "Playa de la Mar Bella is a beautiful urban nudist beach near the Poble Nou area of Barcelona. \n\nThe beach is unofficially divided in three areas: Families, mixed and gay. Even though it is a nudist beach, some sunbathers prefer to keep their beach gear on - especially in the family area. \n\nBeach vendors walk around and sell everything from ice cream to Sangria, but you can also enjoy many of the bars located on the beach (the beach bar BeGay has a fantastic vibe). \n\nIn peak season the beach can get quite packed, but that makes it all the more fun. The sea is warm and clean. The vibe on the beach is friendly, relaxed and sexy with many locals socializing with tourists. I've made many acquaintances and since the Spanish are such friendly and openhearted people, it was easy to connect with locals and relax.\n\nA great spot for people watching. A must visit!", "publishedDate": "2017-12-15", "language": "en", "rating": 5}, {"id": 506893755, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d10230999-r506893755-Playa_de_la_Mar_Bella-Barcelona_Catalonia.html", "text": "La Mar Bella beach is an urban beach located near the Poble Nou area of Barcelona.  About half of La Mar bella is designated nudist and the signs are clearly visible.  We spent a lot of time on this beach because our hotel was right in front of the beach.  Being long time Nudists, we found the beach to be extremely nice.  Though it is a nudist beach, about 40 percent were nude and another 30 percent were topless.  The rest were clothed.  This is probably because a majority were tourists and unfamiliar or uncomfortable with nudity.  The beach is narrow at the south end and widens considerably near the beach bar BeGay.  The water in July was warm and refreshing.  The beach is sandy and clean.  The sand extends for a while into the water and there were few rocks or  algae or shells. There are also the occasional beach vendor that would come by selling everything from Sangria to beer to vodka and water.  The beach is well patrolled by life guards as well as police.  Overall, the beach was a great place to people watch and get a great all over tan.  It can be a bit crowded at times but we found that people were respectful.  At Mar bella, dont be surprised to be laying towel to towel with complete strangers naked enjoying the beach.", "publishedDate": "2017-07-29", "language": "en", "rating": 5}, {"id": 494342147, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d10230999-r494342147-Playa_de_la_Mar_Bella-Barcelona_Catalonia.html", "text": "Great beach. Clean. Friendly. Great for couples. There is a beach a little north that is better for young kids. This beach was quiet and not as crazy as some of the other ones around, but don't let that stop you. There are plenty of servers bringing drinks to you and places to grab a quick bite to eat. Definitely a must see!! ", "publishedDate": "2017-06-19", "language": "en", "rating": 5}, {"id": 475377559, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d10230999-r475377559-Playa_de_la_Mar_Bella-Barcelona_Catalonia.html", "text": "I didn't realise this was a naturist beach, until I arrived home and read a few reviews before typing my own. This definitely wasn't obvious at the time despite it being a very warm day when I visited.", "publishedDate": "2017-04-13", "language": "en", "rating": 3}, {"id": 474847570, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d10230999-r474847570-Playa_de_la_Mar_Bella-Barcelona_Catalonia.html", "text": "This is one of the naked beaches on Barcelona. It's hidden by a little mount, so if you are walking by the sidewalk you don't see it.  It's large with many people naked and not naked. The water of the sea sometimes is not clean. \n\n", "publishedDate": "2017-04-11", "language": "en", "rating": 5}, {"id": 443175841, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d10230999-r443175841-Playa_de_la_Mar_Bella-Barcelona_Catalonia.html", "text": "This beach is less crowded and less dirty than Barceloneta. But it still has a lot of people. It hosts a big gay crowd on most of the days if not all of them. The atmosphere is pleasant. You can find people of almost every age here, I did not see any families or younger kids/teens on that beach however. There is a bar where you can get drinks and bathrooms not far. The beach is also optional clothing beach. So you can bask in your birthday suit or skinny dip in the daylight if you choose.", "publishedDate": "2016-12-09", "language": "en", "rating": 5}, {"id": 423244819, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d10230999-r423244819-Playa_de_la_Mar_Bella-Barcelona_Catalonia.html", "text": "The beach is very beautiful, the sand is not very white, but the water is amazing: blue and green, very clean and transparent!\nAlthough nudism is optional and not everybody goes for it, you can take out your swimsuit and relax, none will stare at you. You can even go naked to the bar to buy a beer and some crisps, (almost) none will notice! It is a great feeling of freedom!", "publishedDate": "2016-09-28", "language": "en", "rating": 4}, {"id": 414111197, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d10230999-r414111197-Playa_de_la_Mar_Bella-Barcelona_Catalonia.html", "text": "We came here often for an afternoon (after 4 pm, with the sun not at peak power) to relax after visiting the various Gaudi' masterpieces... Great combined holidays you can have here, spend time visiting beauty but taking queues and metros and so on; then a light lunch, a small siesta in the hotel room to pass the peak heat, and then hop a metro ... and undress on a nice beach. There are several in Barcelona, similar to each other (sandy and pebbly beaches), but this is special as it is clothes optional. Therefore those who, like us, don't like this damp stuff clinging to your skin all the time, here can be fully free, in a respectful and friendly environment. Take some fruit with you, like a watermelon or peaches, that you can buy in nice shops close by, and plenty of water, and you are in for enjoying sun and waves!", "publishedDate": "2016-09-03", "language": "en", "rating": 4}, {"id": 410495925, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d10230999-r410495925-Playa_de_la_Mar_Bella-Barcelona_Catalonia.html", "text": "Mar Bella beach is known as the nudist beach, but it’s more of an “optional clothing” beach….clothing and nudity – they are all acceptable. The water is lovely and warm, but the waves can be choppy when it’s windy. The beach bar is great. You can the rent sun loungers and sun umbrellas in front of the beach bar for the day (sun loungers are €6 each (€8 each with top mattress) and the sun umbrellas are €5). The bar serves food and drinks to the sun loungers – drinks are a bit pricy, but you’re on the beach. You can use your T10 to take the metro to Poblenou (Line 4 – yellow line) and walk straight down Carrer Bilbao to Mar Bella beach….past the skateboard park. Definitely worth a visit.", "publishedDate": "2016-08-25", "language": "en", "rating": 4}, {"id": 407940711, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d10230999-r407940711-Playa_de_la_Mar_Bella-Barcelona_Catalonia.html", "text": "If you are staying at Barcelona and you don't like the heavy crowds at Barceloneta just head 25 kms up the coast to Mar Bella. Much quieter. We rode electric bikes that we rented at Barceloneta for just €15 each for an hour. It was fabulous. Did it at sunset. Gorgeous way to end a day. Would highly recommend it as a way of seeing the coastline. You do have to dodge in and out of the other bikes, skateboards, joggers and pedestrians but that is part of the fun. ", "publishedDate": "2016-08-20", "language": "en", "rating": 4}, {"id": 404584213, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d10230999-r404584213-Playa_de_la_Mar_Bella-Barcelona_Catalonia.html", "text": "Packed with people. Great vibe stayed until 8pm swam all day. Really good. But make sure your confident in the water as it gets deep really quickly.  Absolutely love barcelona. Probably my favourite city in the world. ", "publishedDate": "2016-08-12", "language": "en", "rating": 5}, {"id": 401430239, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d10230999-r401430239-Playa_de_la_Mar_Bella-Barcelona_Catalonia.html", "text": "perfect for naked sunbathing. It might be bit crouded as felt bit squashed. But beach is sandy, water is warm and its much more private that barceloneta as the is no street path next to it.", "publishedDate": "2016-08-04", "language": "en", "rating": 5}, {"id": 392440502, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d10230999-r392440502-Playa_de_la_Mar_Bella-Barcelona_Catalonia.html", "text": "Caught the H12 to the beach. As we had toddlers, hired beach chairs & umbrellas for 36€.\nFound a great value falafel wrap shop just a short walk away.\nThe water was clear & refreshing.\nThe H12 home to our Airbnb on the bus again using out T10 ticket.", "publishedDate": "2016-07-14", "language": "en", "rating": 4}]}}]