[{"locationId": 10215257, "name": "Jardins del Mirador del Alcalde", "placeType": "ATTRACTION", "reviewListPage": {"reviews": [{"id": 723536395, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d10215257-r723536395-Jardins_del_Mirador_del_Alcalde-Barcelona_Catalonia.html", "text": "The view is ok. Main complaint is the small kiosk there.  It's run by two (I believe) Filipinos that are extremely impolite towards tourists that do not buy from them.  I witness them telling tourist and even children to leave their area if they are not buying anything.  It's basically a public area with some benches that people may walk by.  I don't understand why they need to be so rude or maybe they are just discriminating against tourist from certain countries that they do not think will shop from them.", "publishedDate": "2019-11-03", "language": "en", "rating": 1}, {"id": 674584939, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d10215257-r674584939-Jardins_del_Mirador_del_Alcalde-Barcelona_Catalonia.html", "text": "Jardins del Mirador del Alcalde is a lovely area full of green! There are some landscaped flower beds and a fountain and the like which make it nice. However what really makes a walk up this hill worthwhile are the stunning views you get of the harbour and the boats, as well as parts of the city. There is some seating, including  benches and chairs and tables, as well as lots of grassed area! There is also a little shop where you can get coffee and lots  of other things.", "publishedDate": "2019-05-17", "language": "en", "rating": 4}, {"id": 666692452, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d10215257-r666692452-Jardins_del_Mirador_del_Alcalde-Barcelona_Catalonia.html", "text": "A lovely Garden on top of a hill, with a fabulous view of the sea & harbor. \n Also many Cruise ships can be seen from the top, as Barcelona is a starting point for many cruises.\nVery  well maintained gardens, most tourist visit these gardens.\nA lovely place for photographs, as it has a beautiful view.\nWell worth a visit.", "publishedDate": "2019-04-15", "language": "en", "rating": 4}, {"id": 593655059, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d10215257-r593655059-Jardins_del_Mirador_del_Alcalde-Barcelona_Catalonia.html", "text": "Walking through this area with it's fountain, statue & great views we came to this coffee shop on the way down from the castle. Most impressed with the extremely friendly service, good food & drink yet inexpensive. Small choice of food but also sells beer etc. Lot of seating available Near where the buses stop.", "publishedDate": "2018-07-06", "language": "en", "rating": 4}, {"id": 593605220, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d10215257-r593605220-Jardins_del_Mirador_del_Alcalde-Barcelona_Catalonia.html", "text": "When I am in Barcelona I do a long walk every day from Placa Espanya via Jardins Mirador del Alcade to the top of Montjuic castle through the Olympic stadium and back it’s a great walk and this little park has lovely views and is quite popular with the tourists. If you are walking up to the castle or more likely down pop in have a look it’s worth the effort ", "publishedDate": "2018-07-06", "language": "en", "rating": 5}, {"id": 593567858, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d10215257-r593567858-Jardins_del_Mirador_del_Alcalde-Barcelona_Catalonia.html", "text": "This is a lovely park with lots of greenery and benches (and with some makeshift food stalls for finger food, beverages and some souvenirs), and most importantly, from here, visitors can have an awesome and great bird eye's view from the top over the pier and the other parts of the city, with the iconic landmark buildings. Very nice and beautiful.\n\nIt was a sunny day when our tour group arrived here after visiting the nearby Olympic stadium (do check out on my earlier review of this place here too).\n\nThere were also some street peddlers selling souvenir items. Do watch out for pickpockets though especially when there is a huge crowd of people around.", "publishedDate": "2018-07-06", "language": "en", "rating": 4}, {"id": 584366137, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d10215257-r584366137-Jardins_del_Mirador_del_Alcalde-Barcelona_Catalonia.html", "text": "The garden is lovely and the views are great. Not as impressive as on the other side of the city, but still fabulous. Street sellers are there trying to make a living but watch out evenings when it’s less safe apparently  ", "publishedDate": "2018-06-01", "language": "en", "rating": 5}, {"id": 583761673, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d10215257-r583761673-Jardins_del_Mirador_del_Alcalde-Barcelona_Catalonia.html", "text": "These gardens are located in the Monjuic area. It was a photo stop while on tour. Great views over the city and harbour area.  nice water feature. Frankly, if our bus had not stopped here, we would not know it existed.", "publishedDate": "2018-05-29", "language": "en", "rating": 4}, {"id": 580915130, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d10215257-r580915130-Jardins_del_Mirador_del_Alcalde-Barcelona_Catalonia.html", "text": "Went to Montjuic gardens today and was approached by 2 young women “collecting money for deaf children”. We gave them a few euros and they asked us to sign their petition. They then asked for ID. I said no, my husband got his wallet out for driving licence, a 3rd women dived in from behind and grabbed all of the money from his wallet, over 100 euros! ", "publishedDate": "2018-05-17", "language": "en", "rating": 1}, {"id": 558613637, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d10215257-r558613637-Jardins_del_Mirador_del_Alcalde-Barcelona_Catalonia.html", "text": "Visited this area early one morning before any crowds had built up. The places selling snacks and drinks were just opening up. It is a lovely place to wander around with many fine views of the docks and across the city. You can visit using the cablecar or walk. Several coach tours use it as place to stop and give people the chance to take pictures. Not the most obvious place to visit but is worthwhile spending an hour or two here.", "publishedDate": "2018-02-05", "language": "en", "rating": 4}, {"id": 541913902, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d10215257-r541913902-Jardins_del_Mirador_del_Alcalde-Barcelona_Catalonia.html", "text": "Take a walk tour and go up to the hill, where you have excellent panorama view over city and harbor. It's free of charge.", "publishedDate": "2017-11-19", "language": "en", "rating": 4}, {"id": 505513270, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d10215257-r505513270-Jardins_del_Mirador_del_Alcalde-Barcelona_Catalonia.html", "text": "Such a lovely park it is !!\nWe were going down from Montjuic Castle when we saw the park and decided to go through it. We are very glad we did !!\nPark is well-matained and has lovely plants. Pathes are decorated in quire a unique ways. There is small cascade of fontains (it didn't work when we were there but it looked pretty anyway).\nYou can see great views of Barcelona from the viewpoint of the park. \nWhat we liked a lot is that the park wasn't crouded at all !! There are many banches where you can relax for a while.\nIn addition, there is a small cafe where you can have drinks and snacks if you want.\nNo doubt, the park is worth a visit !!", "publishedDate": "2017-07-25", "language": "en", "rating": 5}, {"id": 492660655, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d10215257-r492660655-Jardins_del_Mirador_del_Alcalde-Barcelona_Catalonia.html", "text": "And so glad we did. We were aiming for the Jardins de Miramar and got off the bus too early. Very good views over Barcelona and it wasn't crowded so you could take your time. The fountains weren't working when we were there but they were kept very clean. Interesting paving made out of tiles and cogs and other bits of machinery.", "publishedDate": "2017-06-13", "language": "en", "rating": 4}, {"id": 470658710, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d10215257-r470658710-Jardins_del_Mirador_del_Alcalde-Barcelona_Catalonia.html", "text": "We stopped at the Jardins del Mirador del Alcalde for a drink and snack on the exhausting climb to the top of Montjuic to the castle.\nCable car option available at 8 euros for a 5 min ride to the top or bus (sorry don't know cost).\nThe gardens provide magnificent views of Barcelona and contains a small cafe/rest room selling soft and alcoholic drinks. The gardens are immaculately kept and contains a wonderful little waterfall.\nThere are, as everywhere else in Barcelona, street vendors in the gardens but they don't hassle you.", "publishedDate": "2017-03-27", "language": "en", "rating": 4}, {"id": 460563512, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d10215257-r460563512-Jardins_del_Mirador_del_Alcalde-Barcelona_Catalonia.html", "text": "Great views from this mountain of the city and to the beach.  We arrived there by bus, but guess there are other ways of getting there. You can see a lot of Barcelona from here.  Worth a visit to take another aspect of the city.", "publishedDate": "2017-02-16", "language": "en", "rating": 4}, {"id": 399443599, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d10215257-r399443599-Jardins_del_Mirador_del_Alcalde-Barcelona_Catalonia.html", "text": "The views of the port and the city are spectacular. There are also nice, large fountains, and the architects also decorated the pavement. There are some street vendors catering to tourists (expensive), along with a small snack shop /restroom. The scenery is free and close to the '92 Olympic venues - highly recommended. ", "publishedDate": "2016-07-31", "language": "en", "rating": 5}, {"id": 390798576, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d10215257-r390798576-Jardins_del_Mirador_del_Alcalde-Barcelona_Catalonia.html", "text": "The most beautiful view ever! You get to see the beach and the city. If you have extra time then make your way up to see the sight!", "publishedDate": "2016-07-09", "language": "en", "rating": 5}, {"id": 385286061, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d10215257-r385286061-Jardins_del_Mirador_del_Alcalde-Barcelona_Catalonia.html", "text": "After our poble Espanyol visit, this is a place we stopped by with our tour.You can see Barcelona from a different window. It was not crowded. It is like a vista point of this beautiful city. Take a stop and watch around before going to Park Guel.", "publishedDate": "2016-06-23", "language": "en", "rating": 3}, {"id": 370128749, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d10215257-r370128749-Jardins_del_Mirador_del_Alcalde-Barcelona_Catalonia.html", "text": "I got there the first time by accident and since that day, I've never stopped going back. The Jardins del Mirador del Alcalde are in front of the first station of the Funicular de Montjuic and like many parks on Barcelona, it has a story of its own.\n\nThe place not only offers a singular watching point of the port and most of Barcelona, it has a particular style for its floors and a cascade fountain that sounds incredible at noon.\n\nOne of the most amazing things about this place is that, because of its location, almost on the top of Montjuic, it is not usually crowded and you can enjoy all of its beauty and more, you can relax, read, have lunch on its cafeteria and even take a nap to rest if you had the courage to get there walking or on a bike like I usually do.\n\nThe magic of this place got me from the first time and forced me on april 2016 to experience watching the sunrise from here, so I climbed Montjuic on my bike at 5:30 AM and got stunned by an incredible show of light when the sun started iluminating Barcelona.\n\nGo, do it, you wont regret it.", "publishedDate": "2016-05-04", "language": "en", "rating": 5}]}}]