[{"locationId": 6847808, "name": "La Virreina Centre de la Imatge", "placeType": "ATTRACTION", "reviewListPage": {"reviews": [{"id": 736990832, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d6847808-r736990832-La_Virreina_Centre_de_la_Imatge-Barcelona_Catalonia.html", "text": "There are exhibitions in a very beautiful old town palace. The entrance is free. Who is interested in photography should take the opportunity to visit.", "publishedDate": "2020-01-05", "language": "en", "rating": 4}, {"id": 680333398, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d6847808-r680333398-La_Virreina_Centre_de_la_Imatge-Barcelona_Catalonia.html", "text": "There was an exhibition of the works of August Sander, Maria Acha-Kutscher when we were there, and Claudio Zulian's work was the next to be shown.  The photography was brilliant and very detailed and we spent about half an hour or so examining them all.", "publishedDate": "2019-06-09", "language": "en", "rating": 5}, {"id": 669658142, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d6847808-r669658142-La_Virreina_Centre_de_la_Imatge-Barcelona_Catalonia.html", "text": "If you love fine black and white portrait photography, catch La Virreina's current August Sander show, ending sometime in June. This is the largest show I have ever heard of for Sander--and even if you think you know his work, La Virreina's show will open your eyes to the breadth of his vision (typically, museums only have one or two of his pieces). Beautifully curated and displayed, and also free of charge. Amazing.", "publishedDate": "2019-04-27", "language": "en", "rating": 5}, {"id": 650181764, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d6847808-r650181764-La_Virreina_Centre_de_la_Imatge-Barcelona_Catalonia.html", "text": "My husband and I stumped unto to this place which was a few doors away from our hotel Baques and near the Marcat. Interestingly it was great to see and surpringly little history and advertisements available. Free entry, entertaining and of course it’s 18 century maintain decor was well worth the visit.", "publishedDate": "2019-02-04", "language": "en", "rating": 4}, {"id": 611111906, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d6847808-r611111906-La_Virreina_Centre_de_la_Imatge-Barcelona_Catalonia.html", "text": "Former urban palace, built in the late 18th century and named after the wife of the Spanish Viceroy of Peru, Palau de la Virreina is now a Centre for Image, dedicated to art exhibitions and events. It’s a nice quiet place right between the overcrowded Ramblas and La Boqueria, and they have at the moment an extensive retrospective on Catalan photography among others. Also important - the Centre for Image is free to visit.", "publishedDate": "2018-08-27", "language": "en", "rating": 4}, {"id": 512856618, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d6847808-r512856618-La_Virreina_Centre_de_la_Imatge-Barcelona_Catalonia.html", "text": "This place is on la rambla and is a free exposition of \"things\" it's a quaint small exposition that is well worth a look. I suspect it will change to something else soon. Worth a look. ", "publishedDate": "2017-08-14", "language": "en", "rating": 5}, {"id": 492354232, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d6847808-r492354232-La_Virreina_Centre_de_la_Imatge-Barcelona_Catalonia.html", "text": "Next to the now permanently packed Boqueria market is the beautiful late 18th century Palau (palace) de la Virreina, (named after the wife of a Spanish Viceroy of Peru), an old mansion converted into a cultural centre dedicated mostly to images and photography. It currently houses an excellent retrospective exhibition of Italian artist Ketty la Rocca. Visits are free and strongly recommended to visitors who wish to take a rest from the overcrowded Rambla. ", "publishedDate": "2017-06-11", "language": "en", "rating": 4}, {"id": 478156248, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d6847808-r478156248-La_Virreina_Centre_de_la_Imatge-Barcelona_Catalonia.html", "text": "Great place to visit, nice interesting exhibitions from great (not very well-known) artists. \nThe free guided tour of the gallery is highly recommendable, although they don't publicised it well enough.", "publishedDate": "2017-04-23", "language": "en", "rating": 5}, {"id": 454274790, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d6847808-r454274790-La_Virreina_Centre_de_la_Imatge-Barcelona_Catalonia.html", "text": "Great place. Cool architecture. They always offer very interesting exposition and they were always free. Fantastic!!!", "publishedDate": "2017-01-23", "language": "en", "rating": 5}, {"id": 425302843, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d6847808-r425302843-La_Virreina_Centre_de_la_Imatge-Barcelona_Catalonia.html", "text": "We spent about 30 minutes viewing the different figures of the giants along with reading the history. It was very interesting and free.", "publishedDate": "2016-10-05", "language": "en", "rating": 4}, {"id": 418826280, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d6847808-r418826280-La_Virreina_Centre_de_la_Imatge-Barcelona_Catalonia.html", "text": "Great exhibition on at the moment of Barcelona's history through the photographs by some of Spain's greatest artists. Beautifully displayed in chronological order showing the growth of Barcelona through the ages. Free entry with explanations of each of the rooms in a number of languages. Stunning building complements the works. ", "publishedDate": "2016-09-15", "language": "en", "rating": 5}, {"id": 405625886, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d6847808-r405625886-La_Virreina_Centre_de_la_Imatge-Barcelona_Catalonia.html", "text": "The images were undoubtedly interesting and I'm generally happy I visited because I learnt much. However, given the informative nature of the exhibition, the communication is done terribly. The image descriptions look like a puzzle and it takes much time to figure out which description belongs to which image. Such images are not always observed for their artistic beauty, but rather for the information they transmit, therefore it is important to make sure that this information is given to the visitors in a better way rather than sticking an A4 paper on the wall which tells about 15 photos at once. Would have been so much better if each photo had its own description written underneath. \n\nPlease, consider improving the communication strategy. \n\nThe videos shown in the screening areas were very interesting too.", "publishedDate": "2016-08-15", "language": "en", "rating": 3}, {"id": 361268583, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d6847808-r361268583-La_Virreina_Centre_de_la_Imatge-Barcelona_Catalonia.html", "text": "The March-June 2016 programme: Barcelona, admission free, The Metropolis in the Age of Photography, 1860-2004, is an incredibly well curated and comprehensive pictorial history. The hanging is excellent, the movie clips well chosen and the original documents reek of the pathos of things past.\n\nThe selection courageously includes photographs (mostly original prints) and film from the general strike, the civil war and the dictatorship. There are also original 19c prints (albumen, silver, etc) of the periods of major redevelopment. Photos of the demolition and building activities are backed up by the original plans to demolish swathes of higgledy-piggledy streets to be replaced by wide boulevards & impressive facades indicating Barcelona's new industrial status. \n\nBarcelona was well photographed from the 1850's onwards. Some visitors were visibly moved by the material. Residents and visitors to the city, especially those interested in political and social history should make time yo see this exhibition. \n\nAdmission is free!\n", "publishedDate": "2016-04-03", "language": "en", "rating": 5}, {"id": 326328776, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d6847808-r326328776-La_Virreina_Centre_de_la_Imatge-Barcelona_Catalonia.html", "text": "Palau de la Virreina is a lovely building situated on La Rambla. Well worth a visit if you are walking down La Rambla.", "publishedDate": "2015-11-12", "language": "en", "rating": 5}, {"id": 244820053, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d6847808-r244820053-La_Virreina_Centre_de_la_Imatge-Barcelona_Catalonia.html", "text": "Really interesting exhibit showcasing the struggles of the Chinese nation, their lack of freedom and the heavy laws imposed by its government. Anyone in Barcelona should prioritize this exhibit as it gives us an insight into a nation \"protected\" by barriers that crunches its citizens. \n\nLa Palau de la Virreina is a stunning building along Las Ramblas, which is open to the public. \n\nIf I am not mistaken, the exhibit will be in the Palau de la Virreina until February, 2015.", "publishedDate": "2014-12-17", "language": "en", "rating": 5}, {"id": 178603243, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d6847808-r178603243-La_Virreina_Centre_de_la_Imatge-Barcelona_Catalonia.html", "text": "one of the most exiting exhibit i'v seen about video art!\nalso a tiny photo exhibition on early years of apple & microsoft, and all the giants of the town... Oh i forgot... it's free!", "publishedDate": "2013-09-25", "language": "en", "rating": 5}]}}]