[{"locationId": 3410795, "name": "Raval", "placeType": "ATTRACTION", "reviewListPage": {"reviews": [{"id": 567063840, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d3410795-r567063840-Raval-Barcelona_Catalonia.html", "text": "Unless you’ve done everything else there is to do in Barcelona go ahead and skip this one. It’s said to be “up and coming” but nobody says up and coming to what exactly.\nI can’t go so far as to call it a bad neighborhood, but it’s for sure not one I would hit on any sort of holiday. \nIn fact, you’re better off finding a neighborhood you like and seeing it twice. Time much better spent.", "publishedDate": "2018-03-17", "language": "en", "rating": 1}, {"id": 551099355, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d3410795-r551099355-Raval-Barcelona_Catalonia.html", "text": "Stayed in this area for three nights.  Did not find anything that interesting.  Still has a lot of restaurants, small eating establishments and shops run by immigrants.  Not that far from Las Ramblas.  Probably would not stay in this area on a return trip.", "publishedDate": "2018-01-03", "language": "en", "rating": 3}, {"id": 539780636, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d3410795-r539780636-Raval-Barcelona_Catalonia.html", "text": "It’s one of the few places that are authentic in Barcelona. It still has the feel of the pre World Cup , Olympic city which was when everything changed. It’s an immigrant area with lots of Filipino’s , South Asians etc etc living here and it’s extremely popular so rents and house prices are surprisingly high. Despite what it says in other reviews it’s safe even late at night compared to say La Rambla. Sure there are a few , very few ladies of the night in one tiny area. There are also great restaurants, bars and a great nightlife. ", "publishedDate": "2017-11-09", "language": "en", "rating": 4}, {"id": 535094606, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d3410795-r535094606-Raval-Barcelona_Catalonia.html", "text": "Not only safe and attractive but hardly any tourists (unlike the clogged Las Ramblas nearby). Stroll through and admire the locals on the park benches.", "publishedDate": "2017-10-22", "language": "en", "rating": 4}, {"id": 516420274, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d3410795-r516420274-Raval-Barcelona_Catalonia.html", "text": "Sadly its not a place that I would return to. Rather seedy and unpleasant at times,  watch out for the dog mess, and unsavoury characters.", "publishedDate": "2017-08-22", "language": "en", "rating": 1}, {"id": 505231186, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d3410795-r505231186-Raval-Barcelona_Catalonia.html", "text": "The last time I was in Barcelona we did not make it to El Raval, but this time I made a concerted effort to visit the Palau Guell, the antic Hospital Santa Crue, Sant Pau del Camp and others, including lunch at A Tu Bola, which was great (see the review). Raval is newer and less glamorous and thus less prestigious to Barri Gothic and La Ribera. Still it has several great historic sights and is having a renessaince from a seedier past. With that said, some of its sights still have homeless and there is a \"New Orleans French Quarter\" smell of stale beer and urine on occasion as you walk through it.  Still I found it to be a great place to spend one of our mornings visiting and a great historic neighborhood for Barcelona. I loved the neighborhood and am glad to have spent time in it.", "publishedDate": "2017-07-24", "language": "en", "rating": 4}, {"id": 502215584, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d3410795-r502215584-Raval-Barcelona_Catalonia.html", "text": "While on vacation in Barcelona I walked by myself through throughout the Raval at all hours, including at 2 in the morning, and saw nothing but crowds of people having great fun. Never once did I feel unsafe, threatened, or intimidated. The Raval is a community of kind, happy-go-lucky, fun-loving people. The streets are filled with celebrations, fantastic, authentic restaurants, lively bars and cafes, and interesting, grassroots art - all without the pretentious touristy feel of the Gothic Quarter. IMO, the Raval gets a bad rap that it doesn't deserve. The Raval is the best of Barcelona.", "publishedDate": "2017-07-15", "language": "en", "rating": 5}, {"id": 487635866, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d3410795-r487635866-Raval-Barcelona_Catalonia.html", "text": "We spent a week bicycling through the Pyrenees mountains to the coasta Brava and came back to Barcelona to casa camper Hotel in the raval district we love the Raval district. It's truly authentic, people live there, school children are playing in schoolyards. Just starting to change so so nice shops that are individually owned, some great little restaurants, street musicians. all very authentic just real enough to give you a great feeling!  very friendly people, small shops no chains. Just a great place to spend a day or so!  We spent a week total in Barcelona and I enjoyed this day more than any!  ", "publishedDate": "2017-05-25", "language": "en", "rating": 5}, {"id": 482034931, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d3410795-r482034931-Raval-Barcelona_Catalonia.html", "text": "Nice neighborhood in the historic center of Barcelona. There is something to be seen in it. It's a little quieter than the Gothic Quarter.", "publishedDate": "2017-05-06", "language": "en", "rating": 4}, {"id": 471312882, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d3410795-r471312882-Raval-Barcelona_Catalonia.html", "text": "if you want to chil like a local , you should go to raval. For night and evening, its a nice choice. You can see lots of places local go and eat. And you will see what spanish people do and talk, not only tourist stuff.", "publishedDate": "2017-03-30", "language": "en", "rating": 4}, {"id": 449224069, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d3410795-r449224069-Raval-Barcelona_Catalonia.html", "text": "We stayed at an Airbnb apartment in the area for a week over the New Year holidays. A simple but nice apartment in a bohemian residential suburb in Barcelona.\nFive minute walk, if that, to La Ramblas and close to the city centre and the beach front/marina.\nReasonable tapas restaurants and other assorted cuisine.\nNot the safest at night, some drug use and prostitution easily visible despite the police patrols.", "publishedDate": "2017-01-04", "language": "en", "rating": 3}, {"id": 430717960, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d3410795-r430717960-Raval-Barcelona_Catalonia.html", "text": "Stayed somewhere here which I won't name as it was so noisy at night.  The thing is the area is full of wonderful people doing stuff night and day just living their lives. Where the area meets 5 roads is where I stayed. So close to great places such as Bocqueira market, the cat sanctuary. the institute of pharmacy and arts, loads of great bars and eateries.....a place you can never tire of but if the noise at night drives you mad then you learn to people watch from your little wrought iron balcony in a haven of harmoniousness and learn to have two glasses of vino tinto during the day and then siesta happens naturally. If you really need proper sleep at night then stay in a lovely hotel on rambla nou.  If noise doesn't phase you then go with the flow and stay in a friendly place adjoined to Bar 1800. I wouldn't stay there again but the staff were lovely but I really am at an age where I love a tranquil nights sleep.", "publishedDate": "2016-10-22", "language": "en", "rating": 5}, {"id": 427831084, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d3410795-r427831084-Raval-Barcelona_Catalonia.html", "text": "A heterogeneous neighborhood.You can encounter here a lot of emigrants,some of them wearing arab traditional cloths.The central area,around Raval street is nice,picturesque.There are many adjacent narrow cobbled streets,little restaurants and pubs.After the sunset on some of this streets appear prostitutes and queer people.", "publishedDate": "2016-10-14", "language": "en", "rating": 4}, {"id": 423581057, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d3410795-r423581057-Raval-Barcelona_Catalonia.html", "text": "A nice place for a walk around the town,full of local people,small shops,few small restaurants.The giant cat was a nice suprise just out of nowhere.Worth seeing for sure and a change to more local culture.", "publishedDate": "2016-09-29", "language": "en", "rating": 4}, {"id": 420621912, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d3410795-r420621912-Raval-Barcelona_Catalonia.html", "text": "Thirty years ago, this area was teeming with drug addicts and prostitutes. Now it is home to north Africans, middle easterners and Asians. I didn't feel threatened at all. Lots of fascinating shops to poke through.", "publishedDate": "2016-09-20", "language": "en", "rating": 5}, {"id": 418812559, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d3410795-r418812559-Raval-Barcelona_Catalonia.html", "text": "Really loved our stay at the Barcelo Raval but also wandering through the district. It has some really cool vintage and record shops plus artisan jewelers and galleries. Some reviews have mentioned it felt a bit dodgy but you have to be aware of your surroundings anywhere you travel - we were with our 8 year old daughter and never felt unsafe. Loved it and will be back. ", "publishedDate": "2016-09-15", "language": "en", "rating": 5}, {"id": 399464231, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d3410795-r399464231-Raval-Barcelona_Catalonia.html", "text": "Over the years I have been here, this area used to be the one to stay away from if you are a tourist. It used to be laden with prostitutes and criminals and drugs.\n\nIt is slowly making a change, but it's not quite there yet. It's a great neighborhood, and it's on it's way up. Visit it during daylight hours and it's not an issue, just be aware of your surroundings", "publishedDate": "2016-07-31", "language": "en", "rating": 5}, {"id": 387595575, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d3410795-r387595575-Raval-Barcelona_Catalonia.html", "text": "Raval has been a cosy and idyllic neighborhood, like the other neighborhoods in Barcelona's center.\nThere are small roads, shops, restaurants, squares, oasis.\nWalking round in Raval is a good experience", "publishedDate": "2016-06-29", "language": "en", "rating": 5}, {"id": 375829809, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d3410795-r375829809-Raval-Barcelona_Catalonia.html", "text": "We came across this street by chance whilst walking from Sant Pau del Camp to Las Ramblas.  Instead of going straight ahead decided to walk up here.  It was raining heavily  but there were a couple of market stalls.   It is a wide open street with lots of huge palm trees,  We really enjoyed the biggest cat sculpture we have ever seen. It is by Fernando Botero and is made of bronze!   We were happy that we'd decided to walk up here as once in Las Ramblas there were so many people with umbrellas it was difficult to find room to walk!!", "publishedDate": "2016-05-23", "language": "en", "rating": 5}, {"id": 355831581, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d3410795-r355831581-Raval-Barcelona_Catalonia.html", "text": "El Raval is an aweome neighborhood for young people who want to get to know other people and have some drinks at cool bars. This is the alternative barri of barcelona, and is not the safest one, but it's also far from being unsafe.", "publishedDate": "2016-03-15", "language": "en", "rating": 5}, {"id": 344111106, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d3410795-r344111106-Raval-Barcelona_Catalonia.html", "text": "Stayed in the Raval area of Barcelona for a few days and what a fantastic find. Before we travelled we had read that this was a red light district and a bit shady but it turned out to be friendly, value for money and anything but shady. Yes we did see ladies of the night but we also did on Las Ramblas so we weren't shocked or ever approached infact the only time we were approached was in the Gothic Quarter which is a fantastic labyrinth of streets. The bars in the Raval area such as Madam Jasmines were buzzing with locals, friendly and drinks were very cheap. A breakfast at 100 Montaditos was approx. £1.75 each and a beer in the same venue in the afternoon  only €1. This is a great area of Barcelona only a 5 minute walk to Las Ramblas but a fraction of the cost of the main street of this busy city. Don't just stick to the main drag the Raval area  is a fantastic district to visit.", "publishedDate": "2016-01-31", "language": "en", "rating": 5}, {"id": 342334374, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d3410795-r342334374-Raval-Barcelona_Catalonia.html", "text": "The neighborhood was once known as a “red light” district. It is true that there are still some gloomy corners and streets that are better being avoid., but the whole district is rapidly evolving with lot of nice galleries, good restaurants and fashionable bars.", "publishedDate": "2016-01-24", "language": "en", "rating": 5}, {"id": 329955025, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d3410795-r329955025-Raval-Barcelona_Catalonia.html", "text": "I wanted to come to this area to see the famous cat statue.  It was about 10 mins from our hotel so we thought we would go and see it one morning.  The streets before we got to the statue were ok, a bit like Las Ramblas to be honest.\n\nWe made the mistake of walking town the middle of the street where the cat is.  It look dodgy as there were lots of people congregating on benches.  We were approached by a guy that would not leave us alone, my husband kept saying NO to him but he continued to follow us and tried to keep chatting, eventually my husband told him to go away.\n\nThat was the end of the dodgy characters, I saw another guy lurking beside some bushes and once we walk passed him he then started to follow us.  We got to the cat but were so scared by this point we took a quick photo and walked as fast as we could to get away from this area.\n\nMaybe we were being paranoid but it was not much fun at all.  I'm not a fan of the Rambla but I even said it was nicer than Raval.\n\nNever ever will I go to this area again.", "publishedDate": "2015-11-30", "language": "en", "rating": 1}, {"id": 326964246, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d3410795-r326964246-Raval-Barcelona_Catalonia.html", "text": "Great area outside our hotel, (Barcelo Raval) the square with the famous cat. Local craft / food market on Saturdays and Sundays, plenty tapas places (recommend Fragua Grill) kebab indian, and many more, also Marmalade at the top of the street off the square great burgers,and couple of mini supermarkets so it has everything, just sit and people watch food and drink a log cheaper than the main tourist  places", "publishedDate": "2015-11-15", "language": "en", "rating": 4}, {"id": 323698438, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d3410795-r323698438-Raval-Barcelona_Catalonia.html", "text": "You have to know to look for this delightful sculpture since many guides omit it along with the Raval (once a no-go zone).  The Rambla del Raval takes you through a \"real\" neighborhood.  This newer Rambla is quieter than the better-known Ramblas but only a few minutes' walk away.  Stroll down to Fernando Botero's outsized take on a Very Fat cat.  Lots of fun watching other folks discover it too, before heading back to the tourist scrum.", "publishedDate": "2015-11-01", "language": "en", "rating": 4}, {"id": 321558440, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d3410795-r321558440-Raval-Barcelona_Catalonia.html", "text": "My guide book recommended an exploration of the Raval district to the west of Las Ramblas which used to be a rundown no go area for tourists and the home of prostitutes and criminals. Recently it has undergone a huge regeneration programme which was apparent when, taking a right turn off the Plaza Catalunya end of Las Ramblas, I came to the very impressive Museum of Modern Art. This is surrounded by old buildings which have been turned into places of culture and university halls.This part of the Raval district is dotted with lovely old shady squares and interesting shops such as La Chinata the Aladdin's cave of olive oil. Further South the area became a bit rougher, the shops and restaurants less trendy and there were groups of prostitutes, left over from Raval’s former existence, sitting out on the pavement. I came to the newly created Ramblas del Raval dominated by a huge statue of a rather creepy cat and the new Hotel Barcelo which is shaped like a round tower. Following my guide book’s instructions I went through the elegant lounge to the lift and up to the 11th floor. There I found a terrace that ran right round the top of the tower which gave a wonderful 360° view over Barcelona. Unfortunately there was quite a wide health & safety barrier all round the outside wall but at least there was no glass between you and the view which was spectacular. I continued South and came to the Hotel España. Although it dates back to the 1850’s, it was refurbished in Modernist style in the early 20th century and was very fashionable. It was a place to see and be seen in its day. It fell on hard times when El Raval was going downhill but has been beautifully restored. I looked around the wonderful decor in the public rooms, staircase and La Fonda Restaurant. I even went on the roof where there was a terrace bar. I was knocked out by the dramatic furnishing. I emerged from El Raval at the Licieu Opera House on Las Ramblas.", "publishedDate": "2015-10-25", "language": "en", "rating": 4}, {"id": 304560942, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d3410795-r304560942-Raval-Barcelona_Catalonia.html", "text": "Central in the Raval. Tapas restaurants at our front door. Great prices. Great clean hotel. Good service. Location, location. Minutes from Markets.. ", "publishedDate": "2015-08-28", "language": "en", "rating": 5}, {"id": 302773432, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d3410795-r302773432-Raval-Barcelona_Catalonia.html", "text": "We have almost missed this place which is next to the infamous La Rambla. Lot's of narrow street with small boutiques and restaurants. If you want to avoid the usual tourist traps this is a must see.", "publishedDate": "2015-08-24", "language": "en", "rating": 5}, {"id": 286683626, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d3410795-r286683626-Raval-Barcelona_Catalonia.html", "text": "nice to have a walk around, we sat and had a couple of beers fro 5€ which was good.  in the square with the statue of the cat, there were quite a few winos, which could be off putting for some.  interesting walks around the neighbourhood, we would return for a meander around the streets and squares.", "publishedDate": "2015-07-08", "language": "en", "rating": 3}, {"id": 286615612, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d3410795-r286615612-Raval-Barcelona_Catalonia.html", "text": "El Raval is a place to spend hours wandering the streets, architecture is brilliant, always something going on, people friendly. Check out neighbouring Sant Antoni neighbourhood too (visit the Federal Cafe for lunch). This is Barcelona for me- the other neighbourhoods are full of tourists or business districts. el raval has a flavour all of its own. ", "publishedDate": "2015-07-07", "language": "en", "rating": 5}, {"id": 272444311, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d3410795-r272444311-Raval-Barcelona_Catalonia.html", "text": "I fell in love with El Raval from the first minute I got there.\nYou can find everything you want or need there. \nIn Barcelona there's loot of pickpockets so be aware. \n", "publishedDate": "2015-05-16", "language": "en", "rating": 5}, {"id": 262766462, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d3410795-r262766462-Raval-Barcelona_Catalonia.html", "text": "If you want to pay twice as much to eat and drink then you should stick to the Marina, the beach or the ramblas, here in Raval you will find bar, taps, pinxos, live flamenco music, every type of shop you can imagine and a square that has more cafes and outdoor areas every time I visit - in a few more months the Mercat de San Antoni will reopen after extensive renovation.", "publishedDate": "2015-03-30", "language": "en", "rating": 5}, {"id": 262117747, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d3410795-r262117747-Raval-Barcelona_Catalonia.html", "text": "Here is our favorite statue, nice cute cat Gato Botero, you should go there and see it. Cute cat statue and in that area you can have some nice tapas too. Don't miss it. ", "publishedDate": "2015-03-27", "language": "en", "rating": 4}, {"id": 259532145, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d3410795-r259532145-Raval-Barcelona_Catalonia.html", "text": "... and like to cook your own don't miss out strolling the narrow lanes of the Raval, the quarter between the Ramblas and the Mercat de Sant Antoni. Loads of Bangladeshi, Indian and Pakistani shops full of delicious Asian food necessities. Loved the shops in the C/Hospital near Sant Antoni where you can buy several different types of pulses... hidden away several small eateries with delicious food. I love the mix of incense and curry. Hurry as long as it's authentic as the Schickeria is moving in... ", "publishedDate": "2015-03-15", "language": "en", "rating": 5}, {"id": 259376741, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d3410795-r259376741-Raval-Barcelona_Catalonia.html", "text": "The Raval street is in a very interesting part of Barcelona. Over the years Raval has become more & more gentrified. Still edgy in some parts, it is now touristy, lively and full of shops, bars, entertainment, restaurants, etc and is a lovely area to visit. Recommended.", "publishedDate": "2015-03-14", "language": "en", "rating": 4}, {"id": 259215729, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d3410795-r259215729-Raval-Barcelona_Catalonia.html", "text": "Very safe, multicultural area. A lot of restaurants and point of interest. Underground spirit and places.", "publishedDate": "2015-03-13", "language": "en", "rating": 5}, {"id": 251568160, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d3410795-r251568160-Raval-Barcelona_Catalonia.html", "text": "This street have changed a lot since the first time I visited it, now is a very touristic place. It have lost the underground spirit but still a must visit in Barcelona. At the end of the street there is a cat from Fernando Botero and you can go from there to Drassanes or la Rambla.\n\nWatch out with Carrer robador, a lot of Prostitution and Pickpocketin.\n\nGo to the rooftop of the Barcelo hotel, there is a nice bar and a beautiful panoramic of all the center of Barcelona.", "publishedDate": "2015-01-28", "language": "en", "rating": 4}, {"id": 248610012, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d3410795-r248610012-Raval-Barcelona_Catalonia.html", "text": "This street is surrounded by hotels and restaurants from all over the world. It is dead centre if Barca and you are able to walk to most sights within the city. At nighttime you should visit some of the bars in the area. ", "publishedDate": "2015-01-10", "language": "en", "rating": 4}, {"id": 238910272, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d3410795-r238910272-Raval-Barcelona_Catalonia.html", "text": "I found and booked an apartment in the El Raval district prior to moving to Spain in October.  The reviews of the area are accurate--it is a very diverse and very eclectic district and worth exploring.  If you are from a large/diverse urban area, you will feel very comfortable in the district; however, I do understand many of the comments from visitors who felt less comfortable during their visit to the area.  I enjoyed the diversity and eclectic nature of the neighborhood and loved that you could find restaurants with kabobs and tapas on the same menu.  The restaurants in the area are also very diverse, but the food was good and much less expensive than in other parts of the city.  Also a great location for authentic Indian and Pakistani food and coffee.  The Museum of Contemporary Art is very good and after your visit you can watch the skateboarders in the square.  \n\nI stayed in two different apartments in El Raval.  Both were comfortable and well equipped; however, the noise during the night is non-stop and very disruptive for a light sleeper.  I stayed on Carrer de la Riereta and Carrer de les Carretes during my stay and had an equally difficult time sleeping in each apartment.  While this is certainly not a reason to avoid the area, it is something to consider if you are a light sleeper or easily awakened in the night.", "publishedDate": "2014-11-09", "language": "en", "rating": 3}, {"id": 231975447, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d3410795-r231975447-Raval-Barcelona_Catalonia.html", "text": "If you happen to be in Barcelona, find this wonderful monument to a cat created by Fernando Botero. It stands in Rambla del Raval near the famous avenue La Rambla. Not all guides know about this landmark but this funny cat is certainly worth seeing. While we were searching for it, we expected to see a small cat, but it's actually huge, taller than a man. And you can take great pictures with it.", "publishedDate": "2014-09-30", "language": "en", "rating": 4}, {"id": 219624383, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d3410795-r219624383-Raval-Barcelona_Catalonia.html", "text": "As long as you're city savy you'll be fine. It's a breath of fresh air from La Ramblas and has good resteraunts/bars! We stayed in Barecelo Raval down here and came home between 12-1am each night and we were fine", "publishedDate": "2014-08-05", "language": "en", "rating": 5}, {"id": 216656789, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d3410795-r216656789-Raval-Barcelona_Catalonia.html", "text": "Not so well-known district, usually not even being referred to in tourist guides, though ideal for urban travelers who want to explore the city and feel the real pulse of Barcelona. Streets in Raval offer the joy of exploration and you will definitely find an alternative bar to spend the night, not to mention the cheapest drinks in town. Follow the skateboarders to find the most energetic square of Barcelona, Plaça dels Àngels and feel the vibes infront of Macba.", "publishedDate": "2014-07-21", "language": "en", "rating": 4}, {"id": 215874899, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d3410795-r215874899-Raval-Barcelona_Catalonia.html", "text": "We enjoyed our stay in EL RAVAL,  the new multicultural and multiethnichal neighbourhood just behind the ramblas. \n\nWe found a lot of tapas bars or exceptional restaurant like the cera 23, one of the best Spanish restaurant of tje city. \n\nWe never felt unsafe and we had  an excellent experience in this neighbourhood.  I would love to buy an appartement here! ", "publishedDate": "2014-07-17", "language": "en", "rating": 4}, {"id": 206254464, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d3410795-r206254464-Raval-Barcelona_Catalonia.html", "text": "La Raval has a notorious reputation within Barcelona and, even as an experienced traveller, I was put off visiting it from what I read on the internet. Visit it I did nonetheless, and as usual the truth was very different to the reports and perceptions. Myself and my partner did not have any problems in the area, which naturally colours my review and I appreciate those who had a problem will feel very differently, but it simply was not that bad an area. \nWe went there to drink absinthe at the famous Bar Marsella which is on the corner of 2 of the most infamous streets, Carrer de Sant Ramon (prostitutes) and Calle de Sant Pau (junkies). We were there at around 1am and the truth is Sant Ramon was completely clear of anyone and very well lit, and Sant Pau had a few prostitutes hanging around but they just hang around in the shadows and don't bother anyone. The only other characters hanging around were Pakistani guys selling cans of beer, who ask if you want one and take no for an answer. The exact same people can be found in the Gothic Quarter.  Seedy, yes, but no obvious threat to personal safety. \nWe returned there 2 nights later to visit MACBA modern art gallery which had a late-night opening and the area was full of people, a great atmosphere. The numerous bars and restaurants were packed as late as 1am. Raval looked and felt exactly the same as other central areas. On returning to La Ramblas we noticed far more prostitutes hanging around and would have felt uneasy had it not been so busy. \nRaval has fantastic bars and restaurants and is well-lit, central and busy. A big effort has apparently been made to clean up the area. There are alleyways you would not fancy walking down late at night but that applies to any district of any city. \nDon't miss this great area.", "publishedDate": "2014-05-19", "language": "en", "rating": 4}, {"id": 204031114, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d3410795-r204031114-Raval-Barcelona_Catalonia.html", "text": "1 star hotel looked like a brothel. Retail therapy was provided by a weapons shop. Felt as though we were being watched during out very quick visit to this seedy area.", "publishedDate": "2014-05-04", "language": "en", "rating": 1}, {"id": 202408971, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d3410795-r202408971-Raval-Barcelona_Catalonia.html", "text": "We went for a wander in the Raval as there was a restaurant we liked the sound of. Thank God we decided to look during the afternoon and not at night that's all I'll say. We always felt safe on La Ramblas and during the day time at least found the Barri Gotic charming but the Raval felt very seedy and we didn't feel comfortable even during the daylight. We decided after a quick walk through not to go back at night. ", "publishedDate": "2014-04-23", "language": "en", "rating": 3}, {"id": 189663323, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d3410795-r189663323-Raval-Barcelona_Catalonia.html", "text": "If you're tired of Las Ramblas, which you get pretty soon this is a good alternative. This is basically the area for workers and migrants so it means that the prices for food and alcohol is low, and also you can find interesting and good food, fast and slow as well as internet cafe. The most funny bar in this area is according to me Madame Jasmine a kitsch place with fun interior as well as nice half drag queens working in the bar. It's always fun to be served by a man in lipstick with a beard :-)", "publishedDate": "2014-01-04", "language": "en", "rating": 5}, {"id": 183233836, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d3410795-r183233836-Raval-Barcelona_Catalonia.html", "text": "We soon realised that this place was the place for us. Not as busy as las ramblas but still vibrant and full of tourists and locals alike. Slightly seedier than las ramblas with the prostitutes etc but they didn't bother us at all. Highly recommend eating at fragua grill which is situated on this road. The steak and paella are to die for with the best sangria in town.  ", "publishedDate": "2013-11-02", "language": "en", "rating": 4}, {"id": 173881489, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d3410795-r173881489-Raval-Barcelona_Catalonia.html", "text": "We stayed in An apartment on Rambla del Raval before going on a cruise starting in Barcelona. The location is great, just a block off the big Las Ramblas street. A bit seedy, with one corner a bit up St Pau street having ladies of the night. On the other hand, lots of little cafes, markets etc. I'd stay again but am now aware of the area", "publishedDate": "2013-08-24", "language": "en", "rating": 3}, {"id": 171156508, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d3410795-r171156508-Raval-Barcelona_Catalonia.html", "text": "Raval , loved it , im a people watcher and in Raval i didnt just watch people i got to see a whole play set in the theatre of Raval. from prostitues to money lenders, from local mafia to rich flyboys\nold men n women still with a sparkle in there eye, Dangerous , for me, No but then i know the rules , give respect , get respect, remember them in Raval when you take a walk on the wildside", "publishedDate": "2013-08-07", "language": "en", "rating": 5}, {"id": 165186283, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d3410795-r165186283-Raval-Barcelona_Catalonia.html", "text": "I'm so glad I found this area as there are much fewer tourists and more locals. There are still plenty of bars, and lots of eateries. So, being a tourist bugs you, just walk 2-3 blocks east from las rambles.", "publishedDate": "2013-06-25", "language": "en", "rating": 4}, {"id": 163331794, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d3410795-r163331794-Raval-Barcelona_Catalonia.html", "text": "We went through this area on Calle Hospital and crazy person Started following us and we were verbally accosted And had to duck into the nearest store to get away from him. He followed us into the store and Continued harassing us until the clerk told him to leave! We don't know about the other sites in this area, but I would He's very nervous because our last experience.", "publishedDate": "2013-06-08", "language": "en", "rating": 1}, {"id": 143105991, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d3410795-r143105991-Raval-Barcelona_Catalonia.html", "text": "We visited Barcelona for 5 days. On the 2nd day, it became clear that Raval was the place for us. We wanted to stay as far away as possible from Las Ramblas and the maddening crowd. It all depends on what one is looking for their holidays. Sure, there are a lot of dark spots in Raval but not once did we feel unsafe. Nobody nags you there trying to sell you things. Everyone minds their own business. Food is very cheap and so are drinks. Lots of locals hang out there and it is always interesting to enjoy your caipirinha at the price of EUR 3.5 while watching the people go by!", "publishedDate": "2012-10-18", "language": "en", "rating": 4}, {"id": 140825349, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d3410795-r140825349-Raval-Barcelona_Catalonia.html", "text": "This area includes what some say the \"old Original La Rambla\", which is not as busy as todays la Rambla. Lot of small shops and restaurants in old buildings and small streets and passages. Food is not as costly as closer to La Rambla and other larger attractions.", "publishedDate": "2012-09-21", "language": "en", "rating": 3}]}}]