[{"locationId": 7175292, "name": "Rambla de Catalunya", "placeType": "ATTRACTION", "reviewListPage": {"reviews": [{"id": 735562743, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d7175292-r735562743-Rambla_de_Catalunya-Barcelona_Catalonia.html", "text": "This street is amazing. It’s has good shops surprisingly. This is street is so wide. I absolutely adore it.", "publishedDate": "2019-12-30", "language": "en", "rating": 5}, {"id": 731353674, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d7175292-r731353674-Rambla_de_Catalunya-Barcelona_Catalonia.html", "text": "First of all this is not La Rambla / Las Ramblas nor is it the southern end of it as some experts seem to claim.\nThis is a bit of a counterpart to the busy Las Ramblas and starts just north of the Placa de Catalunya. As Las Ramblas it's a nice walking street lined with trees. But it's more quiet and at the same time more interesting. Trendy shops, luxury brands and lots of restaurants. And unlike on Las Ramblas there are actually good options to wine and dine. For fantastic Tapas just head around the corner onto Carrer Mallorca and eat at the \"Cervesería Catalana\".\n\nIt's funny how this street isn't busier. Many just stop walking once the reach Placa de Catalunya. But you really should keep walking. This street isn't very long anyways and can be done in little time. But definitely worth it. W like it much more than Las Ramblas.", "publishedDate": "2019-12-08", "language": "en", "rating": 5}, {"id": 729473770, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d7175292-r729473770-Rambla_de_Catalunya-Barcelona_Catalonia.html", "text": "Great viewing , enjoying about shopping ,drinking coffee and taking photos in de Catalunya square loved it, hope to back again ", "publishedDate": "2019-11-28", "language": "en", "rating": 5}, {"id": 728865181, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d7175292-r728865181-Rambla_de_Catalunya-Barcelona_Catalonia.html", "text": "This area is toward the bottom of las Ramblas and where the Christopher Columbus monument is located, with Plaza Catalina at the other end.\n\nIt’s a nice area for sight seeing and then exploring onto the marina area and it’s various attractions.", "publishedDate": "2019-11-25", "language": "en", "rating": 5}, {"id": 728476335, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d7175292-r728476335-Rambla_de_Catalunya-Barcelona_Catalonia.html", "text": "We wandered this wide street admiring the architecture and the shops and eating places.  Lots of places have outdoor seating in the center of the boulevard, very nice.", "publishedDate": "2019-11-23", "language": "en", "rating": 5}, {"id": 728063110, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d7175292-r728063110-Rambla_de_Catalunya-Barcelona_Catalonia.html", "text": "Barcelona is a city for walking in the Gothic Quarter so we wandered down ti the harbor.  We had a glass of wine and cheese tapas while viewing the yachts.  We then walked to the Columbus Monument.  While on a very busy intersection, you could still get great pictures.  From there, it’s an easy walk north up La Rambla.", "publishedDate": "2019-11-21", "language": "en", "rating": 4}, {"id": 726486008, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d7175292-r726486008-Rambla_de_Catalunya-Barcelona_Catalonia.html", "text": "When people visit La Rambla and come to the Placa Catalunya at one end of the attractive street, they enjoy the plaza surrounding and most of the time some artist performance. If you need to have snack or lunch, go to the cafeteria at the top level of the El Corte Ingles Departmental Stores. The self-service facility offers food and drinks at very reasonable prices. To our surprise, the bay windows surrounding the cafeteria is a perfect observation tower for the viewing the city high from above. It offers free WIFI too.", "publishedDate": "2019-11-14", "language": "en", "rating": 5}, {"id": 725030785, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d7175292-r725030785-Rambla_de_Catalunya-Barcelona_Catalonia.html", "text": "Nice street, full with shops and restaurants, usually very crowded. You can find almost anything while walking down the Rambla street, plenty of nice attractions so definitely worth checking it. Prices seems to increase a bit in the area near the Rambla and there are many tourists traps so maybe it's better to search for Restaurants a bit further from the crowd.", "publishedDate": "2019-11-08", "language": "en", "rating": 4}, {"id": 693259884, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d7175292-r693259884-Rambla_de_Catalunya-Barcelona_Catalonia.html", "text": "We walked down the Rambla and enjoyed all it had to offer including cute boutique shops, cafes, street vendors and beautiful architecture.  Be aware of pick pockets! We did not have an incident here but I read that this area is known for them.   The boulevard ends up at the waterfront which is also a lovely area as well.", "publishedDate": "2019-07-27", "language": "en", "rating": 4}, {"id": 688508314, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d7175292-r688508314-Rambla_de_Catalunya-Barcelona_Catalonia.html", "text": "We walked around Las Ramblas and ended up there. This is a nice little area with some nice charming buildings, but we preferred other areas instead. Still a nice little place. ", "publishedDate": "2019-07-10", "language": "en", "rating": 3}, {"id": 685759647, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d7175292-r685759647-Rambla_de_Catalunya-Barcelona_Catalonia.html", "text": "The area is cleaner, and more suitable for families. Lots of restaurants, department stores, shopping centers, coffee shops, and various interesting shops which will find something for everyone to do. The area restaurants and shopping experience is much better than in Las Ramblas.", "publishedDate": "2019-07-01", "language": "en", "rating": 4}, {"id": 685725998, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d7175292-r685725998-Rambla_de_Catalunya-Barcelona_Catalonia.html", "text": "Rambla de Cataluña) is a major street in the Eixample district of central Barcelona. It is one of the city's trendiest streets, with many international fashion shops, and is lined with lime trees.he street stretches from Plaça de Catalunya to Avinguda Diagonal, a distance of some 1.3 kilometres (0.81 mi). It runs parallel to, and between, the Passeig de Gràcia and Carrer de Balmes. It can be seen as an extension into the Eixample of the famous La Rambla.", "publishedDate": "2019-07-01", "language": "en", "rating": 5}, {"id": 685240897, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d7175292-r685240897-Rambla_de_Catalunya-Barcelona_Catalonia.html", "text": "This is a wide pedestrian street pretty close to Placa Catalunya. You can walk and take in the surrounding architecture or sit at one of the restaurants. Lots of shops as well like Zara.", "publishedDate": "2019-06-29", "language": "en", "rating": 4}, {"id": 681317489, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d7175292-r681317489-Rambla_de_Catalunya-Barcelona_Catalonia.html", "text": "I believe that this street is often over shadowed by the adjacent Passeig de Gracia and La Rambla however it has its fair share or fun being at times as elegant! It is easier to find a good cafe or restaurant here rather than La Rambla so do take note! Highly suggest to have lunch at nearby Cervesería Catalana, amazing Tapas! Recomended to join a walk in this street with adjacent Passeig de Gracia perhaps circling from Placa Catalunya.", "publishedDate": "2019-06-13", "language": "en", "rating": 5}, {"id": 672937200, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d7175292-r672937200-Rambla_de_Catalunya-Barcelona_Catalonia.html", "text": "Wide pedestrian area in old part of city. Lots of outdoor cafes and vendors. Street musicians and unlicensed trinket sellers everywhere. If you are seated at a cafe in outside row you can expect to be hit up over and over. Don’t engage with them express interest in the products or accept “gift”. These will only cause them to harass you more strongly for money. If you don’t want to buy just say no and ignore. But overall RdC is worth a visit. While there stop into the market. ", "publishedDate": "2019-05-09", "language": "en", "rating": 5}, {"id": 672043323, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d7175292-r672043323-Rambla_de_Catalunya-Barcelona_Catalonia.html", "text": "Rambla de Catalunya is a major attraction. It is a long and wide road. It is tree lined and contains a number of outdoor cafes and restaurants as well as other shops. It is a street you go to have fun and to also get some relaxation, of sorts. There numerous fashion boutiques, souvenir shops, department stores, shopping complexes and other attractions. We walked up and down this road and enjoyed watching the world go by. This street contains many famous buildings of exceptional architectural style.", "publishedDate": "2019-05-07", "language": "en", "rating": 5}, {"id": 671988162, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d7175292-r671988162-Rambla_de_Catalunya-Barcelona_Catalonia.html", "text": "This is a much better choice than La Rambla. There are fewer people, better restaurants and great architecture.  It’s a really nice walk. ", "publishedDate": "2019-05-06", "language": "en", "rating": 5}, {"id": 668021633, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d7175292-r668021633-Rambla_de_Catalunya-Barcelona_Catalonia.html", "text": "Free.\nVisit Duration: 45 minutes.\n\nThe one Kilometer long Rambla de Catalunia is a Continuation of La Rambla and an elegant boulevard with trees planted on either side of the central pedestrian area.You will enjoy interesting restaurants, welcoming terrace bars and shops along this pedestrianized walkway.\n\nLook up at the architecture of notable buildings on both sides of the street\nwith a plethora of modernista details: \nCasa Pia Batlló, Casa Fargas, Casa Dolors Calm, Casa Juncosa, \nChurch of La Mare de Déu de Montsió, \nCasa Antoni Costa, Casa Serra\n\nYou can also see amusing sculptures:\nLa girafa coqueta\nEl toro assegut", "publishedDate": "2019-04-21", "language": "en", "rating": 4}, {"id": 659525483, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d7175292-r659525483-Rambla_de_Catalunya-Barcelona_Catalonia.html", "text": "Nice to have a walk in the evening and sit to have a coffee. They hv different shows you could enjoy at the end of Rambla. Lots of places of dinner and sangria tapas or even if u want to buy a souvenir. Be careful of pickpocketing.", "publishedDate": "2019-03-19", "language": "en", "rating": 5}, {"id": 653527397, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d7175292-r653527397-Rambla_de_Catalunya-Barcelona_Catalonia.html", "text": "It's a very nice place for a stroll and there are shops, restaurants and other small attractions left and right. It's very crowded, be careful for pick pockets and also in the evening for people selling drugs.", "publishedDate": "2019-02-19", "language": "en", "rating": 3}, {"id": 551981240, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d7175292-r551981240-Rambla_de_Catalunya-Barcelona_Catalonia.html", "text": "Total waste of time! The stalls are uninteresting and the crowds overwhelming. In fact, the sheer number of tourists does not allow for relaxed browsing or ice cream licking. Far better to explore down the warren of streets either side, particularly in the Gothic quarter where you are bound to stumble on far more interesting products. ", "publishedDate": "2018-01-06", "language": "en", "rating": 2}, {"id": 546748180, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d7175292-r546748180-Rambla_de_Catalunya-Barcelona_Catalonia.html", "text": "The Ramblas is clean and the  souvenir  shops have been replaced with all of the Spanish chains. Lively and well  kept. One side mostly clothing stores and the other side some  restaurants. ", "publishedDate": "2017-12-11", "language": "en", "rating": 4}, {"id": 544635267, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d7175292-r544635267-Rambla_de_Catalunya-Barcelona_Catalonia.html", "text": "Yes it's crowded, and yes it's full of tourists, but this is the heart of the modern city with splendid architecture around, grand hotels, high end shopping and lots of places to eat or enjoy a coffee.", "publishedDate": "2017-12-02", "language": "en", "rating": 5}, {"id": 541846872, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d7175292-r541846872-Rambla_de_Catalunya-Barcelona_Catalonia.html", "text": "It use to have vendors that sell goods to the locals, now they are all tourist junk shops, same old t-shirts, post cards, junk that could be made in China.", "publishedDate": "2017-11-18", "language": "en", "rating": 3}, {"id": 541272973, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d7175292-r541272973-Rambla_de_Catalunya-Barcelona_Catalonia.html", "text": "We love walking on this Rambla. Lots of cafes and shops. Beautiful trees. Views of the mountains. Great buildings. It is not so crowded like Las Ramblas.", "publishedDate": "2017-11-15", "language": "en", "rating": 1}, {"id": 540495416, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d7175292-r540495416-Rambla_de_Catalunya-Barcelona_Catalonia.html", "text": "So much going on here. Shopping, places to eat drink or visit the square. Really busy so of course as always keep belongings close.", "publishedDate": "2017-11-12", "language": "en", "rating": 4}, {"id": 539188956, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d7175292-r539188956-Rambla_de_Catalunya-Barcelona_Catalonia.html", "text": "This streat is almost 1.2 km long, it starts from Plaza Catalonia where you can feed the birds and enjoy shopping, restaurants and coffeeshops to the Columbus Monument. But it's 1.2 km of pure fun; there you can find artist doing different types of painting and portraits, you can enjoy shopping, get some souvenirs and gifts, enjoy the music and shows done in the street, enjoy the human statues and take some pictures with them. \n\nThis street is also the access to many of Barcelona's tourist attractions like the Liceu Teatre, Gaudi's Palau, Placa Reial, La Boqueria and many other places.\n\nBut like any other crowded places in Europe, \"be aware of the pickpockets\". Also, this street is not safe after 11:00pm as it's full of thugs, drug addicts and drug dealers. It gets really scary for families and children", "publishedDate": "2017-11-07", "language": "en", "rating": 4}, {"id": 538766158, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d7175292-r538766158-Rambla_de_Catalunya-Barcelona_Catalonia.html", "text": "Of course it's crowded and touristy, but it's the beating heart of Barcelona, take a day time stroll, take a night time stroll, its amazing", "publishedDate": "2017-11-06", "language": "en", "rating": 5}, {"id": 535993340, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d7175292-r535993340-Rambla_de_Catalunya-Barcelona_Catalonia.html", "text": "Nice place to walk, shop and eat. Easy to access. Lot of choices of places to eat, from Flamenco show to tapas, your choice. ", "publishedDate": "2017-10-25", "language": "en", "rating": 5}, {"id": 532853572, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d7175292-r532853572-Rambla_de_Catalunya-Barcelona_Catalonia.html", "text": "We walked through this street full of shops, restaurants, bars and attractions too. We have see some artists there as well. It is crowded so watch the burglars.", "publishedDate": "2017-10-14", "language": "en", "rating": 5}, {"id": 530848766, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d7175292-r530848766-Rambla_de_Catalunya-Barcelona_Catalonia.html", "text": "We stayed in an AirB&B on Gran via de les Cortes Catalunya, a main thoroughfare through Barcelona. The bus drops you off at La Rambla but you must head south. If you Head north you find yourself on Rambla de Catalunya. They are very similar - outdoor restaurants between the traffic lanes, pretty trees, lots of shade and lots of shopping.", "publishedDate": "2017-10-07", "language": "en", "rating": 5}, {"id": 530173925, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d7175292-r530173925-Rambla_de_Catalunya-Barcelona_Catalonia.html", "text": "We were staying right off Rambla de Catalunya.\nWe walked it frequently and ate a few meals here as well.\nThere are a lot of choices for restaurants and we did not have a bad meal at any one we chose.", "publishedDate": "2017-10-05", "language": "en", "rating": 5}, {"id": 529867936, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d7175292-r529867936-Rambla_de_Catalunya-Barcelona_Catalonia.html", "text": "just like Las Ramblas the center of the center.  full of terraces, shops, cinemas, and always busy.  not the best or cheapest places but the boulevard is a true must to visit.", "publishedDate": "2017-10-04", "language": "en", "rating": 4}, {"id": 527650033, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d7175292-r527650033-Rambla_de_Catalunya-Barcelona_Catalonia.html", "text": "About a mile in length, pedestrian mall and a wonderful walk with world famous shops, art galleries and theatres - and restaurants lining it. Great people watching and lots of interesting things to see and do. I love Rambla de Catalunya .", "publishedDate": "2017-09-26", "language": "en", "rating": 5}, {"id": 522746617, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d7175292-r522746617-Rambla_de_Catalunya-Barcelona_Catalonia.html", "text": "Rambla de Catalunya is not the premier tourist location in Barcelona as incorrectly asserted by many reviews writing about Rambla de Catalunya. Those reviewers should be referring to La Rambla which runs from Plaza de Catalunya down to the coast. \nRambla de Catalunya runs north-west from Plaza de Catalunya and is the home to art galleries, cinemas and theatres. Like La Rambla, Rambla de Catalunya is predominantly a pedestrian mall. During our most recent stay in Barcelona, we enjoyed a pleasant walk along this pedestrian strip taking in the sights and atmosphere. Also like La Rambla, there are a number of outdoor dining cafes and restaurants located along this avenue.\nWe thoroughly enjoyed our walk along Rambla de Catalunya. It has a completely different ambience to La Rambla. More refined and less touristy. \nDo not be confused. Rambla de Catalunya and La Rambla are two different locations!", "publishedDate": "2017-09-08", "language": "en", "rating": 4}, {"id": 521965802, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d7175292-r521965802-Rambla_de_Catalunya-Barcelona_Catalonia.html", "text": "I love walking on Rambla de Catalunya everytime I visit Barcelona! The atmosphere there is just incredible! Watch out for the pickpockets!", "publishedDate": "2017-09-06", "language": "en", "rating": 5}, {"id": 520532698, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d7175292-r520532698-Rambla_de_Catalunya-Barcelona_Catalonia.html", "text": "I love to spend time walking in las rambles  it is  so entertaining and amusing. I enjoy to hear all different languages and watch different kind  of people and fashion, all in one street. Some people said that it is dangerous and to be careful with you bags but,it is always a lot of police around las rambles chasing street vendors away. I love las ramblas. ", "publishedDate": "2017-09-02", "language": "en", "rating": 5}, {"id": 520530286, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d7175292-r520530286-Rambla_de_Catalunya-Barcelona_Catalonia.html", "text": "A pretty town to meet with friends and family, had a really good time with my friends. Hope I'll can come back soon. ", "publishedDate": "2017-09-02", "language": "en", "rating": 4}, {"id": 518749993, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d7175292-r518749993-Rambla_de_Catalunya-Barcelona_Catalonia.html", "text": "A street with restaunts and shops.\nGood for a walk and to eat something or to drink a beer.\nTapas everywhere.", "publishedDate": "2017-08-29", "language": "en", "rating": 4}, {"id": 517919650, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d7175292-r517919650-Rambla_de_Catalunya-Barcelona_Catalonia.html", "text": "Nothing that I could really recommend here, there are far nicer areas and streets around Barcelona, despite the attention this street gets. It is crowded, overpriced and generally you get poor quality food. Our local friends say they stay away if they want to have a good experience for a night out.\n\nIt is just another tourist trap area and I spent all of 30 minutes here in total and that was partly to cross the street walking to another area and partly to head down to the Marina area near the Columbus Monument.", "publishedDate": "2017-08-27", "language": "en", "rating": 3}, {"id": 517437601, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d7175292-r517437601-Rambla_de_Catalunya-Barcelona_Catalonia.html", "text": "The Rambla de Catalunya is the main tourist destination in Barcelona.  A wide walkway stretching nearly a mile, it is lined with numerous restaurants and shops.  Stop for some gellato from a kiosk or maybe venture into the Boqueria for a quick snack.  Everything is there.", "publishedDate": "2017-08-25", "language": "en", "rating": 5}, {"id": 516839778, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d7175292-r516839778-Rambla_de_Catalunya-Barcelona_Catalonia.html", "text": "An amazing place for a trip - lots of shops, cafes along the street and an amazing city atmosphere.\nRecommended to visit.", "publishedDate": "2017-08-23", "language": "en", "rating": 5}, {"id": 515554199, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d7175292-r515554199-Rambla_de_Catalunya-Barcelona_Catalonia.html", "text": "This Rambla is one of the best in Barcelona...Nice for a walk or good for a stop after shopping ...there are many nice Restaurants & Cafes wit large terraces in the middle of the street.", "publishedDate": "2017-08-20", "language": "en", "rating": 4}, {"id": 513126899, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d7175292-r513126899-Rambla_de_Catalunya-Barcelona_Catalonia.html", "text": "The biggest s*** show I have ever seen. Thousands of people walking over a street. It isn't even fun. The stores or booths are your typical tourist shop thing with souvenirs you want to burn once you bought them. Lot of beggars, pickpockets and at night: hookers. Go clubbing somewhere else.", "publishedDate": "2017-08-15", "language": "en", "rating": 1}, {"id": 512983915, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d7175292-r512983915-Rambla_de_Catalunya-Barcelona_Catalonia.html", "text": "Like always Barcelona is enjoyable and beautiful city, good street food & football \nWe enjoy very much from the aquarium at the port it's recommended.", "publishedDate": "2017-08-14", "language": "en", "rating": 5}, {"id": 504423053, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d7175292-r504423053-Rambla_de_Catalunya-Barcelona_Catalonia.html", "text": "The last time we were on the Rambla we saw a LOT more street performers, now it seems there are a lot of small stores selling a lot of stuff from China and a lot of sidewalk cafes - kinda sad not really sure what happened.  Security is still an issue - watch your personal possessions and do not go off on back alleys alone - this has been a big mistake according to information I have from friends who did just that.  \n\nDon't get me wrong I am NOT saying do not do the walk - I am just saying use common sense - this has always been a good location for pick pockets and hit and run for pocketbooks and cameras - so just use your head and be careful.", "publishedDate": "2017-07-22", "language": "en", "rating": 5}, {"id": 504163397, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d7175292-r504163397-Rambla_de_Catalunya-Barcelona_Catalonia.html", "text": "Don't miss this Fantastic fun Walkway from the Park to the Sea.  Barcelona at its Best.\nHidden twisting  paths unveil Piazza's , Ancient church's, , vintage restaurants .Wonderful Locals.\nAnd Don't  miss Josephs Marker a must stop, AMAZING...", "publishedDate": "2017-07-21", "language": "en", "rating": 5}, {"id": 503694528, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d7175292-r503694528-Rambla_de_Catalunya-Barcelona_Catalonia.html", "text": "I've been coming to Barcelona for decades.  One of my favorite cities in the world.  The Rambla has always been touristy but always had lots of locals as well.  Our native Barcelonan friend told us he'd stopped coming to the Rambla for anything because of the hoards of tourists.  We thought he was exaggerating.  Not at all.  On a Wednesday in early April when school is still in session and it's not tourist season the Rambla was packed shoulder to shoulder with tourists.  It was impossible to walk more than 2 or 3 steps without having to stop or move to avoid another group of people.  All of the shops on the street sell Tshirts and cheap souvenirs.  In the past I actually shopped for and bought clothing, shoes, and leather goods here but no more.  I'll check back in a few years.", "publishedDate": "2017-07-19", "language": "en", "rating": 1}, {"id": 503473980, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d7175292-r503473980-Rambla_de_Catalunya-Barcelona_Catalonia.html", "text": "There are plenty of interesting things to see, Greta place to have local food and a nice meal.\n\nNice Restaurants with outdoor seating \n \nMany performers and artists along the street.", "publishedDate": "2017-07-19", "language": "en", "rating": 5}, {"id": 503395569, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d7175292-r503395569-Rambla_de_Catalunya-Barcelona_Catalonia.html", "text": "Boulevard La Rambla\n\nOn this well-known boulevard, you can walk, take your time and enjoy Barcelona’s nice weather, and maybe sit in one of the cafes and have a drink.\n\nThere are many shops and cafes and bars in this area where you can find movie theaters and restaurants the famous hall for traditional Flamenco dance(Tablao Flamenco Cordobes) is at the end of La Rambla.\n\nUltramarinos a nice bar with live music and good drinks which are a bit pricy.", "publishedDate": "2017-07-19", "language": "en", "rating": 5}, {"id": 501873291, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d7175292-r501873291-Rambla_de_Catalunya-Barcelona_Catalonia.html", "text": "It's the heart of Barcelona. We enjoyed just walking around the promenade and watching all the people and the different shows. The perfect way to get to the port and relax at the end of the day!", "publishedDate": "2017-07-14", "language": "en", "rating": 5}, {"id": 499245776, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d7175292-r499245776-Rambla_de_Catalunya-Barcelona_Catalonia.html", "text": "Just north of La Ramblas, this walk is much more manageable.  More relaxed to walk.  Plenty of stores and road side cafes to sit and relax.", "publishedDate": "2017-07-06", "language": "en", "rating": 4}, {"id": 497097007, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d7175292-r497097007-Rambla_de_Catalunya-Barcelona_Catalonia.html", "text": "From souvenirs to gelato, this lively place is a great place for strolling around. Crawl to the alleys and enjoy Barcelona", "publishedDate": "2017-06-29", "language": "en", "rating": 5}, {"id": 495095121, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d7175292-r495095121-Rambla_de_Catalunya-Barcelona_Catalonia.html", "text": "A street full of bars, restaurants, showrooms and many tourists. It has got an artistic appeal to it and I felt it very lively. Good for evening walk and a drink.", "publishedDate": "2017-06-22", "language": "en", "rating": 4}, {"id": 492422449, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d7175292-r492422449-Rambla_de_Catalunya-Barcelona_Catalonia.html", "text": "This is a long pedestrian walking precinct that is covered by hundreds of mostly plane trees.\nLots of interesting shops and stalls along it.", "publishedDate": "2017-06-12", "language": "en", "rating": 4}, {"id": 489434592, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d7175292-r489434592-Rambla_de_Catalunya-Barcelona_Catalonia.html", "text": "I was shocked how many people were there...Its crazy... Shops bars restaurants market stalls but I didnt like the prices and I loved the buildings and the streets... I went a week ago 23rd of May..If its like that now god knows what its like in July/ August...", "publishedDate": "2017-05-31", "language": "en", "rating": 3}, {"id": 488222944, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d7175292-r488222944-Rambla_de_Catalunya-Barcelona_Catalonia.html", "text": "Some great local architecture not built by Gaudi and a quiet place to stroll or even site and people watch. ", "publishedDate": "2017-05-27", "language": "en", "rating": 4}, {"id": 487250358, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d7175292-r487250358-Rambla_de_Catalunya-Barcelona_Catalonia.html", "text": "I have so much memories on this street its hard to forget the details, even the flowers on the streets, a must see place when you're there.\nthe only problem is that sellers don't speak much English. I hope that is changed now/", "publishedDate": "2017-05-24", "language": "en", "rating": 5}, {"id": 485117042, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d7175292-r485117042-Rambla_de_Catalunya-Barcelona_Catalonia.html", "text": "I'm sad that we only happened on to this area on the last day of our visit.  The restaurant options here are endless and irresistible!  There are also all those name brand shops for those folks who enjoy that.  It is an incredible place for a stroll on a beautiful spring evening.  Stop and David a cava!", "publishedDate": "2017-05-17", "language": "en", "rating": 5}, {"id": 484984694, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d7175292-r484984694-Rambla_de_Catalunya-Barcelona_Catalonia.html", "text": "This is a street where all the people go for food, fun or just a walk. Full of artistic themes and next to several places to visit like the old town, the Mercat St. Joseph, etc. Watch out with the pick pockets while you are distracted", "publishedDate": "2017-05-17", "language": "en", "rating": 5}, {"id": 484740663, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d7175292-r484740663-Rambla_de_Catalunya-Barcelona_Catalonia.html", "text": "First of all Rambla de Catalunya is NOT to be comfused with Las Ramblas. This last one avenue goes from Plaza Catalunya to the Colon (Colombus) statue in the Barcelona Old Port.\nWhere the Rambla de Catalunya goes north from Plaza Catalunya to Avinguda Diagonal. It traverses the Eixample District and runs parallel to the Paseig the Gracia where you can find some of the Gaudi most visited building.\nThe Rambla de Catalunya has many restaurant with outdoor seating and also some elegant stores.\nStop by this avenue to have some tapas and a \"caña\" (beer) on your next trip to Barcelona.", "publishedDate": "2017-05-16", "language": "en", "rating": 4}, {"id": 483447976, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d7175292-r483447976-Rambla_de_Catalunya-Barcelona_Catalonia.html", "text": "Very, very touristy...the heart of the old section.  Lined with restaurants, flower vendors, entertainers and artist.  A definite must to see at least once but I wouldn't spend much time here. ", "publishedDate": "2017-05-11", "language": "en", "rating": 4}, {"id": 481703321, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d7175292-r481703321-Rambla_de_Catalunya-Barcelona_Catalonia.html", "text": "It's a place to visit if you're a tourist and new to Barcelona. However make sure you go off the small roads off Las Ramblas to the left and right and get lost in the narrow streets which are\nmore interesting than walking up and down Las Ramblas. Also avoid eating in Las Ramblas as it's really really pricey for low quality food.\nHowever would recommend cafe de l'opera for a coffee in an old classic cafe. Best to have inside to enjoy the full ambience of the place.\nBe careful of your wallets etc as every tourist I know has a pickpocket experience in and around this street. Also lots of scammers.\nYou have been warned! Otherwise an enjoyable area of Barcelona to explore.", "publishedDate": "2017-05-04", "language": "en", "rating": 4}, {"id": 470937348, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d7175292-r470937348-Rambla_de_Catalunya-Barcelona_Catalonia.html", "text": "If you've seen the main Las Ramblas, you've basically seen this one too. The only difference with this Rambla is the high end stores surrounding the area, Other than that, there is nothing but restaurants and cafes that are overpriced to rid off the swarm of tourists. You can barely even walk here due to the insane number of tourists.", "publishedDate": "2017-03-28", "language": "en", "rating": 3}, {"id": 469028471, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d7175292-r469028471-Rambla_de_Catalunya-Barcelona_Catalonia.html", "text": "Quite simply a brilliant street to explore , restaurants , cafes , bars , shops and a huge variety of things going on  - be sure you explore the myriad of streets which run off this main thoroughfare as well , you will not be disappointed - but be prepared for a lot of people ", "publishedDate": "2017-03-21", "language": "en", "rating": 5}, {"id": 467753303, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d7175292-r467753303-Rambla_de_Catalunya-Barcelona_Catalonia.html", "text": "It's the touristic heart of the city. It's where to start, with the city visit. Take it down to the port for a nice Balad or up to Plaza Catalunya for shopping or Taking tour buses.", "publishedDate": "2017-03-16", "language": "en", "rating": 4}, {"id": 466250107, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d7175292-r466250107-Rambla_de_Catalunya-Barcelona_Catalonia.html", "text": "It's great if you love crowds, people trying to sell you garbage, and pick pockets. Spend your time elsewhere.", "publishedDate": "2017-03-11", "language": "en", "rating": 3}, {"id": 460865174, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d7175292-r460865174-Rambla_de_Catalunya-Barcelona_Catalonia.html", "text": "The famous street is great for a walk towards the port.\nIt features numerous shops, restaurants and street performances (watch out for pick-pockets and whatever you do, do NOT participate in any street games, as they are all cons).", "publishedDate": "2017-02-18", "language": "en", "rating": 4}, {"id": 459574547, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d7175292-r459574547-Rambla_de_Catalunya-Barcelona_Catalonia.html", "text": "This is one of the best streets in the world to find just about anything you want. Food vendors artist and everything. Just beware of pickpockets and prostitute's off some side streets. I had so much fun here and I went here everyday while I was there.", "publishedDate": "2017-02-14", "language": "en", "rating": 5}, {"id": 458865522, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d7175292-r458865522-Rambla_de_Catalunya-Barcelona_Catalonia.html", "text": "Visited 2.7,2.8,2.9.2017 This area is a continuation of LaRambla and has its own Metro station to get to. The Hard Rock Cafe is in this area as well as other stores and things to see. A continuation of walking heading up LaRambla from the water keep walking and you are there.\n\nthe Doctor hit me with a helpful vote!", "publishedDate": "2017-02-12", "language": "en", "rating": 4}, {"id": 455910171, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d7175292-r455910171-Rambla_de_Catalunya-Barcelona_Catalonia.html", "text": "Running perpendicular to the sea and parallel to c/Balmes (offices, mainly) and Paseo de Gracia (high-end shops), Rambla Cataluña has tried to forge its own reputation and somewhere between the two streets either side of it - and fails.\n\nTwo pavements either side of a large pedestrianised central area, full of bar terraces mean there isn't much that could be construed as 'authentic' about the street and the bars and cafés take advantage of their proximity to Paseo de Gracia by charging similarly high prices for coffees/beers etc and generally aren't well known for the quality of their food.\n\nWorth walking up and down to see the street but wouldn't recommend having anything to eat or drink there, which you can have closeby at a fraction of the price!", "publishedDate": "2017-01-30", "language": "en", "rating": 3}, {"id": 454924593, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d7175292-r454924593-Rambla_de_Catalunya-Barcelona_Catalonia.html", "text": "The famous street to stroll down - plenty of shops and cafes and market stalls as well as the blanket traders.\n\nIt does get Extremely busy and is a haven for pickpockets but don't worry too much. It is an interesting place to wander down.\n\ngo into the fish, meat and fruit market just off the street , about half way dwon - absolutely stunning but again gets very busy", "publishedDate": "2017-01-26", "language": "en", "rating": 5}, {"id": 452278638, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d7175292-r452278638-Rambla_de_Catalunya-Barcelona_Catalonia.html", "text": "We happened to visit a small market at the bottom which was interesting as well as watching the human statues plying their trade, some were very good.", "publishedDate": "2017-01-15", "language": "en", "rating": 4}, {"id": 451512564, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d7175292-r451512564-Rambla_de_Catalunya-Barcelona_Catalonia.html", "text": "While Passeig de Gracia is the Barcelona's high end and luxury shopping street, Rambla de Catalunya hosts a lot of national fashion shops, tapa's bars and restaurants with outdoor seatting. Both streets are very close and parallel, from Diagonal Avenue to Catalunya Square. \n\nNote that Rambla Catalunya is not the word famous Las Ramblas, although they are consecutives.\n\nAdvice: shop and walk at both streets, but for eating and drinking choose a terrace at Rambla Catalunya.", "publishedDate": "2017-01-12", "language": "en", "rating": 5}, {"id": 451432782, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d7175292-r451432782-Rambla_de_Catalunya-Barcelona_Catalonia.html", "text": "Good to walk down once for tourists but no need to go a second time. There are lots of souvenir places, a bit of a tourist trap. I'd focus more on the other areas of Barcelona.", "publishedDate": "2017-01-12", "language": "en", "rating": 3}, {"id": 450818477, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d7175292-r450818477-Rambla_de_Catalunya-Barcelona_Catalonia.html", "text": "We walked the Rambla each day during our Barcelona visit.  So many interesting things to see and people to watch.  Look for the free chairs and walk down to the Columbus Monument ", "publishedDate": "2017-01-09", "language": "en", "rating": 5}, {"id": 446637891, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d7175292-r446637891-Rambla_de_Catalunya-Barcelona_Catalonia.html", "text": "Fun place to sample local foods and have a fresh meal.  The Ramla is another great strolling spot is a City that has several.   Relax and stroll in the Catalan style.  Plenty of places to shop, eat, drink, get a gelato or just enjoy a lovely day in Barcelona.", "publishedDate": "2016-12-25", "language": "en", "rating": 4}, {"id": 446490430, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d7175292-r446490430-Rambla_de_Catalunya-Barcelona_Catalonia.html", "text": "If you walk down on La Rambla do not miss the Buqueria Market on the right after aprox 5 mins walk. You can taste fresh sea food, have a brunch, lunch or dinner. The prices are a bit high especially for cooked food due to the freshness of the ingredients. You can try so many new recipes, crepes or takeaways.", "publishedDate": "2016-12-24", "language": "en", "rating": 4}, {"id": 446341840, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d7175292-r446341840-Rambla_de_Catalunya-Barcelona_Catalonia.html", "text": "Busy during the day, crowded in the evening and ‘buzzing’ on Friday and Saturday evenings; street performers, all sorts of stalls (dessert, gifts and souvenirs), the lights, and restaurants, bars and clubs lined up on both sides.  On the Saturday during our stay, Barcelona FC drew 0-0 and there were a lot disappointed fans but one could imagine, if Barca win, La Rambla ‘rumbles’.", "publishedDate": "2016-12-23", "language": "en", "rating": 5}, {"id": 444157215, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d7175292-r444157215-Rambla_de_Catalunya-Barcelona_Catalonia.html", "text": "If you want to feel the pulse of the city, La Rambla, together with Placa Catalunya are the places to be visited!", "publishedDate": "2016-12-13", "language": "en", "rating": 4}]}}]