[{"locationId": 7981033, "name": "Platja de la Nova Icaria", "placeType": "ATTRACTION", "reviewListPage": {"reviews": [{"id": 752401570, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d7981033-r752401570-Platja_de_la_Nova_Icaria-Barcelona_Catalonia.html", "text": "Platja de la Nova Icaria in Barcelona has been our favorite vacation place of all time. We've been here at last every year for the last 14 years.\n\nUniti later years.\n\nFishing with lures is quite enjoying. I'm doing it often, in some distant lakes in Norway and Sweden. Far from common beaches.\n\nIn Barcelona, I discovered another approach. Go to one of the most frequently visited beaches and start fishing. This gentleman obviously thought that fishing with sharp angles among small children was OK. \n\nSeveral police officers tried to give him some good advice not to use the lure among the bathing people. They got no response. Guess tourists are not that welcome in Barcelona anymore. Think we'll stay away from Barcelona for the next years to come.", "publishedDate": "2020-04-08", "language": "en", "rating": 1}, {"id": 749670823, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d7981033-r749670823-Platja_de_la_Nova_Icaria-Barcelona_Catalonia.html", "text": "I actually prefer this beach than Barceloneta. It’s much calmer and full of small sand rather than rocks.", "publishedDate": "2020-03-07", "language": "en", "rating": 5}, {"id": 719618945, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d7981033-r719618945-Platja_de_la_Nova_Icaria-Barcelona_Catalonia.html", "text": "A beautiful clean beach ,we really enjoyed going there ! Not busy at all \nWe love to go there again !!", "publishedDate": "2019-10-19", "language": "en", "rating": 5}, {"id": 700834701, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d7981033-r700834701-Platja_de_la_Nova_Icaria-Barcelona_Catalonia.html", "text": "You just came from Barcelona. Visited the city and went to the beach also. \nThis beach is better than Barcelonetta but still different from other nice beaches visited in Greece.\nThe prices are very high for what they offer! A toilet without water to wash your hands and 15 Euro/sunbed, a totall of 45 Euro for 2 pers (sunbed+umbrella). This prices are exagerated for what they offer!\nIt is not worth the money!", "publishedDate": "2019-08-19", "language": "en", "rating": 3}, {"id": 696751001, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d7981033-r696751001-Platja_de_la_Nova_Icaria-Barcelona_Catalonia.html", "text": "The beach was clean . Crowded, but it was July in Barcelona! Sand and water were nice. The constant stream of people trying to sell you stuff became down right annoying.  We couldn't swim as a family because there is no way you can leave your belongings on the beach without anyone right there.", "publishedDate": "2019-08-07", "language": "en", "rating": 3}, {"id": 695896074, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d7981033-r695896074-Platja_de_la_Nova_Icaria-Barcelona_Catalonia.html", "text": "Had a wonderful day on the beach renting chairs and umbrella from Gian Luca.   He made the day relaxing and his service was great.", "publishedDate": "2019-08-05", "language": "en", "rating": 5}, {"id": 695627737, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d7981033-r695627737-Platja_de_la_Nova_Icaria-Barcelona_Catalonia.html", "text": "I read the reviews and I thought it was a good place to go with the family. When we arrived I asked the guy for much is for a place for 2 (since the kids will be in the water all the time) he said 30 euros ok it’s double the price of Marbella but I thought this is Barcelona so whatever I took the seats. Then the guy came asking for 45 euros because we took seats with umbrellas. \nThen you have the constant harassment of the Indian beach sellers and it just happened that they hide the merchandise under the sand where we were staying or under the trash bags of the trash bins !!!\nThe water is the same of all other beaches around it. It was super crowded and not as clean as I hoped. But over all if you don’t mind spending 80 euros on a trip to the beach the. You should be ok.", "publishedDate": "2019-08-04", "language": "en", "rating": 3}, {"id": 692820186, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d7981033-r692820186-Platja_de_la_Nova_Icaria-Barcelona_Catalonia.html", "text": "At first when we drove up we thought that it was perfect for our family to spend the afternoon. But buckle up, so as with all beaches their were peddlers. No big deal just keep saying no and move on. These are the most obnoxious I’ve ever experienced. The police show up and all of these dudes bury their stuff. I’m more of non snitch myself but don’t bury your diet next to my tent a foot away from my infant daughter. So when the police came looking and digging we obliged. The police leave and I’m in the water with my son, three of these peddlers surround my wife and demand she pay for the blankets lost. I walk up and they leave. The whole rest of the time we were there we watched them congregate a little bit away talk and point at my wife and daughter. We were so sketched out that we packed everything up took a different route back to our car. They were probably just trying to catch us slipping and take our wallets but who knows these days. FYSA these aren’t good dudes just hard on their luck, the water bottle they’re selling make people sick, the pull them from the garbage and fill them water to sell to naive tourist. Find a private beach with dedicated security it’s worth the extra money to not be hassled.", "publishedDate": "2019-07-26", "language": "en", "rating": 2}, {"id": 687225177, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d7981033-r687225177-Platja_de_la_Nova_Icaria-Barcelona_Catalonia.html", "text": "This beach was beautiful and family friendly. Lots of tourists and locals, with fun beach bars! Umbrella rentals are $12 for a full day which is reasonable, and two chairs with an umbrella cost $36 for a full day. However, the peddlers are truly unbearable. We rented an umbrella and a whole group of peddlers sat under OUR umbrella while we were laying down. In addition, we were consistently nagged by them to buy a beach blanket to the point where we actually got up and went to a different umbrella. ", "publishedDate": "2019-07-06", "language": "en", "rating": 3}, {"id": 685278088, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d7981033-r685278088-Platja_de_la_Nova_Icaria-Barcelona_Catalonia.html", "text": "This beach was great to relax and soak up the sun while swimming in the Mediterranean Sea. Lots of activities and sporting things to do along with a stretch of bars and restaurants. Worth the trip to get to this beach. They offer umbrella’s , chairs. Etc. it’s a gem! ", "publishedDate": "2019-06-29", "language": "en", "rating": 4}, {"id": 680215287, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d7981033-r680215287-Platja_de_la_Nova_Icaria-Barcelona_Catalonia.html", "text": "Great beach with lots of bars and restaurants right next to it. Great sand, lots of volleyball. Wide with plenty of room. ", "publishedDate": "2019-06-09", "language": "en", "rating": 4}, {"id": 675524684, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d7981033-r675524684-Platja_de_la_Nova_Icaria-Barcelona_Catalonia.html", "text": "Not to many people the day we went. Some nice banks in the sand for lying against. Life quarters was on duty with signs about the conditions for swimming.", "publishedDate": "2019-05-21", "language": "en", "rating": 4}, {"id": 674041592, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d7981033-r674041592-Platja_de_la_Nova_Icaria-Barcelona_Catalonia.html", "text": "說到巴塞隆納就會令人想到海邊、酒吧、多采多姿的生活與豐富的景點。\n搜尋巴塞隆納海邊時通常會搜尋到Barceloneta，最耳熟能詳也是最近到達的海邊，但除了Barceloneta，我個人更推薦離Barceloneta不遠的Platja de la Nova Icaria，只要在地圖中往上拉一點便能看到，徒步、捷運都能方便地抵達，雖然周末假日也是很熱門的景點但我個人覺得這邊比Barceloneta的環境更好一些，是個不錯的選擇。\n\nWhen we talk about Barcelona, we will remind the beach, bar, the colorful life and has plenty of attractions. Apart from Barceloneta, I would recommend Plaja de la Nova lcaria more and it located nearby Barcelona, could arrive easily by foot from Barcelona or by metro. Although there also has a lot of people in the weekend but in my opinion, there has the better environment and it's also a good choice that if you want to take sun bath or take a walk.", "publishedDate": "2019-05-14", "language": "en", "rating": 4}, {"id": 664714475, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d7981033-r664714475-Platja_de_la_Nova_Icaria-Barcelona_Catalonia.html", "text": "Spent an enjoyable morning on this sandy beach, it was well maintained and not too busy. Supermarket and plenty of bars near by, a few sellers on the beach but they took no for an answer quickly and moved on.", "publishedDate": "2019-04-08", "language": "en", "rating": 5}, {"id": 661627068, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d7981033-r661627068-Platja_de_la_Nova_Icaria-Barcelona_Catalonia.html", "text": "We had a blast so much to do. Volleyball courts tons of beach and great surf for the average body surfer. This is a great place to get a tan close to shops.", "publishedDate": "2019-03-27", "language": "en", "rating": 5}, {"id": 624583988, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d7981033-r624583988-Platja_de_la_Nova_Icaria-Barcelona_Catalonia.html", "text": "We visited for the day on my 30th,it was a lovely way to relax!\nWe got there around 10am, and it was pretty dead at that point, though it did get much busier throughout the day.\nYou can rent out sunloungers and umbrellas for the day (€10 each, I don’t think it’s too bad), and you can also borrow towels if you don’t have one - €10 per towel, though you get €5 back per towel at the end of the day if you hand them back. For us it just meant we didn’t have to carry anything around Barcelona and we didn’t bring beach towels with us, so worked great. We had a good spot for the whole day.\nClearly popular with the locals, so that was nice.\nThere are *a lot* of peddlers on this beach, and they will come find you as soon as you get to the beach (before you even sit down!) though tell them no and they’ll go. They’ll reappear throughout the day, annoying but harmless really.\nOf course, keep an eye on your belongings.\nWe were sat in front of one of the bars, and there are guys from the bars who will come and ask if you want anything, so we really didn’t need to move! We ordered water throughout the day, and also a toastie at lunch. It was nice! They were really friendly.\nThis beach was definitely one of my favourite parts of the trip.\nTip - take your own loo roll / tissues if you visit the loo, as it’s definitely not always there! These aren’t the cleanest I’ve come across, but it is a public beach, I’ve seen worse.", "publishedDate": "2018-10-13", "language": "en", "rating": 5}, {"id": 609871595, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d7981033-r609871595-Platja_de_la_Nova_Icaria-Barcelona_Catalonia.html", "text": "I was heading to Barceloneta beach one day recently when I came across reviews for this beach, which said it was less busy, less touristy and not as many people trying to sell you stuff and right they were!  I haven't been to any other beach in Barcelona so can't compare but the day I spent there was very enjoyable. I hired an umbrella from the guys nearby and settled down for a day of doing nothing. we got there about 10am and it was somewhat quiet.  Filled up a bit around 1/2pm but still not to the point where you felt people were on top of each other.  We ate at the nearby La Carmelina and the paella was absolutely lovely. A bit pricey I thought but then that's to be expected when you're dining on the beach.  The cocktails at Mokai Beach bar are lovely and I kept going back for more. I noticed they provided table service however this wasn't offered to me for some reason but I just got up and went up to the bar. got to know the staff a little. There are people selling blankets, clothes, sangria and mojitos (be careful as they seemed a bit random and you have no idea where the drinks have come from) and massages. They aren't pushy but they will ask everytime they do their rounds. I stuck my nose in my book and left me alone generally. Toilets - lady expects a tip for handing you the toilet paper.  Was very impressed with the services they offer for disabled people.  Britain could learn a lot from them. I look forward to returning!", "publishedDate": "2018-08-24", "language": "en", "rating": 5}, {"id": 604435566, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d7981033-r604435566-Platja_de_la_Nova_Icaria-Barcelona_Catalonia.html", "text": "We visited the Platja de la Nova Icaria beach the day after we went to Barceloneta. We preferred this beach over the first as there were less people (still busy though) and the water seemed cleaner and clearer.\nIt’s a little further from the mariner but we found the walk worth it. \n\nThere were two cafes on the beach which we didn’t visit as we weren’t hungry at the time, but they both looked quite nice.", "publishedDate": "2018-08-08", "language": "en", "rating": 4}, {"id": 603496102, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d7981033-r603496102-Platja_de_la_Nova_Icaria-Barcelona_Catalonia.html", "text": "We had heard mixed reviews about taking in the beach scene while in Barcelona, but with two teenage sons and an otherwise full schedule we decided to make it work. My research suggested within the city limits that Nova Icaria was the beach of choice for locals and families and our two visits during our vacation didn't disappoint. \n\nWe arrived on the early side, which is definitely advisable, by 11am both times. We easily were able to rent lounge chairs and umbrellas (2 chairs and umbrella 30 euro, but hey, you are on vacation) We were able to order food and drinks from an on the beach bar/restaurant as well. The prices were fairly reasonable. There are some vendors who wander around the beach selling wraps, massage and water, but nothing you can't politely wave off. We didn't feel intimidated or pressured in any way, but we can really say that about Barcelona as a whole. \n\nWe travel often, but we did love this beach and the experience. The water was comfortable, easily swim friendly, and quite clean overall. We are so happy to have chosen it over Barceloneta, although our next visits we'll hope to make it out to one of the other coastal towns which by all accounts are amazing too.", "publishedDate": "2018-08-06", "language": "en", "rating": 5}, {"id": 600617417, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d7981033-r600617417-Platja_de_la_Nova_Icaria-Barcelona_Catalonia.html", "text": "This place was much cleaner than barcelonata . Less tourism aswell I don't know if I was lucky or it's always like this .", "publishedDate": "2018-07-28", "language": "en", "rating": 4}, {"id": 597100619, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d7981033-r597100619-Platja_de_la_Nova_Icaria-Barcelona_Catalonia.html", "text": "We had a party of 10 people and spent the day at this beach.  Great location and only a couple miles away from our hotel in the city.  very clean beach.  \n\nIt costs 10.00 Euros per lounge or umbrella which we felt was very reasonable for the day.   The beach was free of rocks where we were and water was extremely clean.\n\nWaiter staff for drinks and food were right on top of things but never annoying.  We left an open tab all day and drank and ate for 10 people all day for less than 200 Euros.\n\nPleanty of topless sunbathers to view on this beach as well.  Ages 18-80 Ha Ha!  fantastic day all around!", "publishedDate": "2018-07-17", "language": "en", "rating": 5}, {"id": 593541906, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d7981033-r593541906-Platja_de_la_Nova_Icaria-Barcelona_Catalonia.html", "text": "This beach was the other side of the port to Barceloneta Beach. It was pretty clean and less touristy, but when we visited there were small gangs of un-delightful looking people hanging around the port wall.", "publishedDate": "2018-07-06", "language": "en", "rating": 3}, {"id": 589324663, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d7981033-r589324663-Platja_de_la_Nova_Icaria-Barcelona_Catalonia.html", "text": "Perfect for a quiet beach day. The vendors selling drinks, shawls, and massages on the beach can become a nuisance but other than that the water is crystal clear and glorious. We had a great time!", "publishedDate": "2018-06-20", "language": "en", "rating": 5}, {"id": 586429947, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d7981033-r586429947-Platja_de_la_Nova_Icaria-Barcelona_Catalonia.html", "text": "A very nice and clean beach. You can find many supermarkets in the area. \nYou’ll need a towel and umbrella. They have sun beds and umbrellas for rent but they’re not cheap if you’re planning to go to the beach frequently it won’t be practical to rent everyday. Paddlers are everywhere, you cannot do anything about it so just ignore them. ", "publishedDate": "2018-06-10", "language": "en", "rating": 4}, {"id": 584562952, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d7981033-r584562952-Platja_de_la_Nova_Icaria-Barcelona_Catalonia.html", "text": "This beach is certainly worth the walk as less people are around and less vendors trying to sell to the tourists.", "publishedDate": "2018-06-02", "language": "en", "rating": 4}, {"id": 581014223, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d7981033-r581014223-Platja_de_la_Nova_Icaria-Barcelona_Catalonia.html", "text": "We arrived at the beach late morning on a beautiful sunny Friday. There were a few people there, but still very quiet. There are lounge chairs and umbrellas available, but you have to pay to use them. There are also walking vendors selling very nice beach blankets, but they (the vendors) are not annoying. The water is very clear, but was still a bit chilly (we were there in May). After awhile, the wind really starting blowing, so we didn't stay as long as we would've liked. But still a wonderful outing!", "publishedDate": "2018-05-18", "language": "en", "rating": 5}, {"id": 567367306, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d7981033-r567367306-Platja_de_la_Nova_Icaria-Barcelona_Catalonia.html", "text": "We walked all the way from the W Hotel at Barcelonetta Beach down to this beach - it's a really long walk past several beaches.  This beach is definitely less touristy than the other beaches back towards Barcelonetta, but it kind of lacks atmosphere compared to the others.  \n\nIt shares a retaining wall with the end of the touristy area of Port Olimpic, where you'll find the casino but also cafes, restaurants, bars etc in that area.  From Nova Icaria onwards (ie moving further away from Port Olimpic) it becomes almost empty of places to eat, drink or shop.  So the retaining wall contains all the popular places to eat and hang out, as well as shops etc.  \n\nThe water is what amazed me the most at Nova Icaria (see pics) - it's almost clear as glass.  I could see the bottom with ease.", "publishedDate": "2018-03-18", "language": "en", "rating": 3}, {"id": 541983810, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d7981033-r541983810-Platja_de_la_Nova_Icaria-Barcelona_Catalonia.html", "text": "Nova Icaria and Bogatella beaches were sandy, clean and beautiful. Not crowded in the morning, but more so as the day progressed. Some restaurants to go have lunch and use the restrooms. Some topless women, but you won’t notice them unless you are trying to find them. Family beach with all ages enjoying the sun. Not too loud.  Water quite cold late October, but still a handful of people  swimming. There are vendors selling blankets (8-10 euros) and older Asian women inquiring if you want a foot/hand/back massage. Ignore them and they go away. Loved this beach. Short 5 min. walk from our hotel SB Icaria. ", "publishedDate": "2017-11-19", "language": "en", "rating": 5}, {"id": 533605660, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d7981033-r533605660-Platja_de_la_Nova_Icaria-Barcelona_Catalonia.html", "text": "Nice beach with fine sand and few volleyball courts. Very clean beach and water where you can relax for many hours. Bars are selling refreshments for reasonable prices.", "publishedDate": "2017-10-16", "language": "en", "rating": 4}, {"id": 533248777, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d7981033-r533248777-Platja_de_la_Nova_Icaria-Barcelona_Catalonia.html", "text": "A beautiful beach, with a great infrastructure. A small beah with shower, bathrooms, restaurants, a great view, clean water.\nIs less full of visitors than Barceloneta, and for me this was amazing.\nThis beach deserves a visit", "publishedDate": "2017-10-15", "language": "en", "rating": 5}, {"id": 530192142, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d7981033-r530192142-Platja_de_la_Nova_Icaria-Barcelona_Catalonia.html", "text": "But we still preferred the long walk to the W hotel beach.\nA little quieter there.\nThis is a busy active beach that I would have stayed at 25yrs ago. :)", "publishedDate": "2017-10-05", "language": "en", "rating": 4}, {"id": 527314960, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d7981033-r527314960-Platja_de_la_Nova_Icaria-Barcelona_Catalonia.html", "text": "Stopped here to get away from the cold of Canada and we loved the beach. We sat down for some drinks at the beach bar, and got some serious sun. It became a little crowded later into the evening but that is to be expected on such a nice day, happens back home by the beach at my house all the time.", "publishedDate": "2017-09-25", "language": "en", "rating": 5}, {"id": 519948010, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d7981033-r519948010-Platja_de_la_Nova_Icaria-Barcelona_Catalonia.html", "text": "The beach itself was great and we really enjoyed Xiroi, the beach bar on the boardwalk. We had a great week at this beach, living in MarBella, until the last day when my daughters backpack was stolen. Literally happened 15 ft away while we were playing beach paddle.  We didn't lose much in the big scheme of things but it was a bummer on an otherwise great experience.", "publishedDate": "2017-08-31", "language": "en", "rating": 4}, {"id": 514251291, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d7981033-r514251291-Platja_de_la_Nova_Icaria-Barcelona_Catalonia.html", "text": "Don't settle for barceloneta beach and make the effort to walk a bit further or take the metro to Ciutadella Vila olympica from which nova icaria is a 15 min walk because Nova Icaria beach has much softer and finer sand, less rubbish, less crowded and just all round a much nicer beach. Over our trip we visited midday on a Sunday and about 6pm on a Tuesday where we stayed until late and watched the sun set- beautiful. The water was warm and clean and safe to swim out. The beach was safe and we left our valuables hidden but on the beach and they were left untouched. Showers, toilets and bars and food all about. Wouldn't recommend buying from the beach pedlars selling water and beer, instead go to a legit bar and pay €3 for a can of Estrella (or take your own) great place for tourists and locals alike and even volleyball courts!", "publishedDate": "2017-08-17", "language": "en", "rating": 4}, {"id": 512910048, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d7981033-r512910048-Platja_de_la_Nova_Icaria-Barcelona_Catalonia.html", "text": "From reading the reviews we knew that this beach would be crowded and dirty, but we were too tired to walk to the further beaches.  It is a long walk so take a cab or rent a bike to get to the other beaches.  Luckily for us it was not too crowded.  We paid the 30 euros for 2 chaise lounge and an umbrella.  If you are not a smoker, choose your seats wisely.  Lots of peddlers selling blankets or a massage.  If you don't make eye contact and ignore them, they will eventually leave you alone.  We were a little wary about the water after reading the reviews but there were quite a few people swimming in the waters  and having so much fun.  So we decided to go in.  GROSS!  Trash everywhere.  As the waves are going in and out, trash is rubbing up against you everywhere.  Plastic bags, wrappers, plastics bottles etc.  When I saw the feminine products and a used condom, that was when we knew it was time to get out and stay out.  If you have to swim in the waters, at least go in the middle where there is less trash.  The trash collects along the sides by the piers.  \nThere are public bathrooms and surprisingly they were clean.  We left by 1 pm so who knows what condition they will be in by the end of the day.  ", "publishedDate": "2017-08-14", "language": "en", "rating": 2}, {"id": 509729578, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d7981033-r509729578-Platja_de_la_Nova_Icaria-Barcelona_Catalonia.html", "text": "Barcelona has quite a few Beaches you can visit, but this is the best.  The sand is finer that that of Barceloneta Beach and the waves are much calmer.  Although it's just a walk down the coast from Barceloneta Beach, it's a little less busy and you can rent a sun shade for €10. The beach is busy right up until 10pm and is a good family beach, definitely recommend.", "publishedDate": "2017-08-07", "language": "en", "rating": 5}, {"id": 509219592, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d7981033-r509219592-Platja_de_la_Nova_Icaria-Barcelona_Catalonia.html", "text": "This area is not so crowded and a bit calmer.  Still a lot of People around. In this Part of the beach you find more families. Really nice. ", "publishedDate": "2017-08-06", "language": "en", "rating": 5}, {"id": 505658117, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d7981033-r505658117-Platja_de_la_Nova_Icaria-Barcelona_Catalonia.html", "text": "After three days walking in the city, it was a nice break for my family to spend a whole day there.  From metro stop Ciutadella | Vila Olímpica, it took us 15 min to walk there. \n Although it seems that this is a quieter beach in Barcelona according to other reviews, we still found the beach was crowded by midday on a Friday in late June.   Nonetheless, my eight-year-old son really enjoyed it.  The sand was soft and the water quality was decent when we were there.", "publishedDate": "2017-07-25", "language": "en", "rating": 4}, {"id": 505500711, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d7981033-r505500711-Platja_de_la_Nova_Icaria-Barcelona_Catalonia.html", "text": "Where Barceloneta is for people-watching and partying, Platja de la Nova Icária is for relaxing. There are far fewer crowds here, which means it's both quieter and roomier, yet no less scenic. To get to the beach, I took the L4 to Bogatell station, just one stop beyond Barceloneta. Definitely worth it!", "publishedDate": "2017-07-25", "language": "en", "rating": 5}, {"id": 504536382, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d7981033-r504536382-Platja_de_la_Nova_Icaria-Barcelona_Catalonia.html", "text": "The day before visiting Platja de la Nova, my partner and I went to Barceloneta for the afternoon. We were really disappointed and I'm so glad we did a bit of research and found this beach instead.\n\nThis beach is much cleaner and less busy. There are parasols for hire (although I just saw people lying under them). \nThere are some lovely restaurants along the beach and it has a lovely atmosphere. The water was lovely and warm which meant there wasn't that horrible surprise of icy cold water. \nThe only thing to be wary of is as you reach the sea it's very rocky and they can be quite sharp. Secondly there were some sellers around, but they were very mild and didn't bother you if you didn't want their attention. \n", "publishedDate": "2017-07-22", "language": "en", "rating": 3}, {"id": 503596676, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d7981033-r503596676-Platja_de_la_Nova_Icaria-Barcelona_Catalonia.html", "text": "This beach is way better than La Barceloneta.  The entrance to the water is actually sand instead of rocks. The beach was much quiter and better for families.  The beach was still littered with trash, but the overall feel was better. The kids enjoyed playing I the waves. I would recommend this beach for families with young kids.", "publishedDate": "2017-07-19", "language": "en", "rating": 4}, {"id": 499916243, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d7981033-r499916243-Platja_de_la_Nova_Icaria-Barcelona_Catalonia.html", "text": "Our second trip here within a year - love this beach! It is a bit quieter than some of the others, which is a major bonus! Lots of places to eat and drink nearby and the most gorgeous golden sand!", "publishedDate": "2017-07-09", "language": "en", "rating": 5}, {"id": 493461536, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d7981033-r493461536-Platja_de_la_Nova_Icaria-Barcelona_Catalonia.html", "text": "Perfect for families, older people, couples and groups of young people. \n\nHardly any sellers, but plenty of Thai massagers if you like that sort of thing.\n\nLots of places to eat and drink as well as the little marina with boats.\n\nWe caught a cab from Central Barcelona after reading the other beaches were over crowded and noises.  So glad we did, only 10/15 minutes and had a great day. \n\nTake a towel or we paid €10 per bed and per umbrella.\n\n", "publishedDate": "2017-06-16", "language": "en", "rating": 4}, {"id": 492653884, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d7981033-r492653884-Platja_de_la_Nova_Icaria-Barcelona_Catalonia.html", "text": "This is a lovely beach a lovely location. If you want to use a sun bed and a parasol then be prepared to pay a bit. For us we had two beds and a parasol and it cost us 28 euro. \nThis beach is not as busy as other beaches so it's a lot better the nearest metro stop is Llacuna ", "publishedDate": "2017-06-13", "language": "en", "rating": 4}, {"id": 490862058, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d7981033-r490862058-Platja_de_la_Nova_Icaria-Barcelona_Catalonia.html", "text": "It wasn't crowded, sand was soft and smooth, baby friendly. Food was great although they don't tell you the sauce on the burgers cost €2 extra. There were a few sellers but they weren't pushy. ", "publishedDate": "2017-06-05", "language": "en", "rating": 4}, {"id": 470921278, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d7981033-r470921278-Platja_de_la_Nova_Icaria-Barcelona_Catalonia.html", "text": "The sand is lovely and soft, the sea is azure blue and it gets misty there from time to time. It was a lovely spot to spend the afternoon. There were less illegal vendors trying to sell you things but they tend to leave you alone if you ignore them. \nIt was a quieter and nicer beach than the other ones that I passed and was close to Port Olympic, so we can enjoy fresh seafood to compliment our trip.", "publishedDate": "2017-03-28", "language": "en", "rating": 4}, {"id": 449222635, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d7981033-r449222635-Platja_de_la_Nova_Icaria-Barcelona_Catalonia.html", "text": "There are 10 designated beach bays, separated by breakwaters, on the city´s southern end. Nova Icaria has a wide expanse and isn´t as impacted by the inner city life as the others closer to the port. Whatt´s more is that there is a pier full of restaurants and, for the athletic type, a number of volleyball courts. Remember this is a city beach near a large industrial port. You can swim, but don´t injest the sea water. Also, there´s a metro stop nearby. In the summer, all facilities are operating. At other times of the year, there is no lifeguarding and most restrooms are closed.", "publishedDate": "2017-01-04", "language": "en", "rating": 4}, {"id": 436293046, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d7981033-r436293046-Platja_de_la_Nova_Icaria-Barcelona_Catalonia.html", "text": "No annoying sellers, more peaceful than Barceloneta beach. And just a few minutes away. Close to Diagonal shoping centre. We had a nice afternoon", "publishedDate": "2016-11-10", "language": "en", "rating": 4}, {"id": 423746022, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d7981033-r423746022-Platja_de_la_Nova_Icaria-Barcelona_Catalonia.html", "text": "This beautiful beach is located near the Olympic harbor. There are several restaurants and bars in the area and the usual thick sand like the other beaches of Barcelona. It is an ideal alternative to Barceloneta Beach. ", "publishedDate": "2016-09-30", "language": "en", "rating": 4}, {"id": 414114441, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d7981033-r414114441-Platja_de_la_Nova_Icaria-Barcelona_Catalonia.html", "text": "Not different or less beautiful than other beaches in Barcelona. We spent many an afternoon on various beaches here. Being not familiar with the place, the first day we hit randomly this beach (as there are many). Everything ok, except that we are much happier on naturist or clothing-optional beaches - this is not one of them. From the next day, as we found the Mar Bella and Nova Mar Bella beaches, not far to the east of here, where wet irritating small textile pieces may be avoided, we did not return here...", "publishedDate": "2016-09-03", "language": "en", "rating": 3}, {"id": 408213662, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d7981033-r408213662-Platja_de_la_Nova_Icaria-Barcelona_Catalonia.html", "text": "A less inhabited beach but still can get crowded. Water lovely and sandy beach wonderful. Good place to walk, run or for a day of rest!", "publishedDate": "2016-08-21", "language": "en", "rating": 5}, {"id": 407538711, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d7981033-r407538711-Platja_de_la_Nova_Icaria-Barcelona_Catalonia.html", "text": "We decided on a local beach day after a couple of days city sightseeing in the August heat.  Did the now compulsory Google / tripadvisor search and, after reading some of the previous reviews, decided upon Platja de Nova Icaria p, admittedly with a bit of trepidation.\n\nConsidering it is August the beach had plenty of space to relax and was not crowded. OK so it's Friday and I imagine the beach would be busier at the weekends, obviously.\n\nWe rented a couple of umbrellas at €8 each which were an absolute necessity.\n\nThe sandy beach itself was very clean, plenty of beach bins that were being used and emptied so there was no beach litter. The sea was cool and crystal clear without any floating detritus described in previous reviews.  My son and I snorkel and apart from what I'd expect to find in the sea (fish if you were wondering) the were no submerged surprises either.\n\nA couple of beach beer vendors walked past but only twice all day.\n\nThere are a few beach bar / cafes but, being a captive audience, are not favourably priced so self cater or take a couple of minutes walk along the promenade and there's a massive McDonalds. There's other eateries near the marine but didn't check out the prices.", "publishedDate": "2016-08-19", "language": "en", "rating": 4}, {"id": 407027861, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d7981033-r407027861-Platja_de_la_Nova_Icaria-Barcelona_Catalonia.html", "text": "we have just come back from Barcelona Spain we stayed at the Olympic village in a apartment we had 3 bed rooms 2 showers kitchen and living area we stayed in room 108 the location was very good we where close to the nova icrai beech 2 mins away from the apartment close to local shops and the marina village was only 5 mins away we went for five days and did a lot we went tocamp nou went to Catalonia square also went to the olympic stadium went to tibadora which was good had to catch a tram to topoff the hill then get the fenukilar train write to the top the views are breath taking they have a theme park for the kids at the top but just to go up there for the views is worth spending the money we also went on the cable car to castelle de montjuic also went to sagrada familia where you see gardi work also went to watch barcelona play which was very good over all the trip was very good and we reallyenjoyed it", "publishedDate": "2016-08-18", "language": "en", "rating": 5}, {"id": 402990101, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d7981033-r402990101-Platja_de_la_Nova_Icaria-Barcelona_Catalonia.html", "text": "The beach was quiet away from the crowd of barceloneta. There were sun longers and umbrellas, and the guys working there were helpful. It didn't get really busy and there was lots of space to move around. The beach was cleanish, there was the odd cigarette butt but nothing too horrendous. The sea was clean and clear, lovely to cool down in. The cafe brought you drinks or food to your lounger. Not as bad as previous reviews made out.", "publishedDate": "2016-08-08", "language": "en", "rating": 3}, {"id": 402976947, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d7981033-r402976947-Platja_de_la_Nova_Icaria-Barcelona_Catalonia.html", "text": "A nice beach with nice sand and nice water! It gets kind of deep pretty fast, maybe hard for kids. But there where a lot of kids and they looked like having fun! There is a lifeguard on the beach which feels good. Very crowded on the weekend but everyone fits! :)\nYou can rent sunbed and \"umbrella\" but thats pretty expensive: one bed 10 euro and one umbrella 8 euro.\nGood restaurang nearby!", "publishedDate": "2016-08-08", "language": "en", "rating": 3}, {"id": 395607921, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d7981033-r395607921-Platja_de_la_Nova_Icaria-Barcelona_Catalonia.html", "text": "Not as half as crowded as Barceloneta Beach so it counts as a good point.\n\nThe bad thing is that the water was so dirty that took me a while to wet my head. Lots of plastic and also a sanitary napkin could be found at the water.\n\nAs soon as I got myself all wet, I left the beach immediately.", "publishedDate": "2016-07-22", "language": "en", "rating": 2}, {"id": 392126542, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d7981033-r392126542-Platja_de_la_Nova_Icaria-Barcelona_Catalonia.html", "text": "The beach was crowded, like sardines, the water was not clear, it was unclean with sanitary towels, plasters, and other garbage floating in it. My mum found a tampon wraper down her costume when we got home. Sorry guys but if you want a nice beach seriously - take a train to Sitges, it's much, much nicer, clear water and far cleaner.", "publishedDate": "2016-07-13", "language": "en", "rating": 3}, {"id": 392097839, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d7981033-r392097839-Platja_de_la_Nova_Icaria-Barcelona_Catalonia.html", "text": "YUK! I am not going back here ever again. I can put up with crowds, even fag ends all over the beach and some other rubbish, what I can't tolerate is disgusting sea water. It had lots of nasty stuff floating in it. I can't believe I swam in it! I didn't realise until my daughter told me she saw a tampon floating about.  You couldn't even see the bottom.", "publishedDate": "2016-07-13", "language": "en", "rating": 2}, {"id": 386654770, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d7981033-r386654770-Platja_de_la_Nova_Icaria-Barcelona_Catalonia.html", "text": "The beach is not the most famous one, and also not that big, but definitely is the one that I felt like I was in Spain! \nDon't get me wrong I also liked Barceloneta a lot : with all the tourists (like me!) around, and the international atmosphere. But Nova Icaria is full of the beautiful people from Barcelona in a nice environment, calm waters and no shells and stones. ", "publishedDate": "2016-06-27", "language": "en", "rating": 5}, {"id": 385338102, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d7981033-r385338102-Platja_de_la_Nova_Icaria-Barcelona_Catalonia.html", "text": "We came to this beach after a wonderful late lunch at nearby 'La Fonda del Port Olimpic'. restaurant. The sand was fine and the water was clear. After a sunny day, clouds overcasted the sky but it was still nice to reach the sea.Friends changed to their bathingsuits at the nearby restrooms and  let themselves into the sea. There were volleyball players around. This is a nice beach with clean water and fine sand. You can visit this beach without hesitation if you need some refreshment.You will refresh your mind too.", "publishedDate": "2016-06-23", "language": "en", "rating": 3}, {"id": 341384760, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d7981033-r341384760-Platja_de_la_Nova_Icaria-Barcelona_Catalonia.html", "text": "Good view from both sides - Sea, beach and the Port! Good food! Not expensive ! Light Lunch Was around 50€ for 3 persons : 1 huge Dorada &Veg, crochets, little fishes - \"barabulka\")) , mix salad, 2 bears, 2 teas, coffee.... Mmm! And Browny & ice-cream for desert! That's it!)))👍🏻👍🏻👍🏻", "publishedDate": "2016-01-20", "language": "en", "rating": 4}, {"id": 306114020, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d7981033-r306114020-Platja_de_la_Nova_Icaria-Barcelona_Catalonia.html", "text": "My husband and I biked to this beach.  It is not close to the El Born/Barri Gothic/etc.  Some of the beaches are walking distance, but this one is a little further away.  We went to the section of beach by the restaurant/bar Mokai.  We went one morning and then again one afternoon.  It's easier to get a lounge chair and umbrella earlier in the day.  Later in the day, you might not be able to get one or you might need to walk to the next beach area.  Each lounge chair is 6 euros and an umbrella is also 6 euros.  You can order food and drinks from Mokai.  My husband had a hamburger and I had a veggie burger.  They were both surprisingly good.  I think our total bill, with two non-acoholic beverages was @25-30 euros.  A beer is @5-6 euros.  We enjoyed the beach.  The water was refreshing.  One day there were no waves, but two days later there were waves.  It is a crowded beach, but you can get your own little area.  There are a lot of people smoking on the beach.  That did bother us because we aren't used to all of the smoke.  If you are looking for a way to kick back after some sight seeing, enjoy some time at the beach!", "publishedDate": "2015-09-01", "language": "en", "rating": 4}, {"id": 291544646, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d7981033-r291544646-Platja_de_la_Nova_Icaria-Barcelona_Catalonia.html", "text": "Our apartment owner recommended this over Sant Sebasta and Baceloneta. Although it was about 15 mins walk from the D20 bus terminus, there was plenty space right next to the water. \n\nThis beach is quite steeply shelving and although there is quite a lot of sand and vegetation in the water close to shore (as alluded to by other recent reviews) the water is clear enough by the time you get 10m from shore.\n\nAlthough our family have been spoiled by the crystal clear waters of the Inner Hebrides in Scotland, I can vouch that the water off Barcelona is at least 10 degC warmer, which makes up for any concerns about sand consistency or water clarity. Even the best beach in the world has a bit of seaweed and sand at the tideline, after all and we spent a very pleasant couple of hours here.", "publishedDate": "2015-07-22", "language": "en", "rating": 4}, {"id": 284991895, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d7981033-r284991895-Platja_de_la_Nova_Icaria-Barcelona_Catalonia.html", "text": "Well, the beach area is big, but the sand is awful, it looks like flour. It's crowded in the weekend, the water is full with junk ... There are no changing room?! Only small toilets...\nIf you want beautiful beach and blue water - got to Palma!", "publishedDate": "2015-07-02", "language": "en", "rating": 2}, {"id": 283241777, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d7981033-r283241777-Platja_de_la_Nova_Icaria-Barcelona_Catalonia.html", "text": "This beach is much cleaner and less crowded than the touristy Barceloneta. Crystal clear water and fun activities. It's the perfect combination of relaxation and fun!", "publishedDate": "2015-06-26", "language": "en", "rating": 5}, {"id": 277935544, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d7981033-r277935544-Platja_de_la_Nova_Icaria-Barcelona_Catalonia.html", "text": "After a number of days treating the streets of Barcelona on the tourist trails, we wanted a relaxing day on the beach. After having a walk along Barceloneta earlier in the week we wanted to get a bit further out away from the crowds. \n\nWe got the Metro to Ciutadella Vila Olímpica and after a 10 minute walk were on the Port Olimpic. Platja de la Nova Icaria is on the left hand side of the port as you look at it from the Metro station. \n\nAs a tourist we didn't have our own umbrellas, wind breakers or chairs so opted to use those available to rent on the beach. After setting ourselves up we found it was 24 Euro for two sun beds and an umbrella which seems rather expensive. It didn't matter if you stayed for 1 hour or 6 hours, the cost was the same. Many people made the same comment when faced with the cost, and some chose to have just the umbrella and use their towels to lay on which is a good option. If you do want a bed I would recommend getting there before lunch time as it does get busy, but also you might as well make the most of your time at that cost! \n\nThe Balearic Sea was absolutely freezing, but a nice way to cool down after a day sunbathing!\n\nThere were toilets available on the beach which were free and did seem to be regularly cleaned and attended to.", "publishedDate": "2015-06-04", "language": "en", "rating": 4}, {"id": 275781808, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d7981033-r275781808-Platja_de_la_Nova_Icaria-Barcelona_Catalonia.html", "text": "My fiancee and I spent an afternoon here laying out on a towel, playing in the (cold) water, people watching, eating tapas at an excellent spot (Escriba).  \n\nSome locals recommended this beach, essentially, going more east and avoiding Barceloneta due to tourists.\n\nPort Olimpico is next door and a short walk with a \"boardwalk\" of several restaurants.\n\nPeople seemed to be minding their own business, but we were very active in our efforts not to be victims.   \n\nFYI - boobies are every where.  The neighboring beach (Mar Bella) had many men bearing it all.  Also, be sure to bring sunscreen.  ", "publishedDate": "2015-05-30", "language": "en", "rating": 5}, {"id": 266875446, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d7981033-r266875446-Platja_de_la_Nova_Icaria-Barcelona_Catalonia.html", "text": "Whether you want to play netball, sit and watch the world go by or take a peaceful stroll near the water this is a great location.\n\nThoroughly enjoyed the relaxed atmosphere.", "publishedDate": "2015-04-20", "language": "en", "rating": 5}]}}]