[{"locationId": 257528, "name": "CaixaForum", "placeType": "ATTRACTION", "reviewListPage": {"reviews": [{"id": 746363786, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d257528-r746363786-CaixaForum-Barcelona_Catalonia.html", "text": "A very nice sit touristique, present interesting exibitions, nice architecture, there is an entrance to pay; you will find a library with interesting books and a little restaurant.", "publishedDate": "2020-02-20", "language": "en", "rating": 5}, {"id": 708151268, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d257528-r708151268-CaixaForum-Barcelona_Catalonia.html", "text": "Absolutely great food, beautifully presented & good service all at an affordable price. If you don't like the look of the exhibition, just eat here! ", "publishedDate": "2019-09-09", "language": "en", "rating": 5}, {"id": 685416458, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d257528-r685416458-CaixaForum-Barcelona_Catalonia.html", "text": "Not sure about others, but when I came with my friend, there were three exhibitions available. All were pretty bland. This place is negligible at best. Not worth the €5 IMO.", "publishedDate": "2019-06-30", "language": "en", "rating": 3}, {"id": 675861391, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d257528-r675861391-CaixaForum-Barcelona_Catalonia.html", "text": "Obviously the quality of the temporary exhibitions will vary, but if our experience is typical, they will be high quality. However the building itself is as much an attraction as the contents. A wonderful converted factory dating from around 100 years ago, which has fine views from the roof and also a pretty nice café.", "publishedDate": "2019-05-23", "language": "en", "rating": 5}, {"id": 648538354, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d257528-r648538354-CaixaForum-Barcelona_Catalonia.html", "text": "Extensive exhibition of Lautrec and contemporaries. Very good pieces and interesting selection plus worthwhile commentary. Informative and enjoyable. It was open until 8PM and people were there until the end, clearly having a grand time.\n\nI waltzed over to the Valesquez  and contemporaries exhibit and similarly found it interesting and enjoyable. \n\nAfterwards, I took a quick elevator ride to the roof to enjoy the view and the cool night air.\n\nMust give kudos to the re-imagining of this innovative industrial site. Very well done. Read about the history and the re-do. As Arte Johnson used to say \"very interesting.\"\n\nIf you like either of these artists, it is definitely worth a visit and the price is extremely reasonable. So what are you waiting for? It will be gone soon.", "publishedDate": "2019-01-27", "language": "en", "rating": 5}, {"id": 648094243, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d257528-r648094243-CaixaForum-Barcelona_Catalonia.html", "text": "Housed in a former factory building, very near Plaza España and the \"magic fountain,\" this museum and cultural centre is well worth the visit. The view from the rooftop is breathtaking. The building itself is a glorious example of Catalan Modernist architecture. We enjoyed the Velázquez exhibit much more than the Lautrec, mostly because it was less crowded and made better use of space. Both were fascinating, with explanations in Catalan, Spanish and English.", "publishedDate": "2019-01-25", "language": "en", "rating": 5}, {"id": 631731639, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d257528-r631731639-CaixaForum-Barcelona_Catalonia.html", "text": "Very nice place. It was a former textile factory. One of the most modern at that point of time. Inside there are nice exhibitions and from the roof you can admire the whole building", "publishedDate": "2018-11-07", "language": "en", "rating": 5}, {"id": 608283122, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d257528-r608283122-CaixaForum-Barcelona_Catalonia.html", "text": "We were spending a few days in Barcelona and I saw that La Caixa had an exhibition called “Pharoah” which was a great surprise as my grandson has recently become very interested in Ancient Egypt. The building is very close to the Plaza España so easy to find. The exhibition is artefacts from the British Museum and well laid out and labelled. A great find!", "publishedDate": "2018-08-19", "language": "en", "rating": 5}, {"id": 604351266, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d257528-r604351266-CaixaForum-Barcelona_Catalonia.html", "text": "The building housing this superb has been brilliantly restored from an old factory. Great if only for the building!!  The collectuion this time was a little gruesome for my interests but nevertheless was perfectly displayed. An excellent gallery in all respects even the black rooms. Needs toi be visited when possible to catch the changes.The cafe / restaurant was extremely good with a decent offering - the staff would be better if they had a session at a charm school though!", "publishedDate": "2018-08-08", "language": "en", "rating": 5}, {"id": 590310534, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d257528-r590310534-CaixaForum-Barcelona_Catalonia.html", "text": "We were very lucky we stumbled across the History of Disney exhibition whilst we were in Barcelona. We’d had a few hectic days being tourists & this was a lovely little break. It’s a small exhibition but if you love Disney you’ll definitely appreciate some of the things on display. The souvenirs in the gift shop were also very reasonably priced. Staff were helpful & friendly. ", "publishedDate": "2018-06-24", "language": "en", "rating": 4}, {"id": 585776970, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d257528-r585776970-CaixaForum-Barcelona_Catalonia.html", "text": "This is a small art  building at the foot of Hill going up to the MNAC. It bus stop nthe hop on hop off bus route.\nIt has 4 exhibition spaces. We went as they were showing The story telling of Disney . In fact it was there only exhibition!\nThere are a couple of 00 pieces, primarily backgrounds, character drawings and a few production cells. The exhibition covers the period from the works in the 30s up to Frozen.Alibg the way there are exhibits from Fantasia, Robin hood, Midas, Hercules, Snow-white and more. As a collector of this memorabilia I found it interesting but not fascinating. My partner tolerated it.\nWhilst the subject matter is intrinsically interesting the exhibition lacks a few showstoppers. It wasn't in chronological order either.\nThe exhibition on to late June. I think I got my €4 entrance fees worth but no more.", "publishedDate": "2018-06-07", "language": "en", "rating": 3}, {"id": 569743570, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d257528-r569743570-CaixaForum-Barcelona_Catalonia.html", "text": "Visited Disney’s Art of Storytelling exhibition. Was kind of OK, there tons of other sites you can visit before. Building is cool.", "publishedDate": "2018-03-30", "language": "en", "rating": 2}, {"id": 558620343, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d257528-r558620343-CaixaForum-Barcelona_Catalonia.html", "text": "Another wet day in Barcelona, CaixaForum was on our list anyway but the weather swung it we did it today. The Ancient Greece exhibition was very interesting with clear simple English guide. The display is about competition in all areas of life in the early AD years. We then went to the art collection including Picasso The rooftop garden was closed due to the wet weather.  Look out for theatre or lectures during your visit.  The gift shop is full of interesting fun gifts for all the family.\n", "publishedDate": "2018-02-05", "language": "en", "rating": 5}, {"id": 543770694, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d257528-r543770694-CaixaForum-Barcelona_Catalonia.html", "text": "The layout of the building is a bit confusing. Some of the expositions were nice, like the Andy Warhol one. Others weren't as interesting.", "publishedDate": "2017-11-28", "language": "en", "rating": 3}, {"id": 543116410, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d257528-r543116410-CaixaForum-Barcelona_Catalonia.html", "text": "this type of art was not on my taste, but you can try it yourself because is not bad place, or bad art...only not on  my taste", "publishedDate": "2017-11-25", "language": "en", "rating": 2}, {"id": 530176422, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d257528-r530176422-CaixaForum-Barcelona_Catalonia.html", "text": "I visit Barcelona regularly and my first museum stop is always Caixa Forum. Set up by the Caixa Bank, admission used to be free. Now it is 4 Euros, but that represents terrific value. As well as exhibitions which are of the highest quality, the old industrial building is beautiful. Make sure you go up and take a walk around the roof. When I went recently there were two exhibitions - de Chirico and Andy Warhol.", "publishedDate": "2017-10-05", "language": "en", "rating": 5}, {"id": 525522166, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d257528-r525522166-CaixaForum-Barcelona_Catalonia.html", "text": "From what I read this building is a renovated textile factory.  We went here to see the exhibit \"The World of Georgio De Chirico\" - Dream or Reality.  De Chirico is one of my favorite artists.  I received an email from the De Chirico foundation about this exhibit.\nSince we were going to Barcelona we checked it out.  \nThe building interior is very well designed.  There were 2 different exhibits the day we went, but we only went to one.  We did get the audio player for the exhibit, which was a little extra but worth it.  We did not like the fact that we had to leave a credit card or something as collateral to rent the audio guide player. We left our hotel room key. \nThey have a restaurant inside and a gift shop in the lobby area.  They are located in the historical area near the Spanish Village tourist place, and the Magic Fountain. \nThe entrance fee was 4€.  Def worth a visit esp. if there is an exhibit that you want to see.  I would suggest checking their web site.", "publishedDate": "2017-09-18", "language": "en", "rating": 4}, {"id": 505099677, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d257528-r505099677-CaixaForum-Barcelona_Catalonia.html", "text": "Visiting the Caixa Forum is worthwhile in combination with other nearby attractions, especially on a Sunday when little else is open but you can stay in the area for the nearby fountain display. The art exhibits are somewhat weak, but the renovated building makes a good impression.\n\nFrom the Placa Espanya stop this was an easy walk. The staff member we had was gruff verging on unpleasant,  rebuffing my question about a discount I had gotten everywhere else in town and walking away when I was in the middle of a question.\n\nAnother con is that signage is in Spanish and Catalan only, with the exception of one introductory essay also in French and English. Brush up your language skills, folks!\n\nWe went especially for the De Chirico exhibit, which was extensive and well-arranged but filled mostly with his lesser works. We also viewed the 10 prize-winning photography exhibits, one of which moved me deeply.\n\nThe museum provides umbrellas for walking between exhibits, and we had that rare evening when a flash storm made them useful. They also let us stay in the gift shop after the museum was closed, where we waited out the rain.\n\nWith the skies clearing we moved outside to find a seat among a gathering crowd for the nearby fountain display. Together with a visit to Caixa Forum, this rounded out a fun Sunday night in Barcelona.", "publishedDate": "2017-07-24", "language": "en", "rating": 3}, {"id": 500993082, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d257528-r500993082-CaixaForum-Barcelona_Catalonia.html", "text": "Kids can touch, play and experiment. Really what every museum should be like...all well organized, practical and touchable...adults will enjoy a gorgeous visit, learn and teach their kids as well. All from physics experiments to human evolution or the piece of rainforest within the museum are worth it...", "publishedDate": "2017-07-11", "language": "en", "rating": 5}, {"id": 468465545, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d257528-r468465545-CaixaForum-Barcelona_Catalonia.html", "text": "This museum is quite average at best. We saw all the exhibitions, and the most interesting was the exhibition about Film and Cinema. Other than this, there are very few exhibitions at the museum. The museum is good for taking pictures, as the outside is very nice white marble. The rooftop terrace is a very nice example of Catalan modernisme architecture. If you miss this museum, you really haven't missed much.\nTip: This museum is free on Sunday after 15:00.", "publishedDate": "2017-03-19", "language": "en", "rating": 3}, {"id": 462382740, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d257528-r462382740-CaixaForum-Barcelona_Catalonia.html", "text": "In addition to visiting major museums and art galleries, art lovers should check temporary exhibitions on view at Caixa Forum. When were there, it was hosting several, but the stand-out was Philippe Halman’s “Surprise Me!” featuring 300 works by this Latvian-born photographer, who worked for LIFE magazine and was known for wildly playful, imaginative, often surreal, and ultimately beautiful portraits of many 20th-century icons: Marilyn Monroe, Alfred Hitchcock, Albert Einstein, Jean Cocteau, the Duke and Duchess of Windsor, so on. A substantial section was devoted to Salvador Dalí portraits, some of which are also displayed at the Dalí Theatre-Museum in Figueres.\nThe cost for seeing such a high calibre exhibition: 4 Euros! Wow, what a bargain! We also visited the Caixa Forum in Madrid, where another major exhibition was on view, “Impressionist and Modern. Masterpieces from The Phillips Collection”  (on loan from the Phillips Collection, Washington D.C.).  Again, it was 4 Euros admission. \nCaixa Forum, Barcelona, is downhill from Museu Nacional d'Art de Catalunya (MNAC) and near Plaça d'Espanya.", "publishedDate": "2017-02-23", "language": "en", "rating": 5}, {"id": 459157664, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d257528-r459157664-CaixaForum-Barcelona_Catalonia.html", "text": "located next near the Plaza Espana, this is a former textile factory, housing now exhibitions and other cultural activities. While the building itself is interesting and worth the visit, until March 27 there is a fantastic exhibition titled \"Art and Cinema. 120 years of exchanges\". About the best exhibition we saw at this visit to Barcelona.", "publishedDate": "2017-02-13", "language": "en", "rating": 4}, {"id": 455916822, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d257528-r455916822-CaixaForum-Barcelona_Catalonia.html", "text": "Great museum building very near Tibidabo Park (FGC train station - Av. Tibidabo) which is well known for having very good exhibitions - went there a while ago to see a very impressive dinosaur and natural history exhibition.\n\nWorth checking out if you have the time, as the exhibitions change quite often, but if something you're interested in happens to be on when you're in town I'd recommend Caixa Forum as a morning activity and from there you can get the little blue tram from Plaza Kennedy, opposite the FGC station up to Tibidabo for some wonderful views of the entire city.", "publishedDate": "2017-01-30", "language": "en", "rating": 4}, {"id": 440877014, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d257528-r440877014-CaixaForum-Barcelona_Catalonia.html", "text": "Caixa Forum is near the National Gallery and Placa Espana, and houses temporary art exhibitions of various types but always high quality and of interest be they paintings or photographic. The restaurant on site has dramatically improved and now offers menu de dia which is worth going out of your way for. If you have an account with La Caixa entrance is free but it is only a few Euros anyway.", "publishedDate": "2016-11-29", "language": "en", "rating": 5}, {"id": 435057057, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d257528-r435057057-CaixaForum-Barcelona_Catalonia.html", "text": "I saw the Philippe Halsman photo exhibition which I high recommend for photo fans.\nThe whole building is unique and very nice to walk in. The roof view is nice, nothing more, certainly not a must. I had a very nice lunch there (I have a different review for it).", "publishedDate": "2016-11-06", "language": "en", "rating": 4}, {"id": 422450885, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d257528-r422450885-CaixaForum-Barcelona_Catalonia.html", "text": "This is a city with everything! Salvador Dali, Gaudi, ancient and modern history, civil war memorials and statutes to explorers and scientists, church and civic leaders.\nIt's Gothic heart is a tourist's must for photos, romantics and shoppers.\nBarcelona has a fantastic Metro and intercity and international rail and air transport.\nThe city's heart offers great food and entertainment all within walking distance ", "publishedDate": "2016-09-26", "language": "en", "rating": 5}, {"id": 420623447, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d257528-r420623447-CaixaForum-Barcelona_Catalonia.html", "text": "Paid 2 Euros extra for an audio guide which gave some really interesting background on the former textile museum. No interior detail though. Best bit was the roof terrace, which can be viewed for free. This was most beautiful at sunset! Had refreshements at the cafe afterwards - very clean and modern with good choice.", "publishedDate": "2016-09-20", "language": "en", "rating": 3}, {"id": 419485316, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d257528-r419485316-CaixaForum-Barcelona_Catalonia.html", "text": "If you want to get away from the hectic crowd for an hour or so this is the place. It is an old textile manufacturing factory which was bought by the Bank ''la caixa'' and turned into an art centre. Whatever you do, make sure you go onto the roof which is a real joy. you can see how it was made in brick and has some interesting views to the palace on top of montjuic.\nThey have at least 5 major art spaces and they are always at least 4-5 exhibitions going at any one time. the entry fee is only 4 Euros unless you are a member of the la Caixa bank whereby it is free (you have to show your la Caixa identity card (credit card)).\nIt also has a reasonable art book shop, not great or as good as other museums but OK.", "publishedDate": "2016-09-17", "language": "en", "rating": 5}, {"id": 418481202, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d257528-r418481202-CaixaForum-Barcelona_Catalonia.html", "text": "A modernist factory (now art museum) that resembles a castle designed by Puig i Cadafalch. There is a small fee if you wish to visit the art exhibits, but you are welcome to walk inside the building and access the rooftop (follow the signs with pictures of colorful people standing on top of the roof) for free. Be sure to visit the free exhibit describing the architecture of the building and read the informational leaflet at the entrance to the roof. You will be able to experience the unusual undulations of the rooftop and probably pretty much have the rooftop to yourself to enjoy a different perspective on Barcelona (free of crowds). Clean WCs and a cafeteria if you need to take a little break.", "publishedDate": "2016-09-14", "language": "en", "rating": 4}, {"id": 399735136, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d257528-r399735136-CaixaForum-Barcelona_Catalonia.html", "text": "Great temporary exhibits in a former modernist factory. Amazing.\n\nThe building is súper nice. All the details are great.\n\nIt used to be free. Now its free for la Caixa bank clients. Price is 4€ for all exhibits. It's great.\n\nYou can access the rooftop for free.\nWorth the visit.\n", "publishedDate": "2016-07-31", "language": "en", "rating": 5}, {"id": 397236363, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d257528-r397236363-CaixaForum-Barcelona_Catalonia.html", "text": "I didn't go inside to see the exhibit mostly because I didn't understand what was this building about. I went to the entrance and still didn't understand. So, as I didn't have much time, took some photos from the outside and continued the journey.\n\nSince it's near important sights, it's very worth shooting this building.\n\nIf you have Barcelona Card, the exhibit is free.", "publishedDate": "2016-07-26", "language": "en", "rating": 4}, {"id": 392843590, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d257528-r392843590-CaixaForum-Barcelona_Catalonia.html", "text": "Caixaforum regularly brings the biggest names in both contemporary and classic art. A pity their website is not available in English. But you can find out about their exhibitions here: http://www.artssspot.com/. This site is also handy for discovering local art!", "publishedDate": "2016-07-15", "language": "en", "rating": 5}, {"id": 388532180, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d257528-r388532180-CaixaForum-Barcelona_Catalonia.html", "text": "The building itself is worth the trip. A beautifully restored and preserved textile factory, whose history you can see in an interesting exhibit apart from whatever traveling exhibit happens to be there at the time you go.", "publishedDate": "2016-07-02", "language": "en", "rating": 4}, {"id": 384121727, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d257528-r384121727-CaixaForum-Barcelona_Catalonia.html", "text": "Not my typical thing to do but hey, give and take right. Personally I preferred the roof top view and we ended spending more time here than anywhere else in the compound.", "publishedDate": "2016-06-19", "language": "en", "rating": 3}, {"id": 378658361, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d257528-r378658361-CaixaForum-Barcelona_Catalonia.html", "text": "A former factory, this facility is both community center and art musuem. Tips: don't miss the roof and go when there is a concert scheduled, if possible. It's located almost directly across the street from the Magic Fountain and the Parc de Montjuic, so add this to your list if you're headed that way...", "publishedDate": "2016-06-01", "language": "en", "rating": 5}, {"id": 376365681, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d257528-r376365681-CaixaForum-Barcelona_Catalonia.html", "text": "We visited for the Impressionist Collection on loan from the Phillips in Washington DC. That was wonderful, but the real surprise was the roof and accompanying text explaining the factory layout beneath. That day artists were on site and it was easy to see why they would want to capture the amazing images. The museum offers rotating exhibits, so you'll be likely to find something to whet your appetites.", "publishedDate": "2016-05-25", "language": "en", "rating": 5}, {"id": 373300727, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d257528-r373300727-CaixaForum-Barcelona_Catalonia.html", "text": "We went along for the Phillips modern art exhibition but actually enjoyed the rest of the place more! Well laid out and organised, lovely cafe, lots of places to sit and admire the architecture (it's an old textile factory with lovely ornate towers). We loved the 'sala 5' exhibit due to the echoes - not what the artist intended I'm sure but we had fun ;)", "publishedDate": "2016-05-16", "language": "en", "rating": 5}, {"id": 373130758, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d257528-r373130758-CaixaForum-Barcelona_Catalonia.html", "text": "The building is pretty insane - I won't reveal much about the history, as finding out about it makes for part of the experience - if you are not an art lover - just revel in the architecture - The Spanish are at the forefront of controversial historical building preservation and this really pushes the buttons... Explore the interior and exterior and if you catch a good show then you're in for a great experience. The collection is very good - lots of disinterested school kids to avoid - try and get there early.\nAnd don't forget to look for the Joseph Beuys installation! (Quite tricky to find)", "publishedDate": "2016-05-15", "language": "en", "rating": 4}, {"id": 371712934, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d257528-r371712934-CaixaForum-Barcelona_Catalonia.html", "text": "One of the most beautiful buildings in Barcelona, especially at night as a back drop to the magic fountain. Unfortunately we didn't have time to go inside. Despite it being up an incline there are escalators to aid tired legs!  ", "publishedDate": "2016-05-10", "language": "en", "rating": 5}, {"id": 370342254, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d257528-r370342254-CaixaForum-Barcelona_Catalonia.html", "text": "The Goya was worth the ticket but so was the rest of this really interesting place.  Saw a couple of local artists just starting their work with some sketching and water colours - passed the same guys later and what a difference a couple of hours make!  I really enjoyed this place for its calm serenity.", "publishedDate": "2016-05-05", "language": "en", "rating": 4}, {"id": 368360274, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d257528-r368360274-CaixaForum-Barcelona_Catalonia.html", "text": "interesting place for people interested in contemporary and socially engaged art.\nVery interesting architecture.\nI recommend", "publishedDate": "2016-04-28", "language": "en", "rating": 5}, {"id": 365851544, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d257528-r365851544-CaixaForum-Barcelona_Catalonia.html", "text": "This place is amazing. Impressive from outside to inside where you can find some of the most quality art gallerys (always changing). Some days ago I was there enjoyig the impressionist gallery from the Phillips collection. WOW!! Monet, Picasso, Van Gogh O'Keen... GREAT!\nPuig i Cadafalch is some of the best modernist architects, who was guided for Domenech i Montaner (Palau de la música catalana) which is a genious who also teched Anotni Gaudí.\nDon't miss this place in barcelona, next to the montjuic fountains, you'll remember it!!", "publishedDate": "2016-04-20", "language": "en", "rating": 5}, {"id": 358786612, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d257528-r358786612-CaixaForum-Barcelona_Catalonia.html", "text": "I think this is the only museum or exhibition centre which Opens on Monday. The space is nice to see and it always have some interesting exhibitions going on. Besides,  if you have a debit or credit card from La Caixa,   it is completely free! ", "publishedDate": "2016-03-26", "language": "en", "rating": 5}, {"id": 355350769, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d257528-r355350769-CaixaForum-Barcelona_Catalonia.html", "text": "From March to June there is an extraordinary exhibition of some of the best artists the world has known from the nineteenth and twentieth centuries that are part of the Phillips collection from the USA. Whether you like Monet, Manet, Braque, Picasso, Cezanne, Mogdiliani or Kaplinsky thete is something in this exhibition for you! Tickets 4 euro! There is also a cafe/restaurant for lunch or a snack. Don't miss this one!", "publishedDate": "2016-03-14", "language": "en", "rating": 5}, {"id": 350973333, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d257528-r350973333-CaixaForum-Barcelona_Catalonia.html", "text": "interesting modernist building, and old factory. now belong to a foundation that do very interesting exhibition for free. completly recomendable", "publishedDate": "2016-02-25", "language": "en", "rating": 5}, {"id": 344942715, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d257528-r344942715-CaixaForum-Barcelona_Catalonia.html", "text": "Went to visit the Le Brun exhibition from the Louvre. Lots of staff running around but none could be bothered to sell me a ticket so I will go elsewhere.", "publishedDate": "2016-02-04", "language": "en", "rating": 1}, {"id": 342334975, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d257528-r342334975-CaixaForum-Barcelona_Catalonia.html", "text": "The museum is located in the old Casarramona textile factory, designed by Josep Puig i Cadafalch who combined the modernism style with functionality of the building that was inspired by medieval castles. Today it is premier arts and cultural center with a programme filled with music, arts, poetry and literary events and a celebrated contemporary art collection.", "publishedDate": "2016-01-24", "language": "en", "rating": 5}, {"id": 342105396, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d257528-r342105396-CaixaForum-Barcelona_Catalonia.html", "text": "This fabulous building accross from the Magic Fountain is a remodeled modernist building well worth seeing not only for the building but also for the wonderful and extremely varied.exhibitis.", "publishedDate": "2016-01-23", "language": "en", "rating": 5}, {"id": 339431863, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d257528-r339431863-CaixaForum-Barcelona_Catalonia.html", "text": "I love modernist architecture, I love barcelona and I appreciate good museums, art and architecture. \n\nWhile generalisations are always bad it is probably fair to say that the standard in what ever barcelona does is typically really quite high (and I am not even a spaniard/Catalan). I also heart a lot about La Caixa as almost a \"world class institution\" ( as least I consider them highly) but I was actually severely disappointed by CaixaForum in Barcelona.\n\nWent there today for the first time and they had three expositions ;\n\n1) something on modern art - one small room and really pathetic - can't believe CaixaForum set's up something so basic like that\n\n2) drawings in/about Versailles - was ok, a bit boring as just carbon drawings and while perhaps not exactly what I appreciate the most, I didn't think it was anything impressive at all but was acceptable and therefore ok\n\n3) something on Egypt, power symbols and Falcons - admittedly this part was quite ok and interesting collection of artefacts ! Was worth visiting - nothing really memorable and really impressive on the whole but was nice and would recommend. However this section did have a very odd, confusing and strange layout - and walking through made the whole experience quite a bit less optimal and didn't do justice to the pieces or art and artifices on show. It was 15-17 degrees outside (so neither warm not cold) - the permanent air conditioning quite noisy and the ceiling giving an odd feeling to the whole experience. There was definitely an uncomfortable atmosphere in a building that is relatively new / newly refurbished.\n\nI really love modernistic buildings - and especially all those in barcelona, I also love good industrial architecture and the work of good architects, but this was one of the very few buildings I have seen in my life that have actually let me down. Not a nice building to start with (really hard to say for barcelona but that is actually true for this old factory). I have seen fantastic conversions of great industrials buildings and like those a lot but this one is just horrible and a huge disappointment in terms of building, cozyness and suitability for a museum - the architect was this conversation did really an unimpressive work - in fact a lousy work.\n\nAlso, the whole forum is more geared towards the \"mass market\" and kids playground and experience - absolutely nothing wrong with that but just keep that in mind in case you where expecting something more  exquisite  and impressive. But even in that mass market/kids space I have seen much more memorable and enjoyable buildings and forums/museums.\n\nI am very sorry to say - but this building and forum was a huge let down and real disappointment. I could hardly believe Caixa is behind that and suggest some serious thought on improving the site/building and artistic layout of expositions - all quite substandard and cheap  really.\n\nI won't go there again and can not recommend going to this one - really plenty of really phantastic stuff one can do and see in barcelona but this one you can skip in my opinion.\n", "publishedDate": "2016-01-12", "language": "en", "rating": 2}, {"id": 338745672, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d257528-r338745672-CaixaForum-Barcelona_Catalonia.html", "text": "The exhibitions here are real exhibitions interesting for the locals as well. If you are looking for actual art and historical exhibitions that are something new, then this is the place to go. Certainly no Louvre, but among the best Barcelona has to offer.", "publishedDate": "2016-01-09", "language": "en", "rating": 5}, {"id": 330200218, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d257528-r330200218-CaixaForum-Barcelona_Catalonia.html", "text": "Always interesting exibitions. There are six or seven exhibition rooms with different exibitions. Always something interesting. The building is also very nice. ", "publishedDate": "2015-12-01", "language": "en", "rating": 4}, {"id": 329520534, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d257528-r329520534-CaixaForum-Barcelona_Catalonia.html", "text": "Well worth a visit, this Forum is part of Barcelona’s well deserved reputation as a city of culture and arts. The artefacts from the Egyptian period, many borrowed from the Le Louvre for the first – and possibly last time – are particularly interesting, especially the carved statues, some of which weighed five tons", "publishedDate": "2015-11-28", "language": "en", "rating": 4}, {"id": 327658177, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d257528-r327658177-CaixaForum-Barcelona_Catalonia.html", "text": "There were two temporary exhibitions on when I visited. One was of experimental modern works that really were not to my taste. The second was devoted to exploring the role of animals in the cultural & religious life of ancient Egypt. This exhibition might have been interesting if the descriptions and explanations had been available in English as well as Catalan & Spanish. They were not. ", "publishedDate": "2015-11-18", "language": "en", "rating": 3}, {"id": 316327138, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d257528-r316327138-CaixaForum-Barcelona_Catalonia.html", "text": "Its close to Font Magica Montjuic, its a bit small but the best park is that you can go the roof which is a bit buit in waves, Also there are regular expositions. The children use to gather there and pratice dance moves in front of it.", "publishedDate": "2015-10-05", "language": "en", "rating": 4}, {"id": 316282043, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d257528-r316282043-CaixaForum-Barcelona_Catalonia.html", "text": "We went here to see the vertical garden outside. It is so cool to see and photograph. We went inside the caixa forum to check out the cool interior and gift shop. We didn't go into any exhibits. Don't forget to take a pee break here. You won't regret it😜", "publishedDate": "2015-10-05", "language": "en", "rating": 4}, {"id": 315123171, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d257528-r315123171-CaixaForum-Barcelona_Catalonia.html", "text": "Interesting building, and obviously some great exhibitions are shown here.  Unfortunately our visit was \"between exhibitions\".  We went there because of signing up to the Barcelona Card - otherwise would not have known of its existence - which would have been better in the circumstances.", "publishedDate": "2015-09-30", "language": "en", "rating": 2}, {"id": 308932448, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d257528-r308932448-CaixaForum-Barcelona_Catalonia.html", "text": "I visited Caixa Forum on September 10,2015.  I mention the date because few exhibitions were open today.  Some were being installed others were closed for renovations.  So anyone planning a visit in the  next few weeks should be forewarned.  That said the building, a modernista textile factory designed in the early 20th century, makes a visit worthwhile.  The design is impressive as is the history of the building and its architect.", "publishedDate": "2015-09-10", "language": "en", "rating": 4}, {"id": 307715299, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d257528-r307715299-CaixaForum-Barcelona_Catalonia.html", "text": "every time i'm in town, i try to go to caixa forum. beside the great selection of art shows, they have a super cool book shop where i like to buy a few books that are hard to find else where (catalan comics and such). they also have a cute little bistro worth visiting. ", "publishedDate": "2015-09-07", "language": "en", "rating": 5}, {"id": 306889144, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d257528-r306889144-CaixaForum-Barcelona_Catalonia.html", "text": "If you are in Barcelona, check the temporary exhibitions in Caixa Fórum. It is next to Plaza de España and they usually have worth things to see. Also very cool family activities for children! ", "publishedDate": "2015-09-04", "language": "en", "rating": 5}, {"id": 300289896, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d257528-r300289896-CaixaForum-Barcelona_Catalonia.html", "text": "I took the chance whenever I had time to have a look to CaixaForum and the touring exhibitions. The architecture is worth to see it and it is close to Placa Espanya.", "publishedDate": "2015-08-17", "language": "en", "rating": 4}, {"id": 290830786, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d257528-r290830786-CaixaForum-Barcelona_Catalonia.html", "text": "Very nice exhibit to see original drawings done by the Pixar illustrators. I was traveling from the USA and really enjoyed seeing this artwork in an international forum.  Great exhibit space.", "publishedDate": "2015-07-20", "language": "en", "rating": 4}, {"id": 279861884, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d257528-r279861884-CaixaForum-Barcelona_Catalonia.html", "text": "This is not the only Caixaforum Museum, and we were very happy, that a bank is sponsoring such places. The building itself is a former modernist textil factory, beuatufully renovated. The exhibitions are very good.", "publishedDate": "2015-06-13", "language": "en", "rating": 5}, {"id": 270113425, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d257528-r270113425-CaixaForum-Barcelona_Catalonia.html", "text": "CaixaForum occupies a stunning modernist former textile factory. Well worth following the signs to the rooftop for a unique view of the buildings and surroundings.\n\nThere are always reasonably priced exhibitions on at this excellent cultural institution and we got very lucky when we visited as there was a 25 years of Pixar exhibition running. This is on until May 2015 (but do check).\n \nThis exhibition alone was worth seeing with huge amounts of materials including some absolutely jaw droppingly good artwork on display. Held the attention of my child and her two cousins for an hour or so.\n\nAlso saw a small free exhibition about artists with ASD which was fascinating.\n\nVisited the cafe which was typically (for art/cultural type places) trendy but served good quality cakes and drinks.\n\nAll in all definitely worth a visit.", "publishedDate": "2015-05-05", "language": "en", "rating": 5}, {"id": 265758649, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d257528-r265758649-CaixaForum-Barcelona_Catalonia.html", "text": "The guidebooks say it is free to visit...but apparently not...it is free if you want to wander around. The exhibits were of little interest and signage was poor and so we did not pay to see them.\n\nWe did not find our way to the Modernista Terrace - I did not see any signage - that alone may have redeemed the visit.\n\nThe building exterior is interesting Modernista architecture.\n\nThe site could be better curated for the visitor. I did not see anyone outside the lobby area who could assist us.\n\nDisappointed and confused.", "publishedDate": "2015-04-14", "language": "en", "rating": 2}, {"id": 264378051, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d257528-r264378051-CaixaForum-Barcelona_Catalonia.html", "text": "We went to Caixa forum on a Saturday morning close to opening time and it was not yet very busy. The Pixar expo was a little disappointing for our kids (12, 11 and 6). My advice is to get there early as it got very busy around 12:00 pm when we left. It was a very cheap attraction though so check out what's on (Pixar ends on May 3rd).", "publishedDate": "2015-04-07", "language": "en", "rating": 3}, {"id": 263928664, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d257528-r263928664-CaixaForum-Barcelona_Catalonia.html", "text": "The CaixafForum is located at the bottom of Montjuic and the magic fountain. The building is an old textil factory with a very modernist architecture. The building worth yet the detour, and is accessible freely. \nRooftop is a must.\n\nThe place has been converted in a cultural centre. \nPrice to access the expositions seems to be democratic.\n\n-Pixar 25 years- will last until May 2015. \nA nice exposition presenting original materials from last 25 years of the company. Interesting, but don't be trapped, if your children are young, this will not generate lot of interest unless you take time to explain them how animated cartoons are build from scratch. \nYessss, lot of drawings, few clay models for 3D modelisation and two areas were retrospective videos are presented (where you will end up the most with the kids).\n\nGood one, but I would see it more for young and less young adults !\n\nEasy access by public transports, plan 1 hour or more depending of your pace/interest during the visit.", "publishedDate": "2015-04-06", "language": "en", "rating": 4}, {"id": 256828299, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d257528-r256828299-CaixaForum-Barcelona_Catalonia.html", "text": "The architecture of the building is what strikes you at first glance!..an interesting flight of stairs takes you inside the building and you wonder..how cool is that!..well this is just the beginning...the exhibits inside are equally captivating. Totally worth a visit.", "publishedDate": "2015-02-27", "language": "en", "rating": 5}, {"id": 246562323, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d257528-r246562323-CaixaForum-Barcelona_Catalonia.html", "text": "Fabulous! Great exhibits plus interactive stuff for little ones--or adults. Loved the variety of art presented and the architecture of the building itself. ", "publishedDate": "2014-12-30", "language": "en", "rating": 4}, {"id": 240033491, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d257528-r240033491-CaixaForum-Barcelona_Catalonia.html", "text": "Excellent exhibitions,  not only paínts, but photography, archeology, architecture, and others. All these inside a modernist building, first a factory, then a police station, and now a Exhibition Center. Entry costs about 5$. There're conferences, concerts, as well as other activities. Besede Plaza España and Catalonian National Museum of Arts, it deserves a visit.", "publishedDate": "2014-11-16", "language": "en", "rating": 5}, {"id": 237324740, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d257528-r237324740-CaixaForum-Barcelona_Catalonia.html", "text": "This was by far my favorite exhibit. It made me very compassionate to the plight of those who live in war torn countries. I also enjoyed the modern presentations throughout the museum.", "publishedDate": "2014-10-31", "language": "en", "rating": 5}, {"id": 234901811, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d257528-r234901811-CaixaForum-Barcelona_Catalonia.html", "text": "It is an interesting museum with different temporal exhibitions. Apart of the exhibitions, you can also visit the building, which has a great architecture.", "publishedDate": "2014-10-17", "language": "en", "rating": 4}, {"id": 233016708, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d257528-r233016708-CaixaForum-Barcelona_Catalonia.html", "text": "I visited the Caixa Forum as part of a conference meeting and unfortunately cannot comment on the exhibition. However, I had the opportunity to explore the building itself which is absolutely worth a visit. It is an impressive example of industrial design from the early 20th century. It was originally build as a textile factory and only reopened as a museum in the early 2000th. It is a very good example of how to reuse such a historic landmark without completely losing the original spirit of the building.", "publishedDate": "2014-10-07", "language": "en", "rating": 4}, {"id": 229137426, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d257528-r229137426-CaixaForum-Barcelona_Catalonia.html", "text": "We went to the CaixaForum specifically to see the Sorolla Exhibition. Sorolla is one of our favorite painters and there were many wonderful paintings in the exhibition. Most of them were from the Sorolla Museum in Madrid, which we visit often.", "publishedDate": "2014-09-15", "language": "en", "rating": 5}, {"id": 224918738, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d257528-r224918738-CaixaForum-Barcelona_Catalonia.html", "text": "When you are in the street you hardly notice the bulding. If you take the escalator down you suddenly find yourself in a very modern arts centre with lots of different activities and films. Ok you must pay for most of that but you can wonder around for free. If you take the elavator up to the roof, you can wander around and see some very nice architecture.The views are also good. Its just opposite the national museum and the magic fountain so if you are there pop in for a free look. I enjoyed it", "publishedDate": "2014-08-27", "language": "en", "rating": 4}, {"id": 218269206, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d257528-r218269206-CaixaForum-Barcelona_Catalonia.html", "text": "This is our second time attending an art exhibition at the Caixa Forum. Excellent space, a great Art Nouveau (Modernista) building. Not only is the building interesting but the exhibitions are well curated. There is a rooftop terrace which is also great space...\n\nEasy to be there... easy to get to.... and interesting shows! Off the beaten track of the major Barcelona musems so a bit of a treasure!", "publishedDate": "2014-07-29", "language": "en", "rating": 4}, {"id": 213637321, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d257528-r213637321-CaixaForum-Barcelona_Catalonia.html", "text": "This modern exhibition site is in a gorgeous Modernista building with contemporary additions and houses world-class temporary shows. These included works on loan from the Prado or MoMA in NYC. They have great public programs, a book shop and cafe. A must-see for any art lover visiting Barcelona!", "publishedDate": "2014-07-04", "language": "en", "rating": 5}, {"id": 212068311, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d257528-r212068311-CaixaForum-Barcelona_Catalonia.html", "text": "It doesn't get much cheaper than that, in this big tourist trap called Barcelona. Entrance was about 4 Euros per person.\nIt started quite well with an interesting exhibition of the Hellenic culture. I've seen these all around Europe, but I really like the complete artifacts and the explanations in English.\nThan, we saw a small modern exhibition, that took no more than 30 minutes to complete, and while some of it was interesting (it was about the life of the  modern working man), the other part was, ehh, too modern. And then, it was over, since they had one more exhibition that was closed, but nonetheless, the price was full, as usual in Barca.\nWe had a refreshing breakfast in the buffet and took off.\nWe spent there about 1.5-2 hours, including the meal. The museum is actually an old factory, a nice thing thing to see and ponder about, but this is far from a must for a foreign tourist.\nThe Forum is very close to Montjuic, so you can plan your trip  accordingly.", "publishedDate": "2014-06-25", "language": "en", "rating": 2}, {"id": 205678987, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d257528-r205678987-CaixaForum-Barcelona_Catalonia.html", "text": "This Forum, housed in an old factory building is indeed an experiment to couple materialism with culture. Fortunately when I visited this museum it was running an exposition on Europe. The main picture of Europa riding the bull was capable to lure even an uninitiated to inquire what it was all about. Of course, one should have leisurely time and orientation to admire such exhibitions, the advantages of this center are its central location, pleasing and functional architecture and lucid presentation. Though most of it is in Spanish, on the entrance you find a brief that contains good introduction in English. The layout and information modules are well thought and effectively presented.\nBefore you leave this museum, it may help you to unwind if you drop into museum's cozy cafeteria. In all, Caixa Forum is an enjoyable break from the sight seeing spectacle that crowd Barcelona. And if the Forum is hosting an exhibition on a subject of your interest, it will be the bonus.", "publishedDate": "2014-05-15", "language": "en", "rating": 4}, {"id": 203737204, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d257528-r203737204-CaixaForum-Barcelona_Catalonia.html", "text": "We went there because it is included in the Barcelona Card.\nThe building is interesting to visit.\nThe expositions are not worth the visit.\nIt is not free.\nCan be skipped", "publishedDate": "2014-05-02", "language": "en", "rating": 3}, {"id": 195032685, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d257528-r195032685-CaixaForum-Barcelona_Catalonia.html", "text": "A-hundred-year-old factory building transformed into a cultural centre by Arata Isozaki, this is an interesting complex for architects. One of the main exhibitions at the site was on Le Corbusier during our visit and include many original drawings, painting and models, which we enjoyed. The entrance is free to the building but not to the exhibitions.", "publishedDate": "2014-02-22", "language": "en", "rating": 4}, {"id": 188230686, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d257528-r188230686-CaixaForum-Barcelona_Catalonia.html", "text": "We enjoyed CaixaForum, but as someone else noted it's not free unless you are a customer of CaixaBank.  Nevertheless 4 euros isn't much of an impediment.  We liked the Japonisme exhibit in particular, and wandering around the buildings.  Unfortunately half the galleries were closed.\n\nNote most of the exhibits in the Japonisme part were only in Catalan and Spanish.  Photography is prohibited, and sometimes my attempts to use Google Translate to translate the signage to English (which combined with my poor spanish skills were enough to understand the signs) were shut down by guards. \n\nI would make this a second tier site - if you have enough time and you want to walk around the park, and you've already been to the museum at the top of the hill (Palau Nacional), then go to CaixaForum.", "publishedDate": "2013-12-21", "language": "en", "rating": 4}, {"id": 181500232, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d257528-r181500232-CaixaForum-Barcelona_Catalonia.html", "text": "The museum is 4 euro, and is not free as advertised. Signage is also not helpful in showing costs. We skipped to go to other museums included in the ArTicket. ", "publishedDate": "2013-10-18", "language": "en", "rating": 1}, {"id": 179430949, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d257528-r179430949-CaixaForum-Barcelona_Catalonia.html", "text": "Having been drawn to the \"Japonisme\" exhibition poster that we see around town, we tracked it down to this museum/gallery space that is owned by Caixa Bank. Upon arrival we were amazed by how not-crowded it was considering it was a Sunday. There was 4 exhibitions on offer which can all be admitted with a one ticket at 4€/Adult. The Japonisme exhibition was very interesting and we spent a good 2 hours just on this exhibition alone. Caixa Forum itself is a very well built exhibition space. It's worth a visit if you have some spare day to do things beyond the usual Barcelona itinerary. The downside is that information in English is very limited.", "publishedDate": "2013-10-02", "language": "en", "rating": 4}, {"id": 178629645, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d257528-r178629645-CaixaForum-Barcelona_Catalonia.html", "text": "Admission was not free for us, four euros per person. We visited two exhibitions, one on the influence of japanese culture on european art (which was very interesting, although lacking in english written displays), the other on contemporary catalonian art (which was a bit 'out-there' for our tastes, although tastefully displayed). We also had lunch, which was a surprisingly decent set menu for $12 a person for three courses including drinks.", "publishedDate": "2013-09-25", "language": "en", "rating": 4}, {"id": 175784056, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d257528-r175784056-CaixaForum-Barcelona_Catalonia.html", "text": "There are not too many places for free in Barcelona, but this is one of them. A cultural center where to see many different exhibitions, paintings, sculptures, photographies... Many different artists, even really famous ones!\nIf you like art, you cannot miss it!", "publishedDate": "2013-09-04", "language": "en", "rating": 5}, {"id": 174120777, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d257528-r174120777-CaixaForum-Barcelona_Catalonia.html", "text": "As of May 2013 all Caixa attractions (e.g. Caixa Forum, Cosmo Caixa) in Barcelona are paid (4€/adult, no student discount), therefore most printed Barcelona guides are outdated.\n\nAs we are not art fans,we didn't found it interesting - majority of exhibitions are those \"alternative-weirdo\" pieces.\n\n", "publishedDate": "2013-08-26", "language": "en", "rating": 2}, {"id": 173194943, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d257528-r173194943-CaixaForum-Barcelona_Catalonia.html", "text": "At 4 Euros, this is not a place to miss. Unless of course you only speak English. There was 2 signs that gave English explanations of the art and the rest only had Catalan or Spanish. I do wish the person at the front would have warned me about not being able to know anything about the art. \n\nThe modern art area was by far the most interesting to me (because of the language barrier) and had a hilarious surrealist dress up area. I wish they sold them as clothes. Still a nice place in a good area. It could easily be paired with seeing the Miro museum nearby and the Olympic stadium.", "publishedDate": "2013-08-20", "language": "en", "rating": 3}, {"id": 170415474, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d257528-r170415474-CaixaForum-Barcelona_Catalonia.html", "text": "Caixa Forum is well worth a visit depending on the exhibitions they currently have. We were lucky to have been able to catch the Georges Melies exhibit - absolutely brilliant! They also had an exhibition on Japonisme which was also well curated and interesting. The building is also very nice, but probably not worth a trip unless they have an exhibition that you're interested in.", "publishedDate": "2013-08-02", "language": "en", "rating": 5}, {"id": 167918223, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d257528-r167918223-CaixaForum-Barcelona_Catalonia.html", "text": "We thoroughly enjoyed our visit and the two exhibits: a small one on identity and another on Japonisme. Very different and yet complementary.", "publishedDate": "2013-07-17", "language": "en", "rating": 4}, {"id": 166926567, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d257528-r166926567-CaixaForum-Barcelona_Catalonia.html", "text": "This urban space is located in Montjuic, near the MNAC.\nI always visit it when I am in Barcelona because it always has some exhibition of my interest. And I have to note that it is entrance free, something to have into account in a city in wich the visit of monuments or museums is so expensive. You can easily reach there  by metro or bus.", "publishedDate": "2013-07-09", "language": "en", "rating": 3}, {"id": 166055091, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d257528-r166055091-CaixaForum-Barcelona_Catalonia.html", "text": "Its not a touristic attraction per say. Its an exhibition inside a \"historical\" building. The view on the roof is worth seeing. on the roof you can see the catalunian art museum (which is closed on Monday) Its very close from Plasa catalunia ", "publishedDate": "2013-07-02", "language": "en", "rating": 2}, {"id": 164783578, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d257528-r164783578-CaixaForum-Barcelona_Catalonia.html", "text": "I was there for the second time and i had lots of fun. It's a interseting place to visit both for children and adults, lot's of things to learn and better understand. The tropical forest build inside is very interesting, the fishes are just spectacular to see and if you want to visit i recomend that you take at least 3 hours because there are lot's of things to do and see. Enjoy!", "publishedDate": "2013-06-22", "language": "en", "rating": 5}, {"id": 163212932, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d257528-r163212932-CaixaForum-Barcelona_Catalonia.html", "text": "Cheap at four euros for two exhibitions. The sign of a good musuem is getting you interested in something/ someone youve never heard of. This delivered in every way. Interesting and engaging. ", "publishedDate": "2013-06-06", "language": "en", "rating": 5}, {"id": 162886627, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d257528-r162886627-CaixaForum-Barcelona_Catalonia.html", "text": "Our guidebook suggested this was a great place to hang out, but it was very quiet when we were there. Perhaps it's better for locals. Worth walking up to rooftop for a look around, but not much info to tell you the history of the building. There were exhibits going on, but none were free; even the cafe looked half closed. A missed opportunity.", "publishedDate": "2013-06-03", "language": "en", "rating": 2}, {"id": 160325240, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d257528-r160325240-CaixaForum-Barcelona_Catalonia.html", "text": "We originally had no intention of visiting this place as it was not so high on our list of things to do in our limited available time, but we are glad we did. The building itself is modern and of a quite different architectural style. the place is a museum and art gallery but is quite different to other galleries. We visited the Georges Méliès, The Magic of Film exhibition, which in itself is a must see exhibition of such fascination detailing just how clever such 'old time' filmmakers were and the equipment and methods they used to create early films and movies.\n\nThere were two other exhibitions featured while we were there, but time did not permit us to view in detail. It is very easy to get to, being located opposite to the Magic Fountain in the Montjuic area.", "publishedDate": "2013-05-10", "language": "en", "rating": 4}, {"id": 159471649, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d257528-r159471649-CaixaForum-Barcelona_Catalonia.html", "text": "This museum located in Montjuic, not far away from the more famous MNAC, is worth a visit.\nMaybe more than one, if you love contemporary art and avangarde exhibitions.\nIn the CaixaForum every kind of art colud find its place, from photography to  painting, from video installations to interactive exhibitions.\nEven the external structure is amazing.\nThe shop at the ground floor is so interesting with so many books about photography, street art, and design objects.\nThe museum also has lots of activities for kids, and a series of concerts and dj sets usually on friday night.\n\nHurry up, because from the 6th of May you will have to pay a small ticket to enter. Now the entrace is totally free.", "publishedDate": "2013-05-02", "language": "en", "rating": 5}, {"id": 158609922, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d257528-r158609922-CaixaForum-Barcelona_Catalonia.html", "text": "This is a beautiful example of an Art Nouveau factory building, renovated as a community space housing up to 5 different exhibitions of art. Really well done and with an undulating flat brick roof which provides great views. Quiet and peacefull compared with the surrounding area a real gem. Free admission.", "publishedDate": "2013-04-23", "language": "en", "rating": 5}, {"id": 157039828, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d257528-r157039828-CaixaForum-Barcelona_Catalonia.html", "text": "Modern art in an interesting former Modernist factory building. Art may not be to everyone's taste but lovely cool, white large spaces providing a contrast to a lot of Barcelona. Free entry and a nice cafe. ", "publishedDate": "2013-04-08", "language": "en", "rating": 4}, {"id": 156013425, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d257528-r156013425-CaixaForum-Barcelona_Catalonia.html", "text": "This magnificent exhibition space has almost no own-fund collections. They show from 3 to 5 rotating temporary collections and modern multimedia assemblies of many kinds, and usually one can find top quality art displayed in an interesting contemporary way.\nThe building itself is an old modernist factory, superbly reworked for its current use. \nCaixaForum makes me think that, also in art, what you pay is what you get, and the generous funds of this bank's Foundation seem expertly managed. Indeed, the admission is free.", "publishedDate": "2013-03-29", "language": "en", "rating": 5}, {"id": 155753406, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d257528-r155753406-CaixaForum-Barcelona_Catalonia.html", "text": "We visited CaixaForum when they happened to have a couple of very interesting and beautiful exhibitions on. The first, \"What to Think. What to Desire. What to Do.\" was an absolutely stunning display of colour and thoughtfulness. So much so that we returned another day to bring some friends to see it. The second exhibition on at the time was Seduced by Art: Photography Past & Present which was also magical. The images were haunting and heartwarming and interesting and breathtaking... absolutely top rate stuff. We also saw that they are going to be hosting a Georges Méliès exhibition (April-June 2013) which we are SO tempted to go back for! \n\nThe building is lovely and open and the gift shop is overflowing with lovely, thoughtful treats. \n\nAnd all of this is completely FREE! I honestly did not expect it to be quite so wonderful and I was more than pleasantly surprised. Do yourself a favour and make it a point to support art (and free access to it) by visiting CaixaForum when in Barcelona!", "publishedDate": "2013-03-26", "language": "en", "rating": 5}]}}]