[{"locationId": 528113, "name": "Manzana de la Discordia", "placeType": "ATTRACTION", "reviewListPage": {"reviews": [{"id": 719136977, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d528113-r719136977-Manzana_de_la_Discordia-Barcelona_Catalonia.html", "text": "The design features and hand craftmanship are unbelievable.  There were no plans in the normal architecural sense and Gaudi aceived this with his personal invovlement on a daily basis.  A lot of the features he personally designed and cast like the door handles upwards. You need to allow at least 2 hours or preferable half a day to take in all the detailed features. Book on line the day before and arrive early to beat the queues", "publishedDate": "2019-10-17", "language": "en", "rating": 5}, {"id": 690103565, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d528113-r690103565-Manzana_de_la_Discordia-Barcelona_Catalonia.html", "text": "But it does add to the overall Block of Discord experience.\nAll of Barcelona (Especially the subways) have pick pockets) so you have to be careful.\nThis is a must stop along your Barcelona travels.", "publishedDate": "2019-07-16", "language": "en", "rating": 5}, {"id": 689589232, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d528113-r689589232-Manzana_de_la_Discordia-Barcelona_Catalonia.html", "text": "I’ve got no idea why this attraction is name Manzana de la Discordia, or the apple of discord except that it’s an allegory to the fateful judgement of Paris in choosing the most beautiful of the Catalan Modernist buildings on this stretch of Passeig de Gracia. On this road, you can see the magnificent Casa Amatller, Casa Bonet, Casa Mulleras, Casa Lleó i Morera and Casa Batlló.\n\nMost people will only know about Casa Batllo and reasonably so for it’s fame, but don’t know about the other fine examples of Catalan Modernism right next to it. So do keep your eyes open.\n\nIronically, it's easier to see all the houses on Manzana de la Discordia during winter because the trees laden leaves of the summer prevents you from getting a clear view from across the street.", "publishedDate": "2019-07-14", "language": "en", "rating": 5}, {"id": 686843805, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d528113-r686843805-Manzana_de_la_Discordia-Barcelona_Catalonia.html", "text": "Pickpocketed the other day right in front. Found out the same thing happened to several of our friends in this beautiful, but totally un-policed city on more than one occasion. Local police are useless and evidently laws are lax. They accept it as a daily part of life. Indefensible. Would have posted photos but cellphone was taken.", "publishedDate": "2019-07-04", "language": "en", "rating": 1}, {"id": 686580142, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d528113-r686580142-Manzana_de_la_Discordia-Barcelona_Catalonia.html", "text": "I was with my husband, not on tour. The area was busy, however we stepped away from where most of the people where, and my wallet & phone were taken from my purse, which I was holding against my body. Don't ask me how, I didn't feel anything. My husband was right next to me as well.  BEWARE, I think it was 2 scruffy looking men in wrinkled navy suits, posing as security guards in front of 32 Morreau. WEAR A MONEY BELT!!!! IF POSSIBLE, LEAVE CREDIT CARDS, PASSPORTS, ETC. IN HOTEL SAFE.", "publishedDate": "2019-07-03", "language": "en", "rating": 1}, {"id": 681550072, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d528113-r681550072-Manzana_de_la_Discordia-Barcelona_Catalonia.html", "text": "This block on Passeig de Gracia contains buildings designed by five of Barcelona's most famous architects. The wildly different styles clash with each other, but make this street one of the most photographed points in Barcelona. A couple of blocks further along is Gaudi's famous La Pedrera.", "publishedDate": "2019-06-14", "language": "en", "rating": 4}, {"id": 675226361, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d528113-r675226361-Manzana_de_la_Discordia-Barcelona_Catalonia.html", "text": "Manzana de la Discordia, the \"Bone of Contention\" or the \"Block of Discord\", any way you express it or any way you look at it, this is indeed an area you need to visit. Some of Barcelona's, and Spain's most amazing buildings are on display here for the world to see. They are absolutely fantastic. It's as if Barcelona's most important Modernista architects agreed to have a competition to see who would impress the most. Architects with wildly different styles, have produced some stunning results. The buildings clash with each other and with those next to them and just about everywhere else. Hard to choose! All are winners!", "publishedDate": "2019-05-20", "language": "en", "rating": 5}, {"id": 672094549, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d528113-r672094549-Manzana_de_la_Discordia-Barcelona_Catalonia.html", "text": "This city block on Passeig de Gracia in the Eixample district has buildings designed by four of Barcelona's most important Modernista architects: Antoni Gaudi, Lluis Domenech i Montaner, Josep Puig i Cadafalch and Enric Sagnier.\n\nAs the four architects' styles were very different, the buildings from the early 20th century don't match with each other and the neighboring buildings. \n\nOn our visit, Casa Batllo was undergoing renovations and was covered. The area is very popular among tourists and there are long queues.", "publishedDate": "2019-05-07", "language": "en", "rating": 4}, {"id": 632604196, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d528113-r632604196-Manzana_de_la_Discordia-Barcelona_Catalonia.html", "text": "It is just great. Every building of different style. And one is more beautiful than the other. You have to see it on your own :)", "publishedDate": "2018-11-11", "language": "en", "rating": 5}, {"id": 624975783, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d528113-r624975783-Manzana_de_la_Discordia-Barcelona_Catalonia.html", "text": "Marvel at these magnificent 5 homes with different architectural styles.  Best to read about first or go with someone who can tell you about their history and point at especially fine points.", "publishedDate": "2018-10-15", "language": "en", "rating": 5}, {"id": 528451005, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d528113-r528451005-Manzana_de_la_Discordia-Barcelona_Catalonia.html", "text": "Must visit 'keeping up with the Joneses' block covering Nos 35 to 43 Pg de Gracia where competing early 20th century architects Montaner, Cadafalch and Gaudi showcased their \"Modernisme\" designs. Unique  and visually intriguing so has to be 5 circles!", "publishedDate": "2017-09-30", "language": "en", "rating": 5}, {"id": 311518437, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d528113-r311518437-Manzana_de_la_Discordia-Barcelona_Catalonia.html", "text": "Three consecutive buildings/houses, each one unusuall in it's own way. Combine all three and you get a very strange spectacle.\n\nWorth seeing.", "publishedDate": "2015-09-18", "language": "en", "rating": 4}, {"id": 286688405, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d528113-r286688405-Manzana_de_la_Discordia-Barcelona_Catalonia.html", "text": "as we don't appreciate or like the style of this, we chose not to enter the attraction.  area was very busy, with long queues.  not impressed and would not return", "publishedDate": "2015-07-08", "language": "en", "rating": 2}]}}]