[{"locationId": 6453867, "name": "El Poblenou", "placeType": "ATTRACTION", "reviewListPage": {"reviews": [{"id": 530980323, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d6453867-r530980323-El_Poblenou-Barcelona_Catalonia.html", "text": "We stay in this area often. Far enough for the tourist trap main area to get a local vibe but close enough to walk in to the tourist bits you want to visit. We love the walk along the beach front and Poblenou la Rambla is beautiful. In summer enough hustle and bustle to give this place a real good feeling. Lots of great places to eat and super markets for the essentials. \n\nThe beach at the bottom of la Rambla is great, busy but a lovely area of beach to set up camp at.  The locals come down late in the day when the finish work / school etc. \n\nA couple of decent shopping malls within walking distance (or tram) if you want to visit - Diagonal Mar or Glories with the later been the closest. \n\n", "publishedDate": "2017-10-08", "language": "en", "rating": 5}, {"id": 520100973, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d6453867-r520100973-El_Poblenou-Barcelona_Catalonia.html", "text": "The whole area has a village like feel. Wonderful restaurants on nearly every corner. Relaxed and friendly, fabulous bolt hole from the throng of the crowds. Beautiful beaches and Poble Nou Ramblas well worth a stroll down day or night. Where the locals meet and greet each other for a catch up. Intermingled along with tourists. \nAmbient relaxed and welcoming area. Perfect for families with or without young children. ", "publishedDate": "2017-08-31", "language": "en", "rating": 5}, {"id": 518369226, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d6453867-r518369226-El_Poblenou-Barcelona_Catalonia.html", "text": "Nice, but the outdoor restaurants are a bit pricey with small servings.  Travel to one of many seafood restaurants outside of the touristy areas", "publishedDate": "2017-08-28", "language": "en", "rating": 4}, {"id": 512104704, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d6453867-r512104704-El_Poblenou-Barcelona_Catalonia.html", "text": "We stayed in this lovely neighbourhood during our visit to Barcelona - so much more authentic than \"Las Ramblas\"\n\nFantastic choice of eateries & shops.\n\nPeople of all ages on all types of transport!!", "publishedDate": "2017-08-13", "language": "en", "rating": 5}, {"id": 507315775, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d6453867-r507315775-El_Poblenou-Barcelona_Catalonia.html", "text": "the perfect place to get away for the hectic and packed centre. You can enjoy the relaxed atmosphere and go to the beach which is closeby. \nDo not stay only on the rambla. Try to explore the rest of the barrio like the parallel street Maria Aguilo, which is pintoresc and has many hidden jems to shop and to have a bite. The food there costs half as much from what you would pay on the rambla. All in all it is a must if you want to have a relaxed but beautifu day away from the messy centre.", "publishedDate": "2017-07-31", "language": "en", "rating": 5}, {"id": 503282147, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d6453867-r503282147-El_Poblenou-Barcelona_Catalonia.html", "text": "A family friendly area to stay centred around its own bustling rambla, with beaches, public transport & green parks.", "publishedDate": "2017-07-18", "language": "en", "rating": 5}, {"id": 490556361, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d6453867-r490556361-El_Poblenou-Barcelona_Catalonia.html", "text": "The neighbourhood is very nice with a lot of small shops, bars and restaurants with a lot of local people. We stayed at the holiday inn express while enjoying Primavera festival. The main festival site at El Forum was about a 30min walk or a short tram / metro ride however as the metro stops earlier than the festival ends we hired bikes and found this the best way to get to and from the festival, no matter what time. The hotel has bike parking underground and it's safe to cycle from the festival as it's mostly off road cycle paths or wide foot paths. ", "publishedDate": "2017-06-05", "language": "en", "rating": 4}, {"id": 489234978, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d6453867-r489234978-El_Poblenou-Barcelona_Catalonia.html", "text": "Spend an hour or more strolling this neighborhood where there might be fantastic street art behind every knook and cranky. Lots of fun and easy streeet parking.", "publishedDate": "2017-05-30", "language": "en", "rating": 4}, {"id": 488610175, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d6453867-r488610175-El_Poblenou-Barcelona_Catalonia.html", "text": "Really enjoyed staying in Poblenou which was close to the beach and alot quieter than the centre of Barcelona. A nice 15 minute walk along the beach to the centre which was very relaxing .Really nice neighbourhood with alot going on when we stayed there but still within reach of the attractions. Lots of nice restaurants and bars and good transport links into the centre of the city.", "publishedDate": "2017-05-28", "language": "en", "rating": 4}, {"id": 487795620, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d6453867-r487795620-El_Poblenou-Barcelona_Catalonia.html", "text": "I'm so glad that we stayed at a Airbnb here. It was only 2 blocks from the Rambla where we would go to shop and eat!  Poblenou is a great community where you will see and hang out with the locals. It's not to far from the city center and you can take the Rambla down to the land cal beaches!!", "publishedDate": "2017-05-25", "language": "en", "rating": 5}, {"id": 482035412, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d6453867-r482035412-El_Poblenou-Barcelona_Catalonia.html", "text": "Nice and peaceful coastal neighborhood. It looks very well maintained and clean.  Here it is significantly quieter than the center and there are no crowds of people.", "publishedDate": "2017-05-06", "language": "en", "rating": 4}, {"id": 472912259, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d6453867-r472912259-El_Poblenou-Barcelona_Catalonia.html", "text": "I live in this area and have never ever regret it. It is super close to the beach but not as crowded as e.g. Barceloneta or Port Olimpic beaches. The neighborhood includes one of my favorite streets in the while city: Rambla de Poble Nou. it is the little sister of Las Ramblas, but so much better, with many nice restaurants, cafes and bars.", "publishedDate": "2017-04-05", "language": "en", "rating": 5}, {"id": 449333373, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d6453867-r449333373-El_Poblenou-Barcelona_Catalonia.html", "text": "This is the 3rd time i have stayed in this area - after a day sightseeing in main tourist areas of Barcelona it is great to come back here to eat or just enjoy the atmosphere\nwalking along the Ramblas (the main street). I have stayed with a friend , then my 15 year old daughter and then this Autumn the whole family came.The lovely beach is within walking distance , there is a great promenade area to walk along towards Barcelona - you discover lots of interesting places doing this and can stop at a beachfront bar (be warned lots of nude bathing - mostly old men!) The shops , restaurants , and bakeries are great in Poblenou and it just has a great atmosphere.Finally the metro is so easy from here - buy a T-10 card for about 10 euros gets you 10 trips and is fantastic value - metro is clean easy and very efficient.", "publishedDate": "2017-01-04", "language": "en", "rating": 5}, {"id": 429657918, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d6453867-r429657918-El_Poblenou-Barcelona_Catalonia.html", "text": "Just right for someone who doesn't want hussle and bustle, went there on a number of occasions and could still spend time there", "publishedDate": "2016-10-19", "language": "en", "rating": 5}, {"id": 428562442, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d6453867-r428562442-El_Poblenou-Barcelona_Catalonia.html", "text": "This area is one of my favorite places in Barcelona\nEl Poblenou encloses two very different areas: a traditional, fishermen low rise buildings, and a vibrant, avantgarde buildings. The latter is thanks to the 22@ district, the area in which tech and start ups started to migrate, and now comprises advertising firms, publishing houses and tv stations, as well a university campus (Pompeu) The beauty of the area, apart from being a cultural hub, is the cutting edge architecture -glass, edges, world-class authors, and the views.\nA short stroll around this area will wow you and convince you that Barcelona is not only old-Gothic quarter, but a vibrant, design-centric and forward-thinking city.", "publishedDate": "2016-10-16", "language": "en", "rating": 5}, {"id": 422218497, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d6453867-r422218497-El_Poblenou-Barcelona_Catalonia.html", "text": "This is quite less touristy area of Barcelona. But lovely place to visit. A lot of local restaurants. Highly recommended ", "publishedDate": "2016-09-25", "language": "en", "rating": 5}, {"id": 416490882, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d6453867-r416490882-El_Poblenou-Barcelona_Catalonia.html", "text": "Great neighbourhood with a lovely feel....away from manic tourist area but still close to attractions. Poblenou has great restaurants and bars, quick transport links (Yellow Line 4), a beautiful Rambla, gorgeous beaches, and a great laid back atmosphere. What more could you want. I love this barrio.", "publishedDate": "2016-09-09", "language": "en", "rating": 5}, {"id": 416473907, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d6453867-r416473907-El_Poblenou-Barcelona_Catalonia.html", "text": "We walked several times through the Poblenou quarter, on our way from the homonym metro stop to the Mar Bella / Nueva Mar Bella beaches. It was a pleasant walk. The neighbourhood is nice. Laid out as a square grid, roads are wide and well done. Lozenge-shaped crossings make it a bit less... straightforward for pedestrians. It has many parks and green areas, public sport areas - the park along the beachfront (Parc del Poblenou) is well endowed with jogging and bike tracks, play fields, even a large skate park. A very high mark for cleanliness, too. Many shops are maybe not what you expect in a city shopping mall, but even so of very good quality for everyday shopping. Even murals are artistic and pleasant to see, never just wall splotchings. All essential services are there, and it is well connected by public transport. Many restaurants and bars make it interesting also in the evenings...", "publishedDate": "2016-09-09", "language": "en", "rating": 4}, {"id": 409677093, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d6453867-r409677093-El_Poblenou-Barcelona_Catalonia.html", "text": "Take the metro to Poblenou and lose yourself in its quaint streets. The Rambla is dotted with trendy bars and restaurants which offer fabulous food at reasonable prices. Away from the regular tourist spots and with a decidedly original feel to it, Poblenou is fast becoming one of the preferred neighbourhoods for renting and buying near the beach.", "publishedDate": "2016-08-23", "language": "en", "rating": 5}, {"id": 388342136, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d6453867-r388342136-El_Poblenou-Barcelona_Catalonia.html", "text": "Just come back from another trip to Poblenou, and once again thoroughly enjoyed what the area has to offer.\nLas Rambla Poblenou has a vast array of good quality restaurants and shops, and within a few minutes you can walk to the well maintained beach which has good bar's", "publishedDate": "2016-07-02", "language": "en", "rating": 5}, {"id": 383719932, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d6453867-r383719932-El_Poblenou-Barcelona_Catalonia.html", "text": "Really felt you were in the real Spain here. Busy but with Spanish people going about their business. Totally safe to walk around, a great pedestrian area with loads of lovely bars and restaurants. Much nicer than La Rambla for a stroll. Stunning architecture.", "publishedDate": "2016-06-18", "language": "en", "rating": 5}, {"id": 378645566, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d6453867-r378645566-El_Poblenou-Barcelona_Catalonia.html", "text": "This neighborhood is located pretty far from main tourist sights, too far to walk anyway. On the other hand it is well connected via public transport. It is much cheaper to eat, and stay here than in El Gotico or its outskirts but the tradeoff is that the neighborhood is ran down in some places and under construction in others, no great sights when looking out the window. It certainly lacks the same kind of charm as the more central parts of the city. It is close to the beaches however, and has a more local feel, as there are far fewer tourists who make their way to Poblenou. The negative is the new architecture, used to \"revitalize\" the neighborhood is the inhuman modern brutalism that may look good in photographs but is impersonal and cold in person. There are quaint parts of the neighborhood for certain, like the rambla de Poblenou fo rinstance, but there also are parts of town that look or are abandoned... mixed bag.", "publishedDate": "2016-06-01", "language": "en", "rating": 3}, {"id": 362062236, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d6453867-r362062236-El_Poblenou-Barcelona_Catalonia.html", "text": "Love this area. Not too far from the city and good beach walk and the town offer omega good bars and restaurants and all much cheaper than the city. ", "publishedDate": "2016-04-06", "language": "en", "rating": 5}, {"id": 361179099, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d6453867-r361179099-El_Poblenou-Barcelona_Catalonia.html", "text": "Initially I felt let down when we arrived at the hotel however once we get to know the neighbourhood, we fall in love. Our hotel is located in the short walking distance to the Poblenou Rambles.  There are many shops, café and restaurants. We always use the Ramblas to walk down to the beach. The Rambles is calm at the same time lively. Very convenient location to get to the tourist attraction. We would stay again here when we are in Barcelona.", "publishedDate": "2016-04-03", "language": "en", "rating": 4}, {"id": 359629530, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d6453867-r359629530-El_Poblenou-Barcelona_Catalonia.html", "text": "I'm living Poblenou very best place I enjoy every moment if you are in Barcelona and looking one of beautiful residence Poblenou is perfect choice.\n", "publishedDate": "2016-03-29", "language": "en", "rating": 5}, {"id": 359385187, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d6453867-r359385187-El_Poblenou-Barcelona_Catalonia.html", "text": "We stayed in the travel lodge here and tended to walk to the rambles, which took about 45 minutes.  Some of the walking was down normal industrial/living streets so not very scenic, but if you walk towards the sea which isn't far, more scenic.  The main streets with the bars are great and come to life at night.  Nice place to stay and walk around, but whilst we didn't see anything bad some of the streets are very quiet so would recommend avoiding in the evening.", "publishedDate": "2016-03-28", "language": "en", "rating": 4}, {"id": 358780445, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d6453867-r358780445-El_Poblenou-Barcelona_Catalonia.html", "text": "STOPPED IN Poblenou for one week with my wife perfect position for visiting the city 5 min from metro , make sure you purchase the ticket with x10 trips on about 9 euro great value , X2 restaurants in Poblenou are a must the Italian  called Bellisimo on Poblenou central street and Doncurado a little further up also the coffee shop called La Boheme all great value for money we stopped in Travel Lodge my advice if your stopping any longer than X2 days go for something more traditional no character at the Lodge Get a ticket for the cable cars be aware there are two lots make sure it's the correct one you require do the research first all in all Barcelona great City loads to do and didn't find it to hard to get good value for your cash ", "publishedDate": "2016-03-26", "language": "en", "rating": 4}, {"id": 340013660, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d6453867-r340013660-El_Poblenou-Barcelona_Catalonia.html", "text": "Pueblo Nuevo (or Poblenou in Catalan) was once known as an industrial zone which grew in the 19th century due to the cheap land and available water from the sea and the river Besos. It was completely changed during the preparation for the Olympic Games as the train track (which separated the district from the sea) was removed and a string of beaches was designed all the way from the Olympic port to the mouth of the river Besos. This is a very good base for exploring the city, far from the city crowd, but very well connected and close to the beach and the seafront.", "publishedDate": "2016-01-14", "language": "en", "rating": 5}, {"id": 336033490, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d6453867-r336033490-El_Poblenou-Barcelona_Catalonia.html", "text": "Nice place for a walk, loads of restaurants everywhere, if you are near Diagonal ave, you can walk all the way to the beach in less then 20 minutes, doesn't meter what you are looking to eat, here you will find , from small groceries to fancy restaurants. The peatonal also have a bike lane by the side, so you can cycle from diagonal to the beach. Very safe neighborhood.", "publishedDate": "2015-12-30", "language": "en", "rating": 4}, {"id": 333433134, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d6453867-r333433134-El_Poblenou-Barcelona_Catalonia.html", "text": "Great place to stay when visiting Barcelona - it's away from the main tourist areas but still really easy to get into the city , you have a choice of the bus, taxi or the metro. Take a stroll up and down the rambla poblenou and take in the very friendly relaxed atmosphere. Lots of great restaurants and shops, explore some of the side streets. At the end of the rambla across the road you will discover a park area and then a great beach. If you plan on eating out then save it for here rather than when you're in the city as you will pay a third of the price and get better food. It's very family friendly.", "publishedDate": "2015-12-16", "language": "en", "rating": 5}, {"id": 331648145, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d6453867-r331648145-El_Poblenou-Barcelona_Catalonia.html", "text": "its a residential area with a terrible smell!really to be avoided during summer!there is nothing worth seeing and,....have I mentioned the smell???", "publishedDate": "2015-12-09", "language": "en", "rating": 2}, {"id": 330556865, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d6453867-r330556865-El_Poblenou-Barcelona_Catalonia.html", "text": "Found this area by chance. Great little restaurants, organic food shops, wine shops and of course the beach! Outstanding ", "publishedDate": "2015-12-03", "language": "en", "rating": 5}, {"id": 322383642, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d6453867-r322383642-El_Poblenou-Barcelona_Catalonia.html", "text": "At the end of the long walk on Las Ramblas in Poblenou, you end up at Glories, you pass the tram line and come across the most bizarre indoor market which stocks everything you'll ever need.  Furniture, antiques, food and more.  A lovely place to rummage and you could spend the whole day there if you are a keen bargain hunter.", "publishedDate": "2015-10-27", "language": "en", "rating": 5}, {"id": 319896169, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d6453867-r319896169-El_Poblenou-Barcelona_Catalonia.html", "text": "We love walking in Poblenou. There are lots of things to do around and it's walking distance to the beach while being in the tradicional rambla. Lots of nice restaurants where to eat and dine.", "publishedDate": "2015-10-18", "language": "en", "rating": 4}, {"id": 316420617, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d6453867-r316420617-El_Poblenou-Barcelona_Catalonia.html", "text": "This place is between my hotel to the beach and really lively and lovely place. Plenty of place to eat and drink.\nIf you are near by good to visit. ", "publishedDate": "2015-10-05", "language": "en", "rating": 4}, {"id": 313762185, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d6453867-r313762185-El_Poblenou-Barcelona_Catalonia.html", "text": "Very good district in Barcelona.  Very near tk the beaches is a great way to get more relaxed holidays, plus if you want yo gk tk the center of Barcelona is very easy to get the metro.", "publishedDate": "2015-09-26", "language": "en", "rating": 4}, {"id": 313568353, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d6453867-r313568353-El_Poblenou-Barcelona_Catalonia.html", "text": "A lot of artist studios, with loads of interesting graffiti work. Plenty of hand made furniture and very good prices.", "publishedDate": "2015-09-25", "language": "en", "rating": 4}, {"id": 311346967, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d6453867-r311346967-El_Poblenou-Barcelona_Catalonia.html", "text": "There is a quiet transformation taking place in the industrial area of Barcelona. Large open spaces that used be warehouses are being rented or bought by designers and artist and made into artist studios and design centres. Walking around for a day, I got the sense that the area is on the brink on becoming popular. \n\nThe spaces are not imposing shop fronts, and you won't find branded outlets, if that's your thing. Instead, the fronts are discreet and out the way. There is a map of the area I would encourage you to use (found in any of the shops) and don't be put off by the graffiti. In actual fact, once you start walking around, I would be very surprised if you're not at least a little impressed by some of the graffiti work which in my view offers further artistic coolness to the place. \n\nYou will be impressed by the hand made furniture to the various studios rented by artists and designers, and if art is your passion you are sure to find an unusual and highly aesthetic piece at a great price.\n\nFor art, check out Addicted to Life, the address being Pujades 156 bis (211) \nFor an a great afternoon meal, check out the mexican restaurant called Cata Croquet: Almsgivers 211", "publishedDate": "2015-09-17", "language": "en", "rating": 5}, {"id": 307051915, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d6453867-r307051915-El_Poblenou-Barcelona_Catalonia.html", "text": "We've been here two times for two weeks. Geat area, Nice restaurants, good bars. Close to the beach. Not as crowded and overpriced as the Barcelonetta area. ", "publishedDate": "2015-09-04", "language": "en", "rating": 5}, {"id": 299045416, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d6453867-r299045416-El_Poblenou-Barcelona_Catalonia.html", "text": "Away from the maddening crowds, you'll find here all the attractions to enjoy your visit to Barcelona.  The Rambla del Poblenou is amazing, a strip of cafes, bars, restaurants, and all sort of business, where you can enjoy life as the locals do.  And yet, the city centre is only 5 or 6 metro stations (and 1 euro) away, if you'd like the standard tourist experience.\n\nThe beach is at the end of the Rambla, so you'll see everybody walking down to the best beach in Barcelona when the weather is OK.  Visit Poblenou, and you'll enjoy all this district has to offer.", "publishedDate": "2015-08-13", "language": "en", "rating": 5}, {"id": 276609264, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d6453867-r276609264-El_Poblenou-Barcelona_Catalonia.html", "text": "This wonderful little corner of Barcelona is slowly transforming itself into a hip, bohemian, eclectic mix of old world charm, leading edge design studios, business schools and grungy old pueblo districts. \nAvoid the drunken hordes of British and French teenagers at Barceloneta if you want to visit a beach. Choose the family and even nudist friendly clean beaches of Poblenou which are centred around Marbella and Nueva Marbella. Bring your bathers and a smart casual outfit because this little \"Poble\" will accommodate your beach visit and will take you through an afternoon stroll through the charming Rambla de Poblenou for lunch, coffee and the best \"leche merengada\" this side of Cordoba. This Rambla also offers excellent wine bars and restaurants for dinner. You need an ultramodern shopping mall, a visit to the herbalist, tango classes, or a charm cast by a local apothecary? All can be found in this little neighbourhood.  ", "publishedDate": "2015-06-01", "language": "en", "rating": 4}, {"id": 272341968, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d6453867-r272341968-El_Poblenou-Barcelona_Catalonia.html", "text": "This is a district a few minutes off the touristy spots. \nThere is a las ramblas del Poblenou which is like the famous Las Ramblas but only with all the locals. \nEnjoy the streets of this district, see the locals, kids playing in the park, Barcelonians going about in their business. \n\nThis place is to visit if you have more time and have done the regular touristy stuff. \nI think some reviewers did not like this place probably due to different expectations. Make sure that you ask someone where the Ramblas Del Poblenou is. That IS THE PLACE in this massive district to go. Also, walk southwards on the Ramblas, you will reach a park and the beach. \nThere are small cafes and tapa bars where you can get regular priced (not overpriced) authentic taste of BCN. \n\nWARNING: If you are a regular tourist whose ultimate motive is to check off the common tourist attractions from their list, please stay away from this place. Probably your expectations will be shattered and locals don't want you anyways.", "publishedDate": "2015-05-16", "language": "en", "rating": 5}, {"id": 270967646, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d6453867-r270967646-El_Poblenou-Barcelona_Catalonia.html", "text": "A great area, away from the tourist crush, a great Rambla with tons of restaurants, bars, banks, mini-markets, and a few minutes' walk to the beach.  Metro station takes you right into Jaume I (for cathedral and stroll through old town and Barri Gottic area).", "publishedDate": "2015-05-09", "language": "en", "rating": 4}, {"id": 268041390, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d6453867-r268041390-El_Poblenou-Barcelona_Catalonia.html", "text": "We were not impressed by this area. It's been marketed as a best kept secret in Barcelona, and indeed I much rather visit original, living neighborhoods than over-developed areas without soul. Since our hotel was in the area, we strolled around for a couple of hours. But Poblenou is still at the low side, it looks more poor than original. Sorry, I certainly hope it will be a lot better in a few years.", "publishedDate": "2015-04-26", "language": "en", "rating": 2}, {"id": 246895770, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d6453867-r246895770-El_Poblenou-Barcelona_Catalonia.html", "text": "If you have some extra time in Barcelona you must see Poblenou. What we did was get off from the metro station of Poblenou and walked along the malecon until the Auditori Forum. there are lots of parks and skateparks even. There is also a big downhill place to skate where you can go up again with mechanical stairs; just above the decathlon in the harbor. Then we got to see the sunset! Nice.", "publishedDate": "2015-01-01", "language": "en", "rating": 5}, {"id": 237569153, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d6453867-r237569153-El_Poblenou-Barcelona_Catalonia.html", "text": "We stayed here for our 4 nights here. It's a nice neighborhood with lots of good restaurants. It's out of the main tourist area but there is plenty of transport. We liked it or this oasis of calm.", "publishedDate": "2014-11-02", "language": "en", "rating": 4}, {"id": 231408230, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d6453867-r231408230-El_Poblenou-Barcelona_Catalonia.html", "text": "We stayed here at the Confortel Barcelona. We had no idea that we would end up in such an amazing little neighbourhood with lovely little restaurants and bars. The beach here is fabulous and it's such a charming area. \n\nThere was a little street festival while we were here and all the locals joined hands in the local square and did a Catalina dance. It was simply wonderful to be there in a non touristy area and with the locals. ", "publishedDate": "2014-09-28", "language": "en", "rating": 5}, {"id": 228311736, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d6453867-r228311736-El_Poblenou-Barcelona_Catalonia.html", "text": "Our hotel was just around the corner from ramblas de poblenou, and we stumbled upon the bars and restaurants on the first night and ended up having dinner there every night. The food is much nicer than any of the touristy places and is much more reasonably priced. They have a fee market stalls there as well, which again are better than the main tourist spots. If you're not staying locally it's easy to get to on the metro and definitely worth the trip. I think there's a beach and stuff also but we didn't go there", "publishedDate": "2014-09-11", "language": "en", "rating": 4}, {"id": 227089496, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d6453867-r227089496-El_Poblenou-Barcelona_Catalonia.html", "text": "We are staying in the Barri Gotic but today did a walk in Poblenou and the Bogotell beach area.  Walking up the Rambla del Poblemou was a wonderful surprise.  After the crush of people in the Barri Gotic, it was calm and relaxing to leisurely stroll through this area with its pretty buildings and quiet outdoor cafes.  It was definitely a nice place for an afternoon walk (lots of shade at 2&3pm), and if you were staying in the area there are several produce vendors and other shops along the street as well.  We will definitely come back here for a relaxing lunch or an afternoon drink at one of the cafes.", "publishedDate": "2014-09-05", "language": "en", "rating": 5}, {"id": 222977386, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d6453867-r222977386-El_Poblenou-Barcelona_Catalonia.html", "text": "Having booked in at the Barcelona Princess by Diagonal Mar, this seemed a likely area within walking distance to find somewhere to eat. A beach walk led to a lunchtime recce - and what a pleasant surprise the Rambla de Poblenau was. We supped our beers (okay, outside an upmarket pawn shop) looked up at the balconies of the old apartments overlooking us and wondered what it would cost us to live here ...", "publishedDate": "2014-08-19", "language": "en", "rating": 4}, {"id": 222367135, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d6453867-r222367135-El_Poblenou-Barcelona_Catalonia.html", "text": "We loved poblenou so much, that we are going back for the third time. We stayed in the Travelodge, which is 'cheap and cheerful' and will be staying again in September to see La Merce festival. The walk to the beach is through a lovely Rambla and the beach is clean and pleasant. We would often go for walks in the evening along the beach promenade and eat in one of the many restaurants. If you want to stay somewhere less busy, then this is the place to be.", "publishedDate": "2014-08-17", "language": "en", "rating": 5}, {"id": 222145240, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d6453867-r222145240-El_Poblenou-Barcelona_Catalonia.html", "text": "Its a nice place to stay in barcelona...there are many hotels in this area...fantastic Bogatel beach nearby with good facilities like toilet, shower and restaurant. The beach itself is clean...does not get very crowded....there is a nice small park with swings for children near the beach once you cross the road....there are many restaurants nearby...city is also not far....20-30 mins train ride and you reach la rambla street....overall we enjoyed staying here in this calm and quite neighbourhood....", "publishedDate": "2014-08-16", "language": "en", "rating": 4}, {"id": 220609846, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d6453867-r220609846-El_Poblenou-Barcelona_Catalonia.html", "text": "The bars, tapas, restaurants here are much more ''local'' and the people friendlier, a short walk from the beach and more ''homey'' than the bigger Rambla, its a nice place for families and anyone that prefers a bit of calm over the bustling tourist spots. The metro goes to and from with one connection so it was a great base throughout my stay in Barcelona", "publishedDate": "2014-08-09", "language": "en", "rating": 5}, {"id": 214033106, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d6453867-r214033106-El_Poblenou-Barcelona_Catalonia.html", "text": "Stayed at a hotel in the area, and when we first arrived thought it looked a bit run down. However, accidentally stumbled upon this area and was so glad to have found it. \n\nThe strip is Poblenou's version of Las Ramblas and in my opinion is actually nicer. Not as many tourists, not as fast paced, and the food in the many restaurants here is lovely at a very reasonable price.\n\nAt night the area is lit up, and many couples and families chose to eat here. Typically spanish, they don't tend to get busy until about 9 - 9:30 but you'll always find somewhere to eat. We liked it that much, we ate here every single night of our stay.\n\nIf you're after a slow paced, atmostpheric dinner, I cannot recommend somewhere along here enough.", "publishedDate": "2014-07-07", "language": "en", "rating": 5}, {"id": 211382381, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d6453867-r211382381-El_Poblenou-Barcelona_Catalonia.html", "text": "We had no clue what so ever in what kind of neighbourhood our hotel (Travelodge) was located for our 4 day trip to bcn. But we loved PobleNou. We actually liked the local Ramblas better than the famous one. Nice and cosy restaurants, all decent food for normal prices. We really liked Timesburg (burgers) and Sitar (Indian cuisine). Poblenou can easily be reached by metro and bus. Beach is very near, if you hit the beach and you go left you'll find the nude area, go right for the normal area, less busy but same (actually even better) facilities as at Barceloneta area. So, Poblenou is just great to be located for your trip to bcn. ", "publishedDate": "2014-06-21", "language": "en", "rating": 4}, {"id": 209448703, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d6453867-r209448703-El_Poblenou-Barcelona_Catalonia.html", "text": "Ok we stayed in the travelodge that was just off the main poblenou rambles and i got to say we were pleasantly surprised by the area.\n\nWe got off the metro and to be honest it looked like a bit of a hole but we got our bearings and made our way to the hotel.\n\nThe hotel was good with really helpful staff who allowed us to drop our bags off before check in and gave us some helpful advice on the local area so off we did trot...\n\nWhen we walked into the rambles the trees lining the street like a wonderful canopy of green. The shops and restaurants were small local and very friendly and then we suddenly made it to the beach... Out of no where it was stunning.\n\nThere are a few cafe bar restaurants  on the beach that were very chilled and thus we had drinks and a pizza for 15 euros\n\nOver the week it was a lovely place close enough for the beach, close enough to the restaurants and close enough to the metro that takes 10 minutes to Barcelona City centre. \n\nOh and if you happen to need spare clothes or beach towels... Primark 2 stops down on the metro.\n\nThe only bad thing is some of the local drunks and druggies... They hang around and get a bit noisy but they are completely harmless.\n\n9.75 out of 10 (that's how little the negative impacts the holiday) \n\n", "publishedDate": "2014-06-08", "language": "en", "rating": 4}, {"id": 187077279, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d6453867-r187077279-El_Poblenou-Barcelona_Catalonia.html", "text": "Great part of Barcelona, lively without the noise and crowd of the most touristy areas. Lots of good restaurants and good opportunities for low-cost shopping. Not fancy but just friendly and joyful neighborhood.", "publishedDate": "2013-12-08", "language": "en", "rating": 5}, {"id": 180298694, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d6453867-r180298694-El_Poblenou-Barcelona_Catalonia.html", "text": "We spent every night in the pedestrian zone for dinner and some drinks. Tapas bars were great and Barcelona residents are so open minded, you get very easily in good discusions if you want. Police and security is seen quite, but gives you a feeling of safety. Pick pockets are obviously a huge problem in complete Barcelona incl. Poblenou.", "publishedDate": "2013-10-09", "language": "en", "rating": 5}, {"id": 166217890, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d6453867-r166217890-El_Poblenou-Barcelona_Catalonia.html", "text": "After making trip advisor our bible for our visit to BCN and staying in Poblenou, we discovered that many restaurants in the top 100s of restaurants (out of 4,000) were on our doorstep! definitely a spanish area with lots of shops, side streets and sooo many unique restaurants with loads of variety in cuisine - paella, tapas, turkish, thai, indian, more tapas, and all so delicious! ", "publishedDate": "2013-07-03", "language": "en", "rating": 5}, {"id": 163936918, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d6453867-r163936918-El_Poblenou-Barcelona_Catalonia.html", "text": "A brilliant place to stay. If you want a little peace after the humdrum and busy time exploring Barcelona, then this is the little hidden gem to stay at.  Bars, cafes and restaurants fantastic.  Beach is at the end of the Ramble Poble Nou! A place that is an up and coming part of Barcelona area.  At night relax and chill at a bar on the Rambla andor/ watch the people rollerblade, skateboard or run by , no big deal to sit and watch what the locals do to pass their time!  Its not a noisy place it has a quiet hum, which stops at the end of the day! We will be back again to this area, just loved it!  Hope you will too!", "publishedDate": "2013-06-13", "language": "en", "rating": 5}, {"id": 143818672, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d6453867-r143818672-El_Poblenou-Barcelona_Catalonia.html", "text": "Poblenou is not that well-known but certainly interesting. Special for photographers! There are old factories, the beach, the mini Ramblas and gravities!", "publishedDate": "2012-10-27", "language": "en", "rating": 4}]}}]