[{"locationId": 9570964, "name": "Buho de la Plaza Jacint Verdaguer", "placeType": "ATTRACTION", "reviewListPage": {"reviews": [{"id": 690471572, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d9570964-r690471572-Buho_de_la_Plaza_Jacint_Verdaguer-Barcelona_Catalonia.html", "text": "Buho de la Plaza Jacint Verdaguer is at the intersection between Avinguda Diagonal, the city's main avenue, and Passeig de Sant Joan, in Dreta de l'Eixample, not far from the Sagrada Família. In fact, we came across this sight on our way to the Sagrada Família. The monument is named after the 19th century Catalan-language epic poet of the Jacint Verdaguer. The small plaza is crowned by a noucentista statue made in 1912 by Joan Borrell of Verdaguer on top of a tall column. The landmark was designed by the architect Josep Maria Pericàs with Borrell's morals of poetry. The bas-reliefs around the monument, featuring scenes from Verdaguer's works, were sculpted by the brothers Llucià and Miquel Oslé. We would not go out of our way to search out this monument, but it was interesting to see, since it was along the route of our self-guided tour anyway.", "publishedDate": "2019-07-17", "language": "en", "rating": 3}, {"id": 676521522, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d9570964-r676521522-Buho_de_la_Plaza_Jacint_Verdaguer-Barcelona_Catalonia.html", "text": "This is a huge \"sculpture\" of an owl, on top of the building across the road, probably an advertising thing? Some reviews on this page have confused the heading entry Buho de la Plaza Jacint Verdaguer, with the Monument of Jacint Verdaguer, which is in the middle of the roundabout. Buho refers to the Owl! You will see it if you turn your gaze upwards towards the other direction and keep looking, until you spot the giant owl. Not a trip stopper!", "publishedDate": "2019-05-26", "language": "en", "rating": 3}, {"id": 635106015, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d9570964-r635106015-Buho_de_la_Plaza_Jacint_Verdaguer-Barcelona_Catalonia.html", "text": "The monument is in the middle of a traffic circle and so you can't really get to it and see what it is about. It does look interesting", "publishedDate": "2018-11-22", "language": "en", "rating": 3}, {"id": 533798220, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d9570964-r533798220-Buho_de_la_Plaza_Jacint_Verdaguer-Barcelona_Catalonia.html", "text": "Came across this monument by chance when walking down the avenue diagonal  to the Sagrada  familia. On the roundabout.", "publishedDate": "2017-10-17", "language": "en", "rating": 3}, {"id": 491331515, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d9570964-r491331515-Buho_de_la_Plaza_Jacint_Verdaguer-Barcelona_Catalonia.html", "text": "We came across this at an intersection on our way to see Sagrada Familia and thought it was rather well laid out but rather large for the roundabout centerpiece with tall trees but is rather a striking monument ", "publishedDate": "2017-06-07", "language": "en", "rating": 5}]}}]