[{"locationId": 7984164, "name": "Estacio de Franca", "placeType": "ATTRACTION", "reviewListPage": {"reviews": [{"id": 432644595, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d7984164-r432644595-Estacio_de_Franca-Barcelona_Catalonia.html", "text": "I finally entered after passing countless times. I love the architecture and imagining ladies in fine hats with their luggage years ago. It's nice to escape the sun. Recommend it if you're in the neighbourhood!", "publishedDate": "2016-10-29", "language": "en", "rating": 4}, {"id": 430721996, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d7984164-r430721996-Estacio_de_Franca-Barcelona_Catalonia.html", "text": "This is a beautiful station and a way to avoid the pick pockets at Sants. Its the end of the line so you either board or leave a train in a dignified fashion.  No hustle or bustle....pretty refined. You can go Renfe to your destination.  This station is by the coast of Barcelona and by the  beautiful park ciudadela. Its on P. Colon. Walkable if fit from La Ramblas.  \nI avoid Sants like the plague and get a bus to placa de Catalunya from the airport then  a taxi here or bus or walk. Makes life so much more serene to be honest. Trains go from here to many places in Spain.....look online for your destination.", "publishedDate": "2016-10-22", "language": "en", "rating": 5}, {"id": 367433173, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d7984164-r367433173-Estacio_de_Franca-Barcelona_Catalonia.html", "text": "França railway station is an emblematic train station, a beautiful old building that not many people know, or they just don't pay attention to. Besides there a big bar/restaurant where to eat really good food at affordable prices. On fridays there's a language exchange event, in which you can meet many locals and practice Spanish (or other languages). You'll love it!", "publishedDate": "2016-04-25", "language": "en", "rating": 5}, {"id": 355834038, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d7984164-r355834038-Estacio_de_Franca-Barcelona_Catalonia.html", "text": "this station is actually small, and yet so beautiful, made almost entirely of steel structures. For those who read Zafón's books, this is a must go in Barcelona!", "publishedDate": "2016-03-15", "language": "en", "rating": 4}, {"id": 333558197, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d7984164-r333558197-Estacio_de_Franca-Barcelona_Catalonia.html", "text": "El Estacio de Franca is a unique rail station that holds special events on occasion.  I happen to stumble into it while the Lost and Found Market was on.  Many local residents come out to sell their unwanted items or collectibles at amazingly low prices. Music plays by local dj and there's restaurants and bar.  The station itself is beautiful and worth taking a walk thru,  unless you have  a ticket to gt on board!", "publishedDate": "2015-12-17", "language": "en", "rating": 5}, {"id": 290349498, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d7984164-r290349498-Estacio_de_Franca-Barcelona_Catalonia.html", "text": "Nice spacious station, good place to start travel to the airport with R2 trains with one easy change. Easy and fast to buy tickets ", "publishedDate": "2015-07-19", "language": "en", "rating": 5}, {"id": 285123639, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d7984164-r285123639-Estacio_de_Franca-Barcelona_Catalonia.html", "text": "Beautiful train station, with very high decorative ceilings, and large spacious interior.   Just inside the doors leading to the train departure area, there are separate bathroom facilities for male/female.  There's a beautiful restaurant just inside the main doors,of the train station.  The restaurant serves breakfast, lunch and dinner, plus, they have a full bar.  During lunch time, they serve il Menu del Dia (Menu of the Day) which is a pre-fixed menu  for  8.00 Euros, per person. The menu is written in spanish, and the dishes are typical spanish food.   This a great place to visit, and stop for great food at an affordable price.  You can use this train station to travel to such places as Stiges and Tarragona.", "publishedDate": "2015-07-02", "language": "en", "rating": 5}, {"id": 267626591, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d7984164-r267626591-Estacio_de_Franca-Barcelona_Catalonia.html", "text": "We called in to use the free toilets whilst on our way to the nearby Arc de Triomf and was impressed.  It takes you back to the 1920-30's period and we imagined how they must have travelled on the railways in those days.  The station was restored in the 1990's and appears to be almost all original.  The entrance hall has a lovely tiled floor and ornamental ceilings, along with ornate walls.  It is very grand.  There is an upmarket looking restaurant off to one side but we did not eat there.  As I walked in to the platform area the roof took my breath away.  It has 2 giant spans, each covering several tracks, consisting of a vast amount of steel lattice work.  This would have been impressive enough but the 2 spans follow the curve of the tracks so to stand and look at the elegance of the arches that then progress in to the distance and at the same time, twist to the left makes you wonder how they were able to build such an intricate and curvaceous roof.  It will certainly make for some interesting photo shots.  There is also a scale model of the station in the centre and that is also interesting to look at.  Certainly worth 10-15 minutes of your time.", "publishedDate": "2015-04-23", "language": "en", "rating": 4}]}}]