[{"locationId": 271009, "name": "Camp Nou", "placeType": "ATTRACTION", "reviewListPage": {"reviews": [{"id": 755415363, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d271009-r755415363-Camp_Nou-Barcelona_Catalonia.html", "text": "I am neither a supporter of Barça nor Real Madrid. However, we set the Madrid's tour as our benchmark after visiting Real Madrid FC less than 12 months ago. Unfortunately, our visit to Barcelona FC did not match the experience we had at Real Madrid in every single way. Our 2 biggest disappointments were:\nStaff's attitude: \nThe biggest disappointment was about its appalling customer service. Staffs were generally unfriendly but one of the staffs who stationed in the photoshoot section (right after the entrance, see my pic) had told me to \"Shut Up and Listen!\" - after I simply asking her politely whether we could skip the photoshoot as we didn't want to take the picture. She even did an offensive hand gesture to me whilst she spoke. Although I reported her to the management straight after and they apologised afterwards, but it was still a very unpleasant experience as she had ruined our moods for the rest of our tour at the stadium. I couldn't imagine how many people she had treated badly if they didn't want to take the photoshoot.\nVirtual Experience: \nAnyone who had experienced VR before would know VR is supposed to make you feel that you interacted with the 3D worlds. We didn't have much expectation but were hoping it would make us feel like watching a game inside Camp Nou - even if it's just for 10 sec. However, we were gutted that it was just showing a documentary of Barcelona FC's history. The visual was extremely poor, it was like watching an old VCR (i.e. like watching a 144p resolution on youtube). It wasn't 3D, it had no movement connected to the body and it was actually just playing a very old and a non-action based documentary video. The sound was poor and the speaker was quite distanced to my ears. The pictures were so blurry, although the staff did try to fix it for me but it still didn't work. I asked the people around me and they all had given up and taken off the headsets before it's finished. (They all said it's rubbish so I was pleased that I wasn't the only one feeling cheated!) It was definitely the worst VR experience ever! i.e. Why would anyone want to watch an old documentary and a poor quality video whilst sitting inside Camp Nou!?\nThe Real Madrid tour was a million times better in every way! It's the worst holiday experience we had in Barcelona! Highly NOT recommended unless if you're a Barça fan!", "publishedDate": "2020-05-25", "language": "en", "rating": 1}, {"id": 752764618, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d271009-r752764618-Camp_Nou-Barcelona_Catalonia.html", "text": "We had a great time touring Camp Nou even bought some of the grass from the previous year as a memory. The whole experience was great if you love soccer and Barca. If you aren't into soccer or this team not sure how you'd feel about the experience. Sitting inside the press box, being down on the field sitting int the teams seats was the coolest feeling. Be careful when they take your pics, you can buy a package at the end but my sons eyes were closed in most of them. But we loved it and bought lots from the team store!", "publishedDate": "2020-04-19", "language": "en", "rating": 4}, {"id": 752461936, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d271009-r752461936-Camp_Nou-Barcelona_Catalonia.html", "text": "Definitely one of the best grounds I've ever been. Great atmosphere and for sure a unique experience!! Really happy and lucky to be there on a match day. ", "publishedDate": "2020-04-10", "language": "en", "rating": 5}, {"id": 752217578, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d271009-r752217578-Camp_Nou-Barcelona_Catalonia.html", "text": "Beautiful stadium.a must to see in Barcelona.nice view of the pitch from the top and interesting tour guide.Consider booking your ticket online.", "publishedDate": "2020-04-03", "language": "en", "rating": 5}, {"id": 752168305, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d271009-r752168305-Camp_Nou-Barcelona_Catalonia.html", "text": "If Barcelona is more than a club (maybe the soul of the city) Camp nou is more than a stadium, a temple dedicated to the gods of good football. Next time we intend to watch a game. Barcelona x Real Sociedad were playing in País Basco, unfortunately. ", "publishedDate": "2020-04-02", "language": "en", "rating": 5}, {"id": 752084771, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d271009-r752084771-Camp_Nou-Barcelona_Catalonia.html", "text": "My famyli I had the opportunity to visit this beautiful stadium but i only wish one day in the future to see Barcelona and Real Madrid game.. ", "publishedDate": "2020-03-31", "language": "en", "rating": 5}, {"id": 752042964, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d271009-r752042964-Camp_Nou-Barcelona_Catalonia.html", "text": "It's a short walk from the metro train station it's just down a hill there was some fan based merchandise outside the ground  and something nice to eat before the tour on the tour you can get an audio self tour video while you walk  on the tour its self the official tops are €100 like any other official shirt so buy elsewhere ", "publishedDate": "2020-03-30", "language": "en", "rating": 5}, {"id": 751952839, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d271009-r751952839-Camp_Nou-Barcelona_Catalonia.html", "text": "Wow! It was my dream to visit this place. Unfortunately only for tour in stadium and museum (not a game), but it was unbelievable. The stadium is huge, but from every point, you can see the field nearby. Everything breath footbal and club players: fitting room, press center, commentators area, substitutions chairs... Next time a game!", "publishedDate": "2020-03-28", "language": "en", "rating": 5}, {"id": 751752645, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d271009-r751752645-Camp_Nou-Barcelona_Catalonia.html", "text": "As part of our Stag Party Weekend away to Barcelona, one of the Booked Events we had to look forward to was a Ticket to watch Barcelona play at Home in the Nou Camp Stadium v Real Sociedad only a few weeks ago.Getting to the Stadium was an Experience in itself getting there in a Rickshaw because of the Taxi,s being fully booked, but once we arrived and entered the Arena,...and Yes I mean an Arena like you,ve  never seen before, It was Magnificent, they were just about to Kick Off and the Roar was like nothing else I had ever heard before. The Seats to which our Tickets took us all, could not have been better placed, taking us  directly to the Back of the Barcelona Goal just behind the many Ardent Supporters,who never stopped Chanting and Singing throughout,whilst waving their Flags and Banners. As I sat in my Seat I took a while to look around and take in the Grand View above my Head around the Stadium,to see the many Tiered Seats, and it was only then that I realised what a Great Seat and View we had of the Game. It may be one thing taking in a Tour of the Stadium,but for the Majority of our Party, to attend an Home Game of the Mighty Barcelona, in Seats as good as these was something else, and possibly one that will never be beaten.Oh and the Score.....A 1-0 Win to Barcelona ( with another one disallowed for Offside ). Well Worth a Visit if you Ever get the chance to watch a Game here.", "publishedDate": "2020-03-24", "language": "en", "rating": 5}, {"id": 751623048, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d271009-r751623048-Camp_Nou-Barcelona_Catalonia.html", "text": "This was one of the main reasons for visiting Barcelona, I just felt the need to see the GOAT before he retires, so I dragged the wife along for our anniversary.  \n\nThe stadium has seen better days but there is still an aura about it, even with a less than sell out crowd against a less glamorous side like Getafe you could still feel the excitement when Messi got on the ball.\n\nIf you are a football fan you owe it to yourself to see the great man before it is too late.", "publishedDate": "2020-03-22", "language": "en", "rating": 5}, {"id": 751621498, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d271009-r751621498-Camp_Nou-Barcelona_Catalonia.html", "text": "Amazing tour. Wouldnt bother with a guided tour, easy to work your way around. Self explanatory. \n\nSome bits there are a lot of metal open plan steps so ask where the hidden lift is if you struggle or are disabled.\n\nThe forced photo area that you have at all tourist spots that you sort of have to walk through to get in the camp can be refused. The woman who took our photos was too quick, unbothered about quality and slap dash. Needless to say if that continued no photos would be bought with the cups or scarves...pointless excersize really as no one will buy rubbish photos of themselves.\n\nThe stadium is amazing and the museum is interesting. \n\nDefinitely go. The cup wear is incredible. \n\nThe bar outside is pigeon ridden with aggressive pigeons. Don't eat there is my advice. We just had a beer.", "publishedDate": "2020-03-22", "language": "en", "rating": 5}, {"id": 751612659, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d271009-r751612659-Camp_Nou-Barcelona_Catalonia.html", "text": "As for Barca fan it was great experience, I could spend there the whole day. I could felt the atmosphere of match. I loved room with movies with big moments, watching this I was enchanted. The only thing I don't like and I'm even a bit outraged it's the price of photos you can take while taking the tour. There is a few places where you can take a shot with trophy or with favorite player and the price is 25 euros per one photo! That's really too expensive.", "publishedDate": "2020-03-22", "language": "en", "rating": 4}, {"id": 751457343, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d271009-r751457343-Camp_Nou-Barcelona_Catalonia.html", "text": "A place to visit for every fan of football. Greatest club in the world ! We visit the club museum and the Camp Nou stadium.", "publishedDate": "2020-03-19", "language": "en", "rating": 5}, {"id": 751430475, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d271009-r751430475-Camp_Nou-Barcelona_Catalonia.html", "text": "Well organised and the museum was very interesting. Highly recommend taking the family and the virtual experience was great.", "publishedDate": "2020-03-19", "language": "en", "rating": 5}, {"id": 751282656, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d271009-r751282656-Camp_Nou-Barcelona_Catalonia.html", "text": "Went with my parents, brother and our children (7 and 10) to see a game this march. It was early stages of Corona-times so we were 70 000 visitors. \nSurprisingly, queues were really fast to enter the arena and going through security, eventhough it looked like it would take forever. Entering arena, it was easy to find our seats. \nWhole event felt really safe and not like in sweden where you have more unpleasent visitors to football games, this felt so much more family friendly. Absolutetly no problem taking kids to this game. Close to toilettes and simple snacks are available. \nThe only thing you need to save your energy for is leaving the area (not arena, that is fast) but if you need public transportation after the game it will be problematic. We couldn't even enter the subway station and walked for a half an hour to go to another station on another line in the end.", "publishedDate": "2020-03-17", "language": "en", "rating": 5}, {"id": 751247395, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d271009-r751247395-Camp_Nou-Barcelona_Catalonia.html", "text": "Even if your not a football fan I would highly recommend visiting here. We purchased the ticket to walk around alone which was great. You were allowed to access all areas, changing rooms, pitch side, tunnel, seats. This place is just breathtaking. A must if your in Barcelona ", "publishedDate": "2020-03-17", "language": "en", "rating": 5}, {"id": 751214401, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d271009-r751214401-Camp_Nou-Barcelona_Catalonia.html", "text": "This is a place you must to go check out, we got to the stadium 3 hours before game start.  It was already pack.  Fans were everywhere, all with excitement. We shop at the store, walked around. Hugh stadium! Warning if you like a beer or two, once you check inside the arena, no alcoholic drinks allowed.  The stadium is just incredible, can’t imagine it fit 100,000 fans.", "publishedDate": "2020-03-17", "language": "en", "rating": 5}, {"id": 751175245, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d271009-r751175245-Camp_Nou-Barcelona_Catalonia.html", "text": "The staff at Camp Nou were so well organized and friendly. The heritage of Barca FC and memorbilia was amazing. Audio guide worked well. Great store with exclusive items you wont get elsewhere. ", "publishedDate": "2020-03-16", "language": "en", "rating": 5}, {"id": 751011971, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d271009-r751011971-Camp_Nou-Barcelona_Catalonia.html", "text": "I attended the museum and stadium tour with my girlfriend (a Barcelona fan). I didn’t expect to be kept particularly interested, but throughout the tour I found myself thoroughly fascinated by the history of the unique icon of world football that is Barcelona. Besides the staggering trophy cabinet and history exhibition, the tour allows you a behind the scenes look into the changing rooms, tunnel, conference room and even to walk the touch lines and sit in the dugouts. \n\nThere are cafes and places to grab a bite, and a fantastic superstore. The only downside for me was the disappointingly expensive prices for the photographs which are taken at certain points around the stadium. All-in-all, though, a good memorable story.", "publishedDate": "2020-03-15", "language": "en", "rating": 4}, {"id": 750961646, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d271009-r750961646-Camp_Nou-Barcelona_Catalonia.html", "text": "Since childhood time I am a fan of FC Barcelona football club (Barca). By travelling this time with my son our dream came through.", "publishedDate": "2020-03-15", "language": "en", "rating": 4}, {"id": 750743874, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d271009-r750743874-Camp_Nou-Barcelona_Catalonia.html", "text": "If you’re a football fan then this place is a must. It is easy to reach. We got off at the Collblanc Metro stop. There are signs in the Metro pointing to the correct exit. Outside there is another sign point the way. And that’s it.\n\nWe booked on line and booked an audio guide. We found the audio guide to go on quite a bit and stopped listening after a while. \n\nThe museum was interesting, giving the history of the club pre Civil War then post Civil War. The museum also included Barca’s other sporting teams. \n\nAfter the museum we made our way to the stadium. The ground was unbelievable, large but enclosed. Amazing views. \n\nThe ground tour then took you to the away team changing room, post match interview area and media area. We then walked down the tunnel and pitch side and the dug outs. This we didn’t expect at all and was amazing.\n\nThe tour then took you to the top of the stadium to the commentary boxes and another amazing view. \n\nWhilst walking around there were opportunities for your photo to be taken against a green screen, with the photos to be bought as a package at the end. We found the package expensive and didn’t bother. \n\nAt the end of the tour is the usual souvenir shop. Except this is a three floor megastore!! And bargains can be had if you look! \n\nA great tour, definitely worth it. ", "publishedDate": "2020-03-13", "language": "en", "rating": 5}, {"id": 750612768, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d271009-r750612768-Camp_Nou-Barcelona_Catalonia.html", "text": "Truly an excellently organized tour. Even if you are not a football lover it is a visit to do because it leaves you speechless. To do at least once!", "publishedDate": "2020-03-12", "language": "en", "rating": 5}, {"id": 750605758, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d271009-r750605758-Camp_Nou-Barcelona_Catalonia.html", "text": "Inside that stadium you can see the Barcelona's Football Club history and learn everything about Barca. It's just amazing! ", "publishedDate": "2020-03-12", "language": "en", "rating": 5}, {"id": 750509828, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d271009-r750509828-Camp_Nou-Barcelona_Catalonia.html", "text": "There is no question if you are a sport fan you must go to this venue.  The shopping alone makes it worth the trip.", "publishedDate": "2020-03-11", "language": "en", "rating": 5}, {"id": 750498993, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d271009-r750498993-Camp_Nou-Barcelona_Catalonia.html", "text": "Massive highlight for any football fan visiting Barcelona.\nEasy to navigate & got to see so much. Amazing views from the stands & pitch side. Museum with all the major trophy’s & some fun photos on the way around.", "publishedDate": "2020-03-11", "language": "en", "rating": 5}, {"id": 750383569, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d271009-r750383569-Camp_Nou-Barcelona_Catalonia.html", "text": "We visited the Nou Camp twice. Once to see a Barcelona game (the main reason for our trip to Barcelona) and once to do the tour. I would thoroughly recommend both. The stadium is iconic and atmospheric. The tour was really informative it was great to learn more about the teams history. Loved it. ", "publishedDate": "2020-03-10", "language": "en", "rating": 5}, {"id": 750326702, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d271009-r750326702-Camp_Nou-Barcelona_Catalonia.html", "text": "We only had the basic ticket which actually doesnt get you much.  All it gets you is the Museum and you can go outside to view the stadium but that is it, you can not move around inside the stadium.  However  my husband enjoyed it and it was good to experience the feel of the stadium.", "publishedDate": "2020-03-10", "language": "en", "rating": 3}, {"id": 750311584, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d271009-r750311584-Camp_Nou-Barcelona_Catalonia.html", "text": "3rd time I have done the stadium tour/ museum. If you have any interest in football then you must visit. Just hope my next visit will be to see Wolves play there! ", "publishedDate": "2020-03-10", "language": "en", "rating": 5}, {"id": 750273633, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d271009-r750273633-Camp_Nou-Barcelona_Catalonia.html", "text": "Stadium: Looks much better in person than in pictures. Really good view of the pitch even if pictures make it  seem that viewing the game from far side is not as enjoyable. Must visit if you're in Barcelona, if you're a football fan. You can really feel the atmosphere when it's a vital football match and more than 80,000 fans fill the area!\nTour: While giving a detailed history of the football club, the basic unguided tour (approx €25) will cover trophy rooms, press areas, dugouts, visitor dressing room, etc. There was a Barca Plus 3D experience area which I didn't find worth the extra €9.", "publishedDate": "2020-03-10", "language": "en", "rating": 5}, {"id": 750234878, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d271009-r750234878-Camp_Nou-Barcelona_Catalonia.html", "text": "booked on fc barcelona website prior to going to barcelona but could not do whole tour as it was a match day. We applied for a refund thanks to very helpful ticket office staff and we have had this refunded. We did buy match tickets and had an amazing experience watching Mese et. al. highly recommended", "publishedDate": "2020-03-10", "language": "en", "rating": 5}, {"id": 750223705, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d271009-r750223705-Camp_Nou-Barcelona_Catalonia.html", "text": "Birthday treat from my daughter/son-in-law and it was a great experience. We did the audio tour which is quite good but the signage for the different commentary points could be far better. When you leave the glitz of the museum though you’ll see the ground is an ageing relic with numerous health and safety/supporter comfort issues. Some of the seats near the press boxes high up at the back of the main stand only provide a view of half of the pitch and one goal! There are big plans for the stadium to bring it up to date and these can’t come too soon. The tour itself was great, with no time pressures, so you do it at your own pace. Staff were friendly and helpful, providing information and advice where necessary. It’s interesting to see behind the scenes and how the away teams are treated so differently, even though having said that, their dressing room is large, if bland, and the whirlpool spa bath is what you would expect for overpaid, pampered players. All in all, a must do experience for any football fan, and one which I enjoyed immensely, but the official photographs available as you exit are overpriced and provide an insight as to why they ere the richest club in the world.", "publishedDate": "2020-03-10", "language": "en", "rating": 5}, {"id": 750149171, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d271009-r750149171-Camp_Nou-Barcelona_Catalonia.html", "text": "Nice place, though it's really crowded and hard to get nice pictures anywhere. There is a museum inside full of the awards that FC Barca has won, and you get to go see the stadium, and some other places such as the press conference room, media room etc. Good for football fans! ", "publishedDate": "2020-03-09", "language": "en", "rating": 3}, {"id": 750145033, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d271009-r750145033-Camp_Nou-Barcelona_Catalonia.html", "text": "First class experience . Great old stadium . Security guards not the most helpful trying to find your entry area but we really enjoyed the match .\n\nTop tip after the match grab a bar or a restaurant and sit back and let the crowd disappear and then jump on the subway home .\n\nAnother top tip do not use the bus tour to get to the stadium as it took 2.5 hours from stop 1 to the camp nou 14 ,we ended up late for the match . Get the subway .", "publishedDate": "2020-03-09", "language": "en", "rating": 5}, {"id": 750105569, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d271009-r750105569-Camp_Nou-Barcelona_Catalonia.html", "text": "Hes a big footie fan, me not so much. However I found it quite interesting and eye opening on how good Barcelona football team mist be. \nThe phone guide thing is not great, my phone locked after a few minutes of no use and then i couldn't open it to listen to the last few commentaries.", "publishedDate": "2020-03-09", "language": "en", "rating": 4}, {"id": 750076822, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d271009-r750076822-Camp_Nou-Barcelona_Catalonia.html", "text": "The stadium was an overall good experience. Definitely a must-do when visiting Barcelona. It was way too expensive for what it offered though. I cant remember the exact price but it included an audio handset and access to the museum of trophies/awards etc and access to the seating area of the pitch.", "publishedDate": "2020-03-09", "language": "en", "rating": 4}, {"id": 749985451, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d271009-r749985451-Camp_Nou-Barcelona_Catalonia.html", "text": "After coming out of the Subway, surprisingly, there are no signs to point you into which direction to walk to camp nou. A friendly passerby saw how we were staring at our phones in confusion and pointed us in the correct direction. We purchased our tickets at the front gate with absolutely no wait time. Out of the selection of tickets we chose to get the full experience and here is my feedback.\nYou are first directed into what they kept calling \"the Organization\". I suppose it was a room intended on explaing the benefits of the Club to the world community at large and where the proceeds go. There were audio/ VR devices to use that explained the presence of the club in each community. 5 out of the 7 were not working. When we told the employee, He told us to wait. When we did not see/hear  back within 10 minutes. We walked out of the building, deeming it useless and a waste of time. You then go on a tour and are given iPhones and earsets to hear the audio explanation of every item you encounter through a long hall which displayed trophies, old soccer cleats, and tons of pictures and other soccer paraphernalia. The audio was very entertaining and I highly recommend actually listening to it while going through the tour. The tour eventually leads you into the stadium benches. The stadium looked like any other stadium, in my opinion. You walk to a selection of levels and seats in the stadium including the balcony seats. The audio then leads you through the locker rooms and eventually onto the pitch. I must say, although you don't get to freely walk on the pitch, there was some sort of excitement of being on the actually playing ground and getting some pictures. I visited on a Thursday and it was around 3 in the afternoon and there were very other visitors with us. After visiting the pitch at leisure, you go back up all the stairs and are lead to what they call \"The experience\" which is when you wear a VR headset and watch a short film in VR of a compilation of short clips of the players walking around the grounds. I have to say, this was a very bad experience. The graphics were absolutely horrible. I did not feel like I was 'living the moment\" or that I was actually near the players. As a matter of fact, the graphics continuously glitched and there was nothing \"real\" about it. It doesn't even deserve the name Virtual Reality.  After your tour, like any tour, you are lead to the gift shop, which in this case, is a 3 story awesome building filled with Barca merchandise made by both Nike and Barca companies. Definately worth a visit. Don't fall for the hype.", "publishedDate": "2020-03-08", "language": "en", "rating": 4}, {"id": 749931734, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d271009-r749931734-Camp_Nou-Barcelona_Catalonia.html", "text": "Amazing tour and well worth the price and trip! We paid for the standard tour with audio guide and virtual experience which was great!  Stadium is fantastic and museum also! Only thing was the virtual experience was quite blurry not best quality. Would recommend and would visit again absolutely ", "publishedDate": "2020-03-08", "language": "en", "rating": 5}, {"id": 749918157, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d271009-r749918157-Camp_Nou-Barcelona_Catalonia.html", "text": "Came to watch a match between Barcelona v Real Sociedad as an English fan. Absolutely stunning stadium and a great experience. ", "publishedDate": "2020-03-08", "language": "en", "rating": 5}, {"id": 749917406, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d271009-r749917406-Camp_Nou-Barcelona_Catalonia.html", "text": "Went to watch the Barcelona v Real Sociedad, the grounds were so busy and huge! However the staff were super efficient and made sure each fan got into the stadium safely and quickly", "publishedDate": "2020-03-08", "language": "en", "rating": 5}, {"id": 749903115, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d271009-r749903115-Camp_Nou-Barcelona_Catalonia.html", "text": "I came hear on Matchday and the atmosphere was excellent the players were amazing and even better to get a win👍🏽", "publishedDate": "2020-03-08", "language": "en", "rating": 5}, {"id": 749876500, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d271009-r749876500-Camp_Nou-Barcelona_Catalonia.html", "text": "We’ve done stadium tours of other major European teams and a visit to BOTH locker rooms was always included but not at Camp Nou. Only the visitors locker room Why? Wish that would’ve been stated in tour description. ", "publishedDate": "2020-03-08", "language": "en", "rating": 3}, {"id": 749856501, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d271009-r749856501-Camp_Nou-Barcelona_Catalonia.html", "text": "My partner found the tour of camp nouveau fascinating.  I on the other hand found it boring. If you love you football this is one for you.", "publishedDate": "2020-03-08", "language": "en", "rating": 5}, {"id": 749797204, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d271009-r749797204-Camp_Nou-Barcelona_Catalonia.html", "text": "Magical place that has nothing to envy of the Stade de France. Free visit very well organized with the loan of a translator with headphones in French. Staff on site very attentive to questions asked and concrete answers. Being able to walk on the edge of the lawn and sit on the sidelines is great.", "publishedDate": "2020-03-07", "language": "en", "rating": 5}, {"id": 749650406, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d271009-r749650406-Camp_Nou-Barcelona_Catalonia.html", "text": "Me and my husband have just visited camp nou with the standard tickets which online for 2 cost £35. The trip was worth the visit, I am not a football fan but it was nice to see such a big stadium and the history behind it and my husband enjoyed seeing all the trophies and tour around the stadium. Worth the money and a nice trip out, we were only there maybe 2 hours at the most, easy to find.", "publishedDate": "2020-03-07", "language": "en", "rating": 5}, {"id": 749557105, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d271009-r749557105-Camp_Nou-Barcelona_Catalonia.html", "text": "There was nothing special about the Camp Nou Experience. The pitch was beautiful and it was interesting to read about the history, however I felt that the tour itself is a bit outdated compared to other European stadium tours. Very expensive for just the entrance into the tour aswell. Overall I enjoyed the experience but I don't think I would have missed out on too much if I didn't visit it. Once is definitely enough.", "publishedDate": "2020-03-06", "language": "en", "rating": 3}, {"id": 749337481, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d271009-r749337481-Camp_Nou-Barcelona_Catalonia.html", "text": "fairly spectacular stadium (not super new or spectacular....but it is camp nou).  Super busy and crowded but self guided and easy enough to see everything we wanted.  Quite a big tour and lots to see (very little interactive stuff but if you like football it is interesting).  it can be a long walk too.  There were a lot of stairs....and that was tough for Dad...but they were really good and fed us to elevators and short cuts.  I enjoyed it (not a fanatic fan).  ", "publishedDate": "2020-03-05", "language": "en", "rating": 4}, {"id": 749117111, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d271009-r749117111-Camp_Nou-Barcelona_Catalonia.html", "text": "My husband and I enjoyed just walking around the outside of the Nou camp. There were no  tours available so decided not to go in on our own . Instead we visited the ice rink and watched a veterans game and ate in the cafeteria there...it was great...licensed as well . ", "publishedDate": "2020-03-04", "language": "en", "rating": 4}, {"id": 749055765, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d271009-r749055765-Camp_Nou-Barcelona_Catalonia.html", "text": "Very intersting even if you are not a big football fan I really enjoyed the day. It costs about £25.00 each and took a couple of hours to walk round", "publishedDate": "2020-03-04", "language": "en", "rating": 5}, {"id": 748920392, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d271009-r748920392-Camp_Nou-Barcelona_Catalonia.html", "text": "very disapointed amature pictures made by unskilled and \"fake smile\" staff. the backgroud scene does not match with our photos, postures are poorly cut make it even worse. Very disapointed, definitely not recommended", "publishedDate": "2020-03-03", "language": "en", "rating": 1}, {"id": 748897489, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d271009-r748897489-Camp_Nou-Barcelona_Catalonia.html", "text": "I was in Barcelona for the 5th time but first time visiting the stadium. I got the 30e  online basic ticket. Stadium itself is most amazing. The whole tour is long, full of surprises, very well organized, despite the situation with the virus.  What was kind of bad and certainly overpriced, is everything that follows once you enter the Tour and products within the Barca shop. They take 4 pictures of you during the whole walk, one with the jersey, one with the fake trophy and some other, and then before you exit the stadium, they already printed all the pictures of you and they give you in a small booklet. Booklet with 2 pictures, that are done in a very poor photo shop along with few pages of FC Barcelona is additional 40e, and booklet with 4 pictures is 70e.  I bought that 40e but it was totally not necessary. Souvenirs in the shop are also overpriced, they even sell parts of the grass from the field. I understand the idea, and who is a true fan really doesnt care, but 100e is a hello once you enter. Also I recommend the tour with the audio guide!", "publishedDate": "2020-03-03", "language": "en", "rating": 3}, {"id": 748864438, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d271009-r748864438-Camp_Nou-Barcelona_Catalonia.html", "text": "There were sadly no match on whilst visiting Barcelona so we made do with a tour of the stadium. Although it is getting a bit old it is very impressive and the tour route is well organised and signed so it is easy to find your way around. We paid €6.00 for a handset but it was not worth the money as most things are self explanatory. Great visit and obviously a great team.", "publishedDate": "2020-03-03", "language": "en", "rating": 5}, {"id": 748745845, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d271009-r748745845-Camp_Nou-Barcelona_Catalonia.html", "text": "As an arsenal fan, seeing Belletti’s champions league winning boots were the lowest point to this experience 😀🤦🏻‍♂️\n\nHowever, a coach journey up into the hills to this place is well worth the experience ! It’s nice the way there’s not much queuing and it’s laid out so good you don’t feel too cramped.\n\nYou get to see pretty much everything from dressing rooms all the way to the pitch ! It’s a marvellous place to see.\n\nFood is available with your basic fast food rations etc ", "publishedDate": "2020-03-02", "language": "en", "rating": 5}, {"id": 748680794, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d271009-r748680794-Camp_Nou-Barcelona_Catalonia.html", "text": "Was told at the beginning of the tour we HAD to pay €6 for an audio guide that was not included in the ticket price.  Was  able to press  1 for the first part of the guide after which the phone threw me out to a locked screen asking for an administrator password and would not do anything when I touched the screen Tried to explain this when handing the handset back in but they just said it was working and sorry about that. Asked at the place where we bought the tickets and they said we had to go back in to the museum to fill out a form for a refund exactly where all they could do was say it was working and sorry.", "publishedDate": "2020-03-02", "language": "en", "rating": 1}, {"id": 748644926, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d271009-r748644926-Camp_Nou-Barcelona_Catalonia.html", "text": "Amazing experience for a big football fan like myself, was a breathtaking experience being in the middle of the crowd for a match!", "publishedDate": "2020-03-01", "language": "en", "rating": 5}, {"id": 748572918, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d271009-r748572918-Camp_Nou-Barcelona_Catalonia.html", "text": "Been here several times but love to come back. Bought out tickets at the ticket office only to be told at the entrance that we only had an hour left to go round!! Why didn’t they tell us this when we bought the tickets, we could have come back the next day. Quite irresponsible. The tour was very rushed so we didn’t get the most out of it which was disappointing. I love Barcelona FC and always will but felt a bit cheated today! ", "publishedDate": "2020-03-01", "language": "en", "rating": 4}, {"id": 748534108, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d271009-r748534108-Camp_Nou-Barcelona_Catalonia.html", "text": "We booked online through Klook travel definately cheaper to do this than buying there. We booked a basic tour when we got there we were advised to get audio equipment which was 6euros each which agreed was useful. If you want the visual experience it's another 6 euros so best to decide what you actually want out of tour and book appropriate package. Great tour loved it.", "publishedDate": "2020-03-01", "language": "en", "rating": 5}, {"id": 748490188, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d271009-r748490188-Camp_Nou-Barcelona_Catalonia.html", "text": "Football fan or not, the stadium is full of wow's! It's huge! You can learn the history with an audio tour, or just take a self tour around the grounds. Ticket prices are  definitely value for money.", "publishedDate": "2020-03-01", "language": "en", "rating": 5}, {"id": 748445523, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d271009-r748445523-Camp_Nou-Barcelona_Catalonia.html", "text": "Extremely enjoyed our visit to Camp Nou in February. We completed the audio tour and visual experience which was great. \n\nStaff very helpful and I expected people to rush us but they never you can take as many photos and at own leisure. \n\nHighly recommend if visiting Barcelona. ", "publishedDate": "2020-03-01", "language": "en", "rating": 5}, {"id": 748430518, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d271009-r748430518-Camp_Nou-Barcelona_Catalonia.html", "text": "We had hoped to see a match but this tour was the next best thing. Great value as we spent nearly four hours there. Pitch side, in the dugout, in the stands, the press box, the tunnel from the changing rooms and the museum. The VR experience was definitely worth it too.\nHad a great afternoon at the Camp Nou and would definitely recommend.", "publishedDate": "2020-02-29", "language": "en", "rating": 5}, {"id": 748293410, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d271009-r748293410-Camp_Nou-Barcelona_Catalonia.html", "text": "This was my 2nd trip to the stadium having visited Oct 19 for my son's birthday treat. We sat behind the North goal which is Barca fans end. The atmosphere there was great. The hard core fans didn't stop singing and dancing all game long.\n\nThis game was Saturday afternoon which is a great time to go as last visit we did a 9pm game and return travel was a little more difficult later at night.\n\nIf you get the chance GO see a game a Camp Nou!!", "publishedDate": "2020-02-29", "language": "en", "rating": 5}, {"id": 748247654, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d271009-r748247654-Camp_Nou-Barcelona_Catalonia.html", "text": "What an amazing experience. Watched Barcelona and enjoyed night with a good restaurant and good clubs in Barcelona !", "publishedDate": "2020-02-28", "language": "en", "rating": 5}, {"id": 748158211, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d271009-r748158211-Camp_Nou-Barcelona_Catalonia.html", "text": "If going to a live game, get there early and soak up the atmosphere. Great facilities at the stadium", "publishedDate": "2020-02-28", "language": "en", "rating": 5}, {"id": 748061417, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d271009-r748061417-Camp_Nou-Barcelona_Catalonia.html", "text": "The experience of this place is awesome! I understand why they say its more than just a club.....Its a lifetime experience! \nAnd the main reason of its being that is the football! Barcelona football club is the definetly one of the best clubs in the world! I watched them annihilate another team by 6 -1!", "publishedDate": "2020-02-27", "language": "en", "rating": 5}, {"id": 747797312, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d271009-r747797312-Camp_Nou-Barcelona_Catalonia.html", "text": "Did not have time for a guided tour but wonderful how allowed to walk around, even to edge of pitch.", "publishedDate": "2020-02-26", "language": "en", "rating": 4}, {"id": 747573040, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d271009-r747573040-Camp_Nou-Barcelona_Catalonia.html", "text": "Visited here on Saturday 22nd of February with my partner who was celebrating his 30th birthday. Our stadium tour was a gift from a family member that I had booked on their behalf. Arrived at the stadium an hour or so early asked if we could be taken early told no. Wandered around killed time and eventually made our way to the stadium tour starting point . \n\nWhen we were greeted by the female member of staff and showed her our tickets she said no tour was available only entry to museum as there was now a game on the day. She said we weee told this when we booked which we certainly were not as if this had been the case we would've opted for an Earlier time. Long story short we were rudely told we could only attend the museum and that no tour was available . I explained this was a 30th birthday gift and we have travelled all the way from Scotland . The lady couldn't have cared less and just kept repeating that there was a game and we knew this in advance which was a total lie. \n\nWill never be back and Barcelona camp nou should be ashamed of themselves for putting such a dampener on what should've been a great experience", "publishedDate": "2020-02-25", "language": "en", "rating": 1}, {"id": 747476292, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d271009-r747476292-Camp_Nou-Barcelona_Catalonia.html", "text": "An interesting tour with a guide on a mobile device, not always clear when to use it as the numbers were not always displayed clearly on exhibits.\nTrophy room was amazing, and the 360 VR headset was very good", "publishedDate": "2020-02-24", "language": "en", "rating": 5}, {"id": 747398503, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d271009-r747398503-Camp_Nou-Barcelona_Catalonia.html", "text": "We had a great tym going around the camp nou and museum. Its important for every barca fan to know what it feels like to be inside the camp nou and experience it.", "publishedDate": "2020-02-24", "language": "en", "rating": 5}, {"id": 747389020, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d271009-r747389020-Camp_Nou-Barcelona_Catalonia.html", "text": "On Friday 21st February we bought 2 tickets to visit the museum and the stadium. The tickets were discounted at €20 each (instead of €26) because, as indicated on the website, the visit to the stadium would be offered in a limited way compared to the  usual due to matches scheduled in the following days. Aware of this, despite the fact that the museum was of little interest to us and the reason for our visit was only the stadium, we consciously decided to buy the tickets (€ 40 in all) with visiting hours scheduled at 15.00. Arrived at the stadium, the very kind gentleman at the entrance reminded us that the visit to the stadium would have only be an “overview\" and reiterates this in order to clearly avoid problems. Aware of this, we thank him, and we approached the entrance. We quickly visited the museum and afterward went directly toward the entrance of the stadium where, surprisingly, a gentleman informed us that “the stadium is closed to visits from 3pm, if you have problems with that you should complain at the entrance\". Embittered, we went back to the entrance and talked to a lady who wanted to reiterate that we bought discounted tickets and that therefore it could have happened that the stadium would have been closed. We therefore informed the lady that the tickets were certainly discounted but the discount was already justified by a limited visit to the stadium and NOT an impossibility to see the stadium. We took the young lady perhaps to the point where she found herself admitting that “we have internal communication problem and we never know at what time the stadium doors close\". She therefore advised us to ask at the ticket sellers if we could have get a refund. At the cashier then we were invited  to write an email with our concerns. What answer we got? The Tickets cannot be refunded in full or in any other way. \n\nUnfortunately, what left us most speechless is not so much the fact that we gifted 40€ to a club that is certainly not short of funds, but rather the lack of professionalism, inefficiency and incompetence on the part of one of the most important clubs in the world in simply managing transparent communication and visits to a museum! \nYour Real Madrid friends probably know it better!", "publishedDate": "2020-02-24", "language": "en", "rating": 1}, {"id": 747383596, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d271009-r747383596-Camp_Nou-Barcelona_Catalonia.html", "text": "What an amazing experience. Watched Barcelona play and did the tour and museumm the day after. Absolutely fantastic. Barcelona is a beautiful place too.", "publishedDate": "2020-02-24", "language": "en", "rating": 5}, {"id": 747333783, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d271009-r747333783-Camp_Nou-Barcelona_Catalonia.html", "text": "Great tour so much to see in the museum alone. Trophy after trophy, Although some appear to be missing around 1982/83!!!!   We had the audio guide which we were late starting. You need to have this on as you go in, but even then it’s hard to listen to it all, so we skipped to the eras we both related to. After you ve done the museum it’s out into the wonderful structure that is Camp Nou. Even from watching the game the day before you get such an appreciation of its vastness going from pitch side to the heavens of the press boxes. An absolute must is the VR experience for €6. Walking alongside the likes of Messi and Suarez into training and out onto the pitch. I’d allow 2 to 3 hours to take in all the information and savour the experience. The 2 days were amazing the only downside being the cost of the replica kits at around €95. Amazing place, amazing experience amazing team.", "publishedDate": "2020-02-24", "language": "en", "rating": 5}, {"id": 747061044, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d271009-r747061044-Camp_Nou-Barcelona_Catalonia.html", "text": "Why would you go? It's a beautiful stadium. And the biggest reason is ofcourse Messi. \nIt's bigger then expected. Atmosphere could be better, because of the many tourists, but yeah..", "publishedDate": "2020-02-23", "language": "en", "rating": 5}, {"id": 746975046, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d271009-r746975046-Camp_Nou-Barcelona_Catalonia.html", "text": "Football fanatic must go to live match!! Wow just wow!! Family friendly! Beware lots of stairs! Amazing atmosphere ", "publishedDate": "2020-02-23", "language": "en", "rating": 5}, {"id": 746915974, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d271009-r746915974-Camp_Nou-Barcelona_Catalonia.html", "text": "We booked ahead online a couple of months before travelling to Barcelona which I would recommend doing as we could pick our entrance time. We are big Barca fans and the stadium just blew us away! Really pleased we made it part of our trip to Barcelona and would highly recommend to anyone whether interested in football or not!", "publishedDate": "2020-02-23", "language": "en", "rating": 5}, {"id": 746691543, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d271009-r746691543-Camp_Nou-Barcelona_Catalonia.html", "text": "We went on this tour because as a Southend fan I thought it would be nice to see a proper trophy room!\n\nIt was an excellent tour, you get to go on the pitch side and in the press box, and I found the history of the club very interesting.", "publishedDate": "2020-02-22", "language": "en", "rating": 5}, {"id": 746644463, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d271009-r746644463-Camp_Nou-Barcelona_Catalonia.html", "text": "Terrible experience. Due to them ‘preparing’ for a match that evening (we visited mid afternoon) we were restricted to the trophy museum only with no possibility of a discount on the price of the ticket and no access to the stadium which was the primary reason for our visit. Naturally they still try and push addaitional money making extras on you and you can’t exit the museum without walking through the shop where they try to relive you of more money.", "publishedDate": "2020-02-22", "language": "en", "rating": 1}, {"id": 746542532, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d271009-r746542532-Camp_Nou-Barcelona_Catalonia.html", "text": "Bought tickets direct with Barcelona FC for sons 18th! He loves football. Booked a tour with audio guide and virtual reality experience headgear. Definitely the best ticket! Arrived via metro at le camps on green line and walk direct to Camp Nou with sign posts. About 10 mins. Having got tickets, walked straight to check in where we collected audio in English. Then you get a family photo which can be used as a photo package at the end of the tour.  The audio is like a phone with an ear piece. It works ok but prefer handheld device to ear that sagarda familia uses. Numbers in museum do not go in order so if you have a child who likes numerical order this could be an issue. The museum is ok and shows the history and achievement of the club. You can wander at your own pace. You get to visit the away dressing room and then go through the tunnel to the ground. This as an amazing view! Even for a non football fan! You can takes photos and sit in the stands as long as you wish. Then you get to take official photos on a card which you can choose to buy at the end of the tour. We enjoyed the virtual reality experience which gives you a sense of what it would be like on a match day. Definitely op for this even though it's only short. You get to go higher on your tour. My husband doesn't like heights so we diverted this section. Then my son loved having a virtual photo with Messi! At the end of the tour you are given a chance t buy a selection of photos. They are not pushy. We ended up buying the full set as a birthday treat! However you can also go out without buying. Staff were lovely and patient when viewing photos. We visited the shop and bought a cap. My son would have loved a shirt but 170 euros was way too much!!! \nMy son has spoken about this visit a lot and it will remain his best experience if Barcelona! It might not be the cheapest of visits but a once in a lifetime experience! We were there for nearly 3 hours.\nWould recommend.", "publishedDate": "2020-02-21", "language": "en", "rating": 5}, {"id": 746454786, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d271009-r746454786-Camp_Nou-Barcelona_Catalonia.html", "text": "We are Barcelona supporters and have been before the tour is great and when you get to top of stadium you realise how big it is the game we watched charged with energy very friendly and safe with beer, drinks and food available", "publishedDate": "2020-02-21", "language": "en", "rating": 5}, {"id": 746381141, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d271009-r746381141-Camp_Nou-Barcelona_Catalonia.html", "text": "My husband and I have visited Camp Nou 6 times, but this was our first visit with the family. Which made it special.\nWe had fairly good seats, and the grandchildren said that it was the hi light of our visit to Barcelona. Yes it is expensive, but making memories for the grandchildren is priceless. \n", "publishedDate": "2020-02-20", "language": "en", "rating": 5}, {"id": 746374458, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d271009-r746374458-Camp_Nou-Barcelona_Catalonia.html", "text": "Visited this iconic place early morning on a Sunday. Was quiet, but soon got busy. It’s a must for all football fans! The tour itself is interesting, but to see the stadium, memorabilia, trophies and photos is something else. You can spend as long as you like there. Taking it all in. Well worth the price in my opinion. Suitable for adults and children. The stadium shop is awesome! Only regret is Barcelona FC were playing away that weekend!", "publishedDate": "2020-02-20", "language": "en", "rating": 5}, {"id": 746366058, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d271009-r746366058-Camp_Nou-Barcelona_Catalonia.html", "text": "Growing up in the States i was never really exposed to futball (soccer). My cousin had recommended that we take a stop here on our trip. I have to say that i was very happy that I did. The energy here rivals Yankee stadium, with out the over priced concessions. Barcelona is a amazing team and city. I strongly recommend that you make this a stop on your trip to Barcelona. ", "publishedDate": "2020-02-20", "language": "en", "rating": 5}, {"id": 746226492, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d271009-r746226492-Camp_Nou-Barcelona_Catalonia.html", "text": "Probably a great tour for fans of the team but 30 euros per person to tour a trophy gallery seemed a bit much.  The brand of merchandise in the team shop was next level.", "publishedDate": "2020-02-19", "language": "en", "rating": 3}, {"id": 746098433, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d271009-r746098433-Camp_Nou-Barcelona_Catalonia.html", "text": "it's not the most modern of stadiums , far from it, but it's an incredible place to watch football - the noise when Barca score is like nothing I've ever experienced before and I've watch sport all over the world - the stadium tour is great to - well worth the money . The ground is about to go through a major rebuild so will be more like some of the modern stadia in the next 5 years, but I really hope this isn't at the expense of the incredible atmosphere in what is truly one of the grand old grounds of football ( or any other sport)", "publishedDate": "2020-02-19", "language": "en", "rating": 5}, {"id": 746080209, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d271009-r746080209-Camp_Nou-Barcelona_Catalonia.html", "text": "First time to Barca, what a terrific stadium for football, sights and atmosphere. So easy to access, clean and above all sublime football.", "publishedDate": "2020-02-19", "language": "en", "rating": 5}, {"id": 746032652, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d271009-r746032652-Camp_Nou-Barcelona_Catalonia.html", "text": "We have visited Camp Nou previously on a tour, which was brilliant! However, this visit was to see a game. This was an amazing experience. Such a great atmosphere! We were right at the top so be mindful if you don’t like heights! ", "publishedDate": "2020-02-18", "language": "en", "rating": 5}, {"id": 745978257, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d271009-r745978257-Camp_Nou-Barcelona_Catalonia.html", "text": "I was expecting a super stadium compared to others we didnt rate this one much , unless your a Barcelona fc supporter it'll be a day your never forget ", "publishedDate": "2020-02-18", "language": "en", "rating": 2}, {"id": 745977012, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d271009-r745977012-Camp_Nou-Barcelona_Catalonia.html", "text": "I think this is a must-do experience when visiting Barca. However, as a (stupid) American, there were some surprises. There is no drinking in the stadium and tailgating does not exist. I say this, just in case there are any other first time American sports-fan visitors. :)  I got a VIP ticket which allowed me access to a bar inside the stadium, but the access is only permitted before and after the game, not during. It was kind of like a club-level access. These were not box seats, but they were a great view--about mid-level. I brought a group of 50 people with me, so this kept my guests happy. I would highly recommend.", "publishedDate": "2020-02-18", "language": "en", "rating": 5}, {"id": 745962600, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d271009-r745962600-Camp_Nou-Barcelona_Catalonia.html", "text": "Used an official site to book tour with audio and VR headset included only downside they wanted a credit card or €25 per person deposit on audio headset/phone when entering was not informed of this on buying online tickets \nBut tour was brilliant  and VR ", "publishedDate": "2020-02-18", "language": "en", "rating": 5}, {"id": 745870328, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d271009-r745870328-Camp_Nou-Barcelona_Catalonia.html", "text": "I spend three hours to this tour due to short timetable but i could have stayed much longer.I think it's a experience every Barcelona fun should have.", "publishedDate": "2020-02-18", "language": "en", "rating": 5}, {"id": 745844846, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d271009-r745844846-Camp_Nou-Barcelona_Catalonia.html", "text": "As a die hard fan my young son loved every second of this tour. Changing rooms, press room, tunnel, dugouts, pitchside.", "publishedDate": "2020-02-17", "language": "en", "rating": 5}, {"id": 745708645, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d271009-r745708645-Camp_Nou-Barcelona_Catalonia.html", "text": "A great day out for our football mad kids, the audio guide was good and the virtual experience was worth the extra cost. Only disappointment was not getting to see the home teams changing room", "publishedDate": "2020-02-17", "language": "en", "rating": 5}, {"id": 745704013, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d271009-r745704013-Camp_Nou-Barcelona_Catalonia.html", "text": "Fantastic stadium.  You can pick up tickets online for most games (except El Classico), or from the official FC Barcelona shops in town. Take metro and get off at either Les Corts or Palau Reial, depending on your entrance: it doesn’t really matter as its only a 5-10 minute walk. You can take bags but if you have metal refillable water bottles they will take them from (you can pick them up really easily after the game). Even seats at the very top have great view, although it’s quite steep, so not for vertiginous people! No programmes :(.", "publishedDate": "2020-02-17", "language": "en", "rating": 5}, {"id": 745689536, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d271009-r745689536-Camp_Nou-Barcelona_Catalonia.html", "text": "This huge stadium is a thing of beauty. Easy to find and hardly a queue anywhere to get in. A tube station is 10 minute walk away. The stadium tour is great. Very detailed. But there is a couple of issues with it. 1 there is wax no mention of Bobby Robson. The man is a rarity in world football. And 2 theres a lot of info and memorabilia about handball and basketball. So maybe skip that then ", "publishedDate": "2020-02-17", "language": "en", "rating": 4}, {"id": 745673759, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d271009-r745673759-Camp_Nou-Barcelona_Catalonia.html", "text": "We booked the tour on a match day - so this means only getting the trophy room tour but that was enough as it was amazing. We got to see all the trophies, gloves, golden boots and get a photo take with your hero - what's not to like. Shame we missed the pitch tour and dressing room but the film reels, photos, artefacts and trophies did not disappoint.", "publishedDate": "2020-02-17", "language": "en", "rating": 5}, {"id": 745658430, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d271009-r745658430-Camp_Nou-Barcelona_Catalonia.html", "text": "Experience of a lifetime..for any football fan. We took the basic tour which included many things to see - trophies display, walk into the ground on the side lines and press area etc.. you should not miss this experience..", "publishedDate": "2020-02-17", "language": "en", "rating": 5}, {"id": 745622024, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d271009-r745622024-Camp_Nou-Barcelona_Catalonia.html", "text": "My Son and I did this as part of our weekend after the game on the Saturday. The experience lead me to realise the phrase ‘Mes que un Club’ and it’s meaning. It’s not the trophies , yet there are more than you’ll see at most clubs inc CL and EC Trophies and The Messi Ballon d’Or’s - it explains the history and celebrates the people and players along with the culture it has created. You get to see the stadium of course but it is worth the extra to have the Virtual Reality experience and the Audio Tour. You finish of course in the store to buy a hero shirt or other memorabilia.   I would allow 2 hours at a reasonable and considered pace but we fully enjoyed.", "publishedDate": "2020-02-17", "language": "en", "rating": 5}, {"id": 745539699, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d271009-r745539699-Camp_Nou-Barcelona_Catalonia.html", "text": "I visited with family .\nWe liked every single minute there in the museum and stadium .\nIf you r in Barcelona .must visit this stadium .", "publishedDate": "2020-02-16", "language": "en", "rating": 5}, {"id": 745527994, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d271009-r745527994-Camp_Nou-Barcelona_Catalonia.html", "text": "Iconic 1950s no frills concrete all atmosphere must see football stadium! Great for everyone, saw families, couples, older adults, groups of friends of all ages, genders, etc! Barcelona won the game as well so it was quite amazing! ", "publishedDate": "2020-02-16", "language": "en", "rating": 5}, {"id": 745457125, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d271009-r745457125-Camp_Nou-Barcelona_Catalonia.html", "text": "If love football or history of big clubs of different sports, it is the place to be.\nYou will feel fortunate with locker rooms, press conference hall and even going into the pitch.\nA must in your visit to the city", "publishedDate": "2020-02-16", "language": "en", "rating": 5}, {"id": 745348680, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d271009-r745348680-Camp_Nou-Barcelona_Catalonia.html", "text": "This review is going to be short but what else can a man with his heart bearing for Barcelona can say other than - This is one of my very best and top places to ever visit! Both during daytime as well as during play time!!! Forca Barca!", "publishedDate": "2020-02-15", "language": "en", "rating": 5}, {"id": 745265989, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d271009-r745265989-Camp_Nou-Barcelona_Catalonia.html", "text": "At the end, there is much to see: you walk thru the whole stadium & its diverse areas after the museum", "publishedDate": "2020-02-15", "language": "en", "rating": 4}, {"id": 745096891, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d271009-r745096891-Camp_Nou-Barcelona_Catalonia.html", "text": "This is one of the best football tours I’ve had! Just when you think that the tour is over, there’s so much more too add onto it & you find yourself in a different area! The information provided to you is so detailed and in general the tour is just a must do! Amazing!", "publishedDate": "2020-02-14", "language": "en", "rating": 5}, {"id": 745070966, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d271009-r745070966-Camp_Nou-Barcelona_Catalonia.html", "text": "Although a bit pricey, we spent a good amount of time here and there is alot to see and do.  You walk thru the whole stadium including where media personal and sport commentators report on the game.  Buy your tickets ahead of time.  We had our daughter with us in a lightweight umbrella stroller.  You can use it while pushing throughout the stadium but there is no access to the elevators (except for those in wheelchairs).  So keep in mind when having to go up and down stairs to the next levels, keep it light.", "publishedDate": "2020-02-14", "language": "en", "rating": 5}, {"id": 744795326, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d271009-r744795326-Camp_Nou-Barcelona_Catalonia.html", "text": "Amazing experience, worth it!!!!! It is better to buy The ticket online, and The tour Take at least one hour, you Will see The museum, The stadium and a lot of things, lockrooms, shop", "publishedDate": "2020-02-13", "language": "en", "rating": 5}, {"id": 743909967, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d271009-r743909967-Camp_Nou-Barcelona_Catalonia.html", "text": "Barcelona is one of the shrines of football that I had the opportunity to go on my trip. I am very lucky to see this place. I recommend buying your tickets online. Lastly there was a fee of 26 Euros. By paying this price, you see the museum, changing rooms and press rooms, tribunes and inside the field, respectively. Extra fees are charged for some special areas (press conference table, etc.). You are also directed to the store at the exit. I recommend this place to anyone who is interested in football and goes to Barcelona.", "publishedDate": "2020-02-09", "language": "en", "rating": 5}, {"id": 743909008, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d271009-r743909008-Camp_Nou-Barcelona_Catalonia.html", "text": "My husband loved it, he is a big football fan and it is definitely worth visiting, \nif you like sports you must go", "publishedDate": "2020-02-09", "language": "en", "rating": 5}, {"id": 743907367, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d271009-r743907367-Camp_Nou-Barcelona_Catalonia.html", "text": "First time visit there and a spontaneous one too. We stopped outside but didnt know you could do a stadium tour so thought why not. The place is amazing and the staff are friendly .. If you love football you will love this place. So much to see and the 2 hours goes quick. Hopefully next time im there will be to watch a live game .. ", "publishedDate": "2020-02-09", "language": "en", "rating": 5}, {"id": 743871091, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d271009-r743871091-Camp_Nou-Barcelona_Catalonia.html", "text": "What a great place to watch a match. The pre match entertainment was also very good. Just a very happy atmosphere also unusually for a football ground the food and drink wasn’t mega expensive. ", "publishedDate": "2020-02-09", "language": "en", "rating": 5}, {"id": 743517549, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d271009-r743517549-Camp_Nou-Barcelona_Catalonia.html", "text": "The stadium is massive and it was great to see it in person, it was def a unforgettable time. Thanks", "publishedDate": "2020-02-07", "language": "en", "rating": 5}, {"id": 743499046, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d271009-r743499046-Camp_Nou-Barcelona_Catalonia.html", "text": "Nice experience.... Really organized tour... Huge field, great museum full of trophees, pictures, videos etc.... We had an interesting morning at the Camp Nou...", "publishedDate": "2020-02-06", "language": "en", "rating": 4}, {"id": 743393047, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d271009-r743393047-Camp_Nou-Barcelona_Catalonia.html", "text": "I loved my trip to nou camp to watch the match and see Messi and the Boyz. I went on the weekend of January 17-19. I been lucky to go a few times now. It's a good atmosphere and the staff are really helpful in finding your correct seat. I book my match tickets online which is easy using Barca app. There are hot dog stalls in the nou camp which are delishous. If you can get match tickets you must go as it's amazing experience.", "publishedDate": "2020-02-06", "language": "en", "rating": 3}, {"id": 743328616, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d271009-r743328616-Camp_Nou-Barcelona_Catalonia.html", "text": "Because when you’re in Barcelona, you want to watch a match with one of the best clubs in the world. \n\nSoak in the atmosphere of the crowd, band, and the players. And hear the roar when a goal is scored.\n\nBarcelona FC supporters should sit around gates 64-73 for the best views. ", "publishedDate": "2020-02-05", "language": "en", "rating": 5}, {"id": 743165030, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d271009-r743165030-Camp_Nou-Barcelona_Catalonia.html", "text": "Tour was interesting and always nice to get behind the scenes.  Didn't get into home changing room for some reason but views from pitch side as well as the media area were excellent.  Purchased tickets through 3rd party company in 4th tier.  View was excellent, stadium staff were excellent and helpful and the stadium is very well organised compared to some English grounds I've been to. ", "publishedDate": "2020-02-05", "language": "en", "rating": 5}, {"id": 743147718, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d271009-r743147718-Camp_Nou-Barcelona_Catalonia.html", "text": "Enjoyed tour but buying the photos at the end was very misleading, paid €40 for one photo in book plus the rest on digital but when got email has to pay a further £24 to download this was not explained at the time.", "publishedDate": "2020-02-04", "language": "en", "rating": 4}, {"id": 743060579, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d271009-r743060579-Camp_Nou-Barcelona_Catalonia.html", "text": "Fantastic atmosphere and history, major experience. Museum and stadium tour worth visiting allow at least a couple of hours or more ", "publishedDate": "2020-02-04", "language": "en", "rating": 5}, {"id": 742695646, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d271009-r742695646-Camp_Nou-Barcelona_Catalonia.html", "text": "Excellent tour.\nLittle confusing about audio. Thought was included in price. Cost extra.\nVery informative and interesting tour.\nIf you speak English or Spanish no need for audio assistance. I stopped using it after a few attractions and read the blurb instead.", "publishedDate": "2020-02-02", "language": "en", "rating": 5}, {"id": 742533451, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d271009-r742533451-Camp_Nou-Barcelona_Catalonia.html", "text": "The Museum is interesting and covers the whole story of the FC Barcelona. The technology is state of the art and user friendly. Then the walking tour inside the stadium is easy and you get to the pitch itself. I have been a Barca fan all my life and a I could not help to get a little bit emotional. The staff was friendly and helpful. The only detail I didn't like was the condition of the seats in the stands. For such a big club, I thought they would be better. The final stop is the store. The floors of Barca merch made my teenagers extremely happy.", "publishedDate": "2020-02-01", "language": "en", "rating": 5}, {"id": 742216659, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d271009-r742216659-Camp_Nou-Barcelona_Catalonia.html", "text": "Fantastic football ground highly recommended to any football fan and neutral the history like other teams is interesting worth a look always try to book ahead ", "publishedDate": "2020-01-31", "language": "en", "rating": 5}, {"id": 742128791, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d271009-r742128791-Camp_Nou-Barcelona_Catalonia.html", "text": "We are not the biggest football fans but the museum and Camp is definitely worth a visit if you are in Barcelona.\nThe history and information in the museum is worth reading, especially about Cruyff a real legend.", "publishedDate": "2020-01-30", "language": "en", "rating": 4}, {"id": 742122745, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d271009-r742122745-Camp_Nou-Barcelona_Catalonia.html", "text": "If you visit Barsa you must see a stadium and by a camp nou tour. I want to note that it will be cheaper to buy a ticket online, as I did )) They have free wifi near the ticket window and to do it will be easy. \nInside you will find fun shop, very beautiful musem of football, basketball and other Barca's teams, player's locker room, conference room etc.\n\nIt woth visiting", "publishedDate": "2020-01-30", "language": "en", "rating": 5}, {"id": 741881251, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d271009-r741881251-Camp_Nou-Barcelona_Catalonia.html", "text": "Great experience watching one of the greats play. Very fun atmosphere in the stadium. One caveat: No alcohol sold in the stadium. I did not know that was the case, it was weird watching a sporting event with a beer in hand.", "publishedDate": "2020-01-28", "language": "en", "rating": 4}, {"id": 741867636, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d271009-r741867636-Camp_Nou-Barcelona_Catalonia.html", "text": "Even if you are not a huge soccer fan, you should still visit this stadium and watch a soccer match. The atmosphere was fantastic. We were happy with our cheapest tickets even we were sitting pretty high up. Metro station is near by. But after the game the station is very busy. Took us over an hour to buy metro tickets and get on the train. ", "publishedDate": "2020-01-28", "language": "en", "rating": 4}, {"id": 741642212, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d271009-r741642212-Camp_Nou-Barcelona_Catalonia.html", "text": "One of the most amazing experiences of my life seeing a live game in barcelona ❤️ incredible just wow❤️", "publishedDate": "2020-01-27", "language": "en", "rating": 5}, {"id": 741615565, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d271009-r741615565-Camp_Nou-Barcelona_Catalonia.html", "text": "We had the luck of visiting on a Match Day.  So in addition to purchasing game tickets, we also booked the 'Match Day Tour.'  This tour was a small (about 20 people) guided tour that took you into the stadium and behind the scenes on match day ... to the media room, onto the pitch, down the hall that the players walk down to hit the field, past the chapel, etc.  Worth it for any FCB fan!", "publishedDate": "2020-01-27", "language": "en", "rating": 5}, {"id": 741467320, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d271009-r741467320-Camp_Nou-Barcelona_Catalonia.html", "text": "Impressive stadium and shop. Stadium tour excellent but a little expensive for a family trip.\nThe teenage boys enjoyed seeing the trophies and inside the dressing rooms.", "publishedDate": "2020-01-26", "language": "en", "rating": 3}, {"id": 741409500, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d271009-r741409500-Camp_Nou-Barcelona_Catalonia.html", "text": "That was the first place we visited. Actually it was the reason to go to Barcelona. And was amazing and impressive. We really enjoyded it at 100%. For sure will go back to watch a match. Thanks for the experience. With love from Bulgaria❤❤❤🔝⚽️🔝", "publishedDate": "2020-01-26", "language": "en", "rating": 5}, {"id": 741405182, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d271009-r741405182-Camp_Nou-Barcelona_Catalonia.html", "text": "The VIP experience is amazingly priceless and I definitely recommend if you don’t like massive and lo g cues because these are private tours with official guide that explains all the details gets you it into the changing room from the FCBarcelona famous players are prior the match...", "publishedDate": "2020-01-26", "language": "en", "rating": 5}, {"id": 741397083, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d271009-r741397083-Camp_Nou-Barcelona_Catalonia.html", "text": "We visited as a family of four as a treat for my son's 18th Birthday and it was well worth the extra price paid for the VIP Player Experience. Our tour guide was excellent, clearly a real life long fan of football and particularly Barcelona FC. Despite the bad weather, the club didn't allow this to spoil our enjoyment and moved events around to accommodate us indoors. Being able to access 'off-limits' areas and see places that only the players would normally get to see was very enjoyable and really appealed to our son. The package included a gift from the club, access to exclusive areas of the stadium, a selection of professional photographs, a virtual reality experience and full access to the FC Barca Museum. We spent an excellent and memorable day at Camp Nou, made lots of memories and purchased many souvenirs in the Club Shop. We can't wait to visit again, and next time to catch a game and soak up the incredible atmosphere.", "publishedDate": "2020-01-26", "language": "en", "rating": 5}, {"id": 741385063, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d271009-r741385063-Camp_Nou-Barcelona_Catalonia.html", "text": "My third visit here, this time with husband who has not been before. Interesting tour, well kept ground and the place to coem if you want a Barcelona fc footy shirt, there are hundreds of them for sale in a three story souvenir store. Looks lovely and green but then that would be the astroturf, no green grass here. Fascinating trophy room and display including Lionel Messi's six Ballon d'Or awards. Well worth a visit. Doe sget extremely busy so go as early as you can to miss the crowds.", "publishedDate": "2020-01-26", "language": "en", "rating": 4}, {"id": 741265644, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d271009-r741265644-Camp_Nou-Barcelona_Catalonia.html", "text": "I don’t know what to say. Firstly me and my gf went to Barca - Granada match and it was unbelievable! Then we went to the Barca museum and we were amazed.", "publishedDate": "2020-01-25", "language": "en", "rating": 5}, {"id": 741165714, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d271009-r741165714-Camp_Nou-Barcelona_Catalonia.html", "text": "Niether me nor my husband like football, but we couldnt skip visiting camp nou during our visit to Barcelona.. It has an amazing atmosphere and you feel you want to watch a match here especially in NC the panaromic view seats.. worth a visit, and for fans, there is a musem in which you can find lots of history about Barcelona team and championships..", "publishedDate": "2020-01-25", "language": "en", "rating": 4}, {"id": 741129929, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d271009-r741129929-Camp_Nou-Barcelona_Catalonia.html", "text": " I particularly enjoyed the walk through the accolades room. Especially the size of the thophies. They were magnificent. ", "publishedDate": "2020-01-25", "language": "en", "rating": 5}, {"id": 741001578, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d271009-r741001578-Camp_Nou-Barcelona_Catalonia.html", "text": "I like football but am not a massive fan and I enjoyed myself. My other half enjoys football a lot more than me, and he found it very interesting. We bought the audio guide but decided we didn't need it. If you're an avid Barcelona FC fan, I would say you don't really need the audio guide. Otherwise would highly recommend a visit. ", "publishedDate": "2020-01-24", "language": "en", "rating": 5}, {"id": 740929324, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d271009-r740929324-Camp_Nou-Barcelona_Catalonia.html", "text": "My first game and not last!! Absolutely loved the atmosphere, the stadium was huge. I watched FC Barcelona V Granada. Awesome game, will defo do it again. Camp nou was easy to get to by metro. ", "publishedDate": "2020-01-24", "language": "en", "rating": 5}, {"id": 740854958, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d271009-r740854958-Camp_Nou-Barcelona_Catalonia.html", "text": "A UK visitor, felt very welcome! Was easy to get in and was an amazing atmosphere. Really good experience, no faults!", "publishedDate": "2020-01-23", "language": "en", "rating": 5}, {"id": 740853798, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d271009-r740853798-Camp_Nou-Barcelona_Catalonia.html", "text": "Visited for the third time and was not disappointed. Every time I go I learn something new. The VR experience is worth the extra €5 and gives you a good feel of what a match day is like if you’re not lucky enough to be going. \n\n€150 to get access into the Barcelona team changing room is very expensive, however. ", "publishedDate": "2020-01-23", "language": "en", "rating": 4}, {"id": 740682980, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d271009-r740682980-Camp_Nou-Barcelona_Catalonia.html", "text": "Visited here to watch Barcelona play, was not disappointed. Awesome stadium, electric atmosphere and fantastic football. An experience everyone should have. Easy to find, stadium tour is worth doing and the area around the stadium is lovely, with shops , bars and restaurants. Can't wait to go again  !!! ", "publishedDate": "2020-01-22", "language": "en", "rating": 5}, {"id": 740615399, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d271009-r740615399-Camp_Nou-Barcelona_Catalonia.html", "text": "Incredibly well organised and a fully engrossing experience for fans. You can literally buy any type of club merchandise from the slick outlets on site, and the stadium tour is wonderful. Just make sure you bring plenty of cash, as it’s not cheap. Best way to get here is on one of the many city tour buses which drops/picks up tight outside the entrance.", "publishedDate": "2020-01-22", "language": "en", "rating": 4}, {"id": 740437344, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d271009-r740437344-Camp_Nou-Barcelona_Catalonia.html", "text": "This ws one of my favourit tours in Barcelona. You walk around the stadium, you see the museum, all the thropys, and when you acces the field, oh god, it is just breath taking. Imagine ", "publishedDate": "2020-01-21", "language": "en", "rating": 5}, {"id": 740437343, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d271009-r740437343-Camp_Nou-Barcelona_Catalonia.html", "text": "This ws one of my favourit tours in Barcelona. You walk around the stadium, you see the museum, all the thropys, and when you acces the field, oh god, it is just breath taking. Imagine ", "publishedDate": "2020-01-21", "language": "en", "rating": 5}, {"id": 740391337, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d271009-r740391337-Camp_Nou-Barcelona_Catalonia.html", "text": "Only went to the shop, but was surprised to see what they have laid on out the back of the shop between the ground and the shop, lots to do for the whole family. and all free to take part in. We really enjoyed it.  ", "publishedDate": "2020-01-21", "language": "en", "rating": 5}, {"id": 740376808, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d271009-r740376808-Camp_Nou-Barcelona_Catalonia.html", "text": "Finally got to see a match at Camp Nou AND got to see the great Lionel Messi live AND score the only goal of the game. Took the stadium tour the day before, which was great - being a Spurs fan, the trophy rooms had me green with envy. ", "publishedDate": "2020-01-20", "language": "en", "rating": 5}, {"id": 740351543, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d271009-r740351543-Camp_Nou-Barcelona_Catalonia.html", "text": "This is a bucket list experience!\nAttended a match! Wow, watching the famous Barcelona Football Club in action, live is breathtaking. Definitely a highlight. Messi scoring a hat trick and final score of 6-1!\nAlso did the Stadium tour! Well organised.\nI would do it again!", "publishedDate": "2020-01-20", "language": "en", "rating": 5}, {"id": 740282522, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d271009-r740282522-Camp_Nou-Barcelona_Catalonia.html", "text": "I was not expecting that the trip will be so organised an super interesting. They show you everything,  inside out. Worth visiting. I loved it. They even sell old grass of the stadium. Loved it", "publishedDate": "2020-01-20", "language": "en", "rating": 5}, {"id": 740258080, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d271009-r740258080-Camp_Nou-Barcelona_Catalonia.html", "text": "Brilliant Stadium, good idea not to have a guided tour so you can walk around at your own leisure and explore this fascinating stadium. A wealth of history to be found out about the club and its presidency’s. Lovely staff too.  ", "publishedDate": "2020-01-20", "language": "en", "rating": 5}, {"id": 740060602, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d271009-r740060602-Camp_Nou-Barcelona_Catalonia.html", "text": "Amazing! You can visit almost all parts of the stadium, it's very interesting! If you're in Barcelona, you must see this even if you're not a football fan!", "publishedDate": "2020-01-19", "language": "en", "rating": 5}, {"id": 740003916, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d271009-r740003916-Camp_Nou-Barcelona_Catalonia.html", "text": "This place is breathtakingly big. You can go on a tour around most of the stadium and it gives you a great insight regarding how it must be to see a real match with one of the worlds largest football teams. ", "publishedDate": "2020-01-19", "language": "en", "rating": 5}, {"id": 739829749, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d271009-r739829749-Camp_Nou-Barcelona_Catalonia.html", "text": "What a great few hours touring this monument in football history. Worth the time and cost of the ticket a fantastic experience.", "publishedDate": "2020-01-18", "language": "en", "rating": 5}, {"id": 739697654, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d271009-r739697654-Camp_Nou-Barcelona_Catalonia.html", "text": "For the people who love football one of the greatest stadium in the world is NEO CAMP .\nI am sure they would not loose it specially match between barcelona and real madrid !!!  ", "publishedDate": "2020-01-17", "language": "en", "rating": 5}, {"id": 739668786, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d271009-r739668786-Camp_Nou-Barcelona_Catalonia.html", "text": "Even though I'm not a huge fan of competitive sport I can appreciate the effort that sports teams put into developing and supporting their champions. Magnificent facilities and show of recognition for the best..not just in football..", "publishedDate": "2020-01-17", "language": "en", "rating": 5}, {"id": 739649387, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d271009-r739649387-Camp_Nou-Barcelona_Catalonia.html", "text": "Enourmous stadium not far from the subway station. You need tickets to get in and you can buy merchandise here. ", "publishedDate": "2020-01-17", "language": "en", "rating": 5}, {"id": 739457925, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d271009-r739457925-Camp_Nou-Barcelona_Catalonia.html", "text": "This stadium as you should know hosts the best football players to have ever graced Earth:\n\nMessi\nRonaldo\nSuarez\nDybala\nRonaldinho.\n\nThat is just a few! \n\nDefiantly a must visit.", "publishedDate": "2020-01-16", "language": "en", "rating": 5}, {"id": 739155551, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d271009-r739155551-Camp_Nou-Barcelona_Catalonia.html", "text": "They say that Camp Nou is one of the must see places while in Barcelona. To be honest the place is amazing and the view is great. But it's waaaay too expensive without any reason. I could say that it's mainly for crazy football fans", "publishedDate": "2020-01-14", "language": "en", "rating": 4}, {"id": 739117739, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d271009-r739117739-Camp_Nou-Barcelona_Catalonia.html", "text": "I had a full day of city excursions planned but told my guide we HAD to go the Camp Nou (for non-soccer fans, this is the home of the Barcelona soccer team).  It is very special to soccer fans, like me!!   The museum located in the stadium is a MUST SEE for soccer fans.  Barcelona is one of the most decorated teams in all of the sport and the artifacts are special; plus the museum has modern interactive displays which are also very special (eg, the first Messi goal for Barca).  Also, this is where the gift shop is located, so expect a long wait to buy that Messi jersey !!!  But my guide, Maria, managed to by-pass the  near hour long line so I was able to  make other attractions !!   Pleas leave plenty of time to fully enjoy.", "publishedDate": "2020-01-14", "language": "en", "rating": 5}, {"id": 739075152, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d271009-r739075152-Camp_Nou-Barcelona_Catalonia.html", "text": "Im a barca fan so for me it's a dream come true. The Stadium is very big and Fancy for me. The design of the stadium almost look alike Roman Colosseum. You have to go there if you visit barcelona. It is the city's icon", "publishedDate": "2020-01-14", "language": "en", "rating": 5}, {"id": 738920374, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d271009-r738920374-Camp_Nou-Barcelona_Catalonia.html", "text": "Very nice experience, make sure that u re buying tickets online so you can avoid the waiting. Whole tour lasts about 2 hrs, but depends on how much you spend for details. If you re a big fan, you re gonna stay there all day haha", "publishedDate": "2020-01-13", "language": "en", "rating": 5}, {"id": 738817129, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d271009-r738817129-Camp_Nou-Barcelona_Catalonia.html", "text": "I was really looking forward to this visit as it was a place I ve always wanted to go to, however I can say that the whole experience was very disappointing. The audio tape was uninformative and did not go in any order.it was very confusing.\nI felt cheated that we were not allowed to go into the away dressing room. Every other football stadium. I have ever visited always incorporates this.\nIt was a very impersonal experience.\nOne I wouldn’t recommend.", "publishedDate": "2020-01-12", "language": "en", "rating": 3}, {"id": 738816362, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d271009-r738816362-Camp_Nou-Barcelona_Catalonia.html", "text": "It's the best place to know FBC history and the chance to walk the ground even short area is impressive to us.", "publishedDate": "2020-01-12", "language": "en", "rating": 5}, {"id": 738661753, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d271009-r738661753-Camp_Nou-Barcelona_Catalonia.html", "text": "Fantastic trip to camp nou , great hospitality and help from all the staff at the stadium and fantastic value for the price \nOnly disappointment was not seeing Liverpool’s 4 goals on the big screens on the tour from last years champions league semi final,\nOops sorry \nOnce again a fantastic trip and tour of the stadium thank you so much", "publishedDate": "2020-01-12", "language": "en", "rating": 5}, {"id": 738656884, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d271009-r738656884-Camp_Nou-Barcelona_Catalonia.html", "text": "Purchased my tickets for the tour and museum, once finalised and paid. The tickets was emailed with a different date on than the one I selected.  After many failed calls, due to no idea? Says their iPhone number is no longer in service.  Around 20/25 emails, date request changes.. still not sorted! \nSo I've had to pay for tickets when I'm not even in Barcelona!! \nShocking service, well no service .. absolutely no reply to any of my emails, requests and their phone doesnt work! Website constantly crashes and is still stuck on 2019 dates!!!!", "publishedDate": "2020-01-12", "language": "en", "rating": 1}, {"id": 738607783, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d271009-r738607783-Camp_Nou-Barcelona_Catalonia.html", "text": "Μικρο γηπεδο και αρα τελεια οπτικη, βλεπεις τους παικτες ακριβως μπροστα σου!! Ειναι εντυπωσιακη η συνθεση του κοσμου, μεγαλες κυριες, παπουδες, οικογενειες...\nSmall court, therefore great visibility, you see the players just in front of you! Its amazing the people who attend basketball games, old ladies and men, families...", "publishedDate": "2020-01-12", "language": "en", "rating": 5}, {"id": 738594344, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d271009-r738594344-Camp_Nou-Barcelona_Catalonia.html", "text": "Loved the virtual experience. Signs were too small or hard to see for the audio tour so did not use it much.", "publishedDate": "2020-01-11", "language": "en", "rating": 5}, {"id": 737819627, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d271009-r737819627-Camp_Nou-Barcelona_Catalonia.html", "text": "We expected more form one of the top world teams. Although the mere size of the venue is worth experiencing, the experience is not that impressive. Buy a game ticket instead even if the team plays in another venue, that is impressive.", "publishedDate": "2020-01-08", "language": "en", "rating": 3}, {"id": 737664997, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d271009-r737664997-Camp_Nou-Barcelona_Catalonia.html", "text": "My friends and I went to watch a soccer game, and it was lots of fun! Had to walk up a lot of stairs, but well worth it to sit and enjoy one of the fun sports entertainment Barcelona has to offer!", "publishedDate": "2020-01-07", "language": "en", "rating": 5}, {"id": 737268049, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d271009-r737268049-Camp_Nou-Barcelona_Catalonia.html", "text": "I visited Camp Nou stadium on 26 December and bought photo package over there. The staff promised me that they’d send me my photo to my email after 2 days. Now it has been weeks and there’s still no photo even after my multiple follow ups. I did receive an auto reply saying that my email is registered so I didn’t put a wrong email. Their photo package is super expensive (like 20€ for 1 photo) and now they didn’t even deliver the product. What a scam!!!\n\nOther than that, the tour is ok. I went to Real Madrid station as well which gives similar experience. It’s good for Barca fan or any football fan in general but just don’t buy any product there. I tried to contact them through different platforms to no availability. ", "publishedDate": "2020-01-06", "language": "en", "rating": 1}, {"id": 737249269, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d271009-r737249269-Camp_Nou-Barcelona_Catalonia.html", "text": "Attractive museum for football lovers (particularly Barça), with history, sports records and trophies plus a spectacular view of the Nou Camp", "publishedDate": "2020-01-06", "language": "en", "rating": 3}, {"id": 736737830, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d271009-r736737830-Camp_Nou-Barcelona_Catalonia.html", "text": "If you are a Barça fan this is a Must! Easy access... I love FCB and I love Camp Nou. For me the Stadium tour is perfect, from la grada, to zona mixta, press conference room, El pasillo, team bench, virtual reality, press palco.", "publishedDate": "2020-01-03", "language": "en", "rating": 5}, {"id": 736732217, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d271009-r736732217-Camp_Nou-Barcelona_Catalonia.html", "text": "This is a very enjoyable guided tour. The guide engagement skill is excellent. Even participants who are not so familiar about Barca can understand easily what he explained. Some private/group photos were taken at the press room and at the field during the tour, and up to 2 photos per person were given for free and digital photos are also downloadable. After the guided tour, the participants can enter the museum.", "publishedDate": "2020-01-03", "language": "en", "rating": 5}, {"id": 736543385, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d271009-r736543385-Camp_Nou-Barcelona_Catalonia.html", "text": "Home stadium of the FC Barcelona foot ball club and this has left us surprised. Access was easy, directions were clear and the number of gates can easily accommodate the huge crowd expected for a Barca match. Only if we could get to see or click a pic with Messi..... Original merchandise and the prices are very affordable, compared to the ones outside sold on the name of the club.", "publishedDate": "2020-01-03", "language": "en", "rating": 5}, {"id": 736540596, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d271009-r736540596-Camp_Nou-Barcelona_Catalonia.html", "text": "I had chance to go at a match and I was very impresionate. The atmosphere, all was very nice. I like FC Barcelona and I was visited eaven the stadium long time ago. But a game is another level.", "publishedDate": "2020-01-03", "language": "en", "rating": 5}, {"id": 736493200, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d271009-r736493200-Camp_Nou-Barcelona_Catalonia.html", "text": "A great stadium to tour.  So much history to see and read about.  The virtaul reality was OK but the graphics need improving.  Staff were veery helpful and friendly.", "publishedDate": "2020-01-03", "language": "en", "rating": 5}, {"id": 735926072, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d271009-r735926072-Camp_Nou-Barcelona_Catalonia.html", "text": "We were able to purchase last minute tickets for 4 to the Barcelona vs Mallorca futbol match. The tourist office helped us and found 4 seats 3 rows from the field. Amazing! The match was awesome and got to see Messi score 3 times. The women’s restrooms need help. No toilet paper holders in the stalls. You have to predict your needs and bring it with you from near the sinks. ", "publishedDate": "2019-12-31", "language": "en", "rating": 4}, {"id": 735869827, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d271009-r735869827-Camp_Nou-Barcelona_Catalonia.html", "text": "As a die hard Barcelona fan this was a must do on my list. I spent hours strolling through the museum, which takes you through the history of the club and city. You will get to see \"relics\" from the yesteryear but also Messis Balon d'Ors and golden boots. The stadium is pretty impressive, if you can afford the virtual experience I would recommend it, especially if you didnt get a chance to see match. The store is ridiculously overpriced. ", "publishedDate": "2019-12-31", "language": "en", "rating": 4}, {"id": 735845735, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d271009-r735845735-Camp_Nou-Barcelona_Catalonia.html", "text": "I bought the Barcaland passes as they were on a really good deal. With the passes I did the stadium tour, got a Barca scarf and also got a lunch menu at Pans & Co. I had the possibility of also getting a 15% off on the ice skating plus 50% off on the next football game and also a discount on the next basketball game. The stadium is very well planned with the possibility of visiting the visitors stand, dig out and the VIP stand in addition to the club museum. There were also many activities happening on the Barcaland but they were mostly meant for the kids. Overall I was satisfied but I would come again next time when I have a family. ", "publishedDate": "2019-12-31", "language": "en", "rating": 5}, {"id": 735841435, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d271009-r735841435-Camp_Nou-Barcelona_Catalonia.html", "text": "Took my 11 year old for a birthday treat. I was very apprehensive about being in such a large stadium with him on my own but it seemed that we were sat in the family section (lower Nike stand) and i felt completely at ease. It was very easy getting into and out of. Massive superstore there, must make an utter fortune! Didn't buy any food or drink so couldn't comment. A must do for any sports fan! ", "publishedDate": "2019-12-31", "language": "en", "rating": 5}, {"id": 735823164, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d271009-r735823164-Camp_Nou-Barcelona_Catalonia.html", "text": "Something you have to do when visiting Barcelona! Amazing and totally worth for the value I have paid for the tickets, virtual tour extraordinary!", "publishedDate": "2019-12-31", "language": "en", "rating": 5}, {"id": 735820016, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d271009-r735820016-Camp_Nou-Barcelona_Catalonia.html", "text": "Brilliant stadium and I know why supporters feel proud of their club. Must visit stadium when you are in Barcelona. Need to see atmosphere when match is being played", "publishedDate": "2019-12-31", "language": "en", "rating": 5}, {"id": 735705999, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d271009-r735705999-Camp_Nou-Barcelona_Catalonia.html", "text": "Awesome awesome experience seeing a soccer game at Camp Nou. The fans and the energy is fantastic. Buy some merch and sit in the fan section to be entertained by songs, chants and flag waving throughout the game. Very convenient by bus or metro. I don't recommend driving.", "publishedDate": "2019-12-30", "language": "en", "rating": 5}, {"id": 735586572, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d271009-r735586572-Camp_Nou-Barcelona_Catalonia.html", "text": "Although I am not a football fan but I liked the visit, you feel the spirit of FCBarcelona and you enjoy your visit even if the topic is not yours.", "publishedDate": "2019-12-30", "language": "en", "rating": 5}, {"id": 735350037, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d271009-r735350037-Camp_Nou-Barcelona_Catalonia.html", "text": "This was one of the best experiences of my life. 100 percent recommend it too all people even who don't like football. Worth the money. Don't get a guided tour.", "publishedDate": "2019-12-29", "language": "en", "rating": 5}, {"id": 735057756, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d271009-r735057756-Camp_Nou-Barcelona_Catalonia.html", "text": "Although expensive, absolutely worth the money  - such a personal behind the scenes tour with a great guide.  My only criticism is that not allowed on the playing surface or even touch the grass despite the website advertising \"You’ll be able to walk at liberty on the playing field\"", "publishedDate": "2019-12-27", "language": "en", "rating": 5}, {"id": 735009981, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d271009-r735009981-Camp_Nou-Barcelona_Catalonia.html", "text": "We have the honour of visiting this world prestigious stadium. It is the football stadium of the famous club. Worth to get a souvenir from the shop", "publishedDate": "2019-12-27", "language": "en", "rating": 4}, {"id": 734811225, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d271009-r734811225-Camp_Nou-Barcelona_Catalonia.html", "text": "My dream has come true. I walked in the camp nou it was perfect .. All that bothered me was the expensive expense was everything. The ticket price was ok in the boutique but it was very expensive.", "publishedDate": "2019-12-26", "language": "en", "rating": 4}, {"id": 734793064, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d271009-r734793064-Camp_Nou-Barcelona_Catalonia.html", "text": "The stadium is large but the renovation can not come soon enough. It is pretty degraded, it's only roofed on one of the four sides.\nIt's a great club with so much history and the tour is quite enjoyable , but after doing the tour of Real Madrid no other club or stadium will wow me any where near as much.", "publishedDate": "2019-12-26", "language": "en", "rating": 3}, {"id": 734701146, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d271009-r734701146-Camp_Nou-Barcelona_Catalonia.html", "text": "You have to pick up your tickets 2.5 miles away from the stadium!!! So I lost the price of admission, didn’t see the stadium, and the agent was a real treat (sarcasm at its highest level) to talk to about it. These will be the last excursions I ever purchase on Trip Advisor!!!", "publishedDate": "2019-12-26", "language": "en", "rating": 1}, {"id": 734539207, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d271009-r734539207-Camp_Nou-Barcelona_Catalonia.html", "text": "Pro: Staff is very helpful and friendly\nCons: We couldn't enter into the Barca's dressroom, as in other stadiums.", "publishedDate": "2019-12-24", "language": "en", "rating": 4}, {"id": 734536445, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d271009-r734536445-Camp_Nou-Barcelona_Catalonia.html", "text": "Visited Camp Nou for clasico which typically do. Each time gets worse ad they delay opening gates and funnel everyone like cattle into security area. Disappointed this large organization cannot provide more secure measures for the loyal fans. They should consult with big NY teams on how to manage operations.", "publishedDate": "2019-12-24", "language": "en", "rating": 3}, {"id": 734466204, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d271009-r734466204-Camp_Nou-Barcelona_Catalonia.html", "text": "Do I really have to specify!!! Visit before Messi is gone! A must! The atmosphere is amazing and sporting. Sit near the cules and you may not see much of the game but what a hyped experience will you have! Bwahhh!! Tot el camp! És un clam!! ", "publishedDate": "2019-12-24", "language": "en", "rating": 5}, {"id": 734339511, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d271009-r734339511-Camp_Nou-Barcelona_Catalonia.html", "text": "Bought tickets to a  Barça game online. This huge, well built stadium that holds 100,000 people is so well organised, it is easy to find your seat, the staff are helpful and you see the best footballer in the world. What else do you really need.", "publishedDate": "2019-12-23", "language": "en", "rating": 5}, {"id": 734328847, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d271009-r734328847-Camp_Nou-Barcelona_Catalonia.html", "text": "We’ve taken special promo Xmas program includes tour, souvenirs and museum\nChildren were excited- less to say", "publishedDate": "2019-12-23", "language": "en", "rating": 5}, {"id": 734249982, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d271009-r734249982-Camp_Nou-Barcelona_Catalonia.html", "text": "Good experiences for football lover. If you are Messi's fan, then it is a Must to visit with all the collections of his Balon D'Or and golden boots on display", "publishedDate": "2019-12-23", "language": "en", "rating": 5}, {"id": 734249758, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d271009-r734249758-Camp_Nou-Barcelona_Catalonia.html", "text": "I’ve not played football for 11 years since my knee gave out and since then I’ve lost interest in the game and have not watched a game properly in about 8 years whilst my partner hasn’t cared about football – ever.\n\nHowever, I’d say that even if you didn’t like the sport you’d be seriously missing out on a tour of this spectacular football ground.  The trophy room/museum itself is incredible to look at with no end of beautiful trophies and historical football items to be found.\n\nThe tour is the main draw for me, easy to navigate and a lot of fun to be had for non-enthusiasts, football enthusiasts and fans alike.  There are plenty of photo opportunities as you get to sit in the stands, check out the dressing rooms, pressbox and dugouts.\n\nAnyone visiting Barcelona should seriously check this out and would be crazy to miss it.", "publishedDate": "2019-12-23", "language": "en", "rating": 5}, {"id": 734145087, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d271009-r734145087-Camp_Nou-Barcelona_Catalonia.html", "text": "just the most amazing experience as a football fan. The nou camp is easily accessible. The view was incredible from our seats. Staff very helpful. Great entertainment and would highly recommend ", "publishedDate": "2019-12-22", "language": "en", "rating": 5}, {"id": 734055416, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d271009-r734055416-Camp_Nou-Barcelona_Catalonia.html", "text": "Extremely disappointed and waste of money. We weren’t even get to go to the top edge of the stadium to take pictures. This is simply a room with trophies. If it’s your thing then go otherwise save your money to go out on a nice dinner.", "publishedDate": "2019-12-22", "language": "en", "rating": 1}, {"id": 733959116, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d271009-r733959116-Camp_Nou-Barcelona_Catalonia.html", "text": "This is the second largest stadium in the world. The most wonderful is museum with trophies before the entrance of the stadium. ", "publishedDate": "2019-12-21", "language": "en", "rating": 5}, {"id": 733890531, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d271009-r733890531-Camp_Nou-Barcelona_Catalonia.html", "text": "Arrived at the Stadium to find the tours weren’t going ahead. Only options were come back another day or very limited tour as the museum was closed. Never received any email to advise this either.", "publishedDate": "2019-12-21", "language": "en", "rating": 1}, {"id": 733779128, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d271009-r733779128-Camp_Nou-Barcelona_Catalonia.html", "text": "It is a must see for all football lovers. Nicely organized Stadium Tour takes you thru' all the club museum of trophies, its rich history, the interactive touch screen allowing to watch the greats in action of one's choice. one gets to watch the complete stadium, the players' locker rooms, the tunnel, the press box and the meet-the-press arena, the actual ground, the gymnasium etc.", "publishedDate": "2019-12-20", "language": "en", "rating": 5}, {"id": 733768339, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d271009-r733768339-Camp_Nou-Barcelona_Catalonia.html", "text": "Have done the tour a couple of times which is fab however we went to see the match whilst in Barcelona this time- brilliant atmosphere, great view, good price! Definitely recommend. Got a taxi there and back across town, was €15 each way and definitely a good way to get there!", "publishedDate": "2019-12-20", "language": "en", "rating": 5}, {"id": 733712832, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d271009-r733712832-Camp_Nou-Barcelona_Catalonia.html", "text": "As huge fans of the team and sport, our family enjoyed touring the museum and beautiful stadium while visiting Barcelona.  Better yet, as our tour happened to fall on a game day, we were offered discounted game tickets! We couldn't pass up the opportunity.  My son said it was the best birthday  gift he's ever received.", "publishedDate": "2019-12-20", "language": "en", "rating": 5}, {"id": 733697764, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d271009-r733697764-Camp_Nou-Barcelona_Catalonia.html", "text": "I have to say that it would be a serious omision to those who leave Barcelona without visiting Camp Nou stadium. It worth your time! I've been in the exhibition room & store for a half day.", "publishedDate": "2019-12-19", "language": "en", "rating": 5}, {"id": 733581513, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d271009-r733581513-Camp_Nou-Barcelona_Catalonia.html", "text": " First time at Nou Camp stadium with my husband and son to watch our team FcBarcelona against Majorca  on my birthday 7dec.We came from France and my son didn't know where we were going for the night until  we start see the fans heading for the stadium.A dream come true for all of us.Hope those who never experienced anything such go for their dreams \n", "publishedDate": "2019-12-19", "language": "en", "rating": 5}]}}]