[{"locationId": 4027803, "name": "Centro Comercial Arenas De Barcelona", "placeType": "ATTRACTION", "reviewListPage": {"reviews": [{"id": 752437024, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d4027803-r752437024-Centro_Comercial_Arenas_De_Barcelona-Barcelona_Catalonia.html", "text": "During my journey through Spain I fascinated to learn the history of bullfighting during my visits to bullrings in Ronda and Seville. However, when I learned that bullfighting is headed from extinction and may very well be illegal throughout Spain one day, what is to become of the magnificent structures that are the bullrings. The Centro Comercial Arenas De Barcelona answered that question for me—convert the bullring into a shopping center! While in Barcelona, I learned that the impressive conversion of this former bullring took approximately 8 years and was finally completed in 2011. This relatively new shopping center includes food courts, cinemas and even venues for music performances and flamenco shows. There is also underground parking on site for visitors to the center.\n\nThe center is located near the Plaza Espana and is a great place for visitors to Barcelona to see another aspect of this magical city.", "publishedDate": "2020-04-09", "language": "en", "rating": 4}, {"id": 751746366, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d4027803-r751746366-Centro_Comercial_Arenas_De_Barcelona-Barcelona_Catalonia.html", "text": "As a rule I try to avoid shopping centres, especially when I'm meant to be on holiday, but with there being a few restaurants here it seemed like a decent place to grab a bite to eat while pretending I'm shopping with the wife.\n\nThe centre is clean and very modern inside and impressive looking from the outside with a wide array of shops and restaurants to chose from.\n\nObviously there are many great places to eat in Barcelona but the eateries on the roof of the arena are better quality than your usual shopping centre fast food and if you fancy some retail therapy its as good a place as any.", "publishedDate": "2020-03-24", "language": "en", "rating": 4}, {"id": 750487440, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d4027803-r750487440-Centro_Comercial_Arenas_De_Barcelona-Barcelona_Catalonia.html", "text": "We run into the Arena while leaving MNAC. It is a central point as there are a lot of restaurants around and in it so you can also grab a bite once there. It is a very nice small shopping centre with shops for anything you want.", "publishedDate": "2020-03-11", "language": "en", "rating": 3}, {"id": 745233664, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d4027803-r745233664-Centro_Comercial_Arenas_De_Barcelona-Barcelona_Catalonia.html", "text": "When you visited Barcelona, you've to visit the Placa Espana, and when you visited the Placa Espana, you'd have to visit the Las Arenas due to it is just located at the heart of Placa Espana.\nThis shopping mall was used to be a bullfighting arena and was converted into a shopping complex in 2011. This middle-class shopping mall houses more than 110 shops, restaurants, a gym and a 12-screens cinema over 4 floors. It's a modest and easy to walk shopping centre with lots of lovely restaurants and shops.\nThe highlight of this arena is its rooftop, as it offers a 360-degree bird's eye view of the Placa Espana and the Montjuïc. (You could also take the lift to get up there & it only costs 1 Euro.) There are also a number of restaurants or bars on the rooftop for visitors to enjoy the view. However, in my opinion, the most attractive parts of this shopping arena are: \n1) the circle centre in the middle of the shopping mall: Sometimes the overhead projector would turn it into a colourful dancing floor but most of the times it would be used as an exhibition hub. \n2) the food court on the lower ground floor: there are a variety of local food stalls which you would definitely find something which suits your stomach. Plus, they have a rare big supermarket (Mercadona) which I thought was fantastic, this was due to I couldn't find any big supermarkets in Barcelona so I was delighted when I found one!\nHighly recommended if you're nearby!", "publishedDate": "2020-02-15", "language": "en", "rating": 4}, {"id": 742838759, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d4027803-r742838759-Centro_Comercial_Arenas_De_Barcelona-Barcelona_Catalonia.html", "text": "Well, we arrived with the Hop on hop off bus.  The arena looks impressive,  therefore we stopped to take the elevator.  1,50 is too much, because you can use the escalator for free. \nThe view is very nice", "publishedDate": "2020-02-03", "language": "en", "rating": 3}, {"id": 737404970, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d4027803-r737404970-Centro_Comercial_Arenas_De_Barcelona-Barcelona_Catalonia.html", "text": "We had fun viewing the city from the top of this old bull ring. Grabbed a bite to eat at one of the many restaurants on the roof top, then made our way through the shopping center on the escalators. On the way down, we were able to read about the history of the center and its conversion from bull fighting. There is also a movie complex inside but we opted to go watch the Magic Fountain down the street instead of a movie.", "publishedDate": "2020-01-06", "language": "en", "rating": 5}, {"id": 735663836, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d4027803-r735663836-Centro_Comercial_Arenas_De_Barcelona-Barcelona_Catalonia.html", "text": "U can find in this place all u want , from great food to jewellery and beautiful view from the taras .", "publishedDate": "2019-12-30", "language": "en", "rating": 5}, {"id": 735351094, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d4027803-r735351094-Centro_Comercial_Arenas_De_Barcelona-Barcelona_Catalonia.html", "text": "This is the best shopping centre I have ever been in. Pay 1 euro if your an adult to go to the viewing platform.", "publishedDate": "2019-12-29", "language": "en", "rating": 5}, {"id": 734907023, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d4027803-r734907023-Centro_Comercial_Arenas_De_Barcelona-Barcelona_Catalonia.html", "text": "On the site of an old bullring there is now a large shopping mall with the usual array of cafes and restaurants on the ground floor , shops on the next 2 floors and then a cinema and exhibition space on floor 4 , the roof level has a circular viewing walkway with more restaurants .\nWe were staying locally so this became a goto at the end of every day for a coffee or ice cream and we tried a few of the restaraunts as well , shops are what you would expect , large spanish stores of all types with some smaller international boutiques mixed in .The arenas is all lit up at night and is well worth a visit just for that.", "publishedDate": "2019-12-27", "language": "en", "rating": 5}, {"id": 734480726, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d4027803-r734480726-Centro_Comercial_Arenas_De_Barcelona-Barcelona_Catalonia.html", "text": "As a not malls fan I like the interior design of this mall and the great 360 view from it's top (don't miss it!).\nMost of the shops are common with other malls.", "publishedDate": "2019-12-24", "language": "en", "rating": 4}, {"id": 732577268, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d4027803-r732577268-Centro_Comercial_Arenas_De_Barcelona-Barcelona_Catalonia.html", "text": "this mall is really stunning and user friendly. you can find entrance very easily, everything you need inside very quickly and exit easily. architecture has some referances to Gaudi of course. Excellent. Strongly reccomended", "publishedDate": "2019-12-13", "language": "en", "rating": 5}, {"id": 732244182, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d4027803-r732244182-Centro_Comercial_Arenas_De_Barcelona-Barcelona_Catalonia.html", "text": "extremely disappointed.  It literally had one house brand, Mango and very few shops for what we planned to do on a rainy day.", "publishedDate": "2019-12-12", "language": "en", "rating": 2}, {"id": 731867481, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d4027803-r731867481-Centro_Comercial_Arenas_De_Barcelona-Barcelona_Catalonia.html", "text": "This mall is a fantastic place to visit. The building facade is amazing, in the past used to be a Bullring. On the last floor there is an amazing viewpoint with an impressive view of the National Palace, Spain Square the Magic Fountain and of course a view of the town. This place his one of the most important attraction. Plenty shops, restaurants and 1 supermarket.", "publishedDate": "2019-12-10", "language": "en", "rating": 5}, {"id": 730876747, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d4027803-r730876747-Centro_Comercial_Arenas_De_Barcelona-Barcelona_Catalonia.html", "text": "This is a fun shopping center that is at the bottom of the Montjuic area by the Plaza Espanya. It has a small food court on the lower level with affordable options as well as some great shopping on the upper levels. In the center of the first floor they have an interactive digital floor that kids will love. You can also purchase a ticket to go to the roof top balcony.", "publishedDate": "2019-12-05", "language": "en", "rating": 4}, {"id": 728277670, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d4027803-r728277670-Centro_Comercial_Arenas_De_Barcelona-Barcelona_Catalonia.html", "text": "The local folks come here to shop and to eat.  But for us tourists, it's the converted bull fighting arena with some great architecture.  In a central area well-served by the Metro.,", "publishedDate": "2019-11-22", "language": "en", "rating": 4}, {"id": 727371909, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d4027803-r727371909-Centro_Comercial_Arenas_De_Barcelona-Barcelona_Catalonia.html", "text": "I think this shopping centre was pretty average. However, there are great views from the top. It's free to go there as well. Worth the walk to the top. I liked the asian restaurant on the bottom floor as well.", "publishedDate": "2019-11-18", "language": "en", "rating": 4}, {"id": 725524625, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d4027803-r725524625-Centro_Comercial_Arenas_De_Barcelona-Barcelona_Catalonia.html", "text": "Shopping center converted from old bull ring with good selection of restaurants and viewing platform on top.  Search out the photo display inside showing it's conversion from bull ring very interesting.", "publishedDate": "2019-11-10", "language": "en", "rating": 4}, {"id": 724316216, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d4027803-r724316216-Centro_Comercial_Arenas_De_Barcelona-Barcelona_Catalonia.html", "text": "this area is beautiful placa de Espana is amazing and the arena has a long story go to the roof and see all Barcelona ", "publishedDate": "2019-11-05", "language": "en", "rating": 5}, {"id": 724187949, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d4027803-r724187949-Centro_Comercial_Arenas_De_Barcelona-Barcelona_Catalonia.html", "text": "Came across Centro Comercial Arenas De Barcelona during my visit and after requesting information to a bus driver for the need to do some shopping. This Mall was originally a Bull Fight Arena transformed into a commercial shopping center during the ban against animal cruelty in some regions of Spain. The outside structure and the main support bins are still part of the structure. You will find just about every clothing and shoe stores in addition to beauty salons, movie theaters, food court (basement) and an spectacular 360degree view of the city at the roof of this building with a nice restaurant. You can walk all around the roof and take pictures of the city.", "publishedDate": "2019-11-05", "language": "en", "rating": 5}, {"id": 723115529, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d4027803-r723115529-Centro_Comercial_Arenas_De_Barcelona-Barcelona_Catalonia.html", "text": "Just down the road from the national museum (& amazing fountain display)- set on a very busy road/ major roundabout so depending where you come from you may have to cross several roads but lots of crossing areas/ lights to assist you- also underpasses.There are several entrances and many floors, interconnected by escalators (which don’t go in a straight obvious line - some miss out floors). Plenty of shops you’ve heard of eg Mango ,and a range of refreshments and toilets-a good place to spend a few hours eg if wet, or whilst waiting to visit the fountains. On the top deck is a viewing area, and lots of restaurants- it’s free and you get a free 360 view of Barcelona.There is an external see through lift on the exterior of the  main building which you have to pay for if you use it- obviously a choice- inside are the escalators.Nearby is a great range of bars and even more restaurants.\nLit beautifully at nighttime.", "publishedDate": "2019-11-01", "language": "en", "rating": 4}, {"id": 722929364, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d4027803-r722929364-Centro_Comercial_Arenas_De_Barcelona-Barcelona_Catalonia.html", "text": "We enjoyed seeing the exterior of this former bull ring, now a shaopping mall. The bricke design is beautiful. The views from the top over the city and Montjuic are also lovely. (You can pay for an elevator ride up the outside, but we just rode the interior escalators for free.) The interior of the mall was not as exciting. We didn't shop, but were looking for some fairly quick food options for our hungry teens, and didn't find a lot of options, so tided them over with gelato. I wouldn't go out of my way to visit, but if you're in the area it is fun to enjoy the views.", "publishedDate": "2019-10-31", "language": "en", "rating": 3}, {"id": 722557480, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d4027803-r722557480-Centro_Comercial_Arenas_De_Barcelona-Barcelona_Catalonia.html", "text": "A nice shopping centre which was formerly the bullring in Barcelona.  Good for shopping as prices can be cheaper than in the UK, we found that the make up brands and perfumes were considerably cheaper. Plenty of restaurants. Great views from the shopping centre roof of Plaza Espanya and wider Barcelona, the roof can be accessed from the escalators for free or from the outside glass elevator which costs 1 Euro for adults and children under 12 are free.", "publishedDate": "2019-10-30", "language": "en", "rating": 5}, {"id": 720470310, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d4027803-r720470310-Centro_Comercial_Arenas_De_Barcelona-Barcelona_Catalonia.html", "text": "Worth a visit to check out the views. Restaurants on the top too.\nShopping centre inside, shops are pretty similar.", "publishedDate": "2019-10-22", "language": "en", "rating": 3}, {"id": 720010195, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d4027803-r720010195-Centro_Comercial_Arenas_De_Barcelona-Barcelona_Catalonia.html", "text": "We didn't shop at the stores here but we took lots of great photos from the top. They have restaurants on the top with great menus. ", "publishedDate": "2019-10-20", "language": "en", "rating": 3}, {"id": 719653649, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d4027803-r719653649-Centro_Comercial_Arenas_De_Barcelona-Barcelona_Catalonia.html", "text": "The exterior of this very modern shopping mall was originally a stadium from a bull fighting ring from the turn of the 19th century.  Once the center of entertainment world for the city, if fell into disrepair in the late 1900's.  Eventually the guts were torn out of it and the place matadors and toros once danced was replaced by a Claire's.  \n\nThe very bottom floor of the mall contains a grocery store and a fair number of options for eating.  But that isn't where you should get your food.  The real attraction of this building is the roof.  It is an open thoroughfare that provides fantastic views of the city and is completely free.  On the inside of the roof loop is a series of restaurants.  Why not get your food with a view.  \n\nThe rest of the shops are nothing special.  Lots of health and beauty stores.  We did end up stopping at the movie theater.  Because the concession stand sits on the outside, we bought ourselves a big box of popcorn for a snack.", "publishedDate": "2019-10-19", "language": "en", "rating": 3}, {"id": 718514317, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d4027803-r718514317-Centro_Comercial_Arenas_De_Barcelona-Barcelona_Catalonia.html", "text": "You can enjoy beautiful of Barcelona skyline view from the roof. If you take the lifts which are inside, you can get there for free! Stairs are also available.", "publishedDate": "2019-10-15", "language": "en", "rating": 4}, {"id": 715302815, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d4027803-r715302815-Centro_Comercial_Arenas_De_Barcelona-Barcelona_Catalonia.html", "text": "We were staying right opposite this shopping centre. You have all the shops you may need. Ground floor has some great coffee shops excluding “BOKA”(please read their review before visiting) other than that there are nice ice cream parlours. The panoramic roof top has amazing views and has some top restaurants and cocktail bars including quantis quantus. Defo recommend this place", "publishedDate": "2019-10-04", "language": "en", "rating": 5}, {"id": 712537388, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d4027803-r712537388-Centro_Comercial_Arenas_De_Barcelona-Barcelona_Catalonia.html", "text": "A great use of a very historic building nad near the famous fountains  etc.  Mix of shopping is OK - nothing specail.  Good food options.  Can wlak fomr here to National Art Gallery and not so far form the main Miro gallery. ", "publishedDate": "2019-09-24", "language": "en", "rating": 3}, {"id": 707614566, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d4027803-r707614566-Centro_Comercial_Arenas_De_Barcelona-Barcelona_Catalonia.html", "text": "Lovely mall with a great choice of upscale shops. Great restaurants on top floor of mall and a theatre too. ", "publishedDate": "2019-09-07", "language": "en", "rating": 5}, {"id": 705672878, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d4027803-r705672878-Centro_Comercial_Arenas_De_Barcelona-Barcelona_Catalonia.html", "text": "This shopping centre is an amazing renovation of an old bull ring and it has really become an incredible second use for the building. The shopping centre is huge with many popular shops and restaurants as well as a cinema and gym. The top level has a 360 degree terrace where you can see across Barcelona with great views of Montjuic. ", "publishedDate": "2019-09-02", "language": "en", "rating": 5}, {"id": 705537658, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d4027803-r705537658-Centro_Comercial_Arenas_De_Barcelona-Barcelona_Catalonia.html", "text": "It's not only a shopping mall. The architecture and history of the place is a gem. Great food in restaurants on level -1. Best views from the top floor overlooking Plaza de Espanya. You can get for FREE using the escalator located inside the shopping mall. External lift is at extra charge. I used to live in Barcelona, contact me for tips.", "publishedDate": "2019-09-02", "language": "en", "rating": 5}, {"id": 705411787, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d4027803-r705411787-Centro_Comercial_Arenas_De_Barcelona-Barcelona_Catalonia.html", "text": "There are about 10 bars and restaurants on this converted bull ring. Nothing unusual there, but they are all on the top floor terrace with amazing views. As there is such a large choice of cuisines it might be worth doing a bit of research on the individual restaurants. There is a charge for the lift up. The building itself is an incredible architect achievement. The conversion raised  the whole thing by 3 metres. It may be filled with capitalist outlets and cinemas, but at least it's not part of the bull fighting butchery anymore. It might not be worth a special visit but well worth getting off the tour bus.", "publishedDate": "2019-09-01", "language": "en", "rating": 4}, {"id": 702417592, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d4027803-r702417592-Centro_Comercial_Arenas_De_Barcelona-Barcelona_Catalonia.html", "text": "Popped up here in the glass lift to enjoy a view whilst on a lunch stop on the way to cruise port. There are some restaurants at the top - but didn't have time to try. Nice 360degree platform and shopping centre with indoor cafes underneath.", "publishedDate": "2019-08-24", "language": "en", "rating": 4}, {"id": 700794534, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d4027803-r700794534-Centro_Comercial_Arenas_De_Barcelona-Barcelona_Catalonia.html", "text": "I wouldn't go out of my way to come here, but if you're in the area and want a rooftop meal, a high vantage point to see the city, or go shopping somewhere other than Las Ramblas or Passeig de Gracia, this is worth a visit. It's a great example of repurposing unique, historical structures instead if tearing them down, too.", "publishedDate": "2019-08-19", "language": "en", "rating": 4}, {"id": 687791557, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d4027803-r687791557-Centro_Comercial_Arenas_De_Barcelona-Barcelona_Catalonia.html", "text": "We discovered this place that sits atop an old bull fighting arena by site seeing on the Turìstic Tour Bus tours. The views are breathtaking of the city from this restaurant bar. We only stopped in for drinks but just looking at the food and smells coming from inside was enough for me to recommend the cuisine. The best part of our experience was our server Saqib. He was hospitable and kind. And he made the biggest and strongest whiskey drink I’ve had so far on my trip. He commented on how beautiful my smile was and was just a very happy and sweet man. He gave us quality recommendations for other sites to visit while on our holiday. He was accommodating and just an over all nice person and helpful individual. I will be back and would recommend this establishment to anyone. Just make sure you ask for Saqib. Cheers!!!", "publishedDate": "2019-07-08", "language": "en", "rating": 5}, {"id": 687600024, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d4027803-r687600024-Centro_Comercial_Arenas_De_Barcelona-Barcelona_Catalonia.html", "text": "This is a good pit stop, which is a mall with shops, toilets and restaurants on the inside and a free escalator to the top for a rooftop view. We took the hop on hop off bus and there is a stop nearby.\n\nWe took the three escalators on the inside to the top but there is an option to pay a small fee for the outside lift direct to the top.\n\nThere’s a good viewing point of the magic fountain and great photo opportunity.", "publishedDate": "2019-07-07", "language": "en", "rating": 5}, {"id": 685776070, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d4027803-r685776070-Centro_Comercial_Arenas_De_Barcelona-Barcelona_Catalonia.html", "text": "Stopped at the shopping mall to check out the boutiques and restaurants. Realized you could you go the rooftop since there are restaurants up there also. The views are 360 degrees over the city. Recommended if you wish to eat there or shop a little.", "publishedDate": "2019-07-01", "language": "en", "rating": 4}, {"id": 684328263, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d4027803-r684328263-Centro_Comercial_Arenas_De_Barcelona-Barcelona_Catalonia.html", "text": "Nice mall right at Placa Espanya. There aren't many great stores but there is a nice food court and a supermarket in the bottom level.\n\nThe attraction is probably the viewing platform up top. Before you enter the mall, you will see an elevator for 1 EUR to get up there but you can actually just go through the mall's escalators all the way to the stop.\n\nBoy were we cheesed when we found that out!!", "publishedDate": "2019-06-25", "language": "en", "rating": 4}, {"id": 680705499, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d4027803-r680705499-Centro_Comercial_Arenas_De_Barcelona-Barcelona_Catalonia.html", "text": "Its a really good idea and pretty cool how it used to be a bull ring. Lots of shops inside as it is a shopping centre, but theres also photos around and some history of what it used to be. You can go inside and up the escalators to the top and go outside for free where you get a nice view of the square and surrounding areas. There is also a glass lift which is cool that takes you to the top however this is €1. Recommend this place if your in the area.", "publishedDate": "2019-06-11", "language": "en", "rating": 5}, {"id": 676351283, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d4027803-r676351283-Centro_Comercial_Arenas_De_Barcelona-Barcelona_Catalonia.html", "text": "This was once a bull ring but has been converted to a mall. Interesting the internal construction. Many shops and on the bottom floor a food hall with different restaurants. There is a look out on the roof which gives a good view.", "publishedDate": "2019-05-25", "language": "en", "rating": 4}, {"id": 624483653, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d4027803-r624483653-Centro_Comercial_Arenas_De_Barcelona-Barcelona_Catalonia.html", "text": "Roof top has a very nice view with restaurants, the mall itself looks big from outside but inside is disappointing. We went there for browsing shops while outside was raining (hence had to skip the shopping streets).\nAll in all, I will only remember the view.", "publishedDate": "2018-10-13", "language": "en", "rating": 3}, {"id": 618410191, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d4027803-r618410191-Centro_Comercial_Arenas_De_Barcelona-Barcelona_Catalonia.html", "text": "If you want to go to a mall, then this is a good place.  This is a converted bull fight arena.  The outside is beautiful.  We went because we had heard that there were a lot of good places to eat. The bottom floor is basically a food court, but unlike in the US, there are groups of standalone restaurants, also.  The good news is that it is very close to the Magic Fountain.  We ate elsewhere that was less like a mall, and more like a restaurant. ", "publishedDate": "2018-09-21", "language": "en", "rating": 3}, {"id": 618039882, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d4027803-r618039882-Centro_Comercial_Arenas_De_Barcelona-Barcelona_Catalonia.html", "text": "If you come to visit Barcelona, one of the points that is worthwhile is this shopping center. \nLocated in what was once an old bullring, this building impresses to anyone who enters inside. \nSurrounded by magnificent views over the Montjuic mountain.", "publishedDate": "2018-09-19", "language": "en", "rating": 4}, {"id": 614354562, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d4027803-r614354562-Centro_Comercial_Arenas_De_Barcelona-Barcelona_Catalonia.html", "text": "We needed to get somethink to drink and eat after museum and walk. The center is well equippped with small bars and cafes as well with shops. When you need some extra for your ride home, there is a supermarket in the basement (they also have som takeaway salads etc.) Next to centre there are bus lines to get to Museu National and for Saints train station (but its a walking distance for whose who prefer to walk)", "publishedDate": "2018-09-06", "language": "en", "rating": 4}, {"id": 613386870, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d4027803-r613386870-Centro_Comercial_Arenas_De_Barcelona-Barcelona_Catalonia.html", "text": "It used to be an Arena of Barcelona. After a restoration work, it is used as a shopping mall. The outside walls are kept as original. If you wish to have a panoramic view of the Square of Espanya and to enter the Arena from the top floor, you can take a lift by paying one euro.", "publishedDate": "2018-09-03", "language": "en", "rating": 5}, {"id": 612573038, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d4027803-r612573038-Centro_Comercial_Arenas_De_Barcelona-Barcelona_Catalonia.html", "text": "Use the Espanya metro station to get here. Whatever address TA is showing is wrong. I went all the way to the area where the Clot station is, walked around towards the location that is shown on the map and there is nothing but a school and a lot of construction. Very irritating. Really wanted to to go here.", "publishedDate": "2018-08-31", "language": "en", "rating": 1}, {"id": 608738355, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d4027803-r608738355-Centro_Comercial_Arenas_De_Barcelona-Barcelona_Catalonia.html", "text": "This impressive red building caught my attention once I exit from the metro station Plaça Espanya. I understand it is now a  modern shopping centre, with its original facade retained. I took photos of this beautiful architecture before heading to the magic fountain.", "publishedDate": "2018-08-21", "language": "en", "rating": 4}, {"id": 601535334, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d4027803-r601535334-Centro_Comercial_Arenas_De_Barcelona-Barcelona_Catalonia.html", "text": "Good place to relax when visiting the Magic Fountain. Plenty places to eat and drink as well as shop. Views from roof are superb although I expect restaurant prices up there are a little more for that privilege . Apart fly used to be a bull ring which makes sense given its shape. ", "publishedDate": "2018-07-31", "language": "en", "rating": 4}, {"id": 596096266, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d4027803-r596096266-Centro_Comercial_Arenas_De_Barcelona-Barcelona_Catalonia.html", "text": "Our hotel was 2 mins from this mall, great shops and nice restaurants on the top floor.\nA great place to go for an evening meal and people watch.", "publishedDate": "2018-07-14", "language": "en", "rating": 5}, {"id": 596088002, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d4027803-r596088002-Centro_Comercial_Arenas_De_Barcelona-Barcelona_Catalonia.html", "text": "beautiful building, the shops inside is good, but the restaurants are better, the place is good to go in and grab a quick bite.", "publishedDate": "2018-07-14", "language": "en", "rating": 5}, {"id": 594344705, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d4027803-r594344705-Centro_Comercial_Arenas_De_Barcelona-Barcelona_Catalonia.html", "text": "This former bullring is now home to shops restaurants and cafes as well as a cinema complex to\nThe viewing platform is €1 each to go the five floors up in a glass elevator. The views over the square are stunning. At the top there is a 360degree walking platform which has different restaurants for all around the world. Once downstairs there are shops to look in and a food court to grab a coffee cold drink and a snack.", "publishedDate": "2018-07-09", "language": "en", "rating": 5}, {"id": 583513105, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d4027803-r583513105-Centro_Comercial_Arenas_De_Barcelona-Barcelona_Catalonia.html", "text": "We decided to get off the bus and have a look at this former bullring. It is now converted into a large commercial shopping area with the addition of cinemas, cafes, restaurants and an exhibition area. The conversion to practical use is a  credit to those involved as the historic exterior has been refurbished and retained. Panoramic views from the upper level, either pay a Euro for the dedicated lift or use the internal service lifts for free.", "publishedDate": "2018-05-28", "language": "en", "rating": 4}, {"id": 582217989, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d4027803-r582217989-Centro_Comercial_Arenas_De_Barcelona-Barcelona_Catalonia.html", "text": "The exterior is a large original bullring but inside is a completely modern shopping centre (so lovely that they kept the original structure).  There is an external lift that brings you directly to the viewing platform at the top which cost €1 each trip, however, inside there are glass lifts / elevators that bring you up for FREE! The 360 degree panoramic view from the top is lovely, where Museu Nacional d'Art de Catalunya is within walking distance. I didn’t bother with the modern shops inside – nothing interested me.  At the base there is also a tourist information desk.  Great for a 20 minute pit-stop, unless you want to have something to eat in the restaurant at the top.", "publishedDate": "2018-05-23", "language": "en", "rating": 4}, {"id": 580963626, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d4027803-r580963626-Centro_Comercial_Arenas_De_Barcelona-Barcelona_Catalonia.html", "text": "Paid just €1 to go up to the roof in the glass lift and take in the fantastic views. There wasn’t even a queue! Brilliant :)", "publishedDate": "2018-05-17", "language": "en", "rating": 5}, {"id": 578924888, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d4027803-r578924888-Centro_Comercial_Arenas_De_Barcelona-Barcelona_Catalonia.html", "text": "Talk about \"repurposing\" a building! This was an active bull fighting ring building, that was converted into a commercial shopping mall in 2011, next to the Hotel Catalonia at the Plaza Espanya. There are a number of shops on two floors, and several restaurants. Adding to its uniqueness, there is an outside elevator that takes visitors to the rooftop of the 3-4 story building, where an outside walking deck provides views of the surrounding area!", "publishedDate": "2018-05-08", "language": "en", "rating": 4}, {"id": 578723424, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d4027803-r578723424-Centro_Comercial_Arenas_De_Barcelona-Barcelona_Catalonia.html", "text": "This is located in Placa Espanya and is the old bullring. It now contains shops, bars and restaurants but the real attraction here is the great view from the roof. For only one or two euros per person you can take the glass lift to the top for great views of the Venetian towers and the Art museum.", "publishedDate": "2018-05-08", "language": "en", "rating": 5}, {"id": 578551027, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d4027803-r578551027-Centro_Comercial_Arenas_De_Barcelona-Barcelona_Catalonia.html", "text": "I was informed the entire arena was raised a story to accommodate the shopping Centre. This is a feat on its own. The original 1929 building has original structures with a new age look. Also amazing views. ", "publishedDate": "2018-05-07", "language": "en", "rating": 5}, {"id": 573182859, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d4027803-r573182859-Centro_Comercial_Arenas_De_Barcelona-Barcelona_Catalonia.html", "text": "It wasn't in our plan but came there running when it started raining after the magical fountain not far away.\n\nNot sure about the shopping (though we didn't see too many intriguing names) since we came in so late, but the view from the top was amazing!!\n\nAlso it's always impressive to see old building being used for modern purposes, it's a very big one, too! ", "publishedDate": "2018-04-13", "language": "en", "rating": 4}, {"id": 573140765, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d4027803-r573140765-Centro_Comercial_Arenas_De_Barcelona-Barcelona_Catalonia.html", "text": "The old bull fighting rink is now a big shopping center.  Interesting architecture set in one of the big open squares.  Lots of traffic around it.  Good place to stop for something to eat.", "publishedDate": "2018-04-13", "language": "en", "rating": 4}, {"id": 572920539, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d4027803-r572920539-Centro_Comercial_Arenas_De_Barcelona-Barcelona_Catalonia.html", "text": "We stumbled upon this place looking for something to do.... very cool! Great views of the city & tons of stuff to occupy your time inside!! I wish we had not eaten before-I would have loved to try one of the restaurants on top!!", "publishedDate": "2018-04-12", "language": "en", "rating": 5}, {"id": 572897619, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d4027803-r572897619-Centro_Comercial_Arenas_De_Barcelona-Barcelona_Catalonia.html", "text": "We went inside and got the free escalators to the top. It's a nice view but nothing amazing, would only recommend if you're in the area.\nDidn't have any interest in any of the shops inside. ", "publishedDate": "2018-04-12", "language": "en", "rating": 3}, {"id": 569973358, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d4027803-r569973358-Centro_Comercial_Arenas_De_Barcelona-Barcelona_Catalonia.html", "text": "A unique and modern shopping mall with a quite interesting background. Take an express lift for €1 to the rooftop and enjoy 360° view.", "publishedDate": "2018-03-31", "language": "en", "rating": 4}, {"id": 569949035, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d4027803-r569949035-Centro_Comercial_Arenas_De_Barcelona-Barcelona_Catalonia.html", "text": "Went there during rush hour with a small baby. The shops are in multiple floors and there are only 2 small elevators. Always tens of healthy people queing for the elevators even though there are escalators just beside them. Other than that nothing special, the same shops can be found in every shopping center.", "publishedDate": "2018-03-31", "language": "en", "rating": 3}, {"id": 569880775, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d4027803-r569880775-Centro_Comercial_Arenas_De_Barcelona-Barcelona_Catalonia.html", "text": "If you are someone who enjoys visiting and taking pictures from viewpoints in a city, this is a must visit for you. Situated near Pl Espanya metro stop, it is very easy to locate. Walk straight to the terrace for great views of the area around and Palau Nacional which houses Museu Nacional D’Art.\nThere is an option to use an elevator to reach the terrace by paying Eur 1 without getting inside the mall. I would avoid this option because you can easily reach the terrace for free from inside the mall.", "publishedDate": "2018-03-31", "language": "en", "rating": 5}, {"id": 568419650, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d4027803-r568419650-Centro_Comercial_Arenas_De_Barcelona-Barcelona_Catalonia.html", "text": "This is a fantastic spot.  We called in after getting the bus down from Montjuïc.  From the top you can get great views of the city and there are some lovely restaurants around the top giving a huge variety of food options.  \n\nInside there are all kinds of shops and cinemas but we did not find any that took our fancy.  We found better shops around Place de Catalunya.\n\nOutside the Arena you will find a Metro station that takes you into the city centre.\n\n", "publishedDate": "2018-03-24", "language": "en", "rating": 4}, {"id": 565516775, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d4027803-r565516775-Centro_Comercial_Arenas_De_Barcelona-Barcelona_Catalonia.html", "text": "The “Arenas” Shopping Mall cituated just on middle of Plaza Espana in Barcelona. Avinguda Paral lel and Gran via de los Corta Catalanes and Torres Venecianes just starting from Plaza De Espana.\n\nIt looks like as a brand new “Plaza del Toros” but its just a nice builded shopping mall with some shops and restaurants! \nOutside there is an Elevator (Lift) \nFor only 1€ to get up on the top less than a minute! Its cheap and you got a greate view! 360 of course as you can walk around also one floor down you can even run around as there is a running path. You can make greate selfies with Montjuic in behind.", "publishedDate": "2018-03-09", "language": "en", "rating": 5}, {"id": 561970902, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d4027803-r561970902-Centro_Comercial_Arenas_De_Barcelona-Barcelona_Catalonia.html", "text": "It was a really bad weather so we went there, it is normal shopping center with international brands, nothing special. On the top of the center you have a few good restaurants, we ate paella and seafood and it was good. ", "publishedDate": "2018-02-21", "language": "en", "rating": 5}, {"id": 561601357, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d4027803-r561601357-Centro_Comercial_Arenas_De_Barcelona-Barcelona_Catalonia.html", "text": "Arenas de Barcelona (also known as Las Arenas) is a former bullring turned commercial complex near Plaça d'Espanya. It was originally built between 1889 and 1900 as Plaça de Toros de les Arenes. Designed in a Moorish style by August Font i Carreras, the arena had a diameter of 52 metres and could seat 16,000 spectators. The last bullfight in the arena took place on June 9, 1977. For decades, the arena stood empty until plans were lunched in 1999 to turn the space into a shopping and entertainment centre. Arenas de Barcelona opened in March 2011 with the original façade mostly intact. Spread over six floors, the current facility houses eateries, shops, a movie theatre, and a museum (approximately 116 stores and services). The rooftop terrace, accessible via a series of escalators or via an elevator attached to the exterior of the building, offers a 360-degree view of the surrounding area.", "publishedDate": "2018-02-19", "language": "en", "rating": 3}, {"id": 561404763, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d4027803-r561404763-Centro_Comercial_Arenas_De_Barcelona-Barcelona_Catalonia.html", "text": "Come here if you have seen everything else or visiting the Plaza de España.  The mall has an interesting history, having been repurposed from a very large former bull ring.  A very well executed conversion. \n\nThe best part of the mall is the viewing platform with 360 degree views of the city, especially the Plaza de España and the Art Museum. There is also a fine selection of restaurants in the viewing platform. ", "publishedDate": "2018-02-18", "language": "en", "rating": 4}, {"id": 561021080, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d4027803-r561021080-Centro_Comercial_Arenas_De_Barcelona-Barcelona_Catalonia.html", "text": "This is a decent mall with more shops that you can possibly handle.\nPrices tend to be on the moderate to expensive side (nothing cheap).\nThere are numerous eateries in the mall plus a great 360 degrees observation terrace on the roof.", "publishedDate": "2018-02-17", "language": "en", "rating": 4}, {"id": 560795797, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d4027803-r560795797-Centro_Comercial_Arenas_De_Barcelona-Barcelona_Catalonia.html", "text": "This was a old Bull Ring which they turned into a shops and restaurant area, it has 4 floors with a car park underneath, a cinema, good selection of shops places to have a coffee but the greatness is the top of the bull ring where you have restaurants you can group and just take in the view which is great looking out onto Barcelona, a real 360 degree look, we visited a restaurant called Brala Me lovely looking great food and nice staff.  I loved the decor red and black, although it wasn't a great day it was raining hard and cold, it had a great atmosphere for our last lunch, we stuck to menu dal der I had Calamari for starters the biggest I have ever had and were great tasting in light batter,  fish for main too which was great just ice cream for dessert nice house white to complement the fish, and a free glass of presseco", "publishedDate": "2018-02-16", "language": "en", "rating": 4}, {"id": 560361031, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d4027803-r560361031-Centro_Comercial_Arenas_De_Barcelona-Barcelona_Catalonia.html", "text": "Many shops and rooftop view. I was picking my running number here but end up getting lovely shirt from desingual for good price. Definitely if you like shopping it is worth to come here as choice is good.", "publishedDate": "2018-02-13", "language": "en", "rating": 4}, {"id": 555402063, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d4027803-r555402063-Centro_Comercial_Arenas_De_Barcelona-Barcelona_Catalonia.html", "text": "Many different restaurants, not fine dining downstairs. \nUp at the rooftop many restaurants more.\nPanorama elevator 1,-\nGood food store downstairs.\nBuss straight to beach of Barceloneta D20", "publishedDate": "2018-01-22", "language": "en", "rating": 5}, {"id": 553919273, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d4027803-r553919273-Centro_Comercial_Arenas_De_Barcelona-Barcelona_Catalonia.html", "text": "Conveniently situated by the Pl Espanya metro stop, this large circular building (is it a converted bull ring?) contains a number of floors of shops, cinema and (the highlight for us) great rooftop views across the city as well as a wide choice of restaurants on the roof level.\nWhen we visited, all the Christmas decorations were still present as it was before the festival of the 3 kings, which added to the charm.\nAs Place d’Espanya is on the bus turistic route and near a number of other attractions I would say the Arenas building is worth a stop if you have a spare hour and fancy a comfort break from all the beauty and culture that Barcelona has to offer.", "publishedDate": "2018-01-15", "language": "en", "rating": 4}, {"id": 548191050, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d4027803-r548191050-Centro_Comercial_Arenas_De_Barcelona-Barcelona_Catalonia.html", "text": "1. From the top of arena you can have a panoramic view of almost entire barcelona. Breathtaking views, happy to be here for the second time this year.\n2. Apart from the awesome views arena is a hub of restaurants and almost all branded shops. ", "publishedDate": "2017-12-20", "language": "en", "rating": 5}, {"id": 544056943, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d4027803-r544056943-Centro_Comercial_Arenas_De_Barcelona-Barcelona_Catalonia.html", "text": "I went to Las Arenas last week and I used the elevator to go up on the Arena's top! \nYou have to pay 1 euro for this but It's worth it because there is an incredible city view! \nInside there are many good restaurants and shops. \nI recommend you go there at least once.", "publishedDate": "2017-11-29", "language": "en", "rating": 4}, {"id": 543768887, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d4027803-r543768887-Centro_Comercial_Arenas_De_Barcelona-Barcelona_Catalonia.html", "text": "This big arena has been kept up well. It is in the city center, or near it, and in the old days bull fighting was done in there.", "publishedDate": "2017-11-28", "language": "en", "rating": 3}, {"id": 543311187, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d4027803-r543311187-Centro_Comercial_Arenas_De_Barcelona-Barcelona_Catalonia.html", "text": "This is a shopping center in Barcelona. Its facade is an old building. You get great views from the roof top of the placa espanya and the magic fountains. Lots of restaurant at the roof top.", "publishedDate": "2017-11-26", "language": "en", "rating": 4}, {"id": 540692917, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d4027803-r540692917-Centro_Comercial_Arenas_De_Barcelona-Barcelona_Catalonia.html", "text": "Don't overy pay if you're able to spend about five minuts in order use the mechanical ladders, it's free, instead of the elevator on the street.", "publishedDate": "2017-11-13", "language": "en", "rating": 4}, {"id": 538587522, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d4027803-r538587522-Centro_Comercial_Arenas_De_Barcelona-Barcelona_Catalonia.html", "text": "This shopping centre, a converted bull fighting arena, is ideally situated for anybody staying in one of the surrounding hotels.\n\nThe centre itself has a good variety of shops, most of which are, however, aimed at those with a deeper pocket. As well as shops, the centre houses a number of restaurants and a super market which is ideal for any bits that you may need to set you up for a day of exploring.\n\nThe alcohol within the supermarket is extremely well priced with local whiskeys available for just under 5 euros (Actually very nice).\n\nAll in all, i wouldn't personally go out of my way to visit this shopping centre however it being so close to the hotel in which i was staying made it a daily visit.", "publishedDate": "2017-11-05", "language": "en", "rating": 4}]}}]