[{"locationId": 10538454, "name": "Fuente de la Portaferrissa", "placeType": "ATTRACTION", "reviewListPage": {"reviews": [{"id": 720520908, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d10538454-r720520908-Fuente_de_la_Portaferrissa-Barcelona_Catalonia.html", "text": "Seemingly lost in the blur of the La Rambla is this quiet tiled fountain that can be seemingly overlooked as the hordes travel past , the mosaic is of everyday life in the 18th century at the gateway to the city the ' Porta ferrica '", "publishedDate": "2019-10-22", "language": "en", "rating": 5}, {"id": 690004026, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d10538454-r690004026-Fuente_de_la_Portaferrissa-Barcelona_Catalonia.html", "text": "The Fuente de la Portaferrissa is a fountain just off the walking, talking shopping street of La Rambla. The fountain is part of the walls back in the day when Barcelona was a walled city. Porta Ferrissa can be translated as Iron Gate. It’s name coming from the iron bars that once decorated the gate.\n\nThe ceramics tiles that decorated with ceramics were only added in 1957 and made for the occasion of the Mare de Déu de la Mercè festival. The mural reflects an everyday scene of 18th century Barcelona, with scenes of people strolling in front of a Porta Ferrissa, full of commercial activity and an image of Saint Josep Oriol. The central part of the fountain, is some text written with a  historical account of the fountain.\n\nThe tile decorates are nice and worth a detour if you’re in this part of La Rambla, but don’t go out of the way to see it though.", "publishedDate": "2019-07-16", "language": "en", "rating": 4}, {"id": 611610190, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d10538454-r611610190-Fuente_de_la_Portaferrissa-Barcelona_Catalonia.html", "text": "I recently visited Barcelona, and while walking around the side streets took a photo of this amazing mosaic, made from tiny pieces.  When I returned home, and did a little research, I found out it depicts one of the old gates to the City, and a scene of how life was.  It's a lovely piece of local art/history to look at, providing nice photo opportunity.  ", "publishedDate": "2018-08-28", "language": "en", "rating": 4}, {"id": 579756062, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d10538454-r579756062-Fuente_de_la_Portaferrissa-Barcelona_Catalonia.html", "text": "Right off of Las Ramblas--near Mare de Deu Betlem Church.  It takes a few moments, and is on a path that most will travel while in Barcelona, so it is certainly worth a quick visit.  The tile work shows the old city walls.", "publishedDate": "2018-05-12", "language": "en", "rating": 4}, {"id": 505247528, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d10538454-r505247528-Fuente_de_la_Portaferrissa-Barcelona_Catalonia.html", "text": "If your on Las Ramblas, take the time to find this fountain. It is not far from Canaletes but lacks a great legend like Canaletes. Still it is the best tile design in Barcelona. Don't worry about getting a drink but do take the time to get a picture because it is a great design.", "publishedDate": "2017-07-24", "language": "en", "rating": 4}, {"id": 492079838, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d10538454-r492079838-Fuente_de_la_Portaferrissa-Barcelona_Catalonia.html", "text": "We filled out water bottles here. Cool water on a warm day. It was clean and free! Great to splash on you on a warm day. Right off Las Rambla rd. ", "publishedDate": "2017-06-10", "language": "en", "rating": 4}]}}]