[{"locationId": 11932628, "name": "Monument to Frederic Soler i Hubert", "placeType": "ATTRACTION", "reviewListPage": {"reviews": [{"id": 689999048, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d11932628-r689999048-Monument_to_Frederic_Soler_i_Hubert-Barcelona_Catalonia.html", "text": "This monument stands in tribute to Frederic Soler, a Spanish and Catalan poet and playwright who wrote primarily in Catalan. This beautiful monument to Frederic Soler is located in front of the Teater Principal in Plaça del Teatre, near the southern end of La Rambla. \n\nThis monument features a larger than life statue of Soler seated throne like with his crossed legs, facing to his right with an expression of deep thought. The pedestal is more elaborate than is usual and looks a little like an architectural column and richly decorated with floral motifs of leafs. The pedestal is also inscribed with the words \"Homenatge a Frederic Soler i Hubert \"Serafi Pitarra\" (1839-1895).", "publishedDate": "2019-07-16", "language": "en", "rating": 4}, {"id": 666961663, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d11932628-r666961663-Monument_to_Frederic_Soler_i_Hubert-Barcelona_Catalonia.html", "text": "Free \nvisit Duration: 5 minutes while in La Ramblas. \n\nFacing the Teatre Principal in El Pla del Teatre in La Rambla de Santa Mònica, \nthis tall monument made of marble, is topped with a larger than life size statue depicting Frederic Soler seated with crossed legs, facing to his right with an expression of deep thought. The following inscriptions are carved upon the pedestal: \"A Frederich Soler (Pitarra)\" and \"Fundador del Teatre Catalá\" \n\nFrederic Soler i Hubert (Barcelona, 1839 - 1895), best known as \"Serafí Pitarra\", was a playwright, and important theatre promoters of the 19th century. He is a poet and an outstanding representative of Catalan romantic theatre.", "publishedDate": "2019-04-16", "language": "en", "rating": 4}, {"id": 646936249, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d11932628-r646936249-Monument_to_Frederic_Soler_i_Hubert-Barcelona_Catalonia.html", "text": "Came across this when walking along Las Ramblas, after some research the subject was a famous playwright, the statue itself is located to the side of the main walkway, and certainly worth a photo stop.", "publishedDate": "2019-01-19", "language": "en", "rating": 4}, {"id": 627440161, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d11932628-r627440161-Monument_to_Frederic_Soler_i_Hubert-Barcelona_Catalonia.html", "text": "We passed this statue every day of our eight days holiday to Barcelona and although not the very best statue in this most vibrant of cities it is interesting. \nThe statue and monument depicts the playwright and poet Frederic Soler I Hubert looking down the always very busy Las Ramblas. \nIt's not a must go destination but if your wandering down Las Ramblas well worth seeking out. ", "publishedDate": "2018-10-23", "language": "en", "rating": 5}, {"id": 621182985, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d11932628-r621182985-Monument_to_Frederic_Soler_i_Hubert-Barcelona_Catalonia.html", "text": "On the base of the statue, his common name shows below his proper name.  What would La Rambla be without these 1800's buildings and statues?  That is Barcelona!  He was a popular and produced a prolific body of plays.  \n\nHe sits on his chair, looking thoughtful and pensive.  I wonder what he'd think of the parade of people passing by his chair today.  Maybe he'd write a play about us!", "publishedDate": "2018-10-01", "language": "en", "rating": 4}, {"id": 583760738, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d11932628-r583760738-Monument_to_Frederic_Soler_i_Hubert-Barcelona_Catalonia.html", "text": "I had to do some research for this. Frederic Soler i Hubert was a playwright, poet and theatre impresario. This statue shows him seated and with thoughtful expression. Good for a photo.", "publishedDate": "2018-05-29", "language": "en", "rating": 4}, {"id": 563757653, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d11932628-r563757653-Monument_to_Frederic_Soler_i_Hubert-Barcelona_Catalonia.html", "text": "It would be easy to miss this monument, though it is very white and tall so stands out as you walk along La Rambla.  There is no information about this monument when you see it, which is unfortunate and although not a \"wow\" monument, I took the time to stop and have a look at the design of the plinth it sits on, which is unusual.", "publishedDate": "2018-03-02", "language": "en", "rating": 3}, {"id": 559655912, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d11932628-r559655912-Monument_to_Frederic_Soler_i_Hubert-Barcelona_Catalonia.html", "text": "This is a rather nice, even if unremarkable, statue, located on the Rambla.\nIt's worth taking a minute or two to appreciate the statue before continuing your stroll.", "publishedDate": "2018-02-10", "language": "en", "rating": 3}, {"id": 551712050, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d11932628-r551712050-Monument_to_Frederic_Soler_i_Hubert-Barcelona_Catalonia.html", "text": "One of those things you could easily miss while running down las ramblas but a really interesting piece. Some good detail in it", "publishedDate": "2018-01-05", "language": "en", "rating": 3}, {"id": 527871548, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d11932628-r527871548-Monument_to_Frederic_Soler_i_Hubert-Barcelona_Catalonia.html", "text": "It is worth a 3 minute detour to take a quick look at this statue, located in a pocket park just off Las Ramblas. Another one of the many points of interest in the Gothic Quarter.", "publishedDate": "2017-09-27", "language": "en", "rating": 3}, {"id": 523013889, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d11932628-r523013889-Monument_to_Frederic_Soler_i_Hubert-Barcelona_Catalonia.html", "text": "This interesting statue is located in a small plaza just to one side of La Rambla towards the coast end. It commemorates to life and works of the playwright and poet Frederic Soler. It is constructed of marble and depicts him seated in an armchair atop a short column.\nWe have noticed it several times during previous visits to Barcelona. However, it was during our most recent visit that we decided to stop and take a close look at it. It is finely sculpted and is, on close inspection, a splendid statue. \nWorth pausing to take a look if you happen to be in the area!", "publishedDate": "2017-09-09", "language": "en", "rating": 4}, {"id": 452325123, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d11932628-r452325123-Monument_to_Frederic_Soler_i_Hubert-Barcelona_Catalonia.html", "text": "You ought to know the background for the monuments, you pass on your way.\nMake a stop and let your thoughts go back.\nFrederic Soler i Hubert was a catalan playwrighter, poet and teater-impresario.\nHe lived from 1839 to 1895.\nFrederic Soler was also known under the psynonym: Serafi Pitarra.\nThe big monument is made by Pere Falques and Agusti Querol in 1906.\nIt is positioned on Placa del Teatre at the Rambla.", "publishedDate": "2017-01-16", "language": "en", "rating": 3}]}}]