[{"locationId": 2223655, "name": "Joan Antonio Samaranch Olympic & Sports Museum", "placeType": "ATTRACTION", "reviewListPage": {"reviews": [{"id": 733849613, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d2223655-r733849613-Joan_Antonio_Samaranch_Olympic_Sports_Museum-Barcelona_Catalonia.html", "text": "As an Olympic Games and sports aficionado, I was impressed by the amount of memorabilia and information this place had not only on the 1992 Barcelona Games, but on the origin of sports competition.\n\nTickets: Great value in the ticket price. Would gladly pay it again. (6 or 8€?)\n\nFacilities: bathroom, lockers to store your bags (small), souvenir shop\n\nTime: I spent 70 minutes and had to leave at closing. I could have done 2.5 hours easy but for a typical museum visitor I would set aside 90 minutes.\n\nThe museum is set up as a timeline, beginning with the origins of sports and competition. The chronological set up makes it easy to follow the development of sports as part of entertainment and culture in different regions.\n\nMemorabilia and descriptions from many countries and disciplines are presented spanning decades. While there is a focus on Olympic sports, it seems any kind of physical activity is covered (snowshoeing, mountain climbing, dune buggy racing).\n\nI was too young to experience the Barcelona Olympics but after seeing this museum I feel like I did. Pieces of opening ceremony costumes, advertisements, newspapers, torches, mascots, game used uniforms/kits... Beautiful presentation.\n\nInteractive areas: Use the database to find athletes of past Olympics. Watch videos of historic moments. Go through the “athletic feats” type assessment to test speed and reflex. You can spend a lot of time on these.\n\nThis place is worth the walk/ride/drive/hitch from Barcelona’s center, I promise! Afterwards, visit the stadium and keep your eyes on the sidewalk to see the footsteps of some of the sports worlds greatest.", "publishedDate": "2019-12-20", "language": "en", "rating": 5}, {"id": 723224693, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d2223655-r723224693-Joan_Antonio_Samaranch_Olympic_Sports_Museum-Barcelona_Catalonia.html", "text": "Incorporated into our walk of the Montjuic area.  A really well laid out museum, a little bit of every sport, kept things interesting. Good memorabilia and photos.  Really well laid out, friendly staff, good restrooms.  Pop over to look at the stadium afterwards.", "publishedDate": "2019-11-02", "language": "en", "rating": 5}, {"id": 721258599, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d2223655-r721258599-Joan_Antonio_Samaranch_Olympic_Sports_Museum-Barcelona_Catalonia.html", "text": "I really enjoyed this well laid out, modern museum of sports and the Olympics. It was really informative with lots inside, but not overwhelming. One of the best museums I visited on my trip.", "publishedDate": "2019-10-25", "language": "en", "rating": 5}, {"id": 719803002, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d2223655-r719803002-Joan_Antonio_Samaranch_Olympic_Sports_Museum-Barcelona_Catalonia.html", "text": "This was not a planned stop for us.  We were walking through the public gardens of Parc de Montjuïc when my daughter decided she really had to go to the restroom.  Unfortunately, the nearest public toilet was out of order.  We were planning on walking around the Olympic stadium and had time to kill, so the Museum seemed like a good place to both take care of an urgent problem and have a bit of fun.  And it didn't cost a ton.\n\nOnce inside, we found (a bathroom) a ramp leading down to the lower floors lined with exhibits telling the story of sports with mini-exhibits explaining a variety winter and summer Olympic events.  The exhibits typically consist of a picture or two of athletes performing the task and then a piece or two of equipment with a little bit of text next to it (in English).  Seeing and touching a bobsled from the 1970's and an Indy car mounted on a wall were highlights.  \n\nOnce we reach the ground floor, you get to the exhibits more focused on the Olympics and the Barcelona games specifically.  There are a bank of video monitors that can be used to see highlights of previous Olympic games.  Here, my favorite sites was a line-up of Olympic torches from decades of Olympic games.  These things are amazing works of design artistry.  I also enjoyed Salvador Dali's half hearted letter of support for the games to come to Barcelona.  \n\nAll in all the kids seemed to not mind this as much as a typical museum and my wife and appreciated the simplicity of a relaxing, low impact, and straightforward history lesson.  And there were helpful staff around as well who volunteered interesting tidbits of trivia.  The bathrooms were very nice too.", "publishedDate": "2019-10-20", "language": "en", "rating": 4}, {"id": 715797867, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d2223655-r715797867-Joan_Antonio_Samaranch_Olympic_Sports_Museum-Barcelona_Catalonia.html", "text": "We loved this museum as it was a tribute to every sport imaginable, even those that just recently joined the Olympics like golf. The exhibits were well curated and it was easy to do a self-guided tour. Best of all, we got in free since we’re over 65.", "publishedDate": "2019-10-06", "language": "en", "rating": 5}, {"id": 702086408, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d2223655-r702086408-Joan_Antonio_Samaranch_Olympic_Sports_Museum-Barcelona_Catalonia.html", "text": "It is the most innovative sports museum I have visited, it has an expansive collection of Olympic memorabilia. It's worth a visit if you are intrested in sports and the Olympics in particular", "publishedDate": "2019-08-23", "language": "en", "rating": 4}, {"id": 698984511, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d2223655-r698984511-Joan_Antonio_Samaranch_Olympic_Sports_Museum-Barcelona_Catalonia.html", "text": "This is a great little museum and my 12 year old, who is a keen runner, loved it and the Olympic stadium next door.  It’s nicely late out, with some great exhibits and although only takes just over an hour to visit the price was very reasonable, particularly with the Barcelona book of discount vouchers given out at tourist information. ", "publishedDate": "2019-08-14", "language": "en", "rating": 5}, {"id": 683231217, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d2223655-r683231217-Joan_Antonio_Samaranch_Olympic_Sports_Museum-Barcelona_Catalonia.html", "text": "A hidden gem of a museum.  If you are interested in sport in general or the Olympic movement then Barcelona deserves full marks for this imaginative and interesting museum.\n\nAn extensive and interesting array of artifacts that makes a a visit to the Olympic Park complete.  Entry prices are modest (free to Seniors) and staff are polite and helpful.  There is even a small range of souvenirs at very good prices.\n\nFinally across the road is the diving centre from the '92 Olympics.  Get a drink from the cafe to the right and sit and drink in both your purchase and a stunning view.  Then imagine how the competitors managed to concentrate against such a backdrop, whilst the spectators enjoyed the sport and the view and now doubt roasted in the sunshine.", "publishedDate": "2019-06-21", "language": "en", "rating": 5}, {"id": 683017243, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d2223655-r683017243-Joan_Antonio_Samaranch_Olympic_Sports_Museum-Barcelona_Catalonia.html", "text": "Nice museum with nice photos of a variety of athletes. Cool artifacts like signed balls and @ctual shoes of athletes. All signs in English. The flow of the museum  is easy to follow. . The interactive part needs a little more explanations, how do you do the running long jump activity? Less than $6 for the visit! Add a gift shop. Nice restrooms and free lockers was a nic plus. Not crowded even with a school group song a scavenger hunt.", "publishedDate": "2019-06-20", "language": "en", "rating": 5}, {"id": 674613987, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d2223655-r674613987-Joan_Antonio_Samaranch_Olympic_Sports_Museum-Barcelona_Catalonia.html", "text": "It is a big task to present the whole history of sport and it seems inevitable that it becomes rather superficial. For example. cricket is represented by a couple of bats and a painting, while baseball must do with an untitled photo of, I assume, Jackie Robinson. There are some good pictures and a few objects, but the only thing really explored is the legacy and life of Samaranch, with his collection of awards (and chestnuts!). There are lots of high tech video screens and some interactive stuff, but it seems a bit of a sad almost forgotten ghost museum. The coffee is nice and if you are in the area, drop in, but I found it a tad disappointing.\nThe best exhibit for me was the last one, the complete collection of Olympic posters.", "publishedDate": "2019-05-17", "language": "en", "rating": 3}, {"id": 665096798, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d2223655-r665096798-Joan_Antonio_Samaranch_Olympic_Sports_Museum-Barcelona_Catalonia.html", "text": "Stopped in while viewing many of the surrounding olympic sites.  It is worth the visit up to see them.  We decided to stop in here.  It was interesting.  Not a comprehensive museum but a good way to spend an hour or so.", "publishedDate": "2019-04-09", "language": "en", "rating": 4}, {"id": 661521402, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d2223655-r661521402-Joan_Antonio_Samaranch_Olympic_Sports_Museum-Barcelona_Catalonia.html", "text": "The first part of the museum shows a lot of the history of different sports and of the Olympic movement. It is a little confusing and as a sports fan I found some of the choices of sports to put in the spotlight were poor, and some of the people shown as very important for each sport were only important inside Spain and not so important in the world context. Also the history of the Olympic movement could have been put in another way, there are some big time lapses in the history and some of the most important (even if sad moments) are not present / are not show as much as I feel they should. Then there is a zone dedicated only to sports in Catalonia, witch is cool but feels a little of an ego trip for the Catalan people. This part is ok, but not amazing.\n\nAfter this comes the best part: one zone with a lot of Olympic torches, some important trophies, and the personal collection of Joan Antonio Samaranch, with a lot of things he collected during his life. Some are not very interesting, but some are really really cool if you are into the Olympic games. There is also a big section only about the 92 games, and it is also amazing, with a lot of things from 92 and  the history of this game explained in detail. This part alone was worth the ticket me. In the end there is an area dedicated to the relation between sports and the media, also worth to spend some time in this last one.\n\nThing is, I feel it is not perfect - but still worth it if you are into sports.", "publishedDate": "2019-03-26", "language": "en", "rating": 4}, {"id": 656315130, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d2223655-r656315130-Joan_Antonio_Samaranch_Olympic_Sports_Museum-Barcelona_Catalonia.html", "text": "If you are a sports buff and you can take in a bit of history for free then hop off the bus and stroll in. This is the main Olympic arena of the 1992 Summer Olympics. We stood there and watched a rerun Of Linford Christie winning the 100m final to get the atmosphere... great!", "publishedDate": "2019-03-04", "language": "en", "rating": 3}, {"id": 644131987, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d2223655-r644131987-Joan_Antonio_Samaranch_Olympic_Sports_Museum-Barcelona_Catalonia.html", "text": "One of the tour busses stop. Its where they do thir soccor games. If they have a game scheduled you should go here", "publishedDate": "2019-01-06", "language": "en", "rating": 4}, {"id": 640930800, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d2223655-r640930800-Joan_Antonio_Samaranch_Olympic_Sports_Museum-Barcelona_Catalonia.html", "text": "The museum has a wide range of sports memorabilia and historical items. Some recent for some are pretty old. You get a discount with the Barcelona Card. You can store your belongings at the lockers for free. \nThere are some interactive stuffs at the lower floor for kids to try out. It is a good educational museum. ", "publishedDate": "2018-12-21", "language": "en", "rating": 4}, {"id": 629715154, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d2223655-r629715154-Joan_Antonio_Samaranch_Olympic_Sports_Museum-Barcelona_Catalonia.html", "text": "1992 Olympic Stadium had free entry and is an interesting place to stop at if you're on the bus tour. Free entry with a gift shop and cafe. Intresting to see an old olympic stadium and the sports museum close by is well worth a look (approx €6 entry). ", "publishedDate": "2018-10-30", "language": "en", "rating": 4}, {"id": 626570389, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d2223655-r626570389-Joan_Antonio_Samaranch_Olympic_Sports_Museum-Barcelona_Catalonia.html", "text": "This museum a short walk up Montjuic, is free and has lockers to check your backpacks.  It starts with the history of the Olympic movement back in the 1800’s or earlier, and covers when and how different sports were introduced. The movement grew  exponentially when women were finally allowed to compete.  World famous medalists in their sports get recognition, such as Wayne Gretzky, Lindsay Vonn, Michael Phelps. Also much of the memorabilia comes from various athletes, and understandably many Spanish ones.   It was interesting to learn how a neurosurgeon deserved credit for the start of the Para-Olympic movement.   There is a smaller representation of Winter Olympics, and the statistics one can search out on big computer seating on the bottom level cover up to 2002.   There is a small restaurant on the top level which we appreciated having a coffee and egg sandwich in. ", "publishedDate": "2018-10-19", "language": "en", "rating": 5}, {"id": 613333834, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d2223655-r613333834-Joan_Antonio_Samaranch_Olympic_Sports_Museum-Barcelona_Catalonia.html", "text": "We didn't do the museum only the Olympic Village and stadium but that is fabulous to wonder round, its great that it is opened up to the public, it is kept clean and tidy with the fountains still working. ", "publishedDate": "2018-09-02", "language": "en", "rating": 5}, {"id": 607477456, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d2223655-r607477456-Joan_Antonio_Samaranch_Olympic_Sports_Museum-Barcelona_Catalonia.html", "text": "The museum is really interesting & well done - also good value for money. We then had a coffee & ice cream at the cafe outside before a walk around the stadium & the park with the water features - all free & great to see.", "publishedDate": "2018-08-17", "language": "en", "rating": 4}, {"id": 605258521, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d2223655-r605258521-Joan_Antonio_Samaranch_Olympic_Sports_Museum-Barcelona_Catalonia.html", "text": "We very much enjoyed looking around the Olympic village before spending time in the museum. Very well laid out and embracing all sports. It was very interesting to see how much sport has evolved over the years. The interactive screens were a huge hit with the kids! ", "publishedDate": "2018-08-11", "language": "en", "rating": 4}, {"id": 590295771, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d2223655-r590295771-Joan_Antonio_Samaranch_Olympic_Sports_Museum-Barcelona_Catalonia.html", "text": "There are some really great views from all around the Olympic Park up on the mountain top as we decided to walk around the whole thing. You can imagine the crowds & the atmosphere back in the day when they were all competing. A great bit of history well kept. It’s a nice walk from the fountains at the bottom (especially with the help of the escalators). ", "publishedDate": "2018-06-24", "language": "en", "rating": 4}, {"id": 589747458, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d2223655-r589747458-Joan_Antonio_Samaranch_Olympic_Sports_Museum-Barcelona_Catalonia.html", "text": "We decided at the last minute to stop and see this museum. It was a hot day and we needed a cool spot to hang out in for a bit. What an unexpected great experience! We’re sports fans and enjoyed the Olympic history and memorabilia. The entrance price is modest compared to other spots in the City. This was a great find. ", "publishedDate": "2018-06-22", "language": "en", "rating": 5}, {"id": 582886698, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d2223655-r582886698-Joan_Antonio_Samaranch_Olympic_Sports_Museum-Barcelona_Catalonia.html", "text": "The idea of visiting the olympic museum isn't a bad idea, but here's better idea. Take the Barcelona City Bus tour and you can visit the actual site of the opening of Barcelona's last olympics.", "publishedDate": "2018-05-26", "language": "en", "rating": 1}, {"id": 576097323, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d2223655-r576097323-Joan_Antonio_Samaranch_Olympic_Sports_Museum-Barcelona_Catalonia.html", "text": "Very nice museum,exhibition is atractive for children,many interesting information and nice stepfoot mark of Czech olympic history like Zatopek,Guth-Jarkovsky,Navratilova,Zelezny. High reccomended!", "publishedDate": "2018-04-27", "language": "en", "rating": 5}, {"id": 571547066, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d2223655-r571547066-Joan_Antonio_Samaranch_Olympic_Sports_Museum-Barcelona_Catalonia.html", "text": "Checked out this place on a whim after going on the cable cars and was pretty disappointed. Surely the idea of it was nice to see but I wasn’t impressed. It was literally like looking at a deserted stadium and we couldn’t go anywhere except on one side. Maybe we were missing something? Wrong timing? We didn’t have to book a tour, it was free to go in and I understand why. ", "publishedDate": "2018-04-06", "language": "en", "rating": 2}, {"id": 570307054, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d2223655-r570307054-Joan_Antonio_Samaranch_Olympic_Sports_Museum-Barcelona_Catalonia.html", "text": "I had free entry to the museum by using my Barcelona Card.  There weren’t many people inside.  Museum is well laid-out with many Olympic exhibits and also other sport exhibits ranging from chess to mountain climbing.  Signs on the displays were also in English.  There are several interactive hands-on displays which were fun.  It’s definitely worth a visit.  There is also a restaurant on site.\n\nThe museum is close to the Barcelona Olympic Stadium.", "publishedDate": "2018-04-01", "language": "en", "rating": 5}, {"id": 569314570, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d2223655-r569314570-Joan_Antonio_Samaranch_Olympic_Sports_Museum-Barcelona_Catalonia.html", "text": "A small but rather interesting museum about the sports. Some sections need improvement, but even average sports fan will find few things new. Definitely worth the money.", "publishedDate": "2018-03-28", "language": "en", "rating": 4}, {"id": 567486973, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d2223655-r567486973-Joan_Antonio_Samaranch_Olympic_Sports_Museum-Barcelona_Catalonia.html", "text": "This place was one of my favorites to visit. I had great time exploring the facility. A lot of history is told in the tour. Great place to visit for any sport fan.", "publishedDate": "2018-03-19", "language": "en", "rating": 5}, {"id": 545886585, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d2223655-r545886585-Joan_Antonio_Samaranch_Olympic_Sports_Museum-Barcelona_Catalonia.html", "text": "It took two goes for us to get in - the first time we tried we didn’t realize that it was a public holiday with early closing. Not to be deterred we went back the following day, and were glad we did. Some excellent interactive stuff, and some good artefacts from all of Olympic History. One of the cheaper museums to enter, as well. As other reviews have said, the nearby stadium and park areas are lovely for a stroll in the sun.", "publishedDate": "2017-12-07", "language": "en", "rating": 4}, {"id": 503327253, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d2223655-r503327253-Joan_Antonio_Samaranch_Olympic_Sports_Museum-Barcelona_Catalonia.html", "text": "What a great museum, so worth it. I would go back as there is so much to see here. Great for sports and history fans alike. Don't forget to visit the stadium!", "publishedDate": "2017-07-18", "language": "en", "rating": 5}, {"id": 489747326, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d2223655-r489747326-Joan_Antonio_Samaranch_Olympic_Sports_Museum-Barcelona_Catalonia.html", "text": "This museum is definitely value for money. It is packed full of sporting memorabilia throughout ages, not all from the Olympics and really gives you an insight into how technology has helped to advance sport. \n\nOf course the best items come from the Barcelona games; the arrow that \"officially lit\" the Olympic cauldron, I found quite interesting. \n\nThe museum also has an interactive section to test your skill and agility. My husband and I probably spent a bit too long in this area but the museum was so quiet it didn't matter.\n\nWe also ate in the cafe upstairs. I was expecting cakes and sandwiches but the menu had proper meals; steak, pasta etc. We had burgers, avoid the chicken burger but the beef cheese burger was great and again at a very reasonable price. \n\nAll in all a great place to visit. ", "publishedDate": "2017-06-01", "language": "en", "rating": 5}, {"id": 483036467, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d2223655-r483036467-Joan_Antonio_Samaranch_Olympic_Sports_Museum-Barcelona_Catalonia.html", "text": "not recommended go with children and untisports fans. all exhibits were until 2004 olympics. the museum need more active activities.", "publishedDate": "2017-05-09", "language": "en", "rating": 4}, {"id": 480541448, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d2223655-r480541448-Joan_Antonio_Samaranch_Olympic_Sports_Museum-Barcelona_Catalonia.html", "text": "This museum has a great variety of sports and Olympic memorability. It has a great deal of History and fun facts. Also a few things to try out!!!", "publishedDate": "2017-05-01", "language": "en", "rating": 5}, {"id": 462658533, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d2223655-r462658533-Joan_Antonio_Samaranch_Olympic_Sports_Museum-Barcelona_Catalonia.html", "text": "We walked a lot in Barcelona - it's the way we like to explore. After quite a walk to the Olympic stadium I'm pleased to say it was well worth it... Though I hoped to see the pool also but that was hidden away behind fencing further down the hill towards the overhead lifts.\nIt was sooo quiet up there, with brilliant views across the ocean and city. It was lovely to get away from the noisy city and crowds.", "publishedDate": "2017-02-25", "language": "en", "rating": 4}, {"id": 461715951, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d2223655-r461715951-Joan_Antonio_Samaranch_Olympic_Sports_Museum-Barcelona_Catalonia.html", "text": "One of many great sites on Montjuïc hill and, like most everything in Barcelona, conveniently accessible by public transport.\nMy son and I went on a quieter day (a Tuesday, I believe) and spent a good 2+ hours meandering our way through a huge assortment of Olympic and sports memorabilia. The interactive sections were also a real hit with my son.\nWe finished it up with a walk over to the Olympic Stadium next door.\nWe had a great afternoon.", "publishedDate": "2017-02-21", "language": "en", "rating": 5}, {"id": 445539848, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d2223655-r445539848-Joan_Antonio_Samaranch_Olympic_Sports_Museum-Barcelona_Catalonia.html", "text": "If you are a sports fun it's a must visit!\nIt has exhinitions from all past olympic games, all the torches, many medals and many props that were used at the opening ceremony of barcelona, including the Hercules.", "publishedDate": "2016-12-20", "language": "en", "rating": 5}, {"id": 436453803, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d2223655-r436453803-Joan_Antonio_Samaranch_Olympic_Sports_Museum-Barcelona_Catalonia.html", "text": "The best part of this place is once you buy tickets and get inside, you can participate in almost all the Olympic Games in offline mode, we tried all the sports football on that super green grass court, cycling, taken pictures, experienced the commentary from the commentators rooms. It was just amazing experience. You can easily spend a day if you participate in all the sports, or need at least a few hours to walk around the stadium to see it from all sides. Just a beautiful place to be. Have become fan of Olympic stadiums.", "publishedDate": "2016-11-11", "language": "en", "rating": 5}, {"id": 432202900, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d2223655-r432202900-Joan_Antonio_Samaranch_Olympic_Sports_Museum-Barcelona_Catalonia.html", "text": "If you are fascinated by the Olympics and Sport in general this is the place to go.\n\nModern museum with lots of artefacts and plenty of video and computer imagery to see.\n\nAlso get to see the stadium and surrounding area.", "publishedDate": "2016-10-27", "language": "en", "rating": 4}, {"id": 429970827, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d2223655-r429970827-Joan_Antonio_Samaranch_Olympic_Sports_Museum-Barcelona_Catalonia.html", "text": "We went here as my son is interested in the Olympics.  It is a little gem of a museum, very well laid out and interesting both for adults and children.  Also it is much cheaper than many other attractions in Barcelona, and when we visited on a Sunday morning it was nice and quiet.  You can get the funicular up here which adds to the fun - the funicular stop is only five to ten minutes walk away.", "publishedDate": "2016-10-20", "language": "en", "rating": 5}, {"id": 422936586, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d2223655-r422936586-Joan_Antonio_Samaranch_Olympic_Sports_Museum-Barcelona_Catalonia.html", "text": "Good history of different sports, beautiful museum you can feel the history in it. Cheap entry in , can be a little boring for small children", "publishedDate": "2016-09-27", "language": "en", "rating": 4}, {"id": 421516016, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d2223655-r421516016-Joan_Antonio_Samaranch_Olympic_Sports_Museum-Barcelona_Catalonia.html", "text": "When coming down from the Montjuic hill, we wanted to have some coffee. We spotted the museum and decided to check it. 5 EUR entrance fee and you get the miracles of the Olympics! Checking out the actual racing bolid of MIka Hakkinen, the famous air-Jordans and numerous other artifacts... The museum is brilliant. Maybe not among the top 5 places to visit in Barcelona, but definitely one of the places that deserve to be visited. By the way, the restaurant above the museum serves one of best coffees in Barcelona :)", "publishedDate": "2016-09-23", "language": "en", "rating": 5}, {"id": 409523535, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d2223655-r409523535-Joan_Antonio_Samaranch_Olympic_Sports_Museum-Barcelona_Catalonia.html", "text": "Seems a little antiquated now but the history of the place is whats fascinating, need to spend a good few hours walking around it to take it all in.", "publishedDate": "2016-08-23", "language": "en", "rating": 3}, {"id": 405423730, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d2223655-r405423730-Joan_Antonio_Samaranch_Olympic_Sports_Museum-Barcelona_Catalonia.html", "text": "We found this small museum next to the Olympic Stadium, cheap to enter, a bit of a strange mixture of sports and not so much about the Barcelona Olympics, but worth the visit, lots of interactive things for children. The museum is inexpensive and the stadium is free to enter and look around, there are also lots of nice parks nearby with great views of the city, which are also free.", "publishedDate": "2016-08-14", "language": "en", "rating": 4}, {"id": 399434749, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d2223655-r399434749-Joan_Antonio_Samaranch_Olympic_Sports_Museum-Barcelona_Catalonia.html", "text": "The museum is nice, especially for sport fans obviously. To my surprise the content is not about olympics only, but it's rather wide, covering all different sports including those outside of the olympic selection (e.g. Speleology...). The tour is organized based on how sports evolved historically up to the present. You can see sport equipment (e.g. Shoes) used by some of the world's famous sportsmen. There is an interactive section too, which we appreciated the most. You can compare your running & jumping skills with the top athletes who are displayed on the wall and you can run & jump along with them. \nI found the section on Barcelona olympics a bit poor in content. Overall I expected less artifacts on overall history of sport and more on the actual olympic games in Barcelona.\nIf you are a true sports fanatic and it rains, go there. But if not, you rather choose one of the other attractions Barcelona offers...", "publishedDate": "2016-07-31", "language": "en", "rating": 3}, {"id": 398797528, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d2223655-r398797528-Joan_Antonio_Samaranch_Olympic_Sports_Museum-Barcelona_Catalonia.html", "text": "As a Gamesmaker at the 2012 Olympics, I was extremely pleased to be able to visit Barcelona's  Stadium and Park.  IT WAS ALL FREE.....brilliant and you could walk around all the areas and just soak up the atmosphere.  Be sure to exit the Stadium and look at the main entrance park and fountains.  For up to 28 euros you can join the Open Camp activities which allow you to race on the track (100ms), do hurdles, long jump, play footy and take penalties and even experience a Moto GP bike ride simulator.  What a way to get children interested in sports.  A fantastic visit and legacy.", "publishedDate": "2016-07-29", "language": "en", "rating": 5}, {"id": 393494271, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d2223655-r393494271-Joan_Antonio_Samaranch_Olympic_Sports_Museum-Barcelona_Catalonia.html", "text": "With teenage boys in the family this was an obvious choice.  \n\nWe spent a pleasant couple of hours wandering round this museum dedicated to Olympic history.  They've got a lot of historical and interesting artifacts - Roger Federer's tennis shoes, Mika Hakkinnens's F1 Car and various sporting kits from famous Spanish olympians.   We loved the display of all the Olympic flame torches in a row, including one from London 2012.\n\nThe interactive section was a bit of a let down.  We had expected a few more things to do but we did have fun trying out the few bits that were there - on our own as it was very quiet too!\n\nWorth the fee to get in, especially if you get the 25% discount we found online, and teenagers are included in the student rate.", "publishedDate": "2016-07-17", "language": "en", "rating": 4}, {"id": 391828692, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d2223655-r391828692-Joan_Antonio_Samaranch_Olympic_Sports_Museum-Barcelona_Catalonia.html", "text": "The stadium is excellent, and free to see inside. The host of the 1992 Olympic Games had aged fairly well. It has the classic amphitheatre look of historical stadiums.\n\nThe museum has a great number of Olympics and sports exhibitions, and interactive sections. Highlights for me were Mika Hakkinen's McLaren, a Herculean model from the 1992 opening ceremony and commemorative posters from all the modern Olympic games. For 5.10 euros, it is a steal.", "publishedDate": "2016-07-12", "language": "en", "rating": 5}, {"id": 377729736, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d2223655-r377729736-Joan_Antonio_Samaranch_Olympic_Sports_Museum-Barcelona_Catalonia.html", "text": "Nostalgic tour of the Olympic Stadium used for the 1982 Olympics. The stadium itself is free to enter and wander about including the walk of champions with bronze foot plaques in the ground, but most of the other mini stades were closed.\n\nThere's also a giant monument to the Olympic flame. I wanted to see the place where the diving championships took place with the city as the backdrop, but unfortunately the pool was closed on the day we arrived, although we did get to view it from a very nice elevated cafe right beside it. Some of our party took the 10 minute cable car journey, which gives spectacular aerial views of the city, but not for the faint heated, as the cable car rocks and swings and sometimes comes to a random abrupt stop mid-air.\n\nWe arrived there on one of the \"hop on - hop off\" tour buses. €28 for one day using three different  buses.", "publishedDate": "2016-05-29", "language": "en", "rating": 4}, {"id": 371474283, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d2223655-r371474283-Joan_Antonio_Samaranch_Olympic_Sports_Museum-Barcelona_Catalonia.html", "text": "This museum is very well laid out and worth the 5 euros to get in. A great selection of Olympic and sport memorabilia. I enjoyed the honour to Samaranch and the specific Barcelona '92 displays. It could use a bit of updating (not much from 2010 and beyond). I've visited several other museums in Olympic cities and I think this one definitely has the most related to the specific host city. I spent almost 2hrs reading all if the facts and viewing the exhibits.\n\nTake some time to visit Olympic Stadium which is right next to the museum.\n\nMy only complaint was a very poor gift shop - it doesn't exist!", "publishedDate": "2016-05-09", "language": "en", "rating": 5}, {"id": 361517655, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d2223655-r361517655-Joan_Antonio_Samaranch_Olympic_Sports_Museum-Barcelona_Catalonia.html", "text": "5 euros to get in and we were there for a while. Very interesting with lots of facts to read and interactive videos and activities to do. If you are a sports buff then this is the place and scene of a cracking men's long jump competition in 1992.", "publishedDate": "2016-04-04", "language": "en", "rating": 5}, {"id": 356405638, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d2223655-r356405638-Joan_Antonio_Samaranch_Olympic_Sports_Museum-Barcelona_Catalonia.html", "text": "Not just about the Olympics, this museum covers a number of other sports. Well presented and informative, with loads of interesting exhibits and sports equipment donated by stars. Good value. The Olympic Stadium is round the corner and you can pop into that too.", "publishedDate": "2016-03-17", "language": "en", "rating": 4}, {"id": 350382963, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d2223655-r350382963-Joan_Antonio_Samaranch_Olympic_Sports_Museum-Barcelona_Catalonia.html", "text": "We spent the whole afternoon in this museum learning about the Olympics and sports with rich and details materials, pictures, films and donated articles from sportsmen accross the globe.\nWe had the best experience here in this museum specially on the interactive section. This is recommended even if you dont have kids. For kids it is particularly interesting as it has a funny and interactive way to explain history and sports.", "publishedDate": "2016-02-23", "language": "en", "rating": 5}, {"id": 343860058, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d2223655-r343860058-Joan_Antonio_Samaranch_Olympic_Sports_Museum-Barcelona_Catalonia.html", "text": "right next to the olympic stadium (and close to Miró's exhibition) museum is a building which is built in the mountain and has approx. three floors underground. Everything very profesionally designed and beautiful, the exposition is understandeable and qualitative. The museum is also interactive and it takes approx. 1 hour to go through it. \nWith Barcelona card the attraction is for free", "publishedDate": "2016-01-30", "language": "en", "rating": 5}, {"id": 327802993, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d2223655-r327802993-Joan_Antonio_Samaranch_Olympic_Sports_Museum-Barcelona_Catalonia.html", "text": "I am a soccer and sport fan but I can't say this museum is very interesting. I entered it only because I went there with an organization that paid for our entry, otherwise I wouldn't have ever paid for entering this museum.", "publishedDate": "2015-11-19", "language": "en", "rating": 3}, {"id": 321422719, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d2223655-r321422719-Joan_Antonio_Samaranch_Olympic_Sports_Museum-Barcelona_Catalonia.html", "text": "Worth the traipse up the hill and the entry fee pretty good value. Lots to see and appreciate but felt a bit dated with very little beyond 2004 on the video displays. The reflex test and jump challenge were good and seeing Bolt's speed over ten metres pretty impressive too. ", "publishedDate": "2015-10-24", "language": "en", "rating": 4}, {"id": 321411772, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d2223655-r321411772-Joan_Antonio_Samaranch_Olympic_Sports_Museum-Barcelona_Catalonia.html", "text": "Situated very close to the Olympic Stadium this museum is a great way to spend a couple of hours learning about the history of the Olympic movement. From the interactive area where you can investigate all manner of Olympic facts and figures to the items on display such as items of clothing worn at various Olympics from the past not just the Barcelona Games. Well worth it.", "publishedDate": "2015-10-24", "language": "en", "rating": 5}, {"id": 314188262, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d2223655-r314188262-Joan_Antonio_Samaranch_Olympic_Sports_Museum-Barcelona_Catalonia.html", "text": "very interesting museum! Feel myself proud for my country after visiting this museum! There are many info about Olympic Games and many trophies!", "publishedDate": "2015-09-27", "language": "en", "rating": 4}, {"id": 309369241, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d2223655-r309369241-Joan_Antonio_Samaranch_Olympic_Sports_Museum-Barcelona_Catalonia.html", "text": "The museum and the stadium area is really nice.\nIt is built with very swainish look and feel.\nVery pleased to walk around and see the spectcular buildings.\nMuseum is also good inside with good details and interactive exhibits.\nGood for family and kids to learn about olumpics.\nCafe outside the museum is nice also and serves good food which you can eat in this beautiful setting.", "publishedDate": "2015-09-11", "language": "en", "rating": 4}, {"id": 306376743, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d2223655-r306376743-Joan_Antonio_Samaranch_Olympic_Sports_Museum-Barcelona_Catalonia.html", "text": "This museum is really great.  I'm not such a follower of any sporty however it was interesting to discover/review the history of the Olympic games and some great Olympic Champions!  Nice the possibility to view some historical videos about matches/performances on a comfortable two-place couch.  We had fun also in the play interactive area.", "publishedDate": "2015-09-02", "language": "en", "rating": 4}, {"id": 303163933, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d2223655-r303163933-Joan_Antonio_Samaranch_Olympic_Sports_Museum-Barcelona_Catalonia.html", "text": "Visited the Olympic park and really enjoyed walking around. There are water falls, great views, the entire area has been kept in excellent condition. Worth a visit", "publishedDate": "2015-08-25", "language": "en", "rating": 4}, {"id": 296987172, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d2223655-r296987172-Joan_Antonio_Samaranch_Olympic_Sports_Museum-Barcelona_Catalonia.html", "text": "It only cost about 5 Euros per person to visit this museum and it was well worth the visit. It is situated very close to the Olympic Stadium. If you enjoy any kind of sport you will enjoy this experience. The museum has sections for many different sports and you can learn about the history of different sports at the Olympics. There are many interesting things to see including equipment and clothing donated by famous sportspeople e.g. Michael Jordan's basketball shoes! There are lots of olympic things to see like all the torches, posters, mascots thorough the years. There is a good interactive section which children and adults seemed to be enjoying where you can test your reflexes, high jump, long jump and triple jump against the virtual Olympic athletes. There were computers where you could look up Olympic results and information about athletes and their achievements. I would recommend this museum to sport fans and families.", "publishedDate": "2015-08-08", "language": "en", "rating": 5}, {"id": 295842101, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d2223655-r295842101-Joan_Antonio_Samaranch_Olympic_Sports_Museum-Barcelona_Catalonia.html", "text": "You can not take backpacks in but they supply a locker for you to use and store it.  It takes you through the history of the games and you get to see different artifacts from all of the sports represented in the olympics.  You see torches from previous Olympic games and even costumes from the opening and closing ceremonies.  Outside they had the footprints from different athletes and the stadium is a short walk away.  Several items hung from the ceiling so make sure you look up.  Love it and would go to it again.", "publishedDate": "2015-08-04", "language": "en", "rating": 5}, {"id": 292517742, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d2223655-r292517742-Joan_Antonio_Samaranch_Olympic_Sports_Museum-Barcelona_Catalonia.html", "text": "I suppose the clue is in the name but I was expecting more 'Olympics' rather than the museum concentrating on the 'Sports'. The museum briefly covers the history of the Olympics, the development of the sports of the Olympics but also many other sports. There are some interesting pieces of memorabilia from the 1992 Games but it does need updating as the torch from the 2012 London Games was the only mention we could find. It has a small but fun interactive section for children and a section on Catalunyan sport which was interesting. There is also a section on the 1992 Barcelona Games with pieces of memorabilia. Good for an overview of sport as a whole and not expensive but if you are an Olympic fan you may be disappointed.", "publishedDate": "2015-07-26", "language": "en", "rating": 3}, {"id": 287403172, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d2223655-r287403172-Joan_Antonio_Samaranch_Olympic_Sports_Museum-Barcelona_Catalonia.html", "text": "It's 5.10 euros to enter which is fair for what is on offer.\n\nIf you are expecting a full on Olympic tribute then you are going to be disappointed. It's a mix of sports 'stuff' with some Olympic items thrown in. You can view the different torches from all Olympics  (both summer and winter) along with some medals. Apart from that it's a real mix of randomness. It has a couple of interactive events and videos which are decent. \n\nNot what I thought it would be but quite interesting and for the price it's ok. ", "publishedDate": "2015-07-09", "language": "en", "rating": 3}, {"id": 283659514, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d2223655-r283659514-Joan_Antonio_Samaranch_Olympic_Sports_Museum-Barcelona_Catalonia.html", "text": "The museum was well laid out.  It is a general overview of the Olympics.  It had a small area for each sport which both my son and I enjoyed.  There is an area that you can look up highlights from specific Olympics, also nice.  I skipped the homage to Samaranch.  It is cheap to enter. Worth going to if you enjoy sports and are in the area.", "publishedDate": "2015-06-28", "language": "en", "rating": 4}, {"id": 272777478, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d2223655-r272777478-Joan_Antonio_Samaranch_Olympic_Sports_Museum-Barcelona_Catalonia.html", "text": "wonderful museum next to the Olympic stadium. Lots of interesting things to see and look at, very interesting way to spend an hour or two and reasonably priced", "publishedDate": "2015-05-18", "language": "en", "rating": 5}, {"id": 269539373, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d2223655-r269539373-Joan_Antonio_Samaranch_Olympic_Sports_Museum-Barcelona_Catalonia.html", "text": "Nice museum, very informative, well designed.\nAs a sports fan, in my opinion the museum doesn't give much new information but it's nice for a short visit.", "publishedDate": "2015-05-02", "language": "en", "rating": 4}, {"id": 269539039, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d2223655-r269539039-Joan_Antonio_Samaranch_Olympic_Sports_Museum-Barcelona_Catalonia.html", "text": "Nice museum, very informative, well designed.\nAs a sports fan, in my opinion the museum doesn't give much new information but it's nice for a short visit.", "publishedDate": "2015-05-02", "language": "en", "rating": 4}, {"id": 265517843, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d2223655-r265517843-Joan_Antonio_Samaranch_Olympic_Sports_Museum-Barcelona_Catalonia.html", "text": "Got in for half-price using bus tour vouchers; full price a bit expensive for what it was. Some interesting exhibits and info. Very quiet; just us in cafe for a sandwich. Enjoyed the interactive bits.", "publishedDate": "2015-04-13", "language": "en", "rating": 3}, {"id": 265005774, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d2223655-r265005774-Joan_Antonio_Samaranch_Olympic_Sports_Museum-Barcelona_Catalonia.html", "text": "We turned up at 1:30PM to find it closed at 2:30 (our fault for not checking) , but our Barcelona Card gave us free entry so we went ahead. It was a pity we were rushed around as the collection was very well arranged and had some very interesting items. Well worth a visit. And as a bonus the Olympic Stadium next door is free entry. They have a collection of torches (which includes the UK one) but - to my wife's disappointment there was no other mention of our Olympics (nit picking if you ask me!). Also very close by is the botanic gardens which if you go in affords very good higher up views of the whole complex.", "publishedDate": "2015-04-11", "language": "en", "rating": 5}, {"id": 264247782, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d2223655-r264247782-Joan_Antonio_Samaranch_Olympic_Sports_Museum-Barcelona_Catalonia.html", "text": "Unlike some other reviewers, we thought this was an excellent museum, well laid out with some very interesting exhibits.  \n\nI particularly enjoyed viewing some of the costumes and automatons  from the opening ceremony, and the mascots from the Barcelona Olympics. I also liked the display of Olympic torches from other Olympic games.\n\nThe cost was E8, but we were in the museum for over an hour, so good value for money.", "publishedDate": "2015-04-07", "language": "en", "rating": 5}, {"id": 262115162, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d2223655-r262115162-Joan_Antonio_Samaranch_Olympic_Sports_Museum-Barcelona_Catalonia.html", "text": "Front of museum you can compare your foot size to famous Olympic athletics.  Huge foot size of basket ball players or tiny feet from women gymnastics. Inside is also hand print from Luis Suarez... Dental chart was not available!", "publishedDate": "2015-03-27", "language": "en", "rating": 3}, {"id": 260483958, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d2223655-r260483958-Joan_Antonio_Samaranch_Olympic_Sports_Museum-Barcelona_Catalonia.html", "text": "It was one of the best museums to visit with kids (10-11), so they could see all sports and learn about them. Nice display, easy to follow and look.", "publishedDate": "2015-03-19", "language": "en", "rating": 5}, {"id": 252648258, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d2223655-r252648258-Joan_Antonio_Samaranch_Olympic_Sports_Museum-Barcelona_Catalonia.html", "text": "Next to the Olympic Stadium, you enter at ground level and walk down a ramp that spirals down to the lower galleries, taking in the history of the Olympics from ancient times to the present day as you walk along. Coverage of each of the modern Olympics is the best part. Lots of fascinating exhibits, photographs, trophies etc. to see from various olympiads, bringing back many happy memories. It includes the summer and winter Games as well as covering other sports, pioneers of sport etc. Good balance of exhibits, though inevitably some bias towards Spanish successes. There's a Dynamics of Sport gallery on the lower floor where you can test your performance against elite athletes by seeing how high you can jump. Well worth the 5 Euros entry. A great excuse to while away a few hours.", "publishedDate": "2015-02-04", "language": "en", "rating": 5}, {"id": 250079082, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d2223655-r250079082-Joan_Antonio_Samaranch_Olympic_Sports_Museum-Barcelona_Catalonia.html", "text": "I've always loved the Olympic Games but the one thing that has always been missing at least from my perspective has been a single place where one can take in and appreciate the incredible feats of human accomplishment by the athletes that participate, the stories of sacrifice and perseverance on the part of the athletes and those that have supported them and the many moments that have defined the Olympic games over the years. \n\nThat all changed when I had the opportunity to visit the Juan Antonio Samaranch Olympic and Sport Museum on a family vacation in Barcelona in September 2013. My visit to the museum was at the last minute- literally. I had been on hop on hop off bus tour that stopped over in Port Olympico and I had declared to my family that there was no way I would leave Barcelona without seeing this museum so they knew that seeing it was a must. \n\nWhat I saw once inside took my breath away. It was amazing to see the many artifacts that have defined not just the Olympic Games but also the world of sport as a whole. Everything in the museum tells a story and this museum tells the story of how the Olympic games have evolved over the years from the many technological advances to the people that have defined the creation and continued evolution of the games. \n\nMost moving where video displays of several of the greatest moments in Olympic history and the display of torches from the first Olympic Games to the return of the Winter Games to my home country of Canada in 2010 and seeing the Vancouver torch on proud display made me relive my experience of being a firsthand witness to those games having personally attended the opening ceremony along with a speedskating and women's hockey event. It's too bad that I was a bit pressed for time- I could have easily spent the entire day just soaking up the incredible artifacts, history and stories inside of the Juan Antonio Samaranch Olympic and Sports Museum. \n\nThis museum while it may be somewhat small in terms of it's physical size is a place that captivates, inspires and educates. It did that with me on my visit to Barcelona and I hope it remains forever so that it may do the same for an entirely new generation of visitors.", "publishedDate": "2015-01-19", "language": "en", "rating": 5}, {"id": 239548634, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d2223655-r239548634-Joan_Antonio_Samaranch_Olympic_Sports_Museum-Barcelona_Catalonia.html", "text": "There are a few things of interest, but overall, we were disappointed and felt like we wasted our time and money on a museum of generic Olympic history.", "publishedDate": "2014-11-12", "language": "en", "rating": 2}, {"id": 238689594, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d2223655-r238689594-Joan_Antonio_Samaranch_Olympic_Sports_Museum-Barcelona_Catalonia.html", "text": "I have always loved the Olympic Games.\n\nThe museum is an embarrassment to its ideals.\nThis display receptacles are over crowded and some even incorrectly labelled.\nBadly light.\nPoor signage\n\nBasement is shrine like- to the man who brought the Games to the city.\nI found it offensive to be in an Olympic museum…let him pay for his own catacomb of memorabilia ..I wanted a refund I was that annoyed.\n\nI wouldn't bother with this or the stadium.\nBoth major disappointments.", "publishedDate": "2014-11-07", "language": "en", "rating": 2}, {"id": 234356184, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d2223655-r234356184-Joan_Antonio_Samaranch_Olympic_Sports_Museum-Barcelona_Catalonia.html", "text": "Lovely wee museum at the Olympic Park on Montjuic. The museum charts the Olympic Games through the ages, with artifacts, pictures and video footage going down a ramp to the basement. \n\nThe basement has a display of Olympic Torches, a set of PCs where you can info check to your geeky hearts content, and an interactive area for the kids. It was fairly quiet when I went, which was great :)\n\nLosing one star for the lack of a gift shop - I'd loved to have been able to buy some memorabilia. \n\nIf you use the Bus Turistic, you'll get a 241 voucher in the wee booklet - saves about 5E.", "publishedDate": "2014-10-14", "language": "en", "rating": 4}, {"id": 229135405, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d2223655-r229135405-Joan_Antonio_Samaranch_Olympic_Sports_Museum-Barcelona_Catalonia.html", "text": "From the outside this place looks pretty small and uneventful, and so with those low expectations I entered with my wife and six year old son. We were all really impressed, the way the stories of sports from around the world have been presented is really engaging and was as educational for me as it was our son. Covering all the Olympics and with interactive screens where you could choose historic sporting events to watch a added to the experience, and not forgetting the chance to test your own long jump and reactions against sporting benchmarks. Worth a visit !!!", "publishedDate": "2014-09-15", "language": "en", "rating": 5}, {"id": 223963245, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d2223655-r223963245-Joan_Antonio_Samaranch_Olympic_Sports_Museum-Barcelona_Catalonia.html", "text": "This dynamic museum displays the transformation of the Olympics all the way from Athens, Greece in B.C. until now through the use of video, athletic equipment, pictures, and descriptions.  I'm not a sports fan, but I really enjoyed my time here and got to truly appreciate how the Olympics came to be today, including the addition of new sports as well as people with disabilities and their part in the olympics. There is also a section where you can get more active and run to see how quick you're going and rock climb indoors as well.  Lots of fun here.  Someone really thought outside of the box to engage people that came in, and I highly recommend it.", "publishedDate": "2014-08-23", "language": "en", "rating": 5}, {"id": 222349385, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d2223655-r222349385-Joan_Antonio_Samaranch_Olympic_Sports_Museum-Barcelona_Catalonia.html", "text": "This is a good place and well set out. There's plenty to see and learn about Olympic history and the games in Barcelona back in 1992.", "publishedDate": "2014-08-17", "language": "en", "rating": 4}, {"id": 221600325, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d2223655-r221600325-Joan_Antonio_Samaranch_Olympic_Sports_Museum-Barcelona_Catalonia.html", "text": "I took my kids aged 11 and 5 as i knew they would be interested. But I was totally fascinated and drawn in. From the video clips of Nadia Comaneci (explaining to my kids that she was my hero when I Was their age), Mika Hakkinen's formula 1 car (it's not just Olympic sports) to the fun interactive room, its totally worth the time. Cafe is very nice and does great bocadillas. Only downer was no gift shop as I would have happily bought some memorabilia.", "publishedDate": "2014-08-13", "language": "en", "rating": 4}, {"id": 221093712, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d2223655-r221093712-Joan_Antonio_Samaranch_Olympic_Sports_Museum-Barcelona_Catalonia.html", "text": "Great Architecture, The venue is still used. Close to the city, easy to get to. Great views to the port area. ", "publishedDate": "2014-08-11", "language": "en", "rating": 5}, {"id": 216507082, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d2223655-r216507082-Joan_Antonio_Samaranch_Olympic_Sports_Museum-Barcelona_Catalonia.html", "text": "An interesting and interactive museum which shows all aspects of the Olympic movement. It kept our boys ,10 & 12, interested and keen to learn more.", "publishedDate": "2014-07-20", "language": "en", "rating": 4}, {"id": 215704439, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d2223655-r215704439-Joan_Antonio_Samaranch_Olympic_Sports_Museum-Barcelona_Catalonia.html", "text": "Really enjoyed this place once the school kids left. Lots of interesting facts on the history of sport, the Olympics, and Spanish sporting history. I was especially happy to find anything to do with the Sydney 2000 Olympics, which I attended as a very enthusiastic spectator.", "publishedDate": "2014-07-16", "language": "en", "rating": 5}, {"id": 212066164, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d2223655-r212066164-Joan_Antonio_Samaranch_Olympic_Sports_Museum-Barcelona_Catalonia.html", "text": "Having watched all the Olympics since 1968 (here's to you Roone Arledge and Jim McKay!) I remember just about everything displayed here.  There was nothing new and the presentation is not world-class.  \n\nFor just about every memorable achievement mentioned there's a companion piece about the best local athlete.  Under basketball, there's a picture of The Dream Team, next to it a photo of a very young Wilt Chamberlain noting his 100-point game, and then right next to that is an equally-sized picture of an East European athlete with a caption stating that he was one of the best centers every to play the game.  Who?!? Really?!?\n\nThe on-demand audio-video collection is weaker than what you could find on YouTube.\n\nIt's nice and the kids liked it, but if you remember the events as they happened, this isn't going to move your needle.", "publishedDate": "2014-06-25", "language": "en", "rating": 3}, {"id": 210421243, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d2223655-r210421243-Joan_Antonio_Samaranch_Olympic_Sports_Museum-Barcelona_Catalonia.html", "text": "Placed near the Olympic Stadium the museum is easy to reach either by Metro or Funicular railway, after a small walk. We decided to go around the museum after a quick visit to the Olympic stadium.\n\nAt first the museum is an introduction to sports, how they developed, and how the Olympics were formed and morphed into the modern Olympics that people watch today. The later part of the exhibit brings in more history of the Barcelona '92 Olympics, its organisation and the people involved in it. The final parts involves a archive of Samaranch's collections and his personal involvement in the IOC.\n\nOverall it was a interesting overview of the Olympics, and make me quite sad that the London Olympic Organising Committee has cancelled its plans to open a similar museum. If you're big into your Olympic history this is a must see, personally I was pulled here as the Barcelona '92 Olympics was the first real olympics I remember watching as a child. \n\nThe museum also has a small shop of original Barcelona '92 collectables, obviously stock that didn't shift the first time round, but still nice to pickup a small keyring of Cobi for the other half. The Cafe is nice but can be a little under staffed, we waited around 10-15 minutes for food but it was well worth the wait.", "publishedDate": "2014-06-15", "language": "en", "rating": 4}, {"id": 207151612, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d2223655-r207151612-Joan_Antonio_Samaranch_Olympic_Sports_Museum-Barcelona_Catalonia.html", "text": "Museum and stadium very good an useful insight into Olympic history in the museum, lockers need to be used as cannot take bags around.", "publishedDate": "2014-05-26", "language": "en", "rating": 4}, {"id": 201779235, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d2223655-r201779235-Joan_Antonio_Samaranch_Olympic_Sports_Museum-Barcelona_Catalonia.html", "text": "Chanced upon this museum while strolling around Montjuic and being a big sport fan went in. There are some interesting exhibits in here if like me you are into sport, perhaps not as much if you aren't, I particularly enjoyed some of the cycling exhibits including one of Miguel Indurain's bikes and yellow jerseys. Spent about 1.5 hours having a look round so decent value as well.", "publishedDate": "2014-04-19", "language": "en", "rating": 4}, {"id": 200713258, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d2223655-r200713258-Joan_Antonio_Samaranch_Olympic_Sports_Museum-Barcelona_Catalonia.html", "text": "Visited the museum as I wanted to see the Olympic Stadium. I quite enjoyed myself and it kept me amused for about 45 minutes. I was not able to use the interactive screens as there was a school party there who were using them.\n\nI was surprised that a museum that concentrated on the Olympics made no mention of the slaughter of the Israeli team at the Munich Games.\n\nGet the 150 bus to get there as it is quite a walk up hill.\n\nThe cafe is worth a visit and does a set lunch menu for 10 euros.", "publishedDate": "2014-04-11", "language": "en", "rating": 4}, {"id": 199616747, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d2223655-r199616747-Joan_Antonio_Samaranch_Olympic_Sports_Museum-Barcelona_Catalonia.html", "text": "The interior is set up without organization, not very careful and lacking a system. There are sports which have never even been olympic disciplines and kept treasures from sports champions are hidden in small, ugly glass vitrines - more like in a lab than a museum. There is noise coming from the sound system, video projections but none of them are really introduced or make sense, they just happen throughout the unorganized room-system. It was an experience that filled us with sadness and grief about all the money invested so poorly and the great location wasted on something like this.", "publishedDate": "2014-04-02", "language": "en", "rating": 1}, {"id": 184622256, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d2223655-r184622256-Joan_Antonio_Samaranch_Olympic_Sports_Museum-Barcelona_Catalonia.html", "text": "With so much to see in Barcelona, this is probably overlooked. We were the only ones in the museum for most of our visit. It is cheap to get in and you certainly get your money's worth. There is lots of Olympic memorabilia and other sports memorabilia, all of which I loved. Joan Antonio Samaranch's personal collection was fascinating too. Highly recommended!", "publishedDate": "2013-11-13", "language": "en", "rating": 5}, {"id": 184454659, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d2223655-r184454659-Joan_Antonio_Samaranch_Olympic_Sports_Museum-Barcelona_Catalonia.html", "text": "It's a great afternoon out with plenty to see from all the various games of the past. It also covers sporting stars from Catalonia.", "publishedDate": "2013-11-12", "language": "en", "rating": 5}, {"id": 183677050, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d2223655-r183677050-Joan_Antonio_Samaranch_Olympic_Sports_Museum-Barcelona_Catalonia.html", "text": "I would definitley advise you to visit. the entry price is cheep (free if you have the BCN card) and there is a lot to see. There are all the things from the Barcelona Olympics as well as items from the newer Olympics (Such as London and Vancouver).", "publishedDate": "2013-11-05", "language": "en", "rating": 5}, {"id": 182492295, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d2223655-r182492295-Joan_Antonio_Samaranch_Olympic_Sports_Museum-Barcelona_Catalonia.html", "text": "Very cheap , only 5 euros to enter using the Bus Turistic coupons. Excelleny displays telling the story of sport through the ages , the conception of the original games in Athens, the modern Olympic and Paralympic Games and the Mediterranean Games. Lots of memorabilia and inventive displays , with giant screens showing movies from some iconic moments from the Olympics. There are also some interactive activities for the big and little kids to enjoy. We were also able to step into the stadium itself while we were there. Recommended", "publishedDate": "2013-10-26", "language": "en", "rating": 5}, {"id": 179731350, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d2223655-r179731350-Joan_Antonio_Samaranch_Olympic_Sports_Museum-Barcelona_Catalonia.html", "text": "We spent a few hours in here, and our kids loved it (10 and 12 yo).\nIf you are in this area, do enter. Fun for big and small.", "publishedDate": "2013-10-04", "language": "en", "rating": 4}, {"id": 179650671, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d2223655-r179650671-Joan_Antonio_Samaranch_Olympic_Sports_Museum-Barcelona_Catalonia.html", "text": "The museum was great fun. Being a sports lover helps very much. However, it is not hard for non-sports fans to be amazed by the collection there! Many medals, used gear, old archaeological finds, even a set of about a dozen computers that allows you to access info about each Olympic Games and their athletes. The footprints outside by famous athletes were a very nice touch. If you are near the Olympic Stadium, I strongly recommend going to this museum!", "publishedDate": "2013-10-03", "language": "en", "rating": 4}, {"id": 179105928, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d2223655-r179105928-Joan_Antonio_Samaranch_Olympic_Sports_Museum-Barcelona_Catalonia.html", "text": "We really enjoyed our trip here. It was very informative especially the history of the modern Olympics. The displays were very good and beautifully laid out. The cafe was also very good with reasonable prices. The walk of fame outside is well worth following with many famous footprints.", "publishedDate": "2013-09-29", "language": "en", "rating": 5}, {"id": 178844060, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d2223655-r178844060-Joan_Antonio_Samaranch_Olympic_Sports_Museum-Barcelona_Catalonia.html", "text": "This museum focuses not just on the history of the Olympics, but also on pretty much any sport you can think of. There are lots of little exhibits and artifacts from Games gone by as well as a pretty impressive video wall all about record breaking athletes. An area dedicated to Joan Antonio Samaranch is also a very fitting tribute to the former IOC President and for me was one of the more interesting areas of the museum. The large collection of Barcelona 1992 mascots was also a highlight. There is a change to buy some souvenirs of the 1992 games here but they are quite expensive for they are. A few key rings and a rather expensive DVD of the opening and closing ceremonies are about all that's on offer. There is a reasonably priced cafe as on site as well.", "publishedDate": "2013-09-27", "language": "en", "rating": 4}, {"id": 176681422, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d2223655-r176681422-Joan_Antonio_Samaranch_Olympic_Sports_Museum-Barcelona_Catalonia.html", "text": "Plenty to see and read, very up to date with lots from London 2012, well laid out, helpful staff, the stadium is right next door and worth a look, well worth the money ", "publishedDate": "2013-09-10", "language": "en", "rating": 5}]}}]