[{"locationId": 11930453, "name": "Pomona", "placeType": "ATTRACTION", "reviewListPage": {"reviews": [{"id": 689875512, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d11930453-r689875512-Pomona-Barcelona_Catalonia.html", "text": "This sculpture is of the Roman goddess Pomona, the of goddess of fruit trees, gardens, and orchards. The Roman goddess of fruitful abundance is depicted with braided hair and wearing a low cut sheer garment. Like a scarf, she wears a branch full of fruit around her shoulders, falling down past her left hip. Her right hand is held up, palm open, in a gesture of victory. Her left hand is held in, the tips of her fingers touching the front of her right shoulder, in a very feminine gesture.\n\nThe sculpture can be easy to miss. It’s located at the entranceway on the south side of the Plaza and opposite Deutsche Bank, behind the sculpture of a shepherd and eagle.\n\nIt’s one of many statues in the plaza. It’s okay, I wouldn’t go out of the way to see it though.", "publishedDate": "2019-07-15", "language": "en", "rating": 3}, {"id": 676527279, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d11930453-r676527279-Pomona-Barcelona_Catalonia.html", "text": "Pomona is a small bronze sculpture in Plaza de Catalunya. She was the goddess of fruitful abundance, of fruit trees, gardens, and orchards, and here she is depicted as carrying a branch full of fruit. Perhaps an indicator that the city of Barcelona was blessed with such fruitful abundance!", "publishedDate": "2019-05-26", "language": "en", "rating": 4}, {"id": 630531584, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d11930453-r630531584-Pomona-Barcelona_Catalonia.html", "text": "Plaça De Catalunya is without a shadow of a doubt one of the most famous plaza's in Barcelona and is packed with some great looking statues including a statue of a Shepard, a blacksmith ,Hercules and several other great statues and the statue Pomona was yet another great statue that caught my eye.\nMy twin brother Stephen and I were heading to the wonderful Hard Rock Cafe and cut through the plaza were we admired the statues,this statue is to the goddess of fruits, it's well sculpured and very photogenic and makes for some great photographic opportunities. \nEasy to locate on Plaça De Catalunya and most definitely well worth seeking out.  ", "publishedDate": "2018-11-03", "language": "en", "rating": 5}, {"id": 584027316, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d11930453-r584027316-Pomona-Barcelona_Catalonia.html", "text": "Pomona is one of a number of sculptures on the plaza. The sculpture stands on a pedestal and is recessed into the structure behind. She is the Roman Goddess of fruit trees, gardens and orchards and is shown carrying a bunch of fruit across her shoulders.", "publishedDate": "2018-05-30", "language": "en", "rating": 4}, {"id": 529942895, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d11930453-r529942895-Pomona-Barcelona_Catalonia.html", "text": "Each Column leading into Plac De Catalunya has 2 sides and 2 different statues.\nTo really appreciate this plaza you have to walk around", "publishedDate": "2017-10-04", "language": "en", "rating": 4}, {"id": 453431689, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d11930453-r453431689-Pomona-Barcelona_Catalonia.html", "text": "On the southeast side of Plaza de Caluna there is an entrance, surrounded by two columns.\nOne the left column there is two sculptures.\nOne of them is Pomona.\nPomona was made of Enric Munjo in 1928.\nPomona is a roman goddess. She has a branch full of fruit over her back.", "publishedDate": "2017-01-19", "language": "en", "rating": 3}]}}]