[{"locationId": 240500, "name": "Big Fun Museum", "placeType": "ATTRACTION", "reviewListPage": {"reviews": [{"id": 746319696, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d240500-r746319696-Big_Fun_Museum-Barcelona_Catalonia.html", "text": "We really enjoyed the giant room, the upside down room and the ball pit! It was definitely a memorable experience.", "publishedDate": "2020-02-20", "language": "en", "rating": 5}, {"id": 745527461, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d240500-r745527461-Big_Fun_Museum-Barcelona_Catalonia.html", "text": "Indeed it is a BIG FUN place! I would not call it a \"museum\", since often \"museum\" has something \"boring\". \nIt has several very different parts: mirror labyrinth, \"believe it or not\" with very interesting or even surprising facts, psychiatric clinic simulation (not for kids, like in horror movies), huge bath of balls (fun not only for kids, believe me), and a lot of scenes to make unreal, funny, surprising pictures (let your fantasy drive you).\nWe definitely recommend this place to adults and kids!", "publishedDate": "2020-02-16", "language": "en", "rating": 5}, {"id": 739603587, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d240500-r739603587-Big_Fun_Museum-Barcelona_Catalonia.html", "text": "Big and bright building ,ubicated in the center of the city , in front of famouse mercado bokeria) outside you will notice the most amazing and catchy promotors of barcelona, dont be shy to take pictures and selfies with them . They love it . you can buy the ticket easily in bigfun website or just go ahead and ask workers for information . second most amazing thing about big fun- it makes you good looking for instagram . I recomend to go with friends or company ,even better with family. but if you re alone the stuff will help you with pleasure to take pictures and they are so pro in it.\nWell what about museum inside they are 8 , my favorits are topsy turvy house , alice in wonderland and scary room . For just 20 euros you have unlimited time and 8 wonderfull museums if it is not enouth for you for 25 euros you can have 9 museum and a spechial ticket that allowes you to visit the museum of illusions any day in beetween 1 year", "publishedDate": "2020-01-17", "language": "en", "rating": 5}, {"id": 733571089, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d240500-r733571089-Big_Fun_Museum-Barcelona_Catalonia.html", "text": "I liked it, because it is super expirience of my leisure time!!! I have come with my children and we had marvellous time with my family!!\n\nThe staff is perfect, we can eat smth fast inside and the photos which making  are funniest ))))", "publishedDate": "2019-12-19", "language": "en", "rating": 5}, {"id": 726786004, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d240500-r726786004-Big_Fun_Museum-Barcelona_Catalonia.html", "text": "Right on La Rambla, we planned ahead of time to make a stop at the Big Fun Museum. We had our four and seven year old kids so this was great for them, they had a blast. \n\nSome interesting visuals and a lot of silly and unique displays for the kids. There are a lot of photo opportunities!", "publishedDate": "2019-11-16", "language": "en", "rating": 4}, {"id": 722651501, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d240500-r722651501-Big_Fun_Museum-Barcelona_Catalonia.html", "text": "My son spotted this place which he had read about. After bit of nudging I went with him and thoroughly enjoyed the experience !\nThe upside down house was hilarious - and nothing I had experienced before.\nSome good facts from Guinness book of records.The cleaners were there mopping as we were going around- which I thought was not right, even if it was nearly closing time.", "publishedDate": "2019-10-30", "language": "en", "rating": 4}, {"id": 704636760, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d240500-r704636760-Big_Fun_Museum-Barcelona_Catalonia.html", "text": "The day we were in Barcelona was a stormy day so we were stuck for things to do. We bumped into the big fun museum and were not disappointed. The upside house was very funny and we spent most of our time there. We also really enjoyed the believe it or not section as it was very interesting. The big fun room was not our favorite, maybe more suitable for younger kids. Lockers provided for your belongings.\n", "publishedDate": "2019-08-30", "language": "en", "rating": 4}, {"id": 696415918, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d240500-r696415918-Big_Fun_Museum-Barcelona_Catalonia.html", "text": "We absolutely loved this museum practically had the place to our selves despite an outburst of rain - it is hilarious and suitable for any age - still laughing 😂", "publishedDate": "2019-08-06", "language": "en", "rating": 5}, {"id": 696224430, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d240500-r696224430-Big_Fun_Museum-Barcelona_Catalonia.html", "text": "It is €10 to enter just one part of the big fun museum - there is roughly 5 attractions to see. Went as a fun afternoon, but took roughly 10 minutes to see the whole of the topsy-turvy house, and it was really quite boring. Apart from a funny photo or two, we had nothing to show from our MONEY. Waste of time.", "publishedDate": "2019-08-06", "language": "en", "rating": 2}, {"id": 689764948, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d240500-r689764948-Big_Fun_Museum-Barcelona_Catalonia.html", "text": "The entrance person gave us bad info and we payed 10 euros per person to get in and we thought we could walk through different rooms but it was only one room. Please spend your money on other things in Barcelona. ", "publishedDate": "2019-07-15", "language": "en", "rating": 1}, {"id": 688224904, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d240500-r688224904-Big_Fun_Museum-Barcelona_Catalonia.html", "text": "Ran across this place on the way to dinner.  The Name made us laugh so we decided to end our night with a quick pop in for the kids ages 8 and 12.  Ended up staying longer and visited 3 museums. Our favorite was the upside down and the larger the. Life.  We ended up spending over an hour between the 2, laughing the whole time.  Great break from ruins, cathedrals and landmarks for kids and adults!", "publishedDate": "2019-07-09", "language": "en", "rating": 5}, {"id": 681643385, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d240500-r681643385-Big_Fun_Museum-Barcelona_Catalonia.html", "text": "Paid for entry to 5 museums but some we were only in a few mins. If you don’t have kids these are probably a waste of time although the Museum of Illusions which is part of the package but a few streets away was worth the visit so not a complete waste of money.", "publishedDate": "2019-06-15", "language": "en", "rating": 2}, {"id": 680738077, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d240500-r680738077-Big_Fun_Museum-Barcelona_Catalonia.html", "text": "€10 to go through one room that lasts around 3 minutes. Complete rip off compared to other attractions in Barcelona of the same price. ", "publishedDate": "2019-06-11", "language": "en", "rating": 1}, {"id": 675645060, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d240500-r675645060-Big_Fun_Museum-Barcelona_Catalonia.html", "text": "I am a solo traveller and decided to go along with one of the friends I had made out there, for a few hours whilst the weather wasn't very nice.\nIt turned out to be BRILLIANT, and I have some amazing photos that will always make me laugh and remember this trip with a smile.\nIt is quite small, but by the time you've positioned yourself for photos and been round everything, it takes time! We were there for 3 hours, and we saw 5/9 museums in there. The Candy one, Topsy Turvy House (Our favourite), Giants world, Mirror Maze and the Scary one. \nI must say that if we did it again, we wouldn't have chosen the scary one, as there wasn't much to see and it wasn't particularly scary - more freaky Guinness World record type models.\nA brilliant time all round though, takes a deceivingly long amount of time to properly enjoy each part - Allow 2 hours if you are doing 5 museums!", "publishedDate": "2019-05-22", "language": "en", "rating": 4}, {"id": 666878293, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d240500-r666878293-Big_Fun_Museum-Barcelona_Catalonia.html", "text": "Well worth visiting if you have kids. Lots of different options. The kids really liked the museum of illusions, and the giants house and tipsy turvy house at the main bit off the Rambla. Just a bit on the expensive side.", "publishedDate": "2019-04-16", "language": "en", "rating": 4}, {"id": 666295994, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d240500-r666295994-Big_Fun_Museum-Barcelona_Catalonia.html", "text": "Great fun in this amazing place. From the ones we tried I wouldn't advise the Horror Maze - not good. The mirror maze, Believe it or not, La Casa reversible, La Casa del Gigante - were a very well time spent. Fantastic for kids and adults as well.", "publishedDate": "2019-04-14", "language": "en", "rating": 4}, {"id": 663354293, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d240500-r663354293-Big_Fun_Museum-Barcelona_Catalonia.html", "text": "After seeing on line that children 0-18 was free we thought we’d give it a go, as a family of 2 adults and 4 kids we still thought it was a little pricey at 60€.  We were staying just down La Rambla so decided to get tickets there rather than online.  They wouldn’t honour the price advertised and told us that if we booked online then they wouldn’t allow us entry.  They told us that they could do us a deal of 20% of the children  making the total€156....96€ more their own website (and partner sites like trip advisor etc) are selling them for.  The young lad on reception was doing his best to put our point across to a female supervisor/manager that worked there.  She was nothing but rude. Mid conversation she decided she could no longer speak English so used the young lad as an interpreter. She was extremely rude and derogatory when talking about my family and probably wasn’t expecting us to respond to her in Spanish that we understood what she was saying. \n\nIf the customer service is that bad before you get in then good luck once your in there.", "publishedDate": "2019-04-02", "language": "en", "rating": 1}, {"id": 655645983, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d240500-r655645983-Big_Fun_Museum-Barcelona_Catalonia.html", "text": "Perfect place to spend some time with friends and have a bit of fun.\n8 + 1 different rooms are all worth it to visit. \n\n“+ 1” room is in different building called Museum of illusions and it’s just less than 10min by walk, which you can easily skip as it’s nothing special if you don’t have kids under 12. ", "publishedDate": "2019-03-01", "language": "en", "rating": 5}, {"id": 653947138, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d240500-r653947138-Big_Fun_Museum-Barcelona_Catalonia.html", "text": "We was actually passing down la rambler and fell across the wonderful place.\n\n9 different adventures/museums in 1.\n\ndifferent packages are available. And discounts available too. We did the 5 package. 14euros.\n\nWe was happy what we done which also includes the mazes ashould you wish. \n\nThe mirror maze is very good.", "publishedDate": "2019-02-21", "language": "en", "rating": 5}, {"id": 646451832, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d240500-r646451832-Big_Fun_Museum-Barcelona_Catalonia.html", "text": "I had seen this in the guide book but didn't give it much attention but found ourselves next to it when heading to Liceu station to go back to our hotel so gave it a go. I have to say we really liked it and it was a lovely end to the day. There are free lockers to put your bags in while you go round and there are two prices where you can choose to visit 5 or 9 rooms. We went for 5 rooms as my son didn't want to do the scary room. You can choose which rooms, my favourite was the upside down room and my son really loved the mirror maze. We chose to the illusions room as well which was in a separate museum just a short walk away. We had lots of fun and would recommend the 5 room option with young children. All the staff were really friendly and helpful, we enjoyed it a lot. ", "publishedDate": "2019-01-16", "language": "en", "rating": 5}, {"id": 643352778, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d240500-r643352778-Big_Fun_Museum-Barcelona_Catalonia.html", "text": "So having seen the only two reviews posted of Big Fun (one poor, one good) wasn’t really sure what to expect.... but for us it lived up to its name.  It was great fun, inventive and unusual, and a good way to keep my 14 year old son and 10 year old daughter amused for a while.  So I’d recommend it.  Staff were really friendly and helpful.  They warned us the scary museum was scary.... we didn’t listen but should have!  (My daughter had to come out and even my son felt queezy!)  The mirrors and labyrinth were great fun and there were good opportunities for some fun photos in the sweets and upside down museum.   I liked it.", "publishedDate": "2019-01-03", "language": "en", "rating": 5}]}}]