[{"locationId": 1976641, "name": "University of Pompeu Fabra", "placeType": "ATTRACTION", "reviewListPage": {"reviews": [{"id": 593099035, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d1976641-r593099035-University_of_Pompeu_Fabra-Barcelona_Catalonia.html", "text": "This university managed to present me with a narrow-minded blind arrogance of Catalan ethnocentrism. Let alone the staff members always put a poker face as if you owe them one million euros. Regarding the academic spirit of this university, it is more than ridiculous. A typical example is what happened in my thesis defense, in which my thesis (composed in English) was being judged by a catalan professor who did not speak English at all.\nCAN YOU BELIEVE THAT?\nThe courses I enrolled in were 100% lectured in English as announced by the uni, yet in the final defense you sent a Catalan who did not know English to judge my effort and my work and my contribution?\nWHERE IS YOUR CONSCIENCE?\nFurthermore, in my study there were two groups being compared-- Turkish and Chinese students with B2 level of Spanish and English. However, during my defense, this catalan woman said in Spanish that even if when both the Chinese and Turkish student groups have the same level of B2, Chinese students still perform worse than Turkish students. \nREALLY I WAS SHOCKED.\nI am not sure whether I am being over-sensitive, but still I sense that her statement is tinted with racial discrimination. Meanwhile, I am not sure from what database she managed to render such a conclusion. If there is one, please do share with me.\nSecond, this catalan woman disapproved of my \"lengthy\" reference list. But if my memory does serve me well, the standards in the TFM do require students to faithfully reflect their literature references in the work. Although she stated that it was impossible for me to read that much, thus again I am confused: Is reading \"too much\" a mistake for those who strive in academic field? Is faithfully reflecting the literature review also a mistake? And on what basis was she certain that i was \"not possible to read that much\" ?\nPlus, when announcing my grade, she simply walked out and told my grade while refusing to let me enter into the classroom. Thus I really have no idea what I have done to be treated so differently.\nAlso, I am aware of the fact that she is unable to pronounce my Chinese name, but it was not necessary for her to show such contempt on her facial expression.", "publishedDate": "2018-07-04", "language": "en", "rating": 1}, {"id": 507448901, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d1976641-r507448901-University_of_Pompeu_Fabra-Barcelona_Catalonia.html", "text": "The worst educational institution I have ever seen in my entire life. In terms of actual education, the university is a joke. Everyone gets accepted. The administration is rude and horrendous. No one wants to help you. No one wants to do anything. OMA (international office) is never open. Professors come late, or sometimes don't even show up to class. You have to chase professors and university administration for something as basic as a course syllabus. A good amount of antisemitism among the professors, as well as racism, and pro-Catalonia independence propaganda is everywhere. Even if you are an exchange student, and don't know a word of Catalan, all communication is done in Catalan, without the option of changing it to Spanish or English. Do yourself, and your education a favour, and skip out on this university.", "publishedDate": "2017-07-31", "language": "en", "rating": 1}, {"id": 253402524, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d1976641-r253402524-University_of_Pompeu_Fabra-Barcelona_Catalonia.html", "text": "We were passing and popped in for a look! Absolutely amazing! What a beautiful building. Was worth looking it as we were passing.", "publishedDate": "2015-02-09", "language": "en", "rating": 4}, {"id": 208044273, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d1976641-r208044273-University_of_Pompeu_Fabra-Barcelona_Catalonia.html", "text": "everyone's accepted! cheap classes! smart professors but they're not good at teaching. miss a deadline? no problem! it's extended forever because they want to keep their graduating and passing numbers up!\n\nyou will not be a master of anything after 1 year of classes with these people. \n\nthe office staff are nice though. :)", "publishedDate": "2014-05-30", "language": "en", "rating": 2}]}}]