[{"locationId": 2223526, "name": "MUHBA - El Call", "placeType": "ATTRACTION", "reviewListPage": {"reviews": [{"id": 649217161, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d2223526-r649217161-MUHBA_El_Call-Barcelona_Catalonia.html", "text": "If you are interested in the rich Jewish life in Barcelona before the Inquisition, this is the place. Great small museum  - very interesting. Free with Barcelona card.", "publishedDate": "2019-01-30", "language": "en", "rating": 5}, {"id": 642788627, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d2223526-r642788627-MUHBA_El_Call-Barcelona_Catalonia.html", "text": "Small museum but nicely laid out with good explanations. Definitely worth a visit if you are interested in the history of the Jews in Barcelona.", "publishedDate": "2019-01-01", "language": "en", "rating": 4}, {"id": 616465962, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d2223526-r616465962-MUHBA_El_Call-Barcelona_Catalonia.html", "text": "Despite being advertised as open from 11am-7pm when we arrived at around 1pm on a Wednesday we were told by the young man who opened the door that the museum was closing and would not be open again until Saturday.    Check beforehand if you really want to get inside this museum.  Good luck.  ", "publishedDate": "2018-09-14", "language": "en", "rating": 1}, {"id": 589124017, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d2223526-r589124017-MUHBA_El_Call-Barcelona_Catalonia.html", "text": "Between the 11th and 14th centuries the Jewish quarter of Barcelona housed the great Catalan cultural nucleus,where doctors,philosophers,mathematicians or astronomers shared and divulged their knowledge,until the ", "publishedDate": "2018-06-20", "language": "en", "rating": 5}, {"id": 373002134, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d2223526-r373002134-MUHBA_El_Call-Barcelona_Catalonia.html", "text": "The display above the ruins of ancient Jewish quarter tells the history of Jews in Barcelona. There is not much of a collection. \nIf you're interested in that subject I would highly recommend visiting the nearby old synagogue and hear the explanation. ", "publishedDate": "2016-05-15", "language": "en", "rating": 2}, {"id": 371341028, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d2223526-r371341028-MUHBA_El_Call-Barcelona_Catalonia.html", "text": "If this small museum would have good human guide's/actors, it would upgrade the experience greatly. Museums that have great art, grab the viewers' attention and imagination. Historical museums (like this) need to make a greater effort for visitors' attention. The video was OK but there were not enough chairs so I gladly sat on the clean floor. This could be a gem of a museum but it needs a bit more inspiration.", "publishedDate": "2016-05-08", "language": "en", "rating": 3}, {"id": 370674478, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d2223526-r370674478-MUHBA_El_Call-Barcelona_Catalonia.html", "text": "Pros: Good to get basic history of Jews in Barcelona, short visit\nCons: Small museum, limited information on Barcelona's Jewish community, difficult to reserve guided visits\n\nI wish they'd provide more information on the current state (and future) of Jewish communities in Barcelona (Catalunya)", "publishedDate": "2016-05-06", "language": "en", "rating": 3}, {"id": 353063229, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d2223526-r353063229-MUHBA_El_Call-Barcelona_Catalonia.html", "text": "Many displays to read of Jewish history in Catalonia.  The video (in English) was the best part.  I was surprised they didn't provide more of an explanation of the excavated Jewish home you walked over.", "publishedDate": "2016-03-05", "language": "en", "rating": 3}, {"id": 319630971, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d2223526-r319630971-MUHBA_El_Call-Barcelona_Catalonia.html", "text": "Nice small museum, very friendly staff, good idea of jewish lives and families before they where obliged to convert in 1391", "publishedDate": "2015-10-17", "language": "en", "rating": 5}, {"id": 280770718, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d2223526-r280770718-MUHBA_El_Call-Barcelona_Catalonia.html", "text": "This museum opened in March 2015 in the former home of a Jewish weaver.  The museum  has two floors of very good displays of Jewish life in Barcelona including a glass floor that covers roman ruins.  There were English signage although having a guide certainly enhanced our visit.  The guide was provided through Emily Mathews, owner and manager of South O'le Spain Tours who also provided tours for Segovia, Toledo, Granada, Seville, Cordoba, Baeza and Ubeda and three days in Barcelona.  This was one of the most comprehensive museums about Jewish history that we visited.", "publishedDate": "2015-06-16", "language": "en", "rating": 4}, {"id": 162601638, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d2223526-r162601638-MUHBA_El_Call-Barcelona_Catalonia.html", "text": "This museum is very well done, well explained on the audio guides and is extremely interesting.\n\nBut a can a city museum afford not to accept credit cards?!", "publishedDate": "2013-06-01", "language": "en", "rating": 4}, {"id": 157090110, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d2223526-r157090110-MUHBA_El_Call-Barcelona_Catalonia.html", "text": "It was the only museum we visit after we got a recommendation from our Runner Bean guide. \nIt was fantastic way to discover the history of the city. Fortunately, not everything is translated to English and this was quite disappointing.", "publishedDate": "2013-04-08", "language": "en", "rating": 4}, {"id": 154762489, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d2223526-r154762489-MUHBA_El_Call-Barcelona_Catalonia.html", "text": "Absorbing and well curated display of Barcelona's history including Roman ruins underground. ?7 entry fee includes good audioguide and is well worth it.", "publishedDate": "2013-03-16", "language": "en", "rating": 5}, {"id": 147324232, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d2223526-r147324232-MUHBA_El_Call-Barcelona_Catalonia.html", "text": "This is an archealogical dig under the existing city. Step back into the past and see some of the old Roman town, wander round the fish sauce factory, a villa, winery, laundry and more all below ground. Worth a visit if you are interested in Barcelonas ancient history. ", "publishedDate": "2012-12-12", "language": "en", "rating": 5}, {"id": 147066040, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d2223526-r147066040-MUHBA_El_Call-Barcelona_Catalonia.html", "text": "MUHBA opens up the history of Barcelona through artefacts, displays, animation and a descent (by lift) from the present day to 7BC. Visitors roam the remains of a Roman world discovered beneath the museum buildings (which include a couple of palaces) and the present cathedral. It was fascinating to see how a Roman world with fish refinery, winemaking factory, baths, villas, streets churches and the like gave way to the development of later generations. A free audio guide in English augmented the displays and printed English guides were also on hand. The explanatory video was cycled in Catalan, Spanish and English. Discounts for over 65s helped, too.", "publishedDate": "2012-12-09", "language": "en", "rating": 5}]}}]