[{"locationId": 6034377, "name": "Plaza del Pi", "placeType": "ATTRACTION", "reviewListPage": {"reviews": [{"id": 465068982, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d6034377-r465068982-Plaza_del_Pi-Barcelona_Catalonia.html", "text": "My fiancé & I have enjoyed drinks at one of the many tapas bars in this square on several occasions. The beautiful basilica dominates the centre of the square. Markets are held here at certain times. We enjoyed sitting out under the patio heaters, having a drink and people watching, while listening to the street entertainers. This square is in the Gothic quarter, not far from Las Ramblas. It's very atmospheric & better value than the bars on Las Ramblas. Well worth a visit.", "publishedDate": "2017-03-06", "language": "en", "rating": 4}, {"id": 441836532, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d6034377-r441836532-Plaza_del_Pi-Barcelona_Catalonia.html", "text": "This is a nice little Placa just off the Ramblas and dominated by Santa Maria del Pi. Both the church and the Placa are a lovely peep into the past and the market with it its honey, cheeses, breads etc. is very good. There are seats where you can sit and nibble your tasty snacks. and relax for a while as you continue further into the Barri Gotic", "publishedDate": "2016-12-03", "language": "en", "rating": 4}, {"id": 434957803, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d6034377-r434957803-Plaza_del_Pi-Barcelona_Catalonia.html", "text": "Part of the old town, this square in Barri Gotic gives you a good peek into the past and the way it has blended beautifully with the present!", "publishedDate": "2016-11-05", "language": "en", "rating": 4}, {"id": 427834001, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d6034377-r427834001-Plaza_del_Pi-Barcelona_Catalonia.html", "text": "A not very big square dominated by a nice big stone church.placed in Barri Gothic neighborhood,at short distance from La Rambla. Occasionally there are taking place fairies of local producers.", "publishedDate": "2016-10-14", "language": "en", "rating": 4}, {"id": 406376000, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d6034377-r406376000-Plaza_del_Pi-Barcelona_Catalonia.html", "text": "The pretty square fills with vendors selling cheese, honey, garlic mushrooms, nuts, breads, fruits, vegetables and meats.  As you walk along the stalls, you're frequently offered free samples. For centuries the outdoor markets have existed - fun to be a part of it still. Don't visit Spain without trying the many delicious cheeses. ", "publishedDate": "2016-08-16", "language": "en", "rating": 5}, {"id": 397677426, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d6034377-r397677426-Plaza_del_Pi-Barcelona_Catalonia.html", "text": "There are three idyllic squares around Basilica de Santa Maria del Pi.\nPlaza del Pi is one of them, in front of the head entrance to the Basilica.\nThe others are Placa de Sant Josep Oriol (along the Basilica) and Placeta del Pi (behind the Basilica).\nIt is a cosy and idyllic area in Barri Gotic.", "publishedDate": "2016-07-26", "language": "en", "rating": 5}, {"id": 385637587, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d6034377-r385637587-Plaza_del_Pi-Barcelona_Catalonia.html", "text": "located in the Gothic Quarter-it has some restaurants. benches located around allow some great people watching, nice spot in historic section", "publishedDate": "2016-06-24", "language": "en", "rating": 4}, {"id": 378330338, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d6034377-r378330338-Plaza_del_Pi-Barcelona_Catalonia.html", "text": "Known in Barcelona as Placa del Pi, this little square is located in the Gothic Quarter in front of the Basilica of Santa Maria del Pi. Very cute little square with restaurants and cafes dominated by the facade of the Basilica and the eponymous pine tree. A little out of the way but very much worth visiting.", "publishedDate": "2016-05-31", "language": "en", "rating": 4}, {"id": 368418323, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d6034377-r368418323-Plaza_del_Pi-Barcelona_Catalonia.html", "text": "Pretty little plaza in front of the Cathedral. Not crowded, although near to the Ramblas. Worth seeing.", "publishedDate": "2016-04-28", "language": "en", "rating": 4}, {"id": 318711624, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d6034377-r318711624-Plaza_del_Pi-Barcelona_Catalonia.html", "text": "Nice place to see while exploring the center of Barcelona. All the tiny streets that take you to the Plaza are amazing, but during the turist season may be quite crowded. The place is full of bars and restaurants.", "publishedDate": "2015-10-14", "language": "en", "rating": 5}, {"id": 289009411, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d6034377-r289009411-Plaza_del_Pi-Barcelona_Catalonia.html", "text": "I visited when going to hike the bell tower of the church. I really enjoyed this square and its neighborhood feel. As seen in the picture there are orange trees bearing fruit. There are also a few pines from which the church gets its name. It is so great to see square with trees because these are the only ones in the gothic quarter. Also great to see the market and everyone shopping in the square.", "publishedDate": "2015-07-14", "language": "en", "rating": 4}, {"id": 251651555, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d6034377-r251651555-Plaza_del_Pi-Barcelona_Catalonia.html", "text": "We found this little artist market online when planning our trip to Barcelona. They are open on weekens and sell all kinds of paintings. It is close to the Rambla and not hard to find if you have a map. I really recommed this artist market to anyone looking to buy local art. The artists sell their own work and usually it is rather cheap! We bought beautiful watercolor paintings from one artist. A wonderful memory from Barcelona. ", "publishedDate": "2015-01-29", "language": "en", "rating": 5}, {"id": 192382990, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d6034377-r192382990-Plaza_del_Pi-Barcelona_Catalonia.html", "text": "A pretty little square in the Gothic quarter. A good place for a quiet coffee (or beer) off the beaten track at one of the street cafes. Or to peruse the artists displays.", "publishedDate": "2014-01-28", "language": "en", "rating": 4}, {"id": 191854591, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d6034377-r191854591-Plaza_del_Pi-Barcelona_Catalonia.html", "text": "This small Piazza, close to the famous Las Ramblas, is an artist's sanctuary in a leafy square occupied by several portrait artists who will paint your portrait or a local scene while you wait. Reminds me a lot of Place du Tetre in Montmartre, Paris where we had our daughter painted by a local artist. A peaceful and interesting spot \"far from the madding crowd\".", "publishedDate": "2014-01-23", "language": "en", "rating": 4}]}}]