[{"locationId": 10093192, "name": "Parlament de Catalunya", "placeType": "ATTRACTION", "reviewListPage": {"reviews": [{"id": 730866248, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d10093192-r730866248-Parlament_de_Catalunya-Barcelona_Catalonia.html", "text": "The Parliament since inside the beautiful Parc Ciutadella. They actually give tours during week days in several languages. It is a beautiful historical building with a fountain in front.", "publishedDate": "2019-12-05", "language": "en", "rating": 5}, {"id": 722347795, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d10093192-r722347795-Parlament_de_Catalunya-Barcelona_Catalonia.html", "text": "A morning visit to Cuitadella park wouldn’t be complete without a visit to the parliament building. We only got to see the outside and there was a presence of police, not sure if this was additional due to the recent demonstrations or normal. A beautiful building nonetheless.", "publishedDate": "2019-10-29", "language": "en", "rating": 5}, {"id": 690676735, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d10093192-r690676735-Parlament_de_Catalunya-Barcelona_Catalonia.html", "text": "I visited the parliament as part of a free tour in English. First the building is a fantastic mix of Neo-Classical, Baroque and Catalan Modernism. The interiors are sumptuous and adorned with beautiful decorations as befit a palace originally intended for a queen.\n\nAs for the tour, it was great. The guide gave us a lot of history of the building, how the parliament works and even got a tour of the session chambers where I got to sit in the seat reserved for the President of Catalonia. Wonderful.\n\nTo the tour guide who gave the tour in English, thanks, you were great.", "publishedDate": "2019-07-18", "language": "en", "rating": 5}, {"id": 633158110, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d10093192-r633158110-Parlament_de_Catalunya-Barcelona_Catalonia.html", "text": "We took a guided tour.  The guide was lovely but her English was halting.  Instead of focusing on the building, we were subjected to a political discussion.  I understand all of the unrest here, but we wanted to learn about the building — we have read about the political situation.\n\nIt is well worth seeing the inside,  but prepare for a lot of political messaging.", "publishedDate": "2018-11-13", "language": "en", "rating": 3}, {"id": 585383381, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d10093192-r585383381-Parlament_de_Catalunya-Barcelona_Catalonia.html", "text": "The parliament building of Catalonia is in a surprisingly quiet corner near Parc de la Ciutadella. Unfortunately we did not have to chance to get in.", "publishedDate": "2018-06-05", "language": "en", "rating": 4}, {"id": 565300082, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d10093192-r565300082-Parlament_de_Catalunya-Barcelona_Catalonia.html", "text": "The parliament building here is stunning and yet so very simple.  While other parliament buildings are huge, appear Romenesque and overpower their location to show their importance, this one is like a country palace (see pics) decorated for its time with glorious hand-carved wooden and metal doors (see pic).\n\nThe archways are wonderful (see pic) as well as the painted patterns on the walls (see pic).  The bricks used are such a big feature of the pretty design, as are the wooden window shutters and romantic balconies (see pic).  Speaking of romance, a place that encourages couples to sit and enjoy the view is the pond in front of the parliament building, with a sculpture of a desperately sad woman in the middle (see pic).", "publishedDate": "2018-03-08", "language": "en", "rating": 5}, {"id": 558648644, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d10093192-r558648644-Parlament_de_Catalunya-Barcelona_Catalonia.html", "text": "While this was a lovely building in the tranquil park, there were no tours available during our visit, so we could only enjoy the lovely building's exterior.", "publishedDate": "2018-02-05", "language": "en", "rating": 3}, {"id": 381332700, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d10093192-r381332700-Parlament_de_Catalunya-Barcelona_Catalonia.html", "text": "I visit Barca more than once and today I see this place, with the amazing fountain and forest like atmosphere, I think I will visit it a lot, thank you Barcelona ", "publishedDate": "2016-06-10", "language": "en", "rating": 5}]}}]