[{"locationId": 10691974, "name": "Opera Samfaina", "placeType": "ATTRACTION", "reviewListPage": {"reviews": [{"id": 680921648, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d10691974-r680921648-Opera_Samfaina-Barcelona_Catalonia.html", "text": "I hope we have soon another opportunity to come back and see what they have for us again. Lovely staff! Garcias", "publishedDate": "2019-06-12", "language": "en", "rating": 5}, {"id": 616467892, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d10691974-r616467892-Opera_Samfaina-Barcelona_Catalonia.html", "text": "We all live in Cataluña and for once we went to the ramblas because this was the Roca brothers and the whole theme looked great on the website !!\nWhat a disappointment \n1. The entrance dirty and looking abandoned .\n2. No one even interested in welcoming us through the black curtain or even to take us on a tour and explain what the \nwalkway was all about \n3.  Service just ok but poor level of interest or knowledge \n4. Freezing cold red wine !!\n5. Sad Menu food ok nothing special \n6. Asked for a glass of Cava none available ( this is Cataluña !!\n \nOverall so disappointing ", "publishedDate": "2018-09-14", "language": "en", "rating": 1}, {"id": 549650257, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d10691974-r549650257-Opera_Samfaina-Barcelona_Catalonia.html", "text": "What a shame, interesting decor if a bit naff.   Seems like they are taking credit for many food types originating in Catalonia ????   Very few staff, we ordered a beer and rather than informing us on the beer and where it’s from ( remember they are selling themselves as the pride of Catalonia and its produce ) we were sold it as it’s the cheapest beer in barcelona.  We were looking for a gastronomic experience.  We then ordered two glasses of red wine and rather than a wine list of the great Catalan wines we were offered a very cold glass of the cheapest wine from vilanova ( I live here, I’m not a tourist) again we were told that if we were going to have two glasses each, buy a bottle as it’s cheaper!!!! I know that Catalans are the equivalent of our scotish but everything was sold on price , “we have  the cheapest wine at €4.50 a glass”. Embarrassing and cringe worthy.    I’m sure this wasn’t the idea when this establishment opened, where is the management it’s being run by the staff!!!  Wine was so cold it gave me terrible stomachache and then when I went to the delightful Xemei, I couldn’t eat my food or even have a slip of there delicious wine.  ", "publishedDate": "2017-12-27", "language": "en", "rating": 1}, {"id": 514375859, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d10691974-r514375859-Opera_Samfaina-Barcelona_Catalonia.html", "text": "What a unique dining experience! We stumbled upon this restaurant on Las Ramblas and had to give it a try. So glad we did! The tapas were delicious, the service was fantastic, and the experience itself is so surreal, future-esque, memorable & fun. Each \"room\" has a different theme with bizarre decor and lighting that is constantly changing while you dine. Hard to explain- you just have to experience it yourself! The server made great suggestions and everything we ate was delicious. Never seen anything like it and would highly recommend! ", "publishedDate": "2017-08-17", "language": "en", "rating": 5}]}}]