[{"locationId": 15208082, "name": "RENFE", "placeType": "ATTRACTION", "reviewListPage": {"reviews": [{"id": 752548666, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d15208082-r752548666-RENFE-Barcelona_Catalonia.html", "text": "The staff at renfe was limited. The staff they has were helpful, but as a visitor it could be tough as not enough staff around.\n\nThe trains were time consuming and in frequently alternating (express and slow ones)\nTravel times were not the best, also tickets prices have marked difference between express and slow ones. (express will save you 30-45 mins, useful if your there only for a short time.)\n\nTrains were clean.", "publishedDate": "2020-04-12", "language": "en", "rating": 3}, {"id": 751631997, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d15208082-r751631997-RENFE-Barcelona_Catalonia.html", "text": "Horrible transportation company. \nDon’t trust their agents at Barcelona central station. They point you in the wrong direction when looking for the platform and then, when you complain that you missed your train, they are getting physically aggressive with you", "publishedDate": "2020-03-22", "language": "en", "rating": 1}, {"id": 734757515, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d15208082-r734757515-RENFE-Barcelona_Catalonia.html", "text": "The train and seats were great but please take care as I put my handbag just under my seat and on arrival at Barcelona (from Gare de Lyon) I discovered my purse had been taken, with all my cards and cash. I was distraught to say the least and only later realised that a small jewellery box with sentimental pieces in had also gone. So do not put bags containing anything valuable under your seat. This experience ruined our train adventure.", "publishedDate": "2019-12-26", "language": "en", "rating": 3}, {"id": 731361713, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d15208082-r731361713-RENFE-Barcelona_Catalonia.html", "text": "I am not sure of all the issues regarding booking of train tickets on Spanish Railways but my experience is totally pleasant. Logging in on the Renfe site, I touch the logo showing a globe and it allows me to convert the site to English. It then ask for my personal details including that of my travelling companion and details of where I would like to go and date of travel. Upon completion, it showed me the train schedule for the chosen date with prices indicated. Once you make your choice, it will bring you to a payment site where you log in your payment details. My 2nd booking using the same credit card had a problem but when I used another credit card from a different bank, it was processed smoothly. Within minutes I received an email from Renfe confirming my bookings and asking me to print my tickets or keep them electronically. When I take the trains, it was a breeze. Just show your tickets at the gate and board the train. The inspector seems to have a manifest of all the assigned seats and will. Not bother you if it is  direct journey, otherwise you would merely be asked to show electronically or your printed tickets. Very efficient system and I do enjoy the ride.", "publishedDate": "2019-12-08", "language": "en", "rating": 5}, {"id": 727848929, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d15208082-r727848929-RENFE-Barcelona_Catalonia.html", "text": "One fast way to visit a little piece of France is by taking the fast speed Renfe train at Sants Station in Barcelona and get to Perpignan, the first French town in the south of France. This comfortable train, that also travels in between the major Spanish cities, literally flies and before you know it, you're getting off at Perpignan train station and it's now French what you hear spoken. Perpignan is a small and picturesque town in which you can practice your French and get a taste of France in case you have no time to get to Paris and need to go back to Barcelona", "publishedDate": "2019-11-20", "language": "en", "rating": 5}, {"id": 723345764, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d15208082-r723345764-RENFE-Barcelona_Catalonia.html", "text": "The Spanish high speed trains are wonderful.  Easy to get on board with luggage and the ride is comfortable.  They are on time, reliable.  Good seats.  Excellent alternative to flying.", "publishedDate": "2019-11-02", "language": "en", "rating": 5}, {"id": 715800997, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d15208082-r715800997-RENFE-Barcelona_Catalonia.html", "text": "We took the train from Barcelona to Madrid and it was an enjoyable experience. I think we ended up in first class due to a language barrier - or an over-eager ticket agent - because it was over 150€ each although we did get lunch included. We should have bought tickets in advance but we’re unsure of our schedule for the day. Oh well, lesson learned.", "publishedDate": "2019-10-06", "language": "en", "rating": 4}, {"id": 688820821, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d15208082-r688820821-RENFE-Barcelona_Catalonia.html", "text": "This was a great experience for our family. We flew to Madrid and took the train to Barcelona. It was about a 3 hour trip but very smooth, high speed. There was a small cafe car with snacks and beverages. We upgraded to first class and the seats were comfortable and spacious.", "publishedDate": "2019-07-11", "language": "en", "rating": 5}, {"id": 678081641, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d15208082-r678081641-RENFE-Barcelona_Catalonia.html", "text": "We did not rent a car in Spain, we just bought tickets a day or so in advance and traveled to Barcelona,Zaragoza, and Madrid by train without any problems. Just ask questions and get the information on times, station, etc. and you will be fine.", "publishedDate": "2019-06-01", "language": "en", "rating": 5}, {"id": 676325606, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d15208082-r676325606-RENFE-Barcelona_Catalonia.html", "text": "We used the fast train in Spain, going from Barcelona to Madrid and also to other places. The service is fast and efficient. Getting to the right carriage and then finding your seat inside is sometimes a bit of a hassle, particularly if you have not travelled by train in Europe. However it is easy to get used to it pretty quickly. We found the staff to be surprisingly helpful, sometimes, and a bit aloof at other times, but that is the Spanish temperament, to say the least.... As long as you have a valid ticket and read your information correctly, you should have no problems. The trains are clean and as they travel extremely fast you hardly feel the motion, which is great.", "publishedDate": "2019-05-25", "language": "en", "rating": 5}, {"id": 675353687, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d15208082-r675353687-RENFE-Barcelona_Catalonia.html", "text": "We took the high speed train from Barcelona to Madrid.  It ran about $75 each way in tourist or second class.  The trip was fast.  The train travelled about 185 mph.\n\nAlthough you don't realize it when sitting, the train sways a bit.  You notice this when carrying coffees back from the cafe car.\n\nUpon arriving at the station at either end, there was airport style security.  Baggage is scanned.  You walk through a scanner.  They check tickets before you can access the platform.\n\nIt's a good rail system.", "publishedDate": "2019-05-20", "language": "en", "rating": 4}, {"id": 674753877, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d15208082-r674753877-RENFE-Barcelona_Catalonia.html", "text": "I am totally disgusted. Despite paying for First Class tickets I find it abhorrent that the train coaches are not numbered as designated on the tickets. Getting assistance from the throng of Spanish crowd to board the coach was even more beguiling as even worse we were misdirected and headed towards the wrong end of the train with minutes left to departure. Finally flag an official whose best effort is to point his fingers in the southern direction unable to utter a word of English got us on board at the very last minute before departure.This is no way to board a train in this century and I say Renfe should get its act together a lot better. Tourist be warned.", "publishedDate": "2019-05-18", "language": "en", "rating": 2}, {"id": 661909751, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d15208082-r661909751-RENFE-Barcelona_Catalonia.html", "text": "We took 3 trains.  Barcelona to Madrid,  Madrid to Seville and Seville to Malaga.\nThe trains were comfortable, scenery was great, lots of olive and orange groves to see.  Went through lots of tunnels.  Very smooth.  There is not a lot of room for luggage.  You need to sit in your seat number That is listed on your ticket.  A great way to travel.", "publishedDate": "2019-03-28", "language": "en", "rating": 5}, {"id": 661780040, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d15208082-r661780040-RENFE-Barcelona_Catalonia.html", "text": "We took the Ave train from Barcelona to Madrid.I bought the tickets online in advance and splurged on first class(preferente) for €15 more.According to the website ,tickets were not available online more than 62 days in advance.For our travel dates, availability started one month before.The seats were 2-1 in first class with sockets for charging,not USB.We were offered newspapers and a snack pack.The train car was quiet,comfortable and clean.The boarding process at Barcelona Sants train station was organized.The ride was smooth and the scenery was beautiful.There were personnel  who directed passengers to the taxi bank at the Atocha station in Madrid.There were no chaos.I was so impressed.", "publishedDate": "2019-03-28", "language": "en", "rating": 5}, {"id": 660342851, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d15208082-r660342851-RENFE-Barcelona_Catalonia.html", "text": "I took the train between most of the major cities I visited in Spain.  It was always on-time, clean and easy to use.  Note that sometimes routes do sell out so need to buy tickets ahead of time, some well in advance.  Online the tickets are generally available about a month before.  The tickets are usually less expensive in advance and online so recommended.  Also in Barcelona, the train is available from the airport to downtown Barcelona with the metro ticket (one ride, with transfers for one euro!).  The downtown stops include the Passig de Gracia and Sants stops which have lots of connections with the metro lines.", "publishedDate": "2019-03-22", "language": "en", "rating": 5}, {"id": 656687524, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d15208082-r656687524-RENFE-Barcelona_Catalonia.html", "text": "Efficient, clean and cheap with plenty of trains for getting around, traveled from/to the airport and to/from Sitges.", "publishedDate": "2019-03-05", "language": "en", "rating": 5}, {"id": 651365595, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d15208082-r651365595-RENFE-Barcelona_Catalonia.html", "text": "we travel from Madrid to Barcelona and from Valencia to Madrid and enjoyed the comfort and service oriented staff from Renfe, they offer snacks and drinks to all the customers to purchase, they provide earpiece for listening music or watch the movie....! we booked this tickets on internet and every thing worked smoothly", "publishedDate": "2019-02-10", "language": "en", "rating": 4}, {"id": 645606610, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d15208082-r645606610-RENFE-Barcelona_Catalonia.html", "text": "Absolutely fantastic train service. Bought tickets for the journey from Barcelona to Valencia and the trip was so good we did the same on the return\n\nOutbound was great...return was even better\n\nDecided to spend on first class...only an extra £7 on the 2nd class fare...£55 for a 3 hr 50 min train ride..no brainer \n\nSo in first class we had a free drink and a small bag of snacks, charging facilities and on return trip a table, nice quite carriage...well worth the extra spend\n\nReally really clean carriage and very comfortable seats\n\nA superb journey through the Spanish countryside, hugging the coastline as well for a considerable part of the route\n\nTotally recommend this train journey and operator", "publishedDate": "2019-01-13", "language": "en", "rating": 5}, {"id": 642369909, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d15208082-r642369909-RENFE-Barcelona_Catalonia.html", "text": "Especially this train seems very old, entartaitment system doesn't work properly. Toilet toom with many spots of corrosion and calcium deposits ", "publishedDate": "2018-12-30", "language": "en", "rating": 3}, {"id": 640932945, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d15208082-r640932945-RENFE-Barcelona_Catalonia.html", "text": "We took the high speed train from Barcelona to Madrid. It leaves on time and total journey was 2hours and 45minutes.\nAt the Sants station they will scan your tickets and you have to go through a security check for your luggages and jackets.\nThe train was clean and there is a cafeteria on board. The staff also bring a trolley with food and drinks for you to purchase. There is also kids menu.\nThey hand out earpiece for you to listen to the music or watch the movie. There is 1 channel only for the movie.\nThe toilet was okay and plenty of storage space for large luggages or you can put them at the top of your seat.\nThe train speed hovers between 250 to 300 km/hour.", "publishedDate": "2018-12-21", "language": "en", "rating": 4}, {"id": 627317610, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d15208082-r627317610-RENFE-Barcelona_Catalonia.html", "text": "This could be the second best option to get to the city from the airport or vice versa. We took the train from clot metro station to terminal 2, it took around 40 mins. Then we had to take a free shuttle from terminal 2 to terminal 1 which took 15 mins.\n\nTo use RENFE you would use a normal single trip metro/bus ticket. The best option is to buy a T10 ticket. Each journey would cost nearly 1 euro so you can get to wherever you want in the city only with nearly 1 euro\n\nThe downfall is the schedule, transition from terminal 2 to 1 or vice versa and also we could not clearly find our way to get the train in Clot station so we had to ask about the direction", "publishedDate": "2018-10-22", "language": "en", "rating": 4}, {"id": 622503310, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d15208082-r622503310-RENFE-Barcelona_Catalonia.html", "text": "I found out on the internet about R2N train that runs supposedly every 30 minutes from Barcelona airport T2 (terminal 2) to the city center. It sounded like a good choice, so we decided to give a try. Getting from T1 to T2 was no problem at all - airport bus came quickly and took us and dropped us off by a metro station where RENFE (train) station was about 7 minutes walking distance. Well, we waited and waited, hoping that the train will be there any minute. It was a hot day and it was an open station, so it was really hot. About one and half hours later, the train finally showed up. After everybody squeezed in, a large cround was gathered waiting for the train, the train waited for another 10 minutes or so before it decided to depart. It was a hot day, it was warm inside. After a long flight that is not what you want to experience. Skip the train if you want to have a pleasant rest of the day!", "publishedDate": "2018-10-05", "language": "en", "rating": 1}]}}]