[{"locationId": 8564136, "name": "Mercado del Ninot", "placeType": "ATTRACTION", "reviewListPage": {"reviews": [{"id": 751212243, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d8564136-r751212243-Mercado_del_Ninot-Barcelona_Catalonia.html", "text": "Recently had a few days in Barcelona, thankfully left before lockdown. After a bit of research located this market, very few tourists mainly locals.\nClean friendly place.\nVisited various places to eat all excellent for different reasons, I always try order in the local language and had a fantastic reaction to speaking Catalan, this I found to really help through out the trip.\nWe would totally recommend to visit.", "publishedDate": "2020-03-17", "language": "en", "rating": 5}, {"id": 750820548, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d8564136-r750820548-Mercado_del_Ninot-Barcelona_Catalonia.html", "text": "Not nearly as busy nor as well stocked with flashy tourist stuff as La Boquitiera on the Rhamblas but it is a very good market if you are staying in the area and wish to cook in your apartment.  There are a few restaurants in the market that are worthwhile.", "publishedDate": "2020-03-14", "language": "en", "rating": 4}, {"id": 735272907, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d8564136-r735272907-Mercado_del_Ninot-Barcelona_Catalonia.html", "text": "Perfect place to switch off from Ramblas and all touristic junk. There is a nice chicken place inside (roughly in the middle of the market) with a wide variety of chicken burgers. The chef cooks in front of you whilst having friendly conversations. The burger was delicious, fries were ace! Nice beer and a VERY cheap bill. You stuff up with less than 10euros. I had to come back the day after!", "publishedDate": "2019-12-29", "language": "en", "rating": 5}, {"id": 729875804, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d8564136-r729875804-Mercado_del_Ninot-Barcelona_Catalonia.html", "text": "We went here together with our chef guide when we took a cooking class in Barcelona.\nI will definitely go back here when I visit Barcelona again.\nMy Rating :\nAmbiance - 5 out of 5\nService - 5 out of 5\nFood Quality - 4 out of 5\nCleanliness - 4 out of 5\nPrice Points - 4 out of 5", "publishedDate": "2019-11-30", "language": "en", "rating": 4}, {"id": 729294450, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d8564136-r729294450-Mercado_del_Ninot-Barcelona_Catalonia.html", "text": "Olives jarred or canned, ham in vac packs, sweets, and olive oil (all sorts of other meats and an ocean full of fish) for those who want to shop not take part in the tourist spectacle of Mercat de Bouqueria ... have comfort.\nIf you can’t find it ... go downstairs to Mercadona a huge supermarket with everything imaginable.\nQ-Trip: Super restaurant Jobs is just across the street. \n", "publishedDate": "2019-11-27", "language": "en", "rating": 4}, {"id": 722956177, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d8564136-r722956177-Mercado_del_Ninot-Barcelona_Catalonia.html", "text": "Really good food, I like seafood and I recommend that place. Always fresh and cheap. But so busy for all day.", "publishedDate": "2019-10-31", "language": "en", "rating": 5}, {"id": 716437227, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d8564136-r716437227-Mercado_del_Ninot-Barcelona_Catalonia.html", "text": "Beautifull seafood and vegetables everywhere, and prepared foods as well.  Try Perralla's, where Guadaloupe will serve you a cold beer and many different small plates of seafood..  Medusa has good seafood for lunching in, too.  If you tire of this, or want a restaurant, just go across the street to Porvenir, a very good local seafood restaurant that seems always lively with Spanish customers.", "publishedDate": "2019-10-08", "language": "en", "rating": 5}, {"id": 709852574, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d8564136-r709852574-Mercado_del_Ninot-Barcelona_Catalonia.html", "text": "If you find la Boqueria a bit intense and also busy maybe also expensive then this place newly refurbished maybe for you an excellent market with few tourists and a great range of meat, seafood and fruit and veg plus some nice places to eat. Sure it doesn’t have the bustle but it is where the locals actually do shop and it’s much safer from pickpockets etc. Not to knock la Boqueria it’s really up to you . Easy to find and in a less touristy area of the city but very safe ", "publishedDate": "2019-09-15", "language": "en", "rating": 5}, {"id": 708587879, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d8564136-r708587879-Mercado_del_Ninot-Barcelona_Catalonia.html", "text": "We had tried Mercat La Boqueria which we found too full of tourists, very busy and very overpriced.  The Mercaders Del Nino however is the opposite, a relaxed space which was easy to browse with a beautiful range of fresh produce.  All of the produce was amazing and not over priced, the seafood in particular the Galician Oysters we delicious - you could taste the ocean!  We saw plenty of locals both shopping and dining.  Highly recommended.", "publishedDate": "2019-09-10", "language": "en", "rating": 5}, {"id": 707933800, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d8564136-r707933800-Mercado_del_Ninot-Barcelona_Catalonia.html", "text": "When one visits Barcelona and is looking to experience a market, La Bouqueria tops the list.  However if you are not there early, the crowds can be quite overwhelming.\n\nJust around the corner from our hotel, on our way to the Hospital Clinic Metro, we stumbled across Mercado del Ninot.  What a pleasant surprise.  It’s where residents go for quality groceries.  I think we were the only tourists in there.  When you look at the photos you will see for yourself just how clean, spacious, and abundant it is for visitors.  They had an egg booth, several butchers, seafood, fruits, vegetables, and of course eateries to have lunch.  Our teenage girls are quite picky but we found a butcher who offered meats which you can then cook in their kitchen in the back room.  It was like buying groceries but rather than bringing them home they were cooked on the spot.  Girls had fried breaded chicken cutlets, French fries, and salad.  Added two bottles of water for less than €18.  We regret finding this spot on our last day but we visit Barcelona often and will be sure to visit once again.\n\nNot sure if TA reviewers will see or experience this place as its so far down the list of “things to do”.  It’s definitely worth visiting for lunch - enjoy!", "publishedDate": "2019-09-08", "language": "en", "rating": 5}, {"id": 690982478, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d8564136-r690982478-Mercado_del_Ninot-Barcelona_Catalonia.html", "text": "I suppose You always look for authenticity - Mercado del Ninot is just that. The greatest experience on our trip, the best food in annamazing building that seems like an old disused trainstation. There is a hypermarket in the \"basement\" where trains used to run through and magnificent stand alone restaurants, buthers, bakers, fish & cheesemongers AND NO other tourists. A surreal and great experience.", "publishedDate": "2019-07-19", "language": "en", "rating": 5}, {"id": 689142818, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d8564136-r689142818-Mercado_del_Ninot-Barcelona_Catalonia.html", "text": "So glad we had this market so close to our house here in Barcelona! Mercadona is a kind of Lidl or our uk Tesco metro, you can easily find everything you need for your staying here in Barcelona like food or drinks, pastry and toiletries at a good price. There’s a properly market upstairs with fresh sea food or meat and there’s also a space outside the building for cheap clothes as well. Nice to have it in town! ", "publishedDate": "2019-07-13", "language": "en", "rating": 4}, {"id": 676389541, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d8564136-r676389541-Mercado_del_Ninot-Barcelona_Catalonia.html", "text": "I loved visiting this market - it's a world away from La Boqueria (thank goodness) and real people go there to do their household food shopping. It is laid out, as is common, in a purpose built hall and the aisles are wide and clean. All the food was beautifully displayed and looked fresh and appealing. I was just sorry I didn't need to shop there. \nThere are lots of bars for tapas or drinks, so all was very congenial.", "publishedDate": "2019-05-25", "language": "en", "rating": 5}, {"id": 668463224, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d8564136-r668463224-Mercado_del_Ninot-Barcelona_Catalonia.html", "text": "It is a public market where you can buy a wide variety of products such as cheeses, sausages, chorizos, hams and all the typical and authentic Catalan products. The market is impeccable, clean and tidy.  The hotel where I was staying was at 100 meters away, so in the afternoons when returning was my obligatory stop to buy some cheese, ham, bread and fruit. There is also a large supermarket at the basement, very convenient.  The stall we chose at the market, we met by a very kind and attentive lady, who recommended which cheeses were the best, so bought several to bring to my country Guatemala.  I recommended visit while in Barcelona.", "publishedDate": "2019-04-22", "language": "en", "rating": 3}, {"id": 637460545, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d8564136-r637460545-Mercado_del_Ninot-Barcelona_Catalonia.html", "text": "El Mercat del Ninot (Ninot's Market in English) is a place located in Eixample neighborhood, in the center of Barcelona. It is a market, so here you can buy meat, fish, vegetables and other types of food. Also it is possible to come here to lunch or dinner in the restaurant La Cuina del Ninot. Also, all market is well-remodeled, so it is very interesting to walk inside and see all shops. Nice.", "publishedDate": "2018-12-04", "language": "en", "rating": 3}, {"id": 628420026, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d8564136-r628420026-Mercado_del_Ninot-Barcelona_Catalonia.html", "text": "This is a real food market where locals are doing their daily shopping and there are no hoards of tourists. It is not chaotic, it's clean and easy to buy food. If you want a real food market experience, come her and bypass the tourists at Boqueria. ", "publishedDate": "2018-10-26", "language": "en", "rating": 4}, {"id": 607443606, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d8564136-r607443606-Mercado_del_Ninot-Barcelona_Catalonia.html", "text": "The upstairs is filled with local artisan stalls, the downstairs is a full grocery store - this was everyone gets what they want.  \n\nWe did a cooking experience for dinner, and we met our chef here, and he showed us around.  Beautiful place with amazing food (and photography - you be the judge.)\n\nNice way to spend an hour.  Jamon samples were great!", "publishedDate": "2018-08-17", "language": "en", "rating": 5}, {"id": 597611794, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d8564136-r597611794-Mercado_del_Ninot-Barcelona_Catalonia.html", "text": "We came here on an Airbnb experience tour. It was the very first thing we did on our 'gastrotrip' to Barcelona and Northern Spain and it was perfect as it introduced us to the foods of the city/ region and provided context for the rest of the trip. As it is said, \"to know a city, learn its markets.\" This is a newer market, very clean and a place where locals do daily shopping (not touristy). Spend an hour or two here tasting your way through local olives, jamon, seafood, vermouth etc. You'll have a better idea then of what to order in the restaurants! Boqueria is a must-do--but it's very crowded and fast-moving and not a place you'll be able to truly take your time.", "publishedDate": "2018-07-19", "language": "en", "rating": 5}, {"id": 589282954, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d8564136-r589282954-Mercado_del_Ninot-Barcelona_Catalonia.html", "text": "Locals seem to come here and it is not as hector c as la Boqueria.  And easier to walk around.. there are several good restaurants to cook the food found here and I believe that the prices are a bit lower than the more famous markets off the ramblas.  A good bunch of places including larger stores on the first level", "publishedDate": "2018-06-20", "language": "en", "rating": 4}, {"id": 565566792, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d8564136-r565566792-Mercado_del_Ninot-Barcelona_Catalonia.html", "text": "Cool neighbourhood market with large supermarket downstairs. Good tapas places, fresh produce and convenient location in Eixample.", "publishedDate": "2018-03-09", "language": "en", "rating": 5}, {"id": 562293374, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d8564136-r562293374-Mercado_del_Ninot-Barcelona_Catalonia.html", "text": "A wonderful market filled with extremely fresh produce. Each stall staffed by people who clearly love what they do and sell their wares with pride. We had breakfast every morning at the same stall. Tremendous.", "publishedDate": "2018-02-23", "language": "en", "rating": 5}, {"id": 558829858, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d8564136-r558829858-Mercado_del_Ninot-Barcelona_Catalonia.html", "text": "We recently did a tour of Mercado del Ninot with Food Lover Tours.  Our guide Zoltan was extremely informative and very respectful to the history of the Market. \nThis is truly a food lovers must visit location. The Market itself is fresh and clean. The produce is all locally sourced and purchased by locals. \nSeveral of the stalls have bars and restaurants attached and are more than happy to cook some of the selected fresh produce for you for breakfast and or lunch.\nWe tried some amazing Iberico Hams, Manchego Cheese, Olives, Black Pudding Anchovies, Salt Cod Tomatoes and Olives, Fried Octopus that was topped off with a visit to an award winning Patisserie. \nThis really was a fantastic find and a location we will definitely return to. ", "publishedDate": "2018-02-06", "language": "en", "rating": 5}, {"id": 549963257, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d8564136-r549963257-Mercado_del_Ninot-Barcelona_Catalonia.html", "text": "Great local market, fresh local produce in a clean, bright and welcoming atmosphere (was rebuilt in 2015 funded by the supermarket which is on the lower floor).  We came on a food tour as it’s a little away from the tourist traps and better for it. Best market we’d been too. Lots of stalls also have seats so it would be rude not to try. Fab time.", "publishedDate": "2017-12-29", "language": "en", "rating": 5}, {"id": 549520123, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d8564136-r549520123-Mercado_del_Ninot-Barcelona_Catalonia.html", "text": "Very crowded in the Christmas Eve rush but a very local market frequented by people who live here rather than hordes of tourists. Great variety of stalls for every food need - and respite can be found in the cafe/bar at the side too. ", "publishedDate": "2017-12-27", "language": "en", "rating": 5}, {"id": 513755478, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d8564136-r513755478-Mercado_del_Ninot-Barcelona_Catalonia.html", "text": "I love visiting local grocery stores and markets where ever I travel. I get to see, smell, and touch the local life, and I get to talk to locals about ordinary things, which you don't often experience if you only visited tourist attractions. The Mercado del Minot is not a tourist spot; it's a large food market for locals. It's new and clean, very pleasant to spend an hour or two, walking around for visual, oratory, and gastronomic pleasure. It's located in Eixample area, about 20 minutes walk west from Placa de Catalunya.\n\nUpstairs is a fresh produce, meat and seafood market, and some eateries. Downstairs is a grocery store. Like at home, local shoppers were just minding their own business, but merchants were very friendly to talk to. I really enjoyed my time here.", "publishedDate": "2017-08-16", "language": "en", "rating": 5}, {"id": 498362219, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d8564136-r498362219-Mercado_del_Ninot-Barcelona_Catalonia.html", "text": "Upstairs are tons of specialty purveyors. Fish. Iberico Ham. Spanish and Catalonian cheese. Produce.  Tons of spots to grab a bite. Downstairs is a full modern supermarket. There's also a very nice sit-down restaurant. Extremely high-quality food. Recommended to us by a local chef. ", "publishedDate": "2017-07-03", "language": "en", "rating": 5}, {"id": 496430984, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d8564136-r496430984-Mercado_del_Ninot-Barcelona_Catalonia.html", "text": "We came to this market with a food tour. The market is big and clean with some shops cooking at the spot. It is mush less touristy than Mercado de La Boqueria and we like it much.", "publishedDate": "2017-06-27", "language": "en", "rating": 5}, {"id": 495600843, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d8564136-r495600843-Mercado_del_Ninot-Barcelona_Catalonia.html", "text": "The market has amazing prices for quality produce, meats, eggs, fish, and dried goods.  The supermarket downstairs is a wonderful addition as the prices of goods are much cheaper and varied than most supermarkets.  The market is not nearly as overcrowded and overpriced as other large markets near the city center and it offers a variety of specialty foods at a reasonable price.", "publishedDate": "2017-06-24", "language": "en", "rating": 4}, {"id": 490185314, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d8564136-r490185314-Mercado_del_Ninot-Barcelona_Catalonia.html", "text": "This is a better market than the rest, clean & comfortable. It offers a variety of fresh seafood, meat, vegetables, fruits, olives, cheese, olive oil etc. Items are well displayed & stored in a nice environment. Choose any items & can be cooked on the spot for you. Reasonably priced.", "publishedDate": "2017-06-03", "language": "en", "rating": 4}, {"id": 488778844, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d8564136-r488778844-Mercado_del_Ninot-Barcelona_Catalonia.html", "text": "Set in the Eixample area this market is a gem! the produce is extensive, fresh and inviting and the staff incredibly friendly. Whether you are taking toddlers around for their first experience of a fresh fish stall or buying ingredients for a culinary experience of your own, this location has it all. it's large enough to stimulate the senses without the frenetic tourist crowds and grumpy stall holders of La Bouqueria.\nTreat yourself and enjoy the real market experience not the theme park hoards of it's larger cousin on Las Ramblas.", "publishedDate": "2017-05-29", "language": "en", "rating": 5}, {"id": 477354365, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d8564136-r477354365-Mercado_del_Ninot-Barcelona_Catalonia.html", "text": "If you are in the Eixample area of Barcelona, enjoy the freshness of market food, and are looking for something a bit different, I suggest paying a visit to the Mercat Municipal del Ninot market for a midday meal where a number of the vendors cook and serve their own foods on site. I understand that this is the first fresh market of its type in Barcelona (only open for 2 years now) where they also serve food prepared within the market. \n\nMy favorite is a large family run butcher shop named Morales along the southern perimeter of the market. As you enter the building from the main entrance, just turn left after you are inside the market and walk to the very end where you will run right into the shop. \n\nMelanie Morales, the daughter, a young and very friendly and enthusiastic woman, runs the restaurant part of the shop and she does all the cooking herself. She serves grilled chicken and beef, 5-6 kinds of homemade croquets (chicken, spinach, fish, etc), and serves it all together with great fresh salads. They also serve beer and other assorted beverages. \n\nIt's a really enjoyable experience for me eating in a fresh market like this, something I have grown used to living in Asia, where you know that you are being served only the finest and freshest foods. \n\nMelanie has six tables in her shop, which are often filled up by around 1PM and serves food starting from 11AM until 4PM (closed on Sunday's). \n\nShe offers a daily menu for 11.95 Euros and a special 3 course menu for 19.95 Euros served with croquets, foie gras and a 1 kilo T-bone steak, drinks and desert. \n\nYou can alternatively make your choice of having her cook anything for you that they offer fresh for sale within their large butcher shop. \n\nI particularly like the marinated chicken kababs that she serves with a beautiful garden salad topped with fresh strawberries and some homemade fried potato wedges on the side.", "publishedDate": "2017-04-20", "language": "en", "rating": 5}, {"id": 458738166, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d8564136-r458738166-Mercado_del_Ninot-Barcelona_Catalonia.html", "text": "This market is a lovely place to go, with delicious food stalls and tiny little places where you can sit and eat right there in the market!\n\nEveryone was really helpful and friendly, with some of the best food we ate all trip! With wine to complement and suggestions based on the other things we liked.\n\nIt's way less busy than La Boqueria, so I would suggest coming here for a market experience and saving on stress!", "publishedDate": "2017-02-11", "language": "en", "rating": 4}, {"id": 453798354, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d8564136-r453798354-Mercado_del_Ninot-Barcelona_Catalonia.html", "text": "Not as famous as other indoor markets and a bit out of the way, yet in a great neighborhood, this indoor market does not disappoint. You can spend hours sampling gorgeous ham, oysters ... going from one stall to another. Top notch.", "publishedDate": "2017-01-21", "language": "en", "rating": 5}, {"id": 447212878, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d8564136-r447212878-Mercado_del_Ninot-Barcelona_Catalonia.html", "text": "forget about the more popular and well known Boqueria market or even Santa Caterina, this place is marvellous.\nGreat quality food stalls and bars with tapas Very large and clean.A bit out of the way but well worth it. Where the locals shop, eat and drink.", "publishedDate": "2016-12-28", "language": "en", "rating": 5}, {"id": 444312526, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d8564136-r444312526-Mercado_del_Ninot-Barcelona_Catalonia.html", "text": "We found this market by accident one day and immediately fell in love with it. Fresh fish, vegetables, meat, cheese, baked goods and all manner of goodies. There are certain stalls that serve food. On our first visit we found a fish stall and enjoyed grilled sardines washed down with a nice Albarino. On our second visit we did the tour. We ate at three separate stalls. The first we had mussels again with an Albarino. The second stall we had delicious sea urchin and a nice Verdecchio. The third stall we had salt cod croquettes and a glass of vermut. A great place where the locals shop and eat. Very friendly and worth a stop.", "publishedDate": "2016-12-14", "language": "en", "rating": 5}, {"id": 438243329, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d8564136-r438243329-Mercado_del_Ninot-Barcelona_Catalonia.html", "text": "Wonderful market for fish, meats, salumi, cheese. Get there early and get fresh frilled sardines a glass of wine. The people watch the exchanges the locals buy their weekend dinner menus.", "publishedDate": "2016-11-18", "language": "en", "rating": 5}, {"id": 434597284, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d8564136-r434597284-Mercado_del_Ninot-Barcelona_Catalonia.html", "text": "I went there quickly earlier on today, checked everything seemed to be quite good quality and staff are clean. \nIts a bit expensive compare to the normal supermarkets. ", "publishedDate": "2016-11-04", "language": "en", "rating": 4}, {"id": 432286112, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d8564136-r432286112-Mercado_del_Ninot-Barcelona_Catalonia.html", "text": "We were staying at an apartment in the Gracia area, and while out for a long walk to look at the architecture in this neighborhood we came across this market by accident.  What a find! \n\nWell organized market, very clean, gorgeous displays and beautiful produce all round. We went to a few markets in Barcelona, and this one was the best for quality and freshness, for us.\n\nMore authentic than La Boqueria which we found crowded and noisy.", "publishedDate": "2016-10-27", "language": "en", "rating": 5}, {"id": 416734665, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d8564136-r416734665-Mercado_del_Ninot-Barcelona_Catalonia.html", "text": "I've just relocated from the UK to Barcelona and am living in this neighbourhood. The weekly shop experience has been transformed. Excellent meat, fish, vegetables and many other lovely culinary delights. \n\nWe arrived at about 1100 and it was quiet. By 1200 it was packed!  Watching the fishmongers and butchers craft their art is amazing. Very friendly and sympathetic to my poor Spanish. \n\nSee you during the week!  Why not eat fresh with this on your doorstep?", "publishedDate": "2016-09-10", "language": "en", "rating": 5}, {"id": 414907182, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d8564136-r414907182-Mercado_del_Ninot-Barcelona_Catalonia.html", "text": "Staying in Comte Borrell we were only 2 blocks from the Ninot Market. A great selection of vegetables, fish, meat, cheese and more. The quality is excellent and variety is great. In the basement below the market the is a very large Mercadona.", "publishedDate": "2016-09-05", "language": "en", "rating": 5}, {"id": 412283114, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d8564136-r412283114-Mercado_del_Ninot-Barcelona_Catalonia.html", "text": "In Barcelona there are plenty of covered market and the most famous are la Boqueria and Santa Caterina but, among those less famous, there are some that worth a ride. One of those is El Ninot (the little kid). Is recently renewed and you'll find several good stand with good looking and great tasting products. \nFor example there is a stand that sell french pate that is simply wonderful! I adore it!", "publishedDate": "2016-08-29", "language": "en", "rating": 5}, {"id": 411063657, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d8564136-r411063657-Mercado_del_Ninot-Barcelona_Catalonia.html", "text": "We visited during our second week and wished that we had found this little gem much earlier in our stay. August may not be the best month for visiting if you are looking for everything to be open as many stalls close up for their summer holidays. Those remaining open offer top notch food including the freshest of meats, seafoods and produce. If you are not staying in an apartment or self catering then you can eat at any of the stalls which cater to the locals and visitors alike. We ate at the res, located in a corner attached to a meat seller and had one of the best steak and mushroom dinners we ever had the pleasure of eating. There is also a full size supermarket located on the lower floor as seems to be the trend now as the older mercats undergo modernization. A great place to wander and shop. They also have to go food from several stalls and one could always purchase fruits and things for a picnic in one of the many green spaces in Barcelona.", "publishedDate": "2016-08-26", "language": "en", "rating": 5}, {"id": 406420279, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d8564136-r406420279-Mercado_del_Ninot-Barcelona_Catalonia.html", "text": "This market was close to where we are staying but a lot of the stalls are closed in August for summer vacation....only to re-open between the 26th and 29th.\nThere is a full supermarket below the market where you will find most things. Everything closed on Assumption Day - 15 August.\n", "publishedDate": "2016-08-16", "language": "en", "rating": 3}, {"id": 394667973, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d8564136-r394667973-Mercado_del_Ninot-Barcelona_Catalonia.html", "text": "Ninot is an excellent market.\nWe stayed in the neighborhood, and we came in the market as tourists.\nBut Ninot is not a tourist market. It is a market for the locals.\nThe are outside along Carrer de Mallorca and Carrer de Villarroel a lot of small nonfood shops.\nInside there are many shops with. All look fresh and delicious.\nDownstairs there is a big supermarket.\nAnd don't forget: In Ninot you can find an excellent restaurant: El Ninot Cuina. Entrance from Carrer de Casanova.", "publishedDate": "2016-07-20", "language": "en", "rating": 5}, {"id": 388244608, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d8564136-r388244608-Mercado_del_Ninot-Barcelona_Catalonia.html", "text": "Mercado del Ninot is an excellent market.\nLocated in a nice neighborhood, close to our hotel. Best Western Hotel Dante.\nYou can get everything in Mercado del Ninot.\nAnd all what we tried were good and fresh.\nIn the market-hall, there is an excellent restaurant: \"El Ninot Cuina\"", "publishedDate": "2016-07-01", "language": "en", "rating": 5}, {"id": 368489655, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d8564136-r368489655-Mercado_del_Ninot-Barcelona_Catalonia.html", "text": "We went to the famous boqueria and it was great. But we were staying in a flat only 6 blocks from this market. On the outside there are people selling all kinds of things. Inside on the bottom is a proper supermarket like you may find in the US with all the normal stuff. We needed some laundry detergent. Upstairs, though, is the real market. A scaled own version of the famous market down by the Ramblas. But they still have everything you need and most of it is cheaper. There were no tourists there other than us and no one to bump into. Work your way around to find fresh fish, olives, bread, and Jamon. There are several eateries as well, but we didn't get a chance to try them. We were picking stuff up to take back to our flat and have a little picnic there. It's worth the trip and with much less of the hustle. You're welcome", "publishedDate": "2016-04-28", "language": "en", "rating": 5}, {"id": 368322434, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d8564136-r368322434-Mercado_del_Ninot-Barcelona_Catalonia.html", "text": "We enjoyed this market over the Mercat de Sant Josep de la Boqueria for many reasons:\n1. Well designed, orderly and clean\n2. Vendors were friendly and welcomed your inquiries\n3. Pleasant stroll - not touristy\n4. Well appointed booths with much to offer if you relish culinary delights", "publishedDate": "2016-04-27", "language": "en", "rating": 5}, {"id": 336999222, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d8564136-r336999222-Mercado_del_Ninot-Barcelona_Catalonia.html", "text": "Traveling from FL we stopped in this Mercado and loved it!  Lots of local flavor. Will make sure that we stop by next time in Barcelona!", "publishedDate": "2016-01-03", "language": "en", "rating": 5}, {"id": 330381472, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d8564136-r330381472-Mercado_del_Ninot-Barcelona_Catalonia.html", "text": "We had an apartment across the street from this market and enjoyed browsing the stalls and picking up some great bits of food as well as the staple items from the grocery store in the basement. Great vendors. We especially loved the pickled garlic from the olive stall in the back right corner. Great olives too!", "publishedDate": "2015-12-02", "language": "en", "rating": 4}, {"id": 323806207, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d8564136-r323806207-Mercado_del_Ninot-Barcelona_Catalonia.html", "text": "Belly up to the wee bar at Bar Ket, located inside the Mercado del Ninot. There, you'll be greeted by three wonderful, smiling women and their selection of freshly-baked goodies and hot-off-the-grill tortillas (egg concoctions), along with some of the best churros and hot chocolate in the city. This is a locals place: you're not going to find other tourists alongside you. They treated us with kindness and warmth, and it was one of our favorite experiences of our trip. Such a treat!", "publishedDate": "2015-11-01", "language": "en", "rating": 5}, {"id": 317097445, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d8564136-r317097445-Mercado_del_Ninot-Barcelona_Catalonia.html", "text": "Tired of the tourist crush, the endless waiting in lines for so-so, over hyped prepared food at the ever touristy Mercat de Sant Josep de la Boqueria, we wandered up to our favorite Barcelona area (Eixample) and stumbled across a newly refurbished foodies paradise in Mercado del Ninot (across from Disfutar of all things!).\n\nMercado del Ninot is relatively close to Plaça Catalunya and easily accessible via the Medical Clinic subway stop.  It is newly opened (mid-2015) and is larger, cleaner, more diverse, and is loved by the local resident Catalans who purchase their daily produce there (who demand quality and value).  You can wander the long, wide isles surrounded by high quality produce and proteins (meat, fish) and It is no surprise then that it possesses all of the freshest products in the city, from fish and vegetables to meat, pork, and fruits.\n\nIn addition, it also offers a much wider and higher quality of prepared food (including tapas, wine, beer, etc.).  There are no lines (as of when we visited around noon) so pull up a chair and explore the best foodie market today in Barcelona.\n\nSo if you are a foodie and truely appreciate high quality food (raw, prepared), then Mercado del Ninot is worth a short detour for breakfast or lunch . . . or even while waiting for your table at a local restaurant . . .", "publishedDate": "2015-10-08", "language": "en", "rating": 5}, {"id": 311831284, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d8564136-r311831284-Mercado_del_Ninot-Barcelona_Catalonia.html", "text": "Renewed. Crean. Good for a breakfast. You can find everything. Parking downstairs. Normal price. I like their fresh food.", "publishedDate": "2015-09-19", "language": "en", "rating": 5}]}}]