[{"locationId": 14765486, "name": "Quatre Columnes", "placeType": "ATTRACTION", "reviewListPage": {"reviews": [{"id": 735109934, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d14765486-r735109934-Quatre_Columnes-Barcelona_Catalonia.html", "text": "The 4 Columns are said to represent the stripes on the Catalan flag when they were built in the early 1900's and were then demolished under the fascist regime in the 30's , They were rebuilt in 2010 so are a very new addition to the amazing sights on Montjuic , there is always a good photo opp with the columns as the views on either side are really good", "publishedDate": "2019-12-28", "language": "en", "rating": 5}, {"id": 678453015, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d14765486-r678453015-Quatre_Columnes-Barcelona_Catalonia.html", "text": "Columns provide a good view of the magic fountain during the show and also the museum. Those who like selfies in either of the above direction, this is. Good spot... ", "publishedDate": "2019-06-02", "language": "en", "rating": 4}, {"id": 676543043, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d14765486-r676543043-Quatre_Columnes-Barcelona_Catalonia.html", "text": "Quatre Columnes is a set of four columns above the Magic Fountain. They were placed there in 1919, as a symbol of the four stripes of the Catalan flag. However, in 1928 the then government of dictator Primo de Rivera destroyed all symbols of Catalan independence, so that they would not attract any attention during the following year's Universal Exposition. The columns were remade and repositioned in 1999. They do make  a great statement!", "publishedDate": "2019-05-26", "language": "en", "rating": 5}, {"id": 672793611, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d14765486-r672793611-Quatre_Columnes-Barcelona_Catalonia.html", "text": "These four columns are located above the Magic Fountain. \n\nThey are not the original ones from 1919, which were demolished in 1928 during Primo de Rivera's dictatorship. \n\nThe 1929 Universal Exposition was coming and all public Catalanist symbols were removed before it. \n\nNew higher columns were made in 1999.", "publishedDate": "2019-05-09", "language": "en", "rating": 4}, {"id": 657300022, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d14765486-r657300022-Quatre_Columnes-Barcelona_Catalonia.html", "text": "If you are walking up to the Magic Fountain or standing in front of the National Art Gallery, then you can't miss the impressive columns.\n\nThere is no information that I could find about them, however, your guide or guide book should have some", "publishedDate": "2019-03-08", "language": "en", "rating": 4}, {"id": 636045526, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d14765486-r636045526-Quatre_Columnes-Barcelona_Catalonia.html", "text": "The four columns are also known by the name of their architect; the columns of Puig i Cadafalch. They were placed for the first time in 1919 during which time they were located right on top of where you would find the Magic fountain today, close to the neighbourhood of Poble Sec. They represent the four stripes of the Catalan flag.", "publishedDate": "2018-11-27", "language": "en", "rating": 4}]}}]