[{"locationId": 13546899, "name": "Placa Cinc D'Oros", "placeType": "ATTRACTION", "reviewListPage": {"reviews": [{"id": 723726549, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d13546899-r723726549-Placa_Cinc_D_Oros-Barcelona_Catalonia.html", "text": "The Praça Cinc d’Oros is on Passeig de Gracia the main shopping street in Barcelona Spain. The shopping street is beautiful and has all the name brand stores. Then you come to this awful statue/monument in the middle of the street full of graffiti - apparently the monument has something to do with the Spanish civil war - but all that seems lost today. ", "publishedDate": "2019-11-04", "language": "en", "rating": 2}, {"id": 672143180, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d13546899-r672143180-Placa_Cinc_D_Oros-Barcelona_Catalonia.html", "text": "This busy square is located in the Eixample district at the intersection of Avenida Diagonal and Paseo de Gracia.\n\nIn the middle of the square is a 20-meter high obelisk made of gray granite.", "publishedDate": "2019-05-07", "language": "en", "rating": 3}, {"id": 635112637, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d13546899-r635112637-Placa_Cinc_D_Oros-Barcelona_Catalonia.html", "text": "This obelisk is at the intersection of two busy streets and you would be taking your life in your own hands if you got up to it.", "publishedDate": "2018-11-22", "language": "en", "rating": 3}, {"id": 623468870, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d13546899-r623468870-Placa_Cinc_D_Oros-Barcelona_Catalonia.html", "text": "Placa Cinc D'Oros is a plaza that located in   a major traffic intersection, we had been exploring the area around Passeig De Gracia and came across this plaza.\nThe obelisk is the most distinctive aspect of the plaza but there's also some nice buildings here and it's in an area with some great pubs, bars and restaurants around.\nI got some great views from the metro stop Diagonal, I think to be honest as it's such a busy traffic junction it would be hard to take some great shots.\nWorth checking out for the obelisk. ", "publishedDate": "2018-10-09", "language": "en", "rating": 5}, {"id": 609123535, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d13546899-r609123535-Placa_Cinc_D_Oros-Barcelona_Catalonia.html", "text": "This is a busy square, with the towering obelisk at the junction centre. Surrounding it are some historical buildings along Passeig de Gracia and Avinguda Diagonal road. I could only take photos of the obelisk from afar due to the non stop traffic.", "publishedDate": "2018-08-22", "language": "en", "rating": 4}, {"id": 570947775, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d13546899-r570947775-Placa_Cinc_D_Oros-Barcelona_Catalonia.html", "text": "This is a big junction on the main Diagonal road through town, intersecting with Passeig de Gracia (which you can walk down to the Old Town and the Seafront in about 15 minutes). There is the 'Diagonal' Metro station here and the towering Obelisk helps as a landmark to find your way back...!!", "publishedDate": "2018-04-04", "language": "en", "rating": 3}]}}]