[{"locationId": 6495421, "name": "Telefèric de Montjuïc", "placeType": "ATTRACTION", "reviewListPage": {"reviews": [{"id": 750225332, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d6495421-r750225332-Teleferic_de_Montjuic-Barcelona_Catalonia.html", "text": "Great experience with great views of the city, port, airport etc. We didn’t go into the castle due to time constraints but admission is free every first Sunday of the month.", "publishedDate": "2020-03-10", "language": "en", "rating": 5}, {"id": 750103834, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d6495421-r750103834-Teleferic_de_Montjuic-Barcelona_Catalonia.html", "text": "Price was €13.50 for this but got a €2 euro discount this and it’s worth it the views r stunning and very pretty the cable car takes u up to the top where the castle is admin to the castle is €5 I didn’t go in but it looked nice \n", "publishedDate": "2020-03-09", "language": "en", "rating": 4}, {"id": 741645757, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d6495421-r741645757-Teleferic_de_Montjuic-Barcelona_Catalonia.html", "text": "It is well worth the trip up to the top of the teleferic followed by the top of the castle! 360 degree views of Barcelona and the Mediterranean sea. Teachers,  bring your ID. You can enter the castle for free!", "publishedDate": "2020-01-27", "language": "en", "rating": 4}, {"id": 741621382, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d6495421-r741621382-Teleferic_de_Montjuic-Barcelona_Catalonia.html", "text": "This was such a neat addition to our Barcelona visit.  The views were outstanding and allowed us to enjoy it in the privacy of our own gondola.  Would highly recommend, price is totally reasonable!", "publishedDate": "2020-01-27", "language": "en", "rating": 5}, {"id": 739767080, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d6495421-r739767080-Teleferic_de_Montjuic-Barcelona_Catalonia.html", "text": "Great veiws from this lovely cable car ride and not to be confused with the other from the port area where you stand up. This ride makes it's way up to the top of the hill where the castle is with panoramic views of the city and mountains beyond. Yes it is a short ride but you can also get off and back on half way up. In my opinion well worth a visit.", "publishedDate": "2020-01-17", "language": "en", "rating": 5}, {"id": 739201096, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d6495421-r739201096-Teleferic_de_Montjuic-Barcelona_Catalonia.html", "text": "THIS is the way to see the harbour and Montjuic. It is also another reason to get a pass on the Bus Turistic. The bus stops near both ends of the Teleferic. We thought the tower in the middle would be an entry point but it isn't so save yourself the trip of exploration and go to the far end of the cable.", "publishedDate": "2020-01-14", "language": "en", "rating": 5}, {"id": 736604320, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d6495421-r736604320-Teleferic_de_Montjuic-Barcelona_Catalonia.html", "text": "Beautiful views but probably overpriced ride that’s shared with others. It is easily accessible from the tram station. \n", "publishedDate": "2020-01-03", "language": "en", "rating": 4}, {"id": 735769215, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d6495421-r735769215-Teleferic_de_Montjuic-Barcelona_Catalonia.html", "text": "An hour of wating for some minutes of view, well the view is beatiful but you don't have to go there and pay your money and wait and hour to see it.\nI do not recommand.\n\n", "publishedDate": "2019-12-30", "language": "en", "rating": 3}, {"id": 735574301, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d6495421-r735574301-Teleferic_de_Montjuic-Barcelona_Catalonia.html", "text": "Good view of city and best to take return ticket so while coming down view of city is good. At top of cable car ride just be careful as some times no one is there so you need to get down and go back to cable car yourself", "publishedDate": "2019-12-30", "language": "en", "rating": 4}, {"id": 731975173, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d6495421-r731975173-Teleferic_de_Montjuic-Barcelona_Catalonia.html", "text": "It offers a nice ride over the city, from the port to Montjuik and back. The view of the city and the sea is great. I fing the 11 euro ticket very high though...", "publishedDate": "2019-12-10", "language": "en", "rating": 4}, {"id": 730874676, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d6495421-r730874676-Teleferic_de_Montjuic-Barcelona_Catalonia.html", "text": "The cable car starts about half way up the hill on the way to the Castle. It drops you off at the top of the hill adjacent to the castle. It makes for a fun time with the views and the photo ops. It also makes it a little easier on the feet. They have a one way or a round trip option. It is not cheap by any stretch but it is fun.", "publishedDate": "2019-12-05", "language": "en", "rating": 4}, {"id": 729699059, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d6495421-r729699059-Teleferic_de_Montjuic-Barcelona_Catalonia.html", "text": "When a beautiful clear day presented itself, my husband and I decided to spend the day at Parc de Montjuic. To make the most of our time, we opted to take the cable car as the quickest and easiest way to get to the top of Montjuic. \n\nI bought round trip tickets on my phone the morning we decided to go and got an immediate email confirming my purchase. Round trip tickets cost €11.43 per person saving us 10% by buying online. To get to the Montjuic cable car, we took metro line 3 to Paral-lel station and without leaving the station we found the corridor to the Montjuic funicular and took the funicular one stop to Parc de Montjuic. With the T10 card, the funicular transfer was free. I presented my confirmation email at the ticket office and got our tickets to use for our cable car trips. When we arrived shortly after opening, there was no queue so we hopped on the first available cable car. It was a large car and we were lucky to have it all to ourself. The ride to the top covered 750 meters and was quite quick. We loved the beautiful views over Barcelona and the Mediterranean Sea. Our ride down after exploring the castle at the top was just as lovely. Highly recommend this cable car. ", "publishedDate": "2019-11-29", "language": "en", "rating": 5}, {"id": 726017553, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d6495421-r726017553-Teleferic_de_Montjuic-Barcelona_Catalonia.html", "text": "The view is wonderful at the top. But the route is short, we gave a lot of money for up-down for a family, it is more logical to use it for just up then walk down. There is a castle if you want you can visit it with an extra 5 euro.", "publishedDate": "2019-11-12", "language": "en", "rating": 4}, {"id": 723081011, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d6495421-r723081011-Teleferic_de_Montjuic-Barcelona_Catalonia.html", "text": "Got the bus here which took about 40 mins...queued about 10mins for our tickets (which wasn’t a problem) got in the cable car with 4 other adults... took about 8 mins to get to the half way mark where you can get off to the castle... coming down in the cable car took another 8 mins... then it was all over...  VERY OVERPRICED.  GREAT VIEWS BUT JUST OVER TOO SOON AND COST TOO MUCH.  Really disappointed  ☹️", "publishedDate": "2019-11-01", "language": "en", "rating": 2}, {"id": 722888310, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d6495421-r722888310-Teleferic_de_Montjuic-Barcelona_Catalonia.html", "text": "Great views! We didn’t get there until later so it was almost dark but still was nice. It was a little pricey for 2 adults it was almost $25 ", "publishedDate": "2019-10-31", "language": "en", "rating": 5}, {"id": 722222303, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d6495421-r722222303-Teleferic_de_Montjuic-Barcelona_Catalonia.html", "text": "We booked a return trip, as we didn't wan't to walk back down. There was a queue to get the tickets, but it did move pretty quickly. The cars arrive regularly, so there isn't much waiting. The cars are comfortable for 4 people, but 6 might be a bit of a squeeze. The views of the city from the cars are amazing, especially as we had a nice, clear day. The views from the castle are also superb. Once you are back down, then it is only a 10 minute walk to the Olympic stadium.", "publishedDate": "2019-10-29", "language": "en", "rating": 4}, {"id": 721195512, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d6495421-r721195512-Teleferic_de_Montjuic-Barcelona_Catalonia.html", "text": "We qued a short time to get on, paid €56 for 5 of us 2 ch n 3 adults.  The ride up is nice and the view amazing,  but when you get to the top  there are trees everywhere blocking the views unless you then pay to go into the castle.  Ridiculous!!!! \nI would recommend you get the bus up or walk as its really not worth the money at all, AVOID!!!", "publishedDate": "2019-10-25", "language": "en", "rating": 2}, {"id": 720307452, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d6495421-r720307452-Teleferic_de_Montjuic-Barcelona_Catalonia.html", "text": "Beautiful view of the city of Barcelona from a cable car!! It was €12.50 per person for a round trip ticket. This was a filler activity that I didn't find until the day of, but I'm so glad I did. \n\nI didn't end up buying tickets online, but I'm glad I didn't. When we got there, they had closed the online ticket line and combined it with the regular line, so there would have been no point in getting online tickets.\n\nMy only complaint and the reason for 4 stars is that it was a bit confusing to get her by subway. When getting off of the subway stop, DO NOT exit the station as the entrance to the tram to bring you to the cable car is in the station. We had already exited the station after purchasing a one-way subway ticket, so we would have had to pay again to get back inside. Luckily, there was a service person who let us back in after we told them what happened.", "publishedDate": "2019-10-21", "language": "en", "rating": 4}, {"id": 720246296, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d6495421-r720246296-Teleferic_de_Montjuic-Barcelona_Catalonia.html", "text": "The  Teleferic de Montjuic is a quick, easy and fun way to get down Montjuic.  Take the Teleferic all the way down to the funicular station and then transfer to the funicular to go the rest of the way down the hill to Paral-lel Metro station.  We'd heard there can be lines but we walked right on at 5:00 PM on a Sunday. \nBUT remember that there are two cable cars in town.  This is the newer, modern looking cable car with a stop right by the Castle.  The other one is the old fashioned looking cable car and it goes to the beach.  Make sure you are on the one you want.", "publishedDate": "2019-10-21", "language": "en", "rating": 4}, {"id": 720134297, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d6495421-r720134297-Teleferic_de_Montjuic-Barcelona_Catalonia.html", "text": "Great view from the cable car and took us down to the beach from our Hotel at Montjuic. Cool experience but overpriced.", "publishedDate": "2019-10-21", "language": "en", "rating": 3}, {"id": 719334932, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d6495421-r719334932-Teleferic_de_Montjuic-Barcelona_Catalonia.html", "text": "We were advised to take a trip on this cable car and was not disappointed with the views. Breath taking on the way up but also from the top. Well worth a visit any time you visit the country. We will be back for sure ", "publishedDate": "2019-10-18", "language": "en", "rating": 5}, {"id": 718672566, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d6495421-r718672566-Teleferic_de_Montjuic-Barcelona_Catalonia.html", "text": "The ride itself isn't very long but the views are stunning especially as we had a beautiful clear day to enjoy them. The only slight negative is the cost is a little expensive in comparison to other cable cars we have been on which have had a longer ride however it's still an enjoyable way to get up to the castle. \nGoing by a previous review, we decided to walk to the cable car and not take the funicular....be warned there is quite a substantial hill to go up to get there and whilst not so bad for us who are used to living in a hilly area, those less mobile might struggle.", "publishedDate": "2019-10-15", "language": "en", "rating": 4}, {"id": 718325068, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d6495421-r718325068-Teleferic_de_Montjuic-Barcelona_Catalonia.html", "text": "Ugh,,waited an hour in line, spent 35 euro's for 2 people roundtrip for a 5 minute ride only half way up mountain to the fort. Took taxi home and ate the return fare, very painful experience. Take a cab and enjoy your day instead.", "publishedDate": "2019-10-14", "language": "en", "rating": 1}, {"id": 716134198, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d6495421-r716134198-Teleferic_de_Montjuic-Barcelona_Catalonia.html", "text": "Great, an easy way to get on top of the hill and to get great views over the town and the harbour. We took the teleferic to the top of the hill and walked back to the valley station.", "publishedDate": "2019-10-07", "language": "en", "rating": 4}, {"id": 715545998, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d6495421-r715545998-Teleferic_de_Montjuic-Barcelona_Catalonia.html", "text": "After 2 taxi rides, €20 &  many incompetent people later we finally found the cable cars. We would have liked a car to ourselves so that we could have enjoyed the view better, especially as we'd walked miles to find the place, but that wasn't going to happen. Literally a couple of minutes to the top. Glad I pre-booked our tickets. Very nice views", "publishedDate": "2019-10-05", "language": "en", "rating": 4}, {"id": 715069042, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d6495421-r715069042-Teleferic_de_Montjuic-Barcelona_Catalonia.html", "text": "It's expensive for a short 5 minute ride. You do get a nice view but you can just similar views by walking up the hill yourself. It would have still been a fun experience however it was so crowded that we had to queue for 45 mins to get on (even though we'd already booked our tickets online, you still have to queue behind everyone slowly buying tickets!) We could have walked up and back down again in that time! \n\nI will say however that the journey itself is nice and smooth and also isn't very high off the ground while still offering good views. This made it ideal for my girlfriend's first ever cable car trip ", "publishedDate": "2019-10-03", "language": "en", "rating": 3}, {"id": 715031422, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d6495421-r715031422-Teleferic_de_Montjuic-Barcelona_Catalonia.html", "text": "It is really very expensive compared to the activities expected; even when you reach the castle you will pay 5 Euros for each visitor to enter the castle!\nI advice the visitors to go by bus to the castle station and they can enjoy the views and go down the mountain by walking ; i am sure it will be more enjoying to them with many views to enjoy and take photos 👍", "publishedDate": "2019-10-03", "language": "en", "rating": 2}, {"id": 715004230, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d6495421-r715004230-Teleferic_de_Montjuic-Barcelona_Catalonia.html", "text": "For the price which is extortionate this is one of the most expensive and shortest cable car ever. Give this a miss it isnt worth the money. If you want a ride go on the harbour cable car. Staff off hand.", "publishedDate": "2019-10-03", "language": "en", "rating": 2}, {"id": 714586246, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d6495421-r714586246-Teleferic_de_Montjuic-Barcelona_Catalonia.html", "text": "We visited in September and we found this to be the most disappointing part of our 4 days in Barcelona. Large slow moving queues meant we waited at one side for 45 minutes at the bottom and then once we got the lift up, another 30 minutes at the top. We were then crowded into the cable car meaning we were forced to face the sea when we would have liked to have faced the city, meaning the trip was pointless for us. We would definitely not do this again and we preferred other views of Barcelona from rooftop bars and at the Temple of the Sacred Heart of Jesus. ", "publishedDate": "2019-10-01", "language": "en", "rating": 2}, {"id": 714542604, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d6495421-r714542604-Teleferic_de_Montjuic-Barcelona_Catalonia.html", "text": "We took the metro to the funicular to the cable car station. Rather than buy a round trip ticket, we rode up and walked down. The views are great, but there is not really much at the top of the hill, other than the castle to see. With the La Merce festival going on, traffic at the castle was high so we just walked by and did not enter. \n\nIf you have time, I would suggest a ride on the cable cars to get the views and enjoy some time off of your feet!", "publishedDate": "2019-10-01", "language": "en", "rating": 4}, {"id": 712887835, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d6495421-r712887835-Teleferic_de_Montjuic-Barcelona_Catalonia.html", "text": "Best Barcelona view! There is a overpriced pub there where you can buy a cold beer for the warm days. ", "publishedDate": "2019-09-25", "language": "en", "rating": 5}, {"id": 710788404, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d6495421-r710788404-Teleferic_de_Montjuic-Barcelona_Catalonia.html", "text": "Ok, so this is a must do! \nThe views from the cable cars are amazing, you literally have the entire view over the city! Try and go on a nice clear day as you can see for miles. \nWe paid for the full round ticket which means you can get off at all three of the stops. There's nice views from each stop, one has a little cafe too to have a drink. There is a castle at one of the stops. Lots to see. \nWe were lucky enough to not have much of a queue when waiting to get on. If you love a view, this is for you.", "publishedDate": "2019-09-18", "language": "en", "rating": 5}, {"id": 709393650, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d6495421-r709393650-Teleferic_de_Montjuic-Barcelona_Catalonia.html", "text": "On a good day it’s worth going up Montjuic just for the views over Barcelona.  We didn’t bother going into the castle, instead, we just had a stroll around, enjoyed the views and took some nice pictures.  If you use the metro, funicular and cable car you can go up and down within an hour or two.  I purchased our tickets online and used my phone to exchange the voucher for thetickets to get on the cable car.  If you want to use the funicular then get off at Paral-lel Metro Station (L3) and follow the signs for Montjuic Funicular.  You don’t need to purchase a second ticket for the funicular, you can use the metro ticket you’ve already purchased.  Tickets for the return journey on the cable car cost about £9 each.  Get there before 1pm avoid the queues.", "publishedDate": "2019-09-13", "language": "en", "rating": 4}, {"id": 707740981, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d6495421-r707740981-Teleferic_de_Montjuic-Barcelona_Catalonia.html", "text": "The park is great to walk around.  Recommend just taking the cable car to the top then walking down through the park.", "publishedDate": "2019-09-08", "language": "en", "rating": 5}, {"id": 706098598, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d6495421-r706098598-Teleferic_de_Montjuic-Barcelona_Catalonia.html", "text": "Lovely views of Barcelona. The castle at the top is lovely. We didnt visit it, just walked the outside and enjoyed the views. Travels faster than the other cable car but you are not packed in as tight and we ended up having our own cable car on the way back down. ", "publishedDate": "2019-09-03", "language": "en", "rating": 5}, {"id": 705832893, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d6495421-r705832893-Teleferic_de_Montjuic-Barcelona_Catalonia.html", "text": "Some different experience in Barselona. Stunning view of the whole city and the sea! Children enjoyed the travel! Cabins of funicular were very comfortable even we have 2 strollers for our kinds!", "publishedDate": "2019-09-02", "language": "en", "rating": 5}, {"id": 705766932, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d6495421-r705766932-Teleferic_de_Montjuic-Barcelona_Catalonia.html", "text": "Went on these cable ars and what an amazing experience we had! \nThe views were fantastic! Was worth the price we paid for on a return journey!\nWill definitely go there again!", "publishedDate": "2019-09-02", "language": "en", "rating": 5}, {"id": 704749013, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d6495421-r704749013-Teleferic_de_Montjuic-Barcelona_Catalonia.html", "text": "One of the must do things if you visit Barcelona. View of the city is breathtaking from the top. Cable car ride was very good.", "publishedDate": "2019-08-30", "language": "en", "rating": 5}, {"id": 701460730, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d6495421-r701460730-Teleferic_de_Montjuic-Barcelona_Catalonia.html", "text": "Best views of Barcelona and the best way to travel up to Castell de Montjuïc. It was busy but queues move quickly. Our only criticism is that it was only 2 euros discount with the Barcelona card so it was still nearly 40 euros for a family of four for what is a very scenic trip but is actually quiet short. Would still highly recommend though but possibly good idea to combine it with some cheaper or free things in same day.", "publishedDate": "2019-08-21", "language": "en", "rating": 4}, {"id": 701169220, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d6495421-r701169220-Teleferic_de_Montjuic-Barcelona_Catalonia.html", "text": "Stunning views of Barcelona from the Montjuic.  You can get off at 2 stops to see the views.  So glad we booked this, definatly worth a visit.  Great access by bus but i think there is metro available also.", "publishedDate": "2019-08-20", "language": "en", "rating": 5}, {"id": 699066594, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d6495421-r699066594-Teleferic_de_Montjuic-Barcelona_Catalonia.html", "text": "Really enjoyed this experience. Overlooks are stunning. Well organized and lines were kept moving. Great way to get to the Castle. Well worth $12 Euro 1 way.", "publishedDate": "2019-08-14", "language": "en", "rating": 5}, {"id": 698620686, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d6495421-r698620686-Teleferic_de_Montjuic-Barcelona_Catalonia.html", "text": "Costing 11 euros on way, was worth every penny to see stunning views on other side. You could get a return but then you would miss a fab walk back down or take the 259 steps to street level, not as bad as you'd think. There is a bar restaurant at other end, also hotel Miramar,  beautiful. ", "publishedDate": "2019-08-13", "language": "en", "rating": 4}, {"id": 698056622, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d6495421-r698056622-Teleferic_de_Montjuic-Barcelona_Catalonia.html", "text": "Decided to go up to the castle this way which was very interesting seeing that usually cable cars go up mountains with snow on them so this was very different. Good service and quite cheap. ", "publishedDate": "2019-08-12", "language": "en", "rating": 4}, {"id": 697469900, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d6495421-r697469900-Teleferic_de_Montjuic-Barcelona_Catalonia.html", "text": "Good trip.  Great views of Barcelona. Long queue when we arrived, but this was moving all the time so we did not wait too long - efficiently managed.", "publishedDate": "2019-08-10", "language": "en", "rating": 4}, {"id": 697276519, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d6495421-r697276519-Teleferic_de_Montjuic-Barcelona_Catalonia.html", "text": "We enjoyed the cable car ride from Montjuic to the castle and back. Superb views of the city and port. Well worth the €10.50 we paid.", "publishedDate": "2019-08-09", "language": "en", "rating": 4}, {"id": 697194220, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d6495421-r697194220-Teleferic_de_Montjuic-Barcelona_Catalonia.html", "text": "The views of the city are fantastic! The price is worth it just for this.\nI booked online so got a discount. I don’t think it is particularly clear though, where it goes or when you should get off. I booked a return ticket but you can book one way. There is a stop half way up, but there is no information to say who should get off where. If you’ve never been before it could be a bit confusing. \nI got off at the castle at the top and had a look around before getting the cable car back down. \nYou can get a discount by booking online or if you have bought a ticket for the Barcelona Bus Turistic.", "publishedDate": "2019-08-09", "language": "en", "rating": 4}, {"id": 696943558, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d6495421-r696943558-Teleferic_de_Montjuic-Barcelona_Catalonia.html", "text": "We took these up and down from the castle and they were great.  They were large and clean.  We lucked out and showed up about 1/2 hour after a big rain storm so there were no lines.  We got right on both ways.  Views were amazing!  We were taking one of those hop on hop off buses and they had a stop right across the street from these so all worked out well.", "publishedDate": "2019-08-08", "language": "en", "rating": 5}, {"id": 694933746, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d6495421-r694933746-Teleferic_de_Montjuic-Barcelona_Catalonia.html", "text": "Great views to be seen whilst in the cable car and at the top, we didn’t go into the castle but walked around the outside.", "publishedDate": "2019-08-02", "language": "en", "rating": 4}, {"id": 694854835, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d6495421-r694854835-Teleferic_de_Montjuic-Barcelona_Catalonia.html", "text": "For the experience I think the price is too expensive. Better pick another tour in Barcelona. The view is good but nothing special, the website or the staff doesn't explain properly, and there's no clear information. But the price is high. ", "publishedDate": "2019-08-02", "language": "en", "rating": 2}, {"id": 694627333, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d6495421-r694627333-Teleferic_de_Montjuic-Barcelona_Catalonia.html", "text": "This was one of the best things we did in Barcelona! Stunning views of the city and the sea! We got off the cable car at the top and walked around the castle- found a lovely bar to sit and have a drink and enjoy the views. A great day out. We didn’t buy tickets beforehand but people who had pre-purchased still had to wait in the queue with everyone else.", "publishedDate": "2019-08-01", "language": "en", "rating": 5}, {"id": 693948948, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d6495421-r693948948-Teleferic_de_Montjuic-Barcelona_Catalonia.html", "text": "The teleferic montjuic offers nice views of the city. Cars were modern and neat. We did not find any queues.\nViews from the top of the mountain were fantastic. But that seems to be reachable by car/ cab as well.\nWe were a family of 4 (2 adults + 2 children). We paid 40+ euros.\nI think the fees were too exaggerated for the experience.", "publishedDate": "2019-07-29", "language": "en", "rating": 3}, {"id": 693883730, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d6495421-r693883730-Teleferic_de_Montjuic-Barcelona_Catalonia.html", "text": "This was not originally on our itinerary but we are so glad we added the cable car to our time in Barcelona.  We took the Funicular to Montjuic station, were at the ticket office when it opened and took an early ride up to Montjuic Castle.  The castle itself is interesting, and worth a few Euros to check out if you have the time.  On the way down we stopped at Parc Montjuic for a few more views and photos.  We seemed to be ahead of the crowd.  The fantastic views of the city are the real highlight, we enjoyed this very much.", "publishedDate": "2019-07-29", "language": "en", "rating": 5}, {"id": 693819559, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d6495421-r693819559-Teleferic_de_Montjuic-Barcelona_Catalonia.html", "text": "Enjoyed a trip on the cable car during a hot month. Made the views from the top and the castle more worthwhile without the hot, sweaty walk. Easy to get to from the metro. ", "publishedDate": "2019-07-29", "language": "en", "rating": 4}, {"id": 693375575, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d6495421-r693375575-Teleferic_de_Montjuic-Barcelona_Catalonia.html", "text": "Did this cable car ride but had quite a long wait to get on, in sweltering summer heat. The queue had wet fans working for some of the time but the attendant switched them off.  They were also pretty rude in selling the tickets - with jobsworth comments such as asking how many kids, then to joke that they’d pay adult price anyway. It’s worth seeing though.", "publishedDate": "2019-07-28", "language": "en", "rating": 4}, {"id": 693169547, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d6495421-r693169547-Teleferic_de_Montjuic-Barcelona_Catalonia.html", "text": "Well this is something not to be missed in Barcelona. Me and my friend went on the Cable Car while on a college trip. The queue system was very good also and it didn't take too long to get in the cable car. When we were in the cable car there was amazing views and we had a walk around the area before going back. The views are amazing at the end when before we returned", "publishedDate": "2019-07-27", "language": "en", "rating": 4}, {"id": 691422468, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d6495421-r691422468-Teleferic_de_Montjuic-Barcelona_Catalonia.html", "text": "not too difficult to get on with wheelchair as they stopped the cars temporarily. magnificent views from the car. no toilets in the top or bottom main stations. got out at middle station, they said none there but there was some down the steep hill. they weren't in service. eventually found a portal over the road. very steep to climb up. son had to push wheelchair without me as it was too heavy. i had to walk (can only do a few steps at a time). awful situation.", "publishedDate": "2019-07-21", "language": "en", "rating": 3}, {"id": 690672929, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d6495421-r690672929-Teleferic_de_Montjuic-Barcelona_Catalonia.html", "text": "During our short Barcelona city tour we took time to do the Montjuic Cable Car ride and I have to say it was really worth the experience.  We didn't buy tickets way in advance, but we did buy them online to skip the small lines.  It probably wasn't necessary as the lines were barely there.  The cable car ride offers some amazing views of Barcelona, and we got some great photos.  It can get a little warm in the cars, but not too bad considering how hot it was outside.  \nAt the top, we took time to explore the Montjuic castle, and I liked it.  There's not a ton to do, but great to walk around and get more photos.  there is a little cafe in the castle for coffee or a beer which is nice. \nOverall I really liked our time and would highly recommend.", "publishedDate": "2019-07-18", "language": "en", "rating": 5}, {"id": 690164360, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d6495421-r690164360-Teleferic_de_Montjuic-Barcelona_Catalonia.html", "text": "Ok... let's begin by the one small negative. Barcelona has 2 cable car routes. We knew this getting here. We also knew one was good and one ... not as good. Online research was futile and not very helpful. The locals were less helpful than the internet. So we took a shot on this one... and it was the right choice!\n\nHowever I wouldn't recommend walking there in mid July temperatures... bad idea. To get there there is a Funicular which should be used. do I get from Barcelona to Montjuic?\n\nThe Montjuic Funicular has its station in Parallel street, which connects to metro lines L2 and L3. \n\nOnce we reached the top, the views of the city and the sea were gloriously breathtaking and the pain involved in getting there was quickly forgotten and totally worth it!\n\n", "publishedDate": "2019-07-16", "language": "en", "rating": 5}, {"id": 688565020, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d6495421-r688565020-Teleferic_de_Montjuic-Barcelona_Catalonia.html", "text": "A pleasant ride in the teleferic.  Nice scenery.  Too bad the smog was crazy.  Barcelona is a beautiful country.", "publishedDate": "2019-07-10", "language": "en", "rating": 5}, {"id": 688443914, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d6495421-r688443914-Teleferic_de_Montjuic-Barcelona_Catalonia.html", "text": "This was such a cool ride with great views of the city but we all agreed we were disappointed in actual views of the castle!", "publishedDate": "2019-07-10", "language": "en", "rating": 3}, {"id": 688178043, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d6495421-r688178043-Teleferic_de_Montjuic-Barcelona_Catalonia.html", "text": "This was a nice and unique way of getting up to the fortress, however it doesn’t get too much higher than the trees, so there is only views on one side, and the lines do get quite long at the bottom to get on, I recommend getting on at the middle stop where it is much quieter", "publishedDate": "2019-07-09", "language": "en", "rating": 3}, {"id": 687381941, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d6495421-r687381941-Teleferic_de_Montjuic-Barcelona_Catalonia.html", "text": "We all thought this was brilliant.. amazing way to see the city stunning views over the city and the port... The castle isn't really worth a visit you pay extra for this and we found it boring nothing much to look at apart from city veiws which you can do without paying to go in... just take in the veiws from the top... take the time to stop in the park for ice creams/ drinks etc on the way down... There are no toilets here. (unless you pay to go into the castle which if queuing for ages or if you have kids is a problem!!)", "publishedDate": "2019-07-06", "language": "en", "rating": 5}, {"id": 687169756, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d6495421-r687169756-Teleferic_de_Montjuic-Barcelona_Catalonia.html", "text": "Only to see one castle as i posted here.. but yes nothing is more interested than this to see and do.. they trick u down the ticker center to buy one way by 8€ while u go up then u need to buy return ticket again same price while u can buy round trip by 12€   ", "publishedDate": "2019-07-06", "language": "en", "rating": 2}, {"id": 685509650, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d6495421-r685509650-Teleferic_de_Montjuic-Barcelona_Catalonia.html", "text": "The only disappointing aspect is the ride is very short.  We arrived about 11 am and the que was 20 minute wait.  We purchased tickets upon arrival and there were no issues.\n\nNote: They accept US credit cards even without a PIN code, so dont worry if you do not have cash.", "publishedDate": "2019-06-30", "language": "en", "rating": 4}, {"id": 685479119, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d6495421-r685479119-Teleferic_de_Montjuic-Barcelona_Catalonia.html", "text": "A must on a visit to Barcelona. A one way ticket from Montjuic to the beach costs 11e. Amazing views and when you arrive at the beach there is a lift to take you back to ground level 🤗", "publishedDate": "2019-06-30", "language": "en", "rating": 5}, {"id": 685193132, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d6495421-r685193132-Teleferic_de_Montjuic-Barcelona_Catalonia.html", "text": "Wonderfull 9 minute trip to the top of Montjuic. The ride up has amazing views and once you are on the Montjuic you can walk around for good views and visit the castle as well. You can decide if you want a one way trip or a return trip on the cable car.", "publishedDate": "2019-06-29", "language": "en", "rating": 5}, {"id": 683998272, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d6495421-r683998272-Teleferic_de_Montjuic-Barcelona_Catalonia.html", "text": "This is a great way to get an overview of this beautiful city, port and sea. The cable car ends up at a castle which was an historic fort. It contains beautiful gardens, stunning views from various levels and a museum(additional cost). In the courtyard you can relax and purchase refreshing drinks and a snack. Truly a worthwhile visit!", "publishedDate": "2019-06-24", "language": "en", "rating": 5}, {"id": 683723011, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d6495421-r683723011-Teleferic_de_Montjuic-Barcelona_Catalonia.html", "text": "Just by chance we arrived here and had a fantastic time enjoying the views and the beauty of the area.. well worth the effort", "publishedDate": "2019-06-23", "language": "en", "rating": 5}, {"id": 683459518, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d6495421-r683459518-Teleferic_de_Montjuic-Barcelona_Catalonia.html", "text": "Brilliant.  Took the cable car up and walked around the castle then walked down through all the gardens.  Absolutely beautiful ", "publishedDate": "2019-06-22", "language": "en", "rating": 5}, {"id": 683231794, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d6495421-r683231794-Teleferic_de_Montjuic-Barcelona_Catalonia.html", "text": "Ok most cable cars have a great view; the Teleferic goes one better by doing a right turn at the midway station so you get a different view.\n\nPrices are reasonable, but more so if you were contemplating the climb in the heat of the day.", "publishedDate": "2019-06-21", "language": "en", "rating": 5}, {"id": 683054647, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d6495421-r683054647-Teleferic_de_Montjuic-Barcelona_Catalonia.html", "text": "The one from the beach area is pointless, I'm so glad I didn't pay extra for a return as I saw the disappointed faces of the people coming back. You might as well get the underground for 80% less money and it wont take nearly as long. The one that goes to the top of the mountain may be worth it but I didn't want to waste more money. ", "publishedDate": "2019-06-20", "language": "en", "rating": 1}, {"id": 682765025, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d6495421-r682765025-Teleferic_de_Montjuic-Barcelona_Catalonia.html", "text": "Amazing views all Barcelona nice at the top relaxed place it is worth every penny 12€ round trip and with the book discount you save 2€", "publishedDate": "2019-06-19", "language": "en", "rating": 5}, {"id": 682605690, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d6495421-r682605690-Teleferic_de_Montjuic-Barcelona_Catalonia.html", "text": "We got the upgraded rail/bus pass for a day that included the airport, so it also included the funnicular that went up to the Teleferic. The views are great. However, I think I would have enjoyed the steepish moderate hike thorugh the park just as much as riding the gondola. The views from the Gondola are likely slightly better, but pretty steep price. The fort at the top is cheap for entry, but they stopped selling tickets at 5:00 or 7:00 ( I cannot remember) so we arrived too late for entry.", "publishedDate": "2019-06-19", "language": "en", "rating": 4}, {"id": 681534281, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d6495421-r681534281-Teleferic_de_Montjuic-Barcelona_Catalonia.html", "text": "If you’ll come there, you will have to wait a lot. But it’s definitely worth it. You will have the most beautiful views you have ever seen of Catalonia. Really recommend you to come here just for the views while in the teleferic.", "publishedDate": "2019-06-14", "language": "en", "rating": 5}, {"id": 680811334, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d6495421-r680811334-Teleferic_de_Montjuic-Barcelona_Catalonia.html", "text": "Now it was a very efficiently and friendly run sevice, I felt secure and safe the whole ride. \nThe queue was long we thought, for a Sunday. \nIt's got 3 stats because it really isn't that long a journey, and the views were naturally better atop Castell Montjuic.", "publishedDate": "2019-06-11", "language": "en", "rating": 3}, {"id": 680708667, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d6495421-r680708667-Teleferic_de_Montjuic-Barcelona_Catalonia.html", "text": "Its a nice ride and experience but very over priced for what it is. Its not very long and not that high. if you want to get to the top, I'd recommend walking or take the bus. There isn't much up there just the castle and some views. the views were nice but you can get better ones at other places like the bunkers or parc Guell. To visit the castle it is then more money. Probably nice if you have kids.", "publishedDate": "2019-06-11", "language": "en", "rating": 3}, {"id": 680670898, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d6495421-r680670898-Teleferic_de_Montjuic-Barcelona_Catalonia.html", "text": "We took the 20 bus from Pl Palau to Paral el then the Funicular (access via Metro concourse) to the Teleferic station. The funicular was quick and saved walking half way up Montjuic. The Teleferic (Cable car) was easy to get tickets for before boarding. We got a discount from the Barcelona Tourist Bus book.They scan the code on the back of the booklet so don't tear the ticket out. At the top we had a look around the gardens and castle, We had lovely weather and it was not too crowded. Going early helped avoid any queues.", "publishedDate": "2019-06-11", "language": "en", "rating": 5}, {"id": 680652599, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d6495421-r680652599-Teleferic_de_Montjuic-Barcelona_Catalonia.html", "text": "Enjoy fantastic panoramic views of Barcelona from the Montjuïc cable car. Climb aboard and enjoy the experience!\nIf you visit at the end of the afternoon you can enjoy the sunset.", "publishedDate": "2019-06-11", "language": "en", "rating": 5}, {"id": 680590092, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d6495421-r680590092-Teleferic_de_Montjuic-Barcelona_Catalonia.html", "text": "If you have walked up from the Plaza d'Espanya on a hot day you are probably ready to do the increasingly steep last few hundreds of metres to the Castell De Monjuic by any means other than walking.  The cable car provides the solution.  The cars hold about 6 people and you get great panoramic views as you go.  There were no queues on the day we visited so we were straight into the cars in both directions.", "publishedDate": "2019-06-10", "language": "en", "rating": 5}, {"id": 680273103, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d6495421-r680273103-Teleferic_de_Montjuic-Barcelona_Catalonia.html", "text": "The line to buy tickets was more than one hour\nNo shade or place to sit\nThey cram 16 people into the car and when you get to the other end ( either way) the line is again very long \n\nWould not recommend this at all", "publishedDate": "2019-06-09", "language": "en", "rating": 2}, {"id": 679745040, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d6495421-r679745040-Teleferic_de_Montjuic-Barcelona_Catalonia.html", "text": "Initially we had planed to do the harbour cable car and then MontJuic however when we arrived at the harbour terminal we were informed it was broken with no time set for it to be fixed. Plan B walk around the harbour and take the funicular to the cable car station. The queue was not long and probably took us around 30 mins to board. Its only a short trip and at 12.7 Euros a bit expensive for what you get but its the easy way to the top. One way is cheaper and the walk down appears reasonable.", "publishedDate": "2019-06-07", "language": "en", "rating": 4}, {"id": 679585406, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d6495421-r679585406-Teleferic_de_Montjuic-Barcelona_Catalonia.html", "text": "Took the roundtrip ride to the castle by taking the metro to the cable car.  Purchased tickets at entry.  The views are amazing and certainly worth a couple of hours.", "publishedDate": "2019-06-06", "language": "en", "rating": 4}, {"id": 679320146, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d6495421-r679320146-Teleferic_de_Montjuic-Barcelona_Catalonia.html", "text": "We purchased round-trip tickets at 10,70€ per person to ride the Montjuic cable car. We thought this was the cable car that went from Montjuïc to Barceloneta. But that cable car is called Port Vell Aerial Tramway, which crosses Port Vell, Barcelona's old harbour, and connects the Montjuïc hill with the seaside suburb of Barceloneta (don’t get the two confused).  The Montjuïc cable car runs from the upper station of the Montjuïc funicular, and climbs up the Montjuïc hill to a terminal near the Montjuïc Castle. It affords great views of the Barcelona skyline. We recommend buying the round trip ticket, unless you plan to walk down or take other transportation from the hilltop. The day we went, there was no long lines or wait to get on the cable cars.", "publishedDate": "2019-06-05", "language": "en", "rating": 4}, {"id": 679146040, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d6495421-r679146040-Teleferic_de_Montjuic-Barcelona_Catalonia.html", "text": "Great views as you climb to the Montjuic castle. Also an unusual ninety degree turn en-route. Plenty of capacity so only a few mins queue for tickets. Not sure why but I was told children were free on the day I travelled so saved myself €9 - the ticket price is the only downside. Easy access as a stop on the Bus Turistic.", "publishedDate": "2019-06-05", "language": "en", "rating": 5}, {"id": 678867169, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d6495421-r678867169-Teleferic_de_Montjuic-Barcelona_Catalonia.html", "text": "Excellent view up the mountain--beautiful toward sunset time.  Absolutely a worthwhile expense in the city. ", "publishedDate": "2019-06-04", "language": "en", "rating": 5}, {"id": 678852881, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d6495421-r678852881-Teleferic_de_Montjuic-Barcelona_Catalonia.html", "text": "This is a must do when in Barcelona. Great views of Barcelona and a nice calming ride. Also good to go round the castle when you get to the top. Lovely cheap activity. ", "publishedDate": "2019-06-04", "language": "en", "rating": 4}, {"id": 676842688, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d6495421-r676842688-Teleferic_de_Montjuic-Barcelona_Catalonia.html", "text": "I had never been in a Teleférico before and this almost gave me a heart attack for 1st 40 seconds going up but then I was fine and enjoying the views! It was simply amazing both ways up and down! Got to see the most breathtaking views in Barcelona!", "publishedDate": "2019-05-27", "language": "en", "rating": 5}, {"id": 675987772, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d6495421-r675987772-Teleferic_de_Montjuic-Barcelona_Catalonia.html", "text": "A must do in Barcelona! Amazing views, such a good experience! Lovely to walk round the castle at the top. Really enjoyed! ", "publishedDate": "2019-05-23", "language": "en", "rating": 5}, {"id": 675536202, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d6495421-r675536202-Teleferic_de_Montjuic-Barcelona_Catalonia.html", "text": "Great experience, incredible views at a very reasonable price. A must do if you are in Barcelona. Note, there are two cable cars in Barcelona, the one over the port and the one at Montjuic. They are not the same one. Montjuic is half way up Montjuic hill and is accessible by using the Montjuic funicular railway on Av del  Parel lel. Well worth a visit.", "publishedDate": "2019-05-21", "language": "en", "rating": 5}, {"id": 675422303, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d6495421-r675422303-Teleferic_de_Montjuic-Barcelona_Catalonia.html", "text": "Go on a nice day because the view is much of the attraction. Really stunning! And the Castle shows an interesting part of Barcelona’s history.  Try to listen to the video at the beginning.   Well worth a visit.", "publishedDate": "2019-05-21", "language": "en", "rating": 5}, {"id": 675176344, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d6495421-r675176344-Teleferic_de_Montjuic-Barcelona_Catalonia.html", "text": "Considering you pay fit the cable car which is a 5  min round trip and then the best views at the top are actually past the castle entrance which you have to pay for again, I'd say it's a little over priced. \nFor two adults it cost us about £30 including castle entrance. \n\nGreat views from the castle terrace!", "publishedDate": "2019-05-20", "language": "en", "rating": 4}, {"id": 675133907, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d6495421-r675133907-Teleferic_de_Montjuic-Barcelona_Catalonia.html", "text": "Be prepared to wait in line. We waited like for 1 hour or something like that. But felt like the queue went pretty fast. I think it depends on company how fast or slow is your waiting time ;).\nAmazing views over the beaches and the city of Barcelona.\nApproximately 18 people goes to the cable car at the same time and about 8 people to the elevator.\n\nWhen you go with the elevator to the top there is few vending machines where you can buy soft drinks and water. 2€ per bottle. Need coins.", "publishedDate": "2019-05-19", "language": "en", "rating": 5}, {"id": 675007354, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d6495421-r675007354-Teleferic_de_Montjuic-Barcelona_Catalonia.html", "text": "Unfortunately our experience was marred by a cloudy, wet day. Notwithstanding, this attraction does provide a not unexpected aerial view of downtown Barcelona. The gardens at the top looked nice and would be a pleasant walk in the right conditions. Recommended if you're at a loss for things to do - otherwise you wouldn't be disappointed by giving this a miss.", "publishedDate": "2019-05-19", "language": "en", "rating": 3}, {"id": 674747837, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d6495421-r674747837-Teleferic_de_Montjuic-Barcelona_Catalonia.html", "text": "It’s a little overpriced for a 5 minutes route. Also keep in mind that this is not the one you see starting in the port. Other than that it was a pleasant experience. We enjoyed great views and a walk around the castle. We liked the fact that the cable cars had limited seats and you can have a private cable car for your group. (The other company with the cable cars that start at the port has around 20 people in each wagon and a huge line because of limited cable cars).", "publishedDate": "2019-05-18", "language": "en", "rating": 3}, {"id": 673946031, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d6495421-r673946031-Teleferic_de_Montjuic-Barcelona_Catalonia.html", "text": "The cable car ride to the top is spectacular! The ride is smooth and on a fine day you can see forever.", "publishedDate": "2019-05-14", "language": "en", "rating": 5}, {"id": 673169857, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d6495421-r673169857-Teleferic_de_Montjuic-Barcelona_Catalonia.html", "text": "Visited the cable cars on our trip to Barcelona. The views were stunning. Glad we did it. Would definitely do again next time we go.", "publishedDate": "2019-05-11", "language": "en", "rating": 5}, {"id": 669649068, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d6495421-r669649068-Teleferic_de_Montjuic-Barcelona_Catalonia.html", "text": "We booked tickets for this online through the tiqets website.  The booking was straightforward and we were able to access the ride with our phones.\nIt is easy to find the cable car station by using the funicular at Parar-lel metro station.  The cable car operates a continual loop and you jump into a slowly moving car - so not a suitable attraction for a wheelchair user, however as older citizens we did not find it difficult to climb into a car.\nThe weather was clear and bright so the views out over the city were amazing.  The car finishes close to Montjuic castle and there is a great view towards the marina, cruise ship terminal and the docks.  \nA fun way to get birdseye views.\n", "publishedDate": "2019-04-27", "language": "en", "rating": 5}, {"id": 668893975, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d6495421-r668893975-Teleferic_de_Montjuic-Barcelona_Catalonia.html", "text": "We took the cable cars up to the castle, and back down again. I'd have stayed on them longer, but younger daughter wouldn't allow it. 50.80 Euros for the four of us (6,35 euros each, each way).", "publishedDate": "2019-04-24", "language": "en", "rating": 5}, {"id": 668543909, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d6495421-r668543909-Teleferic_de_Montjuic-Barcelona_Catalonia.html", "text": "Went up and down with kids last week. If the weather is nice, it provides good views. We parked at the bottom of Magic fountain and is a good 15 min walk to the station. The walk is quite scenic as well. ", "publishedDate": "2019-04-23", "language": "en", "rating": 4}, {"id": 667788366, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d6495421-r667788366-Teleferic_de_Montjuic-Barcelona_Catalonia.html", "text": "We had walked through part of Parc de Montjuic after getting off a bus just past the Olympic Stadium to visit Castell de Montjuic at the top of the hill but before we went to the castle we decided to have a ride on the cable car, there were no queues at this top station which was obviously good. When paying I asked how much, the lady serving wasn't very attentive and was chatting to a colleague, she just said 8 Euros 40 each, I paid and got on, looked at the ticket at it said \"one way\" so we got off about 4 to 5 mins later at the bottom of the hill to then have to walk up again to visit the castle...not the best move lol. For the short time it took, there were quite scenic views of Barcelona city but overall I found it a bit average especially at the price, I believe a return trip would've been 12 Euros each, I think a single gives you enough of the experience but probably getting it from the bottom to the top ! Castell de Montjuic at the top is inexpensive at 5 Euros for above 30 yrs old and 3 Euros for under although this too is pretty average with not a lot to see but great views of the port on one side and Barcelona city on the other.", "publishedDate": "2019-04-20", "language": "en", "rating": 3}]}}]