[{"locationId": 4752371, "name": "Parc de Collserola", "placeType": "ATTRACTION", "reviewListPage": {"reviews": [{"id": 734591392, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d4752371-r734591392-Parc_de_Collserola-Barcelona_Catalonia.html", "text": "This natural park is very easy to get to and offers a lot of different hiking paths. Great panoramic views of Barcelona and the surroundings. In the limited parts that I explored the paths branched out frequently and there were many dead ends, I did not find the road signs of much help so best to plan your hiking path ahead of time and use your phone to orientate yourself (The GPS wask working even deep inside the forested areas).", "publishedDate": "2019-12-25", "language": "en", "rating": 5}, {"id": 689214305, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d4752371-r689214305-Parc_de_Collserola-Barcelona_Catalonia.html", "text": "Some of the reviews here for Parc de Collserolahad had my expectations set pretty, but it wound up being outstanding, so I thought I would report back after a wonderful hike in the park! I took the metro from my hotel in Gràcia to Baixador de Vallvidrera, which was about 15 minutes. I couldn't believe that in such a short journey, I was transported away to such a serene mountain! When I got off the metro, I wanted to walk to Tibidabo, but my iPhone map was telling me to set out along the street. This felt a bit silly considering I'd just spent a bit of time traveling to the park, so I decided to head left up a set of stairs into the park. In about five minutes, I came across an information building, where the most kind and helpful woman explained (in English) the best hiking route to take through the park to Tibidabo. I bought a map for .50, but you could also download it for free to your phone. The hike took about an hour, with quite a bit of elevation gain and stairs to climb in some spots. The last ten minutes were spent walking up a paved road that also lead to the theme park (so lots of families and kids!) However, in the course of an hour, I crossed two other hikers and maybe a handful of bikers, with beautiful views of Tibidabo every once in a while in the distance. It was relaxing, dreamy, and overall the perfect morning away from the bustle of the city! Pack water - there's a clean drinking fountain at the spring about 45 minutes in where you can fill your water bottle :)", "publishedDate": "2019-07-13", "language": "en", "rating": 5}, {"id": 682652606, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d4752371-r682652606-Parc_de_Collserola-Barcelona_Catalonia.html", "text": "amazing tour, nearby the city. refreshing and energizing experience.\nstarted at Feu de Furnicular and went all the way to the KH restaurant.", "publishedDate": "2019-06-19", "language": "en", "rating": 5}, {"id": 549099326, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d4752371-r549099326-Parc_de_Collserola-Barcelona_Catalonia.html", "text": "We took the train from the city center to the park entrance and had a nice two hour walk to the top of Tibidabo. The trails were clearly marked, although at times we had to use Google Maps to help navigate our way. All together it was a worthwhile experience and highly recommended to see another side of Barcelona.", "publishedDate": "2017-12-25", "language": "en", "rating": 5}, {"id": 508329697, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d4752371-r508329697-Parc_de_Collserola-Barcelona_Catalonia.html", "text": "In an effort to do something a little off the beaten path, my husband and I wanted to explore the Park de Collserola after our visit to Tibidabo. \n\nFollowing a suggestion in a tour book we embarked along dirt path to the font de budallera (a natural spring). We had a little trouble following the entrance to the parc (even after asking directions no one seemed to really know what we were talking about). We finally found the entrance and did see signs to the font de budallera. After about 20-25 min of walking through a dirt path under heavy trees, we finally came to the font and it was pretty disappointing. A trickle of water filled a small fountain.\n\nThe walk itself was nice and under shade but there weren't many views. It was quite peaceful - we saw maybe 3-4 other people the whole time. \n\nAfter seeing the font, we walked back up the hill and continued onto Vallvidrera, a small town about 20 min further. Again, while we got a little exercise, it wasn't a particularly pretty walk (we followed a road) and the town itself wasn't much. We were able to catch a cab back to Barcelona after a few minutes of wandering around.", "publishedDate": "2017-08-03", "language": "en", "rating": 3}, {"id": 474862463, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d4752371-r474862463-Parc_de_Collserola-Barcelona_Catalonia.html", "text": "It's good to walk from Barecelona to Sant Cugat (it would take half day). If you don't have plenty of time walk until \"Carretera de les aigües\" in order to see BCN views.", "publishedDate": "2017-04-11", "language": "en", "rating": 3}, {"id": 383364343, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d4752371-r383364343-Parc_de_Collserola-Barcelona_Catalonia.html", "text": "For most people visiting Barcelona, a quick trip to the top of Tibidabo is a must. Possibly even a brief ramble down the other side to see the stunning 'La Font De La Budellera'. \n\nMost, however, will be discouraged from properly exploring Collserola due to its size. 8000 hectares of mountainous forest, complete with rich history, numerous ruins, wild animals (Boar are everywhere) and quite honestly some of the most stunning scenery I've ever seen at such easy access.\n\nThe issue for most tourists is that the park information is largely given in Catalan. The full and detailed maps, too. If you don't fancy getting lost for a few hours, I would suggest recruiting a guide of some kind in order to spend the entire day (at the very least) in the park. \n\nAs a result of the lack of multi-lingual and detailed info, the park remains mostly empty of people once you venture a little further than the initial peaks of Tibidabo and Vallvidrera Superior. I have shared trails with the occasional jogger, mountain biker and boar but it is very easy to feel as if you are the only one in the forest, sometimes for hours at a time. \n\n*ALWAYS REMEMBER*\nNO MATTER HOW PRETTY IT IS - IT IS STILL MOUNTAINS\nSTAY IN THE SHADE - TAKE PLENTY OF WATER\nSTAY CLEAR OF EDGES - BE WARY OF POORLY MAINTAINED TRAILS\n**NATURE IS BETTER THAN YOU**DON'T CHALLENGE IT**", "publishedDate": "2016-06-17", "language": "en", "rating": 5}, {"id": 283542286, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d4752371-r283542286-Parc_de_Collserola-Barcelona_Catalonia.html", "text": "Take the train to Baixador de Vallvidrera (still in zone 1) and from the station enter the park. Trails run for miles around the hills and can be steep but the setting is superb and peaceful away from the majority of tourists.\nBirdwatching can also be good.\nI couldnt find a decent map of all the trails. ", "publishedDate": "2015-06-28", "language": "en", "rating": 4}, {"id": 205394903, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d4752371-r205394903-Parc_de_Collserola-Barcelona_Catalonia.html", "text": "Collserola is the mountain you see topping the city of Barcelona when you turn your back to the sea. It's the true green lung of the city, and it has a great natural value.\nAnd it is a great place to visit, still unknown for most tourists.\nIf you have some time to spare, and you can rent or borrow a mountain bike, I'd recommend you to either cycle or use the metro till the Peu del Funicular stop. From there you just go upstairs to find the cable car that will lift you up to Vallvidrera. Don't worry, you can bring in the bike, providing there's no more than 2 bikes at once.\nOnce you're in Vallvidrera, ask for directions to get to the Camí des Aigües, or cycle up to Tibidabo and then descend from there.\nBelieve me, it's worth the effort, the nature is exhuberant and the views are breath taking.\nRecommended to go with a local to get the best of it.", "publishedDate": "2014-05-13", "language": "en", "rating": 5}]}}]