[{"locationId": 208598, "name": "Plaza de Cataluna", "placeType": "ATTRACTION", "reviewListPage": {"reviews": [{"id": 752909400, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d208598-r752909400-Plaza_de_Cataluna-Barcelona_Catalonia.html", "text": "Plenty of retail malls and outlets around the square, there is a recommended Hoho sightseeing tour bus stop here which brings you to all the major landmarks of the city.", "publishedDate": "2020-04-25", "language": "en", "rating": 4}, {"id": 745949957, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d208598-r745949957-Plaza_de_Cataluna-Barcelona_Catalonia.html", "text": "Busy park, with minimal shade covering. Lot's of people hanging out here, but nothing extraordinary to see here. You may walk through here going to/from a bus stop, but no reason to make a special trip here.", "publishedDate": "2020-02-18", "language": "en", "rating": 3}, {"id": 744449889, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d208598-r744449889-Plaza_de_Cataluna-Barcelona_Catalonia.html", "text": "This seems to be the central location where people gather. The HOHO buses have their stops here and it's right at the top of La Rambla making this a very busy place at all time. We changed our HOHO bus routes here and found it to be very confusing. If you need to find a restroom nearby, go to the department store at the corner near La Rambla. Clean restrooms available for .80E per person.", "publishedDate": "2020-02-11", "language": "en", "rating": 3}, {"id": 743375041, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d208598-r743375041-Plaza_de_Cataluna-Barcelona_Catalonia.html", "text": "There is stuff to see here but I wouldn’t go too far out of my way for it. There are several statues, a couple fountains, LOTS of pigeons, etc. What it mostly has going for it is it is central to many things you’ll want to see as a tourist (like Las Ramblas). So you’ll probably come to this at some point anyway if you’re canvassing the area so you might as well look around. It’s worth a few minutes to walk the circle. \n\nA word of warning is that just like Las Ramblas, you’re exposure to pickpockets and people selling drugs is higher here. This is simply because it’s very crowded with tourists. We found that stuff easy to deal with. Keep your distance from everyone, don’t give someone who tries to stop you even a moments hesitation, and if anyone approaches you, move away. I didn’t find any of these guys aggressive; whatever they say or offer don’t slow down, mutter a no or no thank you and continue and you’ll be okay. Be vigilant is the key. Once in a while that may not be enough because of a rare super street criminal but that is anywhere. Honestly, you should be aware and vigilant like this in any big city square (or circle). ", "publishedDate": "2020-02-06", "language": "en", "rating": 3}, {"id": 742889313, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d208598-r742889313-Plaza_de_Cataluna-Barcelona_Catalonia.html", "text": "I visited this area twice once during the day and once late in the evening on both times 2 crowds of youth tried to pick my pockets. They tried to gather around you and get close to you unfortunatly this will always ne a problem in barcelona but this area is there hot spot i noticed they all spoke arabic and spanish so probably not even from the area just there to steal from innocent tourists be careful sitting on the benches", "publishedDate": "2020-02-03", "language": "en", "rating": 1}, {"id": 741035794, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d208598-r741035794-Plaza_de_Cataluna-Barcelona_Catalonia.html", "text": "This is one of those special public places...fountains, statues, very large space ringed by wonderful buildings and the human flow of Barcelona. Cathedral and other sights nearby. Go and soak it in.", "publishedDate": "2020-01-24", "language": "en", "rating": 5}, {"id": 740391568, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d208598-r740391568-Plaza_de_Cataluna-Barcelona_Catalonia.html", "text": "Large square in the centre of the city and one of the focal points for the transport network. Several of the large department stores are here and just before Christmas there was a street market in the middle. Bustling and interesting by day, but you may need to exercise a little care at night. The Ramblas is one way ontothe square and provides a passageway for soem of the less desirable elements to get into the square, so be careful!", "publishedDate": "2020-01-21", "language": "en", "rating": 4}, {"id": 736517787, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d208598-r736517787-Plaza_de_Cataluna-Barcelona_Catalonia.html", "text": "Went here for New Year’s Eve as recommended from a blogger. Got there at about 11 and no one was really there but sure enough, people started filling in shortly after. Since we had gotten there early, we had a “front row seat.”  At midnight, everyone pops their cava and eats 12 grapes. We had heard every one throws their champagne bottles in the plaza but about 2 minutes passed and no one did but then the first bottle came and several more after. There were some funny college aged kids from France around us that helped make our experience. It was the perfect New Years activity if you aren’t interested in the whole club/party situation.", "publishedDate": "2020-01-03", "language": "en", "rating": 5}, {"id": 735954358, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d208598-r735954358-Plaza_de_Cataluna-Barcelona_Catalonia.html", "text": "We began our exploration of Barcelona with a two-block walk from our hotel to Placa Catalunya, filled with people feeding a large flock of pigeons, and passed through it several more times during our stay in Barcelona. Interesting during the day, it was prettier at night when the fountains were lighted.", "publishedDate": "2019-12-31", "language": "en", "rating": 4}, {"id": 734724337, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d208598-r734724337-Plaza_de_Cataluna-Barcelona_Catalonia.html", "text": "This really nice. What can you dislike about it really? Absolutely fantastic engineering. It's pack full of people but that can't spoil it.", "publishedDate": "2019-12-26", "language": "en", "rating": 5}, {"id": 730031301, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d208598-r730031301-Plaza_de_Cataluna-Barcelona_Catalonia.html", "text": "...a huge place in the center of everything. \nA little too busy for my taste and not too beautiful...", "publishedDate": "2019-12-01", "language": "en", "rating": 4}, {"id": 729657860, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d208598-r729657860-Plaza_de_Cataluna-Barcelona_Catalonia.html", "text": "The Plaza is interesting, swarming with pigeons...and then more pigeons.  Several interesting statues and monuments.  Nice place to see.  Center of action for seeing any of BCN sights in any direction.  There are several major bus stations less than 2-3 blocks away, the La Ramblas district and others.  Several modern restaurants, along with traditional eateries and markets are all within 10 min walk of this plaze.  ", "publishedDate": "2019-11-29", "language": "en", "rating": 4}, {"id": 728485149, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d208598-r728485149-Plaza_de_Cataluna-Barcelona_Catalonia.html", "text": "This is the absolute center of town and is the place where most of the tourist buses load and unload.  Somewhat difficult when there are demonstrations.  A big Metro transfer point.  Department stores.", "publishedDate": "2019-11-23", "language": "en", "rating": 4}, {"id": 728464272, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d208598-r728464272-Plaza_de_Cataluna-Barcelona_Catalonia.html", "text": "I usually stay at a hotel located near this Plaza/Placa because it is the major city hub. excellent location for transportation.  Metro/ train; taxi's; HOHO buses; Information center; Aeropuerto Bus to & from airport all stop here.  Also has a major grocery chain, El Corte Ingles, with restaurant with view of city on top floor along with a food court in basement.  Also Las Ramblas to the sea begins here as does the new city, L'Eixample.", "publishedDate": "2019-11-23", "language": "en", "rating": 5}, {"id": 728224228, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d208598-r728224228-Plaza_de_Cataluna-Barcelona_Catalonia.html", "text": "We enjoyed Plaza de Cataluna very much, it's a lovely Plaza and a must visit in my book, especially if you have childrens. \nOur son loved it and we stopped by it many times so he could play arround, the place is full with pigeons and soap bubbles and other interesting stuff, definitely I recommend you visit it. \nBeware though as the Plaza is full with people so you have to be carefull who you talk to. ", "publishedDate": "2019-11-22", "language": "en", "rating": 5}, {"id": 728220812, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d208598-r728220812-Plaza_de_Cataluna-Barcelona_Catalonia.html", "text": "Our city tour and shopping took us to this beautiful and large place.\nAwesome buildings, nice restaurants, elegant shops, exquisite fountain.\nNice for walking and sitting to enjoy the view.\nIt is very busy with many tourist.", "publishedDate": "2019-11-22", "language": "en", "rating": 5}, {"id": 728060255, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d208598-r728060255-Plaza_de_Cataluna-Barcelona_Catalonia.html", "text": "We always find a hotel near this plaza because you can get anywhere from it.  The metro is here as well as buses, tourist buses and restaurants.  It’s a very active location with good restaurants nearby.  While not a tourist attraction, it’s a hub to lots of activities.", "publishedDate": "2019-11-21", "language": "en", "rating": 4}, {"id": 727712496, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d208598-r727712496-Plaza_de_Cataluna-Barcelona_Catalonia.html", "text": "It is NOT deaf friendly.  Insufficient English scripts.  No booklet in English language for deaf Americans traveling who cannot hear or lipread Catalan language!  We were motivated to learn and appreciate cultural richness but missed out a lot the history behind that catheral due to lacking of English language in print for us to read.   What i recalled from my college course in Art History on Gothic, Romansque, etc that i studied 45 years ago.  It was not helpful.   I only took pictures and left after 15-30 minutes of touring there.", "publishedDate": "2019-11-20", "language": "en", "rating": 1}, {"id": 727551791, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d208598-r727551791-Plaza_de_Cataluna-Barcelona_Catalonia.html", "text": "Located off of La Rambla, the Plaza can be used as a hub for moving out to most any locale in the city.  Nice for sitting and people watching, if one so desires, it is within walking distance of several good eateries, small markets, for other shopping needs and is the spot for major bus activity and a prime place to hail a taxi.  In fact, we stayed in a hotel just across from the Plaza for most all of the above reasons.", "publishedDate": "2019-11-19", "language": "en", "rating": 4}, {"id": 727379235, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d208598-r727379235-Plaza_de_Cataluna-Barcelona_Catalonia.html", "text": "Right at the top of the Rambla, this is a most popular spot as roads converge and one’s walk down the Rambla begins.  There are many perspectives for photo shoots, and loads of shopping and eating to be experienced.  You must visit this plaza at some time during your Barcelona stay.", "publishedDate": "2019-11-18", "language": "en", "rating": 4}, {"id": 727038138, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d208598-r727038138-Plaza_de_Cataluna-Barcelona_Catalonia.html", "text": "This is a beautiful plaza with numerous statuary throughout. There are fountains and the place has as many pigeons as St Mark’s square in Venice! The Ramblas starts in the SW corner of the park.  We passed through this park several times during our stay in Barcelona as our hotel was only a block away.  The plaza was always busy with vendors, locals and tourist alike.  Many were mesmerized by the pigeons!\n", "publishedDate": "2019-11-17", "language": "en", "rating": 4}, {"id": 726644421, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d208598-r726644421-Plaza_de_Cataluna-Barcelona_Catalonia.html", "text": "All roads in Barcelona converge here. The Plaza de Cataluna is its epicenter. It’s a marvelous spot to people watch and dodge bombardments from pigeons. Lots of Mary Poppins fans “Feed the Birds” here because they’re omnipresent.\n\nTake in the atmosphere, people watch, catch the vibe and ramble down the Ramblas.", "publishedDate": "2019-11-15", "language": "en", "rating": 4}, {"id": 726168251, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d208598-r726168251-Plaza_de_Cataluna-Barcelona_Catalonia.html", "text": "At the top of Las Ramblas strip. \nNice meeting spot with fountains and shops surrounding it.  Thousands of pigeons around", "publishedDate": "2019-11-13", "language": "en", "rating": 4}, {"id": 725043116, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d208598-r725043116-Plaza_de_Cataluna-Barcelona_Catalonia.html", "text": "Great fun with the all pigeons around. Th4e kids were crazy about feeding them. Nice fountains as well, a bit on the side from La Rambla. Great for relaxing and photo stop", "publishedDate": "2019-11-08", "language": "en", "rating": 5}, {"id": 723361877, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d208598-r723361877-Plaza_de_Cataluna-Barcelona_Catalonia.html", "text": "This is a very large public square in the heart of downtown Barcelona. From here you can walk to most places downtown, and it's a nice gathering place, although during our visit in August it was quite hot with minimal shade. It isn't really an attraction in itself, although the Monument to Francesc Macià is on one corner and interesting to see.", "publishedDate": "2019-11-02", "language": "en", "rating": 3}, {"id": 723121311, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d208598-r723121311-Plaza_de_Cataluna-Barcelona_Catalonia.html", "text": "This wide open plaza in the heart of Barcelona, down the street from the famous Casa Batlló and at the end of a ritzy row of shops, is surrounded by beautiful fountains and sculptures.  But the real attraction of the square isn't the art or a brief respite from hoofing it across the city, it is the overwhelming number of pigeons that call this square home.  Watch anyone who dares to feed them quickly get enveloped in rat-birds or little dogs on their afternoon walk quickly become a dangerous hunter, chasing their prey across the courtyard.  Just try not to get pooped on.", "publishedDate": "2019-11-01", "language": "en", "rating": 4}, {"id": 722201963, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d208598-r722201963-Plaza_de_Cataluna-Barcelona_Catalonia.html", "text": "A fabulous civic space, some street performers, thousands of pigeons, space and fountains. \n\nAhead of our visit there we some independence demonstrations we arrived just after 26 October and saw no problems what so ever.\n\nAt the head of las Rambla this Plaza is a lovely open space, for play, for picnic (mind the pigeons) for contemplation, for coffee, etc. There are several different sculptures to take in too. Definitely a Barcelona must do.", "publishedDate": "2019-10-28", "language": "en", "rating": 5}, {"id": 721233355, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d208598-r721233355-Plaza_de_Cataluna-Barcelona_Catalonia.html", "text": "Practically the heart of Barcelona, very frequented where you can find anything a tourist can ask. it is understood where are many tourists you'll find people who want to take advantage of them, such as the clowns in the square where tourists try to take pictures with pigeons. Or someone throws food for pigeons at your feet and the moment they approach that person takes pictures and offer to the tourists in exchange of money.", "publishedDate": "2019-10-25", "language": "en", "rating": 4}, {"id": 720437808, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d208598-r720437808-Plaza_de_Cataluna-Barcelona_Catalonia.html", "text": "Difficult to review what is basically a large open area with a massive transport hub underneath it , if travelling anywhere in Barcelona you will at some point pass through here so will see a few statues , lots of pigeons and plenty of tourists", "publishedDate": "2019-10-22", "language": "en", "rating": 3}, {"id": 718944532, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d208598-r718944532-Plaza_de_Cataluna-Barcelona_Catalonia.html", "text": "This is the city center in Barcelona.  This is an important transportation hub both above and below the ground.  Our Aerobus dropped us off here from the airport.  \n\nThe busy square has a lot of pigeons, statues covered with bird poop, there are beautiful flowers and fountains, etc.  It is also nice to people watch, if you have time in your hands.\n", "publishedDate": "2019-10-16", "language": "en", "rating": 4}, {"id": 718285733, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d208598-r718285733-Plaza_de_Cataluna-Barcelona_Catalonia.html", "text": "Located right off Passeig De Gracia and La Ramblas it makes a great starting point with many different ways to go to reach some of the most popular places to see like Casa Batllo Gaudi, Corte Ingles & La Ramblas.\n\nAt Catalunya there are some nice fountains and statues, the opportunity to feed pigeons - the seeds are about 3Euros for a few big handfuls - and there are also a lot of big shops located near by. Catalunya is also the most central metro change over station so you can get pretty much every line from here like the green, purple, blue and Roadalies Orange lines.", "publishedDate": "2019-10-14", "language": "en", "rating": 5}, {"id": 717231971, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d208598-r717231971-Plaza_de_Cataluna-Barcelona_Catalonia.html", "text": "This place is an important landmark for any traveller visiting Barcelona. The Square of Catalonia is the link of Barcelona, where all roads start. From here one can practically go anywhere, by means of taxis, the tourist bus, metro or by some of the most important public bus-routes in the city. Here is where some of the most prestigious shops like El Corte Ingles can be visited.\n\nThe Ramblas is across the street leading all the way to the Columbus monument.  From the Ramblas, the Gothic quarter can be accessed.", "publishedDate": "2019-10-11", "language": "en", "rating": 4}, {"id": 716704615, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d208598-r716704615-Plaza_de_Cataluna-Barcelona_Catalonia.html", "text": "Stop at the market and eat at the top floor resto of Ingles. This is a perfect place to hop on tour buses and view the city.", "publishedDate": "2019-10-09", "language": "en", "rating": 5}, {"id": 714530413, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d208598-r714530413-Plaza_de_Cataluna-Barcelona_Catalonia.html", "text": "It’s a very nice district and one of the most important place you have to visit in Barcelona. The square is located in the city center and there are a lot of amazing sculptures, two fountains that shines really, really brightly in the evening and absolutely beautiful fields of flowers, that make this płace incredibly charming, despite of rush in the city. There are many restaurants and cafés around, for example the Hard Rock Café, where you can sit to drink and eat something tasty. Unfortunately there is quite loud, because the city is most of the time packed of tourists and is extremely congested. Near to the square you can find a large amount of quiet and lovely narrow streets. Despite traffic jams, I really recommend that place to visit, it’s truly worth seeing.", "publishedDate": "2019-10-01", "language": "en", "rating": 4}, {"id": 714438530, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d208598-r714438530-Plaza_de_Cataluna-Barcelona_Catalonia.html", "text": "Plaça Catalunya is one of the best places in Barcelona, you will see that the square is quite big, there is a lot of banks to rest and you can stay there taking picture of the beautiful place. Even though a lot if people is feeding the birds that in the square they are the kings and is plenty of them.\n\nOn the other hand the square is the best place to start to walk you have really close Passeig de Gracia, las Ramblas, el Gotic,... so if you have the idea to do a walking day you should start in here ", "publishedDate": "2019-10-01", "language": "en", "rating": 5}, {"id": 714019137, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d208598-r714019137-Plaza_de_Cataluna-Barcelona_Catalonia.html", "text": "in Catalunya Square (as we called it) the most central area with the intersecting Las Ramblas, this lovely open area is a great meeting point and the fountains are beautiful", "publishedDate": "2019-09-29", "language": "en", "rating": 5}, {"id": 713229170, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d208598-r713229170-Plaza_de_Cataluna-Barcelona_Catalonia.html", "text": "The main square of the city which you will see a lot if using the public transport system (which you should). Not much to see but loads of friendly pigeons to feed. Just watch out for street 'performers' who will try to force you into a photo with them for a few euros. Harmless but very annoying if you look like a tourist or are transporting luggage", "publishedDate": "2019-09-26", "language": "en", "rating": 3}, {"id": 708239590, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d208598-r708239590-Plaza_de_Cataluna-Barcelona_Catalonia.html", "text": "Nice park or plaza location at the start of La Rambla. Water fountains, park benches and hundreds of pigeons. If you like to feed pigeons then this is the place for you.", "publishedDate": "2019-09-09", "language": "en", "rating": 3}, {"id": 707885745, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d208598-r707885745-Plaza_de_Cataluna-Barcelona_Catalonia.html", "text": "Large plaza similar to Trafalgar Square in London which seems to be the hub of Barcelona and a hive of activity. Several waterfalls and statues to be seen. It is also home to hundreds if not thousands of pigeons - the vendors in the square sell seed for two euro a bag - although you are advised not to feed them people still do and I dare say the vendors rely on that income to make a living. The pigeons are very tame and our daughter loved feeding them - they will land on your head and hand / arm - if you let them!\nIf you visit the square and are tempted by the touristic bus of Barcelona then don’t bother - it’s a rip off. Use public transport or walk you will get far more out of it. ", "publishedDate": "2019-09-08", "language": "en", "rating": 5}, {"id": 707276057, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d208598-r707276057-Plaza_de_Cataluna-Barcelona_Catalonia.html", "text": "Loved this! So big with statues, flowers,  fountains. The metro Catalunia is also here. This is one end on Las Ramblas connected to the other end with the Christopher Columbus monument.\nSome of the most important streets meet here: Passeig de Gracia, La Rambla, Portal de l'Angel, Carrer de Vergara, Carrer Pelai..\n", "publishedDate": "2019-09-06", "language": "en", "rating": 4}, {"id": 704756552, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d208598-r704756552-Plaza_de_Cataluna-Barcelona_Catalonia.html", "text": "This place is very central to barcelona in terms of buses, metro, taxis and often a meeting point for excursions.\n\nI found it useful to familiarise myself with the shops at the corners of the square - it helped to get my bearings when travelling solo!", "publishedDate": "2019-08-30", "language": "en", "rating": 4}, {"id": 703388253, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d208598-r703388253-Plaza_de_Cataluna-Barcelona_Catalonia.html", "text": "It is the departure point of the Hop-on Hop-off bus tours, Aerobus and different tours and close to the Ramblas. The central place reminded me of Place St-Marc in Venise. Just beautiful", "publishedDate": "2019-08-26", "language": "en", "rating": 5}, {"id": 702172196, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d208598-r702172196-Plaza_de_Cataluna-Barcelona_Catalonia.html", "text": "This is a vast piece of landscape in the heart of Barcelona with several nice statues. It is. Here from where the famous La Rambla street commences. The square is surrounded by several branded outlets as well as a huge shopping complex. Tourists can click pictures and rest for a while here. Other than that not much to do.", "publishedDate": "2019-08-23", "language": "en", "rating": 3}, {"id": 698892871, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d208598-r698892871-Plaza_de_Cataluna-Barcelona_Catalonia.html", "text": "This is basically a big square to people watch, take picture, eat, and go shopping. The are a lot of options to offer on all fronts and they also cater to Americans with a lot of american style restaurants. Also a great place for a show.", "publishedDate": "2019-08-14", "language": "en", "rating": 3}, {"id": 698047342, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d208598-r698047342-Plaza_de_Cataluna-Barcelona_Catalonia.html", "text": "This lovely square sits at the top of La Rambla.  So many of the big brand shopping places were around here.  We enjoyed the open space of the square & lovely fountains.  There were lots of street sellers here & even though their fakes were really quite good - it was more entertaining to watch them quickly scoop everything up in one swoop (contained inside the sheet they're laid out on) as soon as Police walked by!!  We lost a good few hours shopping in & around here.", "publishedDate": "2019-08-12", "language": "en", "rating": 4}, {"id": 697438579, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d208598-r697438579-Plaza_de_Cataluna-Barcelona_Catalonia.html", "text": "A square full of statues!\nRambla square ends here, and Passage de Garcia starts here. You may find all local and international brands in these two streets, and there is a Fnac store in the square for those who are interested in electronic devices. \nBarcelona airport bust station is also here and there an information kiosk to help you find the proper line as well as buying tickets.", "publishedDate": "2019-08-10", "language": "en", "rating": 4}, {"id": 697058441, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d208598-r697058441-Plaza_de_Cataluna-Barcelona_Catalonia.html", "text": "Lots of fun in the Center Square! Pretty art, sculptures, fountains, birds, people watching, and nearby restaurants and shopping. Located at the end of La Rambla.", "publishedDate": "2019-08-08", "language": "en", "rating": 5}, {"id": 693994221, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d208598-r693994221-Plaza_de_Cataluna-Barcelona_Catalonia.html", "text": "Plaza de Cataluna is a normal square with lots of people, tourists and a few guys that selling popcorn and other stuff for kids. You will be there if you want to go the most places in Barcelona.", "publishedDate": "2019-07-30", "language": "en", "rating": 4}, {"id": 693721124, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d208598-r693721124-Plaza_de_Cataluna-Barcelona_Catalonia.html", "text": "We walked here from Passeig de Gràcia station, it’s a 5-10 minute walk at a steady pace. A lively and nice area of the city to visit, statues, fountains, beautiful buildings and shops...Lots of photo opportunities.", "publishedDate": "2019-07-29", "language": "en", "rating": 5}, {"id": 693069620, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d208598-r693069620-Plaza_de_Cataluna-Barcelona_Catalonia.html", "text": "Just of the subway and onto this awesome square.  Fed the pigeons and took in the atmosphere.  Great place to get orientated in the city.", "publishedDate": "2019-07-27", "language": "en", "rating": 5}, {"id": 690470001, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d208598-r690470001-Plaza_de_Cataluna-Barcelona_Catalonia.html", "text": "Plaça de Catalunya is a large plaza, surrounded by huge buildings, in central Barcelona. This plaza is considered to be the city's center and the place where the old city and the 19th century-built Eixample (Gothic) meet. Visitors will see many interesting sculptures representative of Noucentisme, Neo-Classicism and different avant-garde movements. The plaza is where five main avenues intersect.  For our purposes, we had structured our walking tour down (North to South) Passeig de Gracia to Placa de Catalunya. We then continued South from Placa de Catalunya along La Rambla. We loved the many statues and the fountain. The giant plaza includes a number of trees and seating, making it a nice place to sit and relax. Definitely worth a look while in Barcelona.", "publishedDate": "2019-07-17", "language": "en", "rating": 4}, {"id": 689024645, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d208598-r689024645-Plaza_de_Cataluna-Barcelona_Catalonia.html", "text": "It's like a hub or a good place to jump off in different directions.\nMany tours and hop on hop off buses use this Plaza. It also joins La Rambla.\nRestaurants and cafes.\nThe plaza itself has statues and fountains and if you're lucky sometimes free entertainment.", "publishedDate": "2019-07-12", "language": "en", "rating": 4}, {"id": 688509156, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d208598-r688509156-Plaza_de_Cataluna-Barcelona_Catalonia.html", "text": "Definitely one of the cutest places we saw in Barcelona. The big water fountain with the statues, give this place all its beauty!", "publishedDate": "2019-07-10", "language": "en", "rating": 4}, {"id": 686467562, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d208598-r686467562-Plaza_de_Cataluna-Barcelona_Catalonia.html", "text": "The Placa de Catalunya is the heart of the city, and is located at the end of La Ramblas,  has many cafes and clubs, and the plaza is definitely a picture stop. All major sightseeing tours can be purchased at the official tourist information center located at the plaza. Typically, if you start a tour, you come here; or if you end a tour, you finish here!", "publishedDate": "2019-07-03", "language": "en", "rating": 5}, {"id": 685790387, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d208598-r685790387-Plaza_de_Cataluna-Barcelona_Catalonia.html", "text": "From here you get all the busses included tourists buses. We walk past it about twenty times during our visit. Nice fountains, just watch out for the bird poo form all the pigeons. Lots of shopping centers around the area. ", "publishedDate": "2019-07-01", "language": "en", "rating": 4}, {"id": 685001558, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d208598-r685001558-Plaza_de_Cataluna-Barcelona_Catalonia.html", "text": "It feels like this plaza is where everyone meets!  Full of gardens, roses, water fountains, statues, people going here and there, buses from the airport, and more!\nOur walking tour met here so we got to spend some time wandering around the plaza to use up some time.  Nice place to people watch.  Lots of pigeons!", "publishedDate": "2019-06-28", "language": "en", "rating": 4}, {"id": 684631824, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d208598-r684631824-Plaza_de_Cataluna-Barcelona_Catalonia.html", "text": "You get a bag of sunflower seeds for 2 euros and feed the pigeons. It was a lot of fun. The pigeons will stand on your arm and hand. The bag lasted quite a while.", "publishedDate": "2019-06-26", "language": "en", "rating": 4}, {"id": 684566959, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d208598-r684566959-Plaza_de_Cataluna-Barcelona_Catalonia.html", "text": "On our first ever visit to Barcelona my wife and I wanted to visit La Rambla as we heard so much about the Famous Street.  It was a nice day and great for walking and sightseeing so we headed to La Rambla and the Plaza de Cataluna area.\n\nFirst off, La Rambla is a gorgeous street with a pedestrian walkway down the middle filled with vendors, and many shops, restaurants, and attractions.  There are two famous Gaudi attractions here also. Where La Rambla begins is where the plaza is situated. It is a huge plaza filled with many monuments, statues, historical attractions, and fountains. The day that we visited the plaza was filled with families with children and hundreds of tourists.\n\nIf you visit Barcelona, and you should, make time to visit La Rambla and the Plaza de Cataluna. There is so much to see and do that you will not be disappointed..In fact you will probably return a second time before you leave Barcelona.", "publishedDate": "2019-06-26", "language": "en", "rating": 5}, {"id": 684373838, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d208598-r684373838-Plaza_de_Cataluna-Barcelona_Catalonia.html", "text": "After a very hot day spent covering all the attractions of Barcelona, we decided to take a break here. It is a very large open space, and the evening breeze felt very calming. Hundreds of tourists and pigeons, kids totally enjoyed feeding the pigeons. Watch out for pick pockets. For some refreshment, we got huge bottles of fresh orange juice from El Corte Inglés on the corner. For the kids - it was the best \"attraction\" of the day.", "publishedDate": "2019-06-25", "language": "en", "rating": 5}, {"id": 683755274, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d208598-r683755274-Plaza_de_Cataluna-Barcelona_Catalonia.html", "text": "After the hubbub and clamour of the Barcelona streets this is a vast space in the city centre with many roads leading onto it. So it is a good meeting place for arrangements made. In fact it is the meeting point for many of the day bus trips - outside the Hard Rock - and fact the airport bus stop is here too.\nDon't let the elderly women prowling the placa with flowers pin one on you unless you want to give them $$$. ", "publishedDate": "2019-06-23", "language": "en", "rating": 3}, {"id": 682274191, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d208598-r682274191-Plaza_de_Cataluna-Barcelona_Catalonia.html", "text": "A great landmark to meet friends at if you're in Barcelona, but also can be a very hectic spot at the height of the Summer. Here you'll find an eclectic mix of friendly street sellers, pigeons galore and people sitting on the benches soaking up the sun. Close by you also have El Corte Ingles (a large department store similar to Selfridges), a Mcdonalds and the huge infamous Apple Store, plus great access to the metro station that takes across Barcelona or onto the FCG train lines.", "publishedDate": "2019-06-17", "language": "en", "rating": 4}, {"id": 681817121, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d208598-r681817121-Plaza_de_Cataluna-Barcelona_Catalonia.html", "text": "This is the main plaza of Barcelona where you can take taxis, busses and more. You just have to visit this beautiful plaza with a lot of pigeons.", "publishedDate": "2019-06-15", "language": "en", "rating": 4}, {"id": 681511072, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d208598-r681511072-Plaza_de_Cataluna-Barcelona_Catalonia.html", "text": "This is the centre of Barcelona. Bus routes, metro lines, tourism buses, and walking routes all lead to Plaza de Catalunya. The large open areas, the numerous fountains, and architecture make this a very attractive site to visit. It is surrounded by several large and impressive buildings, hotels, office blocks and stores. The famous Las Ramblas starts on the south side of the plaza.", "publishedDate": "2019-06-14", "language": "en", "rating": 4}, {"id": 681318459, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d208598-r681318459-Plaza_de_Cataluna-Barcelona_Catalonia.html", "text": "This is a nice large square with an impressive mountain. I find this square to be somewhat one of the central points of the city joining on one side Passeig de Gracia and Rambla de Catalunya and on the other side La Ramblas! Thus a nice stroll circling  around these roads is a must in my opinion admiring amazing architecture along the way amongst which Gaudi's masterpieces of Casa Batlo and La Pedrera and finally ending in La Rambla through the Placa, all a must do!!\n\nFinally the Placa all serves as a transport hub having (i) well connected metro with multiple lines (ii) multiple bus lines (iii) Aerobus shuttle buses towards both airport T1 and T2 with frequent efficient journeys and (iv) Tibidabo shuttle bus (available when amusement park is opened) taking you up the mountain in no time and found at Desigual shop side. \n\nAll in all I highly recommend to visit this famous square and join this with the surrounding impressive streets!", "publishedDate": "2019-06-13", "language": "en", "rating": 4}, {"id": 680205784, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d208598-r680205784-Plaza_de_Cataluna-Barcelona_Catalonia.html", "text": "Bus terminus, taxi ranks, wide open spaces, fountains and gardens are all in this square in the middle of Barcelona. Invariably you will reach this place as all action takes place here.", "publishedDate": "2019-06-09", "language": "en", "rating": 4}, {"id": 678146072, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d208598-r678146072-Plaza_de_Cataluna-Barcelona_Catalonia.html", "text": "Large square surrounded by shops, hotels and restaurants. A lot of walking tours start here as well as busy stops on the hop on hop off buses.\nInteresting monument to Catalonia independence is here as well. La Rambla empties into this square as well.", "publishedDate": "2019-06-01", "language": "en", "rating": 4}, {"id": 676701354, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d208598-r676701354-Plaza_de_Cataluna-Barcelona_Catalonia.html", "text": "This is the physical center of Barcelona and thus a place that you will return to.  Tour buses and Hop-on-Hop-Off come here as a station.  Also a big Metro spot.  Location of the big department store.", "publishedDate": "2019-05-26", "language": "en", "rating": 4}, {"id": 676667539, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d208598-r676667539-Plaza_de_Cataluna-Barcelona_Catalonia.html", "text": "You can't see Barcelona without spending time in Placa de Catalunya!  It's a happening place, and if you are taking a tour in this city, this is the likely place to leave from.  The hustle and bustle of Barcelona is truly evident here!", "publishedDate": "2019-05-26", "language": "en", "rating": 5}, {"id": 676519056, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d208598-r676519056-Plaza_de_Cataluna-Barcelona_Catalonia.html", "text": "Lovely place to sit and watch and take photos BUT ruined by the undesirables who target tourists.BE CAREFUL there.Lots of pigeons and bubbles being blown - do not get distracted by the sights  - be aware its a risky place just like all of Barcelona.", "publishedDate": "2019-05-26", "language": "en", "rating": 3}, {"id": 675989137, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d208598-r675989137-Plaza_de_Cataluna-Barcelona_Catalonia.html", "text": "A cool vibe. LOTS of birds!!!  A good atmosphere right at the heart of the city. Lots of info stands - lovely fountain ", "publishedDate": "2019-05-23", "language": "en", "rating": 4}, {"id": 675815481, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d208598-r675815481-Plaza_de_Cataluna-Barcelona_Catalonia.html", "text": "Be very careful of thieves and pickpockets operating in the area. I had my backpack stolen while seated and eating in a restaurant (bag was placed on a seat next to me). There were 4 of us eating, and somehow they managed to steal it from right under our noses!\n\nIt's hard to avoid this place as the metro lines and las ramblas all connect here. When making a report at the police station, there was a QUEUE of people who had been robbed! Apparently it is quite common in Barcelona and nearly everyone I told this to  (airline staff, immigration officers) seems to know about it.\n\nI suggest leaving your valuables and passports in the hotel safe, and only carrying photocopies out, or at least dividing cash amongst different members of your travelling party. Also, keep soft copies of passports and IDs in an online cloud/email service, just in case you lose everything and have no way of proving your identity.", "publishedDate": "2019-05-22", "language": "en", "rating": 1}, {"id": 675602880, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d208598-r675602880-Plaza_de_Cataluna-Barcelona_Catalonia.html", "text": "This is a very large square at the top of the ramblas.  Lots of impressive statues surrounding the square.  Flanked by major stores and hotels.  You come here to feed the pidgeons ", "publishedDate": "2019-05-21", "language": "en", "rating": 4}, {"id": 675087349, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d208598-r675087349-Plaza_de_Cataluna-Barcelona_Catalonia.html", "text": "This is a major square in the heart of Barcelona city center. \n\nContains water fountains, loads of pigeons, walking people, and surrounded by various public and private buildings including: a big desigual shop, and apple store, and the bank of Spain.\n\nThere is a metro station right in the middle of it with various entrances. \n\nA good place to chill and wander around.", "publishedDate": "2019-05-19", "language": "en", "rating": 4}, {"id": 675043029, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d208598-r675043029-Plaza_de_Cataluna-Barcelona_Catalonia.html", "text": "The square has a couple of really big fountains which are surrounded by lovely shrubs and are really attractive in the bright sunshine. This is the centre of Barcelona with La Rambla leading off in one direction, stops for both airport buses - for both Terminals 1 and 2, and lots of hotels, restaurants etc. The downside was that there were literally hundreds of pigeons on the day we walked through. Worth a quick visit though", "publishedDate": "2019-05-19", "language": "en", "rating": 3}, {"id": 674691161, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d208598-r674691161-Plaza_de_Cataluna-Barcelona_Catalonia.html", "text": "If you had to decide where the centre of Barcelona is, it is probably this huge popular square which is always full of people.\n\nIt is where the old Gothic city and the 19th century city meet, is surrounded by department stores and hotels and has popular fountains where people gather.  \n\nIt connects with many of Barcelona's main streets such as the Ramblas and to nearby attractions such as the Cathedral and the Museum of Contemporary art.\n\nIt's downside is that It is surrounded by traffic - Barcelona is still busy from that viewpoint - and is of course attractive to street traders, though they were not as intrusive as in some other countries. \n\nIt contains many statues, which the tourists pass by but are worth exploring.", "publishedDate": "2019-05-17", "language": "en", "rating": 4}, {"id": 671991121, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d208598-r671991121-Plaza_de_Cataluna-Barcelona_Catalonia.html", "text": "Placa de Catalunya is a stunning Square. We walked to this plaza a number of times during our stay in the city and each time we found it to be a very exciting place. With an area of around 30 000 sqm, it is one of the largest and most important in the city and probably in all of Spain. Several main roads intersect and begin at this point, such as Las Ramblas and Passeig de Gracia. It's a kind of meeting point between the old and the new in the city. It is beautifully adorned with several lovely statues and there are two spectacular fountains as well. Around the Square there are huge and not so huge buildings, and a myriad of shops, including, shopping malls, department stores, restaurants, cafes, souvenir shops and fashion boutiques. This is a place where you can go to enjoy your day and relax at the same time. If you are lucky you can also feed the numerous pigeons that seem to flock there all the time. Many of the city's landmarks are also within close proximity.", "publishedDate": "2019-05-06", "language": "en", "rating": 5}, {"id": 671228411, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d208598-r671228411-Plaza_de_Cataluna-Barcelona_Catalonia.html", "text": "The first place we visited after checking into Barcelona. Walking distance from our hotel. Excellent place to soak in the atmosphere. Lots of people just relaxing in the area, feeding pigeons, sitting by the pond... essentially quite a hub of activity. Las Ramblas starts from this square so one can wander there too.\n\nSpent 3 hours here before going back to the hotel. Visited the place again when we wanted to relax. Also used the metro stop here to go to Camp Nou.\n\nRecommend this place atleast for an evening along with Las Ramblas.", "publishedDate": "2019-05-03", "language": "en", "rating": 5}, {"id": 670776825, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d208598-r670776825-Plaza_de_Cataluna-Barcelona_Catalonia.html", "text": "Plaza de cataluna is a beautiful square with lots to do. Very busy place because you get easy access from the center and there are many beautiful buildings and monuments all around.", "publishedDate": "2019-05-01", "language": "en", "rating": 5}, {"id": 667978820, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d208598-r667978820-Plaza_de_Cataluna-Barcelona_Catalonia.html", "text": "Well placed for accessing many of the sites and one of the main transport hubs at the top of Las Ramblas. It’s has some lovely architecture, statues and of course pigeons to feed for the kids.", "publishedDate": "2019-04-20", "language": "en", "rating": 4}, {"id": 667268200, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d208598-r667268200-Plaza_de_Cataluna-Barcelona_Catalonia.html", "text": "The plaza was opened by King Alfonso XIII in 1927 and covers an area of 5 hectares (12.36 acres). The site was formerly an open piece of land located in front of the gates to the walled city. The architects Pere Falqués, Puig i Cadafalch and Francesc de Paula Nebot were involved in its planning, and it also features sculptures by such well-known artists as Clarà and Llimona. There are six sculptural groups around the plaza: they represent the four Catalan capital cities, wisdom and labour. On one corner of the plaza you can see Josep Maria Subirachs' monument to the president of the Catalan Government, Francesc Macià. When the city was preparing for the 1929 International Exhibition, some of new Barcelona's most luxurious hotels, bars and theatres were built around the plaza. Almost none of them survive, except for the memory of names such as the Maison Dorée, the Colón and the Suís.", "publishedDate": "2019-04-17", "language": "en", "rating": 4}, {"id": 666541486, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d208598-r666541486-Plaza_de_Cataluna-Barcelona_Catalonia.html", "text": "Free.\nVisit Duration: 30 minutes.\nGreat spot Day/night.\nThis is a main stop for the Aerobus (Airport shuttle).\n\nPlaça de Catalunya is a large square in the city centre where most important streets and avenues meet: Passeig de Gràcia, La Rambla...\n\nThis square is known for its proximity to some of Barcelona's most popular attractions,  large shopping centres and department stores.\n\nMany statues dominate the plaza. There are six sculptural groups around the plaza: they represent the four Catalan capital cities, wisdom and labour. An iconic statue of a female figure, The statue, entitled \"La Deessa o l'Enigma\" (The Goddess or the Enigma) is set at the center of a pool.\n\nNot to forget the large circular fountains that are illuminated at night.", "publishedDate": "2019-04-14", "language": "en", "rating": 4}, {"id": 666152305, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d208598-r666152305-Plaza_de_Cataluna-Barcelona_Catalonia.html", "text": "Quite a lovely area, very busy and lively. It’s a central place to walk through to get to las ramblas and heaps of shopping surrounds it.", "publishedDate": "2019-04-13", "language": "en", "rating": 4}, {"id": 664973817, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d208598-r664973817-Plaza_de_Cataluna-Barcelona_Catalonia.html", "text": "It’s a massive square that connects La Rambla to the Passeig de Gracias. There are people there feeding thousands of pigeons. There is a small mall located in the corner and lots of shopping and restaurants around the Perimter. ", "publishedDate": "2019-04-09", "language": "en", "rating": 3}, {"id": 663503260, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d208598-r663503260-Plaza_de_Cataluna-Barcelona_Catalonia.html", "text": "It is a big square where there are a lot of cheeky pigeons. People are  feeding them and take photos of them. I didn’t like these pigeons. I saw square wasn’t so clean because of them. Anyway it is good to stop and sit down on a bench and enjoy sun.", "publishedDate": "2019-04-03", "language": "en", "rating": 3}, {"id": 662560336, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d208598-r662560336-Plaza_de_Cataluna-Barcelona_Catalonia.html", "text": "Close to our hotel, picturesque and a huge population of very friendly pigeons. A big hit with my adult children and wife. ", "publishedDate": "2019-03-31", "language": "en", "rating": 5}, {"id": 662296562, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d208598-r662296562-Plaza_de_Cataluna-Barcelona_Catalonia.html", "text": "Just beautiful. People sitting around, relaxing and enjoying the sun. My personal favourite was the pigeons, there must be thousands. They are very used to people and will even eat out of your hands. There are three little stalls that sells bird seed as well as snacks. ", "publishedDate": "2019-03-30", "language": "en", "rating": 4}, {"id": 661900269, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d208598-r661900269-Plaza_de_Cataluna-Barcelona_Catalonia.html", "text": "Not overly crowded like some of the plazas in Madrid.\nMany pigeons being fed.\nBig el Corte Ingles department store as we as the major metro station if the city.\nPlus a real bus hub.", "publishedDate": "2019-03-28", "language": "en", "rating": 3}, {"id": 661517695, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d208598-r661517695-Plaza_de_Cataluna-Barcelona_Catalonia.html", "text": "The park is full of pigeons. So many tourists are assemble here for buses and transit to other places.\nI feel lucky that I didn't choose my hotel stay around here. I do want to relax for my holidays. This is not ideal for us.", "publishedDate": "2019-03-26", "language": "en", "rating": 3}, {"id": 660791144, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d208598-r660791144-Plaza_de_Cataluna-Barcelona_Catalonia.html", "text": "Just a short brisk walk, approx 12 minutes from the Gothic Quarters a new adventure awaits! This Park is great. Located in the center of everything,  your able to immediately see a different part of of the city. A more upscale residential area, beautiful carved statues, art, a beautiful waterfall and of course lots of nature as well as pigeons. Many come to feed the pigeons and spend an afternoon relaxing in a clean,  nice upscale part of the city. Just a few steps away there’s Tiffany, Rolex and Broni to name a few places to shop and stroll. You can even grab a tour bus at this location to sight see. Perfect get away from. ", "publishedDate": "2019-03-24", "language": "en", "rating": 5}, {"id": 659587026, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d208598-r659587026-Plaza_de_Cataluna-Barcelona_Catalonia.html", "text": "We made our first trip to Barcelona a couple of months ago.  We did our research and decided to get a hotel near Plaza de Cataluna.  Good idea.  Each day we'd begin our journey at Plaza de Cataluna walking La Rambla toward the sea.  The combination of architecture, art, restaurants, shopping, open air markets and people watching was superb.  We went to all the major tourist attractions but invariably returned to Plaza de Cataluna at least once a day because, in our opinion, it is the all-inclusive destination in Barcelona. To illustrate, there was a taxicab strike during our stay.  The taxicab drivers chose Plaza de Cataluna as the place to assemble in protest.  Likewise, thousands of Venezuelans marched in protest to Madura which culminated at Plaza de Cataluna.  If, you want to experience the unmatched vibrancy of Barcelona, go to Plaza de Cataluna. ", "publishedDate": "2019-03-19", "language": "en", "rating": 5}, {"id": 659584633, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d208598-r659584633-Plaza_de_Cataluna-Barcelona_Catalonia.html", "text": "Walk from the Christopher Columbus statue, along La Rambla to Plaza Catalunya.  A nice easy stroll in the sunshine, with lots to see.  Living statues, beautiful stalls selling all manner of wares.  Buy churros and chocolate to eat and watch the world go by in the Plaza.  Barcelona is a major stopping point for cruise ships.  Take a hoho bus and see all the sights if it's your first visit.", "publishedDate": "2019-03-19", "language": "en", "rating": 4}, {"id": 659530725, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d208598-r659530725-Plaza_de_Cataluna-Barcelona_Catalonia.html", "text": "What a crazy square is this with thousands of pigeons competing for food from people, even directly from their hands.  This was a highlight of our trip, many pictures and videos I will cherish.", "publishedDate": "2019-03-19", "language": "en", "rating": 4}, {"id": 658644972, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d208598-r658644972-Plaza_de_Cataluna-Barcelona_Catalonia.html", "text": "The place to start your Las Ramblas walk.  Plaça de Cataluna is on a busy metro intersection so easy to get to.  A wonderful ornate park square complete with fountains and statues.  Places to sit and watch life + surrounded by shops and places to eat.", "publishedDate": "2019-03-15", "language": "en", "rating": 5}, {"id": 658379065, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d208598-r658379065-Plaza_de_Cataluna-Barcelona_Catalonia.html", "text": "Big Square with two fountains - looks much better in the night, if you are not interested in Barcelona history you can skip it", "publishedDate": "2019-03-14", "language": "en", "rating": 3}, {"id": 658295441, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d208598-r658295441-Plaza_de_Cataluna-Barcelona_Catalonia.html", "text": "This is the hart of Barcelona from this plaza start the \"la rambla\"..\nDown you can find big turrist information ", "publishedDate": "2019-03-13", "language": "en", "rating": 5}, {"id": 658059925, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d208598-r658059925-Plaza_de_Cataluna-Barcelona_Catalonia.html", "text": "This is one of the places that will help you locate where you are. It has metro stops right there on it. It is also a stop for many of the public transportation that can take you around the city. You can also catch the bus to the airport from here. There is the beginning of the Rambla on one side of the Plaça. In the evenings the fountains are lit up.", "publishedDate": "2019-03-12", "language": "en", "rating": 5}, {"id": 657958465, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d208598-r657958465-Plaza_de_Cataluna-Barcelona_Catalonia.html", "text": "Its place just for a short walk or coffee at one of the street caffes, crowdy, noisy, only for shopping.", "publishedDate": "2019-03-12", "language": "en", "rating": 4}, {"id": 657103444, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d208598-r657103444-Plaza_de_Cataluna-Barcelona_Catalonia.html", "text": "Big busy square with fountains, sculptures and lovely architecture around, okay to take a rest and people watch for a while but spoilt by yet more hawkers and beggars.", "publishedDate": "2019-03-07", "language": "en", "rating": 3}, {"id": 656838356, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d208598-r656838356-Plaza_de_Cataluna-Barcelona_Catalonia.html", "text": "It is a big plaza, mostly empty space but it’s nice if you wanna just sit and take everything in. There is a shopping center near by and also a metro stop.", "publishedDate": "2019-03-06", "language": "en", "rating": 3}, {"id": 656265226, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d208598-r656265226-Plaza_de_Cataluna-Barcelona_Catalonia.html", "text": "Not much too see here, but still a nice atmosphere with all kinds of people enjoying the hot warm sun.", "publishedDate": "2019-03-04", "language": "en", "rating": 3}]}}]