[{"locationId": 8685995, "name": "Casa Damians", "placeType": "ATTRACTION", "reviewListPage": {"reviews": [{"id": 545689566, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d8685995-r545689566-Casa_Damians-Barcelona_Catalonia.html", "text": "Great shopping in Barcelona, lots of choices but more than that the buildings themselves are fabulous.", "publishedDate": "2017-12-06", "language": "en", "rating": 3}, {"id": 474685147, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d8685995-r474685147-Casa_Damians-Barcelona_Catalonia.html", "text": "It's a nice building with a remarkable dome on top. You get those a dime a dozen in Barcelona. Yes it's nice, but if every building with a beautiful façade gets to have its own entry on TA, no one would be able to see the city map under the gazillions of markers. There is no visiting of the building except from the  C&A downstairs, which is far from a tourist attraction. The building is 30 metres off Plaça Catalunya so it's not like you need to commute somewhere to see it. I don't even know why this gets its own entry here.", "publishedDate": "2017-04-11", "language": "en", "rating": 3}, {"id": 381375981, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d8685995-r381375981-Casa_Damians-Barcelona_Catalonia.html", "text": "I went to buy some shirts and summer clothes and find something interesting at a good price as usually for this German fashion brand. This shop is huge and very central, very close to Catalonia square (Barcelona city centre). \nEs una tienda amplia y céntrica. muy bien ubicada justo al lado de Plaça Catalunya en Barcelona. Se encuentra ropa tanto para mujer, hombre como para niños de buena relación calidad-precio de la marca alemana c-and-a. ", "publishedDate": "2016-06-10", "language": "en", "rating": 4}, {"id": 355905627, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d8685995-r355905627-Casa_Damians-Barcelona_Catalonia.html", "text": "Popular fashion shop center near Ramblas and Plaça Catalunya. There´re casual wear for woman and man on ground and first floor.", "publishedDate": "2016-03-15", "language": "en", "rating": 4}, {"id": 331531370, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d8685995-r331531370-Casa_Damians-Barcelona_Catalonia.html", "text": "Casa Damians comes in some of the very known hotels in the Barcelona. When I came there first time and I find this place excellent in many ways. It is amazing from food to decoration and decoration to hospitality service. I just love it. ", "publishedDate": "2015-12-08", "language": "en", "rating": 5}]}}]