[{"locationId": 244218, "name": "Poble Espanyol", "placeType": "ATTRACTION", "reviewListPage": {"reviews": [{"id": 755544877, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d244218-r755544877-Poble_Espanyol-Barcelona_Catalonia.html", "text": "Really good time walking around this mini village, learned lots and worth a visit. It’s very pretty and lots of different architectural styles of builds in Spain. ", "publishedDate": "2020-05-28", "language": "en", "rating": 4}, {"id": 751939445, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d244218-r751939445-Poble_Espanyol-Barcelona_Catalonia.html", "text": "Poble Espanyol (Spanish Village) is an open-air museum of 117 replicas of typical houses in Spain.  See craftsmen in their traditional work, sample the local cuisine in restaurants and see related multimedia shows.  It allows the visitor to experience the cultural diversity of the country spread over 50,000 square meters.\nPoble Espanyol was built for the 1929 World Fair in Barcelona.  It was designed by Puig i Cadafalch.  Since 2001, the Fran Daurel Museum of Contemporary Art has been part of Poble Espanyol.  This open-air museum is built like an Iberian village with typical houses, small streets, a town hall, schools, shops and restaurants, even a monastery in a typical Mediterranean atmosphere.\nIn the visitor reception area, there are 8 large interactive screens which inform visitors about Poble Espanyol.  Another multimedia area permits visitors to experience 5 different regions of the country, typical landscapes, typical noises, typical scents.\nThe multimedia project \"Fiestas\" - a 150 square meters area, where important cultural customs and festivals are presented – e.g. Semana Santa in Andalusia and the Castells, the human towers in Catalonia.\nMuseum Fran Daurel has over 300 art works by Picasso, Salvador Dalí and Joan Miró.  It also has a sculpture garden.\nWatch craftsmen in 20 traditional factories produce unique products every day, including leather goods, jewelery and guitars.  During summer, events and concerts take place in the evenings and on weekends.\nOpen daily - Mon, 0900-2000 hrs; Tue – Thurs, Sun, 0900-2400 hrs; Fri, 0900-0300; Sat, 0900-0400 hrs.  60 min Audio guide in English; available from 0900-1900 hrs; €3.50.  A €20 deposit will be required.\nNearest Metro stop - Espanya Station (Line 1, Line 3) and Bus stop - Poble Espanyol (Lines 13, 23, 150).  Budget 2 hours to see.", "publishedDate": "2020-03-28", "language": "en", "rating": 4}, {"id": 751313882, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d244218-r751313882-Poble_Espanyol-Barcelona_Catalonia.html", "text": "It was a bit disappointing experience because a lot of the shops were closed for vacation. It wasn't mentioned on their website, you were only told when you got there. Most of the shops inside where closed so we missed half the experience because they are said to represent the whole atmosphere of the thing. As a compensation to that, you got the audio guide for free - however the audioguide isn't that expensive so the compensation wasn't of any importance. \nNow to the visit: It is a nice experience for everyone to see the architectural style of many places in spain. You also get to see a multimedia production about the history of the places in Spain which is helpful as well.  Nothing other than that. If you do get to go, buy the combined ticket for MNAC - it's worth the discount.", "publishedDate": "2020-03-18", "language": "en", "rating": 3}, {"id": 750329022, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d244218-r750329022-Poble_Espanyol-Barcelona_Catalonia.html", "text": "This place was empty and depressing. Perhaps it’s due to COVID-19. Basically a knock off of Epcot. Skip it.", "publishedDate": "2020-03-10", "language": "en", "rating": 1}, {"id": 750296948, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d244218-r750296948-Poble_Espanyol-Barcelona_Catalonia.html", "text": "Poble Espanyol is an attempt to recreate a \"town\" which has traditional elements from all major regions of Spain. Built in 1929 for an exposition, this museum of sorts consists of exhibitions, buildings, narrow alleys, restaurants with enough information about tradition and the area of Spain they represent. While it is open until 3 am with discounts for entries at night, try visiting a little earlier to ensure exhibitions and cafes are open for you to indulge. Not a must-do, but definitely worth visiting if one is in the area and has a couple of hours to spare.", "publishedDate": "2020-03-10", "language": "en", "rating": 4}, {"id": 746073306, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d244218-r746073306-Poble_Espanyol-Barcelona_Catalonia.html", "text": "We spent a wonderful afternoon (it is opened late in the night) - beside the houses, narrow streets representing the majority of Spain regions, food, drink - what I consider to be very interesting are the small workshops where you can enter and not only buy but you can see how things are handmade - you can see how glass can take different shapes and colours, you can see how leather takes shape, elder ladies knitting and a lot of other traditional activities. The craftmen were so polite and eager to explain, nice tailoring workshops. A nice place in Barcelona!", "publishedDate": "2020-02-19", "language": "en", "rating": 4}, {"id": 743594845, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d244218-r743594845-Poble_Espanyol-Barcelona_Catalonia.html", "text": "We visited this place in February so there weren't lot of tourists. Place is really amazing, speechless. Atmosphere is lovely, streets are beautiful. Tickets is a little bit expensive, we paid 14 euros per person. ", "publishedDate": "2020-02-07", "language": "en", "rating": 5}, {"id": 743551141, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d244218-r743551141-Poble_Espanyol-Barcelona_Catalonia.html", "text": "We hopped off at this point of interest from the City Bus tour, thinking we'd walk around a bit and look. Did NOT expect a fee of $14 € each to look around. The Barcelona City Tour didn't say anything about an entrance fee. Very disappointing. Did not go inside to look at all.", "publishedDate": "2020-02-07", "language": "en", "rating": 1}, {"id": 743250190, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d244218-r743250190-Poble_Espanyol-Barcelona_Catalonia.html", "text": "We visited start of February so the place was fairly quiet, but it doesn't make it less attractive. \nThe set up reminds me of a film studio, with various buildings in different styles so close to each other. \nWe thought a gem was at the back of the place near the little church - beautiful view of Barcelona, lovely big trees with lots of parrots in.\nThere is also a nice picnic spot at the back. \nWe had a nice paella in one of the restaurants that were open.\nCan only recommend for a day out and will definitely return again.", "publishedDate": "2020-02-05", "language": "en", "rating": 5}, {"id": 742244200, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d244218-r742244200-Poble_Espanyol-Barcelona_Catalonia.html", "text": "Worst invested 14 euros and worst spent time in barcelona, the place is dead, most of the locals closed, buildings look made of paper, it is an awful fake caricature of Spain, even offensive. On top of that a brown giant rat appeared in one of the constructions we entered. Do not go there, you are welcome!", "publishedDate": "2020-01-31", "language": "en", "rating": 1}, {"id": 735120422, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d244218-r735120422-Poble_Espanyol-Barcelona_Catalonia.html", "text": "What a great way to kill a couple of hours than wandering slowly through the various styles of Spanish architecture in this village built for the 1920's Exposition.\nThere are plenty of cafes and restaurants to choose from and there are lots of artisan craft shops selling food ,drink clothes and gifts .The modernist Fran Daurel museum was an excellent bonus to the visit . It was quiet when we were there in mid October but Ive been told it can get very busy in mid summer so probably come early", "publishedDate": "2019-12-28", "language": "en", "rating": 5}, {"id": 732255122, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d244218-r732255122-Poble_Espanyol-Barcelona_Catalonia.html", "text": "If Poble Espanyol were a pavillion at Epcot in Disneyworld, it would occupy a space as large as Epcot itself. The Poble features restaurants, souvenir shops, artisan stores, and exhibits representing all the major Spanish provinces. Set in a park-like and hilltop area of Barcelona, it also offers a magnificent view of the city.  Be sure to visit the replica of a medieval monastery - reminiscent of the Cloisters in New York City. The monastery is surrounded by a wooded area with many parrots nesting in the trees. There is a modest admission price. The Poble Espanyol can be accessed by public transportation or taxi. If you feel up to it, it's an interesting one-hour walk from Barcelona's most famous avenue - La Rambla.", "publishedDate": "2019-12-12", "language": "en", "rating": 5}, {"id": 731789709, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d244218-r731789709-Poble_Espanyol-Barcelona_Catalonia.html", "text": "It was comfy and really enjoyable, especially for those interested in history.             \nAudioguide us helpfull don’t miss it when u go in", "publishedDate": "2019-12-10", "language": "en", "rating": 4}, {"id": 731568383, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d244218-r731568383-Poble_Espanyol-Barcelona_Catalonia.html", "text": "A very nice place to visit and spend a couple of hours. You can see the differences between regions from Spain. Very beatifull experience. ", "publishedDate": "2019-12-09", "language": "en", "rating": 5}, {"id": 725023835, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d244218-r725023835-Poble_Espanyol-Barcelona_Catalonia.html", "text": "Wonderful atmosphere as you walk through the old village to a feel of the ancient Spanish town. Shops, restaurants, museums and monastery replica. See Barcelona from a bird eye view. Spanish people start late to have all the activities.", "publishedDate": "2019-11-08", "language": "en", "rating": 5}, {"id": 724195352, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d244218-r724195352-Poble_Espanyol-Barcelona_Catalonia.html", "text": "We stumbled upon this lovely spot on our way from Montjuïc Fountain in the evening so the shops had already closed and the place is very quiet, which is great for us to enjoy the alleys and corners just for ourself. It is such a beautiful place to stroll along and to take pictures that we decided to come back to see the ambience during day time. You can buy souvenirs from the little shops. Alternatively, we can attend some festivals or other events held on this venue.To some it may not be such an interesting place to visit but to us it's really stunning. Really enjoy strolling along this little Spanish village. ", "publishedDate": "2019-11-05", "language": "en", "rating": 4}, {"id": 723043694, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d244218-r723043694-Poble_Espanyol-Barcelona_Catalonia.html", "text": "Climbed aboard Hop on/off bus at WTC.\nFirst stop con bano was #10.  Got off there.   Paid maybe 18 Euros to gain site access where public toilet was located.  Had no advance info on what, where, or why (other than bano) we would want to visit. But, nature was calling.\n\nSpent several hours there, great staff and interesting venue.   Also, free wi-fi, valuable when traveling abroad.  They are well equipped to host major events.  \n\nProbably would have enjoyed it more if we had done our research and actually planned to go there.  😊", "publishedDate": "2019-11-01", "language": "en", "rating": 4}, {"id": 721703338, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d244218-r721703338-Poble_Espanyol-Barcelona_Catalonia.html", "text": "It has so much history that one can spend so much time just walking around. We went to a restaurant with a live show of Famenco which was super.", "publishedDate": "2019-10-27", "language": "en", "rating": 5}, {"id": 718989925, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d244218-r718989925-Poble_Espanyol-Barcelona_Catalonia.html", "text": "We enjoyed spending a couple of hours wandering through this recreation of the regions of Spain. We liked looking at the different shops and restaurants. Yes, it's totally a tourist trap, but not a bad way to spend a couple of hours. We also enjoyed visiting the art museum.", "publishedDate": "2019-10-16", "language": "en", "rating": 4}, {"id": 718674634, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d244218-r718674634-Poble_Espanyol-Barcelona_Catalonia.html", "text": "Words cannot describe how stunning this place is. It was relatively quiet when we visited and very relaxing. The detail put into the buildings in each of the areas representing regions of Spain is wonderful and extremely beautiful. On arrival they tell you about a short 10 minute film you can see at the Fiesta area; go see it,it is well worth it. Lovely little shops with local artists and unique pieces. Plenty of restaurants within. A great way to spend some time in Barcelona- do not miss it!", "publishedDate": "2019-10-15", "language": "en", "rating": 5}, {"id": 717297834, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d244218-r717297834-Poble_Espanyol-Barcelona_Catalonia.html", "text": "We went on a trip from cruise ship... total waste of time.  Nothing of interest, would be ok for Spanish school trips learning about their country. Passed a great view point en route which would have been a better stop on our trip.  \nAnd you have to pay to get in!! ", "publishedDate": "2019-10-11", "language": "en", "rating": 1}, {"id": 717233397, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d244218-r717233397-Poble_Espanyol-Barcelona_Catalonia.html", "text": "We had a stop at one of the restaurants inside Poble Espanyol.  This tourist attraction is not a popular destination for tourists in Barcelona. Being able to visit the place is a definite bonus for our tour.  The visit to the Poble Espanyol of Barcelona is organized in four large geographical areas that do not follow a political division but rather cultural territory: The Mediterranean, The North, The Center, and The South.  In each of these areas you will find an immersive audiovisual space with which you will enter the traditions, gastronomy and landscapes of the area where you are.  The builders wanted to recreate in Montjuïc the 'ideal Spanish town'. And for that, they toured 1,600 towns across the country. Thus they managed to capture the essence of traditional architecture: the typical Andalusian neighborhood, alleyways, the main square, the town hall and even a Catalan Romanesque monastery. The result is what you can admire today in our enclosure.\n\nThe Poble Espanyol in Barcelona is also a unique craft center. It is the only place in Barcelona where you can see more than 20 artisans making daily unique and exclusive pieces of leather, glass, jewelry, ceramic and even Spanish guitars. We came and enjoyed architecture, crafts, art, traditions ... the soul of Spain in just over an hour.", "publishedDate": "2019-10-11", "language": "en", "rating": 5}, {"id": 717079705, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d244218-r717079705-Poble_Espanyol-Barcelona_Catalonia.html", "text": "This is an arteficial miniSpain. If you really do not have any more idea to spend the time, visit this. But if you have not so much time, just skip it.", "publishedDate": "2019-10-10", "language": "en", "rating": 2}, {"id": 715363780, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d244218-r715363780-Poble_Espanyol-Barcelona_Catalonia.html", "text": "Spanish Village provides a flavor and architecture of each of the major regions of Spain.  It is mainly from scale reproductions of actual residences or businesses in the various regions, and from shops displaying the regions' various cultural products. It's a decent way to see in one place the diversity within Spain.", "publishedDate": "2019-10-04", "language": "en", "rating": 4}, {"id": 712343996, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d244218-r712343996-Poble_Espanyol-Barcelona_Catalonia.html", "text": "Excellent. It was not at all crowded -there were just a few people wandering around the lovely little alleyways as well as the large square in the centre. We found an excellent shop where we bought Sangria, Balsamic cream in various flavours, sausage etc. and another small shop where metal ornaments were hand crafted on the premises.The Hop on Hop Off bus stopped right outside opposite the entrance which was flanked by two giants.", "publishedDate": "2019-09-23", "language": "en", "rating": 5}, {"id": 712290304, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d244218-r712290304-Poble_Espanyol-Barcelona_Catalonia.html", "text": "What an absolutely fantastic venue to hold a rave/party… it had an amazing sound system, the surroundings were stunning and the bar system worked perfectly! \n\nI hate when you go to a rave and have to queue to pay for tokens then queue separately to get a drink but here it was just a pay when needed system which worked really well. There was also food and speciality drinks trucks in the top area. \n\nThe toilets were reasonable and never much of a queue. They were well prepared for the amount of people they were hosting. \n\nThere is a main area which is huge and a separate room which is smaller for the smaller acts but both were amazing. \n\nThere are a lot of pick-pockets that operate in the area (Barcelona in general) so beware of this when visiting and keep your bags and personal belongings close. \n\nOverall we had a great visit and would head back to Off-Sonar next year.", "publishedDate": "2019-09-23", "language": "en", "rating": 5}, {"id": 711126297, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d244218-r711126297-Poble_Espanyol-Barcelona_Catalonia.html", "text": "For the price of €16 each, it was quite expensive for what we wanted. As we went in September, I felt that maybe a lot of the shops and stores inside were closed because it was out of season? A big disappointment. But the places that were open were a joy to visit and really interesting. Great for learning more about Spain and inspire you for your next holiday of places you'd like to visit. I know I want to do more of the Mediterranean sea and the south as I love the architecture and the food.\n\nBut overall, we left feeling very underwhelmed and disappointed we had spent so much to get in. Although, I like the idea and I'd love the UK to do something similar.", "publishedDate": "2019-09-19", "language": "en", "rating": 3}, {"id": 710761664, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d244218-r710761664-Poble_Espanyol-Barcelona_Catalonia.html", "text": "It said online you could do this at night. Technically it's open, but it should be closed. Every single store is closed, there's no signage to read. It's basically walking through a village. It's pretty, but kind of eerie when you're all alone in the dark. Go during the day, maybe it's better. ", "publishedDate": "2019-09-17", "language": "en", "rating": 3}, {"id": 703182807, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d244218-r703182807-Poble_Espanyol-Barcelona_Catalonia.html", "text": "The site overall was made for the purpose of Barcelona Olympics, to get to know the multi culture of Spain at one stop.\nThe venue is on the hill. Not too busy but not so many to see.\nThe restaurant we booked had Flamenco performance which was amazing. This is worth visiting. I assume you need to book in advance.", "publishedDate": "2019-08-26", "language": "en", "rating": 4}, {"id": 702187118, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d244218-r702187118-Poble_Espanyol-Barcelona_Catalonia.html", "text": "If you want to know the full geography and history of Spain,  I'll encourage you to visit poble español. \nTake the audio guide which takes around an hour and 30 min , and start exploring. \nPlus there are plenty of restaurants, clothes, jewellery  and gift shops . I wanted to try churros and had them with cold chocolate which was nice.\n\nAnother thing you will get a panoramic view to barcelona from there in front of the church.\n\nAnd the way I made it was went first to the telephric, or what they call the cable cars, then poble espanyol by bus or walking, then walked to plaza España .\nThe route was easy and it was loads of fun.", "publishedDate": "2019-08-23", "language": "en", "rating": 5}, {"id": 698236367, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d244218-r698236367-Poble_Espanyol-Barcelona_Catalonia.html", "text": "poor activity in that place, we thought we will find more authentic Spanish atmosphere , music , street preforms , the buildings are made nice , some of the shops were okay and some seemed irrelevant to the place! \n\nWe went twice once after 8PM all shops were closed and the place was empty the 2nd time we went earlier and they had an AC DC & Queens concert we were expecting something more Spanish!!", "publishedDate": "2019-08-12", "language": "en", "rating": 3}, {"id": 697198102, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d244218-r697198102-Poble_Espanyol-Barcelona_Catalonia.html", "text": "This is a very pretty area showcasing the different areas of Spain. The multimedia experience was excellent, showing the best of Spanish culture. There are a number of artisanal shops and experiences inside (e.g. pottery demonstrations and glass blowing). \nThis could become a very expensive day out as the products in the shops are quite expensive and you have already paid an entrance fee. \nPoble Espanyol is on Montjuic and is served by a service bus and Barcelona Bus Turistic.", "publishedDate": "2019-08-09", "language": "en", "rating": 4}, {"id": 697039323, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d244218-r697039323-Poble_Espanyol-Barcelona_Catalonia.html", "text": "I found this place to be quaint and just plain beautiful.  I loved the architecture and the scenery from the top is amazing.  Great place for pictures with the family showcasing all the different types of architecture.  The shops and people were great!  We got there around 11am and felt like we had the place to ourselves.", "publishedDate": "2019-08-08", "language": "en", "rating": 5}, {"id": 695277322, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d244218-r695277322-Poble_Espanyol-Barcelona_Catalonia.html", "text": "Read the write-up and was looking forward to visiting. When we got there, however, we found half the places inside closed or with limited access due to a concert and the remainder had overpriced merchandise (most of which could be found in town) or food. Everything about the place felt commercial, not authentic, and the focus seems to be more on other events as promo’d on their website. ", "publishedDate": "2019-08-03", "language": "en", "rating": 2}, {"id": 694922259, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d244218-r694922259-Poble_Espanyol-Barcelona_Catalonia.html", "text": "When even two months isn’t enough to see ALL of Spain, Barcelona’s Poble Espanyol is an open-air museum with 117 buildings showcasing the diversity of Spain’s regional architecture —even if it was “manufactured” for the 1929 Exposition.", "publishedDate": "2019-08-02", "language": "en", "rating": 5}, {"id": 693998501, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d244218-r693998501-Poble_Espanyol-Barcelona_Catalonia.html", "text": "The experience from Poble Espanyol, in general, wasn't the expected. There were a lot of constructions inside and if you wanted to buy a ticket you wouldn't get the best customer service from the staff. Hope this will change soon because the place worths it.", "publishedDate": "2019-07-30", "language": "en", "rating": 3}, {"id": 693121267, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d244218-r693121267-Poble_Espanyol-Barcelona_Catalonia.html", "text": "This Spanish Village was built in 1929 for the Barcelona Expo.  It was supposed to be demolished immediately after the Expo, but it ended up to make this Spanish Village as a tourist destination.  Keeping a true reflection of traditional Spanish architecture and the culture of the Spanish people.", "publishedDate": "2019-07-27", "language": "en", "rating": 4}, {"id": 690334201, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d244218-r690334201-Poble_Espanyol-Barcelona_Catalonia.html", "text": "Needless to say a good visit ruined. We came to visit with my family in July 2019. We spent 20 minutes trying to by the tickets with staff directing us between the ticket office and the gates. Most shockingly the staff does not know how to help buy tickets online and the system seems obsolete. Otherwise, the visit was less memorable than expected with extensive constructions in the middle of the plaza. Looks like naive tourist trap (we found us count as such). Why let tourists in if you have major construction? ", "publishedDate": "2019-07-17", "language": "en", "rating": 1}, {"id": 690222070, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d244218-r690222070-Poble_Espanyol-Barcelona_Catalonia.html", "text": "Brilliant idea to reunite replicas of famous Spanish monuments from other regions of Spain all in one little village. Super cute little old town in the Montjuic part of Barcelona. And the ambiance is great, lots of little restaurants and bars and boutiques. Loads of little alleyways and cute shops to see there.  I  can very much recommend if your in the area.", "publishedDate": "2019-07-16", "language": "en", "rating": 5}, {"id": 684989228, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d244218-r684989228-Poble_Espanyol-Barcelona_Catalonia.html", "text": "Perhaps my expectations were higher, but we didn't like Poble Espanyol. We entered with evening tickets (half price) around 7:30 PM and most of the shops were closed. At the same time most of the restaurants were not open yet. We had a dinner in restaurant and all we ate was far from delicious. However it was nice to have a walk around. It was very quiet and not crowded.", "publishedDate": "2019-06-28", "language": "en", "rating": 3}, {"id": 684768109, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d244218-r684768109-Poble_Espanyol-Barcelona_Catalonia.html", "text": "If your visiting Barcelona take time to visit Poble Espanyol as it it over 100 real replica building of different areas and aspects of Spain bringing together all of Spain in what is just an incredible experience.", "publishedDate": "2019-06-27", "language": "en", "rating": 5}, {"id": 684356050, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d244218-r684356050-Poble_Espanyol-Barcelona_Catalonia.html", "text": "The Spanish Village has displays of various architecture from all regions of Spain....showrooms showcasing artists at work and various items for sale.  The pricing was decent and it was a lovely day of wandering and they sometimes have concerts in the square in the evening.\n\nWe made some good, different purchases.", "publishedDate": "2019-06-25", "language": "en", "rating": 5}, {"id": 683224498, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d244218-r683224498-Poble_Espanyol-Barcelona_Catalonia.html", "text": "In some respects this is Disneyland for adults; no rides or characters, but all the buildings are reproductions,  They are now however some 90 years old and represent the different regions of Spain.\n\nLike Disneyland they are charming but artificial; unlike Disneyland they are intended to convey a flavour of the regional elements of architecture.  Compared with the energy of Las Ramblas, a visit to Poble Espanyol is much more restful and you can stroll around without fear of being cut off from the rest of your party by an endless crocodile of  tour parties.  Here you can relax, have a wide variety of restaurants and shops to add to the scenic attractions.\n\nOne guide book described the souvenirs on sale as \"cheesy\";.  Well if you want real cheese then it is available, but so too are craft items of an altogether more individual quality made by artisans not chinamen!\n\nThere are some great views to be had too!\n\nTourist buses stop right outside and entr prices are reasonable.", "publishedDate": "2019-06-21", "language": "en", "rating": 4}, {"id": 683190530, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d244218-r683190530-Poble_Espanyol-Barcelona_Catalonia.html", "text": "We felt that the admission fee (€9 per person, which may have been a seniors rate) was excessive for what was there. It is basically a retail centre with shops/ cafes/ restaurants, built to represent the various architectural styles in different regions of Spain. There were a couple of museums/ galleries but overall it was poor value for money. ( We visited on route of the Bus Turistic which stops just outside). Not very accessible for wheelchair / buggy users as there are lots of steps.", "publishedDate": "2019-06-21", "language": "en", "rating": 2}, {"id": 683006674, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d244218-r683006674-Poble_Espanyol-Barcelona_Catalonia.html", "text": "Basically it is a shopping mall with numerous tourist shops and restaurants, but to enter you have to pay 14 euro per adult. Nothing interesting, really wanted to ask for my money back. Feels like I was cheated. Shame on you, owners! The entrance must be free of charge, but even in that case I would not recommend waisting your time there!", "publishedDate": "2019-06-20", "language": "en", "rating": 1}, {"id": 682178054, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d244218-r682178054-Poble_Espanyol-Barcelona_Catalonia.html", "text": "Just got through visiting Poble Espanyol with my wife today. It was our first trip there and I had read the reviews. All in all a somewhat interesting look at the various architectural styles of Spanish buildings throughout Spain. One issue is that all the various styles are a bit mixed together so even though we had an audio guide, it was sometimes hard to tell just what building belonged to what region.\n\nThere were a lot of small stores and although many reviewers said they thought it was a rip off, you don’t have to buy anything at all. Without the little shops to add some color to the place, it might be a bit of a dead place. We bought the tickets on-line just a few hours before visiting and were able to save some money over the entrance fee at the gate.\n\nOnce through was enough in our opinion - there are many more places to visit in Barcelona!", "publishedDate": "2019-06-17", "language": "en", "rating": 3}, {"id": 681922189, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d244218-r681922189-Poble_Espanyol-Barcelona_Catalonia.html", "text": "So enjoyed our visit to this ‘Spanish Village’ would recommend. Lots of lovely little unique artisan shops and delicious food places.  Some items expensive but individual and hand made. Just fabulous we had a perfect day there. ", "publishedDate": "2019-06-16", "language": "en", "rating": 5}, {"id": 680422078, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d244218-r680422078-Poble_Espanyol-Barcelona_Catalonia.html", "text": "There are so many other interesting things to do, so don't waste your time on this. It is an interesting idea but it could be so much better and complete. Maybe it's better on a weekend?", "publishedDate": "2019-06-10", "language": "en", "rating": 1}, {"id": 679729275, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d244218-r679729275-Poble_Espanyol-Barcelona_Catalonia.html", "text": "Hands down the worst part of our whole 4 week European vacation. Outrageously expensive just to go into a bunch of shops and restaurants with a few little movies in between. We visited because I read it had children’s activities on the weekends, puppet shows etc but we went on a Sunday and there was NOTHING. Total waste of time and money. Tourist trap at its finest. ", "publishedDate": "2019-06-07", "language": "en", "rating": 1}, {"id": 678903352, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d244218-r678903352-Poble_Espanyol-Barcelona_Catalonia.html", "text": "If you go, do it at the end of the day on a weekend to experience the bar/restaurant themes in full swing. Overall, it is \"all right\" but not a \"must see\", more like a a nice second rate Epcot recreation of some sights in Spain. It took me a couple of hours to visit. The pavilions represent different regions of Spain and there are videos to see, lots of turisty shops so an pleasant stroll.", "publishedDate": "2019-06-04", "language": "en", "rating": 3}, {"id": 678661240, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d244218-r678661240-Poble_Espanyol-Barcelona_Catalonia.html", "text": "The buildings look lovely and it's great if you don't mind wandering about an overpriced collection of cafes and restaurants. Definitely not worth the €13.", "publishedDate": "2019-06-03", "language": "en", "rating": 2}, {"id": 678549920, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d244218-r678549920-Poble_Espanyol-Barcelona_Catalonia.html", "text": "I regretted the minute I entered. 12 euros to see empty streets in an artifical village, overpriced cafe's and stores. Additionally next to the entrance I ordered  fench fries to take away, I received basic potatos barely fried all this for an additional 5 euro. Save yourself the headache and the 12 euro's for a better place. ", "publishedDate": "2019-06-03", "language": "en", "rating": 1}, {"id": 678539465, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d244218-r678539465-Poble_Espanyol-Barcelona_Catalonia.html", "text": "I'd read mixed reviews about this Spanish Village so didn't know what to expect really, but given we'd been at Montjuic Castle that morning we decided to walk down (a bit of a hike down, not too bad but a bit tiring if not fit) and go check it out... We were surprised with the entrance ticket, it was 14 euros per person at the ticket office so do buy online as it is much cheaper, and the video guide is 3.5 euros (do take it as it is so worth it).\n\nMake sure to plan your day well as you'll need around 2-3 hours if you truly want to go round the whole thing and explore properly. \n\nSearch online if there are any festivals going on, there was beer fest when we visited coincidently and it was soooo much fun we stayed till 3 am!!", "publishedDate": "2019-06-03", "language": "en", "rating": 5}, {"id": 675850962, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d244218-r675850962-Poble_Espanyol-Barcelona_Catalonia.html", "text": "Representative collection of contemporary art by popular Spanish artists including Picasso, Miro & Dali.  Has wheelchair & pram access and lift.", "publishedDate": "2019-05-23", "language": "en", "rating": 4}, {"id": 675001487, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d244218-r675001487-Poble_Espanyol-Barcelona_Catalonia.html", "text": "There is no obvious reason to pay a really expensive entrance ticket to see some uninteresting shops. Not worth your money at all...", "publishedDate": "2019-05-19", "language": "en", "rating": 1}, {"id": 674425446, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d244218-r674425446-Poble_Espanyol-Barcelona_Catalonia.html", "text": "A very beautiful experience of Spain. Although it is a tad pricey, it is well worth it for the views of the amazing buildings and architecture. There are some interesting shops, with some regular ones too. Also an eatery or two. ", "publishedDate": "2019-05-16", "language": "en", "rating": 5}, {"id": 673585619, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d244218-r673585619-Poble_Espanyol-Barcelona_Catalonia.html", "text": "This place felt like its sole purpose was for vendors to hawk their wares. I didn't really find anything all that interesting to look at and it also felt rather hokey in some regards. If you're staying nearby this location and have some time to kill it might be worth a stroll but I wouldn't recommend specifically carving out time for this place otherwise.", "publishedDate": "2019-05-12", "language": "en", "rating": 2}, {"id": 672510742, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d244218-r672510742-Poble_Espanyol-Barcelona_Catalonia.html", "text": "It is basicallya  typical Spanish village, full of houses built in different styles. There is a particular charm of this village, that is undeniable. At each house there is a shop where artisans sell their work and in some houses there are small restaurants or bars. The streets of the village are full of orange trees. The city in an actual Spanish village, it seems that you have stepped in the past.", "publishedDate": "2019-05-08", "language": "en", "rating": 4}, {"id": 671758504, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d244218-r671758504-Poble_Espanyol-Barcelona_Catalonia.html", "text": "We went to the Spanish Village as part of the cruise ship excursion.  The place was clean  and reasonably maintained.  There were interesting buildings of different style of architecture from various regions of Spain.  We enjoyed the tour from our tour guide.  It was good for us who visited Spain the first time.", "publishedDate": "2019-05-05", "language": "en", "rating": 4}, {"id": 667548360, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d244218-r667548360-Poble_Espanyol-Barcelona_Catalonia.html", "text": "A great place to visit for kids and adults. Different things to see and do and the kids enjoyed the slides area.  Plenty of choice for food and drink and well worth a visit.", "publishedDate": "2019-04-18", "language": "en", "rating": 4}, {"id": 666133655, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d244218-r666133655-Poble_Espanyol-Barcelona_Catalonia.html", "text": "I love the Spanish village (Poble Espanyol) but they make you pay an entrance fee in order to spend more inside. It's quite small and seeing it doesn't take more than half an hour and the options you have are are quite limited. ", "publishedDate": "2019-04-13", "language": "en", "rating": 2}, {"id": 665039240, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d244218-r665039240-Poble_Espanyol-Barcelona_Catalonia.html", "text": "While on a hop on hop off bus tour we decided to hop off here for a potter and a cafe and it was a good choice.\n\nOn our visit, the place was quite quiet and not everything was open. There are lots of tourist shops and some cafes / eateries, some OK, others not so great looking. It’s an artificial village and is a bit like Port Merrion in the UK.\n\nWe strolled around for an hour or so and had lunch in the main square at a pleasant cafe.\n\nThe shop owners were very pleasant with only one being a bit over eager to sell, following us around and explaining what everything was!", "publishedDate": "2019-04-09", "language": "en", "rating": 4}, {"id": 664637743, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d244218-r664637743-Poble_Espanyol-Barcelona_Catalonia.html", "text": "My mum and I visited here yesterday....we paid £14 euros each  only to find half the place was shut because there was a concert on....the music was banging....the shops that were open we’re selling the same goods as we’d seen elsewhere....they should at least discount the tickets at these times....we were extremely disappointed in this trip!!! ", "publishedDate": "2019-04-07", "language": "en", "rating": 1}, {"id": 662833466, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d244218-r662833466-Poble_Espanyol-Barcelona_Catalonia.html", "text": "I have been here twice and enjoy taking in all the varied architecture together with the unique shops. There is one shop that stands out which is Mantones y Mantillas. Beautiful handmade shawls and fans. The eating places are not expensive which is surprising as they have a captive audience. An enjoyable few hours - then back onto the tour bus to the next place of interest", "publishedDate": "2019-04-01", "language": "en", "rating": 5}, {"id": 661491322, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d244218-r661491322-Poble_Espanyol-Barcelona_Catalonia.html", "text": "We went on a weekday and found it basically empty. There was not much to see or do. Most of the shops seemed old dated, small art museum was ok, felt like going to some 60’s amusement in America. \nSeems like the City needs to step in, make it free, update and promote. It has potential. It has great views of the city.", "publishedDate": "2019-03-26", "language": "en", "rating": 2}, {"id": 659877624, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d244218-r659877624-Poble_Espanyol-Barcelona_Catalonia.html", "text": "We went in with excitement of being able to see slice of day to day living in Spain but were disappointed. Most of the places were closed and the layout was confusing. Nothing was explained in any detail. I would give it a miss if I had a time constraint.", "publishedDate": "2019-03-20", "language": "en", "rating": 4}, {"id": 659673007, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d244218-r659673007-Poble_Espanyol-Barcelona_Catalonia.html", "text": "We visited the place as a group of 4 adults, heard it is a great experience as first travellers in Spain. We were dissapointed because there was nothing really special to see and it really was not worth the price (12 euro bought online).\nIf you have kids, it's totally different story- there are special kids shows and most activities are designed for them.\nThe best thing about our visit- the FIESTA presentation, great video and information!", "publishedDate": "2019-03-19", "language": "en", "rating": 3}, {"id": 658101962, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d244218-r658101962-Poble_Espanyol-Barcelona_Catalonia.html", "text": "Just don’t go, such a waste of time! Unless you have kids with you. \nThere lots of better things to do in Barcelona instead of going in the artificial village! Not worth the money it the tome we spent! ", "publishedDate": "2019-03-12", "language": "en", "rating": 1}, {"id": 657228853, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d244218-r657228853-Poble_Espanyol-Barcelona_Catalonia.html", "text": "We were looking forward to seeing this 'living village' telling the story of the different parts of Spain and their crafts.  Whilst the reproduction buildings were stunning and the streets were beautiful, ALL of the shops, we visited, were far more expensive than those in town but selling similar wares.  A missed opportunity to display the workshops and crafts of the world famous products of Spain. Disappointed, as it was not what we expected or were led to believe was on display.", "publishedDate": "2019-03-08", "language": "en", "rating": 3}, {"id": 653417614, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d244218-r653417614-Poble_Espanyol-Barcelona_Catalonia.html", "text": "Visited 2 adults 2 teenagers. Our 5th time in Barcelona, wanted something different to do so thought we'd give it a go. We were sceptical about eating but didn't want to carry packed lunches as we cycled here. Our tickets included free audio tour as out of season.\nEnjoyed a few hours wandering around, had lunch in one of the cafes. Daughter got some great photos. Views over Barcelona were great. Yes, there are shops but there's no pressure to buy - we only got sunglasses as son lost his. And I think the shops help it to feel more like a real environment. If anything they should advertise more that there are shops and restaurants available so people know in advance in case that's something they want.\nSo if you fancy a few hours away from the bustle of the city then spend some time here instead.", "publishedDate": "2019-02-19", "language": "en", "rating": 4}, {"id": 649476404, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d244218-r649476404-Poble_Espanyol-Barcelona_Catalonia.html", "text": "Thought this was going to be great - great location and sounded interesting but distinctly underwhelmed. Pretty much all of the stores, cafes, restaurants were closed, and the buildings/rooms that were open had almost nothing in them. Relatively interesting to see the different architecture across Spain but not really worth the steep entrance fee. The best part was the slide in the kids area. Would't recommend.", "publishedDate": "2019-02-01", "language": "en", "rating": 3}, {"id": 648265549, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d244218-r648265549-Poble_Espanyol-Barcelona_Catalonia.html", "text": "I came here because it looked so cool in the pictures and my guide book described it as a \"skansen, where you can see ORIGINAL buildings from different regions of Spain\" There is nothing original about this place. It's all fake. And since it's full of shops and restaurants, I have no idea why they charge money at all. The ticket costs weren't clearly labeled, so I thought it only cost 5 Euros. I never would have went had I known. I was so angry, because I basically wasted 30 Euros, since there were two of us. We did end up finding a nice restaurant, which cost another 50 Euros. But I don't understand why they charge an entrance fee, if they are already making money from shops and restaurants. I was so angry at myself that I allowed us to be lured into this tourist trap. 30 Euros down the toilet. Then on the way out some lady started yelling at us, that we have to exit through the gift shop, even though a group of school kids exited through the gate. After all the money we already spent, they expected us to buy something from the gift shop? Avoid this place at all cost! There are many companies that offer day yours from Barcelona to REAL Spanish cities. 15 Euros, really? The archaeology museum only cost 5.", "publishedDate": "2019-01-25", "language": "en", "rating": 1}, {"id": 647000472, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d244218-r647000472-Poble_Espanyol-Barcelona_Catalonia.html", "text": "We just visited this site.  Most of the stores, crafts and shops were closed for the holidays.  Buildings were O.K. as was the Fiesta presentation.  The whole site probably should have been closed or at the very least a deeply discounted admission should have been offered.  Not impressed.  Greatly overpriced with little to see or do.", "publishedDate": "2019-01-19", "language": "en", "rating": 2}, {"id": 646830397, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d244218-r646830397-Poble_Espanyol-Barcelona_Catalonia.html", "text": "This recreation of different parts of Spain all in one place is an interesting way to see lots of different Spanish architecture and learn about how it came to be. It is pricey - entry was around €13 euros each even with a discount card and more for the almost essential audioguide - but we did learn a lot there. The mocked up houses are full of shops and restaurants selling authentic wares but some weren't open as we were visiting out of season. I think probably unwise to visit with kids who would want to encourage you to spend more money on food and trinkets.", "publishedDate": "2019-01-18", "language": "en", "rating": 3}, {"id": 645114753, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d244218-r645114753-Poble_Espanyol-Barcelona_Catalonia.html", "text": "For some reason this is not on the Top 10 and it should.\n\nVery intresting frindly user authentic.\n\nIn low seeson better to arrive around noon when it his hotter. The 150 bus stop on the front.\n\nNot for children. ", "publishedDate": "2019-01-11", "language": "en", "rating": 5}, {"id": 642728201, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d244218-r642728201-Poble_Espanyol-Barcelona_Catalonia.html", "text": "Off season, lots of what I presume were stores were closed.  Yes, it's a village (s) constructed for an exhibition, kind of a small Epcot 5 decades or so earlier.  We enjoyed it.  Didn't expect historical buildings, but the reproductions were functional.  Stopped at an open restaurant for a rest, and even managed a purchase.  I suspect it's much better in season.  But happy we went", "publishedDate": "2018-12-31", "language": "en", "rating": 4}, {"id": 640423308, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d244218-r640423308-Poble_Espanyol-Barcelona_Catalonia.html", "text": "We saw the outside of Poble Espanyol and it looked really pretty from the outside. We weren’t able to go in. ", "publishedDate": "2018-12-18", "language": "en", "rating": 4}, {"id": 639810136, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d244218-r639810136-Poble_Espanyol-Barcelona_Catalonia.html", "text": "Basically a makeshift village, which in all fairness is nicely build. But filled with rather expensive shops and restaurants for which you have to pay quit an entrance fee. I personally won't recommend this attraction. ", "publishedDate": "2018-12-15", "language": "en", "rating": 3}, {"id": 639469518, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d244218-r639469518-Poble_Espanyol-Barcelona_Catalonia.html", "text": "We booked tickets to Tablao de Carmen flemingo show at 6:30pm, and the tickets included free admission to Poble Espanyol after 4pm. The park featured building styles from all over Spain and it is indeed quite nice to walk through the streets and feeling like you're in the countrysides of Spain. All the buildings features a gift shop/restaurant at the first level, which makes a sort of a giant mall, but nobody is standing outside to sell anything, so it's \"go in if you'd like\".  There's an area where you'll see the panoramic view of Barcelona at the top of the hill, it's quite nice. We had a good time strolling around. ", "publishedDate": "2018-12-13", "language": "en", "rating": 5}, {"id": 637896230, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d244218-r637896230-Poble_Espanyol-Barcelona_Catalonia.html", "text": "The Spanish Village is a unique place, it's different from other attractions. It is the smaller version of Spain, with several little boutiques showcasing special crafts and products, like wooden guitars, glass blown objects, handmade metal statues, leather products... and many others. You can watch the products being made and can shop. There's also a church there. It is an authentic place, calm and very special.", "publishedDate": "2018-12-06", "language": "en", "rating": 4}, {"id": 636276686, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d244218-r636276686-Poble_Espanyol-Barcelona_Catalonia.html", "text": "It is a place that shows us how the architecture is in each region of Spain. It is very similar to the original designs, a \"all in one\"!", "publishedDate": "2018-11-28", "language": "en", "rating": 4}, {"id": 634033315, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d244218-r634033315-Poble_Espanyol-Barcelona_Catalonia.html", "text": "I'm really happy we ended up going here! we loved walking around the various \"parts\" of Spain and having the entire place to ourselves - it was late at night and it was virtually empty. There is a lot to see and the buildings are really well taken care of. It must be a much livelier place in the daytime / when it's nice out. Most of the shops were closed when we went but that's OK, we were happy to explore on our own. Highly recommended on your way to or from Mountjuic!", "publishedDate": "2018-11-17", "language": "en", "rating": 5}, {"id": 633655658, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d244218-r633655658-Poble_Espanyol-Barcelona_Catalonia.html", "text": "On our walk from Monjuic to Plaza Espagna we visited this little city. For me sometimes felt more like Greece than Spain ;)) a little bit empty and no entertainement. Also, the price is big for what you see, but you can take a relaxing walk and admire the houses.", "publishedDate": "2018-11-15", "language": "en", "rating": 3}, {"id": 632840703, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d244218-r632840703-Poble_Espanyol-Barcelona_Catalonia.html", "text": "Poble Espanyol is a unique town constructed from the re-creations to scale of buildings from various regions of Spain. A pleasant walk will show the Spanish peninsula variety of architectural heritage. \nSome artisans have their workshops in the buildings, creating nice pieces with their hands.", "publishedDate": "2018-11-12", "language": "en", "rating": 4}, {"id": 632831244, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d244218-r632831244-Poble_Espanyol-Barcelona_Catalonia.html", "text": "Poble Espanyol, tries to represent different places and parts of spain, it was man made for an expo and now it is a main tourist attraction and i can see clearly why. It is so nice, so colorful and extremely interesting, lots of different shops and restaurants and just nice to walk around and take pretty pictures while you learn a bit about the rest of spain. We ate at Casa Massana and it was great. the croquetas are a must as well as the pulpitos, the girl that works there very nice and food and dessert fantastic!", "publishedDate": "2018-11-12", "language": "en", "rating": 5}, {"id": 629295858, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d244218-r629295858-Poble_Espanyol-Barcelona_Catalonia.html", "text": "It looks fine from the outside and perfectly adequate for families with kids. The flyer mention a couple of free attractions but that's not right. Once you pay to get in then it is free (not quite my idea of free attraction).\nI have no doubt it is worth visiting but should I have known of the admittance charge I would have planed my day better and spend more time there.", "publishedDate": "2018-10-29", "language": "en", "rating": 3}, {"id": 629072283, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d244218-r629072283-Poble_Espanyol-Barcelona_Catalonia.html", "text": "An interesting place to visit to get an overview of life in Spain. It shows the different areas and architecture of all the areas. \nLots of restaurants available for food and interesting little shops. ", "publishedDate": "2018-10-28", "language": "en", "rating": 4}, {"id": 628216295, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d244218-r628216295-Poble_Espanyol-Barcelona_Catalonia.html", "text": "Definitely recommend!!! We've found this place accidentally and we were thrilled. There are streets, houses, squares, workshops from whole Espana divided into small provinces. ", "publishedDate": "2018-10-25", "language": "en", "rating": 5}, {"id": 627291542, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d244218-r627291542-Poble_Espanyol-Barcelona_Catalonia.html", "text": "We last came here 18 years ago.  We enjoyed our visit today. It shows a really authentic way of Spanish life and architecture in different regions. There are now some new attractions.  We particularly enjoyed the multi media experience of Fiesta with popular different festivals around Spain.  There was also an interesting contemporary art exhibition during our visit.  This is a good place for children. educationally as well as entertaining.  Easily accessible by metro and bus.", "publishedDate": "2018-10-22", "language": "en", "rating": 5}, {"id": 626564567, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d244218-r626564567-Poble_Espanyol-Barcelona_Catalonia.html", "text": "Nicely done coverage of the five main part of Spain showing short movies about each unique geographical part and one ten minute sit down movie covering A Visual Taste of Spain.  The annual tomato fight/ritual just about put me off tomatoes forever.  We walked around this village typical of an Iberian town, counter-clockwise and thought the high quality shops and the general flow was very well done.  The Fran Darrel Museum was free to all entrants and had some lovely pieces of Picasso’s earlier ceramic works, exquisite bronze statues, and works by Dali and Joan Miro.  We missed seeing the ornate Town Hall.  I wondered how many weddings occur (if any) at this incredible venue.   Some lovely restaurants tempted us to enjoy a draft before we left.", "publishedDate": "2018-10-19", "language": "en", "rating": 4}, {"id": 622235443, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d244218-r622235443-Poble_Espanyol-Barcelona_Catalonia.html", "text": "I can see why they kept the place going.  It really is a fantastic place to learn about Spain, her history and culture. Separated into Spains regions, it does a really good job of introducing you to each regions history and highlights.  The new movie Fiesta is brilliant!  the staff were friendly and helpful and although the Audio Guide can get a bit long winded it certainly helps you.", "publishedDate": "2018-10-04", "language": "en", "rating": 5}, {"id": 622046050, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d244218-r622046050-Poble_Espanyol-Barcelona_Catalonia.html", "text": "We read a lot about reproduction of Spanish houses and traditional artisan workshops. The place was not lively as all the workshops were not active. The only open places were restaurants and shops. The only highlight was the audiovisual  presenting the top Spanish festivals. I would not suggest going there.", "publishedDate": "2018-10-04", "language": "en", "rating": 2}, {"id": 621168024, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d244218-r621168024-Poble_Espanyol-Barcelona_Catalonia.html", "text": "Unique buildings that transport you to different eras and show the beauty of regions of Barcelona. Apart from the medieval church and the breath taking architecture in general, a go-to is the glassblowing artist that produces delicate and beautiful glass pieces on the spot so that you can see and feel the process and later on even buy something from the display. The hamon served at Terrer Vins, Esperits i Olis was delicious, as well as the turron and the balsamic sauces they produce! Got my sangria from there! The atmosphere is definetely worth it, and you might even be as lucky as I was and visit during a concert!", "publishedDate": "2018-10-01", "language": "en", "rating": 5}, {"id": 620030652, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d244218-r620030652-Poble_Espanyol-Barcelona_Catalonia.html", "text": "We thought this site was very interesting   Our guide explained the different house structures and what part of Spain they would be from.  We ended our trip here by being entertained by a flamenco show.  Sitting, sipping wine, eating tapas and enjoying a lively show.  How can it get any better than that?", "publishedDate": "2018-09-27", "language": "en", "rating": 4}, {"id": 619541071, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d244218-r619541071-Poble_Espanyol-Barcelona_Catalonia.html", "text": "This is a lovely, peaceful place to spend the day there are lots of artisan shops, fantastic views and examples of architecture from all over Spain. There are workshops and multimedia experiences, lots of places to eat it is well worth a visit. I could spend the day there. It is not completely wheelchair friendly so there was no charge for my wife who was in a chair. The staff were helpful and friendly.", "publishedDate": "2018-09-25", "language": "en", "rating": 5}, {"id": 619471185, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d244218-r619471185-Poble_Espanyol-Barcelona_Catalonia.html", "text": "We visited with low expectations and we’re still disappointed. I am not sure what we paid admission for. It’s just restaurants and shops with no educational value. The buildings are pretty, but it felt like Disney. If there was no admission I would have been much more impressed. Plus, at least 50% of the shops were closed. If you want shopping for souvenirs go to The Gothic.", "publishedDate": "2018-09-25", "language": "en", "rating": 1}, {"id": 619077052, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d244218-r619077052-Poble_Espanyol-Barcelona_Catalonia.html", "text": "It is a small village that show Spanish architecture and culture. There are lots of restaurants and boutiques there. Its outside view is so beautiful too.", "publishedDate": "2018-09-24", "language": "en", "rating": 4}, {"id": 618920766, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d244218-r618920766-Poble_Espanyol-Barcelona_Catalonia.html", "text": "from the start of my walk till the end I thought I was in a pirate movie, the small villages that they stop to drink, to rest, etc. or the small villages that we see in medieval era in movies. It's a bit expensive to get in like 14 euro the adult ticket but I think it's worth it.", "publishedDate": "2018-09-23", "language": "en", "rating": 5}, {"id": 618404383, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d244218-r618404383-Poble_Espanyol-Barcelona_Catalonia.html", "text": "Absolutely amazing place to visit.  We booked through bus plana in salou.  \nWe love Spain and have visited all over and this gives you a true reflection of how the buildings look in each area.   It took us probably just over an hour to look around the open air museum.  Then you've got the shops with local Spanish produce which are reasonably priced I thought.  We bought some flavoured olive oil and balsamic vinegar.  \n\nThe best part about our visit was that it was quiet and relaxing without any hustle and bustle.  \n\nThere were loads of restaurants inside as well and I noted that the museum was open until very late and so it may attract those wanting a lovely evening meal in amazing surroundings. \n\nIt was similar to Beamish open air museum in North East of England but it lacked the \"inside\" part and  traditional costumes.  They might hold theme events where more is done.  \nWould defo recommend this trip. ", "publishedDate": "2018-09-21", "language": "en", "rating": 5}, {"id": 618004363, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d244218-r618004363-Poble_Espanyol-Barcelona_Catalonia.html", "text": "A dead village with nothing special to see. Access that did not cover anything and was too much! I do not recommend!", "publishedDate": "2018-09-19", "language": "en", "rating": 1}]}}]