[{"locationId": 3678721, "name": "Jardines de la Torre de Les Aigues", "placeType": "ATTRACTION", "reviewListPage": {"reviews": [{"id": 689882753, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d3678721-r689882753-Jardines_de_la_Torre_de_Les_Aigues-Barcelona_Catalonia.html", "text": "Not really a gardens as the title of the attraction suggests, insofar as having grass and plants is the usual indicators of a garden. There are several neat rows of trees and benches though. It seems to be part public square, park and bathing pool,  that surrounds the Neo-Mudejar tower that gives the park it’s name.\n\nThe place almost feels like a secret garden hidden away by the surrounding residential buildings. The entrance is actually an innocent looking passage on Carrer de Roger de Lluria. It's a nice surprise, but don't go out of the way.", "publishedDate": "2019-07-15", "language": "en", "rating": 3}, {"id": 549970408, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d3678721-r549970408-Jardines_de_la_Torre_de_Les_Aigues-Barcelona_Catalonia.html", "text": "Not exactly the prettiest park I have seen in Barcelona, but this one is kind of neat, good place to place some basketball, or see the Torre de les Aigues.  I kind of stumbled thru the park to get a view of the tower!", "publishedDate": "2017-12-29", "language": "en", "rating": 4}, {"id": 517712658, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d3678721-r517712658-Jardines_de_la_Torre_de_Les_Aigues-Barcelona_Catalonia.html", "text": "If you are travelling with kids during hot weather this is a must. A secret oasis amongst apartment blocks with 2 shallow pools, lifeguards, sandpit, showers and toilet's - all for 1.75 Euro each. Ok it was largely concrete on the floor so hard if you wanted to sit on a towel on the ground but lots of space in the sand area to sit and also lots of benches/shaded areas. Well worth it for a cool off. Bear in mind it is only open June to Sept so if you visit outside of these months not sure what you will find.", "publishedDate": "2017-08-26", "language": "en", "rating": 5}, {"id": 489449812, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d3678721-r489449812-Jardines_de_la_Torre_de_Les_Aigues-Barcelona_Catalonia.html", "text": "We went here 2 years ago and it was great.  Went back last week and it has not been maintained.  Water is filthy and the place was deserted.  Real shame as it was a lovely place for kids to paddle and swim.", "publishedDate": "2017-05-31", "language": "en", "rating": 1}, {"id": 418789846, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d3678721-r418789846-Jardines_de_la_Torre_de_Les_Aigues-Barcelona_Catalonia.html", "text": "Small, a bit dirty and no grass. Not for tourists. We found this using google keywords \"swimming pool barcelona\" and it appeared in a top-5 list. Not exactly what we expected!", "publishedDate": "2016-09-15", "language": "en", "rating": 1}, {"id": 400753450, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d3678721-r400753450-Jardines_de_la_Torre_de_Les_Aigues-Barcelona_Catalonia.html", "text": "Fun to do with small kids is this lovely swimming pool in the gardens of a block. The atmosphere is cozy. Lifeguards monitor the place. The are toilets and shower available.\n\n", "publishedDate": "2016-08-03", "language": "en", "rating": 4}, {"id": 293003367, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d3678721-r293003367-Jardines_de_la_Torre_de_Les_Aigues-Barcelona_Catalonia.html", "text": "We have 18 month old daughter and this place was perfect for her. It's a small square surrounded by residents, plenty of shade and a very shallow set of pools behind a sandy play areas. \n\nThe pool was ideal for my daughter at 50 cm, which meant she could walk and paddle easily and have fun in an inflatable ring. And she loved playing in the sand while we sat on a near by bench watching her dig. We were there for around 3-4 hours.\n\nHowever, there isn't much else, as such I could see older children (6+) getting a bit bored after a while. Food wise, there isn't much. There's a access point to a cantina near the entrance, which was rarely maned. However, we brought a packed lunch.\n\nAdditionally, seating isn't great. There's a number of benches but after that, it's a towel on the stone ground and while I wasn't sat for often, could get uncomfortable. \n\nIt was certainly popular with locals as we seemed to be the only English family there. \n\nEntrance is really cheap, so it's well worth a visit if you have young children and want to get out of the sun for a couple of hours.", "publishedDate": "2015-07-27", "language": "en", "rating": 5}, {"id": 246584821, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d3678721-r246584821-Jardines_de_la_Torre_de_Les_Aigues-Barcelona_Catalonia.html", "text": "It's basically a stretch of houses/residences with beautiful flowers. Worth a look if you're in the neighbourhood.", "publishedDate": "2014-12-30", "language": "en", "rating": 4}, {"id": 209667855, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d3678721-r209667855-Jardines_de_la_Torre_de_Les_Aigues-Barcelona_Catalonia.html", "text": "fantastic viewpoint. and a gorgeous bar suspended over mountain side. a must see. ..........................................................................", "publishedDate": "2014-06-09", "language": "en", "rating": 5}]}}]