[{"locationId": 6214229, "name": "Claustro E Iglesia de la Concepcion", "placeType": "ATTRACTION", "reviewListPage": {"reviews": [{"id": 732787061, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d6214229-r732787061-Claustro_E_Iglesia_de_la_Concepcion-Barcelona_Catalonia.html", "text": "Stumbled upon this wondefull place while wandering the streets of Barcelona and we were surprised to see such lovely hidden oasis, definitely a sight to see, I recommend you visit it if you are in the area. The Basilica is pretty nice to see but the interior garden is a must visit. ", "publishedDate": "2019-12-15", "language": "en", "rating": 5}, {"id": 713660170, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d6214229-r713660170-Claustro_E_Iglesia_de_la_Concepcion-Barcelona_Catalonia.html", "text": "Good place to escape the sun and have a quiet moment if you are nearby but I wouldn't go out the way to see it. The cloister is nice but make this the first church you visit, as the more famous ones in the city will make this feel less impressive in comparison. ", "publishedDate": "2019-09-28", "language": "en", "rating": 4}, {"id": 538962473, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d6214229-r538962473-Claustro_E_Iglesia_de_la_Concepcion-Barcelona_Catalonia.html", "text": "It is a very beautiful church with a very lovely yard. Church is still active is not only for touristic purpose. They close the doors for praying times. You should visit if you are around neighbourhood  ", "publishedDate": "2017-11-06", "language": "en", "rating": 4}, {"id": 524608604, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d6214229-r524608604-Claustro_E_Iglesia_de_la_Concepcion-Barcelona_Catalonia.html", "text": "The Church of the Holy Conception is a  Gothic church dating back to the 14th century.  The church was moved brick by brick from the old walled city to its new location in the 1870’s when Barcelona started expanding outside the city walls.  A visit to the church and especially the cloister may impart upon visitors a sense of tranquility and peace.", "publishedDate": "2017-09-15", "language": "en", "rating": 5}, {"id": 508506918, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d6214229-r508506918-Claustro_E_Iglesia_de_la_Concepcion-Barcelona_Catalonia.html", "text": "The cloister and church of La Concepción in the Eixample Dreta in Barcelona is worth stopping by should you be in the area or if you are visiting Sagrada Família or Hospital de Sant Pau.  The cloister is quite pretty and beautiful with its orange trees and is a peaceful haven from the loud traffic of Calle Aragón just outside.  As this is not a major tourist site it is evident that the church needs restoration work and some of the chapels are neglected but it is a fine example of Catalan Gothic architecture and is peaceful respite from the sun and noise of the city.", "publishedDate": "2017-08-03", "language": "en", "rating": 3}, {"id": 449877153, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d6214229-r449877153-Claustro_E_Iglesia_de_la_Concepcion-Barcelona_Catalonia.html", "text": "we found this church while walking back from the Sagrada to Las Ramblas, but the place is worth a visit on its own. Both the main church (from the 1400) and the cloister (from the 1500) are splendid example of Catalan Gothic architecture and are certainly out of place in the new quarter where they are. Little we knew that the Church was actually moved here stone by stone during the 19th century to create a Parish in the growing quarter and to avoid its destruction as the original location near the city walls had become an obstacle to the growth of the municipality. During the Christmas period a splendid nativity in the middle of the garden, made it even more worthwhile by the live roosters and hens in nearby cages (I guess as active participants of the Christmas's eve rooster mass?)", "publishedDate": "2017-01-06", "language": "en", "rating": 4}, {"id": 414451485, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d6214229-r414451485-Claustro_E_Iglesia_de_la_Concepcion-Barcelona_Catalonia.html", "text": "The cloister's little garden is very quiet and makes you forget the busy road (Aragon) next to it. We went there during the corpus christi celebrations and saw the egg \"dancing\" on the fountain, quite unusual.", "publishedDate": "2016-09-04", "language": "en", "rating": 4}]}}]