[{"locationId": 8614075, "name": "El Toro Pensador", "placeType": "ATTRACTION", "reviewListPage": {"reviews": [{"id": 689590109, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d8614075-r689590109-El_Toro_Pensador-Barcelona_Catalonia.html", "text": "El Toro Pensador is a sculpture at the southern end of La Rambla de Catalunya. If you’ve seen The Thinker by Auguste Rodin, then you’ll instantly recognise this. This sculpture is an anthropomorphic bull in a similar pose to The Thinker and is a complementary sculpture to Jirafa Coqueta at the northern end of La Rambla de Catalunya/\n\nI love this, a bit of nonsensical fun.", "publishedDate": "2019-07-14", "language": "en", "rating": 5}, {"id": 676121580, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d8614075-r676121580-El_Toro_Pensador-Barcelona_Catalonia.html", "text": "El Toro Pensador is the unusual sculpture of a very thoughtful Bull! Barcelona is full of beautiful sculptures, many of them in animal form, and this one is no exception. The interesting thing here is that at the other end of Las Rambla there sits another animal sculpture (the Flirty Giraffe), and it seems as if the two animals will soon start to want to come closer to each other; but you will have to meet both animals in order to understand the connection.", "publishedDate": "2019-05-24", "language": "en", "rating": 4}, {"id": 551712154, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d8614075-r551712154-El_Toro_Pensador-Barcelona_Catalonia.html", "text": "I'm not mental about this kind of art but it was interesting to look at. Check it out if passing by.", "publishedDate": "2018-01-05", "language": "en", "rating": 3}, {"id": 430988122, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d8614075-r430988122-El_Toro_Pensador-Barcelona_Catalonia.html", "text": "Street art is important to the Barcelona experience. A professor acquaintance once told me \"To have beautiful thoughts, you must surround yourself with beautiful things.\" Amen", "publishedDate": "2016-10-23", "language": "en", "rating": 4}, {"id": 341829810, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d8614075-r341829810-El_Toro_Pensador-Barcelona_Catalonia.html", "text": "At the other side of Rambla de Catalunya, at the crossroad with Gran Via, there is another animal sculpture designed by Josep Granyer. This one shows a bull in a position of Rodin’s thinker. Try to visit every animal statue in the city, it is not an easy task!", "publishedDate": "2016-01-21", "language": "en", "rating": 5}]}}]