[{"locationId": 11930450, "name": "La Deessa", "placeType": "ATTRACTION", "reviewListPage": {"reviews": [{"id": 689881619, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d11930450-r689881619-La_Deessa-Barcelona_Catalonia.html", "text": "La Deessa is an iconic sculpture of a naked female figure by Josep Clara. It’s a study of the female form, life sized in white, and depicts a nude woman, seated with her knees drawn up and resting on on a square marble plinth. Her right elbow is resting on her left knee and she rests her check against the back of her hand. The one her in Placa de Catalunya is actually a copy of the original which is displayed in Casa de la Ciudad de Barcelona.\n\nThe sculpture exudes sensuality and classical beauty. The simple and delicate features of the figure evoking a feeling of serenity. Definitely worth seeking out if in the area.", "publishedDate": "2019-07-15", "language": "en", "rating": 5}, {"id": 676468692, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d11930450-r676468692-La_Deessa-Barcelona_Catalonia.html", "text": "La Deessa o l’Enigma’ is a beautiful, white marble sculpture by Josep Clara, in Plaza de Catalunya. It is also known as The Goddess or The Enigma. It sits in the middle of a pool of water, which is next to the famous Monument a Francesc Macià, the great Catalan leader. Plaza de Catalunya is quite large and is a sort of nerve centre of Barcelona. It is a transport centre and a place where people can go to relax and just watch the world go by.", "publishedDate": "2019-05-25", "language": "en", "rating": 5}, {"id": 668493959, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d11930450-r668493959-La_Deessa-Barcelona_Catalonia.html", "text": "Free\n24/7\nVisit Duration: 5 Minutes\nLocation: Plaza Catalunia\n\nThe life size white marble goddess is sitting in the middle of the water. The ivory coloured naked woman takes a bath, resting on a square marble plinth on the north end of a shallow pool. Seated on her left leg, which is folded back. Her right foot is on the plinth. The top of her left hand is on her chin as she faces slightly up and to her left. Her right hand rests on the plinth by her side in front of her right foot.", "publishedDate": "2019-04-22", "language": "en", "rating": 4}, {"id": 583607609, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d11930450-r583607609-La_Deessa-Barcelona_Catalonia.html", "text": "This sculpture is located in a pool near the monument to Francesc Maciá and is known as The Enigma or The Goddess. It is a replica statue, the original can be found in the Barcelona City Hall. Good for a photo.", "publishedDate": "2018-05-29", "language": "en", "rating": 4}, {"id": 581848262, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d11930450-r581848262-La_Deessa-Barcelona_Catalonia.html", "text": "I came across this sculpture -- The Goddess of the Enigma -- unexpectedly when looking at the monument to Francesc Macia in Placa de Catalunya. As I circled the monument, I discovered that it formed a backdrop to this white marble creation, placed in the middle of a shallow circular pool. The work depicts a nude woman on a low pedestal. She sits on her left leg, which is folded back. The right leg is drawn up so that her left elbow rests on the knee. Her chin rests on the top of her left hand. The right arm is slightly bent with this hand's fingers touching the pedestal. Wide circles consisting of pavers and grass surround the pool. \n\nI found this piece to be the epitome of simplicity and not especially appealing. I gave the work a quick look and noticed that it failed to hold the attention of myriad visitors passing by. This piece is a copy made by sculptor Ricard Hall and put here in 1982 to replace the 1909 original by sculptor Josep Clara i Ayats. That work now appears in the City Hall.\n\nLa Deessa is on the South side of Placa de Catalunya across from Hotel Olivia Plaza.", "publishedDate": "2018-05-21", "language": "en", "rating": 3}, {"id": 453172497, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d11930450-r453172497-La_Deessa-Barcelona_Catalonia.html", "text": "The big beautiful square, Plaza de Cataluna, has many sculptures.\nLa Deessa is one of them.\nLa Deessa (catalan) = La Diosa (espanol) = Goddess (english).\nThe first sculpture was made of Josep Claré in 1928.\nThe current copy was made of Richard Sala in 1982.\nLa Deessa is very beautiful young woman.\nShe is sitting on a little platform in the basin in the south corner of the Plaza.", "publishedDate": "2017-01-18", "language": "en", "rating": 3}]}}]