[{"locationId": 190637, "name": "Joan Miro Foundation", "placeType": "ATTRACTION", "reviewListPage": {"reviews": [{"id": 751477528, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d190637-r751477528-Joan_Miro_Foundation-Barcelona_Catalonia.html", "text": "Set midway up Mount Juic, this superbly conceived museum integrates Miro's artistic vision with surrounding vistas from its terraces overlooking the city below.   Architecturally speaking, the building is in sync with Miro's style.  Descriptions of each work include a translation in good English (congratulations to the translator), though, to be honest, I stopped reading them and instead gave all my attention to Miro's mesmerizing visuals.  Videos show him at work   The museum isn't large so two hours could be more than enough.   There's a bus from the foot of Mount Juic.", "publishedDate": "2020-03-20", "language": "en", "rating": 5}, {"id": 750470612, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d190637-r750470612-Joan_Miro_Foundation-Barcelona_Catalonia.html", "text": "The minute you walk up and see  the Miro sculptures on the grassy area, it's a sight to see. Very contemporary in design, houses one of the best collections of Miro. An assortment of very large canvases and small ones too. Best to go through with a tour guide or the head set is a must. Plan on 1-3 hours at best. ", "publishedDate": "2020-03-11", "language": "en", "rating": 5}, {"id": 749424405, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d190637-r749424405-Joan_Miro_Foundation-Barcelona_Catalonia.html", "text": "Such a small exhibition left me dissapointed! Yard and outside objects was locked. Pathetic Espai 13. Inquire if its all open by call before having an idea to go there. For the ticket price of 13 Eur it is not worth visiting.", "publishedDate": "2020-03-05", "language": "en", "rating": 2}, {"id": 749293287, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d190637-r749293287-Joan_Miro_Foundation-Barcelona_Catalonia.html", "text": "I am a long-time huge fan of Joan Miro and I loved the Fundacio. I have been before and would go again. It was my husband’s first trip to Barcelona (not a big fan of the artist) and he was glad that he went. The skip the line tickets made entry quite quick and easy. Note: these tickets do not include audioguide but you can purchase on site for 5 euros more.", "publishedDate": "2020-03-05", "language": "en", "rating": 5}, {"id": 747401264, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d190637-r747401264-Joan_Miro_Foundation-Barcelona_Catalonia.html", "text": "Lovely walk up through the park, not suitable if you have walking  problems.  We did this gallery after the  National art museum.  Check to see if fountains are operational- sadly not on our visit.\n", "publishedDate": "2020-02-24", "language": "en", "rating": 4}, {"id": 746976754, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d190637-r746976754-Joan_Miro_Foundation-Barcelona_Catalonia.html", "text": "Very nice museum! To do for those that like Miró’s work. You can Easley spend half a day there, the museum is surrounded by green areas so nice for a picnic. The museum has a “resting area” for kids in the middle of the visit! ", "publishedDate": "2020-02-23", "language": "en", "rating": 5}, {"id": 741797420, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d190637-r741797420-Joan_Miro_Foundation-Barcelona_Catalonia.html", "text": "We had a very interesting and satisfying visit to this fabulous building, looking down on the city, surrounded by parkland. The art was representative and beautifully displayed, some outside. \n\nLunch is reasonably priced and perhaps your plate might also be presented as a Miro portrait.\n\nTook a bus, no haddke with correct changefor n enjoyed the drive through the city and park too.", "publishedDate": "2020-01-28", "language": "en", "rating": 5}, {"id": 741402775, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d190637-r741402775-Joan_Miro_Foundation-Barcelona_Catalonia.html", "text": "There is so much of Joan Miro's work here from early paintings, dramatic large canvases and intriguing sculpture displayed clearly over multiple levels and outside areas. ", "publishedDate": "2020-01-26", "language": "en", "rating": 5}, {"id": 740630768, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d190637-r740630768-Joan_Miro_Foundation-Barcelona_Catalonia.html", "text": "Excellent museum for Miro lovers. Paintings, sculptures and other works of arts. Outdoor and indoor as well. Great place to visit.", "publishedDate": "2020-01-22", "language": "en", "rating": 5}, {"id": 738451493, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d190637-r738451493-Joan_Miro_Foundation-Barcelona_Catalonia.html", "text": "After getting all the way up to see this museum, paying the ridiculous 20 bucks, more for the audio, we were treated to a screaming staff member. Lady with the red hair,giving the audio, you ruined my day. You made my daughter cry.  I saw you being cruel to the French students before you turned on us.  Why are you working in tourism?\nMuseum can be covered in 45 minutes. Miro is an amazing artist but too little content. It's not worth the money or the aggravation as its nowhere near any other sites.", "publishedDate": "2020-01-11", "language": "en", "rating": 1}, {"id": 738313441, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d190637-r738313441-Joan_Miro_Foundation-Barcelona_Catalonia.html", "text": "But you really need to enjoy this type of art.  I really wanted to visit and my husband tagged along.  Ticket prices for seniors are more than reasonable.  The permanent collection is incredible as is the architecture of the building itself.  Very well signed throughout.  The terraces were lovely as were the sculptures.  The temporary exhibition on related art and sound and was fascinating.  Lovely gift shop and nice cafe.  For  euro14 euro a steal if you love modern art!", "publishedDate": "2020-01-10", "language": "en", "rating": 5}, {"id": 737648950, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d190637-r737648950-Joan_Miro_Foundation-Barcelona_Catalonia.html", "text": "We enjoyed seeing the evolution of work at this museum and the influence on other artists. While not the greatest art museum we've visited, this was perfectly nice. We enjoyed the rooftop and terraces, and found the mercury fountain fascinating. Worth a trip if you purchase the Articket!", "publishedDate": "2020-01-07", "language": "en", "rating": 3}, {"id": 736327572, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d190637-r736327572-Joan_Miro_Foundation-Barcelona_Catalonia.html", "text": "Why do you sell tickets on a day that you are not even open? A very expensive taxi ride to find out it was closed.", "publishedDate": "2020-01-02", "language": "en", "rating": 1}, {"id": 735871449, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d190637-r735871449-Joan_Miro_Foundation-Barcelona_Catalonia.html", "text": "A large white, open plan building on Montjuic houses an impressive collection of paintings and sculptures of Joan Miro.  His works are colorful and abstract. Enjoyed the sculptures “Moon, Sun and One Star” on the terrace and “Pair of Lovers playing with Almond Blossoms”.", "publishedDate": "2019-12-31", "language": "en", "rating": 5}, {"id": 734138907, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d190637-r734138907-Joan_Miro_Foundation-Barcelona_Catalonia.html", "text": "While in Barcelona we visited the Jean Miró Foundation which is a small museum dedicated for the most part to one artist.  I tend to like the smaller museums.  I get overwhelmed in the huge ones and don’t know what to see and what to skip.  This museum was curated while Miró was alive and he took an active part in the design of the building as well as choosing  and placing the art.  The selection of sculpture, paintings and prints is truly wonderful and gave me a much greater appreciation of Miró’s work.  There is a small cafe with tasty food and a pleasant gift shop.  The Foundation is in Montjuic Park, which is a lovely place to spend the afternoon after leaving the Museum.", "publishedDate": "2019-12-22", "language": "en", "rating": 5}, {"id": 732312278, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d190637-r732312278-Joan_Miro_Foundation-Barcelona_Catalonia.html", "text": "Perhaps it's because we visited the Miró museum after the Picasso museum, but I found the Miró collection to be paltry. And there were no displays or additional information available about the life and career of Miró. However, the location is beautiful--fantastic views of the city from the park area. It it also easily accessed-- the bus stop is right out front. Bus 55--just 13 stops (25 min) to return to Pl. Catalunya.", "publishedDate": "2019-12-12", "language": "en", "rating": 3}, {"id": 731045106, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d190637-r731045106-Joan_Miro_Foundation-Barcelona_Catalonia.html", "text": "My husband and I visited this museum on Friday afternoon in November. There were no lines to enter and the visitors amount was fair and the museum was not overly crowded. I liked that. We could nicely stroll the art space and admire the artworks of Joan Miró and some other modern artists that were exhibited there. We spent nearly two hours there and enjoyed it very much. We also thought that the ticket price was adequate. I only wish that the outside areas with Miró sculptures were open. That was a pity. But the architecture of the building, artworks and how well it was organized made up for it. ", "publishedDate": "2019-12-06", "language": "en", "rating": 5}, {"id": 730933395, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d190637-r730933395-Joan_Miro_Foundation-Barcelona_Catalonia.html", "text": "Perhaps Miro isn’t everyone’s cup of tea, however the way his art is organised and articulated is exceptional.  The building was purpose designed and built, the multimedia audio guide the best I have had the pleasure of listening to and learning from, the views from the Terrace over Barcelona spectacular, the staff friendly and even the coffee shop was tops.  There were additional temporary exhibitions on sound and silence as art, and an interactive art area.  I spent a most enjoyable rainy day and came away with a greater appreciation of Miro’s paintings, sculptures, philosophies, life and times.", "publishedDate": "2019-12-05", "language": "en", "rating": 5}, {"id": 730639933, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d190637-r730639933-Joan_Miro_Foundation-Barcelona_Catalonia.html", "text": "We combined this stop with Museu Nacional d’Art Catalunya, exiting by the Magic Fountain. \nNo nothing of Miró? This is mandatory.\nLike Miró? Again, mandatory. \nQ-Trip: Montjuic is a #1 stop on a nice day. Skip it if rain.\n             Directions in park are ... horrible so make sure \n             Google map is working. \nQ-Trip: Two museums and a work, what’s next. \n             Bodega Biarritz 1883 is open at 5 (9 Euro cab ride) \n             and hits the hunger spot.  ", "publishedDate": "2019-12-04", "language": "en", "rating": 4}, {"id": 728249436, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d190637-r728249436-Joan_Miro_Foundation-Barcelona_Catalonia.html", "text": "A beautiful modern building in a gorgeous setting overlooking the city. A nice survey of the large works of Joan Miro. The highlight is a 2 story woven tapestry.", "publishedDate": "2019-11-22", "language": "en", "rating": 4}, {"id": 727069749, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d190637-r727069749-Joan_Miro_Foundation-Barcelona_Catalonia.html", "text": "Any museum dedicated to one artist has a significant disadvantage. It is tricky to enjoy if that artist isn't a particular favourite! In my case Miro doesn't quite \"do it\" but I nevertheless enjoyed the extensive collection which I thought to be well displayed and presented.\n\nHaving visited the National Collection that day and enjoyed free entry, I would the senior price at just over €14 to be a little steep but, again, this was only really down to my lack of enthusiasm for the artist in question.\n\nWhat, of course, you do go away with is a far better understanding of the breadth and variety of the life's work. I also enjoyed seeing the related exhibitions and, in particular, a rather fine Bridget Riley.", "publishedDate": "2019-11-17", "language": "en", "rating": 4}, {"id": 725970664, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d190637-r725970664-Joan_Miro_Foundation-Barcelona_Catalonia.html", "text": "Enjoyed touring the rooms and the roof and gadens of this small museum. Excellent display of Miro's works", "publishedDate": "2019-11-12", "language": "en", "rating": 5}, {"id": 725738373, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d190637-r725738373-Joan_Miro_Foundation-Barcelona_Catalonia.html", "text": "It's peaceful, it's quiet, it's eye-appealing, it's comprehensive.  Nice shop, nice restaurant.  If you are a fan of Miro, you are guaranteed to love it.  If you are uncertain, go and I bet you'll become a fan.  It's fun to look at!", "publishedDate": "2019-11-11", "language": "en", "rating": 5}, {"id": 725268325, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d190637-r725268325-Joan_Miro_Foundation-Barcelona_Catalonia.html", "text": "The Miro Foundation building is itself a distinctive and living work of art -- brilliantly conceived and executed to fit the landscape and to exhibit the art. And then there is the work itself! We did not go with a guide or even bother with the audio guide. The written explanations were helpful in themselves. (Admittedly, we were already familiar with Miro's work.) The depth and breadth of the collection here is impressive. Prints, paintings, textiles, anti-paintings, sculptures...and on and on!  Equally interesting are the contemporary exhibits drawing on themes important to Miro (e.g. sound, during our visit). If you are interested in modern art, this will be a highlight of your trip to Barcelona.", "publishedDate": "2019-11-09", "language": "en", "rating": 5}, {"id": 724818320, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d190637-r724818320-Joan_Miro_Foundation-Barcelona_Catalonia.html", "text": "I viewed a Miro' exhibit at the Nasher near Duke University's Campus a few years ago. It was boring. Mostly sculpture. Mostly primary colors. Mostly Miro bird perches. Mostly  rooms crowded not with visitors but with the art amalgam. Mostly a one note samba.\n\nUp on Montjuic in Barcelona at this perfect venue, you'll appreciate Miro' as he hoped you would. Works early and mature, mobile, collage, paintings, sculpture (was there tapestry too?) all displayed in bright, commodious spaces that enhance the visual experience. Rooftop gardens too. The artist's growth and journey is understood.\n\nThe jaunt to Montjuic is worthwhile even without the Fundacio, gardened, fountained, porticoed, sports and olympic venued, and with nearby museums of many disciplines, a castle et al.\n\nWhen I really love a museum, I buy a tee. I bought a tee.", "publishedDate": "2019-11-07", "language": "en", "rating": 5}, {"id": 724780975, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d190637-r724780975-Joan_Miro_Foundation-Barcelona_Catalonia.html", "text": "We took a guided English tour (20 Euros each).  There were 4 people on the tour.  The guide was somewhat knowledgeable, however spoke in a very soft voice.  Several elementary school groups were present during this scheduled tour making it almost impossible to hear our soft-spoken guide.  The place celebrates Miro's \"breaking all the rules\" of art.  When asked \"Why\" he did this... no one seemed to know.  His identifying \"signs\" were highlighted on the tour (i.e. birds, women, stars, planets), but I failed to see anything beyond scribbles and abstract things put together... which Miro had to extensively write about to explain his \"deep\" thoughts as explained by our soft-spoken guide.  Very strange indeed.  The \"no rules\" approach seems to be encouraged at this grossly overpriced museum.  I suppose the history of \"no rules\" applied to a culture is lost on most \"avant garde\" visitors...  that is, the inevitable rise of totalitarianism.  Obviously I am not a \"modern art\" connoisseur. ", "publishedDate": "2019-11-07", "language": "en", "rating": 2}, {"id": 723943040, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d190637-r723943040-Joan_Miro_Foundation-Barcelona_Catalonia.html", "text": "We visited this museum last century. Time for a refresh.Still mixed feelings about the artist, but enthousiast about the other expositions", "publishedDate": "2019-11-04", "language": "en", "rating": 4}, {"id": 723350172, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d190637-r723350172-Joan_Miro_Foundation-Barcelona_Catalonia.html", "text": "If you like Miro or just want to know his art better, this is 5e place for you.  The museum was designed for his work so it provides a lovely home for some of Miro’s Best works.  Not too busy or cramped, the layout allows a visit at each piece and time to comprehend some of his bigger works.  Two gift shops offer a vairiety of all things Miro - for posters, go to the bookstore.", "publishedDate": "2019-11-02", "language": "en", "rating": 5}, {"id": 723259050, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d190637-r723259050-Joan_Miro_Foundation-Barcelona_Catalonia.html", "text": "Decided to go to see something different. We are not coniseurs of modern art but we found this place interesting. Not expensive and would recommend if you want something away from the norm!", "publishedDate": "2019-11-02", "language": "en", "rating": 4}, {"id": 723019654, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d190637-r723019654-Joan_Miro_Foundation-Barcelona_Catalonia.html", "text": "We had a new and ever higher regard for Joan Miro after seeing this. Great pieces, very well presented. Spacious and calm. And a great sit-down restaurant, with really good food. Also has a more casual indoor-and-out sit-down cafe.", "publishedDate": "2019-11-01", "language": "en", "rating": 5}, {"id": 721245769, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d190637-r721245769-Joan_Miro_Foundation-Barcelona_Catalonia.html", "text": "Really good multimedia guide for an extra 5€ that fully explains all the works. Not too crowded, plenty of seats to contemplate from as well. Definite must for modern art fans.", "publishedDate": "2019-10-25", "language": "en", "rating": 5}, {"id": 721146156, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d190637-r721146156-Joan_Miro_Foundation-Barcelona_Catalonia.html", "text": "Everyone has seen a Miro - even if you don't think you have, you have.  A very successful artist in his own lifetime Miro became an icon of Spanish culture the world over.  Yet his paintings have always been very open to interpretation - and this is where the power of his work lies.  At a superficial level they are beautiful abstractions - many in very large formats.  But he kept returning to themes, explored through his reductionist  style.  This is no better demonstrated by the first painting on the route.  It is a double self portrait completed in two stages.  The first 30 years before the second - and his two styles are laid bare - classical training and pure abstraction.  Understand the journey here and you will become enthralled by Miro.  Other themes of hope, time, progress, and the influence of Japan on his work, are all explored and also narrated in the excellent audio guide.  I strongly recommend the audio guide as it is curated beautifully and will enhance your visit however much you know about Miro.\nThe Museum also commands amazing views over Barcelona from Mont Juic. The museum has a little cafe and there is a bar just a bit down the road", "publishedDate": "2019-10-24", "language": "en", "rating": 5}, {"id": 720276718, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d190637-r720276718-Joan_Miro_Foundation-Barcelona_Catalonia.html", "text": "This is a wonderful Joan Miro museum in a fantastic building.  The roof sculptures are interesting, too.", "publishedDate": "2019-10-21", "language": "en", "rating": 5}, {"id": 720201533, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d190637-r720201533-Joan_Miro_Foundation-Barcelona_Catalonia.html", "text": "If you don't like Miro, don't go.  But if you do, you will enjoy this medium sized museum.  Aside from the art, the building on its own is interesting too.  And as a bonus there is the neat mercury fountain by Caulder.  A quirky fountain that uses mercury a the fountain's liquid.  So poisonous is the mercury that the whole fountain is kept in a glass room.  Let your kids wrap their heads around that.\nNot crowded when we went.", "publishedDate": "2019-10-21", "language": "en", "rating": 4}, {"id": 718072577, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d190637-r718072577-Joan_Miro_Foundation-Barcelona_Catalonia.html", "text": "Art displayed within a custom designed environment...a real treat. Only disappointed so many rooms were closed off.", "publishedDate": "2019-10-13", "language": "en", "rating": 4}, {"id": 716631697, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d190637-r716631697-Joan_Miro_Foundation-Barcelona_Catalonia.html", "text": "This museum is located on a hill overlooking the city. It is so beautifully built and thoughtfully designed. The staff are kind and helpful. The Miro pieces are so wonderful and in a variety of painting, textiles, ceramics and statues. We so enjoyed being here.", "publishedDate": "2019-10-09", "language": "en", "rating": 5}, {"id": 716618934, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d190637-r716618934-Joan_Miro_Foundation-Barcelona_Catalonia.html", "text": "Not only am I in AWE of the work of Calalan Artist, Joan Miro, but the building, surroundings and view of Barcelona from the gallery is second to none.\n", "publishedDate": "2019-10-09", "language": "en", "rating": 5}, {"id": 716326086, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d190637-r716326086-Joan_Miro_Foundation-Barcelona_Catalonia.html", "text": "You are going to need 2h for visiting. If  you are not a big fan of paintings or museums you might change your mind after this one. ", "publishedDate": "2019-10-08", "language": "en", "rating": 5}, {"id": 716154678, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d190637-r716154678-Joan_Miro_Foundation-Barcelona_Catalonia.html", "text": "The architectural beauty and spareness is also on Montjuk hill overlooking the city and ocean and it is worth a good afternoon.  The iconoclastic and colorful paintings are explained in words and video at various points in the building.  His life and work was truly a shaking of the foundations of art.", "publishedDate": "2019-10-07", "language": "en", "rating": 5}, {"id": 715872915, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d190637-r715872915-Joan_Miro_Foundation-Barcelona_Catalonia.html", "text": "If you are on foot walking down from the castle, make sure you have good directions!  Once we got to the museum we had a meal while overlooking the garden in back.  The museum has a variety of pieces by Miro and some contemporaries, with an educational audiotour you should not miss.", "publishedDate": "2019-10-06", "language": "en", "rating": 5}, {"id": 715845623, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d190637-r715845623-Joan_Miro_Foundation-Barcelona_Catalonia.html", "text": "Came back after over 15 years. Still a wonderful visit. A unique museum combined with a beautiful view of the city. Recommend to take the “teleferic” from the mountain to the harbor.", "publishedDate": "2019-10-06", "language": "en", "rating": 5}, {"id": 714874170, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d190637-r714874170-Joan_Miro_Foundation-Barcelona_Catalonia.html", "text": "Enjoyed permanent and temporary exhibits in the early evening. Adequately curated and spacious galleries. Some really fun and interesting works presented chronologically in a beautifully designed building. Wonderful to have it open until 8 pm. Also liked browsing in the store.", "publishedDate": "2019-10-02", "language": "en", "rating": 5}, {"id": 713899847, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d190637-r713899847-Joan_Miro_Foundation-Barcelona_Catalonia.html", "text": "A wonder of brilliant art. A joy to behold so many works by Miro, pairings, sculpture and textiles. A tranquil, well lit environment in which to enjoy some amazing art. ", "publishedDate": "2019-09-29", "language": "en", "rating": 5}, {"id": 713704597, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d190637-r713704597-Joan_Miro_Foundation-Barcelona_Catalonia.html", "text": "I do like me some Miro, but this collection was quite the letdown.  A lot of paintings, yes.  But they look to me like they were all whipped up at  the same time to fulfill a contractual obligation or something.  If you have a museum pass maybe pop in, but I really wouldn't bother unless you are a serious Miro enthusiast.", "publishedDate": "2019-09-28", "language": "en", "rating": 2}, {"id": 713411769, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d190637-r713411769-Joan_Miro_Foundation-Barcelona_Catalonia.html", "text": "Never knew much about Joan Miro but was blown away by all his works. This is definitely one of Barcelona's gems; a must visit if you like contemporary art and sculpture; and very different from the more traditional art museums in Barcelona.", "publishedDate": "2019-09-27", "language": "en", "rating": 5}, {"id": 713221926, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d190637-r713221926-Joan_Miro_Foundation-Barcelona_Catalonia.html", "text": "I didn't like Miro artwork before I came here because I didn't have an appreciation for it.  After going through this museum with the audioguide, I understand more the thought process behind his works and it was interesting to see how he developed as an artist and what were some of the people, places, or things that influenced him.  The modern art building displays his artwork very well.  I wish the audioguide was longer and covered all of his art pieces.  It is walkable from El Poble-sec but it is a steap uphill climb with many stairs at the end.  You might want to take a taxi or the hop on hop off bus.", "publishedDate": "2019-09-26", "language": "en", "rating": 4}, {"id": 713161256, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d190637-r713161256-Joan_Miro_Foundation-Barcelona_Catalonia.html", "text": "I did not have time to visit the Fundacio Joan Miro when I visited Barcelona last year so i was more that delighted to have the chance to spend a thoroughly enjoyable morning in the company of work by this wonderfully expressive artist, The galleries were well laid out with plenty of space and the information on the audio guide (available for 4 euros and well worth the money) hit the right balance between contextual explanation of the background to the paintings and the meaning and inspiration contained in the canvas. Once the trip is over the cafe and gift shop are also well worth a pit stop", "publishedDate": "2019-09-26", "language": "en", "rating": 5}, {"id": 713097620, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d190637-r713097620-Joan_Miro_Foundation-Barcelona_Catalonia.html", "text": "I arrived in Barcelona with the intention of visiting the Picasso and Joan Miro Museums - I gave up on Picasso, no matter how early I arrived there was a long queue so I headed off to the Joan Miro Museum. I was the third person in the queue and had a great couple of hours mainly looking for inspiration for my own work and there was so much! If you enjoy modern / abstract art this is the place to visit! Loved it!", "publishedDate": "2019-09-26", "language": "en", "rating": 5}, {"id": 713082651, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d190637-r713082651-Joan_Miro_Foundation-Barcelona_Catalonia.html", "text": "I did not really know much about Miro before we visited but this spacious gallery really displays his work in the best light.  There are 2 floors and 19 galleries which display the work in chronological order.  Very nice courtyard cafe and shops.  You can also go up on the roof which has fantastic views over Barcelona.  When we visited the gallery was not at all busy.\n\nIf you only do one art gallery in Barcelona then this is the one I would recommend.", "publishedDate": "2019-09-26", "language": "en", "rating": 5}, {"id": 712242418, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d190637-r712242418-Joan_Miro_Foundation-Barcelona_Catalonia.html", "text": "This is an interesting museum that houses a lot of funny sculptures by  Joan Miro.\nSome of the tapestries are nice and some paintings too arty for me to understand..", "publishedDate": "2019-09-23", "language": "en", "rating": 4}, {"id": 710893593, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d190637-r710893593-Joan_Miro_Foundation-Barcelona_Catalonia.html", "text": "Paintings, sculptures, roof top garden with spectacular view. Cafe for the weary or hungry.  Library, gift shop", "publishedDate": "2019-09-18", "language": "en", "rating": 5}, {"id": 710515135, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d190637-r710515135-Joan_Miro_Foundation-Barcelona_Catalonia.html", "text": "I had no idea that there was a museum of Joan Miro in Barcelona, but when found out I put it on my list of thing to do, even though it was situated a little far from the rest of our planned activities.\nFirst of al I got here by foot from the metro, it is quite a climb so take that into consideration when planning your trip here.\nBut after that this was only a positive surprise, really liked the few pieces I’ve seen by Miro before going here so I felt like my expectations was high, and best of all they also were satisfied! This is a great collection of Joan Miro’s art that comes partly from the family itself. I did not know from before that he did all these different pieces of art, thought him only to be a painter, but that obviously was wrong!\nI will not give anything away by photos, I want you to explore this on your own! As I said this really is my favorite museum on our visit to Barcelona!", "publishedDate": "2019-09-17", "language": "en", "rating": 5}, {"id": 709530693, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d190637-r709530693-Joan_Miro_Foundation-Barcelona_Catalonia.html", "text": "Wife and I stumbled across the Moro museum while on a tour of Barcelona and opted to go in rather than find our way to nearby Fort Montjuïc.  Good choice - not in the least because it is air conditioned!\n\nWe saw much of the art at MOMA-N.Y. many years ago, but is was inspiring to see it again.  And the building itself is an architectural gem - stark white perched in the lush green forest of Mt. Montjuïc ", "publishedDate": "2019-09-13", "language": "en", "rating": 4}, {"id": 709356467, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d190637-r709356467-Joan_Miro_Foundation-Barcelona_Catalonia.html", "text": "Very comprehensive display and explanation on joan miro’s work. Simply amazing and i used the barcelona pass to enter.", "publishedDate": "2019-09-13", "language": "en", "rating": 5}, {"id": 707974732, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d190637-r707974732-Joan_Miro_Foundation-Barcelona_Catalonia.html", "text": "The space is beautiful and interactive for kids. My son really enjoyed the outdoor space and the kids interactive room towards the end of the museum. ", "publishedDate": "2019-09-08", "language": "en", "rating": 5}, {"id": 707528964, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d190637-r707528964-Joan_Miro_Foundation-Barcelona_Catalonia.html", "text": "This is a great place to take a break from the Gothic and Catalan architecture and arts. For those who love modern art, Joan Miro is a legend in pioneering and influencing much of the arts. The museum did a great job showcasing Miro's versatility and transition into different arrays of modern art and for 12 Euros, it is definitely worth it as there is a rich collection showing both Spanish history and Miro's works.", "publishedDate": "2019-09-07", "language": "en", "rating": 5}, {"id": 706730927, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d190637-r706730927-Joan_Miro_Foundation-Barcelona_Catalonia.html", "text": "Loved the modern abstract art.  The museum laid out brilliantly and we spent about 2 hours here.  The biggest and only problem is the walk up the hill to get here  OH MY.  But the views from the balcony are to die for.  Again, trust me....take a cab up here.", "publishedDate": "2019-09-05", "language": "en", "rating": 4}, {"id": 706323621, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d190637-r706323621-Joan_Miro_Foundation-Barcelona_Catalonia.html", "text": "Great museum, great building and great view. From the garden you can see the whole city. You can go or leave from there with the cable car.Is not far.", "publishedDate": "2019-09-04", "language": "en", "rating": 5}, {"id": 704337932, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d190637-r704337932-Joan_Miro_Foundation-Barcelona_Catalonia.html", "text": "Joan Miro Foundation in Barceu is a must visit IF you like Miro! As he is one of my favourite artists I truly enjoyed the visit. I cannot say the same for my wife thought which she also likes his work but.... in small doses!", "publishedDate": "2019-08-29", "language": "en", "rating": 5}, {"id": 701459057, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d190637-r701459057-Joan_Miro_Foundation-Barcelona_Catalonia.html", "text": "Another one for the Barna card, free in with it. No queues, not too busy, well laid out and kids can roam freely. Nice to combine with a visit to to other things around Montjuïc.", "publishedDate": "2019-08-21", "language": "en", "rating": 4}, {"id": 699843478, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d190637-r699843478-Joan_Miro_Foundation-Barcelona_Catalonia.html", "text": "This museum has artwork which spans Miró's creative life. There are paintings, sketches, woven artwork, metal sculptures. Works by a few other artists are presented as well.  The audio tour was very helpful. And the view from the museum over Barcelona is lovely.", "publishedDate": "2019-08-16", "language": "en", "rating": 5}, {"id": 696368530, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d190637-r696368530-Joan_Miro_Foundation-Barcelona_Catalonia.html", "text": "The building was amazing, the art work covered all phases of Miro's career and put his later wilder work in context.\nNice sunny cafe, too.", "publishedDate": "2019-08-06", "language": "en", "rating": 5}, {"id": 696075403, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d190637-r696075403-Joan_Miro_Foundation-Barcelona_Catalonia.html", "text": "We enjoyed our visit to this small but well-presented gallery. The exhibition includes paintings, tapestries and sculptures, including some early landscapes which I really liked. We also really liked the Calder mercury fountain (on show behind glass to protect visitors).\nGood value for money.", "publishedDate": "2019-08-06", "language": "en", "rating": 4}, {"id": 695132500, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d190637-r695132500-Joan_Miro_Foundation-Barcelona_Catalonia.html", "text": "Its nice place to see the art of Joan Miro. Im not so crazy over his actual art, but the museum itself is great.", "publishedDate": "2019-08-03", "language": "en", "rating": 4}, {"id": 691991460, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d190637-r691991460-Joan_Miro_Foundation-Barcelona_Catalonia.html", "text": "The architecture - outer and inner layout - is amazing. It is interesting to view the progress of Miro as he went from small formats to larger than life formats. Also, the influence of other 19th and 20th century artists in Miro's work. His apparent love for color is undeniable. A must-see even if Miro's art isn't one's \"cup of tea.\"  However, I think Miro, as the other great creative minds in human history, preferred to be \"someone's strong shot of whiskey, than everyone's cup of tea.\"", "publishedDate": "2019-07-23", "language": "en", "rating": 5}, {"id": 691175701, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d190637-r691175701-Joan_Miro_Foundation-Barcelona_Catalonia.html", "text": "I have been here several times and never tire of the well curated gallery that covers so much of Miros work. They change the temporary exhibition space regularly which is also good as you get to see a variety of contemporary artists. The roof area not only has wonderful sculptures that are whimsical but also excellent views. I would return again ", "publishedDate": "2019-07-20", "language": "en", "rating": 5}, {"id": 690998118, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d190637-r690998118-Joan_Miro_Foundation-Barcelona_Catalonia.html", "text": "I love Miro's art.  My husband hated it.  It's pretty weird, so you have to want to go here. A little out of the way but if you like art and can stand the Modern Art, you might like it.", "publishedDate": "2019-07-19", "language": "en", "rating": 4}, {"id": 690860067, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d190637-r690860067-Joan_Miro_Foundation-Barcelona_Catalonia.html", "text": "Nice collection of the artists works.  I wish they had more of a selection to choose from for being able to buy some of his works as postcards or small cards.  None of my favourites were there.  It would also be nice to have a few photos or replicas of his most famous works here along with a description of the mosaic on Las Ramblas that he designed.  ", "publishedDate": "2019-07-19", "language": "en", "rating": 4}, {"id": 690594675, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d190637-r690594675-Joan_Miro_Foundation-Barcelona_Catalonia.html", "text": "Born in Barcelona in 1893, Joan Miró is one of the most celebrated artists to hail from the Catalan capital. A painter, ceramicist and sculptor, he is famous for his somewhat surrealist designs which are reminiscent of childhood drawings. His pallet is rich in primary colours such as reds, blues and yellows -present everywhere from his sculptures to his mosaic work Pla de l’Os on La Rambla. He was involved in the design and planning of his own museum, the Fundació Joan Miró, which sits on Montjuïc hill to the south of the city and houses an avant-garde exhibition room for emergent artists alongside the largest collection of Miró’s work in the world.", "publishedDate": "2019-07-18", "language": "en", "rating": 5}, {"id": 690443165, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d190637-r690443165-Joan_Miro_Foundation-Barcelona_Catalonia.html", "text": "Why this kind of museums praise themselves of having hundreds or thousands of works of art and show soo little.\n\nWasting space on unwanted special exhibitions on some kind of nobodies.\n\nVisitors like me go there and pay entrance fee to see works of Miró and as many as possible.\n\nI walked away disappointed.", "publishedDate": "2019-07-17", "language": "en", "rating": 1}, {"id": 690423960, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d190637-r690423960-Joan_Miro_Foundation-Barcelona_Catalonia.html", "text": "Beautiful building and landscape.  Artwork was large scale.  Don't forget to go to the roof for a nice view and photo op.", "publishedDate": "2019-07-17", "language": "en", "rating": 5}, {"id": 690087645, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d190637-r690087645-Joan_Miro_Foundation-Barcelona_Catalonia.html", "text": "We 4 looked at each other and wondered why we chose to spend our afternoon looking at art we didn’t understand or find particularly good. Pretty building, one very nice Calder but otherwise .....  ", "publishedDate": "2019-07-16", "language": "en", "rating": 2}, {"id": 689773594, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d190637-r689773594-Joan_Miro_Foundation-Barcelona_Catalonia.html", "text": "I didnt know much about Joan Miro´s art before coming to Barcelona. But now I love it. Fanatastic gallery with great artwork.", "publishedDate": "2019-07-15", "language": "en", "rating": 5}, {"id": 689270233, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d190637-r689270233-Joan_Miro_Foundation-Barcelona_Catalonia.html", "text": "If you like visiting art galleries, and especially if you like Miro, I would highly recommend this. I am a BIG Miro fan, so this was a must-do during my visit to Barcelona, and it did not disappoint. A gorgeous collection, in perfectly suited surroundings. It's worth a little wander in the grounds outside to enjoy the views. My only quibble would be that the sculpture garden is fairly underwhelming - I expected more from it. But the main event is really inside in the collection.", "publishedDate": "2019-07-13", "language": "en", "rating": 5}, {"id": 689098152, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d190637-r689098152-Joan_Miro_Foundation-Barcelona_Catalonia.html", "text": "Located on Montjuic, this gallery can be approached by using the funicular or buses 55 and 150.  For those with their own transport there is parking available.\nIt should be noted that the gallery is not open on Monday except public holidays and there are restricted opening hours on Sundays.   Although general admission is Euros 13, visitors over 65 can enjoy a concession fee of Euros 7.  The modern architecture of the building makes a visit to this exhibition worthwhile, as well as the wonderful modern art by one of Barcelona's best known artists.", "publishedDate": "2019-07-12", "language": "en", "rating": 4}, {"id": 686554083, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d190637-r686554083-Joan_Miro_Foundation-Barcelona_Catalonia.html", "text": "Hike up the hill to visit a beautiful museum and the art within. Be sure to get  the audio guide. Hike dow the hill to see the Olympic and exposition facilities.", "publishedDate": "2019-07-03", "language": "en", "rating": 5}, {"id": 686207817, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d190637-r686207817-Joan_Miro_Foundation-Barcelona_Catalonia.html", "text": "I was very impressed by this museum and its collection. Miro is a great abstract expressionist and the art here covers all his whimsy and more thoughtful paintings and sculptures. Make sure to check out the Alexander Calder “fountain” of mercury.", "publishedDate": "2019-07-02", "language": "en", "rating": 5}, {"id": 686005698, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d190637-r686005698-Joan_Miro_Foundation-Barcelona_Catalonia.html", "text": "If you love Modern Art, love or even like Miro, or just want to know more about his career as an artist and see some great works by him, then go.", "publishedDate": "2019-07-02", "language": "en", "rating": 5}, {"id": 685728599, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d190637-r685728599-Joan_Miro_Foundation-Barcelona_Catalonia.html", "text": "Joan Miró is one of the most important artists of the twentieth century. His simple forms and primary colours forged a highly personal artistic universe.", "publishedDate": "2019-07-01", "language": "en", "rating": 5}, {"id": 685175300, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d190637-r685175300-Joan_Miro_Foundation-Barcelona_Catalonia.html", "text": "While visiting Montjuic, we stopped at the Miro Museum to expand our cultural spectre. You probably vaguely know the well-knowed Miro's paintings but if you wish to learn more about the artist, you must pay a visit to this museum.\n\nEven if you do not understand or appreciate fully his way of seeing art, the museum helps learning about the artist and his artistic creativity. Some paintings did not appeal to me but overall this colorful art intrigued me. As you pass from one room to another, reading the title of the painting you start to recognize the subject in all these colours. A woman there, a bird, a star, sun or moon, etc.\n\nNot to be missed the Calder's mercury fountain. Mesmerizing!", "publishedDate": "2019-06-29", "language": "en", "rating": 4}, {"id": 684084327, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d190637-r684084327-Joan_Miro_Foundation-Barcelona_Catalonia.html", "text": "If you like modern art and Miro, this is a great museum w/many of his most famous works --- ranging from his earliest to latest work.   The architecture of the museum works very well with the collection", "publishedDate": "2019-06-24", "language": "en", "rating": 5}, {"id": 683915560, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d190637-r683915560-Joan_Miro_Foundation-Barcelona_Catalonia.html", "text": "Perhaps we're just not sophisticated enough, but Miro's artwork wasn't at all impressive to us.  One example - a blue dot on an otherwise white canvas, really?  The Calder Mercury Fountain was very cool though.  We liked the Dali Museum in Figures so much better.", "publishedDate": "2019-06-24", "language": "en", "rating": 3}, {"id": 683505806, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d190637-r683505806-Joan_Miro_Foundation-Barcelona_Catalonia.html", "text": "Beautiful location on Montjuic. \nI'm not super familiar with Miro's work (or at least I wasn't when I visited), yet I found this visit to be amazing. Highly recommended if you're looking for art in Barcelona.", "publishedDate": "2019-06-22", "language": "en", "rating": 5}, {"id": 682525644, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d190637-r682525644-Joan_Miro_Foundation-Barcelona_Catalonia.html", "text": "We only have seen the permanent exhibition of the museum. It has not too much artwork of Miro in my opinion or at least not the better-known works but the exhibition was a nice experience and had a good atmosphere!", "publishedDate": "2019-06-18", "language": "en", "rating": 4}, {"id": 682486399, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d190637-r682486399-Joan_Miro_Foundation-Barcelona_Catalonia.html", "text": "I visited the Fundacio Joan Miro on my last day in Barcelona. It was a wonderful way to spend a few hours, enjoying the interesting works of art and also a splendid view of the city. I bought quite a few souvenirs in the gift shop - they are not the usual Barcelona knick-knacks!", "publishedDate": "2019-06-18", "language": "en", "rating": 5}, {"id": 681774515, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d190637-r681774515-Joan_Miro_Foundation-Barcelona_Catalonia.html", "text": "I think if you love Miro, you'll love this, and if you don't love Miro, you just won't get this. I loved it. Neat building and just incredible art. Wish the outside had been available on a rainy day, just so we could see his sculptures up close. ", "publishedDate": "2019-06-15", "language": "en", "rating": 5}, {"id": 681515342, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d190637-r681515342-Joan_Miro_Foundation-Barcelona_Catalonia.html", "text": "I don't count myself as a great Miro fan but I really enjoyed the visit. Here is chance to see the development of his work from a young age and to have a bit of an insight into the factors that influenced him.  An amazing array of his work in all its its modalities through paint,sculpture and bronzes.  In a city with so much to offer this is well worth a visit.", "publishedDate": "2019-06-14", "language": "en", "rating": 5}, {"id": 680993997, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d190637-r680993997-Joan_Miro_Foundation-Barcelona_Catalonia.html", "text": "This is good to visit if you're an art lover, or if you wanna have the full picture of the modernismo and why Barcelona looks the way it does, or if you have already done everything else and have time left. It is a bit out of the way, although the hop-on-hop-off bus stops there. Surely not time wasted, but if you're not into art, you may skip it too. ", "publishedDate": "2019-06-12", "language": "en", "rating": 4}, {"id": 680136848, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d190637-r680136848-Joan_Miro_Foundation-Barcelona_Catalonia.html", "text": "it was a complete waste of time, what we saw inside we couldn't even call it art, some painting have only one scratch mark or only one dot, I didn't see any creativity in any of the painting, wondering how this artist manage to get a name whereas million of street artist are much more talented and not known.", "publishedDate": "2019-06-09", "language": "en", "rating": 1}, {"id": 680078559, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d190637-r680078559-Joan_Miro_Foundation-Barcelona_Catalonia.html", "text": "This is a museum with an excellent, focused collection, in an attractive building.  It is just the right size for a visit.  By the time I was ready to stop, unable to absorb more, we had gone to the end.", "publishedDate": "2019-06-08", "language": "en", "rating": 5}, {"id": 680064938, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d190637-r680064938-Joan_Miro_Foundation-Barcelona_Catalonia.html", "text": "I hadn't been to this museum in over 25 years and enjoyed returning. Nice selection of art work and sculpture. My 12 year old was not impressed with his work. ", "publishedDate": "2019-06-08", "language": "en", "rating": 4}, {"id": 679967534, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d190637-r679967534-Joan_Miro_Foundation-Barcelona_Catalonia.html", "text": "Miro was a 'modern artist' so it might not appeal to all and whilst I am more of a traditionalist I found plenty here to like.  The gallery comprises large white rooms with plenty of space to view the art work, which is sympathetically lit to show off the works at their best. It is a small welcoming place and wasn't crowded like the big Madrid galleries can get.  There is something for everyone with a good mix of sculptures, paintings and tapestry and I was particularly interested in the very clever Mercury Fountain. There is a good panoramic view from an open terrace over a sculpture and out over the city. Entrance was €13 (adult) and as the gallery is privately owned you cannot enter for free on the first Sunday of the month as elsewhere in municipal galleries.  However you can round the visit off in the inexpensive coffee bar where the staff are excellent, coffee is good and the surroundings relaxing and shady on a hot day.", "publishedDate": "2019-06-08", "language": "en", "rating": 5}, {"id": 679558428, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d190637-r679558428-Joan_Miro_Foundation-Barcelona_Catalonia.html", "text": "To visit any of the museums in Barcelona you should buy the all museum pass.  We did not find out about it until after we bought tickets to Fundacio Joan Miro.  The museum and displays were very well done and enjoyable and the locationin the hills is very interesting to walk around there is a large park adjacent to the Fundacio which is fun to explore on a nice day.", "publishedDate": "2019-06-06", "language": "en", "rating": 4}, {"id": 679319365, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d190637-r679319365-Joan_Miro_Foundation-Barcelona_Catalonia.html", "text": "This is a museum of modern art honoring Joan Miró (1893-1983), a Catalan artist. It is located on the hill called Montjuïc in Barcelona. We took the green metro line (L3) to Parallel, then switched to the funicular (included in the metro ticket) up to Montjuic, then turn right out of the station and walk about ten minutes up the hill until you reach the museum. (Note: The red route on BusTuristic Hop On-Hop Off bus stops in front of the Fundació Joan Miró.) The admission cost was 7,00€ per Senior (65+).   I am not a big abstract art fan, but did enjoy the roof top terrace where you can admire Miró's colorful sculpures along with a wonderful view of Barcelona. We did not rent the audio guide.", "publishedDate": "2019-06-05", "language": "en", "rating": 4}, {"id": 679204208, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d190637-r679204208-Joan_Miro_Foundation-Barcelona_Catalonia.html", "text": "Our initial plan was to stroll around Montjuic and the cable car brought us here.  It is a wonderful mid-day stop when the sun is hot or it is raining.  Cafe and bookshop delightful.  Art is memorable.  Highly recommended", "publishedDate": "2019-06-05", "language": "en", "rating": 5}, {"id": 679064359, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d190637-r679064359-Joan_Miro_Foundation-Barcelona_Catalonia.html", "text": "a good size museum. not too big, not too small. wonderful setting and view. we were disappointed as the terrace was closed and we couldn't view the sculptures there.", "publishedDate": "2019-06-04", "language": "en", "rating": 5}, {"id": 679059201, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d190637-r679059201-Joan_Miro_Foundation-Barcelona_Catalonia.html", "text": "The Joan Miro Museum was nice.  The surroundings compete in meeting one's need to watch beautiful scenery.", "publishedDate": "2019-06-04", "language": "en", "rating": 5}, {"id": 678901978, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d190637-r678901978-Joan_Miro_Foundation-Barcelona_Catalonia.html", "text": "Fundacio was a nice visit and value for money compared to other Barcelo a sites.\nSome excellent views of the city as well. The Miro exhibits were interesting but as always the picture explanations were pretentious and unnecessary.", "publishedDate": "2019-06-04", "language": "en", "rating": 3}, {"id": 678576133, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d190637-r678576133-Joan_Miro_Foundation-Barcelona_Catalonia.html", "text": "The entrance was free when we visited the museum. The kids loved it! All the colors and different techniques made it exciting! Miro is a great artist and the exhibition nicely set. ", "publishedDate": "2019-06-03", "language": "en", "rating": 4}, {"id": 676980402, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d190637-r676980402-Joan_Miro_Foundation-Barcelona_Catalonia.html", "text": "4th Barcelona visit, 4th Miro visit. The setting, architecture, and of course art make this one of my happy places. ", "publishedDate": "2019-05-27", "language": "en", "rating": 5}, {"id": 676152030, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d190637-r676152030-Joan_Miro_Foundation-Barcelona_Catalonia.html", "text": "Not a must see unless you are a big Miro fan, the best part of the museum is the great view from the roof.", "publishedDate": "2019-05-24", "language": "en", "rating": 2}, {"id": 675505724, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d190637-r675505724-Joan_Miro_Foundation-Barcelona_Catalonia.html", "text": "Glad we took a taxi to the Miro Museum as it is up a steep hill. My Partner picked this Museum and he made a good choice. We were rewarded with minimal crowds and used a audio guide from the Museum. Miro was a surrealist so be prepared 😀\nThe audio guide really helped us appreciate his work.", "publishedDate": "2019-05-21", "language": "en", "rating": 5}, {"id": 674612497, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d190637-r674612497-Joan_Miro_Foundation-Barcelona_Catalonia.html", "text": "A glass and concrete modern building housing works mostly by Miro, though there are a few other artists represented as well. It therefore aids your enjoyment if you are a fan of the artists work. I find it distinctive and recognisable, but I am not sure I understand it. For me, some of his early work was interesting and I loved the mercury fountain by Alexander Calder, fortunately sealed away so the deadly fumes do not affect the audience. \nWell worth a visit, and in a lovely area, but you need to like Miro's work.", "publishedDate": "2019-05-17", "language": "en", "rating": 4}, {"id": 674601764, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d190637-r674601764-Joan_Miro_Foundation-Barcelona_Catalonia.html", "text": "I happen to be a big Joan Mirò fan so I sought out this museum, but don't miss it! It is so worth it to see all the pieces I hadn't seen before, particularly the sculptures, all in one location. It's smaller than all the other very worth Barcelona museums, without the crowds, and has a great gift shop too. The larger pieces were spectacular. We ate lunch in the cafe on the patio surrounded by the adorable sculptures there. If you're going up to Montjuic, do NOT miss this.", "publishedDate": "2019-05-17", "language": "en", "rating": 5}, {"id": 674521841, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d190637-r674521841-Joan_Miro_Foundation-Barcelona_Catalonia.html", "text": "If you're on your first visit to Barcelona this gallery is a must visit. \n\nNot only for the chronological and stunning collection of Miro art works, but also the amazing architecture of the foundation building itself, which is set in the beautiful surroundings of the Mont Juic Park \n\nIts a beautiful walk up from Parallel up the side of the Mount Juic, so by the time you arrive at the gallery you are surrounded by stunning views, which then get even better once you go inside. \n\nGive yourself some time, as i was in here for over 3 hours.", "publishedDate": "2019-05-17", "language": "en", "rating": 4}, {"id": 674332435, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d190637-r674332435-Joan_Miro_Foundation-Barcelona_Catalonia.html", "text": "Located in the mountain of Montjuic in a building of rationalist style, designed jointly by the artist Joan Miró and by the architect Josep Lluís Sert.\nYou can contemplate the exhibition of the most representative work of Miró, temporary exhibitions and from the terrace a magnificent view of the city of Barcelona", "publishedDate": "2019-05-16", "language": "en", "rating": 4}, {"id": 674278703, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d190637-r674278703-Joan_Miro_Foundation-Barcelona_Catalonia.html", "text": "Full video review on YouTube by the TravelClast \n\nThe Miro Foundation is located in a beautiful park above the city, and holds a rare collection of the famous artists more colorful pieces, including some breathtaking tapestries that we didn't even know existed. Even more rare is a semi hidden fountain the artist created using real mercury as the fluid. It is the only one of its kind, and is kept behind a glass sealed room as the liquid metal is highly poisonous, but also extremely beautiful.", "publishedDate": "2019-05-15", "language": "en", "rating": 4}, {"id": 673099097, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d190637-r673099097-Joan_Miro_Foundation-Barcelona_Catalonia.html", "text": "What a beautiful museum, art gallery, building. I can’t believe I’d been to Barcelona so many times and never visited it. Do yourself a favour and go. I took the audio guide for €5 more and it was totally worth it.", "publishedDate": "2019-05-10", "language": "en", "rating": 5}, {"id": 672979742, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d190637-r672979742-Joan_Miro_Foundation-Barcelona_Catalonia.html", "text": "Interesting exhibit of the artist work. Great views of the terrace.  Mediocre customer service and less than mediocre audio guide.", "publishedDate": "2019-05-10", "language": "en", "rating": 3}, {"id": 672973804, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d190637-r672973804-Joan_Miro_Foundation-Barcelona_Catalonia.html", "text": "Even if you are not a fan of Miro you may become one after visiting .  What a lovely presentation of Miro's work in a space as interesting as the works inside.", "publishedDate": "2019-05-10", "language": "en", "rating": 5}, {"id": 672949635, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d190637-r672949635-Joan_Miro_Foundation-Barcelona_Catalonia.html", "text": "A joyful place with a wonderful collection. Take the metro to the funicular to the top. Then a short walk to this wonderful museum. nice views from the terrace as well. Admission was included in our Barcelona card. ", "publishedDate": "2019-05-10", "language": "en", "rating": 5}, {"id": 671683958, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d190637-r671683958-Joan_Miro_Foundation-Barcelona_Catalonia.html", "text": "Plato was thinking of beauty as a reminiscence from the past. Hegel as the reunion of form and content. Not sure where Miro sits, or if any artist has an existence after Cézanne’s intensity ? \n\nFor sure, his colourful search is enlightening, but for the rest, is it Art or luxurious Imposture for collectors ? \n\nIn any case, the place recalls the Maeght foundation in st paul de vence - of course, same architect. Minimalistic, plain building, missing the creation of some uplifting emotions though. \nRoof top is great on a sunny day, overseeing Barcelona. \n\nGo and make up your mind !", "publishedDate": "2019-05-05", "language": "en", "rating": 4}, {"id": 671151911, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d190637-r671151911-Joan_Miro_Foundation-Barcelona_Catalonia.html", "text": "We visited this museum by chance. However we were glad we stumbled across it as we found it extremely interesting. There are some excellent works inside and despite the fact not all of them would appeal to too many people, they are nevertheless, stunning. Joan Miró himself was instrumental in the creation of The Fundació Joan Miró. Unfortunately, we were not allowed to take any photos inside. This Museum is definitely worth a visit, if you are a Joan Miro fan.", "publishedDate": "2019-05-03", "language": "en", "rating": 4}, {"id": 670896406, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d190637-r670896406-Joan_Miro_Foundation-Barcelona_Catalonia.html", "text": "I’m not a particularly big fan of Juan Miro, but I really enjoyed this museum. Like the Picasso Museum and others, you can see the transition these artists took from traditional painting into the abstract and similar modern forms. But my favorite part were the temporary exhibits, particularly one designer/architect influenced by Miro. It’s a pleasant museum to walk around, and the views overlooking the mountains are quite gorgeous. The museum also has a small cafe in the courtyard on the ground floor. If the weather is right and there is time, consider walking through the park next door. It is lovely!", "publishedDate": "2019-05-02", "language": "en", "rating": 5}, {"id": 669883219, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d190637-r669883219-Joan_Miro_Foundation-Barcelona_Catalonia.html", "text": "We've seen Miro's artwork before, but never like this. The physical space lent itself beautifully to the mass of tourists; we could focus completely on the art. Two hours flew by.... Love the hanging tapestry. Recommend taking the footpath down the mountain afterwards to view the urban art (graffiti) and the beautiful Barcelona skyline. ", "publishedDate": "2019-04-28", "language": "en", "rating": 5}, {"id": 668655016, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d190637-r668655016-Joan_Miro_Foundation-Barcelona_Catalonia.html", "text": "I enjoy Miro’s art - so was chuffed to see his work, it is beautifully displayed space give to his larger pieces. A great opportunity to learn more about the man and his work. Stunning location.", "publishedDate": "2019-04-23", "language": "en", "rating": 4}, {"id": 668141013, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d190637-r668141013-Joan_Miro_Foundation-Barcelona_Catalonia.html", "text": "We really like Joan Miro and as you may expect, we saw more of his art than what we’ve seen in all other museums combined. Would recommend to anyone who likes the arrest. ", "publishedDate": "2019-04-21", "language": "en", "rating": 5}, {"id": 668068273, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d190637-r668068273-Joan_Miro_Foundation-Barcelona_Catalonia.html", "text": "Cost a bit too much for what it is. I am not a modern art lover but this was just awful.\nMost art was scribbles with pretentious titles (2+5=7). The art I will remember the most is a blue dot on a giant white canvas taking up half a wall, then 3 similar sized white canvass with a single black scratch on each. Please tell me how that is art without writing an essay of a description or knowing the artist themselves. So I will remember those for the rest of my life. Oh and an egg on a stool.\nI know the artist is important to the culture in Catalonia but I still don't get an entire building dedicated. The building itself is nice for brutalist architecture! If you're into that. The gardens all around are amazing.\nOur Spain Guidebook gave this more stars than the fort at the top of the hill which is cheaper to visit. Fort was awesome and less busy but we went first thing in the morning. \n\nTo each their own!", "publishedDate": "2019-04-21", "language": "en", "rating": 1}, {"id": 667652683, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d190637-r667652683-Joan_Miro_Foundation-Barcelona_Catalonia.html", "text": "We spent 2 highly enjoyable hours touring this lovely museum in the Montjuïc area. Audio guide was very useful in appreciating Miro’s creativity and genius. Also, the gardens and surrounding pathways add to the museum’s appeal. Highly recommend for those who want to learn more about modernism.", "publishedDate": "2019-04-19", "language": "en", "rating": 5}, {"id": 667627401, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d190637-r667627401-Joan_Miro_Foundation-Barcelona_Catalonia.html", "text": "Well worth the trip up the hill to see Miró Museum's collection; plus there are the gardens to visit and the cable car nearby, whcih is also fun to do.", "publishedDate": "2019-04-19", "language": "en", "rating": 5}, {"id": 666082110, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d190637-r666082110-Joan_Miro_Foundation-Barcelona_Catalonia.html", "text": "I thoroughly enjoyed this deep dive into Miró.  Perhaps not for everyone but if you like modern art this is a must.  Get the audio tour- more than you ever wanted to know about a brilliant and unusual artist ", "publishedDate": "2019-04-13", "language": "en", "rating": 5}, {"id": 665303321, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d190637-r665303321-Joan_Miro_Foundation-Barcelona_Catalonia.html", "text": "You should visit the Joan Miró Foundation because it is an amazing collection and a beautiful building.\nYou can see an excellent Miro's paintings and other contemporary pieces like Calder's Mercury fountain. You shouldn't miss the fabulous views of the city from the upper terrace.", "publishedDate": "2019-04-10", "language": "en", "rating": 4}, {"id": 665103050, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d190637-r665103050-Joan_Miro_Foundation-Barcelona_Catalonia.html", "text": "Went as passing following a trip to Montjuic.  Thought Miro would be interesting, but left a fan.  Definitely worth going.  ", "publishedDate": "2019-04-09", "language": "en", "rating": 5}, {"id": 663484574, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d190637-r663484574-Joan_Miro_Foundation-Barcelona_Catalonia.html", "text": "This gallery is a hike to the top of the mountain, but a great collection of the artist's work in a beautiful setting. I was surprised to find his best pottery work was actually in the Museum of Design many kilometres away.", "publishedDate": "2019-04-03", "language": "en", "rating": 4}, {"id": 663234316, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d190637-r663234316-Joan_Miro_Foundation-Barcelona_Catalonia.html", "text": "Well worth a two hour visit, this museum (near Montjuic Park and the Olympic stadium on the elevated area south of main tourist areas) should be strongly considered during a visit to Barcelona. It relates the work of Joan Miro to periods in his life, with a large collection of his work (and some works in tribute to him by Calder and Matisse for example.)\nGetting there: (1) a 45 min walk including quite a few stairs—easily mapped on any app (2) similarly, metro and bus routes well-publicized, and (3) hop on/hop off tour buses. We walked, enjoying stops at several markets.\nAdmission: 13 € adult, 7€ over 65 or 15-30 student; other selected discounts. Participates in the  30 € Arts passport (though you are unlikely to opt to visit more than 2 of the 6 sites left in your own). Store any bag in tje provided locked lockers (1 €, returned to you when you return the key). Photographs without flash allowed. Tasteful gift shop, small library. Small earring area. Clean restrooms.\nWhile at this elevation: exit the museum and head left toward the funicular and continue a slight right up the hill 20 minutes to the fortress where the views looking back to the city and toward the seaport and ocean are impressive.", "publishedDate": "2019-04-02", "language": "en", "rating": 5}, {"id": 662705598, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d190637-r662705598-Joan_Miro_Foundation-Barcelona_Catalonia.html", "text": "We made a mistake and decided it looked like a short walk from the port. The walk was vertical and we probably should have approached from the other end where the escalators are. I wouldn’t have made the effort for anyone but Miro. Wonderfull gallery and a beautifully appointed space. Seeing so many of his works together made me see him differently and understand the huge influence he has had on modern Australian art. ", "publishedDate": "2019-04-01", "language": "en", "rating": 5}, {"id": 662603224, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d190637-r662603224-Joan_Miro_Foundation-Barcelona_Catalonia.html", "text": "This is a must if you are visiting Barcelona and you like Miro. It's an amazing place to visit also very close to the Stadium.\nI enjoyed the architecture of the museum too.\nSi te gusta Miro este es un lugar que no se debe perder. Muy bello y especial", "publishedDate": "2019-03-31", "language": "en", "rating": 5}, {"id": 662312054, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d190637-r662312054-Joan_Miro_Foundation-Barcelona_Catalonia.html", "text": "Great examples of Miro's painting and sculptures.  Pleasant cafe for snack or you can have full lunch in the dining area, complete with wine and tablecloths.  Gift shop very pricey.", "publishedDate": "2019-03-30", "language": "en", "rating": 5}, {"id": 662112480, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d190637-r662112480-Joan_Miro_Foundation-Barcelona_Catalonia.html", "text": "We took the \"old\" (1905) funicular (\"telefericos de Barcelona\" -- the red and white cars) up the hill (Montjuic).  A spectular ride for 11 euros -- but not for the faint-hearted/scared of heights -- with great views of the city.  Step off the cable car and walk along the road, a gradual uphill, for 10 minutes or so, and you will be at the Joan Miro museum.   The museum features both wonderful paintings and sculptures, and also uplifting architecture.  Make sure you go on the roof -- some unusual sculptures, and great views -- and the courtyard with the ancient olive tree.  In good weather, grab a snack at the cafe and sit outside.  We did the audio tour and found it worthwhile.", "publishedDate": "2019-03-29", "language": "en", "rating": 5}, {"id": 661335407, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d190637-r661335407-Joan_Miro_Foundation-Barcelona_Catalonia.html", "text": "Even if Miro isn't your taste, this museum is very well curated.. And, you can get very up close and personal with the pieces.. both in and out doors!\n\nIt is set on up on a hill, so there are exquisite views from the terraces..\n\nSensational way to spend a couple of hours!", "publishedDate": "2019-03-26", "language": "en", "rating": 5}, {"id": 661023118, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d190637-r661023118-Joan_Miro_Foundation-Barcelona_Catalonia.html", "text": "This was a great place to visit and provided a great view of BCN from the terraces. Keep in mind the Funicular is closed, so if you were planning on doing that as part of your journey to the museum, check first to see if it has reopened.", "publishedDate": "2019-03-25", "language": "en", "rating": 5}, {"id": 660953583, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d190637-r660953583-Joan_Miro_Foundation-Barcelona_Catalonia.html", "text": "If you are in the Montjuic area, check out this museum.  The pieces are whimsical and well organized.  You can plan to spend about 1.5 hours here to walk through all of the exhibit.  ", "publishedDate": "2019-03-24", "language": "en", "rating": 4}, {"id": 660139000, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d190637-r660139000-Joan_Miro_Foundation-Barcelona_Catalonia.html", "text": "Loved that it’s close to a beautiful park so the trip was worth it, there was another thing to do in the area. I was able to see it all despite making it there close to their closing time. Staff was very friendly and gave me good tips to manage the time left with the exhibitions. Is a must see if you are an art lover. ", "publishedDate": "2019-03-21", "language": "en", "rating": 5}, {"id": 660001853, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d190637-r660001853-Joan_Miro_Foundation-Barcelona_Catalonia.html", "text": "The building is a modern design housing items inside and out.not a massive fan of this type of art but I did appreciate it a lot and some pieces were excellent,cafe and shop were lovely ", "publishedDate": "2019-03-20", "language": "en", "rating": 5}, {"id": 656826035, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d190637-r656826035-Joan_Miro_Foundation-Barcelona_Catalonia.html", "text": "Beautiful surroundings and location, overlooking Barcelona with great views.\nThe art is displayed inside and on the premises outside.\nJoan Mirò and his colours: so joyful! It was well worth the visit.", "publishedDate": "2019-03-06", "language": "en", "rating": 4}, {"id": 656791207, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d190637-r656791207-Joan_Miro_Foundation-Barcelona_Catalonia.html", "text": "A very nicely put together exhibition of Miro’s work. You can love it or hate it. I loved most of it. We went up there with the bus and enjoyed watching some nice parks on the way up. \nWonderful views over Barcelona from the museum.", "publishedDate": "2019-03-06", "language": "en", "rating": 5}, {"id": 656687030, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d190637-r656687030-Joan_Miro_Foundation-Barcelona_Catalonia.html", "text": "The collection of works is very impressive and the building itself is wonderfully calming, light and airy. A great environment to enjoy world class art. I’d recommend avoiding going on a weekend if possible, it was a little too busy when I visited on a Saturday morning.", "publishedDate": "2019-03-05", "language": "en", "rating": 4}, {"id": 655962827, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d190637-r655962827-Joan_Miro_Foundation-Barcelona_Catalonia.html", "text": "If you are a fan of Joan Mirò this is a must-visit for you. If you never heard of Miró this is even more a must-visit for you! Why? Because the Foundation offers you a complete outlook to his work, artistic ideology and thoughts... and because you should not miss to get to know Joan Mirò’s importance in the Catalan culture and history! I would always rather choose to come here then to Museo Picasso because it has more artistical and cultural value. He is not so well known, but is one of the greatest avant-garde artist (paintor and a sculptor) and surely a symbolic figure for Barçelona, as much as Gaudí! Ask any Catalan! His art is astonishing, impressive and joyful, and the Foundation is a conceptual place. Moreover, it is in the middle of the Monjuic parc, with incredible views so you will have a great stroll to and from it... it is well balanced and interlaced with Mirò’s work! I stronly advise you to come here and broaden your knowledge on contemporary Spanish art!", "publishedDate": "2019-03-03", "language": "en", "rating": 5}, {"id": 655006383, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d190637-r655006383-Joan_Miro_Foundation-Barcelona_Catalonia.html", "text": "Inside the par montjuic and occupying a modern and beautiful building, one will find some of the genius masterpieces, along with temporary expositions and some of the artist’s biography. Some open spaces with Miró nice sculptures. Wonderful!", "publishedDate": "2019-02-26", "language": "en", "rating": 5}, {"id": 653979231, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d190637-r653979231-Joan_Miro_Foundation-Barcelona_Catalonia.html", "text": "This was probably my favorite museum during my visit to Barcelona (out of many outstanding museums).  Miro was in many ways an anti-artist in his art.  Be sure to watch the videos on Miro to learn about his thoughts on art, life et al.  There was also an excellent exhibit of Lina Bo Bardi drawings and sketches on display.  ", "publishedDate": "2019-02-21", "language": "en", "rating": 5}, {"id": 653719444, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d190637-r653719444-Joan_Miro_Foundation-Barcelona_Catalonia.html", "text": "Every time I am in BCN I re-visit this wonderful site.  Miro's art inspires and is put on perfect view in this modernist building. ", "publishedDate": "2019-02-20", "language": "en", "rating": 5}, {"id": 653545697, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d190637-r653545697-Joan_Miro_Foundation-Barcelona_Catalonia.html", "text": "Wonderful gallery. Beautiful setting. Incredible collection. Lovely cafe and shop. The views and the layout of the gallery are wonderful as is the ride up and walk down to Plaça España ", "publishedDate": "2019-02-19", "language": "en", "rating": 5}, {"id": 650618024, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d190637-r650618024-Joan_Miro_Foundation-Barcelona_Catalonia.html", "text": "I was feeling overwhelmed by the ornateness and seriousness of the Gotic Quarter, Sagrada de Famila, and Gaudi.  A visit to the Joan Miro museum on Montjuic was just what I needed.  Firstly, Montjuic is a wooded setting with beautiful views to the city below and to the sea. The building for this museum relates perfectly to Miro and his art.  As with so much of Miro's work, it is fanciful, geometric and simple.  Don't miss the patio overlooking the city or the rooftop.  The contents of the museum show the full spectrum of Miro's work.  You experience Miro's artistic curiosity and wit.", "publishedDate": "2019-02-06", "language": "en", "rating": 5}, {"id": 649894616, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d190637-r649894616-Joan_Miro_Foundation-Barcelona_Catalonia.html", "text": "I've spent there about 4 hours. The collection is really impressive. Plus a beautiful park around. And don't miss the views from the roof ;)", "publishedDate": "2019-02-03", "language": "en", "rating": 5}, {"id": 648522664, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d190637-r648522664-Joan_Miro_Foundation-Barcelona_Catalonia.html", "text": "If you like Miro, or abstract art and installation, this is a Must.  I visited several museums of Piccasso art including in Madrid and South of France, So i decided to visit this one instead of Picasso museum.  I saw many Miro arts in the past but here is absolutely different, many unusual pieces, gigantic, paintings and  artwork using different art media and installations.  I personally love art history from classical to modern art work.  \n\nPlan ahead . 30 mins by metro and bus up the hill.  Cable car is closed under maintanence currently. Bought tickets online withiut timeslot.  Restaurant and bistro in museum are not bad. We ate lunch in restaurant with nice view there before the tour. My friend didn‘t appreciate modern art and I love it! \n\nOnce we finished, we took the bus down and stop by  The Museu Nacional d'Art de Catalunya, for more classical artworks. \n\nThen watch the sunset from there at the busy runabout on top of a shopping mail at Pl. Espanya! \n\nWe spent a full day of both museums in same vicinity on our last day, 4th day.", "publishedDate": "2019-01-27", "language": "en", "rating": 5}, {"id": 647212912, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d190637-r647212912-Joan_Miro_Foundation-Barcelona_Catalonia.html", "text": "It’s a sweet little place on a sweet hillside. Miro fans will keep it busy....as for me,  I am not a huge fan of Miro, but was pleasantly surprised by seeing works I hadn’t known of before — as they are not his most famous works and yet I found them to be My favorites.  So, try it. You may also be pleasantly surprised.", "publishedDate": "2019-01-20", "language": "en", "rating": 3}, {"id": 646130491, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d190637-r646130491-Joan_Miro_Foundation-Barcelona_Catalonia.html", "text": "a museum that should not be missed.if you have a barcelona pass or a city bus ticket you have a discount that you can use to buy the ticket. a very well organized museum", "publishedDate": "2019-01-15", "language": "en", "rating": 5}, {"id": 646068950, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d190637-r646068950-Joan_Miro_Foundation-Barcelona_Catalonia.html", "text": "Great art, lovely spaces, very good cafe. The works are arranged intelligently,  allowing an exploration of the development of Miro's many perspectives.", "publishedDate": "2019-01-15", "language": "en", "rating": 5}, {"id": 646051732, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d190637-r646051732-Joan_Miro_Foundation-Barcelona_Catalonia.html", "text": "The museum is in a beautiful building The art is complex but well discussed in the audio guide.  And it’s all in a lovely location on historic Montjuic.  Well worth the visit.", "publishedDate": "2019-01-15", "language": "en", "rating": 5}, {"id": 645488390, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d190637-r645488390-Joan_Miro_Foundation-Barcelona_Catalonia.html", "text": "This Gallery is well worth visiting.  It was surprising to see how talented Joan Miro was as a 14 year old boy.  Many many rooms of his art.  Lovely outside terrace.  ", "publishedDate": "2019-01-13", "language": "en", "rating": 5}, {"id": 644205136, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d190637-r644205136-Joan_Miro_Foundation-Barcelona_Catalonia.html", "text": "Of course Miro fans will love it here, there is quite a large collection of his works and also works by other artists. The building itself is also interesting. We are so-so fans of his and still enjoyed it, but if you do not like this kind of abstract art then I would not bother coming.", "publishedDate": "2019-01-06", "language": "en", "rating": 4}, {"id": 644132740, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d190637-r644132740-Joan_Miro_Foundation-Barcelona_Catalonia.html", "text": "There are a few must-sees in Barcelona, and the Fundacio Joan Miro on Montjuic is one of them. for me, it's not just about the artwork, but like the Guggenheim Bilbao, it's also about the architecture and the setting. Not only is the building impressive, showing off the collection to its advantage, but there are many spaces for lingering and observing, as well as to take in the beautiful vistas. Give yourself ample time to enjoy this spot. BTW, the audio guide was really good--we learned a lot.", "publishedDate": "2019-01-06", "language": "en", "rating": 5}, {"id": 642076748, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d190637-r642076748-Joan_Miro_Foundation-Barcelona_Catalonia.html", "text": "The Miro building is lovely.  Set high over the city with dramatic city views and forestry, with the added benefit of being close to the cable car, it is a great day out.  Miro is certainly not a favoured artist so we were lucky to see a Lee Miller exhibition (at no extra cost) which was superb.  Inexpensive entry fee and a great experience", "publishedDate": "2018-12-28", "language": "en", "rating": 4}, {"id": 641840600, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d190637-r641840600-Joan_Miro_Foundation-Barcelona_Catalonia.html", "text": "Large collection with abstract arts and some really strangely simply paintings like a single tiny blue dot on a big white canvas. Some unusual piece like burnt canvas. The only worthy thing to see in my opinion is the roof top panorama view of the city from the mountain. Picture worthy!!! ", "publishedDate": "2018-12-27", "language": "en", "rating": 3}, {"id": 640970946, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d190637-r640970946-Joan_Miro_Foundation-Barcelona_Catalonia.html", "text": "If you like Miro's art, this is the place for you.  We aren't great fans of his style, so we didn't spend much time here.  ", "publishedDate": "2018-12-22", "language": "en", "rating": 2}, {"id": 640369181, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d190637-r640369181-Joan_Miro_Foundation-Barcelona_Catalonia.html", "text": "Just go there, and use the audio guide. The art, museum environment (inside and outside), are superlative. Highly recommended.", "publishedDate": "2018-12-18", "language": "en", "rating": 5}, {"id": 640191846, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d190637-r640191846-Joan_Miro_Foundation-Barcelona_Catalonia.html", "text": "Take a bus to the top and enjoy a stroll around this interesting Miró Foundation. The Mercury Fountain was fascinating. Maybe not to everyone’s taste but fun all the same. Gift shop was reasonably priced and the cafe also had a restaurant side. The view at the back was lovely. ", "publishedDate": "2018-12-17", "language": "en", "rating": 4}, {"id": 638627329, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d190637-r638627329-Joan_Miro_Foundation-Barcelona_Catalonia.html", "text": "The audio guide was well worth listening to for the permanent Miro exhibit but poor for the temporary one (repeating same text for different pictures). Enjoyed the café having a place to recharge. Building and terrace views were excellent.", "publishedDate": "2018-12-10", "language": "en", "rating": 4}, {"id": 638409504, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d190637-r638409504-Joan_Miro_Foundation-Barcelona_Catalonia.html", "text": "I signed up for the 11am tour in English and have to give it high marks. Incredibly informative, the audio headset that amplifies the guide's voice makes it really easy to hear. Our guide Judith was top notch and her English was very good. I learned so much about Miro and his work. Would highly recommend this for art lovers and all tourists to Barcelona. Learning about famous artists from vacation regions is a passion of mine, but for one hour, I can see that anyone would fully enjoy this tour. From this museum, you can walk all over the Montjuic area and visit the National Museum, see the beautiful fountains and catch an incredible view of the whole city from up on the roof of the National Museum. ", "publishedDate": "2018-12-09", "language": "en", "rating": 5}, {"id": 638043820, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d190637-r638043820-Joan_Miro_Foundation-Barcelona_Catalonia.html", "text": "Never seen any of Miró’s work before. Simply blown away. Beautiful gallery, so well laid out and very informative info. Excellent coffee shop too.", "publishedDate": "2018-12-07", "language": "en", "rating": 5}, {"id": 637758615, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d190637-r637758615-Joan_Miro_Foundation-Barcelona_Catalonia.html", "text": "The place is great and the exposition was nice. The temporary parts are ok although not at the same level.", "publishedDate": "2018-12-05", "language": "en", "rating": 4}, {"id": 635698540, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d190637-r635698540-Joan_Miro_Foundation-Barcelona_Catalonia.html", "text": "A veritable cross section of the art and works of Joan Miro. A film shows him creating a couple of his more famous pieces. The big plus is the they allow the taking of photos. There were several small groups of school children have tours of the museum. They also have secure free lockers for backpacks and stuff. One of the treats is a mercury fountain by a different artist. I'd skip the small restaurant, the food was bland.", "publishedDate": "2018-11-25", "language": "en", "rating": 5}, {"id": 635685050, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d190637-r635685050-Joan_Miro_Foundation-Barcelona_Catalonia.html", "text": "What can I say.  I have visited all the other studios belonging to Miro but this place blew me away especially the 2 floor high textile piece of art which moved me to tears.  Spent several hours just walking around and around again.  Purchased 2 prints to add to my other art work of his I have hanging. Cafe was also very good value.", "publishedDate": "2018-11-25", "language": "en", "rating": 5}, {"id": 635459773, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d190637-r635459773-Joan_Miro_Foundation-Barcelona_Catalonia.html", "text": "just so much enjoyed to learn more about Miro his back ground just amazing discovery of a Creative, intuitive man and artist a child of his time to 'reflect that episode' of turmoil, politics, war...and life as such", "publishedDate": "2018-11-24", "language": "en", "rating": 5}, {"id": 634230982, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d190637-r634230982-Joan_Miro_Foundation-Barcelona_Catalonia.html", "text": "The Miro Museum is must see for any visit to Barcelona. The favorite art sons in this city are Gaudi, Picasso and Miro.  All three contributed heavily to the culture of Barcelona.\n\nThe Miro Museum is in the Montjuic area of the city--it is high on the scenic overlook of the city.  I have photos that show many works of this master. There is a nice restaurant on the premises.\n\nThe museum commemorates the works of Miro, a master in both in sculpture and painting.  Miro actually set up the foundation.", "publishedDate": "2018-11-18", "language": "en", "rating": 5}, {"id": 633648932, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d190637-r633648932-Joan_Miro_Foundation-Barcelona_Catalonia.html", "text": "You don’t have to love Miro to love this museum.  It is simply gorgeous.  Don’t miss the “ beach” overlooking Barcelona or a bite in the cafe.  Small, well set-up and quite a high point for us", "publishedDate": "2018-11-15", "language": "en", "rating": 5}, {"id": 633215730, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d190637-r633215730-Joan_Miro_Foundation-Barcelona_Catalonia.html", "text": "Great museum with lots of great works- some monumental.  Also architecture of the building is great.  A bit difficult to get by public transport.  Would highly recommend it if you have any interest in art.  I thought it was much better than the Picasso museum if you have time for only one.", "publishedDate": "2018-11-13", "language": "en", "rating": 5}, {"id": 632916706, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d190637-r632916706-Joan_Miro_Foundation-Barcelona_Catalonia.html", "text": "This is an amazing Museum with a fantastic collection with some of Miro's greatests waorks. A must see for any fan of Miro!", "publishedDate": "2018-11-12", "language": "en", "rating": 5}, {"id": 632601581, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d190637-r632601581-Joan_Miro_Foundation-Barcelona_Catalonia.html", "text": "Focusses on Miro's early life and work but revealing and well curated and organised. Lovely building too, from where you can walk to the main art gallery at Montjuic", "publishedDate": "2018-11-11", "language": "en", "rating": 5}, {"id": 631414932, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d190637-r631414932-Joan_Miro_Foundation-Barcelona_Catalonia.html", "text": "I really wasn't familiar with Joan Miro's work and I really can't say that I became a fan, but there were some interesting pieces and the location in an area called Montjuic, which is on a hillside looking over the city, is worth visiting for the views.", "publishedDate": "2018-11-06", "language": "en", "rating": 4}, {"id": 630908039, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d190637-r630908039-Joan_Miro_Foundation-Barcelona_Catalonia.html", "text": "We took the tour with audio guide. Not all the pieces have information next to them so i would recommand getting the guide.\n\nThe guide also includes movies and interactive pictures.\n\nThere is a cafetaria and they have lockers where you can store your luggage.\n\nThe museum is privately owned and is not free on the first sunday of the month.\n\nAll considered, Nice building, nice view, but the art was not for us.\nI would go to the mountain, but would not say you have to visit the museum. I looked up extra info online and thought many paintings of the same period were displayed. I missed more variation.", "publishedDate": "2018-11-05", "language": "en", "rating": 3}, {"id": 630174333, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d190637-r630174333-Joan_Miro_Foundation-Barcelona_Catalonia.html", "text": "The site, the location, the building, the art!  Barcelona is a city for art lovers and this museum shows it love for its home boy, Joan Miro.  Go, enjoy!  The audio guides are terrific -- and best of all, the layout works and it is not too overwhelming.  The views are spectacular  -- enjoy the Parc!", "publishedDate": "2018-11-01", "language": "en", "rating": 5}, {"id": 629947057, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d190637-r629947057-Joan_Miro_Foundation-Barcelona_Catalonia.html", "text": "If you're a fan of Miro, this is a must see when in Barcelona.  Situated above the city, (great views btw, wish we had more time to explore the area),  the museum has so many great pieces of his work.\n\nWish it wasn't raining and hailing outside today!  Because it's a bonus, there's so many sculptures outside!  \n\nSo we had to kill time in the cafe and must say, for a museum cafe, the service was great, food was fresh, and the prices were great!\n\nFelt more cultured after leaving this museum today.  He was ahead of his time!!\n\n", "publishedDate": "2018-10-31", "language": "en", "rating": 4}, {"id": 629873292, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d190637-r629873292-Joan_Miro_Foundation-Barcelona_Catalonia.html", "text": "A visit to a great museum and a great painter. Interesting to follow the different productions reflekting trends in society from Miro’s perspective. A place to visit when in Barcelona. A nice lunch at the restaurant made the visit even better.", "publishedDate": "2018-10-31", "language": "en", "rating": 4}, {"id": 629233897, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d190637-r629233897-Joan_Miro_Foundation-Barcelona_Catalonia.html", "text": "this is not a museum for everyone.  however, it has many aspects that make it worthwhile to visit.  \n\nMiro did not create easy art.   his oeuvre was not offensive, but it certainly could be difficult for some.  if you are not interested in modern art, then this museum may be problematic.\n\nif you want to see and study Miro more, then this is a huge opportunity in one building.\n\nthe edifice deserves note:  designed by Sert, it has nice spaces, is easily navigated (although some areas may have problems with wheelchairs).  the rooftop terrace has a superb view of Barcelona.", "publishedDate": "2018-10-28", "language": "en", "rating": 5}, {"id": 629203430, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d190637-r629203430-Joan_Miro_Foundation-Barcelona_Catalonia.html", "text": "Just a brilliant museum and as good as a trip to a museum gets!\n\nPopped in after a walk down from the castle and had a wonderful visit. A beautiful insight into his life and work. \n\nSome wonderful works on display in a beautiful gallery museum fabulously well laid out. \n\nReally really enjoyed our visit, far from being crowded, we had a great relaxed visit and it was very easy to take our time and really enjoy the work on display. \n\nOne of my favourite museum visits that I can remember. \n\nDon’t leave Barca without a visit!\n", "publishedDate": "2018-10-28", "language": "en", "rating": 5}, {"id": 629013983, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d190637-r629013983-Joan_Miro_Foundation-Barcelona_Catalonia.html", "text": "I love Miro, and he is actually one of my most favorite painters. Whenever I visit Barcelona I go there, and I cannot stop admiring his works. Also go up to the roof and you will  see a few wonderful displays", "publishedDate": "2018-10-27", "language": "en", "rating": 5}, {"id": 628928674, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d190637-r628928674-Joan_Miro_Foundation-Barcelona_Catalonia.html", "text": "This is interesting, but there is no direction to where to go, the audio guide does not follow the numbers, crowdy, noisy, and overpriced for what it had to show. Paintings and other oeuvres from Miro are wonderful, but shame on the  audio visit with the guide:(", "publishedDate": "2018-10-27", "language": "en", "rating": 2}, {"id": 627058212, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d190637-r627058212-Joan_Miro_Foundation-Barcelona_Catalonia.html", "text": "Early and late work exhibited, not so much the middle years. Enough to get the flavor. Audioguide tries to explain what the abstract shapes are meant to be - you may or may not buy it. If you love 20th century abstract art, it's great, but even if you don't, it's worth seeing and learning about this major artist.", "publishedDate": "2018-10-21", "language": "en", "rating": 4}, {"id": 626888541, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d190637-r626888541-Joan_Miro_Foundation-Barcelona_Catalonia.html", "text": "This is a very attractive building with Miro exhibits and you do not have to be an appreciator of his art to enjoy the visit. Great city views in a peaceful location with rooftop exhibits", "publishedDate": "2018-10-21", "language": "en", "rating": 5}, {"id": 626158211, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d190637-r626158211-Joan_Miro_Foundation-Barcelona_Catalonia.html", "text": "My partner has a Miro and it was a must to visit the museum. It is full of his work. A tip is to take the Metro to Paral-lel and then the Funicular to the top and the museum is a short walk.", "publishedDate": "2018-10-18", "language": "en", "rating": 5}, {"id": 626022263, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d190637-r626022263-Joan_Miro_Foundation-Barcelona_Catalonia.html", "text": "I love Miro! What a painter/philosopher. Great museum with wonderful views over the city. We walked up the hill to find the museum. Quite the climb. There are other ways up though, so don’t be held back. ", "publishedDate": "2018-10-17", "language": "en", "rating": 5}, {"id": 625955902, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d190637-r625955902-Joan_Miro_Foundation-Barcelona_Catalonia.html", "text": "If you like modern art this is a cannot miss. Since Miro is my favorite artist I was awed by some of the art works there. The view from the patio of the museum looking out to Montjuic was breathtaking and visitors can sit in lounges outside looking over this view. Would not miss this one,", "publishedDate": "2018-10-17", "language": "en", "rating": 5}, {"id": 625346245, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d190637-r625346245-Joan_Miro_Foundation-Barcelona_Catalonia.html", "text": "I really like contemporary museums and Joan Miro museum is definitely a gem! The house itself is so amazing - a masterpiece on its own! And the set up of Joan Miro works is well thought through and really enjoyable! So the combination of the house and artworks - marvellous!\n\nP.S. Quite short and quick line on a Sunday afternoon.", "publishedDate": "2018-10-16", "language": "en", "rating": 5}, {"id": 624785070, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d190637-r624785070-Joan_Miro_Foundation-Barcelona_Catalonia.html", "text": "We found it a lovely visit, beautiful laid out and relaxing. We probably did not appreciate his art (which at times left us a little dumbfounded) to thoroughly appreciate it. I think you have to be a real fan to thoroughly enjoy it. ", "publishedDate": "2018-10-14", "language": "en", "rating": 3}, {"id": 624415007, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d190637-r624415007-Joan_Miro_Foundation-Barcelona_Catalonia.html", "text": "One of the most beautiful museum we ever visited. Location, museum architecture, exhibits, multi-media guide, all together made this visit an exceptional event. All elements combined provide a great overview of Miro's work as well as his contemporaries. \n\nHighly recommended.", "publishedDate": "2018-10-13", "language": "en", "rating": 5}, {"id": 623889478, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d190637-r623889478-Joan_Miro_Foundation-Barcelona_Catalonia.html", "text": "I'm somewhat galleried out these days so it takes something special to turn me on.  We spend over two hours at this spacious and airy gallery leaving with a feeling of great lightness.\n\nMiro's work from start to finish is displayed – his ceramics and tapestries are my favourites. \n\nThe artwork is perfectly suited to it's setting.  There are two areas to relax – one with beach type chairs – to give a nice break from the art. \n\nThere is a great view at the rooftop of the gallery with more sculptures integrated into the setting.", "publishedDate": "2018-10-10", "language": "en", "rating": 5}, {"id": 623871977, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d190637-r623871977-Joan_Miro_Foundation-Barcelona_Catalonia.html", "text": "This museum has more art by Miro than anywhere else in the world. It was very interesting to watch Miro's progression as an artist. The art is very contemporary and if you don't like modern art, you won't really enjoy it.\nThere were several paintings that I'm still scratching my head about.\nThere is an audio guide available that give commentary on many of the pieces of art.\nEither pre order your tickets, or purchase the BCN Passport which is what we did. It allows you into 6 museums for one price and is good for one year. The nice thing about it is that tickets to the Miro and Picasso Museums are timed, and this pass allows you to go in whatever time you want and you get to skip the lines.", "publishedDate": "2018-10-10", "language": "en", "rating": 5}, {"id": 623260325, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d190637-r623260325-Joan_Miro_Foundation-Barcelona_Catalonia.html", "text": "My friend Barbara and I went to this museum early in the day. If you're 65 or older you can ask for a senior discount (worth about 3 euros). \n\nMuseums can be overwhelming. There's a lot to see and take in. This museum, besides having great, thought-provoking and funny pieces, allows you space to let it all sink in and rest before seeing more.\n\nThe layout of the museum is very people-friendly. Not only is it spacious but there are two places to rest, one of which is unique in my experience. The cafe looks out on a large stone patio with green plants and sculpture and is provides rest while you get coffee and dessert or a tapa. The other space is simply amazing. It has canvas lounge chairs situated on white rocks, looks out on a stone patio covered with two large canvas roofs. You look out over a small pool of water with a sculpture in it to a view of the hills in the distance. A cool breeze helps you rest too. It's quite hot and humid in Barcelona in September!", "publishedDate": "2018-10-08", "language": "en", "rating": 5}, {"id": 621689836, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d190637-r621689836-Joan_Miro_Foundation-Barcelona_Catalonia.html", "text": "Nicely laid out museum on a hill overlooking Barcelona.  This contains a good collection of Miro paintings, sculptures and tapestries.  Be sure to allow time to sit in one of the sunlounges on the deck overlooking Barcelona enjoying views all the way to the Mediterranean Sea.  A highlight of my trip to Barcelona.", "publishedDate": "2018-10-02", "language": "en", "rating": 5}, {"id": 620522711, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d190637-r620522711-Joan_Miro_Foundation-Barcelona_Catalonia.html", "text": "This museum is so outstanding it’s surprising that more visitors don’t end up here. A fantastic display of not just paintings but also sculptures in a building that looks like Miro himself designed it. With rooftop sculptures offering fabulous views. Not to be missed", "publishedDate": "2018-09-29", "language": "en", "rating": 5}, {"id": 620340000, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d190637-r620340000-Joan_Miro_Foundation-Barcelona_Catalonia.html", "text": "If you're a fan of Miro, you will love this museum. I am not, however, so I didn't. The friends with whom I was travelling seemed to like it. It is very well-lit and nicely laid out.", "publishedDate": "2018-09-28", "language": "en", "rating": 3}, {"id": 620331000, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d190637-r620331000-Joan_Miro_Foundation-Barcelona_Catalonia.html", "text": "Dedicated in 1975, this museum focuses on the paintings and sculptures of Spanish Srrealist Joan Miro ( who spent much of his artistic life in France). It's stunning including its dazzling white building.  But importantly it also features special exhibits of world renowned modern artists", "publishedDate": "2018-09-28", "language": "en", "rating": 4}, {"id": 620004866, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d190637-r620004866-Joan_Miro_Foundation-Barcelona_Catalonia.html", "text": "The location of the foundation is lovely. The foundation itself is housed in an interesting building and it’s contents should not be missed.", "publishedDate": "2018-09-27", "language": "en", "rating": 5}, {"id": 619881668, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d190637-r619881668-Joan_Miro_Foundation-Barcelona_Catalonia.html", "text": "You will see the Best of Miró art in a very beautiful building in a very beautiful park with an astonishing view.", "publishedDate": "2018-09-26", "language": "en", "rating": 5}, {"id": 619820539, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d190637-r619820539-Joan_Miro_Foundation-Barcelona_Catalonia.html", "text": "Enjoyed the whole place.  Great and interesting  (and colorful) pieces. Easy access by bus, taxi, or Uber.", "publishedDate": "2018-09-26", "language": "en", "rating": 5}, {"id": 619802278, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d190637-r619802278-Joan_Miro_Foundation-Barcelona_Catalonia.html", "text": "This museum is dedicated to Miro's work, and although the museum/setting are lovely and I had a personal guide explaining the works, Miro is not a artist I care for. However, I did like his mercury filled fountain.", "publishedDate": "2018-09-26", "language": "en", "rating": 4}, {"id": 619752927, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d190637-r619752927-Joan_Miro_Foundation-Barcelona_Catalonia.html", "text": "The Miro Fundacion is a wonderful look into the life and work of Joan Miro. His \"anti art\" in response to the consumerist trends of his day gives an opportunity to ponder the role of art in society. Admittedly some of the works are too\"anti\" for my taste but you can't help but admire the elegant simplicity of many of his abstract pieces. He had a great interest in Japanese art and though his work is very different in style the subtle grace is evident in both. Again a beautiful vista of Barcelona is a bonus of this place.", "publishedDate": "2018-09-26", "language": "en", "rating": 5}, {"id": 619005081, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d190637-r619005081-Joan_Miro_Foundation-Barcelona_Catalonia.html", "text": "This is a large collection of Miro's works.  Inspirational art and building.  Well worth seeing.  \n\nGet the audio tour.  Allow at least an hour and a half.", "publishedDate": "2018-09-23", "language": "en", "rating": 5}, {"id": 618916635, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d190637-r618916635-Joan_Miro_Foundation-Barcelona_Catalonia.html", "text": "Had a little difficulty finding the museum in the park, but thankfully we drove and found parking directly in front! Museum has a wonderful collection and the disappointment of some closed rooms was made up for by the view outside of the city below.", "publishedDate": "2018-09-23", "language": "en", "rating": 5}]}}]