[{"locationId": 243174, "name": "Barri de La Ribera", "placeType": "ATTRACTION", "reviewListPage": {"reviews": [{"id": 225579806, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d243174-r225579806-Barri_de_La_Ribera-Barcelona_Catalonia.html", "text": "La Ribera  (The Shore) is one of the areas of the quarter of Sant Pere, Santa Caterina i la Ribera of Ciutat Vella (\"the old city\") of Barcelona.\nLa Ribera neighbourhood is a must for anyone taking a walk through Barcelona. Whether you get there from the Via Laietana or the Arc de Triomf, as you explore the maze of narrow streets in this neighbourhood where merchants, artisans and guilds once, you’ll discover the city of design, leisure and fashion.Many street names remind you of the ancient trades and skills: Mirallers (mirror makers), Sombrerers (hatters), Argenters (silversmiths),....", "publishedDate": "2014-08-30", "language": "en", "rating": 4}, {"id": 223480590, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d243174-r223480590-Barri_de_La_Ribera-Barcelona_Catalonia.html", "text": "We loved this area of Barcelona.  Lots of narrow streets with nice little bars & restaurants and quirky shops.  We spent an excellent 3 hours just wandering around La Ribera.", "publishedDate": "2014-08-21", "language": "en", "rating": 4}, {"id": 168819621, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d243174-r168819621-Barri_de_La_Ribera-Barcelona_Catalonia.html", "text": "Ribera is incredible. You need a certain amount of days to really get a feeling for it though, as it is interveined with so many narrow alleys and streets buzzling with bars, pretty boutiques and great restaurants. Every time you take a different turn then before you are amazed at what you find. The main streets are quite touristic while a lot of the barrio is not so much. And thats where you find the pretty stuff.", "publishedDate": "2013-07-24", "language": "en", "rating": 5}, {"id": 160441987, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d243174-r160441987-Barri_de_La_Ribera-Barcelona_Catalonia.html", "text": "Also known as the 'Shore' it is an area of the old city of Barcelona. A lot of the buildings date from late Medieval times. It was a prosperous area during 13th–15th centuries, when it really was by the sea shore, although it is now regarded as a gritty area but its worth walking the narrow streets and looking at the shops.", "publishedDate": "2013-05-12", "language": "en", "rating": 4}, {"id": 154542884, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d243174-r154542884-Barri_de_La_Ribera-Barcelona_Catalonia.html", "text": " I loved this area of Barcelona. There are lots of lovely restaurants,bakeries and shops here. They are all tucked away in lovely little streets. The atmosphere is one of the best in Barcelona. ", "publishedDate": "2013-03-14", "language": "en", "rating": 5}, {"id": 150748929, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d243174-r150748929-Barri_de_La_Ribera-Barcelona_Catalonia.html", "text": "we loved walking in La Ribera..History and patisseries made a fatal combination for us. try lonely planet's sins of gluten path!", "publishedDate": "2013-01-27", "language": "en", "rating": 5}, {"id": 135622490, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d243174-r135622490-Barri_de_La_Ribera-Barcelona_Catalonia.html", "text": "nice area, but the prices of the restaurant is not very reasonable\nand also is overbooking at night, and that's alll", "publishedDate": "2012-07-28", "language": "en", "rating": 3}, {"id": 135355823, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d243174-r135355823-Barri_de_La_Ribera-Barcelona_Catalonia.html", "text": "I am living at El Born, the best part of La Ribera. A great place to live and also to visit. At Paseig del Born tou have all the best things you need for a great living.", "publishedDate": "2012-07-25", "language": "en", "rating": 5}, {"id": 133720640, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d243174-r133720640-Barri_de_La_Ribera-Barcelona_Catalonia.html", "text": "My wife and I went into the Barri de La Ribera on our way to the Picasso Museum on the Sunday afternoon of our visit to Barcelona.  This is a very gritty neighborhood.  You have to be on your guard here even during the daytime.", "publishedDate": "2012-07-07", "language": "en", "rating": 3}, {"id": 130646234, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d243174-r130646234-Barri_de_La_Ribera-Barcelona_Catalonia.html", "text": "We had already visited the major areas of Barcelona except for this portion located between the Gothic Quarter and La Barceloneta so we downloaded a walking tour by Frommer's and followed it .\n    It is an interesting quarter of Barcelona with some unique points of interest such as the Picasso Museum , the Santa Maria del Mar cathedral and at the end The Parque de la Ciutadella \n    We would recommend to visit this part of the city if a visitor has already spent 4-5 days in Barcelona or is living in accomodations near by !", "publishedDate": "2012-05-26", "language": "en", "rating": 3}, {"id": 127584715, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d243174-r127584715-Barri_de_La_Ribera-Barcelona_Catalonia.html", "text": "Don't forget to visit it ! You are going to like it. Take a look at the architecture.", "publishedDate": "2012-04-10", "language": "en", "rating": 5}, {"id": 126338271, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d243174-r126338271-Barri_de_La_Ribera-Barcelona_Catalonia.html", "text": "There are some interesting places to visit in the Barri de la Ribera. The Basilica of Santa Maria del Mar is one of the most beautiful churches in Barcelona. Then there is the Museu Picasso, and across from it is the Museu Barbier-Mueller d’Art Precolombi.", "publishedDate": "2012-03-19", "language": "en", "rating": 3}, {"id": 49521548, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d243174-r49521548-Barri_de_La_Ribera-Barcelona_Catalonia.html", "text": "Seedy even during the day, this is as gritty as Barcelona gets.  You may want to keep your guard up even during the day.  Nothing worth seeing in this neighborhood and no pretty plazas to people watch in.  You'll probably only have to pass through if you plan on going to modern art museum.  You will, however, find a few great Catalan restaurants for dirt cheap.  Not worth your time.", "publishedDate": "2009-11-18", "language": "en", "rating": 2}]}}]