[{"locationId": 13289883, "name": "Casa Ferran Guardiola", "placeType": "ATTRACTION", "reviewListPage": {"reviews": [{"id": 690181210, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d13289883-r690181210-Casa_Ferran_Guardiola-Barcelona_Catalonia.html", "text": "Casa Ferran Guardiola is a building at the junction of Carrer de Muntaner and Carrer del Consell de Cent. It’s an amazing looking building with an eclectic mix of Art Deco, Modernism and Neo-Classical. The Neo-Classical looks can be seen at the ground level with the evenly spaced rows of Doric columns that span up to the first floor. The columns then give way to long straight spring lines of Art Deco. The building is topped by cornice and crowned at the roof with very obvious influences from Catalan Modernism with it's opulent architectural sculptures atop the columns that had begun from the Doric columns on the ground floor.\n\nThis building is just breathtaking for it’s beauty.", "publishedDate": "2019-07-16", "language": "en", "rating": 5}, {"id": 630086344, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d13289883-r630086344-Casa_Ferran_Guardiola-Barcelona_Catalonia.html", "text": "Casa Ferran Guardiola ( Casa Xina ) is an absolutely fantastic and unique looking building we chanced upon as we were wandering around the huge L'Eixample District and in particular the area around Passeig De Gracia. \nConstructed from 1911 with modifications  taking place throughout the years this building looks amazing,although predominantly an art deco design you can plainly see the Oriental influence in some of the amazing features that make the facade of this building such a joy to behold.\nThe Valencian architect Joan Francesc Guardiola Martinez certainly knew he was creating a masterpiece in my opinion.\nCasa Ferran Guardiola is easy to locate on Carrer De Muntaner in the L'Eixample District. \nMost definitely well worth seeking out if your in the area. ", "publishedDate": "2018-11-01", "language": "en", "rating": 5}]}}]