[{"locationId": 1192310, "name": "Col·legi d'Arquitectes de Catalunya", "placeType": "ATTRACTION", "reviewListPage": {"reviews": [{"id": 708394945, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d1192310-r708394945-Col_legi_d_Arquitectes_de_Catalunya-Barcelona_Catalonia.html", "text": "Located in a corner of the cathedral square, this building has a mural designed by Picasso. Look out for it!", "publishedDate": "2019-09-09", "language": "en", "rating": 4}, {"id": 677069624, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d1192310-r677069624-Col_legi_d_Arquitectes_de_Catalunya-Barcelona_Catalonia.html", "text": "The coffee shop at level -2 offers a reasonable week-days menu at very affordable price. Today, at 14:30 is full of locals.", "publishedDate": "2019-05-28", "language": "en", "rating": 4}, {"id": 646776797, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d1192310-r646776797-Col_legi_d_Arquitectes_de_Catalunya-Barcelona_Catalonia.html", "text": "Hidden gem, very nice place with an full of art. \nBut dont forget to visit and shop at gift shop. Brilliant products, small pieces very good designs , worthed.", "publishedDate": "2019-01-18", "language": "en", "rating": 4}, {"id": 626634786, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d1192310-r626634786-Col_legi_d_Arquitectes_de_Catalunya-Barcelona_Catalonia.html", "text": "...not as a destination in and of itself, but if you're there you should definitely take a look. -Not only at the Picasso friezes on the outside of the building...there is even more interesting stuff to be seen inside!\n\nCheck out the shop !\n ....        ....   ....   and the library !\n   ....    ....    ....   & the shop 😜", "publishedDate": "2018-10-19", "language": "en", "rating": 3}, {"id": 615427127, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d1192310-r615427127-Col_legi_d_Arquitectes_de_Catalunya-Barcelona_Catalonia.html", "text": "The modern College of Architects Building may not be the most natural fit for this historic area, but the three-sided frieze by Picasso is a gem that adds to the ambiance of Plaça Nova. Picasso’s drawing represents Catalan traditions. It is simply, elegant and beautiful. Sits across from the Roman ruins and the Barca letters, near the cathedral, so it doesn’t require going far out of your way to enjoy it. Be sure to check out the frieze in one of the few places you are going to see a work of Picasso outside and for free!", "publishedDate": "2018-09-10", "language": "en", "rating": 4}, {"id": 587470691, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d1192310-r587470691-Col_legi_d_Arquitectes_de_Catalunya-Barcelona_Catalonia.html", "text": "The design.  Is  wonderful  but. The only interior is even   Better with true treasures.  Available to be seen. The work is amazing and needs to be seen", "publishedDate": "2018-06-14", "language": "en", "rating": 4}, {"id": 501118314, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d1192310-r501118314-Col_legi_d_Arquitectes_de_Catalunya-Barcelona_Catalonia.html", "text": "Stunning frescos not sure the building fits into such a gorgeous area. Worth a look and photo as you head towards the Barca sculpture and an area of lovely narrow streets over the reconstructed drawbridge next to the Barca artwork ", "publishedDate": "2017-07-11", "language": "en", "rating": 3}, {"id": 495830113, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d1192310-r495830113-Col_legi_d_Arquitectes_de_Catalunya-Barcelona_Catalonia.html", "text": "It could easily be missed as it is by so many other sights and at the top of a building but it's great to see the work of such a celebrated artist in a public space. ", "publishedDate": "2017-06-25", "language": "en", "rating": 4}, {"id": 492199102, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d1192310-r492199102-Col_legi_d_Arquitectes_de_Catalunya-Barcelona_Catalonia.html", "text": "We happened to walk by this. Nice building if you happen to walk by. Not anything to plan a special trip for. ", "publishedDate": "2017-06-11", "language": "en", "rating": 3}, {"id": 480976875, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d1192310-r480976875-Col_legi_d_Arquitectes_de_Catalunya-Barcelona_Catalonia.html", "text": "it is the headquarter of the architects in barcelona but for everybody they have open a shop and a library, wonderful both. And I recommend the architecture too.", "publishedDate": "2017-05-02", "language": "en", "rating": 5}, {"id": 428724047, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d1192310-r428724047-Col_legi_d_Arquitectes_de_Catalunya-Barcelona_Catalonia.html", "text": "When visiting the Cathedral next to this building you should not miss the very fine friezes by Picasso.", "publishedDate": "2016-10-17", "language": "en", "rating": 4}, {"id": 382863800, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d1192310-r382863800-Col_legi_d_Arquitectes_de_Catalunya-Barcelona_Catalonia.html", "text": "While not a standalone destination, this wall adds to the historical richness of its location. Facing the Barcelona Cathedral, as well as the gateway of the Roman Fort structure, icons of major historical periods all come together. For this alone, I think a long pause here is well worth anyone’s time. The Picasso Wall is also a good spot to consider your next destination. Down one direction, past the wall, is Portal de l’Angel, a street full of modern shopping and good eating, that eventually ends at Plaza de Catalunya. Portal de l’Angel feels much more secure than Las Ramblas and offers more variety. If modern shopping is not your thing, turn your back on the Picasso Wall to walk in the opposite direction. You will be facing the remains of the ancient Roman Fort. Walk through the Roman gateway, and you are then in the heart of the Gothic Quarter with the Barcelona Cathedral to your left or, straight ahead, a main walkway (Carrer Bisbe) that accesses the winding maze of the medieval streets. If you’d prefer to see more Picasso, keep straight on Carrer Bisbe until it opens into a large square, the Plaza de Sant Jaume. Turn left onto Carrer Jaume which is soon called Carrer de la Princessa. This street will lead you to the Picasso museum!", "publishedDate": "2016-06-15", "language": "en", "rating": 4}, {"id": 356993533, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d1192310-r356993533-Col_legi_d_Arquitectes_de_Catalunya-Barcelona_Catalonia.html", "text": "We saw this while exploring the Barri Gotico. It's great public art, but by no means a destination stop. If you are in the area you'll probably come across it even if you don't intend to. If you're not, you can skip it. ", "publishedDate": "2016-03-20", "language": "en", "rating": 3}, {"id": 355835274, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d1192310-r355835274-Col_legi_d_Arquitectes_de_Catalunya-Barcelona_Catalonia.html", "text": "This is a very nice (and free) opportunity to see a Picasso. The story behind this is also interesting, it was an statement against the dictatorship - and some say it was only put on the wall because Picasso was angry that Mirò made and exposition on this theme, and on his view he didn't deserve all that attention; so his artwork should be on an even greater and more public display.", "publishedDate": "2016-03-15", "language": "en", "rating": 4}, {"id": 351091125, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d1192310-r351091125-Col_legi_d_Arquitectes_de_Catalunya-Barcelona_Catalonia.html", "text": "Picasso provided the design for the side of the College of Architecture building.  It was an anti-Franco statement.  It is interesting to see.  ", "publishedDate": "2016-02-26", "language": "en", "rating": 4}, {"id": 292844792, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d1192310-r292844792-Col_legi_d_Arquitectes_de_Catalunya-Barcelona_Catalonia.html", "text": "Spend a few minutes reading the history to appreciate what you're seeing. Not many places can boast a large Picasso in a public space. Check out the gift shop as well, focusing on local architects and other design-oriented unique gifts. ", "publishedDate": "2015-07-26", "language": "en", "rating": 5}, {"id": 289012819, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d1192310-r289012819-Col_legi_d_Arquitectes_de_Catalunya-Barcelona_Catalonia.html", "text": "The building is located on the Cathedral square just across from the main northern Roman gate to Barcino.  However the best feature to the building is the public Picasso painted on the exterior celebrating Catalan culture including its on dance as well celebrate human pyramids. Wonderful to see when walking around the Cathedral.", "publishedDate": "2015-07-14", "language": "en", "rating": 3}, {"id": 259392624, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d1192310-r259392624-Col_legi_d_Arquitectes_de_Catalunya-Barcelona_Catalonia.html", "text": "The College of Architects of Catalonia, Picasso Wall is located in the Barri Gotic. It has pretty drawings by Picasso on the outside of the wall. Interesting!", "publishedDate": "2015-03-14", "language": "en", "rating": 4}]}}]