[{"locationId": 1606662, "name": "Barcelona Bosc Urba", "placeType": "ATTRACTION", "reviewListPage": {"reviews": [{"id": 612273328, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d1606662-r612273328-Barcelona_Bosc_Urba-Barcelona_Catalonia.html", "text": "it was soo much fun doing the blue circuit!!\nyou work indeed your body and mind is very funny to do with friends so you can laugh \ni will defo repeat it again!!", "publishedDate": "2018-08-30", "language": "en", "rating": 5}, {"id": 461216593, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d1606662-r461216593-Barcelona_Bosc_Urba-Barcelona_Catalonia.html", "text": "I did the blue trail with my nieces (10 and 8 years old) and we had a lot of fun. Some bridges are challenging and the staff is always watching and helping in every way they can. The pity is that the environment is very grey (concrete) and doesn't really seem a forest (its name is Urban Forest).", "publishedDate": "2017-02-19", "language": "en", "rating": 4}, {"id": 454450531, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d1606662-r454450531-Barcelona_Bosc_Urba-Barcelona_Catalonia.html", "text": "Can I build a business here? Yes I can, however it will take timing and planning . Beautiful views of the sea. Traffic traffic traffic y'all. Traveling by moped or motorcycle is your best option in the warmer months. What a beautiful city it takes your breath away.", "publishedDate": "2017-01-24", "language": "en", "rating": 5}, {"id": 396227268, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d1606662-r396227268-Barcelona_Bosc_Urba-Barcelona_Catalonia.html", "text": "We spent a great time in Barcelona Bosc Urba. Be ready to test your fitness in walking, climbing and experiencing hights. It is certainly a place to spend with kids, who are not too much excited of touring the churches. However we plan to do that too, I am glad we have done this also. Besides, museum of natural science is here too, so you can combine both.", "publishedDate": "2016-07-24", "language": "en", "rating": 5}, {"id": 390533834, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d1606662-r390533834-Barcelona_Bosc_Urba-Barcelona_Catalonia.html", "text": "My daughter(12) and I did the expert course in two hours.  Was hard but both of us will never forget it.  The course is excellent.  Combines all the aspects of tree top trekking.  Bring gloves if you have them because your hands to hurt a bit afterwards.", "publishedDate": "2016-07-08", "language": "en", "rating": 5}, {"id": 381794707, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d1606662-r381794707-Barcelona_Bosc_Urba-Barcelona_Catalonia.html", "text": "a good place for children. They can practice their skills in height. It is ideal for groups. Despite being in the Forum, its location is not very well signposted, like access. There are several areas where we could park nearby.", "publishedDate": "2016-06-12", "language": "en", "rating": 4}, {"id": 366548422, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d1606662-r366548422-Barcelona_Bosc_Urba-Barcelona_Catalonia.html", "text": "Best place for kids. (Ages 10.5 and 8.5) they enjoyed very much and did the track twice!!\nWe tried to do the blue path but it was too scary for the little one... So he did the yellow path...\nVery recommended activity for the family.", "publishedDate": "2016-04-23", "language": "en", "rating": 5}, {"id": 304992991, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d1606662-r304992991-Barcelona_Bosc_Urba-Barcelona_Catalonia.html", "text": "My kids and I had a blast, the staff were helpful and friendly, but only one spoke English, it's more of a concrete zip lining different than the ones between mountains or trees.", "publishedDate": "2015-08-30", "language": "en", "rating": 4}, {"id": 293606432, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d1606662-r293606432-Barcelona_Bosc_Urba-Barcelona_Catalonia.html", "text": "This is by far the coolest thing to do with kids in Barcelona apart from the beaches. An urban park in a former industrial building at the far end of the beaches. \n\nWe were equipped with climbing gear (dad, 13 year old boy and 7 year old girl) and given a quick course in using the gear. 7 year old was sent onto the orange course with a guy who showed her the ropes. Me and the teen went higher, onto the blue course for more of a challenge. The hardest red course was out of order that day, but will be fixed shortly.\n\nWe followed the courses and challenged ourselves by wire walking, zip-wiring and generally trying not to fall. It was a brilliant couple of hours and while we were tired in our muscles after finishing it, it was a massive hit.\n\nIt's a bit hard to find. Google Maps sends you a bit off course, but just for the huge, wall-less building with ropes and wires between the columns.\n\nIt cost €45 for the three of us and was money well spent.\n\nPerfect for parents to Free Range Kids. ", "publishedDate": "2015-07-29", "language": "en", "rating": 5}, {"id": 291469561, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d1606662-r291469561-Barcelona_Bosc_Urba-Barcelona_Catalonia.html", "text": "Sent an email in advance asking for the best time to visit with my kids. Was recommended to come in the afternoon, so we came after 1PM. Apparently, they live by slacker time, as they told us it wasn't possible to do the route \"in the morning.\n\nWe killed a couple of hours, and came back later. Now we were told that my daughter couldn't do the red route, because she was too small. She is a good 15 centimetres taller than the recommended height on the website and the signs in the park.\n\nMy son was allowed to go, even though he is the same height. Probably they thought she would be too weak because she is a girl...\n\nNeedless to say, we left immediately. I wrote a friendly email asking the manager for recommendations (hoping to make a new try later on) but got no response at all...\n\nI believe that a good business always answers email within one business day. Not answering at all makes me bring my money elsewhere. Rent paddle boards at the beach instead! :-)", "publishedDate": "2015-07-22", "language": "en", "rating": 1}, {"id": 262087480, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d1606662-r262087480-Barcelona_Bosc_Urba-Barcelona_Catalonia.html", "text": "great idea, better deal !! great staff ...\nziplines in town !! Very original ...\nWe had a rainy day and we could enjoy the park without problems.\nLuckily staff looking we help when we need ...", "publishedDate": "2015-03-27", "language": "en", "rating": 5}, {"id": 247841031, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d1606662-r247841031-Barcelona_Bosc_Urba-Barcelona_Catalonia.html", "text": "After many days of sight seeing, our kids (ages 10, 13, and 15) were ready for a change of pace.  We made the trek out to Bosc Urba without knowing entirely what we were getting in to.  It turns out that it was supposed to be open only to groups, but the staff let us in and allowed the kids to do the full circuit despite the fact that it was Dec 23rd and they had to stay past their normal closing hours.  I do highly recommend calling before hand to confirm hours, etc.. and arrive with atleast 2 hours prior to the stated closing time.  Their are 3 circuits with red being the highest/most difficult.  Our kids all wanted to do red; and the staff wasn't sure the 10 year old could do it but agreed to let him try.  It was a real challenge for him, but he was very proud that he completed the whole circuit--and the staff was very patient with him.  A very fun adventure! I highly recommend.", "publishedDate": "2015-01-06", "language": "en", "rating": 5}, {"id": 243363807, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d1606662-r243363807-Barcelona_Bosc_Urba-Barcelona_Catalonia.html", "text": "Perfect place to have a pleasant time with the friends and kids! When you are already tired of the usual touristic places, this is the perfect place to go! A different place to enjoy Barcelona where you can get an excellent sunset as a bonus!", "publishedDate": "2014-12-07", "language": "en", "rating": 5}, {"id": 191025880, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d1606662-r191025880-Barcelona_Bosc_Urba-Barcelona_Catalonia.html", "text": "The red circuit is very funny, I demand a black circuit for when I return next year. The final zip line and the snowboard, the best,I expected more in the bungee jumping, but I've bungee jumping really so the experience is different. \n\nhighly recommended and in the same city!", "publishedDate": "2014-01-16", "language": "en", "rating": 5}, {"id": 174644376, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d1606662-r174644376-Barcelona_Bosc_Urba-Barcelona_Catalonia.html", "text": "We arrived there at 13:30, after careful planning form the day before. It was written in their web site that the opening hours are form 10:00 to 15:00 and form 16:00 to 20:00. When we arrived, the manager Dani Perez told us that we cannot enter as it is closed. I showed him the that in the website they wrote that the working hours are until 15:00, and then Dani explained that they do not allow customers 1.5 hours before closing hour. Then I told him that we're just in time it's 13:30 now, but yet he insisted he cannot let us in. When I tried to get an explanation, Dani explained that if he let us in, other people will see us and will want to enter too so he cannot let us in since this is what is written in the rules. Then we went together to read the rules and Dani was unable to point at the statement that prevents him to let us in. He just told that he can do nothing, then he just switched to Spanish as he saw he cannot properly explain his thesis.\nUnfortunately, this place is a bit far from the city center - it took us about 1 hour on metro and another 20min walk in each direction just in vain. I was very surprised to see such a terrible behavior from the staff and their unwillingness to do their job. I told Dani I am going to write negative review on trip advisor (as he had a sticker on the window) but he told me just to go-on and write my review - he doesn't care about it...", "publishedDate": "2013-08-29", "language": "en", "rating": 1}]}}]