[{"locationId": 4310632, "name": "Teatro Coliseum", "placeType": "ATTRACTION", "reviewListPage": {"reviews": [{"id": 530176960, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d4310632-r530176960-Teatro_Coliseum-Barcelona_Catalonia.html", "text": "I looked on a map and saw we were going to stay near the Coliseum and thought great.\nI was just in Italy and that's what I was expecting.\nImagine my surprise when I saw the 2 legs sticking out of the upper floor.\nIt's a Teatro.\nLooks good from the outside but don't expect a Roman Coliseum.", "publishedDate": "2017-10-05", "language": "en", "rating": 4}, {"id": 447593712, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d4310632-r447593712-Teatro_Coliseum-Barcelona_Catalonia.html", "text": "Historic theater with great shows and a good atmosphere. Very good experience. Hope to return soon. Nice bar next door.", "publishedDate": "2016-12-29", "language": "en", "rating": 4}, {"id": 382519451, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d4310632-r382519451-Teatro_Coliseum-Barcelona_Catalonia.html", "text": "Starts with a film that lasts about 30 and then you go and see the warriors. That bit isn't very big. Was expecting more really. A very forgettable experiance.", "publishedDate": "2016-06-14", "language": "en", "rating": 2}, {"id": 371707128, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d4310632-r371707128-Teatro_Coliseum-Barcelona_Catalonia.html", "text": "Great exhibition in quite a centric location. We went on a rainy Saturday, so it wasn't too crowded, and it was well organized, and neat. We liked the place, the only problem was perhaps the badly lighting, but we loved the Terracotta Army. ", "publishedDate": "2016-05-10", "language": "en", "rating": 5}, {"id": 368581247, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d4310632-r368581247-Teatro_Coliseum-Barcelona_Catalonia.html", "text": "Terracotta Army is a journey to the heart of one of the most enigmatic archaeological findings in History. Im glad I was able to catch the exhibit during my vacation in Barcelona. More than 150 original size replicas compose this exhibition about the terracotta army, warriors, horses and battle carriages, weapons and  a duplicate of the pit that includes 80 warriors. Documentary about the archaeological findings, explanatory boards and audio guides allows me to know more about the exhibits. Terracotta Army is a unique experience appropriate for all audiences.", "publishedDate": "2016-04-28", "language": "en", "rating": 4}, {"id": 364907995, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d4310632-r364907995-Teatro_Coliseum-Barcelona_Catalonia.html", "text": "We were lucky to catch this exhibition as missed in London.\nIt was a great show, it was beneficial to view a 20min film before the exhibition. Amazing how the workers managed 8000 clay statues standing up to 6ft tall\nVery interesting.", "publishedDate": "2016-04-17", "language": "en", "rating": 5}]}}]