[{"locationId": 4722328, "name": "Museu del Disseny de Barcelona", "placeType": "ATTRACTION", "reviewListPage": {"reviews": [{"id": 750639965, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d4722328-r750639965-Museu_del_Disseny_de_Barcelona-Barcelona_Catalonia.html", "text": "It was recommended to me by a local and I didn't know what to expect. When I arrived, I discovered the museum is separated on four floors, each with a different theme. I like art and design and found both in size, scale and fun here. From gadgets to furniture to clothing...I could have spent more time at this museum. It was definitely worth the visit, is affordable, is easy to reach by metro or on foot (if you like to walk) and I recommend it. And there are cafes and bars nearby if you need a break before or after. ", "publishedDate": "2020-03-12", "language": "en", "rating": 4}, {"id": 734881217, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d4722328-r734881217-Museu_del_Disseny_de_Barcelona-Barcelona_Catalonia.html", "text": "I visit design and modern art museums in almost every city I visit. I was mostly interested in the visual communication exhibition and it was quite disappointing. Most of the pieces are in catalan but apart from that the exhibition lacks of explanations and links towards political context, artistic trends and influences. It makes of explanations about evolution of colors, images and typefaces throughout the time and its link towards society, industry and culture. You can only see pieces and it’s author in a timeline. Avoid waiting your time.", "publishedDate": "2019-12-27", "language": "en", "rating": 1}, {"id": 732430731, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d4722328-r732430731-Museu_del_Disseny_de_Barcelona-Barcelona_Catalonia.html", "text": "When we travel to foreign countries, we should get the best of it. Visit the best places and create memories that last.", "publishedDate": "2019-12-13", "language": "en", "rating": 5}, {"id": 721250472, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d4722328-r721250472-Museu_del_Disseny_de_Barcelona-Barcelona_Catalonia.html", "text": "Modern, bright, spacious and well-curated museum. Lots of familiar objects from the past, plus a great exhibition on the evolution of clothing design.", "publishedDate": "2019-10-25", "language": "en", "rating": 4}, {"id": 720267021, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d4722328-r720267021-Museu_del_Disseny_de_Barcelona-Barcelona_Catalonia.html", "text": "We visited on a Sunday - free admission.  4 floors but we missed the top floor of fashion, unfortunately.  We enjoyed the temporary exhibition of jewelry as well as the floors on products, furniture and items of the past.  Several pieces of pottery by Picasso. Very interesting place if you have the time to visit. Wear comfortable shoes as the floors are all concrete and hard on your feet!", "publishedDate": "2019-10-21", "language": "en", "rating": 5}, {"id": 714491499, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d4722328-r714491499-Museu_del_Disseny_de_Barcelona-Barcelona_Catalonia.html", "text": "Bright, spacious museum with incredible collections of every type of design. \nHighly recommend a visit.", "publishedDate": "2019-10-01", "language": "en", "rating": 4}, {"id": 709296279, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d4722328-r709296279-Museu_del_Disseny_de_Barcelona-Barcelona_Catalonia.html", "text": "The museum is on 4 floors: one for the history of clothing which is stunning. One floor of modern objects and another dedicated to past designs like watches, desks etc. \nApart from the 1st floor dedicated to modern objects, the rest is an insight into design in the past. ", "publishedDate": "2019-09-12", "language": "en", "rating": 5}, {"id": 705003058, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d4722328-r705003058-Museu_del_Disseny_de_Barcelona-Barcelona_Catalonia.html", "text": "The museum holds some very interesting pieces in their collections. There are 4 floors dedicated to different aspects of Design. Art, Clothes, Ceramic, Industrial Design.\nThere is also a small cafetería where you can buy good and drinks. There is also an outdoor terrace too.\nYou can get discount on your entrante admisión if you have a Library ticket from Barcelona. With your ticket you also have the possibility to return in the next few months for free It give It to someone else.", "publishedDate": "2019-08-31", "language": "en", "rating": 4}, {"id": 702150849, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d4722328-r702150849-Museu_del_Disseny_de_Barcelona-Barcelona_Catalonia.html", "text": "I was not planning to come here due to the long distance from where I was but It was one of my best decisions the museum is very well organize has excellent exhibitions and the staff is very friendly, also with the same ticket you can go back to the museum in the next months.  Highly recommended. The coffee place downstairs is also very good and they also have some tables outside to enjoy the afternoon.", "publishedDate": "2019-08-23", "language": "en", "rating": 5}, {"id": 696421104, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d4722328-r696421104-Museu_del_Disseny_de_Barcelona-Barcelona_Catalonia.html", "text": "For person who interested in design and modern art. I am so I like it. But I don't think I'll go there with my boyfriend or some of the friends.", "publishedDate": "2019-08-07", "language": "en", "rating": 4}, {"id": 682264104, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d4722328-r682264104-Museu_del_Disseny_de_Barcelona-Barcelona_Catalonia.html", "text": "Didn’t know much about the museum and what if offered before coming here! The designs are just amazing. A great place in Barcelona that we recommend you to come and try out.", "publishedDate": "2019-06-17", "language": "en", "rating": 5}, {"id": 678356347, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d4722328-r678356347-Museu_del_Disseny_de_Barcelona-Barcelona_Catalonia.html", "text": "Went there for Museums Night and was amazed by the beautiful and so intelligent exhibit on clothes throughout the ages!\nCafeteria very good as well.\nIn February, don t miss the Llum BCN festival, a circuit of luminous installations in which art and technology meet. Buildings of last generation, chimneys of old factories, industrial buildings are transformed with light and show the work of international artists, designers and architects.", "publishedDate": "2019-06-02", "language": "en", "rating": 4}, {"id": 672401611, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d4722328-r672401611-Museu_del_Disseny_de_Barcelona-Barcelona_Catalonia.html", "text": "Loved the exhibitions and the standout designs of times past.  The museum is airy and easy to visit.  Signs are clear and the staff at the entrance were very pleasant and helpful.", "publishedDate": "2019-05-07", "language": "en", "rating": 5}, {"id": 667435977, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d4722328-r667435977-Museu_del_Disseny_de_Barcelona-Barcelona_Catalonia.html", "text": "You must go downstairs to purchase a ticket. €6 and you can come back anytime in 6 months are give away.\nThe exhibits are interesting and boring. It gets your attention then looses it. You hate to leave because you know it will get better. The signs could be larger, for easier reading. Also I like facts, like the earlier items and clothing. Some of the other are looked like it weighted 5 kilos. The ceramic stove looked like it weighted several hundred kilos. The carriage on display, height of wheels, height of carriage, weight of carriage.", "publishedDate": "2019-04-18", "language": "en", "rating": 3}, {"id": 653143870, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d4722328-r653143870-Museu_del_Disseny_de_Barcelona-Barcelona_Catalonia.html", "text": "Not very popular, but worth to visit. As for Barcelona - inexpensive entry tickets (6 euros), which operate 2 days for 6 months (the first time I'm faced with this). New building (2014). Exchanging exhibits cover all areas of design: industrial, graphic, fashion, decorative arts). Interesting for the general public, necessarily for designers.", "publishedDate": "2019-02-17", "language": "en", "rating": 5}, {"id": 630317820, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d4722328-r630317820-Museu_del_Disseny_de_Barcelona-Barcelona_Catalonia.html", "text": "If you are interested in design this will be heaven for you.  If you like furniture as art, this will be a revelation, and if you are merely curious about design in general this will teach you in a fun way.  Loved it. For the artsy or fellow travelers the best place in town", "publishedDate": "2018-11-02", "language": "en", "rating": 5}, {"id": 629585441, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d4722328-r629585441-Museu_del_Disseny_de_Barcelona-Barcelona_Catalonia.html", "text": "The museum is well organized and features a very broad range of decorative art, cars, motorcycles, posters, fashion clothes, etc. all originally from Spain. For people who love design, it is worth the extra travel. Also, walk your way back to the centre using back streets and boulevards. You will see a very different face of Barcelona: where people work!", "publishedDate": "2018-10-30", "language": "en", "rating": 5}, {"id": 626576309, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d4722328-r626576309-Museu_del_Disseny_de_Barcelona-Barcelona_Catalonia.html", "text": "I built and designed furniture, and am also an avid sewist. I often drag my husband to exhibitions, which he would not go to otherwise, but is willing to accompany me.  On this occasion, he also really liked the museum!  There are three main floors, one devoted to fashion, one to furniture, and one to general design. It is unusual to find those three together, especially as permanent exhibits. We were both fascinated by the historical clothing pieces, especially because most of them were in such remarkable condition, given their age.  The structure of the supporting undergarments was very interesting.  There were both men’s and women’s garments. If you are a re-enactor, a cosplayer, or just interested in clothing, this is a must-see. There were also a number of designs from recent fashion by Spanish design great Balenciaga.  The furniture represented a similarly extensive range of styles and ages. The general design section was of most interest to my husband.  We tend to forget how much design goes into ordinary household items, such as electric shavers and bicycles, so it was cool to be reminded.  And there is an excellent cafe for lunch or a snack, too!", "publishedDate": "2018-10-19", "language": "en", "rating": 5}, {"id": 623742957, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d4722328-r623742957-Museu_del_Disseny_de_Barcelona-Barcelona_Catalonia.html", "text": "really enjoyed the visit, needed more time but its cool.\nthe fact the ticket valid for more than one day is nice but sadly it was the last day", "publishedDate": "2018-10-10", "language": "en", "rating": 5}, {"id": 620816499, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d4722328-r620816499-Museu_del_Disseny_de_Barcelona-Barcelona_Catalonia.html", "text": "To miss this museum is to miss a highlight of Barcelona.  Near new it has the advantages therefore of imaginative displays and easy to read identification in Spanish and English. So much to see allow 2-3 hours.  Highly recommended ", "publishedDate": "2018-09-30", "language": "en", "rating": 5}, {"id": 610685881, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d4722328-r610685881-Museu_del_Disseny_de_Barcelona-Barcelona_Catalonia.html", "text": "Otherwise known locally as the Museu del Disseny de Barcelona (MDD), this is a cultural epicentre that brings together works from four erstwhile separate museums. The collection features over 70,000 objects representing the diverse spectrum of graphic arts, ceramics, textiles and clothing, from both the historical and contemporary.\n\nWhat I love about this museum is the spatial generosity that allows the objects on display to be presented in the best possible way. My first visit to the MDD was in June 2017 to see the David Bowie Is exhibition, as I did not have the opportunity to view it at the Victoria and Albert (V&A) Museum in London. When I went to Pink Floyd’s exhibition: Their Mortal Remains at the V&A, its severe space challenges resulted in a suboptimal experience. The MDD did not suffer from these logistical issues and the larger rooms allowed the objects on display to breathe with singular vitality. The MDD enabled the dynamic impact of Bowie’s creative oeuvre to transport one into a whole new visual dimension.\n\nEven if there is not an exhibition on that you particularly want to see, I thoroughly recommend indulging time on the MDD, if you have an abiding interest in the applied arts.\n", "publishedDate": "2018-08-26", "language": "en", "rating": 5}, {"id": 607718585, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d4722328-r607718585-Museu_del_Disseny_de_Barcelona-Barcelona_Catalonia.html", "text": "Didn't realize when we went, but It was free on Sunday. Started with temporary exhibit of 2018 Spanish design winners. Thought we'd just make a quick visit since we were so tired. Had a bite in their lovely tasty cafe. Ended up going to every exhibit on every floor. It was a provocative, fascinating, and educational exploration of design - print, clothing, household goods -- each floor focuses on one category of design and is curated in a clever and engaging way.", "publishedDate": "2018-08-18", "language": "en", "rating": 5}, {"id": 603974966, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d4722328-r603974966-Museu_del_Disseny_de_Barcelona-Barcelona_Catalonia.html", "text": "I love design especially architectural, engineering and home design and this has to be one of the best design museums I have ever visited.The displays are brilliant with lighting to perfection on a textile exhibition at the moment. I was so blown away by this place and the staff. Everything is awesome !!!  It is of course Spanish largely as it should be so design varies from what I am used to but is so well laid out. Loved it Loved it. \nThe cafe / restaurant was lovely with a great range of food and drink and very comfortable in very relaxing surroundings. The building is worthy of note and wish some of our towns would take note!!", "publishedDate": "2018-08-07", "language": "en", "rating": 5}, {"id": 590151189, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d4722328-r590151189-Museu_del_Disseny_de_Barcelona-Barcelona_Catalonia.html", "text": "We visited after 6 on a Saturday evening. It is well worth visiting .  It has 2 temporary exhibitions which was the Basic and the Design awards, both very interesting.  The museum has 4 floors and the standard of what is exhibited is very high and worthwhile. My wife’s favourite was the 3rd floor which was fashion. The Cristobal Balenciaga is of a very great standard and includes some amazing pieces.  All in all very worthwhile and reasonable priced for a museum visit.  ", "publishedDate": "2018-06-24", "language": "en", "rating": 5}, {"id": 581254425, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d4722328-r581254425-Museu_del_Disseny_de_Barcelona-Barcelona_Catalonia.html", "text": "We went for the excellent David Bowie exhibit last fall. Very well done and interesting. Only problem was the headsets not coordinating with the exhibit very well. If it comes to a city near you, go see it. Wish we had time to see the rest of the Museum.", "publishedDate": "2018-05-19", "language": "en", "rating": 5}, {"id": 575303633, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d4722328-r575303633-Museu_del_Disseny_de_Barcelona-Barcelona_Catalonia.html", "text": "All in one museum and I love this concept. Unlike Madrid, all its decorative arts museums are scattered throughout but here they are all in the same building. Fashion was my top favorite but the very dim lighting hurt my eyes. Yes, I know the lighting is dimmed to protect fragile fabrics but its way too dim unlike the one in Madrid's Museo del Traje where the lighting is optimal. I also enjoyed the chest of drawers section on the lower floors as it showed ingenuity in constructing hand crafted safes long before metal safes & vaults were in use to safe keep money & family heirloom. If you feel hungry after the visit to this museum, exit out of it and head diagonally across to a mega mall called Glories. Its about a short 8 mins walk away. There is a food court there and the usual fast food outlets and a huge hypermarket, Carrefour.", "publishedDate": "2018-04-23", "language": "en", "rating": 4}, {"id": 566500845, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d4722328-r566500845-Museu_del_Disseny_de_Barcelona-Barcelona_Catalonia.html", "text": "Last year when I was in Barcelona, I went to check out this museum (it was not yet built when I was in Barcelona on previous occasions). There was no special exhibition at that time, so I visited the permanent exhibitions on furniture/design, posters, etc.\nThis time, there was a special exhibition on Adolf Loos (with entrance fee) and some free temporary exhibitions (photos on Puig i Caldafach's architecture, and Cirque du Soleil).\nThere is a nice cafe inside.\nThe museum is bright and airy. If there are exhibitions which interest me, I will go again next time in Barcelona.", "publishedDate": "2018-03-14", "language": "en", "rating": 4}, {"id": 563873897, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d4722328-r563873897-Museu_del_Disseny_de_Barcelona-Barcelona_Catalonia.html", "text": "The design museum is a great place to visit if you like / love design or simply want some inspiration and/or a change of scene. Tickets to get in are very reasonably priced by Barcelona standards and it's easy to get around - well laid out and not overwhelming unlike so many museums. I have now been several times - alone, with friends and also with my 9 year old son who also enjoyed the permanent displays. I recommend visiting as part of a tour/walk around the up and coming Poble Nou area that has many interesting modern buildings to see ( and photograph).", "publishedDate": "2018-03-03", "language": "en", "rating": 4}, {"id": 559949968, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d4722328-r559949968-Museu_del_Disseny_de_Barcelona-Barcelona_Catalonia.html", "text": "There were really friendly staff who gave you personal reccomendations and the tickets were great because they lasted for two days. They showed all kinds of designs in just four floors", "publishedDate": "2018-02-11", "language": "en", "rating": 4}, {"id": 552251326, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d4722328-r552251326-Museu_del_Disseny_de_Barcelona-Barcelona_Catalonia.html", "text": "Nice museum if you are interested in design. Entrance for first sundays of every month is free all day. We enjoyed all the permanent exhibitions but temporary exhibitions were closed so i guess they ask to be paid for them. ", "publishedDate": "2018-01-07", "language": "en", "rating": 4}, {"id": 544663845, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d4722328-r544663845-Museu_del_Disseny_de_Barcelona-Barcelona_Catalonia.html", "text": "The nearest metro station to Museu del Disseny is Glories. Just in front of the entrance to the museum passes tram lines 4, 5 and 6 and the stop is close by.\n\nWe bought our senior tickets to the design museum for 4 euros each at the counter and walked over to the museum guard by the escalators. When the guard saw my walking sticks she asked whether I would prefer to use the lift. So I did and she lent me a lift card that I had to hold against a reader every time I used the lift. She reminded me to return the lift card before leaving. \n\n The new Design Museum brings together all kinds of desing in the same building. Here you will find collections of fashion from 20th and 21st centuries, of graphics as posters, calenders, cards and boxes and of furniture, lamps, vehicles and recipients. The museum is spread over floors connected by escalators.\n\nWe started at the top floor and found ourselves among dresses and underwear from centuries. I ran out of battery so I miss photos from the lower floors.", "publishedDate": "2017-12-02", "language": "en", "rating": 5}, {"id": 544074932, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d4722328-r544074932-Museu_del_Disseny_de_Barcelona-Barcelona_Catalonia.html", "text": "The place has some really nice temporary collections from design field (products to clothes, etc). Arrange at least 1,5 hours to go through some of the important parts of the exhibitions. Also the tickets is comparatively cheap. ", "publishedDate": "2017-11-29", "language": "en", "rating": 3}, {"id": 528139920, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d4722328-r528139920-Museu_del_Disseny_de_Barcelona-Barcelona_Catalonia.html", "text": "Interesting exhibition on his career, full of music and explanations. The building is also interesting ", "publishedDate": "2017-09-28", "language": "en", "rating": 4}, {"id": 525726275, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d4722328-r525726275-Museu_del_Disseny_de_Barcelona-Barcelona_Catalonia.html", "text": "This excellent design museum (opened in 2014) covers both graphic design (4th floor), fashion (3rd floor), furniture design (in a very broad sense, 2nd floor) and product design (1st floor). The exhibits range from outstanding Coptic textiles from the 3rd century to excellent ceramics by Miro and Picasso. The principles behind the four exhibitions are different. We followed an advice to start from the top and the graphic design exhibits has five sections ranging from 1940 until the 1980’s. The third floor in an outstanding way shows how “Dressing the body” from 1550 – 2015 was in different ways using five principles: increasing, reducing, elongating, profiling and revealing. At the second floor, you can experience 30 unique and outstanding pieces combined with collections of among other drawers, pocket watches and folding fans. On the first floor among other, you can hear the stories of 14 designers of different products. Do not miss the also very interesting story behind the new museum as a merger four museums (displayed on the second floor). Moreover, a visit to the museum cafeteria is also highly recommendable. Finally, the museum also offers several other things, among other special exhibitions – at our visit a retrospective David Bowie exhibition, that we had missed in Berlin, primarily due to long queues, but we were lucky both to experience here in Barcelona and to become aware of the qualities of this excellent design museum.", "publishedDate": "2017-09-19", "language": "en", "rating": 5}, {"id": 524305587, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d4722328-r524305587-Museu_del_Disseny_de_Barcelona-Barcelona_Catalonia.html", "text": "Like many people, we came to see the Bowie exhibition, but as a place in its own right the Museu del Disseny is worth a visit.\n\nInnovative design and set in the heart of a vibrant area with the market and Torre Agbar, it's worth venturing out here for a wander, a coffee, and a sit in the sun on the deckchairs.\n\nThere's always a diverse range of exhibitions on so give it a visit.", "publishedDate": "2017-09-14", "language": "en", "rating": 5}, {"id": 522952509, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d4722328-r522952509-Museu_del_Disseny_de_Barcelona-Barcelona_Catalonia.html", "text": "This is an absolute must if you are a Bowie fan - you won't be disappointed. \n\nAll his work and influences are here and what an amazingly talented man he was; I don't think we will see anyone quite like him again.  \n\nThe exhibits were excellent as was the audio which you carry as you walk around - wonderful just hearing that voice talking about his work - a great line i will remember when he talked of the 'word randomiser' he developed....its great because you can come up with all sorts 'without wasting time sleeping and dreaming or getting stoned'!", "publishedDate": "2017-09-09", "language": "en", "rating": 5}, {"id": 522417080, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d4722328-r522417080-Museu_del_Disseny_de_Barcelona-Barcelona_Catalonia.html", "text": "Came here to see the David Bowie is exhibition & was blown away by how amazing the place was,helpful staff who spoke english & pointed us in the right direction to the exhibition itself,the curators are the V & A from London who i have to say have done such a fantastic job in the way they have set this.You can guess that you go from David's humble beginings right through to Blackstar & from begining to end you are in wonderment,staff are placed all around the exhibition prohibiting any photos or touching of any of the exhibits.\nThe exhibition itself finishes on 25th September where i think returns to London,if you get a chance to see this wonderful exhibition,fan,super fan or just an admirer of David's work you must see it to believe it and trust me you will not regret it.", "publishedDate": "2017-09-07", "language": "en", "rating": 5}, {"id": 522368163, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d4722328-r522368163-Museu_del_Disseny_de_Barcelona-Barcelona_Catalonia.html", "text": "I recently visited the Museu del Disseny whilst visiting Barcelona to see the David Bowie IS exhibit, and wow am I glad I did! I'm not a die hard Bowie fan but am a fan none the less, and can report that this exhibit quickly became a highlight of my life. \n\nThe reception area of the museum is beautiful, with high ceilings, fresh white walls, full length pristine windows and multi-lingual, friendly staff. Entering into the exhibit we were greeted with a friendly girl who gave us all the information we needed and our headsets, which really made the exhibit what it was, as the headsets automatically voiced what you were looking at as you wandered around. Which was particularly good while watching the interviews and music videos set around the displays.\n\nThe exhibit was full of David Bowie facts, at least one if not more of his outfits from each era, handwritten lyrics, and tons more information about the legend himself. The best part by a mile was the end of the exhibit named 'David Bowie IS all around you'. I won't give too much away, but all I will say is that this is the moment it became a highlight of my life. Booming music, with archived video footage and Bowie artifacts around the huge room made it an experience of a lifetime. Something which I will never forget and will continue to tell people about and encourage them to go and see for themselves.\n\nIf you are a David Bowie fan then you need to go and see this, if you are not you still need to go and see this. To be able to celebrate a man’s life in such a magnificent way like this, just shows how much he influenced and continues to inspire people all over the world. A must see for any music fan.", "publishedDate": "2017-09-07", "language": "en", "rating": 5}, {"id": 518290295, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d4722328-r518290295-Museu_del_Disseny_de_Barcelona-Barcelona_Catalonia.html", "text": "I recently visited the museum for the David Bowie exhibition and was treated to a huge, immersive 3 hour visit which was fantastic and did not disappoint. The space is beautiful and the care and attention to the exhibit was clear. My only gripe would be that there should have been more evenly spaced \"stops\" - there was a lot of standing and wandering! But overall, a great day.", "publishedDate": "2017-08-28", "language": "en", "rating": 5}, {"id": 514009157, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d4722328-r514009157-Museu_del_Disseny_de_Barcelona-Barcelona_Catalonia.html", "text": "If you are a fan, this is a must see. If you are not a fan, this is a must see. Rich, in depth exploration of the life and creation of this musicical icon. Lovely museum and staff, well run educational programs along with this specific exhibition.", "publishedDate": "2017-08-16", "language": "en", "rating": 5}, {"id": 509309321, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d4722328-r509309321-Museu_del_Disseny_de_Barcelona-Barcelona_Catalonia.html", "text": "Starting with superb, friendly, multi-lingual service at both reception and the downstaits information desk, I discovered that this building houses vast exhibition space (\"David Bowie is\", transferred from the V&A in London), theatre, cinema - Free entry to see 'Cracked Actor' the Documentary made of Bowie during his transition from being Ziggy Stardust into Diamond Dogs, followed by a HD screening of 'Labyrinth' with crystal-clear sound. Museum spaces, a large restaurant & bar, outside water features and sculpture, three other floors I haven't yet explored(!). Obviously, I'm going back.", "publishedDate": "2017-08-06", "language": "en", "rating": 5}, {"id": 504519548, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d4722328-r504519548-Museu_del_Disseny_de_Barcelona-Barcelona_Catalonia.html", "text": "May be this effects my evaluation but I visited Museu del Disseneny de Barcelona at noon when there was no rush. I saw incredible David Bowie is... exhibition. Highly recommended!! \n\nI also visited other exhibitions and it was worth it. Café is also really nice.", "publishedDate": "2017-07-22", "language": "en", "rating": 4}, {"id": 502307055, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d4722328-r502307055-Museu_del_Disseny_de_Barcelona-Barcelona_Catalonia.html", "text": "We went to see the David bowie is exhibition at the Barcelona design museum. The exhibition is very nice with lots of music and explanations both in Spanish and English and worth the efforts and the costs. Pity that for visiting the museum itself, you have to add an extra pay (although you're entitled to a 50% discount) Why not sell a combined ticket?\nif you are into bowie's history and like to have a very good look at his contribution to pop music, art and free spirit, don't miss this show while in Barcelona.\nThe place has a nice cafeteria with choice of small sandwiches beverages and sweets, a good stop to rest your feet's and cool yourself before heading out to the warm July. Next to the museum there is the flea market you can visit to. and if you wish to buy some clothes visit the Gloria's, not more than five minutes walk from the museum.", "publishedDate": "2017-07-15", "language": "en", "rating": 5}, {"id": 496488699, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d4722328-r496488699-Museu_del_Disseny_de_Barcelona-Barcelona_Catalonia.html", "text": "This exposition, borrowed from a London Museum, is unbelievable, A must see for all those who knew and adored Bowie. The final exposition room with an almost 3D concert presentation is out of this world ! Ends 25th of September. No other European city will be visited.", "publishedDate": "2017-06-27", "language": "en", "rating": 5}, {"id": 494686239, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d4722328-r494686239-Museu_del_Disseny_de_Barcelona-Barcelona_Catalonia.html", "text": "I have visited Museu del Disseny on several occasions but this time it was for the V&A-exhibition David Bowie is. The pricy ticket buys you an audio-tour through David Bowies life complete with music, interviews, costumes, sketches and film clips. A bot sad that you are not allowed to take pictures inside the exhibition, but the gift shop outside got you covered with postcards and other memorabilia. Be aware  that the ticket for the Bowie-exhibit and the normal museum ticket are two different tickets and will not let you access the other part of the museum.", "publishedDate": "2017-06-20", "language": "en", "rating": 5}, {"id": 494510816, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d4722328-r494510816-Museu_del_Disseny_de_Barcelona-Barcelona_Catalonia.html", "text": "Currently they have fantastic \"David Bowie Is\" exhib from Londons V&A, and that should not be missed.\n\nModern building, clean. Looks like a museum of anything modern miles away.", "publishedDate": "2017-06-20", "language": "en", "rating": 4}, {"id": 490217714, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d4722328-r490217714-Museu_del_Disseny_de_Barcelona-Barcelona_Catalonia.html", "text": "We came at the Museu del Disseny de Barcelona for the \"David Bowie is\" exhibition and unfortunately did not have time to see anything else at the museum. The exhibition itself is very much worth visiting for David Bowie fans.", "publishedDate": "2017-06-03", "language": "en", "rating": 5}, {"id": 486201732, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d4722328-r486201732-Museu_del_Disseny_de_Barcelona-Barcelona_Catalonia.html", "text": "I happened to stop by on a day in which they had this free kitchen themed design expo. The items displayed were truly amazing and unique. Some items besides being beautiful looked really practical too. They kinda made you think why didn't I come up with that idea for a kitchen trinket. Also, besides the wonderful museum there's a less talked about cafe which is a really good hangout place.", "publishedDate": "2017-05-21", "language": "en", "rating": 5}, {"id": 484555532, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d4722328-r484555532-Museu_del_Disseny_de_Barcelona-Barcelona_Catalonia.html", "text": "The Museum of design is located in a hypermodern building next to the Glories metro station and the Torre Agbar. We went there to see the Collections of Decorative and Author-Centered Art from III. to XX. century, a permanent exhibition located on the second floor. The collections are impressive, very well chosen: pieces of III. century coptic church-clothes, fine ceramic tiles from the time of Caliphate of Cordoba, wooden chest and bedside painting with christian motives, pocket watches, miniatures, and many, many more...", "publishedDate": "2017-05-16", "language": "en", "rating": 4}, {"id": 477875287, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d4722328-r477875287-Museu_del_Disseny_de_Barcelona-Barcelona_Catalonia.html", "text": "If you buy a Barcelona Card entry to this is free. We bought one on arrival in the city and used it extensively for travel & attraction entry.\nThe museum is conveniently placed near Glories Metro station. The building itself is worth the visit, and the exhibition halls were varied and interesting, with multi lingual displays. Downstairs there is an absolutely superb cafe - beautifully designed (obviously...) but with lovely sensibly priced food. We spent a lot longer in this place than we planned, as it was so good.", "publishedDate": "2017-04-21", "language": "en", "rating": 5}, {"id": 475059361, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d4722328-r475059361-Museu_del_Disseny_de_Barcelona-Barcelona_Catalonia.html", "text": "The museum is in a very interesting modern building - the sort which makes you think \"how did they build that\" and \"how does it remain standing\"?  It's situated in an open space not far from Glories metro station, the Agbar tower and Glories shopping centre. We were advised by a member of staff to start on the top floor of the building and work down.  There are escalators to get you up and down..  Also a lift - but you need to get a card to operate it properly.  This was available from the man on duty  at the bottom of the escalator on the 2nd floor I think.  The top floor is dedicated to the graphic arts from the 50s to the 80s.  Very interesting to see how advertising has changed in those 30 or so years.  The next floor down is  fashion with dresses etc from the last 400 + years.  There are some magnificent dresses and menswear too.  There are examples of underwear, bras corsets and the supports for crinolines and bustles and so on.  Next floor down is older furniture.  Next modern classics in furniture and  iconic household objects.  On the ground floor there is the snack bar.   We were happy to sit down for a while in this light bright snack bar.  As well as a coffee we had lunch there.  Nice meal and not expensive.  There is an outdoor space for smokers and diners alike.", "publishedDate": "2017-04-12", "language": "en", "rating": 4}, {"id": 474650144, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d4722328-r474650144-Museu_del_Disseny_de_Barcelona-Barcelona_Catalonia.html", "text": "very interesting exhibitions and cool spaces, very close to many amenities like the flea market and the shopping mall", "publishedDate": "2017-04-11", "language": "en", "rating": 4}, {"id": 449908359, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d4722328-r449908359-Museu_del_Disseny_de_Barcelona-Barcelona_Catalonia.html", "text": "This museum was a very pleasant surprise since we had never heard of it on our previous stays in Barcelona.  It is interesting architecturally, and has very impressive collections.  The museum is beautifully laid out and organized on 4 floors, well-curated and extensive, ranging from the 3rd century to the 20th.  We especially enjoyed the diverse costume collection, as well as the very broad-based decorative arts.  Included in the latter are textiles, ceramics, glassware, furniture, tapestries, tileworks, etc.  There is also a section on innovative modern design, including household objects, and another on graphic arts from the 20th century.  It is easy to get to on the Line 1 Metro to Glories, and there is a nice cafeteria.  Unfortunately, there is no museum shop, which would be a good addition to the museum.", "publishedDate": "2017-01-06", "language": "en", "rating": 5}, {"id": 449148356, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d4722328-r449148356-Museu_del_Disseny_de_Barcelona-Barcelona_Catalonia.html", "text": "If you are interested in Design, then this is for you. Graphic design, costume, ceramics, furniture - it's all there, intelligently laid out.", "publishedDate": "2017-01-04", "language": "en", "rating": 5}, {"id": 437457695, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d4722328-r437457695-Museu_del_Disseny_de_Barcelona-Barcelona_Catalonia.html", "text": "Four flors of nice and intresting iteams. Cloths, fernitures, grafics,and more stuff that the people of.catalunia gave in 500 years. The place is full of light and cool stuff we all enjoyed spebding 3 hours of fun and colours😍😊   a", "publishedDate": "2016-11-15", "language": "en", "rating": 5}, {"id": 437369833, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d4722328-r437369833-Museu_del_Disseny_de_Barcelona-Barcelona_Catalonia.html", "text": "Sunday after 3pm this museum is free!  Our 14 year old daughter is very interested in fashion design and this collection was excellent.  It compared as well as and better than the Victoria and Albert collection in London and Palais Galleira in Paris.  Lots of excellent information (the english is grey and a bit hard to see) and a great look at Spanish style and design over more than 200 years.  The other floors contain beautiful and interesting items - don't miss the pocket watch collection!  The cafe is lovely and even has a gorgeous gluten free cake!  The bathroom was a typical example of modern design.  The tap splashes out over the counter and, as the counter is tilted slightly, the water then runs towards you and onto you.  Love the irony!  This museum is not overwhelming for older kids.  There is something for everyone here and if you go on Sunday after 3pm, even if your kids aren't turned on, you don't have to feel guilty about leaving! At the least they'll be intrigued by the escalator which slows down when no one is on it lol.", "publishedDate": "2016-11-15", "language": "en", "rating": 4}, {"id": 437162366, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d4722328-r437162366-Museu_del_Disseny_de_Barcelona-Barcelona_Catalonia.html", "text": "The museum has floors for clothing design, manufactured objects and wonderful handcrafted objects. Very interesting collections on all floors. The textile/clothing exhibit was fantastic - well curated with over a hundred pieces on show.", "publishedDate": "2016-11-14", "language": "en", "rating": 4}, {"id": 431794761, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d4722328-r431794761-Museu_del_Disseny_de_Barcelona-Barcelona_Catalonia.html", "text": "Take L1 and exit at station Glores you are right there under the shadows of Torre Agnar. \n\nThis is a museum combining 4 others that recently opened in 2014. It has four floors devoted to one discipline each: graphic art, fashion, decorative art and lifestyle designs. Well worth the visit especially when you cannot differentiate any churches any more and having a hard time understanding modern/contemporary/cubism styles or any other art periods, this is something that everyone can relate to and you do not need 5 hours and an audio guide to make you appreciate why it is in a museum. \n\nIf you are NOT impressed by the time you are done with the Museum go visit the patisserie on the lower level. It is modern, clean and food is good -- not an extensive menu but then if you are here you probably have been eating out for at least 4-5 meals and would appreciate a simpler menu. ", "publishedDate": "2016-10-26", "language": "en", "rating": 5}, {"id": 431311003, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d4722328-r431311003-Museu_del_Disseny_de_Barcelona-Barcelona_Catalonia.html", "text": "As a fashion graduate and my partner as a product design graduate, we really enjoyed the permanent collection of artefacts on show here. Fantastic examples of Spanish design for a very moderate price.\nHighly recommended for any design students visiting Barcelona!", "publishedDate": "2016-10-24", "language": "en", "rating": 5}, {"id": 418076068, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d4722328-r418076068-Museu_del_Disseny_de_Barcelona-Barcelona_Catalonia.html", "text": "This museum was highly enjoyable, and had a good cross-section of design perspectives covering graphic design, interior design, fashion, and textile design throughout the ages. They also had a modern section to provide some additional context. Definitely recommended for anyone interesting in human social history or of course design. Steps from the metro but a ways out from the city’s “centre of action”. Most content was translated into English. Staff were largely apathetic – mostly didn’t look up from their smartphones when we were in the rooms.", "publishedDate": "2016-09-13", "language": "en", "rating": 4}, {"id": 413441832, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d4722328-r413441832-Museu_del_Disseny_de_Barcelona-Barcelona_Catalonia.html", "text": "Puzzling ungainly building by mbm architects. Very friendly staff. Good exhibits, especially the product design on 1. ", "publishedDate": "2016-09-01", "language": "en", "rating": 4}, {"id": 407179101, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d4722328-r407179101-Museu_del_Disseny_de_Barcelona-Barcelona_Catalonia.html", "text": "Was walking around the El Poblenou neighborhood and came across this museum. Never heard of it but looked cool so we went in. Very cool space. Exhibits were a variety of designs e.g. fashion, furniture, posters, appliances etc.  If you are into this stuff might be a nice place to check out. It is very close to Els Encants Flea Market  which is HUGE and fun place to walk around.", "publishedDate": "2016-08-18", "language": "en", "rating": 4}, {"id": 388526304, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d4722328-r388526304-Museu_del_Disseny_de_Barcelona-Barcelona_Catalonia.html", "text": "Graphic design, costume, historical pieces filled this space. Almost too much too see, but extremely interesting nonetheless. The exhibit of historical clothing was particularly well done, with a contemporary piece of similar design placed in each period's section.", "publishedDate": "2016-07-02", "language": "en", "rating": 4}, {"id": 376363582, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d4722328-r376363582-Museu_del_Disseny_de_Barcelona-Barcelona_Catalonia.html", "text": "Cool place with exhibits over 4 floors. We started at the top with graphic design, but were exhausted after just that section. Then we split up: he to ceramics, I to fashion. My excursion was great; he was disappointed. But we both enjoyed the exhibit on the last floor full of a huge variety of everyday objects noted for their excellence and longevity of design. Not very crowded and helpful staff.", "publishedDate": "2016-05-25", "language": "en", "rating": 4}, {"id": 374099034, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d4722328-r374099034-Museu_del_Disseny_de_Barcelona-Barcelona_Catalonia.html", "text": "Located very conveniently near stroller-accessible tram and metro stations, the Museu del Disseny de Barcelona gave me a very good first experience in visiting a museum with a stroller-using toddler. We both enjoyed the exhibition and the staff was friendly and helpful. Stroller was allowed in all exhibition spaces and we got a special card for the very spacious elevator to be able to conveniently move from floor to floor. Also the cafe was very comfortable with lots of different seating options and big windows to spot birds and watch the water feature. The wheelchair-accessible toilet was spacious enough for the stroller and I could change her in my lap. Really the only things that were totally missing were a changing table and a high chair for a smaller baby; with a child capable of sitting and some communication, it was very well. I am happy to recommend Museu del Disseny de Barcelona to any family whose members need a safe and easy break from the hustle and bustle of the city or the hot rays of the Barcelona sun.", "publishedDate": "2016-05-18", "language": "en", "rating": 4}, {"id": 373245801, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d4722328-r373245801-Museu_del_Disseny_de_Barcelona-Barcelona_Catalonia.html", "text": "This is a new museum, amalgamating a jumber of separate individual collections. We had a particular interest in the ceramic collection, however it was limited. Although the layout was good expalining the progressive development of ceramic design there was only a small sample on display. Most of the collection is in storage since the amalgamation so it was dissapointing. The cafe however was different and offered a range of fresh delicious pastries which we enjoyed sitting on the terrace outside overlooking the water feature. Entrance is €6 with concessions and is worth a visit", "publishedDate": "2016-05-15", "language": "en", "rating": 3}, {"id": 373120390, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d4722328-r373120390-Museu_del_Disseny_de_Barcelona-Barcelona_Catalonia.html", "text": "An exhibition per floor - very well laid out per show as well. Start on the top floor and work your way down. \nBrilliant show on Spanish poster design, superbly presented. Another floor shows how much fun Spanish design has been over the decades. (Look for the toilet and Cobi!)\nThe bar area is great to chill out in. Smashing cakes! mmm and very affordable.\nA pleasant surprise - easy to get to from Glories station... \nCouldn't find a shop though - was looking for a book on apartment layouts...", "publishedDate": "2016-05-15", "language": "en", "rating": 4}, {"id": 368358348, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d4722328-r368358348-Museu_del_Disseny_de_Barcelona-Barcelona_Catalonia.html", "text": "Interesting collections and architecture of the place.\nFriendly service. \nVery good impressions after visiting", "publishedDate": "2016-04-27", "language": "en", "rating": 5}, {"id": 361686335, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d4722328-r361686335-Museu_del_Disseny_de_Barcelona-Barcelona_Catalonia.html", "text": "The museum covers many disciplines and eras of Design. The exhibition design itself is very well done. Videos, interactive screens and small animations makes it easy to engage with the different subjects. The building is also a great experience. ", "publishedDate": "2016-04-05", "language": "en", "rating": 4}, {"id": 359217328, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d4722328-r359217328-Museu_del_Disseny_de_Barcelona-Barcelona_Catalonia.html", "text": "Superb collection .. they had 4 floors dedicated to each category.. The evolution of fashion collection is just amazing", "publishedDate": "2016-03-27", "language": "en", "rating": 5}, {"id": 358630120, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d4722328-r358630120-Museu_del_Disseny_de_Barcelona-Barcelona_Catalonia.html", "text": "We had such a great time there, I think we were there for almost 4 hours. The bottom floors of the building contain a library and spaces for artists to work at, and the four upper floors are the museum (we did have a stroll at the downstairs area as well, we got there because that's where you can put your bags for safekeeping).\n\nEach floor houses its' own unique collection (which, as far as I could tell, changes from time to time). When we were there the floors contained:\n1. A collection of illustrated advertising, going back to the 1920's (I think) up to the 1980's. I can't remember if it had English explanations on there, but the Spanish ones were really interesting.\n2. A wonderful exhibit of clothing going back to the 1530's till modern times. Each had a detailed explanation of what the silhouette was trying to achieve, so that was very informative and again interesting to look at trends throughout the times.\n3. A collection of miscellaneous artifacts from Barcelona: fabrics, household items, and it even housed the oldest surviving chariot (Cinderella style, it was just beautiful).\n4. An exhibit about Barcelona designers and how they impacted the world. If you're not familiar with the history of design, some of the items might really surprise you.\n\nMost of the other visitors we saw just skimmed through and were done really fast, but we thought that reading and looking through everything closely was just such a learning experience, we would've spent a lot more time there if we could afford it. Highly, highly recommended.", "publishedDate": "2016-03-25", "language": "en", "rating": 5}, {"id": 352402660, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d4722328-r352402660-Museu_del_Disseny_de_Barcelona-Barcelona_Catalonia.html", "text": "We spent a little less then an hour at the exhibits.  We visited the permanent exhibit - so as seniors we got in for 4 euros each.  I liked the clothes display and the graphic arts exhibit the best.", "publishedDate": "2016-03-02", "language": "en", "rating": 4}, {"id": 348596613, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d4722328-r348596613-Museu_del_Disseny_de_Barcelona-Barcelona_Catalonia.html", "text": "Collections are arranged around selective exhibitions, i.e. you do not see ALL the ceramics, or fashion they have. I found it extremely interesting and beautiful, especially the fashion collection and 20c Spanish Catalan design.\n\nThe cafeteria restaurant is excellent: well priced, attractive and with helpful, friendly service. Lunch menu at 13 euros was worth having.", "publishedDate": "2016-02-17", "language": "en", "rating": 4}, {"id": 346869288, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d4722328-r346869288-Museu_del_Disseny_de_Barcelona-Barcelona_Catalonia.html", "text": "This is not any museum the typical tourist would go to, and it wasn't until our 6th trip to Barcelona that we visited it, but it is certainly worthwhile.\nThe permanent exhibition shows industrial design objects (chairs, tables, toasters, faucets, ...), graphic design (posters, ...), fashion, china etc.  \nDownstairs there is a library and a cafeteria. \nCompared to other museums in Barcelona, the entrance fee is very low (6 € for adults).  \n", "publishedDate": "2016-02-11", "language": "en", "rating": 5}, {"id": 328196215, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d4722328-r328196215-Museu_del_Disseny_de_Barcelona-Barcelona_Catalonia.html", "text": "Yep, it's the building the locals call \"the stapler\". It has a plane in the canal water feature behind it.  It's next to the phallic Torre Agbar--which, warning, closed at 15:30 the days we were there--and you reach it by Metro or tram to Glòries. The museum was formed from 4 previous museum collections, they are a fantastic survey of graphic design, textiles, ceramics, glass etc etc.  Just when you think the Museu Nacional has a stunning collection, you find they have even more good stuff here.  You get a two day pass for a low entry, the building is cool and well-designed, the cafe is fun with lovely staff.  BUT STAY TILL DARK TO SEE THE LIGHT SHOW IN THE PLAZA OUTSIDE!!!  During the day there are chairs and tables there to picnic or drink. \nTruly this will anchor a design hub for BCN.  A very worthwhile visit.", "publishedDate": "2015-11-21", "language": "en", "rating": 5}, {"id": 325587753, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d4722328-r325587753-Museu_del_Disseny_de_Barcelona-Barcelona_Catalonia.html", "text": "Didn't visit the museum itself; outside there's a plaza with hundreds of LED multicolored strips. On the other side, four metallic speakers rise from the ground. Approach them and try clapping or singing into them - you won't regret seeing what happens.", "publishedDate": "2015-11-09", "language": "en", "rating": 4}, {"id": 323303317, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d4722328-r323303317-Museu_del_Disseny_de_Barcelona-Barcelona_Catalonia.html", "text": "Spacious design museum with a theme per floor and very interesting free temporary exhibit on the ground floor. The staff are interested in the substance of the museum. And there's a cafeteria.", "publishedDate": "2015-10-30", "language": "en", "rating": 5}, {"id": 320257891, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d4722328-r320257891-Museu_del_Disseny_de_Barcelona-Barcelona_Catalonia.html", "text": "My wife and I went to this museum and there were two sections that we enjoyed. One was the section about fashion, where you could see fashions starting from the 18th century to today. The other section we enjoyed was the decorative arts section, which had many beautiful exhibits.\n\nThere is a cafeteria at the basement of the building.", "publishedDate": "2015-10-19", "language": "en", "rating": 5}, {"id": 319374496, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d4722328-r319374496-Museu_del_Disseny_de_Barcelona-Barcelona_Catalonia.html", "text": "If you have any interest in any sort of design this museum is a must see. I loved it. There are 4 floors of exhibitions and we spent almost 4 hours there. There is also a lovely cafeteria where we enjoyed tea. Plan to be there when the museum closes as the square next door has a great light show. ", "publishedDate": "2015-10-16", "language": "en", "rating": 5}, {"id": 316575865, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d4722328-r316575865-Museu_del_Disseny_de_Barcelona-Barcelona_Catalonia.html", "text": "I visited the Museu del Disseny de Barcelona with my husband and we were both very impressed. The exhibitions were divided over a series of levels and we were advised to start at the top and work our way down to the bottom. My favourite exhibition was was 'Dressing the Body' which looked at changing silhouettes in fashion between 1550 and 2015. A lot of money had clearly gone into the displays which looked stunning. There was also plenty of interpretation. If you go the museum's website you can take a brief look at the exhibitions before you visit. The staff were welcoming and attentive and I would definitely visit again.", "publishedDate": "2015-10-06", "language": "en", "rating": 4}, {"id": 315518814, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d4722328-r315518814-Museu_del_Disseny_de_Barcelona-Barcelona_Catalonia.html", "text": "Our hotel, Teatre Auditori, was located near Glories metro. A visit to Glories puts you near to the Mercat, a huge flea market, Glories shopping centre (with restaurants and a cinema) and The Design Museum, which is an interesting building with interesting exhibits. It lacks a shop, which is a shame, as I think it would be a good one! cou", "publishedDate": "2015-10-02", "language": "en", "rating": 4}, {"id": 314866615, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d4722328-r314866615-Museu_del_Disseny_de_Barcelona-Barcelona_Catalonia.html", "text": "Great museum for design nerds. Great information in English including a full printed guide and most signs. Their permanent collection is interesting and well curated and the current fashion exhibit is fascinating. There is also a free exhibit on the lower level.\n\nVery good value, off the beaten path, and highly recommended for designers and those interested in design (including those looking to get an appreciation to what design is).\n\nThe outdoor plaza with the light-up, voice activated display is a must-see at night (and fun if you have kids).\n\nThere are restaurants and a shopping center nearby which made for a nice break between exhibits since I like to take my time at museums.", "publishedDate": "2015-09-29", "language": "en", "rating": 5}, {"id": 314075809, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d4722328-r314075809-Museu_del_Disseny_de_Barcelona-Barcelona_Catalonia.html", "text": "After visiting a great number of places originating in the distant past, it is good to get a dose of modern times. The Design Museum provides wonderful insights into what makes for good design with some great examples to view.  We particularly enjoyed the history of fashion and its tie in to the society of the times.  it was a wonderfully refreshing visit.", "publishedDate": "2015-09-27", "language": "en", "rating": 4}, {"id": 313848614, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d4722328-r313848614-Museu_del_Disseny_de_Barcelona-Barcelona_Catalonia.html", "text": "Visited with my boyfriend who is a graphic designer and we both enjoyed it. Free entry was also a bonus and the fashion exhibition was very interesting. ", "publishedDate": "2015-09-26", "language": "en", "rating": 5}, {"id": 313371741, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d4722328-r313371741-Museu_del_Disseny_de_Barcelona-Barcelona_Catalonia.html", "text": "What a discovery : 4 museums in 1 building. . Now 4 special exhibitions. Dontt miss the exhibition : DRESSING THE BODY , aswell as on the 2nd floor a good overvieuw of the Catalan art.", "publishedDate": "2015-09-24", "language": "en", "rating": 5}, {"id": 306654747, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d4722328-r306654747-Museu_del_Disseny_de_Barcelona-Barcelona_Catalonia.html", "text": "This museum does not get a lot of attention and it is a bit away from the major tourists sites.  Nonetheless it is worth a visit.  The collections of clothes, advertising design, ceramic and furniture art, etc are all very interesting, well displayed and well explained.  The entire floor devoted to clothing was both interesting and enlightening.  Kudos to those responsible for displaying the various collections.", "publishedDate": "2015-09-03", "language": "en", "rating": 5}, {"id": 306199060, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d4722328-r306199060-Museu_del_Disseny_de_Barcelona-Barcelona_Catalonia.html", "text": "Had a great tour of the building, their displays showcased hundreds of influential graphic design artists, as well as design from up and coming designers of this era. Highly recommend and the staff were lovely and helpful. The cafe had opened on the day of our visit for the first time, food was great and also very fairly priced. ", "publishedDate": "2015-09-02", "language": "en", "rating": 5}, {"id": 293049095, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d4722328-r293049095-Museu_del_Disseny_de_Barcelona-Barcelona_Catalonia.html", "text": "The museum is full of clothes, cabinets, chairs, furniture, lights, vases, skateboards and a lot of stuff. There are old and new designs and you can see things that you had so many years ago. ", "publishedDate": "2015-07-27", "language": "en", "rating": 5}, {"id": 289859494, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d4722328-r289859494-Museu_del_Disseny_de_Barcelona-Barcelona_Catalonia.html", "text": "The building itself is an art peace, exhibition is interestng with great display.  Costume collection, decorativearts collection and post design collection are all fantastic!", "publishedDate": "2015-07-17", "language": "en", "rating": 5}, {"id": 284177478, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d4722328-r284177478-Museu_del_Disseny_de_Barcelona-Barcelona_Catalonia.html", "text": "Really great, I went there to go to the OFFFest and it couldn't be a better place, too bad some of the museu departments weren't open.", "publishedDate": "2015-06-30", "language": "en", "rating": 5}, {"id": 274209431, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d4722328-r274209431-Museu_del_Disseny_de_Barcelona-Barcelona_Catalonia.html", "text": "This new and dramatic building offered a promise of exposure and creative approach to Spanish and Catalina design.  Although the collection of objects includes some interesting and\nExciting pieces there was nothing in the organization of the exhibits which was instructive or enlightening as to the impact of technology, world events , or economy and their\nImpact on the vicissitudes of design.  \nOne does not need to be told that clothes became loser after WWI when it's obviously so but conjecture or research into the causes and ramifications would have been edifying", "publishedDate": "2015-05-24", "language": "en", "rating": 3}, {"id": 266461683, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d4722328-r266461683-Museu_del_Disseny_de_Barcelona-Barcelona_Catalonia.html", "text": "We passed this building every day on our trip to Barcelona as it was in between the metro stop - Glories - and our hotel - Silken.\n\nInteresting to look at and walk around - especially with the floor light display on at night. ", "publishedDate": "2015-04-18", "language": "en", "rating": 4}, {"id": 237398515, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d4722328-r237398515-Museu_del_Disseny_de_Barcelona-Barcelona_Catalonia.html", "text": "This is not about the museum as a whole, but this exhibition, which has advertising posters all over the city, making you think it is a major operation.\n\nThe exhibition is free, but there is so little there that it is really not worth the trouble of the metro ride. There is a looping video with old movies, a few stanzas about how Art Nouveau is inspired by organic forms, a few reproductions. The whole exhibition covers perhaps 100 square meters and has no original art. It is obvious that very little effort, thought, or expense went into it.\n\nAs someone who goes regularly to museums of different kinds, I would venture that some lesser employee was simply instructed to \"put up anything, so long as we can say that we have an ongoing exhibition\".\n\nY ademas, no hay texto en Castellano, solo Catalan e Ingles - un actidud excesivamente politizado, en un campo inapropriado.", "publishedDate": "2014-11-01", "language": "en", "rating": 1}, {"id": 219822175, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d4722328-r219822175-Museu_del_Disseny_de_Barcelona-Barcelona_Catalonia.html", "text": "The exhibition for this summer is work from architecture, furniture design and graphic design. All of these are awesome designs and it's thought-provoking. I enjoyed it very much ", "publishedDate": "2014-08-05", "language": "en", "rating": 5}, {"id": 205512314, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d4722328-r205512314-Museu_del_Disseny_de_Barcelona-Barcelona_Catalonia.html", "text": "Quite a journey out on the Metro to get to the gardens of the Palau Reial to enjoy the gardens and view the exhibits in the museums.  The gardens were green, cool and pleasant for a walk. \n\nBUT - we had gone predominantly for the museums, but these had moved to a completely different venue. We were NOT happy.", "publishedDate": "2014-05-14", "language": "en", "rating": 1}, {"id": 148613064, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d4722328-r148613064-Museu_del_Disseny_de_Barcelona-Barcelona_Catalonia.html", "text": "When we visited today we were told by the unfriendly cashiers that the museum was no longer open.  The Ceramics Museum is the only exhibit that can be visited in the Palace.", "publishedDate": "2013-01-02", "language": "en", "rating": 1}, {"id": 146242703, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d4722328-r146242703-Museu_del_Disseny_de_Barcelona-Barcelona_Catalonia.html", "text": "Well worth your time visiting the three wonderful museums located inside a  palace with a majestic\nentry through a beautiful park.  Franco himself made it his home when visiting Barcelona.  Don't skip the upper floor where the most interesting museum of historical  clothes is located.", "publishedDate": "2012-11-26", "language": "en", "rating": 5}, {"id": 143090831, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d4722328-r143090831-Museu_del_Disseny_de_Barcelona-Barcelona_Catalonia.html", "text": "Friends and I specifically visited this museum to view the Van Cleef Arpels exhibit.  This exhibit was one of the most spectacular exhibits of fine Jewellery I have seems.  It was well thought out with examples of each period of Jewellery making.  The quality and skill of the craftsmen from the van cleef workshop was prominently displayed through the invisible setting and the zipper necklace displays.  If your love fine Jewellery, this is not to be missed!", "publishedDate": "2012-10-17", "language": "en", "rating": 5}, {"id": 120140673, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d4722328-r120140673-Museu_del_Disseny_de_Barcelona-Barcelona_Catalonia.html", "text": "This museum shows the evolution of the decorative arts in chronological order, starting from the Romanesque period of art.\n\nOther periods are the Gothic age, the Renaissance period, the Baroque age, the Rococo age, the Neoclassic period, the Neoclassic Imperial period, the Romantic period, the Historic Romantic period, the Modernist period, the Novecentismo and Art Deco periods, and industrial design that happened between 1930 and 1990. There are explanations for all the exhibits. Most of the exhibits came from Catalunya. \n\nSo this is a very interesting museum.", "publishedDate": "2011-11-03", "language": "en", "rating": 4}]}}]