[{"locationId": 240755, "name": "Glories", "placeType": "ATTRACTION", "reviewListPage": {"reviews": [{"id": 751215735, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d240755-r751215735-Glories-Barcelona_Catalonia.html", "text": "They were under construction, not so pleasant but enjoyed walking into every store to check out.  Very clean place", "publishedDate": "2020-03-17", "language": "en", "rating": 4}, {"id": 745540199, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d240755-r745540199-Glories-Barcelona_Catalonia.html", "text": "Great place in Barcelona Glòries .\nIt’s just 2 minute walking distance from our hotel where we stayed .\nToo many restras .\nShopping outlets .\nWe visited tapa tapa restra .\nWe enjoyed food there .\nI will highly recommend this place to everyone.", "publishedDate": "2020-02-16", "language": "en", "rating": 5}, {"id": 717077304, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d240755-r717077304-Glories-Barcelona_Catalonia.html", "text": "Biggest mall in the area. Has good choice of shops if that’s what you want in Barcelona. Carrefour is in there and good for general things", "publishedDate": "2019-10-10", "language": "en", "rating": 3}, {"id": 708207956, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d240755-r708207956-Glories-Barcelona_Catalonia.html", "text": "A convenient place to shop with various stores. Being close to the hotel we booked as well as major transportation!", "publishedDate": "2019-09-09", "language": "en", "rating": 5}, {"id": 687898501, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d240755-r687898501-Glories-Barcelona_Catalonia.html", "text": "This was the closest shops to our hotel (10-15mins) and was our go to everyday!  This mall has fewer tourists and has some great shops, restaurants (including fast food) and a large supermarket and opens late, the later the busier!\n\nWe went here to also use the free toilets which were very clean. It’s also one of the hop on hop off tours (red bus) stops which was ideal instead of using public transport we just got off here and walked 8mins to the Main Street of eateries in the Poblenou area.", "publishedDate": "2019-07-08", "language": "en", "rating": 5}, {"id": 679640846, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d240755-r679640846-Glories-Barcelona_Catalonia.html", "text": "... Look so pretty.\nCarrefour is in a big format here and the store staff is very helpful. \n\nTram T1 runs next to the mall so you can continue or hop here post sightseeing as well.", "publishedDate": "2019-06-06", "language": "en", "rating": 4}, {"id": 678269230, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d240755-r678269230-Glories-Barcelona_Catalonia.html", "text": "The Glories shopping center is located on the Diagonal.  It's got a metro stop that will can you into the center of town and vice versa.  There's a lot to like here.\n\nThere's a gourmet \"food court\" on the lower level.  This is actually a grouping of about ten restaurants, each with its own seating.  They are first class.  This is ideal for sampling tapas from place to place.\n\nThey have a huge Carrefour supermarket.  If you picnic or want to buy wine for your hotel room, the selection is enormous.\n\nAmazingly, they have a store in the mall that only sells frozen food!  Not useful for us tourists, but it can be a good place to pickup ice cream.\n\nUp on the surface, they've done something novel in pedestrian seating.  They have built small hills, covered in AstroTurf grass!  Lounge chairs with slings made of grassy AstroTurf too!\n\nOur hotel was nearby.  We visited at least twice.  This is a great resource!", "publishedDate": "2019-06-02", "language": "en", "rating": 4}, {"id": 678052781, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d240755-r678052781-Glories-Barcelona_Catalonia.html", "text": "We visited the mall because the weather was not great to go on sightseeing on that day.\nThe mall was not too big, but in bit complicated design so we got confused when we reached. There are some shops around the entrance area and further down, there is the main mall with a huge supermarket.\n\nThere are some shops where they sell reasonable clothing and accessories and we enjoyed shopping. There are some restaurants in the mall, too.\n\nThe location is also accesible from the metro station. ", "publishedDate": "2019-06-01", "language": "en", "rating": 4}, {"id": 669114459, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d240755-r669114459-Glories-Barcelona_Catalonia.html", "text": "OK I stumbled on this while wandering. This huge shopping facility has McDonalds, Burger King and about 20 other restaurants. It has numerous cell phone providers and about 80 plus shopping stores. It has Costa Coffee, a huge Carrefour (grocery store). There was numerous children activities I saw. It appears that it's three (3) stories underground two (2) parking and two (2) above ground. There are escalators in the above level going up.", "publishedDate": "2019-04-25", "language": "en", "rating": 4}, {"id": 668612521, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d240755-r668612521-Glories-Barcelona_Catalonia.html", "text": "The mall is very nice, a lot of different shops and restaurants. Wasn’t that too busy and touristic which is always a plus, and it has everything you need and you’re looking for in a shopping mall.", "publishedDate": "2019-04-23", "language": "en", "rating": 5}, {"id": 656795508, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d240755-r656795508-Glories-Barcelona_Catalonia.html", "text": "This shopping mall is conveniently located across the street from Novotel and right at the tram stop Ca l'Aranyó. It hosts several eateries, some of which are recommendable such as Tapa Tapa. The selection of stores is good with a big Carrefour supermarket in case you want to grab a bite to eat (e.g. sandwich or sushi) and take it to your hotel room. The restrooms are very clean.", "publishedDate": "2019-03-06", "language": "en", "rating": 5}, {"id": 637867987, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d240755-r637867987-Glories-Barcelona_Catalonia.html", "text": "It's a new mall with a great variety of shops, some restaurants & cafes, Carrefour and fnac. There's also a zone for kids. I like this place cause it is not a one building, it's partially an open area.", "publishedDate": "2018-12-06", "language": "en", "rating": 4}, {"id": 626320159, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d240755-r626320159-Glories-Barcelona_Catalonia.html", "text": "Amazing mall with so many shops and restaurants! Didn’t appear to get too busy which was good! Carrefore is located there too! Definitely check out Stradivarius and Lefties 😎", "publishedDate": "2018-10-18", "language": "en", "rating": 4}, {"id": 622481081, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d240755-r622481081-Glories-Barcelona_Catalonia.html", "text": "Nice shopping, lots of different stores and restaurants. Should definitely visit if you have some time 😁", "publishedDate": "2018-10-05", "language": "en", "rating": 5}, {"id": 621675456, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d240755-r621675456-Glories-Barcelona_Catalonia.html", "text": "Ideal shopping center for both tourists and locals built on 2 floors. Different shopping experiences if you need to buy food to take home, a take away sandwich, ice creams, desserts, clothes shopping, perfumes, books and music, office products, or simply to stop by at Starbucks. ", "publishedDate": "2018-10-02", "language": "en", "rating": 4}, {"id": 607573689, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d240755-r607573689-Glories-Barcelona_Catalonia.html", "text": "Veery nice shopping mall with lots of restaurent and a hyper market. Lots of shopping store with good brands, you can have a good time there if you are seeking for shopping. The price and average tohigh.", "publishedDate": "2018-08-18", "language": "en", "rating": 4}, {"id": 605348898, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d240755-r605348898-Glories-Barcelona_Catalonia.html", "text": "After one Year and a Half of Remodeling Process, I have Finally Experienced the whole New concept of Shopping at Les Glòries in BCN. It’s simply unique. The 2 store floor Shopping mall has everything you could expect: Nicest brands, Great designs, even the smell of the atmosphere is atonishing and gives you a sense of sophistication. Starbucks, Uniqlo, Khiels, AExchange, FNAC, Adidas and JD don’t Miss over there. The Toilettes are always clean, the car park has a 2 hours free disposal even you buy or not, and it is well communicated within the city centre. Big enough not to be huge and beautifully designed. You can have breakfast, lunch or dinner,  watch a movie and also supermarkets such as Carrefour or Veritas. All in One.", "publishedDate": "2018-08-11", "language": "en", "rating": 5}, {"id": 599680617, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d240755-r599680617-Glories-Barcelona_Catalonia.html", "text": "Tired of old Barcelona and the busy RA Ramblas ; Glories is a good place to do shopping ; full of high end stores; varieties of Resturant’s from local serving TAPA TAPA to international fast food ; the place is vibrant ; mixing inside and outside which makes more pleasant ; loved the place", "publishedDate": "2018-07-25", "language": "en", "rating": 4}, {"id": 591984432, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d240755-r591984432-Glories-Barcelona_Catalonia.html", "text": "spend the day in the company of my 4 children in the age 2 - 19 y. We had a great time. A great variation of shops. We spend 7 hours shopping. A nice combination of indoor and outdoor shopping. A very nice food court, with a range off different restaurants. We will come back!!", "publishedDate": "2018-06-30", "language": "en", "rating": 5}, {"id": 590670400, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d240755-r590670400-Glories-Barcelona_Catalonia.html", "text": "Its a very nice place when you can do shopping with nice music, a lot of restaurant and good places to set and take photos with an amazing colors every where ", "publishedDate": "2018-06-25", "language": "en", "rating": 5}, {"id": 590287631, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d240755-r590287631-Glories-Barcelona_Catalonia.html", "text": "Interesting shops great restaurants cafes coffee shops & indoor outdoor dining. Clean new & fresh  & very child friendly. Cinema & a great large supermarket with interesting fresh produce & cafe. ", "publishedDate": "2018-06-24", "language": "en", "rating": 4}, {"id": 586182188, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d240755-r586182188-Glories-Barcelona_Catalonia.html", "text": "Spent some time in this centre whilst staying in a hotel opposite during a work visit.\n\nLovely mix of shops and restaurants, clean and bright", "publishedDate": "2018-06-09", "language": "en", "rating": 5}, {"id": 579777876, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d240755-r579777876-Glories-Barcelona_Catalonia.html", "text": "Carrefour makes it easy to find anything you need. There is some international makeup stores example Nyx and Sephora. Also you find some chainhamburgers here as Mc Donalds and Burger king atleast. Im not sure was there others too.\nShopping mall is clean and nice.\nI think you find everything here.\nAlso souvenirs you can find here and in Carrefour those are cheaper than example in Gothic area or Ramblas.", "publishedDate": "2018-05-12", "language": "en", "rating": 5}, {"id": 573643802, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d240755-r573643802-Glories-Barcelona_Catalonia.html", "text": "Big shops, great restaurants, cinemas, supermarket and a place for children  to e entertained... this place has it all. Highly recommended.", "publishedDate": "2018-04-16", "language": "en", "rating": 4}, {"id": 571196502, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d240755-r571196502-Glories-Barcelona_Catalonia.html", "text": "Stayed near here for a few days .There is a modern shopping centre with a large supermarket Fast food places as well as smart restaurant are close by . very modern feel and less of the bustle of central Barcelona . Can bike it to the beach as well as into the city centre Worth a stay if you want to explore the quiet side of th city Some great buildings too", "publishedDate": "2018-04-05", "language": "en", "rating": 4}, {"id": 570132814, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d240755-r570132814-Glories-Barcelona_Catalonia.html", "text": "This area has massively improved over the last few years, when we first stayed in Glories a few years ago there wasnt much of a shopping area at all but now there are lots of shops and restaurants. Its a good area to stay if you dont want to be right in the middle of Barca but still want to be in easy reach of everything. The metro has great links to everywhere. Would definitely recommend the area", "publishedDate": "2018-04-01", "language": "en", "rating": 5}, {"id": 566123760, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d240755-r566123760-Glories-Barcelona_Catalonia.html", "text": "Lovely buzzing place full of decent shops and food places. We visited here whilst walking back to our hotel one day completely by chance!", "publishedDate": "2018-03-12", "language": "en", "rating": 4}, {"id": 558554400, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d240755-r558554400-Glories-Barcelona_Catalonia.html", "text": "The completely renovated mall is really cool. Great shopping with a new restaurant area called EL MERCAT with a variety of quality foods. \nIn particular I would suggest LA GARRIGA located right in the center of the court which offers artisan food and coffee for s good price. \n\nThe other very good thing about this place is that it is very close to the center and to la Sagrada Familia\n\n", "publishedDate": "2018-02-05", "language": "en", "rating": 5}, {"id": 538026294, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d240755-r538026294-Glories-Barcelona_Catalonia.html", "text": "We have visited this mall, but still there are workers. Every where is writing that new Glories will be opened on 09.11.17. If your hotel is in this area you can visit for shopping.", "publishedDate": "2017-11-03", "language": "en", "rating": 3}, {"id": 527573667, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d240755-r527573667-Glories-Barcelona_Catalonia.html", "text": "My boyfriend and I were staying in a hotel over the road and visited here a couple of times.  They've got a great mixture of high street and high end shops with a variety of places to eat.  We were welcomed into each shop with a hola and left to browse.  We even ended up here on a Friday night and the place was buzzing with all sorts of people. There are still some renovations going on around the place but nothing that prevented us from enjoying our visit on each occasion. There is also a huge supermarket. There are lifts, escalators and toilets, so very friendly for wheelchairs and buggies.", "publishedDate": "2017-09-26", "language": "en", "rating": 4}, {"id": 526834193, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d240755-r526834193-Glories-Barcelona_Catalonia.html", "text": "Enjoyed shopping here. It was easy to find and get to on foot. Construction didn't hinder our shopping experience at all, as some other posts imply. This was the first time visiting the mall and we were happy with it. Wasn't too far from our hotel. Outside Carrefour a little play section for the kids. Most shop assistants were pleasant expect for the girl behind the Giovanni's gelato counter. ", "publishedDate": "2017-09-23", "language": "en", "rating": 4}, {"id": 516843955, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d240755-r516843955-Glories-Barcelona_Catalonia.html", "text": "A huge shopping center but mostly renovations.\nThis is the second year in a row that the renovation of this special place has not stopped, which is a shame.\nRecommend to quickly finish the renovation to give us again to enjoy endless possibilities for fun and pampering that were always here.", "publishedDate": "2017-08-23", "language": "en", "rating": 2}, {"id": 516541272, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d240755-r516541272-Glories-Barcelona_Catalonia.html", "text": "So we were last in Glories 3 yrs ago when they'd just started the road changes. What a difference. The road, although still not finished, you can now see what the plan is. The shopping centre is hugely improved and really, really lovely. The whole feel of Glories is light and airy and it has a sense of calm about it, which is in complete contrast to the freneticness of Barcelona centre. \n\nWe've stayed in the Glories district twice before and having now stayed elsewhere, would certainly choose Glories in preference. \nPlenty of places to eat and drink, feels safe and adequate shopping. Love it", "publishedDate": "2017-08-23", "language": "en", "rating": 5}, {"id": 514725966, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d240755-r514725966-Glories-Barcelona_Catalonia.html", "text": "Found this mall by accident. There is much construction going on, which is a bit annoying. However, the renovated parts look gorgeous and promising.", "publishedDate": "2017-08-18", "language": "en", "rating": 4}, {"id": 508610860, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d240755-r508610860-Glories-Barcelona_Catalonia.html", "text": "Glories is a relatively large shopping mall with shops on ground level as well as underground. The shops are quite spacious and somewhat upscale and covers most item groups. Moreover there are a giant Carrefour and several restaurants/fast food joints.\n\nIf in the neighbourhood and in the mood for a little shopping the do visit - we will!", "publishedDate": "2017-08-03", "language": "en", "rating": 4}, {"id": 504131864, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d240755-r504131864-Glories-Barcelona_Catalonia.html", "text": "Visited the Glories commercial centre. Thought that after 2 years of reforms it might be getting close to being sorted out. Wrong!!! Avoid this terrible shopping centre even Carrefour have moved the disaster zone inside their shop as they do a refit. Final straw went to the gents toilets, two men working on one cubicle. The rest all out of service. Went to another set of toilets. No paper. Went elsewhere.", "publishedDate": "2017-07-21", "language": "en", "rating": 1}, {"id": 488203730, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d240755-r488203730-Glories-Barcelona_Catalonia.html", "text": "A lovely relaxed shoo by centre with a good range of shops, a large CarreFour and lots of choice for restaurants. Only thing I would say is that I wanted around in circles looking for the Zara, not to be found!", "publishedDate": "2017-05-27", "language": "en", "rating": 5}, {"id": 487244805, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d240755-r487244805-Glories-Barcelona_Catalonia.html", "text": "Still building this shopping centre but there are sufficient completed shops to make it worth a visit. Always been a fan of Carrfour and this one's food hall was a delight. Variety after variety of cheese was both a visual and olfactory delight. C&A, H&M and Zara are the big names here but so many other smaller names abound in the underground part of the centre. The visuals are a delight, with Spanish style making this centre a bright and colourful one that pleases the senses. Was very close to our accommodation, Novotel City, across the road, only a short walk away. Numerous food outlets abound, from McDonald's and Burger King to expensive Italian. The red hop on, hop off sightseeing bus stop is also close. Makes a soothing break from the crush of the Rambla.", "publishedDate": "2017-05-24", "language": "en", "rating": 4}, {"id": 478061416, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d240755-r478061416-Glories-Barcelona_Catalonia.html", "text": "This is a wonderful mall. It was much larger than we originally thought since most of the mall is underground. There are places to eat as well as many shopping stores.", "publishedDate": "2017-04-22", "language": "en", "rating": 5}, {"id": 473450840, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d240755-r473450840-Glories-Barcelona_Catalonia.html", "text": "We now live in the third world so our expectations for shopping centers is much different than it was when we lived in America. Overall, we thought the Glories shopping center was very nice. Shops tended to be higher end but we loved the expansive Carrefour Market. Produce, in particular, was beautiful. We also made use of the McDonalds on site as well. ", "publishedDate": "2017-04-07", "language": "en", "rating": 4}, {"id": 416628463, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d240755-r416628463-Glories-Barcelona_Catalonia.html", "text": "The hop on hop off bus trip pointed out Glories as a great shopping centre. We caught a taxi from the city - 10 euros - and then wandered about trying to find the mall. The whole place is being renovated at present so only the big stores - Carrefour, H&M, Zara and the food hall were operational. Another 10 euros in a taxi back into town. ", "publishedDate": "2016-09-09", "language": "en", "rating": 2}, {"id": 402140788, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d240755-r402140788-Glories-Barcelona_Catalonia.html", "text": "We were glad to visit the mall which had many nice brands and a C&A branch. What really made our day was seeing Torre Agbar building on our way to the mall. It is a visit not to be missed. ", "publishedDate": "2016-08-06", "language": "en", "rating": 5}, {"id": 397762212, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d240755-r397762212-Glories-Barcelona_Catalonia.html", "text": "It's a building site, with fewer than a dozen shops teetering on the edge of the pit. There were some restaurants but we didn't stay long enough to need refreshment.", "publishedDate": "2016-07-26", "language": "en", "rating": 1}, {"id": 396468909, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d240755-r396468909-Glories-Barcelona_Catalonia.html", "text": "Heavy renovations shopping center at the height of summer.\nI do not know why it was decided to heavy renovations popular shopping center at the height of summer.\nYou can not move around because of obstructions and noise of the work, large areas of the shopping center blocked completely and not really good atmosphere.\nToo bad the people responsible do not think.", "publishedDate": "2016-07-24", "language": "en", "rating": 2}, {"id": 385940980, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d240755-r385940980-Glories-Barcelona_Catalonia.html", "text": "Glories is a big center with shops and restaurants.\nThe center is everlasting and chaotic.\nPerhaps because of building and renovation.\nIt wasn't interesting for us, and we quitted the place.", "publishedDate": "2016-06-25", "language": "en", "rating": 2}, {"id": 376840316, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d240755-r376840316-Glories-Barcelona_Catalonia.html", "text": "We loved this little shopping area. Has a large 2 level Carrefour (grocery store) with really nice eating areas downstairs. Also has lots of outdoor space with patio seating. Had a Zara, massimo dutti, C&A store and more being built. More manageable than the large shopping centres but has everything you need for gifts and shopping for yourself. Make sure you visit the little shop downstairs - very nice, non tacky \"Barcelona\" gifts. (Aprons, makeup cases etc)", "publishedDate": "2016-05-26", "language": "en", "rating": 4}, {"id": 333663967, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d240755-r333663967-Glories-Barcelona_Catalonia.html", "text": "As a small shopping centre it's fine although half of it was being renovated so there wasn't a market that we could see. Some of the restaurants are really nice, others serve small portions with high prices. The shops are quite good, although most aren't anything special.\n\nOne restaurant I did enjoy the most was Mediterranean Original and for those with a sweet tooth I would highly recommend the Happy Pills stall/shop on the lower floor where you can fill up jars with loads of sweets, they encourage you to fully cram the sweets in.\n\nAt night the floor of the shopping centre gets quite slippery, I guess from the moisture in the air but if you aren't careful you will fall over.", "publishedDate": "2015-12-18", "language": "en", "rating": 3}, {"id": 330506913, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d240755-r330506913-Glories-Barcelona_Catalonia.html", "text": "Excellent location in the evenings, close to Sagrad Familia, lovely restaurants, convenient for Tram,Metro and Hop on Hop off Tour stop, visit the local Markets.", "publishedDate": "2015-12-03", "language": "en", "rating": 4}, {"id": 315518820, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d240755-r315518820-Glories-Barcelona_Catalonia.html", "text": "Our hotel, Teatre Auditori, was located near Glories metro. A visit to Glories puts you near to the Mercat, a huge flea market, Glories shopping centre (with restaurants and a cinema) and The Design Museum, which is an interesting building with interesting exhibits. Worth a rainy day visit!", "publishedDate": "2015-10-02", "language": "en", "rating": 3}, {"id": 311460173, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d240755-r311460173-Glories-Barcelona_Catalonia.html", "text": "The rooms are small with an old smell. The bathroom is clean. The breakfast is poor and the same every day.\nThe staff is realy nice. 5 min to metro. \nA good hotel if you stay a few days.", "publishedDate": "2015-09-17", "language": "en", "rating": 3}, {"id": 306686462, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d240755-r306686462-Glories-Barcelona_Catalonia.html", "text": "This area is only a few stops by metro or tram to the city centre. So fine as a tourist. The central are is half developed, with some running tracks, park areas, but half of it is a building site still.\n\nThe flea market is interesting, lots of second hand stalls for browsing and some cheap market stalls. Interesting to mix with the local population but didn't really buy anything.", "publishedDate": "2015-09-03", "language": "en", "rating": 3}, {"id": 304946352, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d240755-r304946352-Glories-Barcelona_Catalonia.html", "text": "There are plenty of eatery and shopping places here. I god some good discount on lady's handbags. These shopping places are costlier than the ones you get in LA Rambla. However the stuff here is more classy. The same goes with food option.", "publishedDate": "2015-08-30", "language": "en", "rating": 3}, {"id": 302854691, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d240755-r302854691-Glories-Barcelona_Catalonia.html", "text": "Shopping center is being renovated this year and has no access to a large part of it.\nToo bad they chose during the renovations really not appropriate when there is a large movement of visitors to the city.\nHope that next year will work out - at this stage there is nothing to do.", "publishedDate": "2015-08-24", "language": "en", "rating": 3}, {"id": 302423058, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d240755-r302423058-Glories-Barcelona_Catalonia.html", "text": "We stayed at the Silken Diagonal hotel and Glories center was opposite the hotel and we used the place a lot whilst staying in Barcelona. It was very handy as it has bars restaurants, shops, a supermarket and places to sit outside to enjoy the sunshine. The bars and restaurants we ate at while in here were all very nice, great value and all the staff were very friendly and helpful. This place saved us having to go into the the center of Barcelona every night to eat and drink.", "publishedDate": "2015-08-23", "language": "en", "rating": 4}, {"id": 292314991, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d240755-r292314991-Glories-Barcelona_Catalonia.html", "text": "I went with 3 friends on a girls holiday, and this hotel was just exactly what we needed. The staff are so friendly and helpful, the room we stayed in was great (quadruple room), clean and enough space. The location is great, a half hour walk to the beach, which was nice and allowed you to get some exercise in. That's about a 5-10minute drive, and that's also where all the clubs are e.g. Opium, Pacha, which was so handy. Not far to drive to La Rambla, and just a 20-25minute walk in the other direction from Passeig de Gracia with all the shops. So close to La Sagrada Familia.\nThe breakfast was fairly simple but we really enjoyed it. One thing I would say is that it stops too early. Breakfast is from 7-10.30am I believe, which is unideal when you've been on a night-out and rolled in at 4-5am. But it wasn't their fault!\nWe got home in the early hours of the morning on several nights after partying, but whatever time it was we were always greeted with a warm welcome. \nThere was one concierge who was particularly lovely, I can't remember his name but it began with an X I think! \nJust an overall great stay. For the standard we would have expected on a girls holiday, The Glories did us really well!\nThank you to Hotel Glories!!!", "publishedDate": "2015-07-25", "language": "en", "rating": 5}, {"id": 289267474, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d240755-r289267474-Glories-Barcelona_Catalonia.html", "text": "Aside from the mall with its numerous shops, the mall has many options for dining. They have a wide open air area un front with a lot of restaurants. It also has a place below the ground level called El Mercat which houses several restaurants. ", "publishedDate": "2015-07-15", "language": "en", "rating": 3}, {"id": 284256427, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d240755-r284256427-Glories-Barcelona_Catalonia.html", "text": "Nothing special. Disney store was nice (not like in Nyc or Rome) for kids but it was expensive like everywhere else. You'll find what you are looking for.", "publishedDate": "2015-06-30", "language": "en", "rating": 3}, {"id": 280659397, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d240755-r280659397-Glories-Barcelona_Catalonia.html", "text": "One of the most interesting places in Barcelona. .\nMost of the shopping area is open to the air..\nSeveral different shops that have different items..\nRestaurants and cafes are spreading every where and give you a nice experience for dinning in outside atmosphere. .\n\nA place where you should go in Barcelona. . With direct buses and metro accesses..\n\nMany shopping areas and malls are near by as well", "publishedDate": "2015-06-16", "language": "en", "rating": 4}, {"id": 279307563, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d240755-r279307563-Glories-Barcelona_Catalonia.html", "text": "Shopping Mall nothing special, and the car park is horrible as we had our rental vehicle broken into and everything was stolen.\nSecondly the security do not even care. Coincidentally another German couple suffered the same fate as us, and the police do not even bother as they never turn up.\nAVOID THIS SHOPPING MALL AT ALL COSTS.", "publishedDate": "2015-06-10", "language": "en", "rating": 1}, {"id": 278000182, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d240755-r278000182-Glories-Barcelona_Catalonia.html", "text": "This place has 3 things of interest.\n\nFor those who enjoy flea market shopping, this is as good as it gets in Barcelona.  The variety is quite astounding from knick knacks to small appliances to bikes, shoes, shirts and all sorts of memorabilia from the war and various places.  If you like religious pieces, there's plenty to choose from.  I even came across a Murano glass piece that was dangled for just 10 euros.  \n\nThen the Torre Agbar.  It's just an office building but unique in its structure and facade.  It's actually visible as your plane descends into Barcelona.  I took a random shot from the plane window and when I was reviewing it, there it was.  The only discernable structure from the sky.\n\nFinally there's a mall just after this building.  There's nothing extra special here.  Just your usual Zara and other local brands.  But it can be a place unwind after jostling with the crowd in the nearby flea market.  There's a McDonald's with its alfresco dining and there are more fancy restos as well.\n\nVery easy to get here.  Find the Glories Metro.", "publishedDate": "2015-06-04", "language": "en", "rating": 3}, {"id": 273043581, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d240755-r273043581-Glories-Barcelona_Catalonia.html", "text": "You can do much, much better to stay in the city for your shopping. This center still does not have many shops and - given the huge variety in the center - is more for locals of the area.", "publishedDate": "2015-05-19", "language": "en", "rating": 3}, {"id": 269702073, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d240755-r269702073-Glories-Barcelona_Catalonia.html", "text": "Must be the largest shopping mall in Barcelona. You don't think it is that big until you set foot in it, we caught the tram to get there, lots and lots of clothes shops, toilet facilities, seating benches all over to sit when tired and watch the world go by. Oodles of restaurants and Café's.", "publishedDate": "2015-05-03", "language": "en", "rating": 4}, {"id": 241303991, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d240755-r241303991-Glories-Barcelona_Catalonia.html", "text": "We originally went here because we wanted to go to a Starbucks in Spain.(Great Coffee)  and it was near our hotel. Once there you realize the sheer size of the shopping area. You could easily spend 2 -3 hours walking around the shops. Some shops are covered within the shopping center and others are situated outside in the sun. \nThere are lots of benches and places to sit & rest for a while. Lots of restaurants & cafés also. As for clothes shops there is an absolute abundance of them. Must not forget the toilet facilities - quite a few!\nIt was a Sunday and there were lots of families here.\n\n ", "publishedDate": "2014-11-24", "language": "en", "rating": 4}, {"id": 233920709, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d240755-r233920709-Glories-Barcelona_Catalonia.html", "text": "It includes not so much shops, but covers Burger King, Mc Donalds and Carrefour inside, so was quite enough for us", "publishedDate": "2014-10-12", "language": "en", "rating": 4}, {"id": 232427362, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d240755-r232427362-Glories-Barcelona_Catalonia.html", "text": "Visited Glories for the first time in July 2014 with my husband.  We were on a specific mission to find the most dangerous frog in the world, ie Constantine, & were hoping the Disney Store at Glories would stock him - unfortunately not!\n\nOnce there I was taken aback by the sheer size of the shopping area.  You could easily spend 2 -3 hours walking around the shops.  Some shops are covered within the shopping centre and others are situated outside in the sun.  We couldn't resist nipping into Starbucks for a cool drink & getting out of the sun for a ½  hour.\n\nThere are lots of benches around to sit & rest for a while.  Lots of restaurants & cafés also.  As for clothes shops there is an absolute abundance of them.  Must not forget the toilet facilities - quite a few spread around the vacinity.\n\nInside one of the malls is a supermarket so you really do have everything you need under one roof.  If you ever get a rainy day in Barcelona or simply want to avoid the heat you have got to check this shopping centre out.", "publishedDate": "2014-10-03", "language": "en", "rating": 4}, {"id": 220295270, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d240755-r220295270-Glories-Barcelona_Catalonia.html", "text": "Unless you are staying at one of the hotels nearby, I wouldn't recommend this a mall that is worth visiting. Looks more like a neighborhood mall to service the needs of the community working/living nearby. in any case, they do have your usual Burger King, Macs, Carrefour, etc.", "publishedDate": "2014-08-07", "language": "en", "rating": 3}, {"id": 216921632, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d240755-r216921632-Glories-Barcelona_Catalonia.html", "text": "This is nice place to shop,eat and walk around,they have H&M,Claire's, Massimo Dutti,Zara etc,if you get tired of the turistic places this is more like a local shopping place to stop by for a coffee,wine or tapas.\n I like the layout of this place,it has different levels and stores inside and stores outside,very nice shops.", "publishedDate": "2014-07-22", "language": "en", "rating": 5}, {"id": 216102264, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d240755-r216102264-Glories-Barcelona_Catalonia.html", "text": "\"Nice building\" sums it up really. Nothing out of the ordinary to repeat the experience. Flea market nearby much better.", "publishedDate": "2014-07-18", "language": "en", "rating": 3}, {"id": 204116180, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d240755-r204116180-Glories-Barcelona_Catalonia.html", "text": "Tired of site seeing and city tour and just want to relax and have a coffee and some shopping then come to glories. Very elegant center with lots of brand shops and restaurants ", "publishedDate": "2014-05-05", "language": "en", "rating": 4}, {"id": 203608960, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d240755-r203608960-Glories-Barcelona_Catalonia.html", "text": "Our hotel was located just opposite the shopping mall Glories. The selection of shops is not overwhelming. There is a food court in the lower level, where you can sit and watch children playing in the playground nearby. Quality of shops is mediocre and nothing you will not find anywhere else. For us it was convenient, but it is not worth specifically get there for shopping", "publishedDate": "2014-05-01", "language": "en", "rating": 3}, {"id": 203197370, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d240755-r203197370-Glories-Barcelona_Catalonia.html", "text": "We went to glories today And were disappointed with e quality and range of goods available there. There was a Zara, HM Etc but the goods of most shops were targeted for very young or matronly visitors. Better to go to city centre or other areas. Good for fast food though.", "publishedDate": "2014-04-28", "language": "en", "rating": 3}, {"id": 202817655, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d240755-r202817655-Glories-Barcelona_Catalonia.html", "text": "Good selection of shops and restaurants and easily close to the nearby Glories metro station.  Nice way to spend a few hours shopping.", "publishedDate": "2014-04-26", "language": "en", "rating": 4}, {"id": 197154425, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d240755-r197154425-Glories-Barcelona_Catalonia.html", "text": "Great mix of brands & shops catering to every shopper. One stop shopping destination which is well connected by metro.", "publishedDate": "2014-03-12", "language": "en", "rating": 4}, {"id": 182119382, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d240755-r182119382-Glories-Barcelona_Catalonia.html", "text": "Lovely shopping mall, close to our hotel.\nGood choice of shops including a big supermarket, Carrefours.\nFood court had a good mixed choice from usual McDonalds to good restaurants catering for different needs, all outdoors.\nPleasant relaxed surroundings, and that's from someone who hates shopping!", "publishedDate": "2013-10-23", "language": "en", "rating": 5}, {"id": 153839135, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d240755-r153839135-Glories-Barcelona_Catalonia.html", "text": "A lovely walk just outside of the hotel to nearby shops and malls, local transport is quick and very convenient.", "publishedDate": "2013-03-06", "language": "en", "rating": 5}, {"id": 151183971, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d240755-r151183971-Glories-Barcelona_Catalonia.html", "text": "Glories was close to my Hostel and had a massive supermarket (Carrefour) which was very much needed for my stay. as a shopping centre it does what it says on the tin. decent eating places if a little unimaginative. if your staying in the nearby Hostel then well worth a visit. if not. then don't bother.", "publishedDate": "2013-02-01", "language": "en", "rating": 3}, {"id": 149167052, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d240755-r149167052-Glories-Barcelona_Catalonia.html", "text": "This is a small shopping centre  with the usual High Street stores such as H&M, it has a large supermarket - Carrefour, some differrent little shops, one selling loose sweets and a fantastic olive selection. There are some really nice eating, snack style places and decent cocktail areas. the courtyard downstairs is a lovely place to sit and have a drink and all were well prices, it is well worth a visit. Metro station, trams and buses just a few minutes walk away, we stayed at the Novotel which is just acrross the road", "publishedDate": "2013-01-08", "language": "en", "rating": 4}, {"id": 149079213, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d240755-r149079213-Glories-Barcelona_Catalonia.html", "text": "this shopping centre was just outside our hotel, so we decided a quick visit before we hit Barcelona. Nothing too fancy about it the place, but useful shops. Ended up having breakfast everyday at one of the food outlets instead of the extortionate priced breakfast in our hotel.", "publishedDate": "2013-01-07", "language": "en", "rating": 4}, {"id": 147319539, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d240755-r147319539-Glories-Barcelona_Catalonia.html", "text": "If you fancy doing some shopping away from the crowds and bustle then Glories is the place. The shops are a good mix of high end fashion brands and high street stores, plenty of choice and range in the food and drink too. The shopping mall and coutyard are vibrant, spacious an immaculately kept. Well worth a visit.", "publishedDate": "2012-12-12", "language": "en", "rating": 4}, {"id": 136311715, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d240755-r136311715-Glories-Barcelona_Catalonia.html", "text": "It's a nice break from all the turists, but the malls of Barcelona are just boring, and this one is no exception.. The food part is good and Zara is always worth a visit. \nIf you go, you should take the tram, because it's a nice way to get around and see the city at the same time..", "publishedDate": "2012-08-05", "language": "en", "rating": 3}, {"id": 130564063, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d240755-r130564063-Glories-Barcelona_Catalonia.html", "text": "We walked here from our hotel ''GLORIES''.This mall is just across the street from a very high looking like a rocket building that can be seen from every part of Barcelona with some offices   on the street level, and new trams running along the length of the avenue.\nWe liked the mall and the way the shops were organized on separate levels connected by escalators.,nice with many options for a good lunch.\nWe got on the tram T-5 only to see where it will take us and we went to the end of the line which brought us to the entrance of the ZOO . \nTIP ; Visit the largest flea market in the PLACA DE GLORIES circle called \"mercat des encants.", "publishedDate": "2012-05-25", "language": "en", "rating": 4}, {"id": 120235459, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d240755-r120235459-Glories-Barcelona_Catalonia.html", "text": "My partner and I were staying in the Silkin Hotel Diagonal over the road and came here everyday for meals and shopping.  Stocked with only a few stores, it has the usual good quality European ones that you would want and expect in a mall 3x its size.  Zara, H&M, Massimo Dutti, Subway, Starbucks etc. It does close up about 11.30pm so if you are looking for somewhere there for dinner, you're best bet is the fried chicken place! (great wings and they serve beer!)", "publishedDate": "2011-11-06", "language": "en", "rating": 4}, {"id": 1134814, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d240755-r1134814-Glories-Barcelona_Catalonia.html", "text": "As an american living in Barcelona last year, Glories mall was where we went to get just about anything we needed. It is not touristy, but has a lot of great stores, and in the summer they have the sales. There is also a carrefour there (which is their equivalent to Wal-mart, but better). The metro stops right there, so you don't even need to drive to get to this mall!", "publishedDate": "2003-07-10", "language": "en", "rating": 4}]}}]