[{"locationId": 7106610, "name": "Tivoli Theatre", "placeType": "ATTRACTION", "reviewListPage": {"reviews": [{"id": 744554579, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d7106610-r744554579-Tivoli_Theatre-Barcelona_Catalonia.html", "text": "need to improve the ambience and hygiene , the seats are pathatic and AC in not worth to comment\n\ncan increase ticket price and keep clean conditions", "publishedDate": "2020-02-12", "language": "en", "rating": 3}, {"id": 734832535, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d7106610-r734832535-Tivoli_Theatre-Barcelona_Catalonia.html", "text": "Boxing Day outing. 4 tickets for price of 3.\n\nNice auditorium. Adapted ramp for wheelchair access from street. Comfortable seats with legroom and good sight lines.\n\nShow well produced, acted and sung. Mike and sound levels need attention.\n\nGreat evening out.", "publishedDate": "2019-12-26", "language": "en", "rating": 5}, {"id": 673675489, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d7106610-r673675489-Tivoli_Theatre-Barcelona_Catalonia.html", "text": "Came here as my girlfriend would like to go, I didn't like it so much, but she quite enjoyed. If you're like me, don't waste of your time to come here.", "publishedDate": "2019-05-13", "language": "en", "rating": 5}, {"id": 588813295, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d7106610-r588813295-Tivoli_Theatre-Barcelona_Catalonia.html", "text": "This \"show\" unfortunately has nothing incomone with the ART. I have seen a lot of different Broadway shows in NYC. And Off Broadway. Even Off-off Broadway! Here in Barcelona they give us a bad \"drag Queen\" show  with absolutely no personality of artists...... \nIf you love Michael Jackson, his music, his talent, please don't waste your time and money.\nThe theatre was full with stupid tourists who were jumping up and applouding, but there is NO ART. And NO MICHAEL JACKSON.", "publishedDate": "2018-06-19", "language": "en", "rating": 1}, {"id": 471317484, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d7106610-r471317484-Tivoli_Theatre-Barcelona_Catalonia.html", "text": "I go here with my couple for look the Camina Burana Opera by La Fura Dels Baus. symplement AMAZING !!!", "publishedDate": "2017-03-30", "language": "en", "rating": 4}, {"id": 443698665, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d7106610-r443698665-Tivoli_Theatre-Barcelona_Catalonia.html", "text": "The show of Priscilla counted on a very good musical assembly. Almost three hours of performance that passed quickly. Great music, performers, awesome costumes and montage that can compete with no doubt with either London or New York, Highly recommended if you want to spend some fun with friends, couple or family, very spacious and maintained theater, comfortable stage armchairs", "publishedDate": "2016-12-12", "language": "en", "rating": 5}, {"id": 438279619, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d7106610-r438279619-Tivoli_Theatre-Barcelona_Catalonia.html", "text": "I went to see the musical Priscilla, was a great show with good sound system and light show. Only we took the afternoon show and was full of retired people who were not really on the groove. For a more authentic experience I recommend the evening show. But highly recommend the musical ", "publishedDate": "2016-11-18", "language": "en", "rating": 4}, {"id": 427597928, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d7106610-r427597928-Tivoli_Theatre-Barcelona_Catalonia.html", "text": "Its a very eclectic theatre with lots of gold and red velvet. It looks like a neoclassic theatre where you would normally go to listen opera music, however, nowadays you can even assist to soft concerts. It is worth a visit!\n\nCheck my pictures from Manel music group last 10th of October!", "publishedDate": "2016-10-13", "language": "en", "rating": 4}, {"id": 419867136, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d7106610-r419867136-Tivoli_Theatre-Barcelona_Catalonia.html", "text": "Tivoli is very well located in Barcelona city center. Seats are comfortable and spacious enough. Athough seat rows are positioned quite flat you can still get proper views pretty much from anywhere, including first floor and side seats, unless you are unlucky to get someone taller than you in the row in front of yours.\n\nThis time we were attending \"La gran ilusion\" by the magician Mago Pop. For such type of shows, where you want to see what the magician is doing with his hands (other type of shows might apply too), I strongly suggest not to seat beyond row 15. We were sitting at row 19 and, although nothing was blocking our vision, we missed details of the show because we were clearly too far. If, on top, you consider that my seats (and the ones behind) cost the same as the ones in the front (a bit above 30€ per seat, no matter if you are children or grown up), then I must admit I left a bit disappointed.\n\nThe show is pretty good, although pretty short though (less than 1h). \n\nConsidering what we paid and the seats we got, I can not provide more than 3 stars. I was thinking of 2 stars actually, but my kids were so amused with the tricks that I allow one more star.", "publishedDate": "2016-09-18", "language": "en", "rating": 3}, {"id": 300549025, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d7106610-r300549025-Tivoli_Theatre-Barcelona_Catalonia.html", "text": "Teatro Tivoli offers outstanding price/value and attracts some great shows. \nThe seats are rather comfy, sound pretty good, friendly and helpful staff and well located. \nDon'y hesitate for a moment - go for it. ", "publishedDate": "2015-08-18", "language": "en", "rating": 4}, {"id": 264391843, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d7106610-r264391843-Tivoli_Theatre-Barcelona_Catalonia.html", "text": "The theater gave a free tour one Saturday from 10 to noon. Even though it was free I never imagined a line around the block. Apparently with the mass email, a write up in the paper and a Facebook notice, half of the western 'burbs came out. They have done tours before and never had quite the turn out.\n\nUnfortunately we never got the full tour because of the crowd. While waiting in line for almost two hours in the sun the staff brought out water and kept us up to date of the situation. When we got near the door they realized that we were not going to get in even after they extended the number of tours.", "publishedDate": "2015-04-08", "language": "en", "rating": 5}]}}]