[{"locationId": 244904, "name": "Teatre Principal", "placeType": "ATTRACTION", "reviewListPage": {"reviews": [{"id": 630003833, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d244904-r630003833-Teatre_Principal-Barcelona_Catalonia.html", "text": "As my twin brother Stephen and I were staying in a hotel in Plaça Reial this beautiful theatre along Las Ramblas was only a short walk away, it was a theatre we passed every day as we were exploring the area around our hotel.\nWe actually never visited this theatre which is one of the oldest theatre's in the L'Eixample District of Barcelona ,it looks absolutely fantastic, the facade is very eye catching and blends in seamlessly with the architecture along Las Ramblas, it really is an elegant looking theatre and building and makes for some great photographic opportunities. \nTeatre Principal is easy to locate on Las Ramblas in an area teeming with pubs, bars and restaurants and some amazing architecture and a major tourist destination. \nWell worth checking out. ", "publishedDate": "2018-11-01", "language": "en", "rating": 5}, {"id": 447160241, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d244904-r447160241-Teatre_Principal-Barcelona_Catalonia.html", "text": "The Teatre Principal is the oldest theatre in Barcelona where you'll see Flamenco performance.\nIt's along La Rambla. Outside the theatre is crowded with tourists.", "publishedDate": "2016-12-28", "language": "en", "rating": 4}, {"id": 430706048, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d244904-r430706048-Teatre_Principal-Barcelona_Catalonia.html", "text": "We paid 25€ which was one row behind the 50€ seats. 50€ not worth it at all. A small intimate space and the show can be seen well from ALL seats. If you want to choose your seat turn up 30 minutes early. Tickets available in advance. We all enjoyed this evening so much. The dancing & singing was fantastic. The guy on the electric guitar was brilliant. Even my grumpy old man was cheering and clapping 😃😂 It was just the right amount of time too. A bar was open & Sangtia was enjoyed 🍹", "publishedDate": "2016-10-22", "language": "en", "rating": 5}, {"id": 383998697, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d244904-r383998697-Teatre_Principal-Barcelona_Catalonia.html", "text": "Walking along the Ramblas when we heard Spanish guitar music. Asked if we could come in but only wanted to have a drink and we were more than welcome. The Spanish guitarist and singer were excellent and the service was second to none. Although we didn't eat the food looked fantastic. An impromptu evening that was brilliant.", "publishedDate": "2016-06-19", "language": "en", "rating": 5}, {"id": 370518822, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d244904-r370518822-Teatre_Principal-Barcelona_Catalonia.html", "text": "Well we know Flamenco isn't a Catalonian pass time but we couldn't resist the chance of seeing some whilst in Barcelona.  It was a last minute decision and thought that even if it's not top rate we will get a flavour of it.  And for €15 for balcony seats what could we lose.  What a great night we had.  The theatre is a little gem.  It has the feel of a real community run venture.  Nothing posh but lots and lots of atmosphere. A mixed audience came in for the 8 o' clock performance including families which was fab.  The dancers and musicians were great. A quick tip - if you go for the cheap balcony tickets there is no reserved seats and the best spot is at the head of the balcony on bar stools.  So do go earlyish if you want one of these \nA great night out.  Highly recommended ", "publishedDate": "2016-05-05", "language": "en", "rating": 4}, {"id": 264391394, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d244904-r264391394-Teatre_Principal-Barcelona_Catalonia.html", "text": "I love this theatre! Classic and classy. Way to go on preserving the history of this theatre. Great atmosphere and entertainment before the show on fridays and saturdays with the organist. The staff are super friendly and the admission is great. I even seen they used this theatre in a Geico commercial.Best popcorn ever. Sometimes I just come for the popcorn, free refills too. Theature is great too. Comfy and lots out room. Just saw a film here and was blown away.", "publishedDate": "2015-04-08", "language": "en", "rating": 4}, {"id": 199988104, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d244904-r199988104-Teatre_Principal-Barcelona_Catalonia.html", "text": "I saw the performance of Surprised! in Teatre Pricipal. We purchased cheap tickets the evening of the performance for 10 euro with included a drink. Although the selection is not great, the drink was descent. The performance is engaging, except for the \"plant\" part, where they seemingly randomly select a person from an audience that can fill in a part of an absent performer, which very quickly became obvious that he was not really a part of the audience. Otherwise, we had descent seats with a view.  Not sure if I would have the same opinion if I paid full price for the show, but considering the discounted tickets it was a nice way to spend the late evening.", "publishedDate": "2014-04-05", "language": "en", "rating": 3}, {"id": 194883274, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d244904-r194883274-Teatre_Principal-Barcelona_Catalonia.html", "text": "The interior and exterior is very nice and the place had a great atmosphere. The show we saw was called Surprise and we caught it on a day where it was cheaper. The regular price for the dinner and show was 90 per person but we got it for 50. The dinner is a full course meal including a starter, main course, and desert. But drinks were separate. The drinks, by the way, were very good and strong but a little pricy. The waiters were good not the best but good. The food was very good and the show was great especially the acrobatic pair performing some impressive feats. Over all it was a very enjoyable experience. The price seems reasonable since it is a dinner and show. The service overall was good with the hostess and ticket personnel being helpful and telling us specifically that the night we went was at a discount.", "publishedDate": "2014-02-21", "language": "en", "rating": 4}, {"id": 190687700, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d244904-r190687700-Teatre_Principal-Barcelona_Catalonia.html", "text": "It has not available basic drinks as orange juice...Very few brands of drinks to choose. They havent local drinks. Waiters only speak spanish (The waiters dont undestand catalan neither english...)\nYou pay 15 euros  for a drink without choose, table service only serve bootles and take it out before are empty.", "publishedDate": "2014-01-13", "language": "en", "rating": 1}, {"id": 190615110, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d244904-r190615110-Teatre_Principal-Barcelona_Catalonia.html", "text": "We paid 50€ in advance for new year's eve and had to wait in a badly managed queue for over 2 hours (!) outside. Nobody was able to tell us what was going on and the rude staff created a lot of tension between people trying to get in and the guys at the door. Finally inside, and after queuing again for the cloakroom, we were told there was no more space to leave our coats! 2manyDJs (what we managed to see of them) were great, the place looked nice and the sound-system is good. However, the aggressiveness of the staff was worrying. When we, along with plenty of other people, asked for customer complaint forms they didn't want to give them to us which is against the law. I seriously hope they change the managing company because the interior is great and it could be a nice place to go out, if we weren't treated like animals.", "publishedDate": "2014-01-12", "language": "en", "rating": 1}, {"id": 187667464, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d244904-r187667464-Teatre_Principal-Barcelona_Catalonia.html", "text": "though the place itself is nice the stuff is really horrible.\n\ni was there with around 150 to 200 colleagues for the christmas party of my company.\n\nafter haven critisised the head of the security guys for having threatened a girl  quite brutal, he told us due to \"missing respect towards him\" we cannot enter again. telling him that it was an official event of my company did not help.\n\nwhen i finally was allowed to enter in order to get my bag and my jacket the girls at the counter could not find it though i had my coupon. they told me i have to wait untill the end now. due to the security guy that meant waiting outside without a jacket ! me and three other colleagues experienced this threatment.\n\nworst evening ever thanks to the stuff of this place (specially head of security, this guy is unbelievable!)", "publishedDate": "2013-12-14", "language": "en", "rating": 1}]}}]