[{"locationId": 2295948, "name": "Antic Teatre - Espai de Creació", "placeType": "ATTRACTION", "reviewListPage": {"reviews": [{"id": 744520776, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d2295948-r744520776-Antic_Teatre_Espai_de_Creacio-Barcelona_Catalonia.html", "text": "It is a relatively cheap pub with really good vibe in the gothic quarter. I can recommend it any time. I drank a caipirinha and it was mad as every caipirinha should be made.", "publishedDate": "2020-02-11", "language": "en", "rating": 4}, {"id": 698407725, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d2295948-r698407725-Antic_Teatre_Espai_de_Creacio-Barcelona_Catalonia.html", "text": "We sought out this bar that was quite near our hotel. I had read the reviews and was looking forward to sitting outside and having a drink. The place is ok, it was very busy, drinks fine - if you are looking for a green oasis in the city this isn't it - a bit shabby.", "publishedDate": "2019-08-13", "language": "en", "rating": 3}, {"id": 662294953, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d2295948-r662294953-Antic_Teatre_Espai_de_Creacio-Barcelona_Catalonia.html", "text": "Escape the hustle and bustle of the tourist spots such as Las Ramblas. A nice relaxed garden in the middle of Barcelona with the lemon tree and self service bar. Prices are reasonable as well as limited snacks such as nachos. Seek this place out for a different ambience. ", "publishedDate": "2019-03-30", "language": "en", "rating": 4}, {"id": 656526379, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d2295948-r656526379-Antic_Teatre_Espai_de_Creacio-Barcelona_Catalonia.html", "text": "Place to hang out and have beers.  It is a nice square with trees and great ambiance.  The crowd was young the night we went but still a perfect spot to grab a drink and chat with friends.", "publishedDate": "2019-03-05", "language": "en", "rating": 4}, {"id": 653262181, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d2295948-r653262181-Antic_Teatre_Espai_de_Creacio-Barcelona_Catalonia.html", "text": "Had a couple of beers here in a really cool, relaxed atmosphere that was difficult to find but definitely worth it.  Can imagine it being even nicer when the weather was warmer, but the breeze was shielded from the courtyard and the guy working was really friendly too.  Bar is classed as 'self service' but just means there is no table service.", "publishedDate": "2019-02-18", "language": "en", "rating": 4}, {"id": 609841291, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d2295948-r609841291-Antic_Teatre_Espai_de_Creacio-Barcelona_Catalonia.html", "text": "Recommended to me by a friend, who is local to Barcelona, Antic Teatre is well worth a visit! Grab a drink from the self-service bar and then take a load off under the shade of the fig tree...", "publishedDate": "2018-08-24", "language": "en", "rating": 5}, {"id": 602582807, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d2295948-r602582807-Antic_Teatre_Espai_de_Creacio-Barcelona_Catalonia.html", "text": "Described in many tourist catalogues as a hidden gem of the city of Barcelona this bar is hidden in the atmospheric Gothic district of the city.\n\nIts visitors are mostly young uni students and during the summer time it is swarmed by tourists who prefer to explore rather than following the beaten path.\n\nIt is self service and in a busy day the queue can be quite big. Get your drinks (I suggest you try their Bloody Mary, yum!) and enjoy the open space back yard under the thick shade of a fig tree.", "publishedDate": "2018-08-04", "language": "en", "rating": 5}, {"id": 496281942, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d2295948-r496281942-Antic_Teatre_Espai_de_Creacio-Barcelona_Catalonia.html", "text": "Great for a morning coffee or afternoon beer. You feel away from the city in this bohemian hidden garden.", "publishedDate": "2017-06-26", "language": "en", "rating": 5}, {"id": 494439254, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d2295948-r494439254-Antic_Teatre_Espai_de_Creacio-Barcelona_Catalonia.html", "text": "This is a great and unique open space to have food or drinks with friends. It is quite hidden and hard to find, so it has a very local atmosphere. It is outdoor, but it has lots of shade, so it's perfect for those hot summer days. They also have shows, which are also worth seeing.", "publishedDate": "2017-06-19", "language": "en", "rating": 4}, {"id": 486600897, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d2295948-r486600897-Antic_Teatre_Espai_de_Creacio-Barcelona_Catalonia.html", "text": "We accidentally stumbled on this hidden gem while exploring the streets of Barcelona. Not easy to find but well worth the effort. We arrived after dark an acceded some stairs from the street to find a atmospherically lit area of  tables and chairs spread over two levels where relaxation was definitely the order of the day.  The open area sits nest to an indoor bar and a theater. Reasonably priced , Atmospheric and relaxing. So good we bought a T-shirt", "publishedDate": "2017-05-22", "language": "en", "rating": 5}, {"id": 476323257, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d2295948-r476323257-Antic_Teatre_Espai_de_Creacio-Barcelona_Catalonia.html", "text": "Set back from an alley right in the core of the city you can hear nothing but the travel bug. Would love to see one of the events the have lined up but was nice enough on a regular night as well. If you are in the area stop by for a drink. ", "publishedDate": "2017-04-17", "language": "en", "rating": 5}, {"id": 471571512, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d2295948-r471571512-Antic_Teatre_Espai_de_Creacio-Barcelona_Catalonia.html", "text": "Really enjoyed stopping by this spot... It was a suggestion by the owner of a cafe we have gone to all week on vacation.  It seemed to be almost exclusively locals.  All seats in the outdoor area surround a big tree. :) ", "publishedDate": "2017-03-31", "language": "en", "rating": 5}, {"id": 469360466, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d2295948-r469360466-Antic_Teatre_Espai_de_Creacio-Barcelona_Catalonia.html", "text": "Pleasant outside experience with bird feeders cut open and turned into lights. Perfect spot to grab a beer with a friend during the day. Lots of outdoor seating. Mojitos looked great ", "publishedDate": "2017-03-22", "language": "en", "rating": 5}, {"id": 468228192, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d2295948-r468228192-Antic_Teatre_Espai_de_Creacio-Barcelona_Catalonia.html", "text": "If you can't find it, search some more! It is worth it...perfect for sharing a bottle of wine and talking about anything and everything ☺️", "publishedDate": "2017-03-18", "language": "en", "rating": 5}, {"id": 460303869, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d2295948-r460303869-Antic_Teatre_Espai_de_Creacio-Barcelona_Catalonia.html", "text": "I found in the middle of Barcelona such a wonderful place. It's not just a bar next to a theatre... It's an experience in the earth of Barcelona. Beautiful people all around me but the atmosphere that I breathed was incredible. Maybe they can improve the bar part but for the rest everything is incredible.", "publishedDate": "2017-02-16", "language": "en", "rating": 4}, {"id": 457756576, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d2295948-r457756576-Antic_Teatre_Espai_de_Creacio-Barcelona_Catalonia.html", "text": "This place was cool, nice outdoor spot. We had a few drinks and enjoyed the transition of day to night. Place is beautiful at night.", "publishedDate": "2017-02-06", "language": "en", "rating": 4}, {"id": 443850847, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d2295948-r443850847-Antic_Teatre_Espai_de_Creacio-Barcelona_Catalonia.html", "text": "If you want to find a good place to have a few beers on a fine warm evening come to this place if you can find it, it's worth it. The outdoor courtyard is dominated by a tree decorated with lights and full of locals. Be warned though, the outdoor part closes at 1130 prompt and they don't hang around ushering you indoors. And the mojito is, er, not a mojito, least not one I've ever drunk before.", "publishedDate": "2016-12-12", "language": "en", "rating": 4}, {"id": 435147465, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d2295948-r435147465-Antic_Teatre_Espai_de_Creacio-Barcelona_Catalonia.html", "text": "We love coming here as we can take our dog as well. Sometimes you need to be quick when you walk to the bar cause there is a play going on, which is super cool. Outside is big but still super busy so make sure to grab a seat outside. ", "publishedDate": "2016-11-06", "language": "en", "rating": 5}, {"id": 421089981, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d2295948-r421089981-Antic_Teatre_Espai_de_Creacio-Barcelona_Catalonia.html", "text": "It is not easy to find but it is very central in El Born. It is in a backyard, trees protect you from the sun, you can sit on two floors. There are no waiters, you get your drinks at a bar and look for a place to sit. You will find all ages, price ok (coffee, beer, snacks...), great for sitting and talking but not for a late night drink because they have to close early.", "publishedDate": "2016-09-22", "language": "en", "rating": 4}, {"id": 413589038, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d2295948-r413589038-Antic_Teatre_Espai_de_Creacio-Barcelona_Catalonia.html", "text": "Antic teatre is an alternative café with great atmosphere. You can site outside on a terrace and drink amazing coffee or delicious beer. We really loved this place, it´s the best café/restaurant in Barcelona.", "publishedDate": "2016-09-01", "language": "en", "rating": 5}, {"id": 411942844, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d2295948-r411942844-Antic_Teatre_Espai_de_Creacio-Barcelona_Catalonia.html", "text": "We went for mojitos and they were really good (reasonable price). The garden is cosy, super cute for summer night drinks. Recommendable!", "publishedDate": "2016-08-28", "language": "en", "rating": 4}, {"id": 410991999, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d2295948-r410991999-Antic_Teatre_Espai_de_Creacio-Barcelona_Catalonia.html", "text": "A lovely patio in the midst of beautiful Barcelona to meet some friends and have a drink under the leaves of a poetic fig tree. They serve San Miguel Beers, wine and also some of those fancy mixes like Mojitos and Tinto Verrano. Very characteristic are the packages of crisps everyone buys there to eat at the tables, which is a bit disturbing for the real foodie. They also serve some warm foods (nachos with cheese and some panini i think) but generally its not a place to eat. \nUsually crowded by locals or at least Spanish people with only two, three touristic faces between them. Even though it is very full in the evenings, the closing times are placed quite early, around 00.00 and afterwards everyone is asked to leave (also on weekends). \nGo there if you are tired of tourists and want to have a drink in a friendly place.\nThe staff speaks English.", "publishedDate": "2016-08-26", "language": "en", "rating": 4}, {"id": 405884851, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d2295948-r405884851-Antic_Teatre_Espai_de_Creacio-Barcelona_Catalonia.html", "text": "Nice cosy place to have a cocktail/beer! The talented bartenders will make you a tasty drink which you can enjoy in the lush secluded, but still lively garden. Quite cheep considering the high standard cocktails!", "publishedDate": "2016-08-15", "language": "en", "rating": 4}, {"id": 371863003, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d2295948-r371863003-Antic_Teatre_Espai_de_Creacio-Barcelona_Catalonia.html", "text": "We stopped here for a drink- felt like an unexplored oasis! Very cool location for having a drink after the beach! ", "publishedDate": "2016-05-10", "language": "en", "rating": 4}, {"id": 367875063, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d2295948-r367875063-Antic_Teatre_Espai_de_Creacio-Barcelona_Catalonia.html", "text": "Little patio between Barrio Gotico streets, unique atmosphere in the evening sitting under tree benches. Good cocktails. Enjoyed!", "publishedDate": "2016-04-26", "language": "en", "rating": 5}, {"id": 364624112, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d2295948-r364624112-Antic_Teatre_Espai_de_Creacio-Barcelona_Catalonia.html", "text": "beautiful internal courtyard, friendly staff, interesting selection of underground theater scene, excellent mojitos and caipirinhas", "publishedDate": "2016-04-16", "language": "en", "rating": 5}, {"id": 349960004, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d2295948-r349960004-Antic_Teatre_Espai_de_Creacio-Barcelona_Catalonia.html", "text": "Surprising garden hidden behind the gate. Went here to see a jugling performance (that I enjoyed a lot, fun little venue), but didn't expect to find this fairytale courtyard with little lanters in the figtree. Nice surprise!", "publishedDate": "2016-02-22", "language": "en", "rating": 5}, {"id": 338797440, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d2295948-r338797440-Antic_Teatre_Espai_de_Creacio-Barcelona_Catalonia.html", "text": "Great terrace hidden in a little street close to the Palau De La Música. Good prices in drinks on a cute place in a beautiful part of the city.", "publishedDate": "2016-01-09", "language": "en", "rating": 5}, {"id": 302239103, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d2295948-r302239103-Antic_Teatre_Espai_de_Creacio-Barcelona_Catalonia.html", "text": "Great little hidden bar to stop by for a refresher during the hot summer days of sightseeing. \nShaded by a couple of big beautiful trees this little oasis has very reasonably priced drinks (a beer and sangria = 4€) and feels like a young-ish little local bar.", "publishedDate": "2015-08-22", "language": "en", "rating": 4}, {"id": 290994221, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d2295948-r290994221-Antic_Teatre_Espai_de_Creacio-Barcelona_Catalonia.html", "text": "If you want to relax under the shade of an enormous fig tree and feel like you´re not in the heart of the city when you really are, then climb the few steps up to the Antic Teatre's \"terraza\" and patio (in an alley, very near the Palau de la Música). Don´t expect to be pampered. You have to queue at the bar in order to place and get your order. And you may have to sit on the steps or grab plastic chairs if you can´t get a table, which is likely given the popularity of the place. But you can´t beat the atmosphere! This is not a place to go for a meal, as food choices are very limited --mostly nachos, peanuts and delicious olives. But they do make the best mojito in Barcelona!!! This is THE place to sit and read a book or to chat with friends and soak up the atmosphere. The theatre offers interesting, fringe performances at reasonable prices. It is certainly one of my favourite haunts in Barcelona.", "publishedDate": "2015-07-21", "language": "en", "rating": 4}, {"id": 285900339, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d2295948-r285900339-Antic_Teatre_Espai_de_Creacio-Barcelona_Catalonia.html", "text": "This place is one of the only patios you can be at the borne area. The bar is small but enough knowing that is for a small theater. The terrace is really big and the tree that is in the middle is authentic and unique. You can feel like you are in a patio in the middle of a small village. Prices are okay and the service is only in the bar. The staff is okay  ", "publishedDate": "2015-07-05", "language": "en", "rating": 5}, {"id": 264391546, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d2295948-r264391546-Antic_Teatre_Espai_de_Creacio-Barcelona_Catalonia.html", "text": "L'Antic Teatre is recycled place with an amazing amazing inner terrace/courtyard inbetween the trees and several apartment buildings. This ambiance is so one of its kind that it can not be copied by other people nor the owners can open a new branch with the similar concept. Because there is no concept!! Like Roman ruins anywhere in the world which naturally reached a certain form and ended up being authentic.", "publishedDate": "2015-04-08", "language": "en", "rating": 4}, {"id": 243619482, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d2295948-r243619482-Antic_Teatre_Espai_de_Creacio-Barcelona_Catalonia.html", "text": "The barman (I assume who most of the other reviewers are referring to) is an absolutely rude pompous idiot. As I liked the venue I have gone back a few times and on my last visit walked out before getting a drink as he was extremely rude to a friend of mine who dared to order a bottle of Cava. (He told her to choose to speak English or Spanish, not both!?!)\nIf the reviews are actually read by the venue I suggest you have a word with him or even better, get rid. If he is the owner, please sell up.", "publishedDate": "2014-12-09", "language": "en", "rating": 1}, {"id": 221837599, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d2295948-r221837599-Antic_Teatre_Espai_de_Creacio-Barcelona_Catalonia.html", "text": "The bar itself is okay, nothing special tho. The terrace is pretty nice and has good atmosphere. Although, they close it at 23:30 kicking you inside the bar, or out which, in my opinion, is unacceptable for a bar that has this very nice terrace.\nThe guy in the bar is also not very friendly, although I'm a local.\nWouldnt recommend this place for the night, but for an afternoon beer.", "publishedDate": "2014-08-14", "language": "en", "rating": 1}, {"id": 219506744, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d2295948-r219506744-Antic_Teatre_Espai_de_Creacio-Barcelona_Catalonia.html", "text": "Gorgeous cafe, very chilled vibe.  Food is ok but really the atmosphere makes this place.  The massive let down is one member of staff who clearly hates tourists.  I have never been spoken to so rudely and aggressively in my life, to the point where it shocked me so much I became tearful.", "publishedDate": "2014-08-04", "language": "en", "rating": 3}, {"id": 202583931, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d2295948-r202583931-Antic_Teatre_Espai_de_Creacio-Barcelona_Catalonia.html", "text": "This place surely has one of the most beautiful inside gardens in Barcelona, tables randomly spread under an imposing, monumental walnut tree. Calm group of customers (mostly students and artists) quietly chatting and sipping their beers and coffees welcomed us as we walked into this heavenly place. Some indistinct music could be heard from somewhere in the back. But as we approached the barista inside, there was this “alternative” young guy who surely had a serious problem not only with foreigners but also with himself. As we ordered espressos from the bar, he tried making witty comebacks and (supposedly sarcastic) insults in poor English, and continued murmuring something in native language once he couldn’t manage it. Nevertheless the place is so beautiful that even such a pathetic personage couldn’t stop us from enjoying our little break in this marvellous garden.", "publishedDate": "2014-04-24", "language": "en", "rating": 4}, {"id": 168530856, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d2295948-r168530856-Antic_Teatre_Espai_de_Creacio-Barcelona_Catalonia.html", "text": "The bar is clearly the attraction for a lot of people: good prices, fun atmosphere and huge outdoor seating. My wife and I are big performance/theatergoers and we like it challenging so the show, \"Juancallate\", was the best part for us: a great show and we don't speak much Spanish (and no Catalan)!", "publishedDate": "2013-07-22", "language": "en", "rating": 5}, {"id": 136409671, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d2295948-r136409671-Antic_Teatre_Espai_de_Creacio-Barcelona_Catalonia.html", "text": "I went there but there are only renovating the place, there a very cute cafe there \nIf you're near and want to have a coffee or a beer, it would be a nice place", "publishedDate": "2012-08-06", "language": "en", "rating": 3}]}}]