[{"locationId": 1553048, "name": "Jardin Botanico de Barcelona", "placeType": "ATTRACTION", "reviewListPage": {"reviews": [{"id": 735172145, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d1553048-r735172145-Jardin_Botanico_de_Barcelona-Barcelona_Catalonia.html", "text": "I guess there isn't quite as big of a variety of plants as in some other botanical gardens but I like that the plants seem native to the area or climate (keeping water conservation in mind - always a good thing) and it's very spacious. You can walk up and see gorgeous views and the place itself is very well kept. It's nice to wander and relax, and enjoy solitude. It's also only 3.50€ or free after 3pm on Sundays, so it's not exactly breaking the bank.", "publishedDate": "2019-12-28", "language": "en", "rating": 4}, {"id": 715763870, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d1553048-r715763870-Jardin_Botanico_de_Barcelona-Barcelona_Catalonia.html", "text": "Lots of weeds!!!  Very poorly maintained garden or plant areas.   Not worth the effort and cost of a visit.", "publishedDate": "2019-10-06", "language": "en", "rating": 1}, {"id": 713689963, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d1553048-r713689963-Jardin_Botanico_de_Barcelona-Barcelona_Catalonia.html", "text": "As previous reviews have said this place is very run down hardly any flowers and plants overrun with grass and weeds - the cafe is a self service coffee machine with nowhere to sit. It could be lovely as there was a nice view from it.  This needs a lot of money spent on it wouldn’t recommend a visit 😞", "publishedDate": "2019-09-28", "language": "en", "rating": 1}, {"id": 690588946, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d1553048-r690588946-Jardin_Botanico_de_Barcelona-Barcelona_Catalonia.html", "text": "I strongly recommend it. It is a very nice walk to take: trees from Australia, South america and Mediterranean area. Because it is a little remote, there were very few people around. I think it is a diamond, if you went through a long day of so many turists around you, this is the place to go. Or  if you want a break from turists and thieves.\n\n+ side :They have drinks and good coffee for 1-2 euros, very cheap compared to the prices at the other places we visited. They give you a map to move around, we needed about 2 hours .It is cheap around 3-4 eur compared to the other sites. We bought the tickets from the castle directly and got a picture from them for the route.\nThey have fountains to recharge your bottle for free.\n\nNow the bad part. We were cocky and used google maps as all other idiots searching for this place :)instead of the picture we had .. yes there were more groups walking at over 30 degrees Celsius. So the google map address is for the office, which is at the end of the parking lot . About 800 m on top of a hill and you need to walk down to find the entrance, we told them to correct it as we saw people just giving up and going back towards the bus/teleferic.\nAlso the signs to find this place are like a treasure hunt that went bad .", "publishedDate": "2019-07-18", "language": "en", "rating": 5}, {"id": 689097624, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d1553048-r689097624-Jardin_Botanico_de_Barcelona-Barcelona_Catalonia.html", "text": "Although extensive in area, the gardens seem to be relatively undiscovered by tourists and thus the walkways were uncluttered and quiet. A special price is offered for those over 65 - Euros 1.65 . It is worth noting that the area is far from flat and so for those with walking difficulties or the elderly, wheelchairs are provided free of charge as is a mobility scooter.. There is easy parking adjacent to the entry. Illustrated brochures are available in several languages.", "publishedDate": "2019-07-12", "language": "en", "rating": 4}, {"id": 678397018, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d1553048-r678397018-Jardin_Botanico_de_Barcelona-Barcelona_Catalonia.html", "text": "An interesting concept, plants segregated by geographical location and some lovely specimens, on the whole well labeled. \nCollection of amazing bonsai but the person watering them didn't even know how old they were!!! Much more could have been made of their presentation. Didn't find this place 2 years ago as all road signs direct you to the Historic Botanic Garden which is close by.... Would like to visit at a different time of year.  Free entry after 3pm on Sunday. Just enough time to look around as it closed at 7pm. \nVery weed filled and unkept in places but probably understaffed and underfunded like many such places.", "publishedDate": "2019-06-02", "language": "en", "rating": 4}, {"id": 676417436, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d1553048-r676417436-Jardin_Botanico_de_Barcelona-Barcelona_Catalonia.html", "text": "We had a guided tour by a well informed guide and very much enjoyed seeing the plantings which are segregated by geographic area. Some good specimens of interesting plants", "publishedDate": "2019-05-25", "language": "en", "rating": 4}, {"id": 675098368, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d1553048-r675098368-Jardin_Botanico_de_Barcelona-Barcelona_Catalonia.html", "text": "We visited after a 30 minute walk from the Castle of Montjuic, The concept of the gardens is good because plants are grouped according to geographical locations. However, the gardens are not well maintained and there is a lack of direction and information.", "publishedDate": "2019-05-19", "language": "en", "rating": 3}, {"id": 649744330, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d1553048-r649744330-Jardin_Botanico_de_Barcelona-Barcelona_Catalonia.html", "text": "I always visit botanical gardens on holidays regardless of the time of year and this is the first time I was disappointed. The staff was grumpy and disinterested ! After walking around for 15 minutes we left. Nothing interesting to see, it felt more like a maze designed to confuse.", "publishedDate": "2019-02-02", "language": "en", "rating": 2}, {"id": 644599903, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d1553048-r644599903-Jardin_Botanico_de_Barcelona-Barcelona_Catalonia.html", "text": "The lady at the ticket booth was grumpy and unhelpful. The only refreshments are two vending machines.  This garden was the worst botanic/public garden I have ever visited. Only plus side was that if you're interested most plants are labelled and imformation is available in a few languages. I was dusappointed and my family unimpressed that we'd walked so far to reach it. I thought there might be s cafe there too, but had to appease them with a €1.50 twix!", "publishedDate": "2019-01-08", "language": "en", "rating": 2}, {"id": 628361672, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d1553048-r628361672-Jardin_Botanico_de_Barcelona-Barcelona_Catalonia.html", "text": "This place is quite run down, clearly there isn't much love her. The place has a wide variety of plants, and I love the concept of walking around different places, but the place really needs some TLC. There are lots of areas with no plants, numerous plants without labels etc and was clearly really nice - 10 years ago. \n\nBarcelona City council or whoever owns this should spend some money here as it would be a great tourist attraction.", "publishedDate": "2018-10-26", "language": "en", "rating": 3}, {"id": 624786048, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d1553048-r624786048-Jardin_Botanico_de_Barcelona-Barcelona_Catalonia.html", "text": "A really disappointing botanical garden. I’ve been to a few different botanical gardens around Europe and this one was poorly maintained, poorly signed and lacked the volume of plants I would expect.", "publishedDate": "2018-10-14", "language": "en", "rating": 2}, {"id": 607743006, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d1553048-r607743006-Jardin_Botanico_de_Barcelona-Barcelona_Catalonia.html", "text": "Not another tourist in sight which was nice but unless you are a very keen gardener I would say this isn't a must. Spent a short while here and it was nice to see wild parrots and a few tiny lizards but on the whole I would say that we ( my husband, I and the children 14 and 11) enjoyed the laberint gardens more plus they were cheaper and easier to get to.", "publishedDate": "2018-08-18", "language": "en", "rating": 3}, {"id": 592058152, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d1553048-r592058152-Jardin_Botanico_de_Barcelona-Barcelona_Catalonia.html", "text": "most plants are dead or vanished. the entrance was cheap but it felt like the normal parks are taken care of better", "publishedDate": "2018-07-01", "language": "en", "rating": 1}, {"id": 586676628, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d1553048-r586676628-Jardin_Botanico_de_Barcelona-Barcelona_Catalonia.html", "text": "The park is fine, but seems a little abandoned, seems like the garden isn’t kept that well. Definitely didn’t live up to my expectation, much more beautiful gardens in Barcelona, even the ones next to this one, it is cheap though, so you kinda get what you pay for. ", "publishedDate": "2018-06-11", "language": "en", "rating": 3}, {"id": 584522269, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d1553048-r584522269-Jardin_Botanico_de_Barcelona-Barcelona_Catalonia.html", "text": "Tickets are cheap. Inside we can find mainly plants from Mediterranean region. But there are also plants common in e.g. Australia, California, Chile (check flowering Echinopsis). Unfortunately the Botanic Institute was closed. 1-2 hours are enough for visitors. ", "publishedDate": "2018-06-02", "language": "en", "rating": 4}, {"id": 579574398, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d1553048-r579574398-Jardin_Botanico_de_Barcelona-Barcelona_Catalonia.html", "text": "This was not on our original itinerary, but since we chose to walk downhill from Montjuic Castle to the Olympic Stadium, it made sense to stop. The admission fee was very reasonable (at that point in time we would've paid it just for the opportunity to use the restrooms available inside the entrance). The gardens are beautiful and well marked, and the views over the city are spectacular.", "publishedDate": "2018-05-11", "language": "en", "rating": 5}, {"id": 565796709, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d1553048-r565796709-Jardin_Botanico_de_Barcelona-Barcelona_Catalonia.html", "text": "If you enjoy the intense bustle of la Rambla and thrill at the site of a thousand tourists this may not be the place for you.The garden is easy to get to on the 55 bus from the city centre-it is the end stop near the Olympic Park. The site is on the steep slope at the top of Montjuic so from the wide concrete paths which snake around the site you get views of the city rooftops below and distant hills to the north and west.The garden is divided into zones each one representing the mediterranean plants of each continent so as a botanist it is fun to go from South Africa to Chile to California in a few minutes.Many of the plants are not fully mature so the garden will look very different in ten years but some individual specimens are terrific now like some of the palms and agaves from California and trees like Parkinsonia florida tree native to the United States with its brilliant yellow blooms and nearby I spotted a splendid acacia tree native to Australia. There were clumps of early wildflowers on meadow under a huge stone pine near the top of the hill.\nI was there in March and met exactly one other person and a friendly cat so if you need a break after  the teeming hordes of the Sagrada Familia this is the place to come. It cost four euros entry and the  coffee machine did a great cortado for one euro so for five euros I had a good morning out amongst some weird and wonderful plants.", "publishedDate": "2018-03-11", "language": "en", "rating": 4}, {"id": 563779504, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d1553048-r563779504-Jardin_Botanico_de_Barcelona-Barcelona_Catalonia.html", "text": "We were surprised on the small entrance fee for such a well maintained botantical garden park.  We were able to see the bonsai collection, which was quite large with olive, plum, crab apple, and many others,  We went early on a Sunday to avoid large crowds.", "publishedDate": "2018-03-02", "language": "en", "rating": 5}, {"id": 550202930, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d1553048-r550202930-Jardin_Botanico_de_Barcelona-Barcelona_Catalonia.html", "text": "From October to March 10am to 5 pm\nFrom April to September 10am to 7 pm\n\nReachable by Metro Lines 1 and 3 (Espanya Station)", "publishedDate": "2017-12-30", "language": "en", "rating": 4}, {"id": 545203736, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d1553048-r545203736-Jardin_Botanico_de_Barcelona-Barcelona_Catalonia.html", "text": "it may not be old, there may be homeless persons using it for a toiler, it may not have greenhouses, a quarter of it is still incostruction, and it is not a short walk from the subway, but i have been to enough gardens to know this garden has a world class collection from mediterranean climate zones. you can learn alot of plants here, and practically every species is labeled in catalan, spanish and english colloquial names and linnaean binomial classifications and familes and places of origin. top that off with a very affordable entrance fee, and free on first sundays. this barcelona highlight was commensurate with the famed gaudi sagrada familia cathedral. it takes at least 2 days to see it all.", "publishedDate": "2017-12-05", "language": "en", "rating": 5}, {"id": 529178685, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d1553048-r529178685-Jardin_Botanico_de_Barcelona-Barcelona_Catalonia.html", "text": "You can find here various types of plants. However gardens are not fullfilled with them because they are still under construction.\nWe were looking for bonsais, but they were in restricted area (why?).\nArchitectional appereance is very good (maybe better then plants).\n\nToilets at the entrance are disgusting!!! ", "publishedDate": "2017-10-02", "language": "en", "rating": 3}, {"id": 519833709, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d1553048-r519833709-Jardin_Botanico_de_Barcelona-Barcelona_Catalonia.html", "text": "Truth be told, coming from a Mediterranean country, I wasn't too thrilled with the exhibits, since most of the specimens I've encountered back home. Many had also withered, gived the weather was hot and it was August. However it is a big and rather cheap exhibition that would hold much interest for garden enthusiasts. I would appreciate some more signs though.", "publishedDate": "2017-08-31", "language": "en", "rating": 4}, {"id": 509998707, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d1553048-r509998707-Jardin_Botanico_de_Barcelona-Barcelona_Catalonia.html", "text": "came here after a pleasant time spent at the \"museo nacional d'art de catalunya\" in the montjuic area, site of the 1992 olympics. a very hot day, just walking from the museum to the park was almost too much. the park has no shade so unfortunately we couldn't find the energy to explore the gardens. the concrete path added to the heat. we attempted to find the bonsai collection and couldn't find it. 8 countries' plants represented, looked fabulous but we walked through quickly and sat by the pool in the shade near the exit.", "publishedDate": "2017-08-08", "language": "en", "rating": 3}, {"id": 507507724, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d1553048-r507507724-Jardin_Botanico_de_Barcelona-Barcelona_Catalonia.html", "text": "There's a reason that no one has reviewed the Botanic Gardens of Barcelona in English in the last six months... it's just not worth it.\n\nMy wife and I usually love the botanic gardens of any city as a haven from the hustle and bustle, a place to wander through shaded pathways, to learn more about plants, to have a picnic, or perhaps just rest under a shady tree. The Barcelona botanic gardens affords the first, but none of the rest.\n\nWe had been visiting the Montjuic fort on a hot summer day and wanted a nice walk down through the gardens to the art gallery. Our first mistake was trying to get in the back way  from the upper slopes. There's only one entrance and that is at the bottom of the hill across the road from the olympic stadium.\n\nHaving paid our 3.50 EUR entrance we looked around for a cafe or air conditioned bookstore facilities. Nope. They have a collection of poorly stocked vending machines instead (they do have toilets though). So we set off to visit the \"exposition\" space at the top corner of the gardens. We slogged along the broad concrete boulevards in the full midday sun, with the heat reflecting off the concrete and back onto us.\n\nWhat we did see was a selection of plants laid out thematically from around the world. They did seem to be universally from arid areas, so forget the lush and verdant botanic gardens you might find in other great european centers. It actually reminded us a lot of the botanic gardens in Canberra, Australia. A very similar harsh climate, and similarly set on quite a steep hillside, but the gardens in Canberra had a lot more diversity and interesting nooks and crannies. The Barcelona gardens also seemed neglected with quite a few dying or dead plants and zero evidence of any gardeners on the middle of a Monday.\n\nWe shortly reached the exposition center to find a two story 50m long building that was apparently completely deserted and with no displays set up. We got a beverage from a vending machine and just sat on the slate floor for 15 minutes. At least it was in shade from the building.\n\nSeating was sparse in the gardens and where we did find some it was in full sun. There were no picnic spaces, only a half-acre of dry stubble that had a sign warning us to keep out. There was only one  semi-interesting water feature down near the bottom of the slope, towards the exit of the gardens.\n\nThe only saving grace at the end of the day was that the gardens are small and we spent only half an hour there, mostly gazing out at the view over the olympic park from the deserted exhibition center. Avoid this afterthought of the 1992 olympics!", "publishedDate": "2017-07-31", "language": "en", "rating": 1}, {"id": 505587935, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d1553048-r505587935-Jardin_Botanico_de_Barcelona-Barcelona_Catalonia.html", "text": "It was very nice place to visit. We drove from Paris to Barcelona. Went thorough some picture perfect area. ", "publishedDate": "2017-07-25", "language": "en", "rating": 5}, {"id": 497319048, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d1553048-r497319048-Jardin_Botanico_de_Barcelona-Barcelona_Catalonia.html", "text": "\"For flowers lovers and those who are amazed with nature a must go place\"Uninspired layout - concrete paths line a hillside. Few flowers or interesting smells or even birds. Parks further down hill are free and better. Free entrance for teachers. Leaflet in English.", "publishedDate": "2017-06-29", "language": "en", "rating": 5}, {"id": 493117115, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d1553048-r493117115-Jardin_Botanico_de_Barcelona-Barcelona_Catalonia.html", "text": "Huge site, but a bit 'concretey' in its wide paths.  Spend a long time looking at average displays many of which are being overtaken by nature as there doesn't appear a lot of staff.  Then all of a sudden a few nicer colourful spots. but on average nothing special.  No café to break the trip,  Modest admission fee - but few visitors, sorry", "publishedDate": "2017-06-14", "language": "en", "rating": 3}, {"id": 492349522, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d1553048-r492349522-Jardin_Botanico_de_Barcelona-Barcelona_Catalonia.html", "text": "It was quite cool and damp when we got there and it was very pleasant to walk around. Not much in the way of labels and a few interesting plants, but good to see that this has reopened.", "publishedDate": "2017-06-11", "language": "en", "rating": 4}, {"id": 492346545, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d1553048-r492346545-Jardin_Botanico_de_Barcelona-Barcelona_Catalonia.html", "text": "Don't expect lush tropical plants and flowers here, this is not what this garden is about. Those used to temperate climate gardens have to remember that Barcelona is Mediterranean, hot and dry in the summer. The garden is divided into different areas of the world which share similar climates to Barcelona and so plants from those areas do well with the limited water resources. Some parts of the garden are better maintained than others. The Australian area was not so good. There were one or two plants we had not seen before but there could have been more Grevilleas. Only 3 or 4 cultivars that were not too well looked after. The Canary Islands area was of particular interest to us and had much better plantings.\nThe layout was very good with good accessibility for everyone but the  services are limited. Two lots of toilets and two lots of vending machines for drinks. Interestingly the machine at the entrance the drinks are cheaper! A lot of this is obviously financial and it is the only garden in the Montjuic area with an entrance fee. And that fee was cheap. \nWe saw very few other people there, other than a couple of school groups and only a few working there.\nIt is well worth going, there are some really interesting plants and the labelling is quite well done.", "publishedDate": "2017-06-11", "language": "en", "rating": 4}, {"id": 485015004, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d1553048-r485015004-Jardin_Botanico_de_Barcelona-Barcelona_Catalonia.html", "text": "We stumbled across the gardens when visiting the Olympic park. It was the parrots that initially caught our attention and as we delved deeper into the woodland we became more and more in awe of this natural beauty which contains thousands of rare species of tree, bird and animal. Amazing place. Tranquil. Beautiful. A must visit", "publishedDate": "2017-05-17", "language": "en", "rating": 5}, {"id": 479732021, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d1553048-r479732021-Jardin_Botanico_de_Barcelona-Barcelona_Catalonia.html", "text": "I mistakenly thought this was the much large botanical gardens, which are on the other side of the olympic stadium.  This one is free with a path winding down to a creek & sheltered, cool area at the bottom.  Plenty of areas to rest & take in the peace & quiet.  Several of the trees have botanical names in Spanish.  I thought there would be an exit at the bottom of the hill.  Unfortunately there isnt, so you need to climb up several flights of stairs & paths back to the top entrance where you entered.  If I'd realised, I wouldnt have bothered visiting on this particular day as it was hot & we'd already walked several km's.  A lovely place for a picnic though or some shade & a little waterfall on the climb back up.", "publishedDate": "2017-04-28", "language": "en", "rating": 4}, {"id": 478783408, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d1553048-r478783408-Jardin_Botanico_de_Barcelona-Barcelona_Catalonia.html", "text": "This is a peaceful oasis perched above the city, great for a  warm morning or late afternoon. We were there in April which was perfect to see the plants making the most of the growing season before the heat of summer. The planting and landscaping is excellent, taking you on a tour of the globe as you move from Spain, to Australia and South Africa. Lots of lovely scented plants perfume the air and there are some unusual specimens to see - we particularly liked the grass tree. You can easily escape the buzz and bustle of the city and relax in a lovely garden for a few hours. Don't miss the \"Bee hotel\".", "publishedDate": "2017-04-25", "language": "en", "rating": 4}, {"id": 476431102, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d1553048-r476431102-Jardin_Botanico_de_Barcelona-Barcelona_Catalonia.html", "text": "The botanic garden is really nice. You can see plants from warm areas and can be fantactic if you can plan the tour in the spring, beacause almost all the trees are with flowers. Nice place to walk and to enjoy iberian nature.", "publishedDate": "2017-04-17", "language": "en", "rating": 5}, {"id": 476205125, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d1553048-r476205125-Jardin_Botanico_de_Barcelona-Barcelona_Catalonia.html", "text": "You'll either like this place or just think that it is a big park! As a botanist, I felt that it was a great place. A rich variety of plants from the Mediterranean, California, Australia and South Africa amongst other areas - many being shrubs and trees. It is not a manicured garden but a large (14ha) area of hillside covered with a maze of concrete paths. There are 'weeds' and areas that perhaps need tending but it does have a compelling quality and also has good views across the city.\nThere was an excellent display of bonsai to see when we were there. \nWe got there via the red route tourist bus and it is a 10 minute walk from the Miro Gallery stop, at the rear of the Olympic stadium. It was only €2.80 each to enter using a discount voucher from the tourist bus. It wasn't busy and the quietness and generous size of the place added to this attraction. As another reviewer has said, it could use a good cafe - though there are toilets.", "publishedDate": "2017-04-16", "language": "en", "rating": 4}, {"id": 475715498, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d1553048-r475715498-Jardin_Botanico_de_Barcelona-Barcelona_Catalonia.html", "text": "The botanical gardens is a great visit if you like gardening and landscaping. Very cool layout and you can easily spend a couple of hours there without seeing the same scene twice. I suspect the place can get pretty hot in the day so recommend going in the morning.\n\nWould have liked to see the bonsais but for some reason that exhibit is not open in the weeks. Only in the weekends. Why not put that exhibit closer to the exit where the layout of the park has a distinct japanese feel to it and it should be easier to guard and keep it open at all times.\n\nThe place could definitely have used a good cafe and/or restaurant. The vending machines dont make anyone happy. Why not let a good restaurateur set up shop in the lower level of the botanic institute at the top of the gardens...Would definitely make it even more worth the visit.", "publishedDate": "2017-04-14", "language": "en", "rating": 4}, {"id": 468365968, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d1553048-r468365968-Jardin_Botanico_de_Barcelona-Barcelona_Catalonia.html", "text": "A big variety of plants, trees, flowers, bonsai. Modern style, very relaxing place. Free on Sunday after 15.00", "publishedDate": "2017-03-18", "language": "en", "rating": 4}, {"id": 440652332, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d1553048-r440652332-Jardin_Botanico_de_Barcelona-Barcelona_Catalonia.html", "text": "Very nice garden with different plants from different parts of the world. Beautiful view over the city, recommended to go at sunrise or sunset. . Quiet, little noise from traffic, spacious and cheap.", "publishedDate": "2016-11-28", "language": "en", "rating": 5}, {"id": 435345354, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d1553048-r435345354-Jardin_Botanico_de_Barcelona-Barcelona_Catalonia.html", "text": "As the title says autumn is not the best time to visit, however still very interesting and informative.   The gardens cover 5 differing landscapes.  They were reconstructing some areas but it was still very interesting if interested in horticulture", "publishedDate": "2016-11-07", "language": "en", "rating": 4}, {"id": 435070214, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d1553048-r435070214-Jardin_Botanico_de_Barcelona-Barcelona_Catalonia.html", "text": "This garden seeks to compare the similar botany of different world areas eg Australasia, Mediterranean, California etc. it has wide range of specimens which are still being added to. The area is quite hilly being on Mont Juic overlooking the city. It is also next to the 1992 Olympic Stadium which is a bit of a distraction because  it seems to play an endless recording of the music and events.\nThe staff were very helpful and gave me the use of an electric scooter to get around. Guide says allow an hour. I' d say more like 2 hours. There are no facilities at the site other than loos and vending machine. We had a packed lunch we we ate somewhere the top of the garden.", "publishedDate": "2016-11-06", "language": "en", "rating": 4}, {"id": 428354495, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d1553048-r428354495-Jardin_Botanico_de_Barcelona-Barcelona_Catalonia.html", "text": "Nice enough gardens but no info on the plants (except for names) and a few info boards that were in Spanish only.  Bonsai trees were nice but not that many to see.  Didn't take long to go round. ", "publishedDate": "2016-10-16", "language": "en", "rating": 3}, {"id": 405258926, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d1553048-r405258926-Jardin_Botanico_de_Barcelona-Barcelona_Catalonia.html", "text": "I went to these botanical gardens expecting flashy and cool looking good rare plants (not everywhere, but at least here and there). My expectations were a bit too high.\n\nThe park is pretty huge and is on the Montjuïc mountain. Paths throughout the park do go uphill and downhill. The directions signs aren't really great, but give a general indication of things.\n\nBig signs indicate which region the plants are from, for example, South-Africa, Chile, Californië, etc. Near plants and trees you can see small signs with the common and Latin names. From a distance they look normal to me, but I'm sure someone with knowledge of botany will recognise uncommon plants and trees. Maybe it looks better in the spring when more plants are blooming, but I went in August.\n\nThere are drinking fountains and benches spread throughout. Trust me, you will need them considering the size of the park and the Barcelona weather.\n\nSave this place for Sunday afternoon if you plan going here, because it's free after 15:00.", "publishedDate": "2016-08-14", "language": "en", "rating": 3}, {"id": 400606221, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d1553048-r400606221-Jardin_Botanico_de_Barcelona-Barcelona_Catalonia.html", "text": "This botanical garden is free and has some nice paths to walk around in, but there's nothing spectacular you really have to see here.  They have a lot of plants and flowers, but it's not much more than a park, really.", "publishedDate": "2016-08-02", "language": "en", "rating": 3}, {"id": 393220963, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d1553048-r393220963-Jardin_Botanico_de_Barcelona-Barcelona_Catalonia.html", "text": "This is a very young garden. It will take another 20 years to mature. But needs some serious planting. I've seen many Mediterranean gardens and this is not close to equal. Mostly concrete paths with a charge. Go On free Sunday's because it's not worth entry. Better examples of Mediterranean gardens all over Montjuric for free. ", "publishedDate": "2016-07-16", "language": "en", "rating": 2}, {"id": 392154729, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d1553048-r392154729-Jardin_Botanico_de_Barcelona-Barcelona_Catalonia.html", "text": "This garden in only recommended for people interested in diferent plants and trees of the world with similar climate of the Mediterranean, they are several countries represented, you will find flora that grows in California, Australia, Chile etc., very interesting, the entrance is not free but is very affordable around three euros, last Sundays of the month are free. Very easy access by car o taxi but there is also public transportation, also inexpensive.", "publishedDate": "2016-07-13", "language": "en", "rating": 4}, {"id": 391982131, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d1553048-r391982131-Jardin_Botanico_de_Barcelona-Barcelona_Catalonia.html", "text": "This fantastic nature trail is hidden between the National Museum of Art and the Olympic stadium. \n\nIt is well worth the visit as the trail takes you through some beautiful and varied fauna, but be warned that it has good paths and steps but it is a bit of a climb. There are seats on the way round.\n\nThere are also pools which had tadpoles in June when we visited. \n\nWe will be going back.", "publishedDate": "2016-07-13", "language": "en", "rating": 4}, {"id": 391299528, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d1553048-r391299528-Jardin_Botanico_de_Barcelona-Barcelona_Catalonia.html", "text": "I'm a bit sad to say this because I love a botanical garden, but I didn't think much of this. I've been to several in Spain and Italy that have been very tropical and green and interesting, but this one just felt like following a concrete path to look at some barren rocky gardens with far spaced cacti and palms. It didn't feel very established, or maybe it's just too big for the number of plants in it. It just seemed a bit empty and dusty. One very good thing though, there were drinking taps every few minutes or so.", "publishedDate": "2016-07-11", "language": "en", "rating": 2}, {"id": 387904319, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d1553048-r387904319-Jardin_Botanico_de_Barcelona-Barcelona_Catalonia.html", "text": "This is a huge garden so you will have to do a lot of walking up and down the slopes. I found it too big – almost lost interest in the plants due to the big distances. Organized in geographical sectors or world regions. Not close to metro – did not check bus connections.", "publishedDate": "2016-06-30", "language": "en", "rating": 2}, {"id": 380751084, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d1553048-r380751084-Jardin_Botanico_de_Barcelona-Barcelona_Catalonia.html", "text": "First time I have seen Amaryllis mass planted beautiful. Very poorly maintained with weeds on paths and stairways receiving no attention. The only staff were arborists trimming and chipping the city's trees offsite. ", "publishedDate": "2016-06-08", "language": "en", "rating": 1}, {"id": 374900449, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d1553048-r374900449-Jardin_Botanico_de_Barcelona-Barcelona_Catalonia.html", "text": "This was a great place to spend a couple of hours but it was so quiet.  It looks as if it is forgotten as it is not on any of the tourist bus routes so you have to be persistent in walking to it.  \nThere is no café facilities just a few vending machines.\nThe cost to get in is just a few euros and worth the money but we were there in the middle of the afternoon and saw only about a dozen people.  \nIt is not mentioned in many of the guide books but it is worth visiting ", "publishedDate": "2016-05-20", "language": "en", "rating": 4}, {"id": 367183319, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d1553048-r367183319-Jardin_Botanico_de_Barcelona-Barcelona_Catalonia.html", "text": "This botanical garden is a lovely and quiet spot where you can enjoy the beautifully colored flowers, especially in spring and summer. Worth a visit !", "publishedDate": "2016-04-25", "language": "en", "rating": 5}, {"id": 366067932, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d1553048-r366067932-Jardin_Botanico_de_Barcelona-Barcelona_Catalonia.html", "text": "Being very interested in botany, my wife and I spent quite some time in these very interesting gardens.\nI love the way they are organized geographically, from Australia, to South Africa, to the Mediterranean and so on, allowing one to really get a feeling of those locales.\nFor us the culmination was the \"bee hotel\": a triangular structure that contains materials drilled to sizes that invite various hymenoptera to adopt is as dwellings. It is conveniently located over a large bed of white convolvulus and under the beautiful cover of cercis siliquastrum in full bloom. What  was nice was also the presence of various painters doing their work on the beautiful premises.\nThe one missing star is because, after the visit, it took us about 45 minutes and quite a bit of luck to finally find a taxi to take us back downtown. Maybe the office there could try and help visitors with this problem.", "publishedDate": "2016-04-21", "language": "en", "rating": 4}, {"id": 365274436, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d1553048-r365274436-Jardin_Botanico_de_Barcelona-Barcelona_Catalonia.html", "text": "On Montjuic, not far from the Olympic Stadium. We wandered around & didn't see any other visitors, which was quite welcome with all the crowds in Barcelona.  I was expecting more blooming plants since it was early Spring, so a bit disappointed.\nCollection of bonsai trees was quite interesting. The horticultural specialist was very knowledgeable and answered our questions about the bonsai.", "publishedDate": "2016-04-18", "language": "en", "rating": 3}, {"id": 349882819, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d1553048-r349882819-Jardin_Botanico_de_Barcelona-Barcelona_Catalonia.html", "text": "The botanical gardens are quite remote from the town centre, but are worth the trip. They have organised the gardens in several areas by countries. The plants are beautiful and well kept. And the views over Barcelona are great. Some areas were empty, as they were revamping some spaces. We enjoyed a tranquil walk, very relaxing.", "publishedDate": "2016-02-21", "language": "en", "rating": 4}, {"id": 340441619, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d1553048-r340441619-Jardin_Botanico_de_Barcelona-Barcelona_Catalonia.html", "text": "A modern, well designed garden.  The exit across the walkway at the end of tour is worth the entrance fee alone.  We got in free, certain Sunday's and Monday's are, so it's worth checking.\n\nIt's quite a trek from the main part of Mount Juic, so worth planning transport on local buses.  I walked, but companions struggled in 42 degree heat!  Lots of other small gardens on the mountain so it's worth plotting your route to save going up and down to much and making use of the cable car for gentle walking descent.  I did two trips as the Botanical is so far around.  You can walk down and see most of the others gardens from the castle.", "publishedDate": "2016-01-16", "language": "en", "rating": 5}, {"id": 340391336, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d1553048-r340391336-Jardin_Botanico_de_Barcelona-Barcelona_Catalonia.html", "text": "Among all the museums and Olympic structures on Montjuic, it is easy to miss this wonderful botanic garden. Although the botanic garden was introduced in 1888, this one was opened in 1999. There are sections dedicated to the plants from all over the world, but the major part of the garden represents those typical for Mediterranean basin. Very calm and relaxing place which is well worth the visit.", "publishedDate": "2016-01-16", "language": "en", "rating": 5}, {"id": 336746650, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d1553048-r336746650-Jardin_Botanico_de_Barcelona-Barcelona_Catalonia.html", "text": "Excellent garden, focussing on mainly plants that thrive in a dry summer. Time of visit will determine the display, we just missed the early spring bulbs, but in mid may we saw a wonderful range of flowers from around the world. Well labelled, and for someone from a cold northern climate the range of 'new' plants to enjoy was tremendous.", "publishedDate": "2016-01-02", "language": "en", "rating": 5}, {"id": 327476861, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d1553048-r327476861-Jardin_Botanico_de_Barcelona-Barcelona_Catalonia.html", "text": "My mother and I spent a delightful couple of hours here.   Do not expect lush greenery here as, in keeping with the climate of Barcelona, it is all about Mediterranean style plants from semi-arid areas.\n\nWith this in mind, it's well worth seeing.  There are a couple of downsides - no cafe/refreshments to speak of and it's a bit off the beaten track.", "publishedDate": "2015-11-17", "language": "en", "rating": 5}, {"id": 326046809, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d1553048-r326046809-Jardin_Botanico_de_Barcelona-Barcelona_Catalonia.html", "text": "My boyfriend and myself rented bikes and got a tour around barcelona.  this area was beautiful..lovely to cycle and walk around during the day.  we wouldnt have came here if it wasnt for the tour but im glad we did. lovely scenery", "publishedDate": "2015-11-11", "language": "en", "rating": 5}, {"id": 314598471, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d1553048-r314598471-Jardin_Botanico_de_Barcelona-Barcelona_Catalonia.html", "text": "Pretty garden with lovely views, but incredibly difficult to find. At the garden, no information on the plants in English. Beautiful collection of bonsais.", "publishedDate": "2015-09-28", "language": "en", "rating": 3}, {"id": 313135370, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d1553048-r313135370-Jardin_Botanico_de_Barcelona-Barcelona_Catalonia.html", "text": "We found this a fascinating collection of Mediterranean plants - examples from Mediterranean climate from across the world displayed in attractively laid out grounds. It concentrates on the plants in that particular climate (Mediterranean  coast,parts of  South Africa, California, parts of Australia ...... It works well and improves understanding of plants around the world. We liked the \"museum of curiosities\" and its interesting collection of artifacts from a previous time and also the bonsai collection. Worth a visit to find out more about plants in this climate and to have a picnic in nice surroundings", "publishedDate": "2015-09-23", "language": "en", "rating": 5}, {"id": 304510753, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d1553048-r304510753-Jardin_Botanico_de_Barcelona-Barcelona_Catalonia.html", "text": "Maybe I'm spoiled coming from Chicago where we have one of the biggest, most beautiful botanic gardens but this one doesn't have any flowers - just plants, bushes and trees.  \nThere are beautiful views of the city from up there.\nIt's on top of Montjuic but the main entrance is set back from the road and not easy to find even with GPS.\nGreat, easy access for wheelchairs/strollers", "publishedDate": "2015-08-28", "language": "en", "rating": 2}, {"id": 303557912, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d1553048-r303557912-Jardin_Botanico_de_Barcelona-Barcelona_Catalonia.html", "text": "The botanical gardens are a little off the beaten track, and we decided to visit them via the excellent MNAC to avoid too long a walk. I assume it is because of this that the gardens were so quiet when we arrived, so they're a good pick if you want to get away from the tourist hordes. \n\nWe loved the tranquil atmosphere and the wide selection of beautiful shrubs, bushes and trees (though in late August few flowers) from all the places on the planet which share Barcelona's mediterranean climate. \n\nThe irregular geometry of the gardens' paths gives the feeling of a lazy but structured wander. The overall design of the garden feels stylish and contemporary, combining simple shapes and materials to give a real idea of man's overlapping with nature: industrial metal with a sheen of orange rust, concrete adorned with lichens.\n\nThe only slight thing that detracted from the visit was the sparseness of some of the beds, leaving exposed bare earth and rather unkempt grass. The gardens are undergoing expansion and reconstruction at the moment, so I don't blame the horticulturalists too much for this. \n\nA final thing to note is that the garden offers some spectacular views over Barcelona with the schematic map showing the location of various panoramic views. \n\nAt a very reasonable €3 (€1.90 concession), tranquil, well designed, though perhaps a little out of the way, the gardens are definitely worth your time, perhaps when combined with some other activities on Montjuïc. ", "publishedDate": "2015-08-25", "language": "en", "rating": 4}, {"id": 300291339, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d1553048-r300291339-Jardin_Botanico_de_Barcelona-Barcelona_Catalonia.html", "text": "When you are close to Montjuïc and you could spare 1 or 2 hours - that's the place to go, quite, beautiful and good to take a break.", "publishedDate": "2015-08-17", "language": "en", "rating": 4}, {"id": 298222380, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d1553048-r298222380-Jardin_Botanico_de_Barcelona-Barcelona_Catalonia.html", "text": "Not easy to find the entrance.Very few flowers in blom,mainly just green half dead plants,even though it's august some of the flowers should still be blomming.half the place was closes due to contruction.", "publishedDate": "2015-08-12", "language": "en", "rating": 2}, {"id": 288613808, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d1553048-r288613808-Jardin_Botanico_de_Barcelona-Barcelona_Catalonia.html", "text": "There are two very good reasons you have to visit Montjuic.  First it has amazing views of the city and the port. However as equally impressive but not as well know are the wonderful public gardens that surround it. Barcelona, especially the Gothic quarter, has few trees or greenery so Montjuic is a kind of Central Park for the city. Take the cable cars to the top of the mountain but walk down. You will walk through forest and gardens all amazing and tranquil.   We even found a group ps Barcelonans communing with nature performing martial arts exercises.  In addition, the park and gardens give you the opportunity to see the natural flowers and fauna that would exist in the region if the area was still natural. Again, I recommend you take the time to visit these gardens on your visit.", "publishedDate": "2015-07-13", "language": "en", "rating": 4}, {"id": 281303102, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d1553048-r281303102-Jardin_Botanico_de_Barcelona-Barcelona_Catalonia.html", "text": "If you are into nature and flowers this is for you, not many people know about this little place, i found it very interesting. It has a wide collection of plants and they collect seed and are involed in plant diversity.  Most intriqing and well worth while giving it a visit.", "publishedDate": "2015-06-19", "language": "en", "rating": 5}, {"id": 281219383, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d1553048-r281219383-Jardin_Botanico_de_Barcelona-Barcelona_Catalonia.html", "text": "It's nice place to walk and good paths to follow. We were given a good map of the area. The express route was around 45 minutes. It's free on Sundays after 15 but we got  a discount when arriving a bit earlier. A short walk from the city tour bus stop.", "publishedDate": "2015-06-18", "language": "en", "rating": 4}, {"id": 278829426, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d1553048-r278829426-Jardin_Botanico_de_Barcelona-Barcelona_Catalonia.html", "text": "This hidden gem specializes in plants that grow in climates similar to Barcelona, to wit, Chile, Australia, N and S Africa, Mediterranean basin and California (USA).  I thought it was well maintained though not much was flowering in late May 2015.  I did not rate it 5 starts b/c it is a strenuous trek to get to the actual park/garden.  Since likely a large percentage or their visitors are mature, I would think getting there would be challenging.", "publishedDate": "2015-06-08", "language": "en", "rating": 4}, {"id": 273173170, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d1553048-r273173170-Jardin_Botanico_de_Barcelona-Barcelona_Catalonia.html", "text": "Why this hidden gem of a garden is so under-publicised, under-utilised and ignored is a real mystery. Located behind the Olympic Stadium just a five minute walk from the City Tour-bus stop, it is not mentioned on the list of attractions on the maps, the signage to direct you there is really confusing and when you arrive the entrance is not obviously signed to welcome visitors. We met two couples wandering up the hill trying to find it and they were going in the wrong direction, thinking they were following the signs correctly. We only stumbled on it by good fortune. When we finally worked out where the entrance was -the entrance sign was contemporary  minimalist, but unfortunately invisible -we told the man at the ticket desk that there were people wandering around trying to find it. He said he has been reporting it for months but nothing has changed!!\nOnce inside it's a gardener's delight, Mediterranean-climate plants from all over the world are growing according to their regional zones. Paths, benches and infrastructure are in great condition suitable for all abilities, great views over the city, drinking water fountains are dotted around the site. The plants are well-labelled and there is plenty of interpretive lectern information boards. Having just escaped from the over-crowded and over-exploited Park Guell, which is a pilgrimage site for garden-lovers, this garden was quiet, serene, almost deserted, but in its way just as magical -and full of wildlife.  There was a display of amazing Bonsai trees in one corner of the garden. There are good toilet facilities, but only vending-machine drinks and snacks, no guide-book, just a leaflet/map and a few post cards for sale. There is construction work taking place adjacent to the site which are hopefully improvement works, \nWhy this exceptional garden is so under-marketed is inexplicable, but it is well worth the visit for any garden/plant lovers, especially if you've always wanted to know the names of those holiday plants!!\nHighly recommended, Barcelona should be proud of its botanic garden, not keep it hidden!!", "publishedDate": "2015-05-19", "language": "en", "rating": 5}, {"id": 269092220, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d1553048-r269092220-Jardin_Botanico_de_Barcelona-Barcelona_Catalonia.html", "text": "We spent a very enjoyable couple of hours here. We visited after going to Museu Nacional d' Art de Catalunya, calling in at the Olympic stadium en route. This provided a nice combination of time indoors, short walk and three different attractions. The staff were very nice and helpful. The site is easy to navigate, and has an interesting variety of plants. I've been to more interesting Botanic Gardens, but few have had such great views. It's a bit of a hike but I would recommend it. We visited in Spring, but I can imagine it gets very hot in summer.", "publishedDate": "2015-04-30", "language": "en", "rating": 4}, {"id": 266850334, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d1553048-r266850334-Jardin_Botanico_de_Barcelona-Barcelona_Catalonia.html", "text": "Lovely park/garden to visit and spend some time in. Nice smooth pathways and beautiful flowering trees each belonging to different countries and continents. We loved every bit of it and stayed until closing time. Great for relaxing and fresh air scented with different aromas.", "publishedDate": "2015-04-20", "language": "en", "rating": 5}, {"id": 264840452, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d1553048-r264840452-Jardin_Botanico_de_Barcelona-Barcelona_Catalonia.html", "text": "Seeing as I had the Barcelona Card and I knew I was going to be in the area, I decided to venture to the Gardens.\nThe garden itself is beautifully maintained and I greatly enjoyed venturing around in the hot sunshine. The views are fantastic and it is a perfect place to observe the city in the quiet. \nSomeone who is interested in botany or plants would absolutely love this place, however unless you are in the area or aren't specifically interested in nature I would say give this a miss.\nA nice way to spend a spare hour or two.", "publishedDate": "2015-04-10", "language": "en", "rating": 4}, {"id": 259368593, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d1553048-r259368593-Jardin_Botanico_de_Barcelona-Barcelona_Catalonia.html", "text": "Its a wonderful botanic park. Pefect place to rest from the city noise. Park is divided into sections that represent different countries of the world. We had few calm and quiet hours here. Recommended for all nature lovers!", "publishedDate": "2015-03-14", "language": "en", "rating": 5}, {"id": 257715118, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d1553048-r257715118-Jardin_Botanico_de_Barcelona-Barcelona_Catalonia.html", "text": "Was really looking forward to visiting these gardens but was let down as no flowers, tropical plants or any interesting species really. I understand March was probably not the best time to visit but overall there should've been a much better display. Luckily we left it til a Sunday when it was free because although the entrance fee is low we would still have felt cheated.. Enjoyable space to hang out in though and lots of nice trees. ", "publishedDate": "2015-03-04", "language": "en", "rating": 3}, {"id": 255837538, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d1553048-r255837538-Jardin_Botanico_de_Barcelona-Barcelona_Catalonia.html", "text": "This is such a gorgeous place. It's fascinating to see the incredible variety of flora from Mediterranean type regions from around the globe. On a sunny day like we had (in February!) it's a place to savour, take your time! There are plenty of conveniently placed benches to sit down and soak up great views across Barcelona. Can't recommend a visit highly enough!", "publishedDate": "2015-02-22", "language": "en", "rating": 5}, {"id": 240924644, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d1553048-r240924644-Jardin_Botanico_de_Barcelona-Barcelona_Catalonia.html", "text": "We loved coming here because there were very few people. After Rambla and Parc Guell one needs to escape from crowd. Beside that we love to visit Botanical gardens and this one was very nice because it has a lot plants from deserts of Australia and America. Very interesting, very nice organised and definitely worth entrance fee.", "publishedDate": "2014-11-21", "language": "en", "rating": 5}, {"id": 232421966, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d1553048-r232421966-Jardin_Botanico_de_Barcelona-Barcelona_Catalonia.html", "text": "Visited in July 2014 with my husband.  We had been visiting the Olympic Stadium & decided to walk to the gardens which was about 5 minutes away.  We visited on a Sunday & arrived at the botanical gardens at 1435.  The member of staff at the ticket booth advised that from 1500 each sunday there is no admission charge so my husband & I sat outside on a bench & chilled in the sun for 25 minutes.  Sure enough at 1500 we were allowed to enter free of charge.\n\nThe gardens are so big you would need to allow a few hours if you wanted to visit all areas.  We started off in  \"Australia\" & then side-stepped over to \"South Africa\".  It wasn't the botanic gardens I was used to visiting with fresh flowers around - trees & plants were more familiar around this garden.  It was still very interesting & such a pleasant way to spend the afternoon.\n\nThe paths can be steep at times & in the hot Barcelonian sun I would advise lots of water to drink.  There are water taps spread out around the gardens for you to drink from but if you have a sensitive stomach I wouldn't.  I filled my empty water bottle with the drinking water & gulped some down immediately.  It took my husband & I approximately 15-20 minutes after that to reach the Botanical Institute at the top of a hill & that was the precise time my stomach decided that it did not like the water & I had to run for the loo!  Luckily there were toilet facilities at the Institute (one male & one female along with a vending machine) or else I would have been ducking behind one of the many palm trees.  My stomach continued to be upset later on that day in which my husband commented that usually I walk as slow as a snail but out of nowhere I was moving like Usain Bolt to get to our hotel bathroom.\n\nBesides my impromptu toilet dash I really did enjoy my trip to the botanical gardens.  They even had a cute \"bee hotel\" but unfortunately no bees to be found just flies instead.  Taking into consideration the amount of overcrowded tourist attractions in Barcelona this place is like a haven of peace & quiet.\n\nCall into the gardens before or after you visit the Olympic Stadium. It really does make for an enjoyable day.", "publishedDate": "2014-10-03", "language": "en", "rating": 4}, {"id": 229228800, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d1553048-r229228800-Jardin_Botanico_de_Barcelona-Barcelona_Catalonia.html", "text": "Lovely botanical gardens with amazing views over the city below and all for a couple of euros. \nA great additional sight to take in when you are up Montjuic ", "publishedDate": "2014-09-16", "language": "en", "rating": 4}, {"id": 220858815, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d1553048-r220858815-Jardin_Botanico_de_Barcelona-Barcelona_Catalonia.html", "text": "Amazing place to visit, especially in the hot day. There are a lot different species and you can spent a few our wandering around it.", "publishedDate": "2014-08-10", "language": "en", "rating": 4}, {"id": 220703639, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d1553048-r220703639-Jardin_Botanico_de_Barcelona-Barcelona_Catalonia.html", "text": "Taxi driver dropped us off at nearby gardens instead of botanic gardens which meant by time we found right place we were tired and were only able to take short route round but well worth the visit. Olympic stadium just across the road.", "publishedDate": "2014-08-09", "language": "en", "rating": 4}, {"id": 216843858, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d1553048-r216843858-Jardin_Botanico_de_Barcelona-Barcelona_Catalonia.html", "text": "Botanical gardens are a must see for me and my kids, everywhere. This botanical garden focus on plants that are adapted to the climate zone similar to Barcelona. There were represented plants from America, Australia and Asia. Quite interesting to see the diversity despite of the sharing of climate zone. From the garden you have a fabulous view over Barcelona city. Water is available several places during the trip. Serious information in reception, nice with staff that really knows what they are talking about, here plant genetic diversity.\nThe bonsai collection was very cute, unfortunately without information.", "publishedDate": "2014-07-22", "language": "en", "rating": 5}, {"id": 208090892, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d1553048-r208090892-Jardin_Botanico_de_Barcelona-Barcelona_Catalonia.html", "text": "If your a botanical garden lover, you will love this one. It's located on Montjuic. Next to the Olympic stadium. The garden has different zones for the different climates around the world. We enjoyed our afternoon visit after the morning at the Castle.", "publishedDate": "2014-05-30", "language": "en", "rating": 5}, {"id": 207371364, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d1553048-r207371364-Jardin_Botanico_de_Barcelona-Barcelona_Catalonia.html", "text": "At €3.50 per person, we felt this was much better value than some of the more touristy attractions in Barcelona. \n\nThe Botanic Gardens are still being developed; they have changed significantly since I last visited nearly ten years ago. Plants are grouped geographically, with tall Washingtonias in the 'California' section one of the highlights - it was nice to see these having their 'petticoats' left on, rather than removed as tends to happen in many urban settings. Lavenders too, were leggy rather than comapct; plants are grown the way they are in the wild, not pruned and managed by gardeners.\n\nIt was good to see some bamboos - Phyllostachus Aurea and Niger; both werre receiving some water, which they'll need, in  the dry soil of the Montjuic.\n\nThere are some good views to be had from there as well.\n\nWe spent an hour there; if we had had lunch beforehand, and it didn't come on to rain, we could easily have found enough to keep us interested for another two.\n\nWell recommended. \n", "publishedDate": "2014-05-27", "language": "en", "rating": 5}, {"id": 204212198, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d1553048-r204212198-Jardin_Botanico_de_Barcelona-Barcelona_Catalonia.html", "text": "We were here a bit ahead of peak flower season, but still the gardens were very pretty.  We were surprised how big the botanical gardens were - you could spend quite a bit of time here.  An added benefit is that you get a great view over the Olympic park and Barcelona from here.", "publishedDate": "2014-05-05", "language": "en", "rating": 4}, {"id": 203173505, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d1553048-r203173505-Jardin_Botanico_de_Barcelona-Barcelona_Catalonia.html", "text": "The jardi botanic de Barcelona is a little known gem. Situated behind the Estadia Olimpic on Montjuic Park it is a collection of all the world's Mediterranean vegetation. Here you will see plants from countries sharing the same characteristics - Australia, Canary Islands, South Africa, North Africa, Chile, California, Eastern and Western Mediterranean. Well worth seeking out in a lovely setting and close to all of the Olympic venues of Barcelona.  A small entry fee is payable", "publishedDate": "2014-04-28", "language": "en", "rating": 4}, {"id": 191833129, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d1553048-r191833129-Jardin_Botanico_de_Barcelona-Barcelona_Catalonia.html", "text": "Big space out of city centre.Well organised, a great variety of plants and trees and free cute little parrots flying around. The only disadvantage is that there was no information from anybody on what we see. I think that's the only reason we didn't get excited.", "publishedDate": "2014-01-23", "language": "en", "rating": 4}, {"id": 190318645, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d1553048-r190318645-Jardin_Botanico_de_Barcelona-Barcelona_Catalonia.html", "text": "One of the finest botanical gardens I have seen from a design viewpoint. Very spacious and pleasant walking trails, great resting areas, very good signage. The collection features plants from just about every area of the world that has a Mediterranean-type climate, from California to Australia, Chile and the Mediterranean. For plantaholics, a must. For landscape designers/architects, a great piece of design.", "publishedDate": "2014-01-09", "language": "en", "rating": 5}, {"id": 180372996, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d1553048-r180372996-Jardin_Botanico_de_Barcelona-Barcelona_Catalonia.html", "text": "Perhaps this is not a perfect botanical garden, but is very good for a 2-3 hours tour. It is a pleasant walk from the city center, in a quiet environment. You can notice specific aspects of mediteraneean (european and north-african) vegetation as related to similar vegetation around the world (California, South Africa etc.) . This could help you for a better understanding of nature and vegetation around Barcelona, and (with a bit imagination) you can travel also (by mind) in similar landscapes (Australia, Chile).", "publishedDate": "2013-10-09", "language": "en", "rating": 4}, {"id": 180332418, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d1553048-r180332418-Jardin_Botanico_de_Barcelona-Barcelona_Catalonia.html", "text": "We went on a Sunday afternoon which was free to get in but I believe the regular admission is only about 3.50.  In October, most of the plants have stopped flowering but it is still worth a visit.  A peaceful place to stroll in the sunshine and lots of photos of well taken care of plants!  Above the Olympic Stadium and some good views over the city.  We took the Metro and walked the rest of the way, it's not very well signposted but luckily we had a map.  Apparently you can get a bus there and I would recommend you do that as it's uphill all the way although it is a pleasant walk through several parks and past the Magic Fountain which we might not have seen if we'd caught the bus.  All in all, worth a visit for a relaxing afternoon.", "publishedDate": "2013-10-09", "language": "en", "rating": 4}, {"id": 179567173, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d1553048-r179567173-Jardin_Botanico_de_Barcelona-Barcelona_Catalonia.html", "text": "There has clearly been some major investment in recent times and it appears that much work is still to complete in terms of the collection, so I look forward to returning to see this progress.  For now though there was an interesting collection with the outstanding highlight being the Bonsai section in the unusual Greenhouse.  This is impressive by any standards.  There was a beautiful exhibition of work by Paul den Hollandet and it was good to see the space being well used by school groups.  This is an asset to Barcelona and I look forward to future visits.", "publishedDate": "2013-10-03", "language": "en", "rating": 4}, {"id": 176425230, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d1553048-r176425230-Jardin_Botanico_de_Barcelona-Barcelona_Catalonia.html", "text": "A very short bus from the city centre, this is a great place to spend a few hours in the sun, taking in the huge variety of plants they have here. \n\nThe layout itself involves a lot of walking, but there are water points throughout the gardens. California appears to still be under construction. \n\nFree Entry with a BCN Card", "publishedDate": "2013-09-09", "language": "en", "rating": 4}, {"id": 165447533, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d1553048-r165447533-Jardin_Botanico_de_Barcelona-Barcelona_Catalonia.html", "text": "Being from California, we were excited to view the large space dedicated to California.  Turned out, most of the area for California had not been planted.  In the other parts, specimens were frequently repeated.  The pond near the entrance was in need of major maintenance.  Good thing there was a senior price for admission!  Don't go when it is hot.  There's not much shade on the pathways from 10:30 am to late afternoon.", "publishedDate": "2013-06-27", "language": "en", "rating": 3}, {"id": 162179038, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d1553048-r162179038-Jardin_Botanico_de_Barcelona-Barcelona_Catalonia.html", "text": "We only went because of the Barcelona card free entry, but it was well worth a visit. The range of plants is amazing, the colours and scents beautiful, and the views from the highest terraces are worth the climb.", "publishedDate": "2013-05-28", "language": "en", "rating": 4}, {"id": 161137243, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d1553048-r161137243-Jardin_Botanico_de_Barcelona-Barcelona_Catalonia.html", "text": "IT is hard for me to review because I cannot compare it to any other botanic garden - I have never been in one (or it was so long ago I don`t remember)\nBut I really enjoyed it - It was also in my Barcelona card \"free\" entrances coupon - so I had to go there.\nIt was very exotic for me - most of these plants I have never seen in my life - and they were just stunning - also the smells of some plants were amazing (I think they were blooming just in time)\nIt is very nice place to chill out - I was there on thursday afternoon and there was maybe 5-6 people beside me - very nice atmosphere - Unfortunately it is quite big - so I wasn`t able to get through all of it .", "publishedDate": "2013-05-19", "language": "en", "rating": 5}, {"id": 158491701, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d1553048-r158491701-Jardin_Botanico_de_Barcelona-Barcelona_Catalonia.html", "text": "This botanic garden is just ok. I have seen others which are bigger and the plants diversity is much more. There are a lot of green species but not many flowers in my opinion", "publishedDate": "2013-04-22", "language": "en", "rating": 3}, {"id": 153298160, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d1553048-r153298160-Jardin_Botanico_de_Barcelona-Barcelona_Catalonia.html", "text": "Definitely a place to go to when in Montjuïc. We strolled around during Feb when not many plants were in bloom but there was still a vast amount of plantation to see. A great selection from around the world, and set in fascinating settings with great views over Barcelona.\n\nWe got in free with the BCN card but for €3.50 entry, it is worth it for a peaceful afternoon.\n\nPerhaps worth noting, when we went in Feb, there was no exhibition or cafe open.", "publishedDate": "2013-02-27", "language": "en", "rating": 4}, {"id": 139814099, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d1553048-r139814099-Jardin_Botanico_de_Barcelona-Barcelona_Catalonia.html", "text": "Cheap entrance, that also allows you to come back any time on the same ticket within a year; or you can give it away to somebody else to use it.\n\nSeveral interesting trees and plants from all over the world, but nothing special Worth a visit before/after a visit to the olympic park or Montjuic Castle.", "publishedDate": "2012-09-09", "language": "en", "rating": 3}, {"id": 135174976, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d1553048-r135174976-Jardin_Botanico_de_Barcelona-Barcelona_Catalonia.html", "text": "I loved the plants, the way they were organized, the variety of plant species. The views on the city are great. I didn't like the concrete-rusty steel-sharp edges style of it, that kinda gave a bit of sterile look but it's just a matter of taste ;-)", "publishedDate": "2012-07-23", "language": "en", "rating": 4}, {"id": 132252491, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d1553048-r132252491-Jardin_Botanico_de_Barcelona-Barcelona_Catalonia.html", "text": "If you have enough time try no to miss a visit and a stroll through the Botanical Gardens of Barcelona. Can't miss them because there are right at the foot of Montjuic mountain - a short metro or bus ride. Once you get there - avoid doing this in summer: way too hot and muggy - take it easy. Walking paths are clearly marked (and most are paved, which is a pity). The walk is up-hill but non strenuous. Now, because this is a Mediterranean garden don't expect to find many flowers and pretty dainty roses and the like. No. The accent is on cactus and succulent plants. Trees such as pine and other Med species are everywhere to be seen. The views once you get to the top, are spectacular. Best time to visit is in autumm or early spring, and try and come early in the morning or before sunset. Great photos then.", "publishedDate": "2012-06-18", "language": "en", "rating": 4}]}}]