[{"locationId": 2625535, "name": "Parc de Cervantes", "placeType": "ATTRACTION", "reviewListPage": {"reviews": [{"id": 685914723, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d2625535-r685914723-Parc_de_Cervantes-Barcelona_Catalonia.html", "text": "Park de Cervantes is a medium size park in the city. Wonderful park to relax (it really quiet and not overcrowded), sit down on a bench under the pergola or shade of the trees and let zen come to you. The park has plants shrubberies surrounded by green hedges, trees, bushes, plants and lots of different roses. It's delighting for your eyes as well as for your nose", "publishedDate": "2019-07-02", "language": "en", "rating": 4}, {"id": 672983823, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d2625535-r672983823-Parc_de_Cervantes-Barcelona_Catalonia.html", "text": "Parc de Cervantes is a sizeable park in the city. It's very green with large areas of green hedges, trees, bushes, plants and predominantly roses. There are apparently huge numbers of different varieties of roses. It's an area of the city where you can go cycling, or for a walk, a run, a jog, or a picnic, or even you can play a game of your favourite sport. You can go there to just relax, a way from the hustle and bustle of noise and everyday traffic. Worth a visit.", "publishedDate": "2019-05-10", "language": "en", "rating": 4}, {"id": 580624968, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d2625535-r580624968-Parc_de_Cervantes-Barcelona_Catalonia.html", "text": "One of my favorite places in Barcelona, near from the Monastir de Pedralbes, when it's the time for the roses to flourish, a walk into this garden is a delight as well for the eyes as for the nose. You can have a great contemplative time and if the sun is too strong, have a nap under the pergola.", "publishedDate": "2018-05-16", "language": "en", "rating": 5}, {"id": 372761831, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d2625535-r372761831-Parc_de_Cervantes-Barcelona_Catalonia.html", "text": "If you like flowers you will definitely enjoy this park where hundreds of different types of roses grow. \nWhen I visited the park they had their annual new rose international contest which added some fun to this free attraction. \nJust make sure the season is right :-)", "publishedDate": "2016-05-14", "language": "en", "rating": 5}, {"id": 229389313, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d2625535-r229389313-Parc_de_Cervantes-Barcelona_Catalonia.html", "text": "The Cervantes Rose Garden is a beautiful park and is best seen during spring, when the roses are in bloom. The park is a restful place to visit by the Diagonal and one can climb the little hill, which has some good sights of the nearby buildings. This place is quite restful.", "publishedDate": "2014-09-17", "language": "en", "rating": 4}, {"id": 205827174, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d2625535-r205827174-Parc_de_Cervantes-Barcelona_Catalonia.html", "text": "A superb park with thousands of roses. in May and June you can spend hours to look at the roses and admire and smell them.\nA place to go when you need a quite place after busy visits", "publishedDate": "2014-05-16", "language": "en", "rating": 4}, {"id": 168495973, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d2625535-r168495973-Parc_de_Cervantes-Barcelona_Catalonia.html", "text": "This park featured beautifully maintained gardens and multiple walking trails/pathways.  Beautiful rose gardens. Good free wifi that allows voip/ traffic too. A nice place to walk around and relax. Easily accessible from Zona Universitaria metro station on thd L3 green line.", "publishedDate": "2013-07-21", "language": "en", "rating": 5}, {"id": 135970224, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d2625535-r135970224-Parc_de_Cervantes-Barcelona_Catalonia.html", "text": "This is a bit out of the way. But if you have been to the Barcelona stadium you can walk there in 10-15 minutes. There is a huge variety of roses, and it is very peaceful, as it seems not many people come here. It is also only two minutes walk from the Universitat metro stop. I would recommend a visit.", "publishedDate": "2012-08-01", "language": "en", "rating": 5}]}}]