[{"locationId": 4106898, "name": "Diagonal Mar Centro Comercial", "placeType": "ATTRACTION", "reviewListPage": {"reviews": [{"id": 741641769, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d4106898-r741641769-Diagonal_Mar_Centro_Comercial-Barcelona_Catalonia.html", "text": "One incredible mall ever , everything you need find everything there ❤️it took us 2 days to fully see everything ", "publishedDate": "2020-01-27", "language": "en", "rating": 5}, {"id": 740817414, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d4106898-r740817414-Diagonal_Mar_Centro_Comercial-Barcelona_Catalonia.html", "text": "The Mall is situated across from the Hilton Diagonal and has almost everything you need including a huge supermarket with lots of choices of food, alcohol, clothes hardware and more.\nThere are lots of restaurants including all the fast food chain restaurants as well as more bespoke and interesting eating places.\nThe Mall is immaculate and all leading brand clothes shops are in abundance. If you want to spend time there then almost everything is available.", "publishedDate": "2020-01-23", "language": "en", "rating": 4}, {"id": 738740042, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d4106898-r738740042-Diagonal_Mar_Centro_Comercial-Barcelona_Catalonia.html", "text": "Definitely worth a visit. Nice outside area and easy to get around. Close to metro so easy to access", "publishedDate": "2020-01-12", "language": "en", "rating": 4}, {"id": 738419647, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d4106898-r738419647-Diagonal_Mar_Centro_Comercial-Barcelona_Catalonia.html", "text": "Nice mall, near to the beach, great food options and shopping choices  beautifully decorated, a bit expensive though.", "publishedDate": "2020-01-11", "language": "en", "rating": 5}, {"id": 732238258, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d4106898-r732238258-Diagonal_Mar_Centro_Comercial-Barcelona_Catalonia.html", "text": "Big Spanish mall with many shops and places to eat. A little bit pricy, but totally accessible and modern.", "publishedDate": "2019-12-12", "language": "en", "rating": 5}, {"id": 726921955, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d4106898-r726921955-Diagonal_Mar_Centro_Comercial-Barcelona_Catalonia.html", "text": "This is a large shopping Mall - very impressive - its very clean, not too crowded and good selection of stores and restaurants. Highly recommended - they have a small food court and high end restaurants at the top floor (with outside seating) - was very impressed", "publishedDate": "2019-11-16", "language": "en", "rating": 5}, {"id": 724222997, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d4106898-r724222997-Diagonal_Mar_Centro_Comercial-Barcelona_Catalonia.html", "text": "A big mall with a unique layout - most of the food stores are on the one level with other shops spread throughout including Primark and other speciality stores.", "publishedDate": "2019-11-05", "language": "en", "rating": 5}, {"id": 718095525, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d4106898-r718095525-Diagonal_Mar_Centro_Comercial-Barcelona_Catalonia.html", "text": "Name brand stores, many food places, fast and casual dining.  Not too many sales but some discounts at certain places.  Pretty far out from the downtown in a newer development area,  but just a Metro ticket away from anywhere, and close to the end of the Barcelona beach strip.  Service desk gives discount card for select stores and gifts (Perpetua pencils and canvas bags) for tourists with the right coupon.", "publishedDate": "2019-10-13", "language": "en", "rating": 4}, {"id": 703918085, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d4106898-r703918085-Diagonal_Mar_Centro_Comercial-Barcelona_Catalonia.html", "text": "Diagonal Mall is one of the biggest mall in Barcelona. It has a lot of shops offering local and international brands. At the same time there is huge option for food and drinks. The multiplex offers new movies and opera and ballet shows. The service standard of the mall is top class. They have got the parking facility for 5000 cars with 3 hours free. Beside they have got 64 family sized parking spots and 54 specializes places for disabled people, great. There is a big area specially for children's entertainment. \nThe shops are open from Monday to Saturday 9 to 9. Restaurants and leisure activities are open till 1 AM on weekdays and up to 3 on weekends and holidays. \nWorth visiting !!", "publishedDate": "2019-08-28", "language": "en", "rating": 5}, {"id": 703156841, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d4106898-r703156841-Diagonal_Mar_Centro_Comercial-Barcelona_Catalonia.html", "text": "Seemed like a nice place, but all of the shops were closed & only the food court was open. I don’t recommend going on a Sunday unless you want to go to a food court!", "publishedDate": "2019-08-26", "language": "en", "rating": 3}, {"id": 689944869, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d4106898-r689944869-Diagonal_Mar_Centro_Comercial-Barcelona_Catalonia.html", "text": "We stayed across the street at the Hilton. This mall was super convenient for us with lots of restaurant choices.  The stores we nice as well and there is an Al Campo store in the bottom.  There is a nice play area for children.", "publishedDate": "2019-07-15", "language": "en", "rating": 4}, {"id": 689296264, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d4106898-r689296264-Diagonal_Mar_Centro_Comercial-Barcelona_Catalonia.html", "text": "Diagonal Mar Centro Comercial is a large shopping centre in the east of Barcelon, close to the beaches. There's the usual suspects of high street brands, both local and international, plus cafes and restaurants. It's an interesting diversion if you staying close by or visiting the beaches.", "publishedDate": "2019-07-13", "language": "en", "rating": 4}, {"id": 676332285, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d4106898-r676332285-Diagonal_Mar_Centro_Comercial-Barcelona_Catalonia.html", "text": "I don’t think there is anything spectacular about this mall to be honest, it’s handy if your in the area as there is a supermarket, Primark and I liked the shop Lefties but I was a bit bored and left without buying anything. Just don’t go out your way to visit, is all I can say. ", "publishedDate": "2019-05-25", "language": "en", "rating": 3}, {"id": 673195826, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d4106898-r673195826-Diagonal_Mar_Centro_Comercial-Barcelona_Catalonia.html", "text": "Diagonal mar mall is agreat solution for sjoppong and dinning with the kids. There are the major brands as primark and aH&m, and there are varity of dining, all kinds, getting there is very easy by the metro so enjoy", "publishedDate": "2019-05-11", "language": "en", "rating": 5}, {"id": 671522743, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d4106898-r671522743-Diagonal_Mar_Centro_Comercial-Barcelona_Catalonia.html", "text": "Very good shopping centre,\n\nOnly really went for the Primark and Supermarket. \n\nReally good prices and easy to find. Looks brilliant inside and out ", "publishedDate": "2019-05-05", "language": "en", "rating": 5}, {"id": 665078344, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d4106898-r665078344-Diagonal_Mar_Centro_Comercial-Barcelona_Catalonia.html", "text": "This shopping centre is in three levels with major brands, many international restaurants and budget local shops make a good half day shopping experience convenient and comfortable. \n\nWe had breakfast at a local cafe, ice cream at a Swiss brand, lunch at a halal place and ice cream again at an Italian brand, \n\nAll were very good \n\nBig supermarket in the lower floor with groceries and budget /affordable prices for clothing...etc\n\nPlaying ground for kids in and out the centre as well as good toilets service and vending machines", "publishedDate": "2019-04-09", "language": "en", "rating": 5}, {"id": 664441254, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d4106898-r664441254-Diagonal_Mar_Centro_Comercial-Barcelona_Catalonia.html", "text": "Shopping mall Diagonal mar is close to the tube station and number of tram and bus lines. Plenty of food outlets as well as fashion brands are represented. Large food store with friendly staff.", "publishedDate": "2019-04-07", "language": "en", "rating": 4}, {"id": 663546365, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d4106898-r663546365-Diagonal_Mar_Centro_Comercial-Barcelona_Catalonia.html", "text": "Good commercial mall with many different brands and shops that you can buy anything,located on diagonal street and near the el maresme  forum metro station,", "publishedDate": "2019-04-03", "language": "en", "rating": 4}, {"id": 658270021, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d4106898-r658270021-Diagonal_Mar_Centro_Comercial-Barcelona_Catalonia.html", "text": "Staying in the Barcelona Princess which adjoins the mall.  A big place with a huge outdoor food court + a huge number of shops.   Well laid out and easy to get around.", "publishedDate": "2019-03-13", "language": "en", "rating": 4}, {"id": 638871946, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d4106898-r638871946-Diagonal_Mar_Centro_Comercial-Barcelona_Catalonia.html", "text": "Right in the heart of the new business area of Barcelona, Diagonal Mar is Catalunya’s biggest shopping centre.\n\nThere are lots of things to do in and around Diagonal Mar: it’s right next to the CCIB (International Conventions Centre of Barcelona), where nearly every week there are international exhibitions and conventions.\n\nIn the centre, there is not only a great selection of the best Spanish and international fashion chains like Primark, Zara and H&M, but 18 cinema screens and a bowling alley too. When you're peckish from all that retail therapy, choose from an array of excellent restaurants, some of which are in the spacious outdoor terrace.", "publishedDate": "2018-12-11", "language": "en", "rating": 5}, {"id": 637863572, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d4106898-r637863572-Diagonal_Mar_Centro_Comercial-Barcelona_Catalonia.html", "text": "The mall has a very good variety of shops and restaurants indoor/outdoor, cinema, a two-story supermarket and there's free wifi!", "publishedDate": "2018-12-06", "language": "en", "rating": 4}, {"id": 637350878, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d4106898-r637350878-Diagonal_Mar_Centro_Comercial-Barcelona_Catalonia.html", "text": "A more familiar feel of shopping for Asians, as there are plenty of well-known and affordable fast fashion brands housed a stone’s throw away from the city hustle. \n\nBig deprtment store/hypermarket is a bonus to stock up on travelling/snacking essentials. Speaking of snacking, food options abound at the terrace area where you could choose to dine indoors or al fresco, depending on your cuisine selection.\n\nHaving Five Guys is a huge plus point personally, as their sausages (and unlimited toppings) are causes of crave concerns!", "publishedDate": "2018-12-03", "language": "en", "rating": 4}, {"id": 635263117, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d4106898-r635263117-Diagonal_Mar_Centro_Comercial-Barcelona_Catalonia.html", "text": "We were staying in AC Forum, opposite the Mall..We used to drop by to pick up our sandwiches and small items...Nice and Clean and a big Mall..Lots of restaurants in the Mall too...", "publishedDate": "2018-11-23", "language": "en", "rating": 4}, {"id": 631684910, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d4106898-r631684910-Diagonal_Mar_Centro_Comercial-Barcelona_Catalonia.html", "text": "Was staying at the Hilton hotel opposite with my teenage daughter the end of October over Halloween.\n\nWe had a day of miserable weather so decided to spend the morning here.\n\nThis is a lovely clean airy mall with a fantastic two storey supermarket. This was a great place to buy drinks and snacks for our room.\n\nThere were a wide choice of clothing shops both designer and European chain shops such as H and M, Zara, Pull and bear, Bershka ,Sephora and Primark.\n\nThere was also a pharmacy and a large food court.\n\nA really lovely Mall and my daughter and I thoroughly enjoyed shopping here.", "publishedDate": "2018-11-07", "language": "en", "rating": 5}, {"id": 629430567, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d4106898-r629430567-Diagonal_Mar_Centro_Comercial-Barcelona_Catalonia.html", "text": "We were staying at the Hilton across the road from this Mall mid October & used it several times a day to walk through it to the closest Metro.\n\nI don't do shopping, but my wife thought it was quite nice, although a lot of the stores were the same as the UK ones (Zara etc), so didn't spend a lot of time there.\n\nI have to say though, there is a 2 storey supermarket which is quite possibly the biggest supermarket I have ever been in & they seemed to stock every typre of every food available anywhere!\n\nThe Mall was very clean, the guards were wandering around making sure everything was okay, there were no crowds (possibly due to being during the week & mid October) and we ate some delicious crepes there (twice) and a nice Japanese meal (where the waiters spoke no English, so that was quite lighthearted & fun)!\n\nAt the end of the day, it's a shopping mall & shopping malls are shopping malls wherever you go, but it WAS nice & relaxing to wander through to get to where we needed to go.", "publishedDate": "2018-10-29", "language": "en", "rating": 4}, {"id": 626192423, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d4106898-r626192423-Diagonal_Mar_Centro_Comercial-Barcelona_Catalonia.html", "text": "Came across this shopping mall quite by accident during a Barcelona Touristic Bus Trip where one hopped off at a bus station next to this mall – to have lunch before setting off on our travels. \n\nFrom what I could see this is a large shopping centre, which looked quite ok with average / unknown brands (possibly because I am from the UK). I can tell that this shopping centre is not by any means a tourist attraction (as I was on vacation) and it would appear that the shopping mall is certainly suited to the local community.", "publishedDate": "2018-10-18", "language": "en", "rating": 3}, {"id": 623131188, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d4106898-r623131188-Diagonal_Mar_Centro_Comercial-Barcelona_Catalonia.html", "text": "This mall cum shopping complex was very near to hotel and you can come by metro or bus , under one roof you get everything, one of the best malls ", "publishedDate": "2018-10-08", "language": "en", "rating": 4}, {"id": 621299179, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d4106898-r621299179-Diagonal_Mar_Centro_Comercial-Barcelona_Catalonia.html", "text": "Huge number of upscale, chain, and unique boutiques. Great location. Very adequate food court with outdoor seating at some of restaurants/ bars.", "publishedDate": "2018-10-02", "language": "en", "rating": 4}, {"id": 618434475, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d4106898-r618434475-Diagonal_Mar_Centro_Comercial-Barcelona_Catalonia.html", "text": "Not a bad mall, has all the necessary close to the beach and metro, tram and bus. Nice places to eat, and catch a movie. ", "publishedDate": "2018-09-21", "language": "en", "rating": 3}, {"id": 604017842, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d4106898-r604017842-Diagonal_Mar_Centro_Comercial-Barcelona_Catalonia.html", "text": "We nipped in and came out with full bags. food hall is a must. loads of places to eat,and good shopping too.", "publishedDate": "2018-08-07", "language": "en", "rating": 4}, {"id": 600211550, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d4106898-r600211550-Diagonal_Mar_Centro_Comercial-Barcelona_Catalonia.html", "text": "This shopping mall is ok if you are doing some shopping.  Great make-up stores and most clothing stores are fairly good. The best part is the food floor giving you some variety. The shopping centre itself has a nice layout and is lovely to walk through.", "publishedDate": "2018-07-27", "language": "en", "rating": 3}, {"id": 598868736, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d4106898-r598868736-Diagonal_Mar_Centro_Comercial-Barcelona_Catalonia.html", "text": "We stayed at the Hilton Diagnal Mar for 3 nights at the end of June. We ate at the restaurants at the front of the shopping center on 3 occasions. The food was reasonable priced and tasty. We also did some shopping and picked up things we needed in the centre.", "publishedDate": "2018-07-23", "language": "en", "rating": 4}, {"id": 585203860, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d4106898-r585203860-Diagonal_Mar_Centro_Comercial-Barcelona_Catalonia.html", "text": "Fantastic Huge mall & good place to shop anything to everything under one big roof. Contains many restaurants fast food or fine dining with variety of delicacies. There is  a vegetarians restaurant as well. The mall has majority of international brands & hypermarket Alcampo to buy kids toys etc. PRIMARK was good to buy various trendy stuff for all ages with good quality with reasonable low prices (Real SALE).", "publishedDate": "2018-06-04", "language": "en", "rating": 5}, {"id": 581807990, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d4106898-r581807990-Diagonal_Mar_Centro_Comercial-Barcelona_Catalonia.html", "text": "Supermarket and so many great shops, ie. Desigual, Zara, etc. Many floors of shops and all types of restaurants.", "publishedDate": "2018-05-21", "language": "en", "rating": 4}, {"id": 575781022, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d4106898-r575781022-Diagonal_Mar_Centro_Comercial-Barcelona_Catalonia.html", "text": "Only the food shops were open on Sunday but very clean mall with modern stores that had great displays.", "publishedDate": "2018-04-26", "language": "en", "rating": 4}, {"id": 571444003, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d4106898-r571444003-Diagonal_Mar_Centro_Comercial-Barcelona_Catalonia.html", "text": "A relatively new shopping centre 3 levels of stores A huge good court that caters for almost every choice of food Good for shopping, good for food and free WiFi too ", "publishedDate": "2018-04-06", "language": "en", "rating": 4}, {"id": 566359676, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d4106898-r566359676-Diagonal_Mar_Centro_Comercial-Barcelona_Catalonia.html", "text": "A mall that is also offering a fantastic view on the sea. If you want shopping and still enjoy Barcelona, I rank this second after el corte ingles las ramblas. ", "publishedDate": "2018-03-13", "language": "en", "rating": 5}, {"id": 562059512, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d4106898-r562059512-Diagonal_Mar_Centro_Comercial-Barcelona_Catalonia.html", "text": "Decent place to go, a lot of options for food, and a lot of options to spend the euros. too bad we discovered this mall on the tail end of the holiday. They have a Vapianos.", "publishedDate": "2018-02-21", "language": "en", "rating": 5}, {"id": 558518303, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d4106898-r558518303-Diagonal_Mar_Centro_Comercial-Barcelona_Catalonia.html", "text": "We visited when the Christmas decorations were up and it was lovely. They’ve got shops like primark and lush, and natura, which I love. They also have the area of restaurants. ", "publishedDate": "2018-02-05", "language": "en", "rating": 5}, {"id": 557359621, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d4106898-r557359621-Diagonal_Mar_Centro_Comercial-Barcelona_Catalonia.html", "text": "I got robbed in the mall and when i went to the infodesk, they did nothing . They only called the security and they did not even fill in a complain form or took out contacts. They only said , go to police make a report ?!?!?! ", "publishedDate": "2018-01-30", "language": "en", "rating": 1}, {"id": 556282661, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d4106898-r556282661-Diagonal_Mar_Centro_Comercial-Barcelona_Catalonia.html", "text": "Right across my house, i am going quite often to this mall. It has all necessary shops from cosmetics to hosiery to Al Campo which is a big supermarket offering fresh fish in the lower floor, even flowers and some household electronics. \nThe clothes stores aren’t that great mostly low to mid range. All major telecommunication companies have their store there. \nParking is free for 3 hours. Floor -3 has a car wash - inside and outside 45€ for a SUV. \nThe mall also has a pet shop (they sell dog puppies too 😡) and fishes. \nYou can find some stores with house decoration - Muy Mucho etc. \nThe upper floor is full of restaurants. The ones inside are mostly fast food. Outside is more of a better dining. ", "publishedDate": "2018-01-25", "language": "en", "rating": 4}, {"id": 550291230, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d4106898-r550291230-Diagonal_Mar_Centro_Comercial-Barcelona_Catalonia.html", "text": "This one is placed near the beach so you can enjoy both shopping and the sea. It has a very fine selection of shops and restaurants where you can indulge yourself.", "publishedDate": "2017-12-30", "language": "en", "rating": 4}, {"id": 540606829, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d4106898-r540606829-Diagonal_Mar_Centro_Comercial-Barcelona_Catalonia.html", "text": "It's like any US mall, suit to tourists that are looking for the same kind of stores everywhere. It`s true too that locals go to low cost stores and the supermarket. The open spaces (outside near the sea) are good for take a coffee", "publishedDate": "2017-11-13", "language": "en", "rating": 3}, {"id": 538440627, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d4106898-r538440627-Diagonal_Mar_Centro_Comercial-Barcelona_Catalonia.html", "text": "Located far away from the old city and the touristic area. Many brands but most of them \"cheap\" and not exciting. Only Primark is worth visiting for those who like this low value/cost store", "publishedDate": "2017-11-05", "language": "en", "rating": 2}, {"id": 525940205, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d4106898-r525940205-Diagonal_Mar_Centro_Comercial-Barcelona_Catalonia.html", "text": "Wide range of shops to suit all tastes along with some excellent places to eat.\n\nIf you are only visiting Barcelona for a day you may not want to spend it in a shopping centre, however if you are on a short break and wanting to do some shopping this place is a must.\n\nBest to avoid a Saturday as it gets extremely busy", "publishedDate": "2017-09-20", "language": "en", "rating": 4}, {"id": 524925098, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d4106898-r524925098-Diagonal_Mar_Centro_Comercial-Barcelona_Catalonia.html", "text": "Excellent shops and restaurants in the complex.  Good way to escape the congress centre if you want to do some shopping.  One of the sport shops in Level 1 had some good discounts as well as tax free shopping if your meet the minimum purchase.  The roof top restaurants are also excellent.", "publishedDate": "2017-09-16", "language": "en", "rating": 5}, {"id": 523960308, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d4106898-r523960308-Diagonal_Mar_Centro_Comercial-Barcelona_Catalonia.html", "text": "A very big mall with lots of shops and restaurants, you need a minimum of 3 hrs there. But the problem is that all the restaurants staff there couldn't help us, they don't speak English and we struggled to order and ended up ordering whatever", "publishedDate": "2017-09-13", "language": "en", "rating": 4}, {"id": 520101570, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d4106898-r520101570-Diagonal_Mar_Centro_Comercial-Barcelona_Catalonia.html", "text": "This centre has lots of shopping for  all your needs. Currently undergoing some work but that does not impact on all the shops which there are a large selection of. Has a huge alcampo supermarket which has everything in it. \n\nThere are lots of restaurants and a cinema too. \nGreat place if you are in the area or if you prefer not to shop amongst hoards of tourists. ", "publishedDate": "2017-08-31", "language": "en", "rating": 5}, {"id": 517918356, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d4106898-r517918356-Diagonal_Mar_Centro_Comercial-Barcelona_Catalonia.html", "text": "Got a taxi to Mall following a disappointing trip to maremagnum.\nGood choice of shops and food places. \nNot over big so managed to get round in a few hours. \nNo high end stores but I bought plenty!", "publishedDate": "2017-08-27", "language": "en", "rating": 4}, {"id": 516844989, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d4106898-r516844989-Diagonal_Mar_Centro_Comercial-Barcelona_Catalonia.html", "text": "A huge and amazing shopping center.\nEndless shopping, entertainment and attraction possibilities including restaurants and cafes - worth a visit for at least two hours.", "publishedDate": "2017-08-23", "language": "en", "rating": 5}, {"id": 508613953, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d4106898-r508613953-Diagonal_Mar_Centro_Comercial-Barcelona_Catalonia.html", "text": "The Diagonal Mar Centro Comercial is the largest shopping centre in Catalunia of offers all you can wish from a shopping mall. It is situated in the Northern part of Barcelona (approx. 5 km from the centrum) and close to the beach and a harbor. You. An thus enjoy some shopping and food in an A/C environment if you need a break from sunbathing.\n\nLate July the sale starts and you can get some great bargains.\n\nThere are great public transportation ti the area and centre.", "publishedDate": "2017-08-03", "language": "en", "rating": 3}, {"id": 508544128, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d4106898-r508544128-Diagonal_Mar_Centro_Comercial-Barcelona_Catalonia.html", "text": "This shopping centre is conveniently located by a tram stop. Here you can find good shopping places and a huge supermarket. Great if you want to bring a picnic to the beach!", "publishedDate": "2017-08-03", "language": "en", "rating": 5}, {"id": 506946189, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d4106898-r506946189-Diagonal_Mar_Centro_Comercial-Barcelona_Catalonia.html", "text": "Amazing place to stop by and shop in Barcelona, also the variety of options available made it a one stop location where you can shop for food, dine at a restaurant and even buy cloth and electronics.\nPrices are really affordable and you can find a great deals there.", "publishedDate": "2017-07-29", "language": "en", "rating": 4}, {"id": 500251871, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d4106898-r500251871-Diagonal_Mar_Centro_Comercial-Barcelona_Catalonia.html", "text": "The Mall is not open on a Sunday for shopping, but most of the food outlets are open on a Sunday.\n\n3F is mainly food and there are some good selections both inside and outside.\n\nShopping has a wide variety from Zara, H & M and other mid-sized fashion outlets to a massive Supermarket on levels 1 and 2.\n\nGood Shopping Mall to spend 2-3 hours and reasonably priced with a good selection of shops.", "publishedDate": "2017-07-10", "language": "en", "rating": 4}, {"id": 489275653, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d4106898-r489275653-Diagonal_Mar_Centro_Comercial-Barcelona_Catalonia.html", "text": "All major Spain brands were available. Easy & comfortable shopping. Many good eatery places ......you can pass many hours. ", "publishedDate": "2017-05-30", "language": "en", "rating": 4}, {"id": 484665705, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d4106898-r484665705-Diagonal_Mar_Centro_Comercial-Barcelona_Catalonia.html", "text": "I stayed at a hotel close to this mall and visited it about 8 times to eat there. The most notable thing about this place for me were the outdoor restaurants, not necessarily for the food but for the ambiance and to enjoy the sunshine in Barcelona.", "publishedDate": "2017-05-16", "language": "en", "rating": 3}, {"id": 474379034, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d4106898-r474379034-Diagonal_Mar_Centro_Comercial-Barcelona_Catalonia.html", "text": "I like the variety of shops and restaurants.  I can usually find what I need here, but it can be a little pricey.  I wish it had free wifi like it used to.", "publishedDate": "2017-04-10", "language": "en", "rating": 4}, {"id": 468444893, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d4106898-r468444893-Diagonal_Mar_Centro_Comercial-Barcelona_Catalonia.html", "text": "I haven't find anything peculiar in this place, it is a huge shopping center for everyone. I found it little bit pricey, but this is probably just a Barcelonian feature...", "publishedDate": "2017-03-18", "language": "en", "rating": 3}, {"id": 461651531, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d4106898-r461651531-Diagonal_Mar_Centro_Comercial-Barcelona_Catalonia.html", "text": "no need to search for brands you have most of them in one place plus primark for those who have limited financial resources", "publishedDate": "2017-02-21", "language": "en", "rating": 3}, {"id": 461178001, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d4106898-r461178001-Diagonal_Mar_Centro_Comercial-Barcelona_Catalonia.html", "text": "Been here many times to do some shopping, dining & for entertainment. Pretty much has all you need for a day out...shops, restaurants, arcade, bowling and a cinema. Definitely recommend a visit especially on a rainy day. ", "publishedDate": "2017-02-19", "language": "en", "rating": 5}, {"id": 455463264, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d4106898-r455463264-Diagonal_Mar_Centro_Comercial-Barcelona_Catalonia.html", "text": "Nice. Very big. All brands are there. The only reason to get there is primark. All the ather shops you can find on the rambla", "publishedDate": "2017-01-28", "language": "en", "rating": 4}, {"id": 454137067, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d4106898-r454137067-Diagonal_Mar_Centro_Comercial-Barcelona_Catalonia.html", "text": "It's a bit off the city and long way but it's a must to visit in my opinion. You have all the major brands under one roof. Great prices. Good food court and also a big gaming arena with bowling and all sorts of games. It's really good if you have kids. \n\nIt's indoors so whether it's hot or cold you'd be cosy. \n\nYou can easily spend 3-4 hours here and enjoy every moment of it. \n\nIt also has a huge super market grocery store sort which is good too. \n\nJust don't shop at inglot. They don't tell you that you can't return stuff and then when you go they call the security on you. \n\nSo whenever you go in Barcelona and whatever you wanna buy ask them before bout the return policy. They have weird standards. Not like the usual European standard of returning within 30 days of you have receipt. ", "publishedDate": "2017-01-22", "language": "en", "rating": 4}, {"id": 447538921, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d4106898-r447538921-Diagonal_Mar_Centro_Comercial-Barcelona_Catalonia.html", "text": "This place had everything. From Doctors office to dry cleaners. It has all walks of life in the mall. I saw men in suits, women in evening gowns, and parents with children riding in remote controlled cars. The one thing I was shocked at was the adult-orientated shops with items visible by all. I am not a prude by any means. But, I live in the south and that would just not be allowed. Also, I have never seen beer/wine sold in McDonald's. \nBut, if you have an hour or two stop by and check it out. One hint, if you go to the Grocery store, DO NOT walk out though a empty check-out lane . I nearly caused a international incident.", "publishedDate": "2016-12-29", "language": "en", "rating": 4}, {"id": 444968411, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d4106898-r444968411-Diagonal_Mar_Centro_Comercial-Barcelona_Catalonia.html", "text": "This is the most extreme place in the city where you can find extra-posh people shopping (clients from nearby hotels) to the lowest class, acting like crazy people in Primark.\nThe only good thing is the supermarket that is huge... The rest is not for me. \nIf you like hearing children screaming, this is your place! \n\nThe only shop where we had amazing staff was Rituals... They were really nice and professionals.", "publishedDate": "2016-12-18", "language": "en", "rating": 1}, {"id": 443219282, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d4106898-r443219282-Diagonal_Mar_Centro_Comercial-Barcelona_Catalonia.html", "text": "When you walk in, go to the customer service to pick up your coupon book and your free gift.  We got a nice bag with a nice design on the back.  The shops here are very affordable and the clothes are very nice.  Also, there is a food court, inside and a grocery store.", "publishedDate": "2016-12-09", "language": "en", "rating": 5}, {"id": 443142078, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d4106898-r443142078-Diagonal_Mar_Centro_Comercial-Barcelona_Catalonia.html", "text": "This is probably the best mall in Barcelona and great for all the brands you need. There are some very good food courts and a nice play area for kids. If you want to shop beyond souvenirs, this is the place to go. Easily accessible on the metro or you can stroll for about 35 min  from Placa de Catalunya along Diagonal towards the sea.", "publishedDate": "2016-12-09", "language": "en", "rating": 4}, {"id": 442157643, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d4106898-r442157643-Diagonal_Mar_Centro_Comercial-Barcelona_Catalonia.html", "text": "There is an ap for duty free shopping, make sure you get everything over 95.00 stamped by the store to apply for your tax refund! We found the global blue refund line at the Madrid airport was very long, was easier to get the refund in the London airport. Make sure to also get it stamped by customs and have all your forms filled out BEFORE you get in line for your refund.", "publishedDate": "2016-12-05", "language": "en", "rating": 4}, {"id": 441877173, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d4106898-r441877173-Diagonal_Mar_Centro_Comercial-Barcelona_Catalonia.html", "text": "Has all the known brands, nice food court on the 3rd floor. Was exactly good when the it was raining outside but still shopping left to do before leaving.", "publishedDate": "2016-12-04", "language": "en", "rating": 4}, {"id": 435105055, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d4106898-r435105055-Diagonal_Mar_Centro_Comercial-Barcelona_Catalonia.html", "text": "One of the best mall i have ever visited in Barcelona. Its nearby CCIB. Nice outdoor, lot of restaurants inside the mall and movie as well. ", "publishedDate": "2016-11-06", "language": "en", "rating": 4}, {"id": 431880556, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d4106898-r431880556-Diagonal_Mar_Centro_Comercial-Barcelona_Catalonia.html", "text": "Its much better than years ago, the outdoor area is very nice, also for children.\nYou can find everything in this center.\nAnd the biiig AlCampo is great.", "publishedDate": "2016-10-26", "language": "en", "rating": 5}, {"id": 430694803, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d4106898-r430694803-Diagonal_Mar_Centro_Comercial-Barcelona_Catalonia.html", "text": "This is possibly the best mall I have been to in Barcelona, it has everything you need from clothing to household items. It has Primark, Al campo, Pull and Bear and so much more. It also has a great selection of restaurants", "publishedDate": "2016-10-22", "language": "en", "rating": 5}, {"id": 424176036, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d4106898-r424176036-Diagonal_Mar_Centro_Comercial-Barcelona_Catalonia.html", "text": "Diagonal is definitively an upper area of Barcelona as such this mall is more high-end with less tourists", "publishedDate": "2016-10-01", "language": "en", "rating": 4}, {"id": 422075874, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d4106898-r422075874-Diagonal_Mar_Centro_Comercial-Barcelona_Catalonia.html", "text": "This is a mid-sized mall. Plenty of casual clothe brands. And food court area. Nice place to spend few hours if you are near by.", "publishedDate": "2016-09-25", "language": "en", "rating": 4}, {"id": 418267119, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d4106898-r418267119-Diagonal_Mar_Centro_Comercial-Barcelona_Catalonia.html", "text": "The shopping centre is a welcome hub of activity if you crave the city centre while getting bored by the hotel pool or beach. The mall has the usual big chain shops, Primark, Zara, Fnac at quite high prices, and the majority of restaurants are mediocre, except for the japanese sushi place (Front left) which was ok.\n\nHowever the highlight of the Mall was the Giovanni ice cream parlour on the third floor, serving the best dark chocolate ice cream I gave tasted anywhere. As a choc and ice cream aficionado this particular brand beats Ben & Jerry's, Haagen Daz and even BR, hands down. \nThis is just perfection, and was my daily stop. \n\nIf you are studying at any of the hotels nearby, note that your minibar likely won't have  Diet Pepsi, but there is a supermarket in this mall where you can stock up with mini bottles that will fit in your minibar fridge. \n\nIt's a real shame we don't have Giovanni in London, particularly near the train stations in the hot summers. ", "publishedDate": "2016-09-13", "language": "en", "rating": 4}, {"id": 417382677, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d4106898-r417382677-Diagonal_Mar_Centro_Comercial-Barcelona_Catalonia.html", "text": "Huge shopping mall opening from 10-10pm. 5 mins walk from El Maresme | Forum station. Major shops and huge 2 level supermarket. Must try the Ibericus specialty shop at the basement level for the famous Ibericio pork buns. Food court and cinema on the top level. Can buy some good value for money Ibericio pork in the supermarket as well. Could easily spend the whole day shopping here!", "publishedDate": "2016-09-12", "language": "en", "rating": 5}, {"id": 415905860, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d4106898-r415905860-Diagonal_Mar_Centro_Comercial-Barcelona_Catalonia.html", "text": "Diagonal Mar is a pleasant place to go shop or spend a few hours in Barcelona. It has a variety of stores and the layout makes it easy to visit. The food court offers a good selection but Americans will find their McDonald's quite a bit more expensive than what they are used to. Maybe that'll make them try something else for once. ", "publishedDate": "2016-09-07", "language": "en", "rating": 4}, {"id": 414238228, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d4106898-r414238228-Diagonal_Mar_Centro_Comercial-Barcelona_Catalonia.html", "text": "I agree with most comments below - the centre is big, the food court has lots of choices, and the air-con was reasonable on the day we were there (max temp 28 degrees, max humidity 80%). If you're arriving by metro on Line 4, leave the station via the escalator and do a 180 degree turn at the top. Walking for a few minutes will bring you to a pedestrian crossing, look left and you will see the big Diagonal Mar sign over the entrance. The crossing takes you to the door. ", "publishedDate": "2016-09-03", "language": "en", "rating": 4}, {"id": 413590285, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d4106898-r413590285-Diagonal_Mar_Centro_Comercial-Barcelona_Catalonia.html", "text": "Nice mall with all the necessary with a bowling alley and arcade games along with many restaurants Japan restaurant burger king Korean restaurant Starbucks big supermarket on two floors and many clothing brands ideal to spend a day inside ", "publishedDate": "2016-09-01", "language": "en", "rating": 5}, {"id": 413440936, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d4106898-r413440936-Diagonal_Mar_Centro_Comercial-Barcelona_Catalonia.html", "text": "This mall is good for general shopping. It has the usual chains, a good supermarket that is pretty cheap and loads of places to eat, not just MacDonalds! But lots of tapas places. It's a bit expensive and not as good as the more local bars or small restaurants. Close to conference centre and beach", "publishedDate": "2016-09-01", "language": "en", "rating": 4}, {"id": 412844410, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d4106898-r412844410-Diagonal_Mar_Centro_Comercial-Barcelona_Catalonia.html", "text": "Shops that cater for everybody. Children and adult clothing and shoe shops.  Fast food places on the top floor. The restaurants in the outdoor area are very good. Great service. Delicious food", "publishedDate": "2016-08-30", "language": "en", "rating": 3}, {"id": 410624397, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d4106898-r410624397-Diagonal_Mar_Centro_Comercial-Barcelona_Catalonia.html", "text": "Besides the fact that was very busy (sumemer season) it was very nice. A good hotel and tye access to the swimmin pool area is a plus in the stay. I strongly recommend.", "publishedDate": "2016-08-25", "language": "en", "rating": 5}, {"id": 409059739, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d4106898-r409059739-Diagonal_Mar_Centro_Comercial-Barcelona_Catalonia.html", "text": "There are restaurants and stores in this shopping center. Not a great tourist attraction but I can see the appeal/convenience for a local.", "publishedDate": "2016-08-22", "language": "en", "rating": 3}, {"id": 408469547, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d4106898-r408469547-Diagonal_Mar_Centro_Comercial-Barcelona_Catalonia.html", "text": "This place was a great little cafe with some\nGood deserts and sweets. Place is very clean and the prices are not high at all. If you are in barclona you should\nDef try it ", "publishedDate": "2016-08-21", "language": "en", "rating": 5}, {"id": 407168099, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d4106898-r407168099-Diagonal_Mar_Centro_Comercial-Barcelona_Catalonia.html", "text": "Needed a break from the Barcelona summer heat and kids wanted to go to a mall. Saw this one on line and was near to our hotel. Very nice mall with many well known stores. Good place to spend a few hours.", "publishedDate": "2016-08-18", "language": "en", "rating": 4}, {"id": 405170975, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d4106898-r405170975-Diagonal_Mar_Centro_Comercial-Barcelona_Catalonia.html", "text": "Good place for shopping. Has Primark. Children have place to play. Parking is big enough and 3 hours are without payment. ", "publishedDate": "2016-08-14", "language": "en", "rating": 4}, {"id": 403341378, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d4106898-r403341378-Diagonal_Mar_Centro_Comercial-Barcelona_Catalonia.html", "text": "Really enjoyed our trip to this shopping centre especially Sephora which is not available in N Ireland. \nClean bathrooms and good air conditioning. ", "publishedDate": "2016-08-09", "language": "en", "rating": 4}, {"id": 403032427, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d4106898-r403032427-Diagonal_Mar_Centro_Comercial-Barcelona_Catalonia.html", "text": "I came to Barcelona from Madrid and my daughter wanted to check Barcelona shopping and compare it to Madrid's. Lady in the hotel suggested Diagonal Mar and we went there. \nWe took a metro and get out at \"El Maresme- Forum\" stop. Than we walk a couple of minutes, crossed the street and came to the mall. \nIt is the big mall with a lot of stores, but about 95% of those stores are the same as stores in Madrid. My daughter checked a few with the hope to find something different, but those stores had the same selection as Madrid stores. However, some prices were slightly higher... There were some stores that we didn't see in Madrid, but not as many as we were hoping for.    \n\nThere is a food court on the top floor, but we didn't really liked any restaurants. \n\nWe were there on Saturday(and my understanding is that the mall is closed on Sundays) and it was really crowded. Especially, Primark(I guess, this is European version of K-Mart) as it had some kind of sale and people were running in. Yet, we managed to spent there about 2.5 hours without buying anything...\n\nFrom there we went back to metro and took L4 line to \"Barceloneta\" stop and had a nice walk around Ranbla de Mar", "publishedDate": "2016-08-08", "language": "en", "rating": 3}, {"id": 402971962, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d4106898-r402971962-Diagonal_Mar_Centro_Comercial-Barcelona_Catalonia.html", "text": "A very fresh and nice shoppingmall with a lot of space that makes it feels \"not so crowded\" even if there is a lot of visitors! \nThe mall has a lot of shopps with something for everyone. Good prices. If you look for expensive and more \"luxury\" you maybe should go somewhere else..\nThere is also a lot of restaurants!", "publishedDate": "2016-08-08", "language": "en", "rating": 4}, {"id": 402759014, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d4106898-r402759014-Diagonal_Mar_Centro_Comercial-Barcelona_Catalonia.html", "text": "It has plenty of stores including primark. What I don't recommend is Burger King. It as a really bad experience, just because it was busy they just throw the thing inside the burger, missing some on the way, like the mile part of bread. They just want to sell as fast as they can!", "publishedDate": "2016-08-08", "language": "en", "rating": 4}, {"id": 402451865, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d4106898-r402451865-Diagonal_Mar_Centro_Comercial-Barcelona_Catalonia.html", "text": "A well located shopping mall with many brands all in one place.\nThe mall offers free underground parking for 3 hours.\nWalking distance to Port Vell and Barcelona Forum", "publishedDate": "2016-08-07", "language": "en", "rating": 4}, {"id": 402141741, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d4106898-r402141741-Diagonal_Mar_Centro_Comercial-Barcelona_Catalonia.html", "text": "We headed to this mall to visit the biggest Primark branch in Barcelona. I didn't like this branch as it was so crowded. But overall the mall has all brands you would wish for and many places are available to grab a meal or a snack. It also has a huge supermarket. ", "publishedDate": "2016-08-06", "language": "en", "rating": 5}, {"id": 397191184, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d4106898-r397191184-Diagonal_Mar_Centro_Comercial-Barcelona_Catalonia.html", "text": "Not really a shopper but we made good use of this mall that was located close to our hotel. Wide range of shops and food outlets, including a large supermarket (Alcampo) in which you can find just about anything you'll need. The food hall in the supermarket was impressive and allowed us to experience a taste of the real Catalunya. There are tram and metro stops right outside the mall.", "publishedDate": "2016-07-25", "language": "en", "rating": 4}, {"id": 396469672, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d4106898-r396469672-Diagonal_Mar_Centro_Comercial-Barcelona_Catalonia.html", "text": "A modern shopping center and popular.\nHuge shopping center with hundreds of shops for all tastes, restaurants, cafes and more.\nEverything is clean, neat and very high level.\nHighly recommended for a visit.", "publishedDate": "2016-07-24", "language": "en", "rating": 5}, {"id": 394998233, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d4106898-r394998233-Diagonal_Mar_Centro_Comercial-Barcelona_Catalonia.html", "text": "Every time we are in Barcelona we go to this shopping centre. Is big, convenient and has good promotions.\nYou can reach it with the team from the subway station Glories. \nOn the top floor it has a number of restaurants (among other the tapas bar Lizarran) and a cinema. Huge Au Champ supermarket with both food and non-food departments.", "publishedDate": "2016-07-21", "language": "en", "rating": 5}, {"id": 394710904, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d4106898-r394710904-Diagonal_Mar_Centro_Comercial-Barcelona_Catalonia.html", "text": "This should be one of the biggest shopping centers i remember visiting in Barcelona, it was not in the center however is not difficult to get there. (along Barceloneta more exactly in POBLENOU)\n\nHugh variety of shops including Primark.", "publishedDate": "2016-07-20", "language": "en", "rating": 4}, {"id": 389459365, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d4106898-r389459365-Diagonal_Mar_Centro_Comercial-Barcelona_Catalonia.html", "text": "Easy to access and parking available for those who drive. A very nice and modern, shopping centre. I write menus because the selection of restaurants a massive, and most types covered. Building, and areas built in beautiful, clean, open way. Play park for kids outside. Huge selection of stores, and all price levels type. Great grocery store, with fresh counters for fruits&vegetable, fish, meat and bakery.\nToy stores, coffee shops, misc clothing stores, many Famous brands covered. 3 floors. A bit problematic with stroller, as elevators a bit crowded at times, and just a few places escalators allow strollers. \nOverall what you expect in a modern shopping mall. We enjoyed it.   ", "publishedDate": "2016-07-05", "language": "en", "rating": 4}, {"id": 388500134, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d4106898-r388500134-Diagonal_Mar_Centro_Comercial-Barcelona_Catalonia.html", "text": "Popular with Locals, this is the best shopping center. Crowded, especially at Primark. Good chicken from Pollo Campero. Horchata, Italian icecream bars, easily you can spend several hours. Take tram 4 to get there.", "publishedDate": "2016-07-02", "language": "en", "rating": 5}, {"id": 385332425, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d4106898-r385332425-Diagonal_Mar_Centro_Comercial-Barcelona_Catalonia.html", "text": "We went to diagonal mar for the primark early in the morning but it was crowded as hell. There are other great storea as zara,bershka, mango,nike and many more. The food corner isnt the biggest but udon noodles sells good asian food. It is a little bit far from barcelona but much better for a relaxed shopping day as at the rambles.", "publishedDate": "2016-06-23", "language": "en", "rating": 5}, {"id": 383618202, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d4106898-r383618202-Diagonal_Mar_Centro_Comercial-Barcelona_Catalonia.html", "text": "Easy access to the shopping mall via metro or car - with 3 hours parking for free. Good restaurants, small coffee shops and Starbucks available. Good option for weekdays lunch menu at around 11 euros per person. \n\nGood supermarket and stores like Primark, MediaMarket and Forum Sports. Crowded over the weekend. ", "publishedDate": "2016-06-18", "language": "en", "rating": 4}, {"id": 379480705, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d4106898-r379480705-Diagonal_Mar_Centro_Comercial-Barcelona_Catalonia.html", "text": "I lose my phone in this shopping mall 2 times and i get it back because of the security and Housekeeping. It was a funny story that i dropped my phone somewhere in the mall, when i got it back i forgot it in rest room. However, i got it back :)) i was so surprise with the staff but i am so happy about that :)", "publishedDate": "2016-06-03", "language": "en", "rating": 5}]}}]