[{"locationId": 8376916, "name": "Parc de la Ciutadella Centre Esportiu Municipal", "placeType": "ATTRACTION", "reviewListPage": {"reviews": [{"id": 744362082, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d8376916-r744362082-Parc_de_la_Ciutadella_Centre_Esportiu_Municipal-Barcelona_Catalonia.html", "text": "Nice park for local and tourist alike. It’s has 2 parts to this park.  \nMany local and tourist visit here with things to sale on the floor. ", "publishedDate": "2020-02-11", "language": "en", "rating": 4}, {"id": 568233420, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d8376916-r568233420-Parc_de_la_Ciutadella_Centre_Esportiu_Municipal-Barcelona_Catalonia.html", "text": "The good thing about this lake is that you can rent a boat and paddle. You don't need a stranger to paddle, so there will be no sabotaging your privacy if you are a couple.", "publishedDate": "2018-03-23", "language": "en", "rating": 4}, {"id": 565290714, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d8376916-r565290714-Parc_de_la_Ciutadella_Centre_Esportiu_Municipal-Barcelona_Catalonia.html", "text": "I laughed reading previous reviews because most of them were for the actual park not the sporting venue which is what the listing is for.  The park has its own listing on TA and that's where most of these reviews for the park itself should be relocated.\n\nAnyway, the sporting venue is like a surprise when you're walking through the park.  It is located nearest to the zoo area of the park and stands out like a wooden lattice in the distance.  We saw all these people gathered around huge windows of the building under the wooden lattice, some were shouting or yelling out supportive \"Come on\" or \"Yes!\".  Our interest was peaked so we walked over and this turned out to be an indoor sports centre, which was at that time hosting a basketball game.  \n\nThe sports centre is maintained very well, providing important sports encouragement to the local community of children and youths.  They played a really good game too, considering they were older teens/not quite adults. It was impressive that the facility is actually underground and the huge floor to ceiling windows on the ground floor of the park, they provide free viewing for the community and lots of natural light without causing distraction to the players.  Clever build all around.", "publishedDate": "2018-03-08", "language": "en", "rating": 4}, {"id": 524180060, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d8376916-r524180060-Parc_de_la_Ciutadella_Centre_Esportiu_Municipal-Barcelona_Catalonia.html", "text": "We stumbled on this wonderful park and my lovely wife said, \" Let's row.\" So we did. 6 Euros for a 1/2 hour and we had an absolute blast. Do this. If you are a couple, it is rather romantic. If you are a family, it is just super fun. The pond is small. You don't go far. The boats are pretty funky. But hey, you are in Barcelona. Get crazy.", "publishedDate": "2017-09-13", "language": "en", "rating": 5}, {"id": 514288265, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d8376916-r514288265-Parc_de_la_Ciutadella_Centre_Esportiu_Municipal-Barcelona_Catalonia.html", "text": "The city park is lovely, plenty of fountains, foliage and statues. It's a welcome change from the hustle and bustle of the city. On the grounds are the Catalan parliament and the Barcelona zoo entrance. \n\nWe saw wild, green Parakeets 🦆, the famous fountain and enjoyed taking pictures with the woolly mammoth 🐘. ", "publishedDate": "2017-08-17", "language": "en", "rating": 4}, {"id": 507702912, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d8376916-r507702912-Parc_de_la_Ciutadella_Centre_Esportiu_Municipal-Barcelona_Catalonia.html", "text": "The Park is close to the beach and right Next to the arc. \nYou can see that it is designed with a lot of Love for details. \nThe Flowers are beautiful and create a special relaxing atmosphere and you can see many many parrots. \nWonderful place to find some rest. \nRecommendation: \nInclude it in your morning run. Then it is not crowded at all and you can Enjoy the atmosphere nearly on your own. ", "publishedDate": "2017-08-01", "language": "en", "rating": 5}, {"id": 495234932, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d8376916-r495234932-Parc_de_la_Ciutadella_Centre_Esportiu_Municipal-Barcelona_Catalonia.html", "text": "The best park in Spain, perhaps little more than Retiro Park in Madrid because it has Barcelona zoo which is the second biggest zoo in Europe, very attractive for all family members.. must visit", "publishedDate": "2017-06-22", "language": "en", "rating": 5}, {"id": 472059385, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d8376916-r472059385-Parc_de_la_Ciutadella_Centre_Esportiu_Municipal-Barcelona_Catalonia.html", "text": "It is an enormous park, maybe the most beautiful I've been to! If you visit Barcelona and it is a sunny day, don't miss the chance to go there! It is very beautiful and there are lots of spots to sit and relax!", "publishedDate": "2017-04-02", "language": "en", "rating": 5}, {"id": 450168088, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d8376916-r450168088-Parc_de_la_Ciutadella_Centre_Esportiu_Municipal-Barcelona_Catalonia.html", "text": "It is a park with many attractions: museum, park, Zoo. It is a nice place to visit during the sunny days", "publishedDate": "2017-01-07", "language": "en", "rating": 5}, {"id": 421297404, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d8376916-r421297404-Parc_de_la_Ciutadella_Centre_Esportiu_Municipal-Barcelona_Catalonia.html", "text": "Great Central Park, not too crowded. Nice spot to have picnic with baguette from down the street. Easy to get to and clean", "publishedDate": "2016-09-22", "language": "en", "rating": 5}, {"id": 402568236, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d8376916-r402568236-Parc_de_la_Ciutadella_Centre_Esportiu_Municipal-Barcelona_Catalonia.html", "text": "Sportscenter Ciutedella is a new building - 2009 - in the Ciutadella Park.\nIt is designed by Architects Batlle i Roig, and it is architectural interesting.\nThe sportscenter is located at the park entrance from Passeig de Picasso.", "publishedDate": "2016-08-07", "language": "en", "rating": 4}, {"id": 386379162, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d8376916-r386379162-Parc_de_la_Ciutadella_Centre_Esportiu_Municipal-Barcelona_Catalonia.html", "text": "Had a day to kill after leaving our accommodation and before our flight.  This park is relaxing and has a bar/cafe with plenty of tables.  Well worth a few hours to chill and get shade from the heat. The fountain is spectacular. ", "publishedDate": "2016-06-27", "language": "en", "rating": 5}, {"id": 318104581, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d8376916-r318104581-Parc_de_la_Ciutadella_Centre_Esportiu_Municipal-Barcelona_Catalonia.html", "text": "Remember to visit this nice park with the big fountain and plenty of grass to relax! the museums inside were closed at our time!\nIt also nice to go the small lake and rent a small boat (6 euros for 2 persons for 30 minutes-enough) and have a romantic time with few ducks- at the end you will see the Arc de Triumph!\nIn front of the Arc (with the back to the park) visit also on the LEFT \nthe Japanese buffet restaurant with very GOOD PRICES and VERY NICE QUALITY of lots of Asian plates including sushi", "publishedDate": "2015-10-12", "language": "en", "rating": 4}]}}]