[{"locationId": 7687719, "name": "Placa de Sant Jaume", "placeType": "ATTRACTION", "reviewListPage": {"reviews": [{"id": 591055411, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d7687719-r591055411-Placa_de_Sant_Jaume-Barcelona_Catalonia.html", "text": "We came across this large, rectangular space while ambling through the Gothic Quarter. It was Easter weekend and myriad visitors were taking photos in the square. I immediately thought that the area likely displayed a similar look centuries ago when it was a Roman forum. The shape is typical for that period; the public often gathers here; and two important political buildings face each other. The name, however, comes from a Medieval church that once dominated the area. It was demolished to build the City Hall and the Palau de la Generalitat in the 15th century, and both structures have undergo changes throughout the years.\n\nWe first went to look at the City Hall on the south. It features a nice neoclassical facade. Then we crossed the pedestrians-only square (at least for that afternoon) to the Palau de la Generalitat on the north. That building, which is the seat of Catalonia's regional government, has a late-Renaissance style with neoclassical elements. \n\nThe square would have been more interesting for me if we had been able to enter these buildings. See their websites for the limited visiting hours.", "publishedDate": "2018-06-26", "language": "en", "rating": 4}, {"id": 587735128, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d7687719-r587735128-Placa_de_Sant_Jaume-Barcelona_Catalonia.html", "text": "Placa de Sant Jaume is located inside the Old Gothic Quarter.  The square is surrounded by historical/government buildings.  It is spacious for holding various activities and nice to stroll around and to take photos.  Nonetheless be aware of pick-pockets among the crowd.", "publishedDate": "2018-06-15", "language": "en", "rating": 4}, {"id": 587301551, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d7687719-r587301551-Placa_de_Sant_Jaume-Barcelona_Catalonia.html", "text": "If you come upon this open square, with government buildings surrounding it, you are almost at the Gothic Quarter. Very close by are many restaurants and bars. This is the best part of Barcelona to be in late at night. Most restaurants are open until midnight and there is lots going on. The square itself is nothing special...and be careful, because cars drive down it and go very fast! Try not to walk in the very middle! ", "publishedDate": "2018-06-13", "language": "en", "rating": 3}, {"id": 585226744, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d7687719-r585226744-Placa_de_Sant_Jaume-Barcelona_Catalonia.html", "text": "Placa de San Jaume is the political centre of Catalonia. It is also the heart of the Gothic Quarter. Unlike the narrow alleyways surrounding the square, it is very spacious. Good place to have a stroll.", "publishedDate": "2018-06-04", "language": "en", "rating": 4}, {"id": 583892081, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d7687719-r583892081-Placa_de_Sant_Jaume-Barcelona_Catalonia.html", "text": "It is interesting and there are some very interesting and historic buildings around the square and worth a short visit.", "publishedDate": "2018-05-30", "language": "en", "rating": 3}, {"id": 583839202, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d7687719-r583839202-Placa_de_Sant_Jaume-Barcelona_Catalonia.html", "text": "The Palace of the Generalitat of Catalonia and the City Hall are located on this plaza. It is located at the centre of the old Roman settlement. The plaza is named after the Church of Sant Jaume which dated to medieval times but was demolished in 1823. Probably the most noteworthy feature of the plaza is the architecture of the buildings.", "publishedDate": "2018-05-30", "language": "en", "rating": 4}, {"id": 572295747, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d7687719-r572295747-Placa_de_Sant_Jaume-Barcelona_Catalonia.html", "text": "A lovely little square with beautiful architecture. It now has government buildings including City Hall and Palace of the Generalitat of Catalonia. Nice area to stroll along. ", "publishedDate": "2018-04-09", "language": "en", "rating": 4}, {"id": 549399165, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d7687719-r549399165-Placa_de_Sant_Jaume-Barcelona_Catalonia.html", "text": "This is a small square, surrounded by some shops, restaurants and government buildings. Not much was going on when I passed by. Some basic nativity decorations were up since it was December.", "publishedDate": "2017-12-26", "language": "en", "rating": 3}, {"id": 541059556, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d7687719-r541059556-Placa_de_Sant_Jaume-Barcelona_Catalonia.html", "text": "When this place is best, when there is Diada Castellera, at \"Las Fiestas de la Mercé\". You have to arrive at 12 or even early", "publishedDate": "2017-11-14", "language": "en", "rating": 4}, {"id": 530241871, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d7687719-r530241871-Placa_de_Sant_Jaume-Barcelona_Catalonia.html", "text": "We walked through this area and into Placa de Sant Jaume.\nNice square.\nSometimes they have things going on here as it's a decent size.\nOn this day there was a speaker here", "publishedDate": "2017-10-05", "language": "en", "rating": 4}, {"id": 523296893, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d7687719-r523296893-Placa_de_Sant_Jaume-Barcelona_Catalonia.html", "text": "Placa de Sant Jaume was one stop on a long walk through the Gothic Quarter during our most recent stay in Barcelona. It is the largest of a number of squares located in this old part of the city.\nWe once again enjoyed seeing the impressive public buildings located around the square. These include the City Hall and the Palau de la Generalitat. These buildings feature some intricate sculptures as part of their facades and are worthy of close inspection.\nWe yet again enjoyed our visit to this large square. Its large size provides something of a contrast to most other parts of the Gothic Quarter which are more confined.", "publishedDate": "2017-09-10", "language": "en", "rating": 4}, {"id": 521801024, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d7687719-r521801024-Placa_de_Sant_Jaume-Barcelona_Catalonia.html", "text": "Nice corner, always busy, going from Jaume to Las Ramblas (Ferrane street).\nShopping stores. Cafés and restaurants.\nSo close to the gothic area, to Barcelona Cathedral.\nEat tapas there.", "publishedDate": "2017-09-06", "language": "en", "rating": 3}, {"id": 510451966, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d7687719-r510451966-Placa_de_Sant_Jaume-Barcelona_Catalonia.html", "text": "This is not only de core of the city, but also of Catalonia. Here you find, for example, both Barcelona's and Catalonia's goverment buildings (Ajuntament and Palau de la Generalitat). \n\nAlso, it is not only a beautiful place, the fact of arriving there worths it by itself. \n\nIf somehow, you can arrange it to be there when there is a \"Castells\" competition or show (human towers), you will remember the day forever...", "publishedDate": "2017-08-09", "language": "en", "rating": 5}, {"id": 508982199, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d7687719-r508982199-Placa_de_Sant_Jaume-Barcelona_Catalonia.html", "text": "It is a square. If you do not have a guide, you probably won't enjoy too much, once the history around this area is the main thing. If you are passing by, you should give a look at the buildings. It is quite full of tourists groups.", "publishedDate": "2017-08-05", "language": "en", "rating": 3}, {"id": 500169863, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d7687719-r500169863-Placa_de_Sant_Jaume-Barcelona_Catalonia.html", "text": "Just down from the Jaume I metro is a stunning square with buildings like the City Hall to in the Gothic Quarter and there are lots of people there to enjoy the area.", "publishedDate": "2017-07-10", "language": "en", "rating": 4}, {"id": 495827624, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d7687719-r495827624-Placa_de_Sant_Jaume-Barcelona_Catalonia.html", "text": "There's not much to do here but Placa de Saint Jaume really is a stunning square with some beautiful buildings.  It's a lovely spot to walk through from the cathedral down towards Barceloneta. ", "publishedDate": "2017-06-25", "language": "en", "rating": 4}, {"id": 492101981, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d7687719-r492101981-Placa_de_Sant_Jaume-Barcelona_Catalonia.html", "text": "This square is in the Gothic Quarter.\nIt is quaint and very clean and a lot of people gather there to enjoy it.", "publishedDate": "2017-06-10", "language": "en", "rating": 4}, {"id": 488061816, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d7687719-r488061816-Placa_de_Sant_Jaume-Barcelona_Catalonia.html", "text": "The location of City Hall, a couple of shops and close to a metro stop. There were plenty of activities when we were here, our favorite beings the castellars - the human towers built up to about 8 levels high, the amazing light show projected on the side of the building, and the fire parade, the Correfoc, which started here during the Sant Eulalia Festival. Watch out for sparks!", "publishedDate": "2017-05-26", "language": "en", "rating": 5}, {"id": 482398808, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d7687719-r482398808-Placa_de_Sant_Jaume-Barcelona_Catalonia.html", "text": "We been in Barcelona this spring, this squer it was close our hotel. Nice little place. It is great plaza whit lot activitys.", "publishedDate": "2017-05-07", "language": "en", "rating": 5}, {"id": 482271903, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d7687719-r482271903-Placa_de_Sant_Jaume-Barcelona_Catalonia.html", "text": "A historic plaza in the heart of Barri Gotic. Close to the Cathedral and Museo Picasso. If you are lucky you can see Castellers - human tower buildings - here as well...", "publishedDate": "2017-05-07", "language": "en", "rating": 3}, {"id": 481616854, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d7687719-r481616854-Placa_de_Sant_Jaume-Barcelona_Catalonia.html", "text": "Not very large square near the Cathedral in the old town. Here are the Government of Catalonia and the City Hall of Barcelona.", "publishedDate": "2017-05-04", "language": "en", "rating": 4}, {"id": 475314094, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d7687719-r475314094-Placa_de_Sant_Jaume-Barcelona_Catalonia.html", "text": "Definitely check out events going on here and plan to get there early.  It's a great plaza with a lot of activity.", "publishedDate": "2017-04-13", "language": "en", "rating": 4}, {"id": 460674916, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d7687719-r460674916-Placa_de_Sant_Jaume-Barcelona_Catalonia.html", "text": "We were in Barcelona during the weekend of Feste Santa Eulalia and most of the festivities took place in Placa Sat Jaume. The is probably the case for other festivities as it is also the home of the City Hall and Government buildings.\nWe saw 6-8 groups of Castellers build human towers, the local schools complete the Correfoc (fire run) , Els Gegants procession nd the Llum 2017 light show. It was an amazing 3 days and each day we were down to Placa ant Jaume to experence something new. By day the side streets off the square need to be explored, each on offering somthing different. A lovely part of the old town.", "publishedDate": "2017-02-17", "language": "en", "rating": 5}, {"id": 458564647, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d7687719-r458564647-Placa_de_Sant_Jaume-Barcelona_Catalonia.html", "text": "nice slice of pizza and good coffee at reasonable prices - quick service and lots of seating on several levels. ", "publishedDate": "2017-02-10", "language": "en", "rating": 4}, {"id": 449813028, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d7687719-r449813028-Placa_de_Sant_Jaume-Barcelona_Catalonia.html", "text": "My wife, two children and I visited Barcelona in December 2016 and January 2017.  I walked in the Gothic Quarter and visited Placa de Sant Jaume.  It is another nice plaza to visit.  There are two very interesting buildings here.  Palau de la Generalitat and Ajuntament de Barcelona.", "publishedDate": "2017-01-06", "language": "en", "rating": 4}, {"id": 447177032, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d7687719-r447177032-Placa_de_Sant_Jaume-Barcelona_Catalonia.html", "text": "A historic square in the gothic quarter of Barcelona. There is some good shopping adjoining the square towards las ramblas and also some restaurants and coffee shops at the square, if you are doing a gothic quarter walk then you would surely pass this square.", "publishedDate": "2016-12-28", "language": "en", "rating": 4}, {"id": 443351300, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d7687719-r443351300-Placa_de_Sant_Jaume-Barcelona_Catalonia.html", "text": "Great place central to many attractions. Near Las Rambles, crowded with locals and tourists. Beautiful architecture.", "publishedDate": "2016-12-10", "language": "en", "rating": 4}, {"id": 441383814, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d7687719-r441383814-Placa_de_Sant_Jaume-Barcelona_Catalonia.html", "text": "Attractive square with stately buildings-access off Carrer Ferran which runs off the Ramblas. You can cross the Via Laietana at Placa St Jaume to get to the Picasso museum or go north into one of the numerous small street to reach the Cathedral or the Roman history museum. Many cafes nearby.", "publishedDate": "2016-12-01", "language": "en", "rating": 4}, {"id": 422835460, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d7687719-r422835460-Placa_de_Sant_Jaume-Barcelona_Catalonia.html", "text": "Nice square. Lots of attractions near by. Overcrowded like many places in Barcelona. But still worth a visit", "publishedDate": "2016-09-27", "language": "en", "rating": 4}, {"id": 416018261, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d7687719-r416018261-Placa_de_Sant_Jaume-Barcelona_Catalonia.html", "text": "Pretty, historic square in the Gothic Quarter of Barcelona.  A mixture of government buildings, with interesting architecture, and restaurants/cafes.  Well worth spending a little time when in this area - we spent time here after visiting the cathedral.", "publishedDate": "2016-09-08", "language": "en", "rating": 4}, {"id": 406374824, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d7687719-r406374824-Placa_de_Sant_Jaume-Barcelona_Catalonia.html", "text": "No place to sit, nothing to see except some pretty architecture on a Sunday morning. Underwhelmed. We glanced around and walked on through as did other tourists.", "publishedDate": "2016-08-16", "language": "en", "rating": 3}, {"id": 392613812, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d7687719-r392613812-Placa_de_Sant_Jaume-Barcelona_Catalonia.html", "text": "Historic square near our hotel that we passed through on the way to Cathedral of Barcelona. Very cool architecture.", "publishedDate": "2016-07-14", "language": "en", "rating": 4}, {"id": 389690968, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d7687719-r389690968-Placa_de_Sant_Jaume-Barcelona_Catalonia.html", "text": "I recommend going to the parliament building first and seeing the gardens and the zoo there. Then walking down Carrer de la Princesa to Plaça de Sant Jaume. Check out the various museums and shops on the way to Placa de Sant Jaume. When at PSJ, there are many eating places around the main square. One can find good cafes in the inside streets behind the Presidents office. The tourist office opposite the presidents office has helpful information. I wanted to find an internet cafe, and I learned about it with directions to the place from the lady at this office. there re many bike rentals, restaurants and touristy kinda shops on carrer de la ferran. Watchout for pickpockets and scammers. I traveled light without bags and I was not bothered by any one selling me stuff. Over all it was a good experience. ", "publishedDate": "2016-07-06", "language": "en", "rating": 5}, {"id": 385642557, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d7687719-r385642557-Placa_de_Sant_Jaume-Barcelona_Catalonia.html", "text": "This plaza was a den of activity when I walked through it. several protests were going on-police were on hand-just in case. the buildings in the square are all classic structures. Historic square in the city", "publishedDate": "2016-06-24", "language": "en", "rating": 4}, {"id": 380360250, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d7687719-r380360250-Placa_de_Sant_Jaume-Barcelona_Catalonia.html", "text": "The Plaza de Sant Jaume is a great square to use as your base in Barcelona’s Gothic Quarter, which is a part of the city that can be confusing and twisty. I recommend that you access the plaza off of Las Ramblas and enter through Carrer de Ferran. Ferran will eventually open into the Plaza de Sant Jaume, where two government buildings face each other. This is the site of the medieval government center, as well as the ancient Roman heart of the city. There is an official tourist office in the ground floor of one of these massive buildings, the Ajuntament of Barcelona—in case you need help or a map, or maybe take a walking tour here. If you continue past the plaza, the Carrer de Ferran turns into Carrer Jaume and then it is called Carrer de la Princessa, which leads you to the Picasso museum—if that is your interest. Otherwise, I would recommend using the Plaza de Sant Jaume as your reference point in navigating the gothic streets in that area (left of the plaza if you entered via Ramblas and Ferran). Look for the beautiful gothic bridge between two buildings off of the plaza and that street (Carrer Bisbe) will take you to the Barcelona cathedral. If you want to meander prior to going to the cathedral, you might take the street right of the bridge street. The street is Carrer de Paradis but possibly no street name will be visible, so just choose the street right of the bridge street. Before you enter the street, you will see that it is short before bending right. Take the street, bend right, and straight ahead of you will be a building, in which is the Temple of Augustus—again, this area reaches back into the ancient Roman settlement in Barcelona. The temple is free but well-maintained, so don’t be afraid to enter it even if it’s a little neglected by the main tourist crowd that tends to take Carrer Bisbe instead of this tiny neighboring side street. If you want some good shopping after visiting the temple and/or cathedral, return to Plaza de Sant Jaume and head down Carrer Sant Honorat (which is the street left of the bridge street). Take Carrer Sant Honora to its very end, where it meets Carrer Sant Sever. My favorite shop is there, to the left, I believe—the Basilica Galeria, which is a jewelry-lovers haven with a big range of prices! Continue left on Sant Sever to find many gothic streets that wind into gorgeous church plazas and also a great shopping district with more unique items.", "publishedDate": "2016-06-06", "language": "en", "rating": 4}, {"id": 376740976, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d7687719-r376740976-Placa_de_Sant_Jaume-Barcelona_Catalonia.html", "text": "This fairly large, medieval plaza that's dominated by two government buildings, the city hall and the city council building. There are some shops in the square, but not very many. The square does not have a lively quality, though its usually crammed with people. This is probably because  there are no restaurant gardens or coffee shops with outdoor seating. People are mostly passing through there. It's ok for a look and a picture but there is little atmosphere there and you'll not want to linger any more than a couple of minutes.", "publishedDate": "2016-05-26", "language": "en", "rating": 3}, {"id": 368417642, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d7687719-r368417642-Placa_de_Sant_Jaume-Barcelona_Catalonia.html", "text": "Very near to the centre, yet not crowded by tourists. Home of the regional and city government. Very important historical location. Great architecture.\nWorth seeing.", "publishedDate": "2016-04-28", "language": "en", "rating": 5}, {"id": 364791478, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d7687719-r364791478-Placa_de_Sant_Jaume-Barcelona_Catalonia.html", "text": "Just the next square down Placa de Sant Jaume is Placa de Sant Miquel, just behind the Ajuntament de Barcelona stands an odd monument, depicting Catalunya’s national sport: Castelles. It’s the art of building human castles which today can go up as high as 10 levels of humans with absolutely zero support. This culture is so unique that it is even included in UNESCO's Masterpieces of the Oral and Intangible Heritage of Humanity. This particular art installation showcase the highest Castelles ever attempted. This have my brain going in circles trying to imagine the human feat of going up that high with just human beings.", "publishedDate": "2016-04-17", "language": "en", "rating": 4}, {"id": 362463456, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d7687719-r362463456-Placa_de_Sant_Jaume-Barcelona_Catalonia.html", "text": "Located in the heart of the Gothic Quarter and home to City Hall, we found this place by accident while walking between the Jaume and Liceu metro stations in search of Cathedrals. Plenty of shops and cafes nearby if you are passing.", "publishedDate": "2016-04-08", "language": "en", "rating": 3}, {"id": 355832455, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d7687719-r355832455-Placa_de_Sant_Jaume-Barcelona_Catalonia.html", "text": "This is a beautiful small square in the middle of the gothic quarter, and as it's the government's square, there are a lot of tourist information centers and people willing to help. Most walking tours also start here, and it's a great reference point to get to know the gothic quarter.", "publishedDate": "2016-03-15", "language": "en", "rating": 5}, {"id": 340660228, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d7687719-r340660228-Placa_de_Sant_Jaume-Barcelona_Catalonia.html", "text": "The square was designed in Roman times at the crossroads of the Cardo (the main north-south oriented street in Roman settlements) and Decumanus (the east-west oriented street). It is named after the Church of Sant Jaume and it is the main administrative center of the city and Catalonia, that is the reason why it is often referred as “Constitution Square”.", "publishedDate": "2016-01-17", "language": "en", "rating": 5}, {"id": 331378355, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d7687719-r331378355-Placa_de_Sant_Jaume-Barcelona_Catalonia.html", "text": "Start your walk from here to the Gothic Quarter and you will end up at the La Rambla. \nThis square hosts the Catalan local government. This was the historical center of Barcelona. \nIt was worth seeing! :-)", "publishedDate": "2015-12-08", "language": "en", "rating": 4}, {"id": 297836171, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d7687719-r297836171-Placa_de_Sant_Jaume-Barcelona_Catalonia.html", "text": "We stumbled upon this placa while meandering from La Catedral towards La Rambla. It was around lunchtime, and we found a number of restaurants with tables outdoors, sheltered from the sun, and with food at reasonable prices. It was a Saturday, and the placa was hosting an art market, which operated until afternoon siesta time. In addition, a couple of buskers were entertaining with a rendition of the tango. When lingered over our lunch so that we could appreciate our surroundings and savour the experience.", "publishedDate": "2015-08-11", "language": "en", "rating": 5}, {"id": 289008830, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d7687719-r289008830-Placa_de_Sant_Jaume-Barcelona_Catalonia.html", "text": "The intersection of the two main roads in Roman Barcino eventually became the center of Catalan government with city hall on one side and the governmental building for the state of Catalonia on the other. We took a gothic tour from city hall started in this square. We enjoyed being at the center of town and all the building surrounding it. You don't need to spend a lot of time here but make sure to make time to visit.", "publishedDate": "2015-07-14", "language": "en", "rating": 4}, {"id": 286681963, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d7687719-r286681963-Placa_de_Sant_Jaume-Barcelona_Catalonia.html", "text": "Just off Ramblas, very pretty square with cafes and plenty to eat and drink.  Nice loggias/corridors leading to interesting streets to roam and wander, away from the madding crowds!", "publishedDate": "2015-07-08", "language": "en", "rating": 4}, {"id": 277077782, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d7687719-r277077782-Placa_de_Sant_Jaume-Barcelona_Catalonia.html", "text": "We had a driver pick us up at the airport to take us to our hotel.  When we got to Sant Jaume, he said he couldn't go any further.  We had to walk with our luggage to our hotel!!!  It wasn't that far and actually was quite easy to find.  Since we were so close, we went through the Plaza every day of our 3 day stay.   Not sure how they decide when vehicles can drive in it but sometimes they were and sometimes they weren't.  Always alot of people.", "publishedDate": "2015-06-01", "language": "en", "rating": 4}, {"id": 275567609, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d7687719-r275567609-Placa_de_Sant_Jaume-Barcelona_Catalonia.html", "text": "Another famous square in Barcelona, opened between the Casa de La Ciudad, originally a gothic palace (you can see it looking at its left side, formerly facade) heavily restructurated in the XIX century, and the renaissance-styled Palau de la Generalitat, unfortunately closed to tourists.", "publishedDate": "2015-05-29", "language": "en", "rating": 4}, {"id": 269511685, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d7687719-r269511685-Placa_de_Sant_Jaume-Barcelona_Catalonia.html", "text": "Plaça de Sant Jaume, I think it translates as St James. a wonderful square at the centre of the Gothic quarter were you admire the architecture and people watch, lower down towards Las Ramlas is the oldest church in Barcelona, Església de Sant Jaume.", "publishedDate": "2015-05-02", "language": "en", "rating": 4}, {"id": 258285057, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d7687719-r258285057-Placa_de_Sant_Jaume-Barcelona_Catalonia.html", "text": "The Placa de Sant Jaume is a pretty open square in the 'old city' of Barcelona. With lovely architecture all around and a location steps away from Barri Gotic and the Barcelona Catedral, this is a place you should visit.", "publishedDate": "2015-03-07", "language": "en", "rating": 4}]}}]