[{"locationId": 8742797, "name": "Sala Fundacion Mapfre Casa Garriga Nogues", "placeType": "ATTRACTION", "reviewListPage": {"reviews": [{"id": 674388377, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d8742797-r674388377-Sala_Fundacion_Mapfre_Casa_Garriga_Nogues-Barcelona_Catalonia.html", "text": "If you like photography, don’t miss this extensive exhibit. The building itself is beautiful! Her works, mostly from 1930’s in New York City,  and some from Paris, are captivating, and the city scenes fascinate as they depict life from a different era. Her scientific photographs were quite interesting. ", "publishedDate": "2019-05-16", "language": "en", "rating": 4}, {"id": 633512084, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d8742797-r633512084-Sala_Fundacion_Mapfre_Casa_Garriga_Nogues-Barcelona_Catalonia.html", "text": "This exhibition was amazing. It included works by Picasso Matisse and Monet to name a few. I can’t say enough how impressive this was. You must see it if you are at all interested in art!", "publishedDate": "2018-11-14", "language": "en", "rating": 5}, {"id": 604353651, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d8742797-r604353651-Sala_Fundacion_Mapfre_Casa_Garriga_Nogues-Barcelona_Catalonia.html", "text": "As I always say about a gallery especially this type of gallery you either love it or hate it. On this occasion I was 50 50 but the gallery itself is splendid - a great display area and superbly well done with exceptional staff. Friendliness of the highest order - Great", "publishedDate": "2018-08-08", "language": "en", "rating": 5}, {"id": 540872895, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d8742797-r540872895-Sala_Fundacion_Mapfre_Casa_Garriga_Nogues-Barcelona_Catalonia.html", "text": "They used to organize expositions by authors, or periods. Sometimes they organize samples of painting or sculpture. You have to book online in advance to be able to enter", "publishedDate": "2017-11-14", "language": "en", "rating": 4}, {"id": 448031860, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d8742797-r448031860-Sala_Fundacion_Mapfre_Casa_Garriga_Nogues-Barcelona_Catalonia.html", "text": "I find that any art exhibit is going to be a bit of a gamble. But for €3, it is not much of gamble, even if you lose. For me, the Renoir Among Women was not quite a loss, there were a handful of pieces that drew my attention, without me forcing it. However, the building was the true star, particularly the second floor, as I found myself drawn to look up, as much as looking at the paintings and sculptures. \n\nSome glare, from the lights, made it necessary to use different angles for some of the paintings. But, overall, enjoyed my 30-40 minutes and think it would be a great place to view art in those times where the gamble fully pays off.", "publishedDate": "2016-12-31", "language": "en", "rating": 4}, {"id": 428636016, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d8742797-r428636016-Sala_Fundacion_Mapfre_Casa_Garriga_Nogues-Barcelona_Catalonia.html", "text": "We only knew about this fantastic exhibition thanks to a poster hanging from a lamppost - over 70 paintings, the vast majority by Renoir from Paris (but also some Catalan artists, and also ones by Van Gogh, Picasso and sculptures by Degas, Maillol etc). The entrance was only 3 euros - surely the best value exhibition in the city! Really nice gallery as well.", "publishedDate": "2016-10-17", "language": "en", "rating": 5}, {"id": 427547414, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d8742797-r427547414-Sala_Fundacion_Mapfre_Casa_Garriga_Nogues-Barcelona_Catalonia.html", "text": "This fundacion at the adress Diputacion 250 close to Placa Catalonya has changed its name to Fundacio MAPFRE. If you love the paintings of Renoir this is the place to visit until Jan 8th 2017. The exhibition is based on an extraordinary loan of about 60 paintings from Musee D'orsay/L'orangerie, among other Renoirs impressive masterpiece \"Bal du Moulin de la Galette\".", "publishedDate": "2016-10-13", "language": "en", "rating": 5}, {"id": 414998406, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d8742797-r414998406-Sala_Fundacion_Mapfre_Casa_Garriga_Nogues-Barcelona_Catalonia.html", "text": "A very nice place where we got the chance to see the BRUCE DAVIDSON photography exhibition. The photographies by Bruce Davidson were very impressive and we stayed for quiet some time at the Fundacion MAPFRE. There were lockers, where we left our handbags and backpacks.", "publishedDate": "2016-09-05", "language": "en", "rating": 5}, {"id": 396360985, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d8742797-r396360985-Sala_Fundacion_Mapfre_Casa_Garriga_Nogues-Barcelona_Catalonia.html", "text": "The place was the former house of Garriga i Nogués. It is an example of the Modernism in Catalonia, very well preserved. The exhibition is very nice, showing a large period of the photographer Bruce Davidson. The photos regarding the Civil Rights  movement are very impressing.", "publishedDate": "2016-07-24", "language": "en", "rating": 5}, {"id": 379701448, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d8742797-r379701448-Sala_Fundacion_Mapfre_Casa_Garriga_Nogues-Barcelona_Catalonia.html", "text": "The exhibition was from a photographer. Interesting. But the building is worth the visit.\nThe place was empty, so we could walk at our pace, calmly and in silence.", "publishedDate": "2016-06-04", "language": "en", "rating": 5}, {"id": 379039032, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d8742797-r379039032-Sala_Fundacion_Mapfre_Casa_Garriga_Nogues-Barcelona_Catalonia.html", "text": "The new exhibit of photographs by American Bruce Davidson is a well organized but haunting experience.  His photographs of some of the more down-trodden places in American and other places in the world over the last 40 years make you realize how little progress has been made in the world in treating others with respect and kindness.  A truly eye-opening exhibit.", "publishedDate": "2016-06-02", "language": "en", "rating": 5}, {"id": 352086829, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d8742797-r352086829-Sala_Fundacion_Mapfre_Casa_Garriga_Nogues-Barcelona_Catalonia.html", "text": "When we visited, they had a photo exhibit by Hiroshi Sugimoto.  It was interesting.  Also liked the building that it was housed in.  Entry for those over 65 was 2 euros.", "publishedDate": "2016-03-01", "language": "en", "rating": 4}, {"id": 334192733, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d8742797-r334192733-Sala_Fundacion_Mapfre_Casa_Garriga_Nogues-Barcelona_Catalonia.html", "text": "Planned to visit Fundación Francisco Godia, but it had closed down. However, the gallery has recently been taken over by Fundación MAPFRE, who were showing a (free) exhibition of some works by Van Gogh, Matisse, Seurat, Gauguin, Cézanne, Monet, Derain and Renoir from the Musée d’Orsay and  l'Orangerie galleries.", "publishedDate": "2015-12-21", "language": "en", "rating": 5}, {"id": 330545115, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d8742797-r330545115-Sala_Fundacion_Mapfre_Casa_Garriga_Nogues-Barcelona_Catalonia.html", "text": "The Fundacio Francisco Godia is now the Fundacio Mapfre.  It is in the same building with the same address.", "publishedDate": "2015-12-03", "language": "en", "rating": 5}, {"id": 330197858, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d8742797-r330197858-Sala_Fundacion_Mapfre_Casa_Garriga_Nogues-Barcelona_Catalonia.html", "text": "But now it is the Fundacio Mapfre.  I don't know what any of that means, but I do know that we saw a really first class art exhibit there called The Triumph of Color. Van Gough, Gauguin, Cezanne plus others added up to a wonderful exhibition.  And there was no entry fee.  Great art, no cost, in a beautiful mansion.  It doesn't get much better than that.", "publishedDate": "2015-12-01", "language": "en", "rating": 5}, {"id": 323678566, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d8742797-r323678566-Sala_Fundacion_Mapfre_Casa_Garriga_Nogues-Barcelona_Catalonia.html", "text": "After attending many shows at the Fundación Mapfré in Madrid, we happily visited the first ever show at the new gallery in Barcelona!  \n\nThe \"Triumph of Colour\" features mainly Post Impressionists and was a treat.  The curation was a bit odd but the show itself was very enjoyable.\n\nArt aside, the building is beautiful!", "publishedDate": "2015-11-01", "language": "en", "rating": 5}, {"id": 320381840, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d8742797-r320381840-Sala_Fundacion_Mapfre_Casa_Garriga_Nogues-Barcelona_Catalonia.html", "text": "You have to book in advance on the internet although the entrance is free. otherwise you can do it on the door but you have to register there. At the moment there is the exhibition ''The Triumph of Colour'' featuring a number of great pictures and artists from the ''Musee D'Orsay and ''l'Orangerie'' in Paris. It has artists including Van Gogh, Matisse, Cezanne Seurat and many more. Wll worth the visit. nearest subway is Passeig De Gracia (2 blocks away-5 minutes max)", "publishedDate": "2015-10-20", "language": "en", "rating": 5}, {"id": 300347648, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d8742797-r300347648-Sala_Fundacion_Mapfre_Casa_Garriga_Nogues-Barcelona_Catalonia.html", "text": "Tried to visit the museum on August 17, 2015 and found it to be PERMANENTLY CLOSED!! The door still says \"250\" above it, but the sign with the museum name which once hung to the left side of the door has been hastily removed, leaving broken concrete behind. I peered through the window and saw a sign with the museum name inside, however the place was clearly abandoned. I asked inside the adjacent hotel and the staff there confirmed that the museum is permanently closed! Unfortunately the museum's website does not seem to have any announcements about the closure. Don't waste your time seeking this one out. It closed forever!", "publishedDate": "2015-08-17", "language": "en", "rating": 1}, {"id": 237579515, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d8742797-r237579515-Sala_Fundacion_Mapfre_Casa_Garriga_Nogues-Barcelona_Catalonia.html", "text": "In a Moderniste mansion, an art work in itself, you will find a remarkable collection of art. The personal collection of Francisco Godia who loved fast cars and great art is a fabulous way to spend an uncrowded hour or 2. Great value too.", "publishedDate": "2014-11-02", "language": "en", "rating": 5}, {"id": 236234688, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d8742797-r236234688-Sala_Fundacion_Mapfre_Casa_Garriga_Nogues-Barcelona_Catalonia.html", "text": "What a wonderful surprise this was! After a week of pushing, squirming and threading our way through other museums, churches and sights, at the time i visited with one friend, we were only three in the entire place - there was one other young woman visiting the collection. And what we saw took our breath away: amazingly well preserved Romanesque figures, the like of which we had never seen - not even my friend, who is a restorator. For me, that was the most striking thing, but the rest the collection was excellent and the house is spectacular - don't be so overwhelmed by the art that you fail to notice, e.g. the stuccoed ceilings. AND there was no problem taking photographs and there were no ropes or railngs to keep you from seeing the artwork close up. I kind of hate to write such an honestly good review of this place because I am afraid that it might attract too many people and make it a hot tip that would then be just as crowded as everywhere else. So, let's keep this to ourselves, OK? Don't tell a soul!", "publishedDate": "2014-10-25", "language": "en", "rating": 5}, {"id": 230402591, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d8742797-r230402591-Sala_Fundacion_Mapfre_Casa_Garriga_Nogues-Barcelona_Catalonia.html", "text": "Francisco Godia is one of Spain's greatest art collector. This modernist building features most of his vast collection. The artwork covers several centuries and is deeply seeped in Spain's cultural history and revolution. A must for art enthusiasts.", "publishedDate": "2014-09-22", "language": "en", "rating": 4}, {"id": 188547887, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d8742797-r188547887-Sala_Fundacion_Mapfre_Casa_Garriga_Nogues-Barcelona_Catalonia.html", "text": "This charming modernist building shelters brilliant temporary exhibitions you can't miss if you like quality art\n\nIn this quiet place you could find artists or collectors just beside you \n\nA must for art lovers and great excuse to have a break from shopping in the city center ", "publishedDate": "2013-12-26", "language": "en", "rating": 5}, {"id": 187612505, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d8742797-r187612505-Sala_Fundacion_Mapfre_Casa_Garriga_Nogues-Barcelona_Catalonia.html", "text": "This emblematic building is a must in barcelona. They have great exhibitions and the place is simply great. All the connoisseurs must go and visit it. ", "publishedDate": "2013-12-14", "language": "en", "rating": 5}, {"id": 180782124, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d8742797-r180782124-Sala_Fundacion_Mapfre_Casa_Garriga_Nogues-Barcelona_Catalonia.html", "text": "In an impresive modernist building, it is not La Pedrera but very much worth a visit! Very positively surprised to discover a cool deign shop inside!", "publishedDate": "2013-10-13", "language": "en", "rating": 5}, {"id": 157542499, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d8742797-r157542499-Sala_Fundacion_Mapfre_Casa_Garriga_Nogues-Barcelona_Catalonia.html", "text": "The building has been superbly renovate a couple of years ago and is hosting a series of painting of Godia's collection (you like it or not, up to you) + temporary exhibition.\nDon't forget to go the terrace at the backside to have a typical view of the backside facade of all the building of the block.", "publishedDate": "2013-04-12", "language": "en", "rating": 4}, {"id": 126311420, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d8742797-r126311420-Sala_Fundacion_Mapfre_Casa_Garriga_Nogues-Barcelona_Catalonia.html", "text": "The Fundacion Francisco Godia is located at Calle Diputacio, 250. The location is a building called the Garriga Nogues House and is a Modernist building designed by the architect Enric Sagnier, one of the best Modernist architects. The house was built between 1899 and 1905. There is a Modernist staircase that is impressive, as well as beautiful stained glass windows created by Antoni Rigalt in 1903. Francisco Godia was born in Barcelona and lived between 1921 and 1990. He was a rich businessman who was also a race car driver during the time that amateurs were the people who raced cars. Godia was also an eclectic collector of art, collecting paintings and ceramics according to his taste. The foundation shows many of his collections. There are sculptures from the Middle Ages and paintings from the Renaissance to the Modernist age, including paintings by Ramon Casas, Isidre Nonell, and Santiago Rusiñol. The ceramic collection is very good and has ceramic plates with a golden sheen from Manises and Paterna, from the Moorish times. There are also avant-garde pieces done by Picasso, Barcelo, Magritte, Eduardo Chillida and Cristina Iglesias.", "publishedDate": "2012-03-18", "language": "en", "rating": 4}, {"id": 124348757, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d8742797-r124348757-Sala_Fundacion_Mapfre_Casa_Garriga_Nogues-Barcelona_Catalonia.html", "text": "Yes, Barcelona offers a lot of different and beautiful types of art; Fundacion Fracisco Godia is not different but you will FEEL SPECIAL.. Why? Because it is not gigantic, it´s very personal and more important: you feel that you are doing something that most of the common tourists will not do - Give it a try, you will not regret.\n\nThe location - it is in the heart of Eixample Esquerra (off Rambla Catalunya and Ramblas)\n\nThe Building by itself, is spetacular. Great modernist architecture. Pay attention to the stairs when you arrive, the mosaics, the glass work, the ceilings, etc...\n\nAll the exibitions that I have seen there are very well tought and planned. I always leave the museum with a feeling that I have learned and seen something different and good for my soul.\n\nGo there, enjoy it and when you leave have a nice walk along Rambla Catalunya (not Ramblas - very touristy) - and you will feel as you are a local!!\n\nHave Fun!!!", "publishedDate": "2012-02-09", "language": "en", "rating": 5}]}}]