[{"locationId": 6500682, "name": "Porta de la Finca Miralles", "placeType": "ATTRACTION", "reviewListPage": {"reviews": [{"id": 621472664, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d6500682-r621472664-Porta_de_la_Finca_Miralles-Barcelona_Catalonia.html", "text": "It's a nice but small architecture. You should only visit it if you're an architecture lover or you're close by.", "publishedDate": "2018-10-02", "language": "en", "rating": 3}, {"id": 505276306, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d6500682-r505276306-Porta_de_la_Finca_Miralles-Barcelona_Catalonia.html", "text": "I love everything Gaudi and I made a special trip to see this. However, I will confess that I was staying nearby at the Barcelona Hilton and this was on of 3 things I did early before leaving for a 10:30 flight back to the US. However early in the morning, 7:15, was a great time because I had it all to myself. \n\nWith all that said even as a gate you can see in the Gaudi everywhere, the assemtryical sides that mirror nature, the parabolic arch in the gate and the cross at the top. Plus it is hard to miss the statue of Gaudi which requires the obligatory selfie. Also impressive is the way the trees seem to fit with the structure even though it is clear the buildings are considerably newer than the structure. \n\nWhile I agree that it is hard to make a special trip for this, if you are in the area and you love Gaudi, make the time to see it and combine with other sites in the area.", "publishedDate": "2017-07-24", "language": "en", "rating": 5}, {"id": 372265746, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d6500682-r372265746-Porta_de_la_Finca_Miralles-Barcelona_Catalonia.html", "text": "Stumbled on this by accident when we got lost, quite an impressive building, most interesting was his statue to take a photo along side", "publishedDate": "2016-05-11", "language": "en", "rating": 3}, {"id": 339397593, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d6500682-r339397593-Porta_de_la_Finca_Miralles-Barcelona_Catalonia.html", "text": "Unless you’re staying really close to it or have a lot of time to spare or is a Gaudi aficionado, it is not worth going there. We were staying in the area (about 15 minutes away on foot) and had nine full days on our hands and that was not worth it. It is interesting and has that organic-like Gaudi style and that’s about it. Pavellons Guell with its iron dragon in its façade is kind of near; we went to see both and this detour was a bit unremarkable and a waste of time, honestly. You can survive without seeing either.", "publishedDate": "2016-01-12", "language": "en", "rating": 2}, {"id": 308930614, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d6500682-r308930614-Porta_de_la_Finca_Miralles-Barcelona_Catalonia.html", "text": "This site is pretty drab, a low priority to see for Gaudi fans. The nearby Finca Guell is much more stylistic and enjoyable to take in", "publishedDate": "2015-09-10", "language": "en", "rating": 2}, {"id": 268547553, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d6500682-r268547553-Porta_de_la_Finca_Miralles-Barcelona_Catalonia.html", "text": "Walk from Finca Guell about 15 minutes in the direction to the right road from here. You could find Gaudi standing there waiting for you to do a handshake. Under the curved roof of the fence, his bronze statue with mouthstach stood to welcome you all.", "publishedDate": "2015-04-28", "language": "en", "rating": 4}]}}]