[{"locationId": 591146, "name": "Basilica of Our Lady of Mercy", "placeType": "ATTRACTION", "reviewListPage": {"reviews": [{"id": 356393841, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d591146-r356393841-Basilica_of_Our_Lady_of_Mercy-Barcelona_Catalonia.html", "text": "Stumbled upon this Church .  and I am glad I did it seems that it isvisited by few tourists.The church is stunning inside with a spiritual atmosphere.", "publishedDate": "2016-03-17", "language": "en", "rating": 5}, {"id": 349310577, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d591146-r349310577-Basilica_of_Our_Lady_of_Mercy-Barcelona_Catalonia.html", "text": "We stumbled upon this unassuming church while strolling through the Gothic Quarter and decided to go inside for a peek. The Basilica de la Mare De Déu De La Mercè (Basilica of Our Lady of Mercy) is a Baroque-style basilica in Barcelona. It is unique in the ecclesiastical history of Barcelona because it is a Minor Basilica (the second to receive this title in Barcelona), it is the Mother Church of a medieval religious order, houses the statue of the patron Virgin of Barcelona, and contains the remains of another parish – Saint Michael the Archangel.\n\nThe story goes on the evening of August 1, 1218, the Blessed Virgin appeared to three men – St. Peter Nolasco, St. Raymond, and King Jaume I – and asked them to found an order (Order of Mercy) to provide for the Christians who were being taken into captivity by Muslim pirates and forcibly converted. The Mercedarians, in addition to vows of poverty, chastity, and obedience also promised to exchange themselves in ransom for another Christian who was in danger of losing his faith.\n\nIn 1637, the people of Barcelona gathered at this church to pray to the 14th-century statue of Our Lady of Mercy, a wooden sculpture of the Virgin and Child, for her intervention in stopping a plague of locusts. When this occurred, by popular decree of the city council she became an unofficial patroness of the city. Blessed Pius IX formally recognized her as the city’s patroness in 1868, and it became an official local government holiday in 1871.\n\nWe spent less than 30 minutes poking around this beautiful old church. I wouldn't have gone out of my way to see it, but it was worth stumbling upon.", "publishedDate": "2016-02-19", "language": "en", "rating": 4}, {"id": 347325890, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d591146-r347325890-Basilica_of_Our_Lady_of_Mercy-Barcelona_Catalonia.html", "text": "Wonderful church. You can have a peaceful rest and visit a part of Barcelona´s history. It is free entrance but it´s worth it a visit up to the dome. It´s a cheap fee.", "publishedDate": "2016-02-13", "language": "en", "rating": 4}, {"id": 340011014, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d591146-r340011014-Basilica_of_Our_Lady_of_Mercy-Barcelona_Catalonia.html", "text": "In a city with so many attractions, this one can be easily missed. That would be a huge mistake, because this Baroque style basilica has a splendid interior worth visiting. The church was built in the late 18th century, designed by Catalan architect Josep Mas i Dordal. The statue of Our Lady on its roof can be seen from the seashore.", "publishedDate": "2016-01-14", "language": "en", "rating": 5}, {"id": 331488919, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d591146-r331488919-Basilica_of_Our_Lady_of_Mercy-Barcelona_Catalonia.html", "text": "We had spent the morning at the famous and busy La Sagrada Famila and decided to head towards the Gothic Quarter to explore.  It happened to the the Feast of the Immaculate Conception which is a pulling holiday in Spain. What a joy it was to stumble upon this beatiful Basilica.  We were just admiring it from the exterior when a gentleman invited us in.  Many locals were there praying in observance of the Holy Day.  As a Catholic myself it was so beatiful to see the devotion and care that those that take care of this Basilica have.  \nThey accept donations but also sell small items from booklets on the Saint as well as religions medals and rosaries.  No big gift shop with tons of staff,  just a very friendly Catalonian gentleman who doesn't speak English but you can tell loves his Basilica.  Rosaries are affordable and good quality.  Blessed in the Basilica. ", "publishedDate": "2015-12-08", "language": "en", "rating": 5}, {"id": 317766159, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d591146-r317766159-Basilica_of_Our_Lady_of_Mercy-Barcelona_Catalonia.html", "text": "Absolutely gorgeous interior. We were there during Merce festival, entry was free, but you can still donate. The light inside is impressive and all decorations as well. There is a lovely cake caffe right in front of the church on the right hand side ;). ", "publishedDate": "2015-10-11", "language": "en", "rating": 5}, {"id": 312824503, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d591146-r312824503-Basilica_of_Our_Lady_of_Mercy-Barcelona_Catalonia.html", "text": "This probably usually gets ignored, but it was only a few minutes from our hotel. Although it isn't as nice on the outside as other buildings, inside it is lovely. It doesn't look as big on the outside, but it's a massive cavern inside, with some amazing features.", "publishedDate": "2015-09-22", "language": "en", "rating": 4}, {"id": 301850818, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d591146-r301850818-Basilica_of_Our_Lady_of_Mercy-Barcelona_Catalonia.html", "text": "We stumbled across this beautiful basilica whilst we were meandering around the Bari Gotic area. I am not a religious person but I do appreciate the sheer magnificence of these historical buildings. Entrance was free and I was more than happy to make a voluntary donation after our visit. For the religious people the coffin of a real saint is on display in the basilica. There are a number of much more well known religious buildings in Barcelona but I highly recommend this one as less touristic.", "publishedDate": "2015-08-21", "language": "en", "rating": 4}, {"id": 301501197, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d591146-r301501197-Basilica_of_Our_Lady_of_Mercy-Barcelona_Catalonia.html", "text": "Took an 1 1/2 train ride out of Barcelona to hop into a cable car to visit this site.  The view from the cable car is amazing, the Monastery if simple beautiful, black and gold, serene....we took a funicular to the very top of the mountain amazing views.  It was nice getting out of Barcelona for an afternoon.  Well worth the trip.", "publishedDate": "2015-08-20", "language": "en", "rating": 5}, {"id": 296922190, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d591146-r296922190-Basilica_of_Our_Lady_of_Mercy-Barcelona_Catalonia.html", "text": "The basilica is amazing. Many statues of saints in all corners of the church. Very majestic. A must visit in Barcelona if you are into large religious monuments.", "publishedDate": "2015-08-08", "language": "en", "rating": 4}, {"id": 292302830, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d591146-r292302830-Basilica_of_Our_Lady_of_Mercy-Barcelona_Catalonia.html", "text": "Due to its location and architecture, this is one of the best churches to visit in Barcelona. It is located in Barri Gòtic, where you can have a wonderful walk. Also, you can visit the church, which is a very ancient one with a very special architecture.", "publishedDate": "2015-07-25", "language": "en", "rating": 3}, {"id": 281197097, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d591146-r281197097-Basilica_of_Our_Lady_of_Mercy-Barcelona_Catalonia.html", "text": "We actually stumbled on this beautiful basilica by accident on our way to the sea front. The inside is truly beautiful. We actually saw them cleaning the massive chandeliers that hang near the front of the church. They look even more impressive when lowered down to the ground. Even if you are not remotely religious I would definitely recommend visiting as we are not either but still really liked the church.", "publishedDate": "2015-06-18", "language": "en", "rating": 5}, {"id": 259619971, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d591146-r259619971-Basilica_of_Our_Lady_of_Mercy-Barcelona_Catalonia.html", "text": "The Basilica de la Mare de Deu de la Merce is a lovely Church in the Barri Gotic. Another beautiful building, it is a small beautiful structure that is well worth visiting!", "publishedDate": "2015-03-15", "language": "en", "rating": 4}, {"id": 235262939, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d591146-r235262939-Basilica_of_Our_Lady_of_Mercy-Barcelona_Catalonia.html", "text": "I think that this is the prettiest church in Barcelona. It is not huge and austere like the Cathedral, nor surreal like the Sagrada Familia. It's just an exceptionally pretty and eminently appreciable little church.", "publishedDate": "2014-10-19", "language": "en", "rating": 5}, {"id": 232751541, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d591146-r232751541-Basilica_of_Our_Lady_of_Mercy-Barcelona_Catalonia.html", "text": "The temple of this Basilica was visible from our hotel next door, The Duquesa de Cardona so we made a point of visiting this church. On top of the temple is a statue of Mary with child and the child is holding a locust! Apparently in 1687 Barcelona was devastated by a locust plague and the Council requested protection from the Virgin of La Merce. When the plague ended, She was proclaimed as the patroness of the city.", "publishedDate": "2014-10-05", "language": "en", "rating": 5}, {"id": 231155328, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d591146-r231155328-Basilica_of_Our_Lady_of_Mercy-Barcelona_Catalonia.html", "text": "We flew to Barcelona from the 17-28 of September 2014 to attent the Merce, Corre-foc festival in .Catalona. We had seen the videos of the fire runners, but had no idea of the extent of it.  Drummers start from one end of the street to the other, beckoning the gates of hell to open. Oh and they do. Out comes manymkenmdressed as devils or in dragon floats, etc. They light spinng fire works and run thru the crowds of tens of thousands.  We chose to participate and ran and jumped with the fire runners. Our cloths were scotched and the screen on my Samsung phone took a hit from a fireworks and cracked, but the videos and memories we take with us is amazing.\n\nThe festival is done annually. We will return. Barcelona and Catalonia is incredible, super friendly and something for everyone. No issue with pickpockets, use common sense. Eat off the tourist paths. Restaurants on every single corner. Get a Metro pass for the week, subway will take you anywhere. We ordered our online a few weeks,before,we,travelled.  Barcelona is just incredible.", "publishedDate": "2014-09-27", "language": "en", "rating": 5}, {"id": 194513398, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d591146-r194513398-Basilica_of_Our_Lady_of_Mercy-Barcelona_Catalonia.html", "text": "The building is surreal. The view from the top is spectacular and the little candles is so cute. You pay from ?0'10 to ?2 to light the candles and knowing my granny all her money would be gone by the end of the trip. The entrance is free and the only thing that costs is going to the top for the view which is optional. The price to go up is free for children and ?3 for adults. It's a must see", "publishedDate": "2014-02-18", "language": "en", "rating": 5}, {"id": 179027087, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d591146-r179027087-Basilica_of_Our_Lady_of_Mercy-Barcelona_Catalonia.html", "text": "Anothrr stunning basilica to enjoy with plenty of photo opportunities. A great find  as you enjoy Barcelona. ", "publishedDate": "2013-09-29", "language": "en", "rating": 4}, {"id": 160277544, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d591146-r160277544-Basilica_of_Our_Lady_of_Mercy-Barcelona_Catalonia.html", "text": "Walking around Barcelona...the first thing you notice is how clean it is...every morning sweeping and washing the streets and it shows.  I stopped taking photo's of the mind blowing architecture after about 30 building because I realized every building on every street was worthy of a photo. It's impossible...there should be a 1000 page book of just architecture photo's...I found the Basilica de la Mar by Gaudi...was this man human?  I can't begin to understand how he could create so much beauty and originality...For decades they thought it was Sand colored but when the totally and to an amazing stand restored the interior it turned out to be almost white...the famous Sand Castle exterior is partly cleaned and is also nearly white. You will wonder what makes it stand up...it looks fragile and you would think it would fall down it is so delicate...Take a lot of time to see it....take a tour as they get in...in groups...the walk in line is wrapped around the block and could take hours to get inside (which is a must) Stain glass mostly restored...so amazing and so modern...breathtaking.  If you are in Barcelona and miss everything Gaudi...which is everywhere...then you missed the chance of a lifetime...would you go to Paris and not see the Eifel Tower?  Barcelona is a tourist must see destination...", "publishedDate": "2013-05-10", "language": "en", "rating": 5}]}}]