[{"locationId": 10065947, "name": "Monumento a Antonio Viladomat", "placeType": "ATTRACTION", "reviewListPage": {"reviews": [{"id": 690665819, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d10065947-r690665819-Monumento_a_Antonio_Viladomat-Barcelona_Catalonia.html", "text": "This monument stands in tribute to, Antoni Viladomat i Manalt, a 13th century Spanish and Baroque painter. His is known for his twenty paintings of Francis of Assisi, some of which are in the MNAC, and this forty paintings depicting the Stations of the Cross and May, which can be found in Basilica de Santa Maria de Mataró, also in Barcelona\n\nThe monument features a life sized statue of the painter. He holds a palette of colours and brushes in his right arm. Funnily enough, he is doesn't appear to be standing in portrait pose, but leaning back as if to admire a finished work.\n\nThis monument stands adjacent to Francisco de Paula Rius i Taulet, opposite the entrance to Parc de Ciutadella. Worth a look if in the area.", "publishedDate": "2019-07-18", "language": "en", "rating": 4}, {"id": 666875599, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d10065947-r666875599-Monumento_a_Antonio_Viladomat-Barcelona_Catalonia.html", "text": "Free.\n\nStanding in front of of the entrance to the Parc de la Ciutadella, this bronze statue of Antoni Viladomat I Manalt commemorate one of the most important Catalan painters of the 18th century. It is said that Viladomet have painted around 600 paintings many of which have since been destroyed.", "publishedDate": "2019-04-16", "language": "en", "rating": 3}, {"id": 627800045, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d10065947-r627800045-Monumento_a_Antonio_Viladomat-Barcelona_Catalonia.html", "text": "Monumento A Antonio Viladomat was another great statue located in the wonderful area were you will find the magnificent Arch De Triomf. \nIt depicts the painter with easil in hand contemplating his next brush stroke,it's a well detailed statue, looks really good,makes for some interesting photographic opportunities .\nEasy to locate on Passeig Lluis Company's  in an area of outstandingly beautiful architecture. \nWell worth checking out. ", "publishedDate": "2018-10-24", "language": "en", "rating": 5}, {"id": 583562223, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d10065947-r583562223-Monumento_a_Antonio_Viladomat-Barcelona_Catalonia.html", "text": "This statue is located on Passeig Lluis Companys, just across from the entry to Parc de la Ciutadella. Viladomat was a Catalan painter in the first half of the 19th century. Some of his works are on display in various venues. 20  paintings on the life of Saint Francis of Assisi are in  the Museu Nacional d'Art de Catalunya and 40 paintings on the Stations of the Cross and the Virgin Mary are in the Basílica de Santa Maria de Mataró.  To be honest I had never previously heard of him until I saw and photographed the monument.", "publishedDate": "2018-05-29", "language": "en", "rating": 4}]}}]