[{"locationId": 8489665, "name": "Gaudi Exhibition Center", "placeType": "ATTRACTION", "reviewListPage": {"reviews": [{"id": 721156612, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d8489665-r721156612-Gaudi_Exhibition_Center-Barcelona_Catalonia.html", "text": "Interesting and informative centre that added another layer of understanding and appciation to Gaudi's work. Well worth a visit\n\nCentre works by use of audio guide which is helpful. However numbering was hard to see and poorly laid out if you wanted to follow it sequentially. It also failed to link other parts of the exhibition which supported Gaudi's approach.", "publishedDate": "2019-10-25", "language": "en", "rating": 4}, {"id": 721054426, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d8489665-r721054426-Gaudi_Exhibition_Center-Barcelona_Catalonia.html", "text": "My family toured Sagrada Familia the day before and found the Gaudi Exhibition Center a great follow-on experience. We learned more about the rationale and experimentation behind the architecture. The audio guide makes the art and displays more meaningful. Worth the price!", "publishedDate": "2019-10-24", "language": "en", "rating": 5}, {"id": 718067719, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d8489665-r718067719-Gaudi_Exhibition_Center-Barcelona_Catalonia.html", "text": "I enjoyed everything in the exhibit. The audio guide had 50 topics! Thanks for gathering all that information in one place. Took me 2 hours to finish the tour.", "publishedDate": "2019-10-13", "language": "en", "rating": 5}, {"id": 716622074, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d8489665-r716622074-Gaudi_Exhibition_Center-Barcelona_Catalonia.html", "text": "We had done Sagrada Familia and a Gaudi walking tour already. Thank goodness we discovered this gem on our last day in Barcelona! I wasn't expecting very much. It totally blew us away. In retrospect, one should do this before doing any other Gaudi experience. It gives you the arc of his life and work, by which the other experiences, including SF, would be better understood. It has more models of the SF than SF itself, not to mention models, including computer models, of other works. It is an audio guided tour. Not only is this the first time I haven't skipped entries in an audio guided tour: several I listened to two or three times. In particular those accompanied by videos. I don't mind saying some gave me goosebumps or made my eyes tear up. Including toward the end when you stand before a pillar that shows his legacy in the architects that followed him.", "publishedDate": "2019-10-09", "language": "en", "rating": 5}, {"id": 713998789, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d8489665-r713998789-Gaudi_Exhibition_Center-Barcelona_Catalonia.html", "text": "Excellent place to see, and learn from the greatest architecture. Summary of Gaudi history with specific details.", "publishedDate": "2019-09-29", "language": "en", "rating": 5}, {"id": 713819853, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d8489665-r713819853-Gaudi_Exhibition_Center-Barcelona_Catalonia.html", "text": "Took a Tour of gothic quarter. Our tour guide Mireia was very enthusiastic and knowledgeable about Spanish history and architecture. This is such a great area to roam around in , especially with someone explaining the historical significance and what you are looking at. Would certainly combine the Gaudí exhibit if you are interested in his work. We didn’t have time for that. ", "publishedDate": "2019-09-29", "language": "en", "rating": 5}, {"id": 709320688, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d8489665-r709320688-Gaudi_Exhibition_Center-Barcelona_Catalonia.html", "text": "Came here and used my Barcelona card to visit this place the centre is very interesting and there is a lot of information about gaudi and it is well worth a visit.", "publishedDate": "2019-09-13", "language": "en", "rating": 4}, {"id": 702070624, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d8489665-r702070624-Gaudi_Exhibition_Center-Barcelona_Catalonia.html", "text": "I spent just under a week in Barcelona (first time), and two days were dedicated to Gaudi's work and museums.  I visited this exhibition after the Sagrada Familia in the morning, and Casa Batllo in the afternoon.  The reason I say this is because I believe the order in which you view the works of Gaudi and learn about his story, will affect your experience in any one of these attractions.  And so, after seeing the stunning architecture, walking through this exhibition was a treat!\n\nFirst of all, the exhibition will take you 2 hours.  I recall around 50 (I think it was 53) audio clips and some videos, and each is roughly 90 seconds long.  So with walking and observation, 1.5-2 hours in total.  These 2 hours are thoroughly rewarding - both during the exhibition, and at the conclusion.  What is beautiful about this exhibition is that it enhances your experience of other Gaudi related attractions, including those you would already have seen.  I must confess that as a frequent traveller, I often see things that I do not fully appreciate the significance of.  This exhibition ensured that was not the case for the various Gaudi pieces I visited during my stay.  \n\nI strongly recommend this to any tourist who has seen any of the Sagrada Familia, Park Guell or Casa Batllo.  I would add a few very minor points: my friend's phone ran out of battery half way through - check this at the beginning and ensure they give you a phone above 50%; some videos weren't working which was a shame, though hopefully they will correct that.  Finally, the Barcelona Card does work here - 50% discount = 7.50euro for the exhibition.", "publishedDate": "2019-08-23", "language": "en", "rating": 5}, {"id": 696986056, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d8489665-r696986056-Gaudi_Exhibition_Center-Barcelona_Catalonia.html", "text": "went to Barcelona for a trip as part of our cruise. saw Los Ramblas, Gaudi's cathedral and several other sights\nday was marred as my husband was pick pocketed less than 2 minutes of getting off the coach", "publishedDate": "2019-08-08", "language": "en", "rating": 4}, {"id": 696828966, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d8489665-r696828966-Gaudi_Exhibition_Center-Barcelona_Catalonia.html", "text": "The gothic quarter guided tour was WONDERFUL. The guide made it engaging to spend an hour learning about the history of Barcelona.\n\nThe museum is well organized and the audioguide was very informative. A great place to visit and discover Gaudí.\n\nWould recommend the tour and the museum to others, including families!", "publishedDate": "2019-08-08", "language": "en", "rating": 5}, {"id": 693373520, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d8489665-r693373520-Gaudi_Exhibition_Center-Barcelona_Catalonia.html", "text": "This is an excellent 4D cinema experience mapping out Gaudi’s works in Barcelona with a booming soundtrack and typical 4D cinema additions.  The show is 20 minutes but that’s long enough, and there’s a really funny surprise at the start which we shouldn’t spoil... ", "publishedDate": "2019-07-28", "language": "en", "rating": 5}, {"id": 693096651, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d8489665-r693096651-Gaudi_Exhibition_Center-Barcelona_Catalonia.html", "text": "I don’t consider myself a connoisseur of art or architecture but the audio guide was very interesting and informative the exhibit was excellent good place to spend some time learning about the most revered man", "publishedDate": "2019-07-27", "language": "en", "rating": 5}, {"id": 691199482, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d8489665-r691199482-Gaudi_Exhibition_Center-Barcelona_Catalonia.html", "text": "Having explored many of Gaudi's buildings on our trip to Barcelona, we were delighted to have this experience.  The audio guide helps you understand how Gaudi created many of his buildings. We also enjoyed the virtual reality.  A great addition to the study of Gaudi.", "publishedDate": "2019-07-20", "language": "en", "rating": 4}, {"id": 689607282, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d8489665-r689607282-Gaudi_Exhibition_Center-Barcelona_Catalonia.html", "text": "A self-guided tour with an audio device.  It allows you to go at your own pace which I enjoyed.  It really gives a good context for the influences to his work.  It is especially good as a foundation before visiting the cathedral and park his work created.", "publishedDate": "2019-07-14", "language": "en", "rating": 4}, {"id": 688419612, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d8489665-r688419612-Gaudi_Exhibition_Center-Barcelona_Catalonia.html", "text": "This was not on our original itinerary but we thought that we would stop by after visiting the cathedral as it is next door. What a positive and uplifting experience. I am only sorry that we did not do it first before going to La Sagrada Familia as it would have added another dimension to that wonderful church.", "publishedDate": "2019-07-10", "language": "en", "rating": 5}, {"id": 688255495, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d8489665-r688255495-Gaudi_Exhibition_Center-Barcelona_Catalonia.html", "text": "We have seen and done most of the Gaudi and other modernisme works in Barcelona.  This was a great supplement to all the Gaudi works because it explains his inspirations and some of his process.  Some of this is similar to the information in the facility under the Sagrada Familia... but different. The items are well displayed and fully explained  on the audio guide and placards.  We were very surprised to learn this museum existed and very happy that we went.", "publishedDate": "2019-07-09", "language": "en", "rating": 4}, {"id": 687623811, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d8489665-r687623811-Gaudi_Exhibition_Center-Barcelona_Catalonia.html", "text": "There were some moments of real fascination and enjoyment of this tour. Following with the audio guide was a little too wordy for me, I felt like the narrator had swallowed a thesaurus and I would say the language could’ve been simplified and made accessible. Some of the numbers on the exhibits were out of order and often we had to spend the first few seconds running around the room to find what the audio was describing. \nThere’s lots to see which can be interesting but I felt it wasn’t all explained, it’s possible I wasn’t keeping up with all that was being said. The most interesting bits made up for  the price of the ticket however and I found it so interesting to learn how Gaudí drew influences from many sources and his passion for creating his own new innovative methods to create his architecture and works of art was second to none. I would recommend going but don’t spend too long there and feel free to skip ahead to parts that catch your eye. \n\nGreat place to cool down on a hot day. Have fun trying to catch your partner’s eye in the clever optical illusion mirror at the end of the museum.", "publishedDate": "2019-07-07", "language": "en", "rating": 3}, {"id": 687249083, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d8489665-r687249083-Gaudi_Exhibition_Center-Barcelona_Catalonia.html", "text": "I thought this was an exceedingly well-done museum. I came away with a deepened appreciation for Gaudi, his inspirations, his design process, and the contributions he made to architecture. The audioguide is outstanding, and the displays are very informative. I'm surprised by some of the negative comments here, but a museum about process and influences is probably always going to be a tougher sell than the actual artifact. If you are looking for more insight into why Gaudi designed the way he did, then I highly recommend this museum. As an example of effective museum design, this one nails it.", "publishedDate": "2019-07-06", "language": "en", "rating": 5}, {"id": 682848579, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d8489665-r682848579-Gaudi_Exhibition_Center-Barcelona_Catalonia.html", "text": "If this were around 5 bucks I'd say it was worth it---but I definitely felt ripped off. I should have known when there was no line. ", "publishedDate": "2019-06-20", "language": "en", "rating": 2}, {"id": 681708518, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d8489665-r681708518-Gaudi_Exhibition_Center-Barcelona_Catalonia.html", "text": "This center has an audioguide and it has a large number of stations.  I rarely listen to all the stations, but this time, I did.  The reason Gaudy is considered more than a genius in Barcelona will become evident as you are take through the history of this man's process.  He built on the Roman genius for engineering and combined it with his world view.  The results are breathtaking, but without the understanding of what he did architecturally, you could mistake it for modern art crazy.  Spend all the time you need in this place, then go see the Sagrada Familia with a guided tour.\n\nWe took the city tour from this venue, and it was fine, but not about Gaudy, but rather just Barcelona historic areas.  It was good, but not great.  The ambient noise on a Saturday was very disturbing to hearing the un-amplified voice of the guide.", "publishedDate": "2019-06-15", "language": "en", "rating": 5}, {"id": 679014918, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d8489665-r679014918-Gaudi_Exhibition_Center-Barcelona_Catalonia.html", "text": "everything you want to know about the designer of the \"la familia\" cathedral in Barcelona including interactive headphones and videos", "publishedDate": "2019-06-04", "language": "en", "rating": 4}, {"id": 675477153, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d8489665-r675477153-Gaudi_Exhibition_Center-Barcelona_Catalonia.html", "text": "We happened onto this small museum after attending a service at the Barcelona Cathedral next door. We were very happy we decided to tour the exhibit. We learned a lot about Gaudi and his work.", "publishedDate": "2019-05-21", "language": "en", "rating": 4}, {"id": 675334583, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d8489665-r675334583-Gaudi_Exhibition_Center-Barcelona_Catalonia.html", "text": "The Gaudi Exhibition Center offers an excellent perspective on the life and achievements of Gaudi. The center is next to the Barcelona Cathedral (not the Sagrada Familia). In addition to static displays the center also offers some audiovisual shows. You should expect to spend 1 to 2  hours here.", "publishedDate": "2019-05-20", "language": "en", "rating": 5}, {"id": 674799971, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d8489665-r674799971-Gaudi_Exhibition_Center-Barcelona_Catalonia.html", "text": "We enjoyed this exhibition very much. There are many of his works on display, information about Gaudi and his visions and arts. We were given a audio set to tell you about each piece of work.", "publishedDate": "2019-05-18", "language": "en", "rating": 5}, {"id": 666664757, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d8489665-r666664757-Gaudi_Exhibition_Center-Barcelona_Catalonia.html", "text": "Very useful and rich exposition to gain better understanding on Antonio Gaudi's phenomena. Good as an introduction before going to enjoy other A.Gaudi's works. Audio guide is available.\nUnfortunately exhibits are exposed in very messy way and tickets are badly overpriced. ", "publishedDate": "2019-04-15", "language": "en", "rating": 3}, {"id": 663964412, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d8489665-r663964412-Gaudi_Exhibition_Center-Barcelona_Catalonia.html", "text": "A nice exhibit with all of gaudi’s famous works and the inspiration and thoughts behind it. We bought the entrance ticket to casa batlo at the same time hence got discounted 7.5 euro ticket. The exhibition is well layed out and the audio guide gave good explanation. ", "publishedDate": "2019-04-05", "language": "en", "rating": 4}, {"id": 663308794, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d8489665-r663308794-Gaudi_Exhibition_Center-Barcelona_Catalonia.html", "text": "For those interested in taking a deep dive into Gaudi’s experience, the Gaudí Exhibition Center is a must see. The exhibition covers the trajectory of his background, education and design. We found it fascinating and a great starting point to visiting the popular Gaudí sights in Barcelona.  Surprisingly, the exhibit had few visitors while we were there despite and long line at the (very) nearby Caterdral. Enjoy!", "publishedDate": "2019-04-02", "language": "en", "rating": 5}, {"id": 657175078, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d8489665-r657175078-Gaudi_Exhibition_Center-Barcelona_Catalonia.html", "text": "Potentially very good experience,but the audio guide is essential.  Ours repeatedly stopped working.  How to reset them was not evident. No guides were anywhere around for help.", "publishedDate": "2019-03-08", "language": "en", "rating": 1}, {"id": 653990486, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d8489665-r653990486-Gaudi_Exhibition_Center-Barcelona_Catalonia.html", "text": "This would be a must visit for any Gaudí fan and even if you’re not you’ll greatly enhance your visit to Barcelona with a visit here because many of Gaudí’s works are prominently featured throughout the city.  It would be impossible to visit Barcelona without encountering a Gaudí building.  The exhibit has great information on how Gaudí worked and his thought process in re architecture, art, space and buildings.  ", "publishedDate": "2019-02-21", "language": "en", "rating": 5}, {"id": 650180511, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d8489665-r650180511-Gaudi_Exhibition_Center-Barcelona_Catalonia.html", "text": "Beautiful building, good audio guide with the option to choose between a shorter and a longer explanation. Interesting combinition of Gaudi and the history of the building itself. The exhibition is arranged orderly and beautifully.\nOverall practical and interesting, a nice place to visit.\nTip: go early, we went at 10am (opening time) and were practically alone there.", "publishedDate": "2019-02-04", "language": "en", "rating": 3}, {"id": 649713993, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d8489665-r649713993-Gaudi_Exhibition_Center-Barcelona_Catalonia.html", "text": "We had a voucher book from Bus touristic so decided to visit. This was a true insight into Gaudi and the work he did. It is good to have the audio tracks to listen to. You are able to select what you want to listening to so you can pick and chose. To start the tour is a audio visual giving you a brief insight to Guadi was. As you walk you can see where we took his inspiration from and breaking his work down into different elements. It may have been worth doing this as the 1st thing as it may have helped as appreciate things more", "publishedDate": "2019-02-02", "language": "en", "rating": 5}, {"id": 645014735, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d8489665-r645014735-Gaudi_Exhibition_Center-Barcelona_Catalonia.html", "text": "Located Pla de la Seu, near the basilica Sagrada Famiglia, a real fantastic Museum, very interesting experience to know more and see videos, photos and the history of Gaudi; most of tourist come with busses and find not time to visit this museum.", "publishedDate": "2019-01-10", "language": "en", "rating": 5}, {"id": 643970536, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d8489665-r643970536-Gaudi_Exhibition_Center-Barcelona_Catalonia.html", "text": "no museum is for everyone. so, when reading a poor review of this museum, i took that into consideration. my view, is, that it was a worthwhile visit. i visited several of gaudi's buildings before going here. this learning experience museum solidified my understanding and appreciation of what was behind this man's genius. allow about an hour to take inn this visit. the last exhibit (54) showed the extent of influence that gaudi has had with today's architectural giants. now that is a legacy.", "publishedDate": "2019-01-06", "language": "en", "rating": 4}, {"id": 642857310, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d8489665-r642857310-Gaudi_Exhibition_Center-Barcelona_Catalonia.html", "text": "Interesting exhibit but is geared primarily to folks who really want to know a lot about Gaudi. Museum was not crowded so we took about an hour to go through the whole thing. Location is great- right beside the Cathedral. The folks at the Gaudi Exhibition Center initially could not locate our Viator booking, that took about 5 minutes, but they were nice and apologetic, so everything is good.", "publishedDate": "2019-01-01", "language": "en", "rating": 3}, {"id": 627700774, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d8489665-r627700774-Gaudi_Exhibition_Center-Barcelona_Catalonia.html", "text": "Enjoyed touring this museum. The price was good (it was 1/2 price the day we went) - in particular you get an audio guide with entry which was useful as everywhere else charges extra for them. The guide was easy to use and means you can chose what you experience. Although without the guide you wouldn't get any information as there are no detailed signs or descriptions of items. There were also interactive elements such as lighting and videos. There was a lot of content and information in the audio guide - if you listened to it all you'd be there a while. \n\nMy only issue was we entered in the evening and by the time we'd done upstairs they'd closed off the end of the tour which goes into the shop. So we didn't get the full experience and we weren't told that we wouldn't when we paid.", "publishedDate": "2018-10-24", "language": "en", "rating": 4}, {"id": 623558844, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d8489665-r623558844-Gaudi_Exhibition_Center-Barcelona_Catalonia.html", "text": "We went to the exhibition centre before visiting the Sagrada Familia. It turned out that wasn’t necessary as the audio guide for the Sagrada Familia is so good. However we did learn some other less well known things about Gaudí, including the work he did to design a small workers village (Colonia Guell) and the church he started there.\n\nUnfortunately The audioguide and exhibits were a bit hard to follow and really long winded in parts. \n\nGreat selection of Gaudí books in the shop!", "publishedDate": "2018-10-09", "language": "en", "rating": 3}, {"id": 623014816, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d8489665-r623014816-Gaudi_Exhibition_Center-Barcelona_Catalonia.html", "text": "This was one of the best things we did in Barcelona. We did it before visiting any of the other Gaudi sites and gave us a new appreciation for his work and it’s meaning. An audio guide is included in the admission, this is a museum with a story and a purpose. Both of us developed a much deeper appreciate for Gaudi, his work and his legacy, after visiting this museum. I would say this should be on every itinerary before visiting any if Gaudi’s sites. It wasn’t crowded at all, not sure if it is relatively new  or if people just skip the history and go straight for the sites, but I say that is a mistake! ", "publishedDate": "2018-10-07", "language": "en", "rating": 5}, {"id": 622740802, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d8489665-r622740802-Gaudi_Exhibition_Center-Barcelona_Catalonia.html", "text": "Only the top floor of the exhibition hall has reconstructed samples of his work. There is a work bench that belonged to Gaudi but otherwise the artwork was from other religious  artists. \nAlthough there is a small elevator here it is not easy to get around if you cant do stairs. ", "publishedDate": "2018-10-06", "language": "en", "rating": 3}, {"id": 621928635, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d8489665-r621928635-Gaudi_Exhibition_Center-Barcelona_Catalonia.html", "text": "If you are in Barcelona to see Gaudi, this is a must-do early in your trip.  Don't visit Sagrada Familia or any of the Gaudi sights, until you stop here.  It's not a WOW place, but it is a great introduction to what you'll experience during your visit to the Gaudi designed/architected locations in the city.  This will give you a glimpse into his genius...explain how he incorporated nature into his works, how he engineered the gravity defying arches, etc.  Get the audio guide and learn who Antoni Gaudi was and what drove his creativity.", "publishedDate": "2018-10-03", "language": "en", "rating": 5}, {"id": 621533122, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d8489665-r621533122-Gaudi_Exhibition_Center-Barcelona_Catalonia.html", "text": "We toured the house. Super Interesting. Took in a Jazz Concert on the roof. The music was fun, the champaine was excellent, and the view of Barcelona at night was romantic.", "publishedDate": "2018-10-02", "language": "en", "rating": 5}, {"id": 618382448, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d8489665-r618382448-Gaudi_Exhibition_Center-Barcelona_Catalonia.html", "text": "This is a museum near the cathedral.  It is easy to get this confused with the Gaudí Experience, which is 4D movie theater near Parc Guell.  This museum is a good overview of Gaudí’s work, and how he did experiments to test architectural theories.  His work with catenaries was groundbreaking.", "publishedDate": "2018-09-21", "language": "en", "rating": 4}, {"id": 615526508, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d8489665-r615526508-Gaudi_Exhibition_Center-Barcelona_Catalonia.html", "text": "Just saying! It’s a hike uphill with some escalators and mostly stairs and uphill paths. It’s a beautiful area and worth the trip. Buy tickets in advance. ", "publishedDate": "2018-09-10", "language": "en", "rating": 5}, {"id": 613260906, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d8489665-r613260906-Gaudi_Exhibition_Center-Barcelona_Catalonia.html", "text": "At first I thought this museum would only take about 30 minutes to look around, but 2hours later, I finished the tour! The audio guide is excellent and each exhibit is worth looking at. I went on a Sunday when it first opened so I had the place to myself for most of my time there..well worth a visit.", "publishedDate": "2018-09-02", "language": "en", "rating": 4}, {"id": 612052683, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d8489665-r612052683-Gaudi_Exhibition_Center-Barcelona_Catalonia.html", "text": "If you do not pre-book your tickets for Park Guell, this is where you would purchase them.  There is a 4-D movie theater here, so they try to sell you the package of park tickets with the movie.  I asked if I could just purchase a park ticket, but was told they were \"sold out for the day.\"  Then, I was told that there were \"movie and ticket\" packages available for that day.  When I explained that I didn't want to see the movie, I was told \"this is all that is available.\"  After hearing me tell my boyfriend that we couldn't see the park and started to leave, the ticket sell informed me that there was a \"free area\" of the park that we could go to.  We chose to do that and realized that 3/4 of Park Guell is in the \"free area.\"  This place just tries to get you to spend money when you really don't need to.", "publishedDate": "2018-08-29", "language": "en", "rating": 2}, {"id": 611311442, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d8489665-r611311442-Gaudi_Exhibition_Center-Barcelona_Catalonia.html", "text": "If you have a lot of time to spend by all means go and see this museum...if not just experience the architectural masterpieces instead. Far more interesting and exciting! The man was sheer brilliance and creativity.", "publishedDate": "2018-08-27", "language": "en", "rating": 3}, {"id": 610553639, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d8489665-r610553639-Gaudi_Exhibition_Center-Barcelona_Catalonia.html", "text": "Before we went to visit popular Gaudi sites, we came to visit the Gaudi Exhibition. This gave us great insights into Gaudi and his work and a much greater appreciation for his work when we visited key sites.", "publishedDate": "2018-08-26", "language": "en", "rating": 5}, {"id": 609197671, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d8489665-r609197671-Gaudi_Exhibition_Center-Barcelona_Catalonia.html", "text": "Don't waste your money. The outrageous 15 Euro entry fee is obscene. I was led to believe there were artifacts related to Gaudi. There was only one single authentic artifact that I saw which was a small drawing box. The pretend museum is filled with reproductions and things that supposedly inspired Gaudi, or were from around the same time he was alive. It seems like most of them had nothing to do with Gaudi. I was misled about this Museum, it really isn't about Gaudi at all but rather about the period he lived in.\nYour time would be much better spent going to the museum Frederic Mares which is around the corner and was quite extensive and spectacular and only cost about 4 euros.  Since you're in Barcelona, why not just walk on the streets and see the real Gaudi. Why pay an outrageous admission fee to see objects that had very little if anything to do with him at all.", "publishedDate": "2018-08-22", "language": "en", "rating": 1}, {"id": 608386870, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d8489665-r608386870-Gaudi_Exhibition_Center-Barcelona_Catalonia.html", "text": "Need to pay 15€, for students 12€. For that price stuff from museum will give you the earphones and android phone for listening the information about all what they have inside exhibition center. Informative, attractive. ", "publishedDate": "2018-08-20", "language": "en", "rating": 5}, {"id": 606441412, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d8489665-r606441412-Gaudi_Exhibition_Center-Barcelona_Catalonia.html", "text": "We love Gaudi architecture and came here on our second visit to Barcelona after visiting many of Gaudi’s best. This museum provided interesting interpretation but is presented in a dry fashion. The audio guide mostly repeated the signs and missed the opportunity to hear words from the great man himself or other people who knew him personally.  More interactive displays would help. Most of the virtual reality seats didn’t work and the single working position didn’t have adequate instructions. Once it worked it was good. The staff were very welcoming. It was hot when we visited so the aircon was welcome.", "publishedDate": "2018-08-14", "language": "en", "rating": 3}, {"id": 604919510, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d8489665-r604919510-Gaudi_Exhibition_Center-Barcelona_Catalonia.html", "text": "On arrival I was delighted to learn that the entrance fee had been lowered. The commentary was informative and I learned a lot during my visit. I would have liked to learn more about Gaudi’s other works. The staff was friendly and helpful.", "publishedDate": "2018-08-10", "language": "en", "rating": 3}, {"id": 601148341, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d8489665-r601148341-Gaudi_Exhibition_Center-Barcelona_Catalonia.html", "text": "I don't quite understand the quality of reviews here.... I thought it was a poor exhibition. A little bit about the man but very little information about many of his famous buildings. I was hoping to get a good overview of the main buildings to decide which ones to see, but no. Two of the three VR headsets were out of order.", "publishedDate": "2018-07-30", "language": "en", "rating": 2}, {"id": 599548691, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d8489665-r599548691-Gaudi_Exhibition_Center-Barcelona_Catalonia.html", "text": "Let me be clear, I am not a Gaudi enthusiast, yet I was greatly impressed with the Gaudi Exhibition Centre. It perfectly illustrates in various ways the art of this remarkable man.", "publishedDate": "2018-07-25", "language": "en", "rating": 4}, {"id": 599083765, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d8489665-r599083765-Gaudi_Exhibition_Center-Barcelona_Catalonia.html", "text": "The Gaudi Exhibition Center makes an informative sequel to a visit to La Segrada Familia (LSF). They changed my view of Gaudi completely. I had an ill-informed opinion that Gaudi was a mediocre talent with a flair for the bizarre and unusual; in fact I assumed that his surname was the origin of the word gaudy. I couldn't have been more wrong. \n\nI left with an entirely different opinion: LSF embodies Gaudi's deep religious convictions, and its design is the product of dedicated genius. I may not share Gaudi's religious convictions, but his genius is reflected in his work. \n\nOne of the most impressive exhibits was the \"upside-down wire-frame structural model\" of LSF: As you walk in the main basilica of LSF, and look at the massive stone supporting structure, you see that it resembles the branches of a giant tree (several giant trees). It occurred to me that a structural analysis would have been essential for such a complex structure, and I wondered how (or even if) such an analysis had been done. Gaudi's \"analysis\" was revealed in one of the exhibits - the \"upside-down wire-frame structural model\"! Briefly, Gaudi constructed a wire frame scaled model of LSF, mounted it to a board, and turned it upside down. He simulated the loading on the structure by hanging small bags with weights in them from the upside-down wire frame. I was impressed! \n\nThe Exhibit also told the shocking and sad story of Gaudi's death. I'll not spoil this by describing it here - another incentive to see it for yourself!", "publishedDate": "2018-07-23", "language": "en", "rating": 5}, {"id": 599048615, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d8489665-r599048615-Gaudi_Exhibition_Center-Barcelona_Catalonia.html", "text": "I was disappointed in this museum. It's well put together and all but you are looking at the religious art and other elements of flora or fauna that Gaudi stylized and used in his works. Not an \"exhibit\" by my definition. Audio guide, nonetheless, was helpful understanding what bits Gaudi used, where and why.", "publishedDate": "2018-07-23", "language": "en", "rating": 3}, {"id": 598668536, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d8489665-r598668536-Gaudi_Exhibition_Center-Barcelona_Catalonia.html", "text": "This is a very modern museum exhibition rich with artifacts and good labels to help you build your understanding and appreciation for Gaudi's incredible architecture. \nI agree with others' who said they expected a more technological/interactive experience in the exhibition, since the tech is really pushed in the advertisements I saw. The virtual reality viewers were not that easy to use and there were only 2 working units (out of 3 total).\nBut that said, it was a really great exhibition overall. The part that blew me away was the reversed gravity models Gaudi built. They were just so brilliant and I don't think I could have understood the idea if it were in a book or on a website.", "publishedDate": "2018-07-22", "language": "en", "rating": 5}, {"id": 589611654, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d8489665-r589611654-Gaudi_Exhibition_Center-Barcelona_Catalonia.html", "text": "An excellent introduction to the life and work of Gaudi. It makes your visit to La Sagrada Familia and other sites much richer.", "publishedDate": "2018-06-21", "language": "en", "rating": 5}, {"id": 586947434, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d8489665-r586947434-Gaudi_Exhibition_Center-Barcelona_Catalonia.html", "text": "I expected much more interactive environment here. It turned out to be a museum, even though it was a really nice one. I paid 15 euro and got audio guide included, which I liked. The best thing was last 2 or 3 rooms with information about Sagrada Familia.", "publishedDate": "2018-06-12", "language": "en", "rating": 3}, {"id": 586022716, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d8489665-r586022716-Gaudi_Exhibition_Center-Barcelona_Catalonia.html", "text": "The exhibition in the 'attic' of the Casa Mila is fascinating.  It explains how Gaudi planned and constructed his many amazing buildings.", "publishedDate": "2018-06-08", "language": "en", "rating": 5}, {"id": 582972772, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d8489665-r582972772-Gaudi_Exhibition_Center-Barcelona_Catalonia.html", "text": "All this art together in one place GAUDI his imagination was crazy...\nWhat an artist . i stayed there and just looking and thinking more than 2 hours", "publishedDate": "2018-05-27", "language": "en", "rating": 5}, {"id": 581093640, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d8489665-r581093640-Gaudi_Exhibition_Center-Barcelona_Catalonia.html", "text": "This may be a bit expensive, but that may be a positive in reducing the crowds.  If you don’t know anything much about Gaudi visit this exhibition first and things will make a lot more sense.", "publishedDate": "2018-05-18", "language": "en", "rating": 5}, {"id": 580422141, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d8489665-r580422141-Gaudi_Exhibition_Center-Barcelona_Catalonia.html", "text": "We happened to stumble upon this place and took the tour and really enjoyed it! There wasn’t a line, late afternoon so we were able to go right in!", "publishedDate": "2018-05-15", "language": "en", "rating": 5}, {"id": 577103899, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d8489665-r577103899-Gaudi_Exhibition_Center-Barcelona_Catalonia.html", "text": "Very good exhibition, layout is very good, good information.  Liked the idea of having the audio guide included in the price.  A pity that they did not include more info on other Gaudi designs such but I guess you have to go to them directly.", "publishedDate": "2018-05-01", "language": "en", "rating": 4}, {"id": 573416213, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d8489665-r573416213-Gaudi_Exhibition_Center-Barcelona_Catalonia.html", "text": "Opted to see this before seeing multiple Gaudi sites later in the week.  Found it very helpful to give us background and appreciation for his accomplishments.  Audio guide is good.  Relatively small center so easy to fit this in before or after visit to The Cathedral as it is next door.  ", "publishedDate": "2018-04-15", "language": "en", "rating": 5}, {"id": 571529880, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d8489665-r571529880-Gaudi_Exhibition_Center-Barcelona_Catalonia.html", "text": "I learned a tremendous amount about Gaudi, his structures and architecture in general. We stumbled in the last day of our visit and it may be nice to start here as you would have a deeper understanding of the city as you explore.", "publishedDate": "2018-04-06", "language": "en", "rating": 5}, {"id": 569412782, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d8489665-r569412782-Gaudi_Exhibition_Center-Barcelona_Catalonia.html", "text": "If you have seen the Sagrada Familia then go and find this museum to see other examples of Gaudi's genius. Models of buildings he designed and furniture he created open a window into a unique mind. The displays are on a number of floors close to the old cathedral and not far from the Ramblas. ", "publishedDate": "2018-03-28", "language": "en", "rating": 5}, {"id": 567929813, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d8489665-r567929813-Gaudi_Exhibition_Center-Barcelona_Catalonia.html", "text": "We were taking the hop-on, hop-off tour and hopped off to visit the Barcelona Cathedral. Before going to the Cathedral, we visited the Gaudi Exhibition Center next door. We were so enthralled with his work, we went straight over to Casa Batllo. The exhibition gives you much more detail about Mr. Gaudi and how his style was inspired.", "publishedDate": "2018-03-21", "language": "en", "rating": 5}, {"id": 566694080, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d8489665-r566694080-Gaudi_Exhibition_Center-Barcelona_Catalonia.html", "text": "This is a very informative Exhibition centre at which you will learn a great deal about the very talented Gaudi.  The exhibits and displays are excellent as is the audio guide.", "publishedDate": "2018-03-15", "language": "en", "rating": 5}, {"id": 559433994, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d8489665-r559433994-Gaudi_Exhibition_Center-Barcelona_Catalonia.html", "text": "Truly excellent; make this your first place to visit in Barcelona as you will understand everywhere afterwards so much better. The audioguide is most helpful and, if there is one in your native language, you will want 2-3 hours to make the most of this museum which is also called Museu Diocesa de Barcelona. They have cleverly integrated the religious relics which clearly used to be the main focus of the old exhibition into an absorbing and informative display over several floors, now mainly about Gaudi.", "publishedDate": "2018-02-09", "language": "en", "rating": 5}, {"id": 558808971, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d8489665-r558808971-Gaudi_Exhibition_Center-Barcelona_Catalonia.html", "text": "Situated by the cathedral, it is difficult to miss the Gaudi Exhibition. At first I felt the cost of 15€ each was a bit steep. However, the tour is split into two sections, with a huge amount to see. The exhibition gave a fantastic insight into Gaudi's life, work and influences. If you're a fan of Gaudi, I would definitely recommend going to the exhibition!", "publishedDate": "2018-02-06", "language": "en", "rating": 4}, {"id": 552097590, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d8489665-r552097590-Gaudi_Exhibition_Center-Barcelona_Catalonia.html", "text": "We toured 5 Gaudi designed structures in Barcelona. That man was a genius architect. Most unusual was that there are few if any squares in his buildings. I especially liked the exhibition center because it contained small scall replicas of some of his structures.", "publishedDate": "2018-01-06", "language": "en", "rating": 5}, {"id": 539838570, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d8489665-r539838570-Gaudi_Exhibition_Center-Barcelona_Catalonia.html", "text": "This location provides a nice capsule summary of Gaudi and his amazing work.  By the end of the guided tour (recommended) you have a feel for the man's collective and humanistic philosophy.  While the displays are naturally in miniature, they are presented with comments that help picture and amplify his attitudes and work ethic.  Gift shop at the end of the tour is small, but tempting.", "publishedDate": "2017-11-09", "language": "en", "rating": 4}, {"id": 539401089, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d8489665-r539401089-Gaudi_Exhibition_Center-Barcelona_Catalonia.html", "text": "It's quite expensive for the actual works exhibited, is better to visit the buildings. Very focused on religious topics and very little on his actual buildings /drawings /models. ", "publishedDate": "2017-11-08", "language": "en", "rating": 2}, {"id": 537955482, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d8489665-r537955482-Gaudi_Exhibition_Center-Barcelona_Catalonia.html", "text": "We were expecting great things after reading the positive reviews, however we left fairly disappointed. For 15euro we were expecting to see alot more of Gaudis original works rather than a few scattered shards of stained glass and umpteen pieces of religious artwork by other people. The best parts were the models and videos. \n", "publishedDate": "2017-11-02", "language": "en", "rating": 2}, {"id": 537478183, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d8489665-r537478183-Gaudi_Exhibition_Center-Barcelona_Catalonia.html", "text": "We saw many Gaudí structures on our city tour, so decided to use our limited time in the city to find out more about the man, rather than tour his creations. This exhibit does a wonder job of exploring what he was interested in doing, what he thought, and how he came to create his designs. Audio tour is included in ticket, a great deal of stairs, but there is an attractive  elevator to use if needed. A little hard to find, just to the left of Barcelona Cathredral main square.", "publishedDate": "2017-10-31", "language": "en", "rating": 5}, {"id": 535740157, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d8489665-r535740157-Gaudi_Exhibition_Center-Barcelona_Catalonia.html", "text": "My brother is in architecture, so when we visited Barcelona, this place was a must.  Great museum, with helpful audio tour.  You'll enjoy the Sagrada Familia more if you see this background information first.", "publishedDate": "2017-10-24", "language": "en", "rating": 5}, {"id": 530391405, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d8489665-r530391405-Gaudi_Exhibition_Center-Barcelona_Catalonia.html", "text": "We toured with a group of seven people. This is a magnificent museum which displayed so many beautiful structures and pieces of art. It is well worth the visit and was thoroughly enjoyed by all.", "publishedDate": "2017-10-05", "language": "en", "rating": 5}, {"id": 530027200, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d8489665-r530027200-Gaudi_Exhibition_Center-Barcelona_Catalonia.html", "text": "I highly reccommend this before going to the Sagrada Familia.  It's a wonderful place to learn about Gaudi and the wonderous life he had.  How things came to be.  Its a self-guided tour with head phones and you can go at your own pace.  I spent around 2 hours here before walking 45 mins to the Sagrada F.  Doing this first gave me so much more an appreciation for Gaudi and his work.  It was clean and not crowded (8 people including me).  Also, you can take photos!!", "publishedDate": "2017-10-04", "language": "en", "rating": 5}, {"id": 525286380, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d8489665-r525286380-Gaudi_Exhibition_Center-Barcelona_Catalonia.html", "text": "This museum you must visit if you are interested in Gaudi's work. We didn't even know it was there. We were heading for the Barcelona Cathedral and found this museum right next door in the same placa. It is an amazing exhibition showing how Gaudi thought up some of his brilliant creations.", "publishedDate": "2017-09-17", "language": "en", "rating": 5}, {"id": 523031742, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d8489665-r523031742-Gaudi_Exhibition_Center-Barcelona_Catalonia.html", "text": "Well worth a visit Lots to see and learn about and you're never too old to learn! You can also buy a combined ticket to visit Casa de les Punxes which will save you around €2:50", "publishedDate": "2017-09-10", "language": "en", "rating": 4}, {"id": 521473890, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d8489665-r521473890-Gaudi_Exhibition_Center-Barcelona_Catalonia.html", "text": "I really wish I had visited this museum before seeing any of Guadi's other buildings and work. It is a great overview of the man, his time and his work. You can really appreciate the artist and genius that he was after you visit. The best thing about it is that it is a very inexpensive museum to see. We got tickets online which saved us money and enabled us to skip the line. Give yourself about 1 hour to go through the museum. The exhibition is laid out really well and is an audio tour. Just beware that you need to sinc up the opening presentation. We were a bit behind on it.", "publishedDate": "2017-09-05", "language": "en", "rating": 4}, {"id": 515955566, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d8489665-r515955566-Gaudi_Exhibition_Center-Barcelona_Catalonia.html", "text": "We visited this exhibition first (before visiting Gaudi buildings) and are so pleased we did. The exhibition covers the development of Gaudi's work, his influences and shows how he developed as an architect and designer. You will learn more about Gaudi than you can imagine, and then look at his works around the city with an educated perspective. A must for Gaudi enthusiasts. We took the audio tour which was very informative and probably provided vey useful additional information and commentary to the videos along the way. The exhibition was well laid and very comfortable to walk through.", "publishedDate": "2017-08-21", "language": "en", "rating": 5}, {"id": 515704769, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d8489665-r515704769-Gaudi_Exhibition_Center-Barcelona_Catalonia.html", "text": "In case you are not aware of it, Barcelona is all about it's favorite son, Antoni Gaudi.  There is plenty to see in Barcelona that Gaudi did as an architect.   If you are interested in learning more behind this genius I recommend this highly.  It will take about an hour to go through the exhibit.  Once again, this is not for all but rather those individuals that want to better understand his background and what his thought process was behind creating many of the iconic sites in Barcelona.  \n\nThis is located in the Gothic Quarter, a short distance from Las Ramblas, directly to the left of the main entrance to the Barcelona Cathedral. Be aware, it is not so easy to find by street address.", "publishedDate": "2017-08-20", "language": "en", "rating": 4}, {"id": 514388583, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d8489665-r514388583-Gaudi_Exhibition_Center-Barcelona_Catalonia.html", "text": "Honestly worth visiting before you view some of gaudi's works (i.e sagrada familia, park guell etc.) so that you can fully appreciate the genius and thought process behind each of the designs and builds. A very thought provoking experience that allows you to go on to view his buildings in a new light. Plenty to see in the experience, would only recommend if you've allowed the time to thoroughly enjoy, explore and take it all in as it did take over an hour for us to look around everything. Information sheets available in a variety of languages as all of the signs are in Catalan. Some areas prohibit photos. Nice gift shop also. Fantastic and enlightening experience. ", "publishedDate": "2017-08-17", "language": "en", "rating": 5}, {"id": 512235749, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d8489665-r512235749-Gaudi_Exhibition_Center-Barcelona_Catalonia.html", "text": "A very worth while trip to make. It is very informative about the works of Gaudi.\nIt gives you an insight into the man and his work and techniques.", "publishedDate": "2017-08-13", "language": "en", "rating": 5}, {"id": 510555917, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d8489665-r510555917-Gaudi_Exhibition_Center-Barcelona_Catalonia.html", "text": "This is the perfect place to get an introduction to Gaudì and his fascinating work.  This exhibit demonstrates how Gaudì was inspired and the amazing way in which he combined art, science and engineering to create the amazing masterpieces we are left to enjoy today.  Terrific exhibit.  Well worth seeing!", "publishedDate": "2017-08-09", "language": "en", "rating": 5}, {"id": 509043497, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d8489665-r509043497-Gaudi_Exhibition_Center-Barcelona_Catalonia.html", "text": "This is situated close to the Cathedral and is easy to miss.It is quite a small museum which details how Gaudi worked, taking you through his input into the design of the Cathedral and other commissions as well as the Basilica of the Sagrada Familia. There are good written descriptions and the audio guide is excellent, being linked into both video and static displays.", "publishedDate": "2017-08-05", "language": "en", "rating": 5}, {"id": 508748808, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d8489665-r508748808-Gaudi_Exhibition_Center-Barcelona_Catalonia.html", "text": "If you have time to learn a bit about Gaudi, his life, his passion, and his architecture then go here. Paid 12 euros to get in. Starts with some comic exhibition then a video background before going into the exhibits. Plenty of stairs to climb. It took us about an hour and quarter to do the whole thing but learned a lot and saw the processes behind the architecture. Small gift shop and loos at the end. Definitely worth the visit.", "publishedDate": "2017-08-04", "language": "en", "rating": 5}, {"id": 507807576, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d8489665-r507807576-Gaudi_Exhibition_Center-Barcelona_Catalonia.html", "text": "We wanted somewhere to go out of the heat and I had read a review of this exhibition in a magazine.  We were not disappointed and learnt a lot about Gaudi the man - not just his buildings.  The audio guide was excellent - easy to use and very clear.   You could go round quite quickly or expand on many subjects which we did.", "publishedDate": "2017-08-01", "language": "en", "rating": 5}, {"id": 505431524, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d8489665-r505431524-Gaudi_Exhibition_Center-Barcelona_Catalonia.html", "text": "If you're a Gaudi fan or still hesitant to be, this is a good introduction to his genius. I like how very organized it is and how there are short clips which came with the audio guide. My only complaint is that I find the price a bit too much. €10 or less would be okay but €15 is a bit too much for it. But I was well informed about Gaudi when I went, and wished there's more content because Gaudi is such a fascinating subject! ", "publishedDate": "2017-07-25", "language": "en", "rating": 3}, {"id": 503304039, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d8489665-r503304039-Gaudi_Exhibition_Center-Barcelona_Catalonia.html", "text": "Don't worry, if the exhibit starts slow. It picks up momentum and interest, not only in the man, but the architect and his approach.\n\nThis exhibit has just opened. The building is a lovely old brick facility.  Give yourself about 1 1/2 hours.  You won't be sorry.\n", "publishedDate": "2017-07-18", "language": "en", "rating": 5}, {"id": 500416622, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d8489665-r500416622-Gaudi_Exhibition_Center-Barcelona_Catalonia.html", "text": "This is completely underrated and gives such a good insight into Gaudi's style, work and thought process. Purchase the VR experience as well. The audio tour is a little confusing but really cool tour of Gaudi's start, life, inspiration and his tools he used to build structures. I also liked they included work that was never started or finished.\n\nThis is a great introduction to all of the locations you need to visit in Barcelona. \n\nThis building was also part of the Basilica at one point, the building itself is also amazing. This is located right next to The Basilica of Santa Maria del Mar.", "publishedDate": "2017-07-10", "language": "en", "rating": 5}, {"id": 499266755, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d8489665-r499266755-Gaudi_Exhibition_Center-Barcelona_Catalonia.html", "text": "Our son had gone here and recommended that we go, and we agree.  It's a really well done exhibit with an informative and interesting audio tour.  We learned a ton about who Gaudi was, what his work was all about, how he designed, etc.  It was a really helpful introduction before going to see the Sagrada Familia and the Casa Batllo on the days after this. We're really glad we had done this first because you could really get insights into the designs of the other Gaudi works.", "publishedDate": "2017-07-06", "language": "en", "rating": 5}, {"id": 499239611, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d8489665-r499239611-Gaudi_Exhibition_Center-Barcelona_Catalonia.html", "text": "There are far better ways to spew your time in Barcelona and as for Gaudi it makes more sense to enjoy his work rather than to visit this commercial exhibit", "publishedDate": "2017-07-06", "language": "en", "rating": 1}, {"id": 494455213, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d8489665-r494455213-Gaudi_Exhibition_Center-Barcelona_Catalonia.html", "text": "This museum was not on my list in the beginning. But when I stepped into the place, I listened to the audio guide, and followed the exhibition from the beginning to the end, I realized that I do understand Gaudi better, and now I knows a little bit more about the reason why he built this in this way, that in that way.\n\nI really think this is a place you should visit, before or after you go to the other Gaudi buildings.", "publishedDate": "2017-06-20", "language": "en", "rating": 5}, {"id": 492565654, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d8489665-r492565654-Gaudi_Exhibition_Center-Barcelona_Catalonia.html", "text": "We aren't exactly Gaudi buffs but thought this might be a good intro before we visit La Sagrada Familia - so glad we did! The museum is really well laid out with different media types to keep you interested. I found the last few rooms the most interesting - particularly the recreations of the hanging models. We spent about an hour and a half there. Great activity for a hot afternoon. ", "publishedDate": "2017-06-12", "language": "en", "rating": 5}, {"id": 487847502, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d8489665-r487847502-Gaudi_Exhibition_Center-Barcelona_Catalonia.html", "text": "Very interesting exhibition on gaudi . Reasonably priced. Goes into quite a lot of depth on his death in a special exhibition. Great models of his works. Well worth a look.", "publishedDate": "2017-05-25", "language": "en", "rating": 5}, {"id": 487707079, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d8489665-r487707079-Gaudi_Exhibition_Center-Barcelona_Catalonia.html", "text": "We thoroughly enjoyed this museum which sits beside the Barcelona cathedral. It covered his life, his death, what influenced him and the cathedral that was never built but like a little sister to the Sagrada familiar. Absolutely worth a visit as his influence on Barcelona has been immense. ", "publishedDate": "2017-05-25", "language": "en", "rating": 5}, {"id": 485541927, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d8489665-r485541927-Gaudi_Exhibition_Center-Barcelona_Catalonia.html", "text": "The Gaudi name goes hand in hand with Barcelona. Everywhere you look there will be something that reminds you of the great architect that was Gaudi.\nThe Exhibition center, even though it looks small from the outside, it offers a good depth of information on the man that was Gaudi.\nA digital guide is available in several languages, and along with the exhibits and the videos available, you get a better understanding of the life and works of Gaudi.\nI thoroughly enjoyed getting to understand some of the techniques and ideas this great man used so many years ago. \nWorth a visit!", "publishedDate": "2017-05-19", "language": "en", "rating": 5}, {"id": 484481182, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d8489665-r484481182-Gaudi_Exhibition_Center-Barcelona_Catalonia.html", "text": "Hadn't had much interest in this chap or his works until we came across this place which is open on a Monday when most other museums are shut. Doesn't seem mentioned in standard tourist guides but if you like your art / architecture history as well as understanding key influences on Gaudi's work then this place us a must. Make sure you listen/ watch all the AV to fully appreciate the experience! I was non commital about visiting his so called amazing works of architecture.... After this I am keen to check them all out! ", "publishedDate": "2017-05-15", "language": "en", "rating": 5}, {"id": 480923899, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d8489665-r480923899-Gaudi_Exhibition_Center-Barcelona_Catalonia.html", "text": "This is the first place we visited in Barcelona and it was such an inspiring beginning to our trip.  The life and works of Gaudi were so beautifully and authentically presented that I was brought to tears. This museum is excellent and the gift shop is amazing, also.  Seeing this museum has really whetted my appetite for seeing the works of Gaudi in Barcelona.  I highly recommend this exhibition for anyone who wants to be inspired by and educated about the humble and ingenious Gaudi and his huge impact in Barcelona and the world.", "publishedDate": "2017-05-02", "language": "en", "rating": 5}]}}]