[{"locationId": 246190, "name": "Gaudi House Museum", "placeType": "ATTRACTION", "reviewListPage": {"reviews": [{"id": 739309733, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d246190-r739309733-Gaudi_House_Museum-Barcelona_Catalonia.html", "text": "A nice place to wander around an hour should be plenty of time.Buy tickets on-line before hand and beat the queue’s.Some interesting pieces of furniture although they are mostly replicas.", "publishedDate": "2020-01-15", "language": "en", "rating": 5}, {"id": 737036702, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d246190-r737036702-Gaudi_House_Museum-Barcelona_Catalonia.html", "text": "It is interesting, but there is not actually much to see. The film about Gaudi's life is informative.", "publishedDate": "2020-01-05", "language": "en", "rating": 3}, {"id": 731047828, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d246190-r731047828-Gaudi_House_Museum-Barcelona_Catalonia.html", "text": "This museum is situated in Park Guell, and is very interesting. You have to pay only 5 euros to see the place where Gaudi lived for 20 years.", "publishedDate": "2019-12-06", "language": "en", "rating": 5}, {"id": 728220798, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d246190-r728220798-Gaudi_House_Museum-Barcelona_Catalonia.html", "text": "Absolutely marvelous from start to finish. Get the headphones. Guides are great. Wonderful coffee table books. ", "publishedDate": "2019-11-22", "language": "en", "rating": 5}, {"id": 725720374, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d246190-r725720374-Gaudi_House_Museum-Barcelona_Catalonia.html", "text": "My son is studying architecture so this was a must during our visit to Barcelona.  It was interesting to learn about the man and the architecture.  Great way to spend a few hours.", "publishedDate": "2019-11-11", "language": "en", "rating": 5}, {"id": 722306416, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d246190-r722306416-Gaudi_House_Museum-Barcelona_Catalonia.html", "text": "Gaudi had an imagination and design scheme unlike anything I have ever witnessed.  The whimsical colors and architecture are worth at least a quick visit if you are in Barcelona.", "publishedDate": "2019-10-29", "language": "en", "rating": 5}, {"id": 722103764, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d246190-r722103764-Gaudi_House_Museum-Barcelona_Catalonia.html", "text": "Amazing house with so many architectural design touches \nBeautifully restored and a very interesting support guide accompanies on an iPhone like device", "publishedDate": "2019-10-28", "language": "en", "rating": 5}, {"id": 720460910, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d246190-r720460910-Gaudi_House_Museum-Barcelona_Catalonia.html", "text": "There is not a lot to see in the museum but, combined with the visit of Park Guell, Sagrada Familia and some of the houses designed by Gaudi, provides a better idea about Gaudi.", "publishedDate": "2019-10-22", "language": "en", "rating": 4}, {"id": 719919307, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d246190-r719919307-Gaudi_House_Museum-Barcelona_Catalonia.html", "text": "It seemed a bit over rated but the park surrounding the museum is beautiful. It is a good distance from the Gothic quarter so if you like to visit a city by foot it’s a great and long walk to explore Barcelona.", "publishedDate": "2019-10-20", "language": "en", "rating": 3}, {"id": 717642920, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d246190-r717642920-Gaudi_House_Museum-Barcelona_Catalonia.html", "text": "We did this after the Sagrada morning tour and had to take a cab, but walking through the Park and then into the museum was well worth it. A good combo day tour--online they figure tours to give you plenty of time to do both. We stopped in between the 2  for a bite to eat. La Sagrada tour at 10:00 am and Gaudi House 1:00 pm - although they let us in at 12:30 pm.", "publishedDate": "2019-10-12", "language": "en", "rating": 5}, {"id": 717398040, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d246190-r717398040-Gaudi_House_Museum-Barcelona_Catalonia.html", "text": "We bought this with our Sagrada Familia ticket and I'm glad we got to check it out. Gave a great history on Gaudi. Only downside is that we didn't realize this was separate from the other ticketed area of the park and tickets for that were sold out.", "publishedDate": "2019-10-11", "language": "en", "rating": 4}, {"id": 716925958, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d246190-r716925958-Gaudi_House_Museum-Barcelona_Catalonia.html", "text": "Total waste of money. There is a toilet inside and a small room sleeping room.\nIts enought to look from outside! ", "publishedDate": "2019-10-09", "language": "en", "rating": 2}, {"id": 714773352, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d246190-r714773352-Gaudi_House_Museum-Barcelona_Catalonia.html", "text": "Guadi had an incredible  gift. His brilliance in architecture was amazing. This house is something if you are in Barcelona you most take the time to visit.", "publishedDate": "2019-10-02", "language": "en", "rating": 5}, {"id": 708275129, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d246190-r708275129-Gaudi_House_Museum-Barcelona_Catalonia.html", "text": "Mr Gaudi had a unique eye for buildings.  This house was cheap to get in, I think 7 euro, and was interesting enough.  I think it best to buy tickets before you leave home as you may not be able to get in the same day if you don't.  We bought our tickets before leaving home and were guaranteed entrance as we only had a few hours.  The house is small so it doesn't take long to read the posts inside and take a look.", "publishedDate": "2019-09-09", "language": "en", "rating": 3}, {"id": 707137833, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d246190-r707137833-Gaudi_House_Museum-Barcelona_Catalonia.html", "text": "Really interesting museum a must see for a trip to Barcelona as gaudi’s Creations are all over the city. We listened to the audio as we walked around and even my teenagers found bits interesting", "publishedDate": "2019-09-06", "language": "en", "rating": 4}, {"id": 706385830, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d246190-r706385830-Gaudi_House_Museum-Barcelona_Catalonia.html", "text": "This house, the first one erected on the Guell complex, became the home for the architect Gaudi in the last 20 years of his life. It recreates, by films, pictures and objects, the atmosphere where Gaudi lived and worked. You need to pay a different ticket from the park, but it is definitely an impressive experience. Great view on the city and on the sea.", "publishedDate": "2019-09-04", "language": "en", "rating": 5}, {"id": 703295567, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d246190-r703295567-Gaudi_House_Museum-Barcelona_Catalonia.html", "text": "Worth seeing, however Casa Battlo and Casa Vicens are more worth it. I didn't go inside Casa Mila so I cannot speak for that one. Casa Battlo is a must-see. If you miss this one, you're not missing that much.", "publishedDate": "2019-08-26", "language": "en", "rating": 3}, {"id": 702441104, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d246190-r702441104-Gaudi_House_Museum-Barcelona_Catalonia.html", "text": "It's a long uphill slog if you go from the subway station. I guess you can get a bus or taxi that will drop you just above Gaudi House. My wife struggled to make it up the hill even after our taxi driver dropped us near the paid entrance to Park Guell (he had never heard of the Gaudi House Museum). It's about 100 steps up from that point. The house itself is very interesting. But, you can see the outside of it for free. There is really not a whole lot to see on the inside. I spent about 10 minutes walking through it.", "publishedDate": "2019-08-24", "language": "en", "rating": 4}, {"id": 699921253, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d246190-r699921253-Gaudi_House_Museum-Barcelona_Catalonia.html", "text": "so me and my 4 friends did a 2 hour walk journey of site seeing and to end our day we came to the Gaudi house.\nhow wonderful the park is and all his work, it was so different and so nice to see.", "publishedDate": "2019-08-17", "language": "en", "rating": 5}, {"id": 698907491, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d246190-r698907491-Gaudi_House_Museum-Barcelona_Catalonia.html", "text": "Since I was visiting Park Guell I took the opportunity to visit the man with the vision himself, well his home, and it was nice. There was not much to it, a bunch of pictures and rooms with layouts of furniture and what he presumably did during his time in those spaces. There is a video playing that gives more insight into his life, and that's pretty much it. If you don't get the chance to see it, it's not the end of the world, but it's nice if you do.", "publishedDate": "2019-08-14", "language": "en", "rating": 3}, {"id": 698894391, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d246190-r698894391-Gaudi_House_Museum-Barcelona_Catalonia.html", "text": "Visit the unexpected!! The architecture is unique and unbelievable!! Be sure to capture the interior stairwell and notice the change in color and dimension of tile. Also visit the garden and rooftop, lovely places to relax. This is a surprise and a an architectural leaning experience. \nCapn Greg", "publishedDate": "2019-08-14", "language": "en", "rating": 5}, {"id": 697675813, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d246190-r697675813-Gaudi_House_Museum-Barcelona_Catalonia.html", "text": "Mr. Ghaudi seems to be very religious as there was a Maria and Jesus, just at the entrance, and there was a church in his house. The interior decoration of the house is also Gaudi's work. The house is located in Guel park, a little far from the house.", "publishedDate": "2019-08-10", "language": "en", "rating": 4}, {"id": 697330009, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d246190-r697330009-Gaudi_House_Museum-Barcelona_Catalonia.html", "text": "We only came here because we already were going to Park Guell and because I already purchased entrance tickets to the museum with our Sagrada Familia tickets. It was definitely not worth the extra euros. \n\nThe House Museum was very small consisting only of two floors. The ground floor had mainly chairs and door handles which you will be able to see and appreciate if you were going to Casa Batllo and Casa Mila (and you must opt to do those). The first floor didn't have much- an interactive screen in one of the rooms, what was thought to be Gaudi's room, a few of his belongings, and a screen with a video to tell you a few things about him. Our visit was very quick because the place was so small and there were many people in. \n\nI just feel like you could learn and also see what was there in other more important places like the two houses I previously mentioned and in the small gallery at the Sagrada Familia. Definitely don't waste money or time here.", "publishedDate": "2019-08-09", "language": "en", "rating": 3}, {"id": 693669863, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d246190-r693669863-Gaudi_House_Museum-Barcelona_Catalonia.html", "text": "Gaudi's house museum was terribly underwhelming. Pretty much just his furniture on display and not alot of it. Save your money people!", "publishedDate": "2019-07-29", "language": "en", "rating": 2}, {"id": 691443289, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d246190-r691443289-Gaudi_House_Museum-Barcelona_Catalonia.html", "text": "I would say if you don’t go to park Güell is not worth it go to visit the house museum because is very small and don’t show much really.", "publishedDate": "2019-07-21", "language": "en", "rating": 2}, {"id": 690883704, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d246190-r690883704-Gaudi_House_Museum-Barcelona_Catalonia.html", "text": "The Gaudí House Museum was the home of the architect Antoni Gaudí  from 1906 til 1925. It was  designed by Francesc d'Assís Berenguer , the architect's friend and right-hand man.Small museum but very interesting home of Gaudí with some of his original furniture designs and history of his many talents. The architecture is unique, being maybe a little  quirky and funny in some places, but really  breathtaking .  Highly recommended!", "publishedDate": "2019-07-19", "language": "en", "rating": 5}, {"id": 689142971, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d246190-r689142971-Gaudi_House_Museum-Barcelona_Catalonia.html", "text": "Although situated in Park Guell, Gaudi House Museum is the property of the Construction Board of the Expiatory Church of  La Sagrada Foundation and is therefore subject to a separate entry fee from that of Park Guell.  We were disappointed by the overall size of the property which is quite small and thus the displays therein are limited. The most interesting is the feature was the former bedroom of Gaudi which was primitive in the extreme as although the architect embellished most of his buildings to the extreme, his life was simply lived, revolving round prayer and his profession.  The small garden around the house is worth visiting.", "publishedDate": "2019-07-13", "language": "en", "rating": 3}, {"id": 684468025, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d246190-r684468025-Gaudi_House_Museum-Barcelona_Catalonia.html", "text": "We visited gaudi house after seeing sagrada familia in morning..walking all the way to top\nOf\nPark and seeing view and then saw the house quickly.. it had AC and was small and fast..gardens lovely. Enjoyed a peak at his bedroom and chapel ..and the gardens alone were worth the trip up the mountain. We came by cab..easier ", "publishedDate": "2019-06-26", "language": "en", "rating": 4}, {"id": 681516651, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d246190-r681516651-Gaudi_House_Museum-Barcelona_Catalonia.html", "text": "Gaudi was an extremely talented architect and this \"apartment\" building was fascinating. It is created to represent an undersea paradise. The attention to detail and the unique structures make this an interesting tour. You wear headphones and travel up through the house stopping at the numbered attractions. The house itself is tucked away on a main street between other buildings. It's definitely worth waiting in line to see.", "publishedDate": "2019-06-14", "language": "en", "rating": 5}, {"id": 680930671, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d246190-r680930671-Gaudi_House_Museum-Barcelona_Catalonia.html", "text": "To avoid queues we bought timed tickets on-line and having also bought tickets for the nearby Regulated Zone, which included use of the free shuttle bus from Alfons X metro station, we avoided the steep climb up the hill.  The house museum is small and doesn't take long to get round (allow an hour or so), but you get a brief interesting insight into Gaudi. The rooms include Gaudi's life story, his furniture, spectacular ceilings, ceiling light fittings and his bedroom, bathroom and chapel.  In the gardens are sculptures, mosaics and a small shady garden.  The exterior of the house is typical Gaudi decoration and there is a good gift shop.", "publishedDate": "2019-06-12", "language": "en", "rating": 5}, {"id": 677593628, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d246190-r677593628-Gaudi_House_Museum-Barcelona_Catalonia.html", "text": "You’ve hiked up to Parc Guëll and founded it a bit underwhelming.  If you have a passion for Gaudi, the Gaudi House Museum is the place to visit.  Skip trying to actually enter the park.", "publishedDate": "2019-05-30", "language": "en", "rating": 5}, {"id": 677396273, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d246190-r677396273-Gaudi_House_Museum-Barcelona_Catalonia.html", "text": "After spending a morning looking at Gaudi designed buildings in Barcelona we wanted to know more. The Gaudi House Museum really delivered for us. Displays were excellent and the audio guide was informative. Amazed that it was not crowded and this really allowed us time to read, look and soak us information about this creative genius.", "publishedDate": "2019-05-29", "language": "en", "rating": 5}, {"id": 675704660, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d246190-r675704660-Gaudi_House_Museum-Barcelona_Catalonia.html", "text": "Park Guell was very hard to find on foot, so that didn't get us off to the best start as visitors - we were a little bit late for our timed entry (they still let us in), and we were hot, sweaty and anxious at being late after walking in circles around the city. But we did find it, and I enjoyed seeing the home Gaudi created for himself. It's not the most amazing tour ever, there is not a lot to see in this house, but it did add to my overall appreciation of the man. Park Guell is worth seeing; it was even worth paying extra to see the \"Monumental Portion\" of the park. The Park itself is huge, and most of it is open to the public, but you pay to go into the Gaudi House Museum (Museo Casa Gaudi) and you pay to see the portion of the park that Gaudi designed and built, called the Monumental portion of the park. Just be prepared for the crowds. Everywhere in Barcelona was crowded, and we visited in May, before high summer.", "publishedDate": "2019-05-22", "language": "en", "rating": 4}, {"id": 674844255, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d246190-r674844255-Gaudi_House_Museum-Barcelona_Catalonia.html", "text": "Good to see how he lived which was a simple life. His furniture was unusual and artistic as he did not believe in straight lines because straight lines do not exist in nature. The house was pretty. This ticket was included in the ticket for Sagradia Familia. Afterwards we walked around the park to the top of the hill which gave a good view over Barcelona city.", "publishedDate": "2019-05-18", "language": "en", "rating": 3}, {"id": 672158127, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d246190-r672158127-Gaudi_House_Museum-Barcelona_Catalonia.html", "text": "It was just very... Underwhelming. It's important to keep an open mind and be grateful that you have the opportunity to see the place but unlike other places I've been to in the world - whether it's the Arc de Triomf in Paris, the Empire State Building etc, I would be happy if I never came back to visit this place.", "publishedDate": "2019-05-07", "language": "en", "rating": 2}, {"id": 671870708, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d246190-r671870708-Gaudi_House_Museum-Barcelona_Catalonia.html", "text": "Quite a thought provoking experience. Very minimalist with not many exhibits but good to see where Gaudi lived for a period and why. Only five euros so if you're up that way and interested you might as well have a gander.", "publishedDate": "2019-05-06", "language": "en", "rating": 3}, {"id": 671235318, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d246190-r671235318-Gaudi_House_Museum-Barcelona_Catalonia.html", "text": "We went to this place after visiting Sagrada Familia. It is not close by and we had to take a cab. Going up to the house is also not easy as one has to climb steps up the park - quite a strain on the elderly.\n\nThe house is pretty from outside but wasnt very spectacular inside. Took us about 30 min. After that we roamed around a little in the park.\n\nIf one does not want to visit the park, one wont miss much if this place is missed.", "publishedDate": "2019-05-03", "language": "en", "rating": 3}, {"id": 668743528, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d246190-r668743528-Gaudi_House_Museum-Barcelona_Catalonia.html", "text": "The house was located at Parc Guell, which is a beautiful location, but other than that, not much to say about the house/museum itself. I bought the ticket by mistake thinking it was for Casa Mila, so I had high expectations which probably influenced my low rating, bit still, it was a small house, a few furniture items and some basic info/story on Gaudi. Can't really recommend; if you happen to be around, it's better to spend the time visiting the park.", "publishedDate": "2019-04-23", "language": "en", "rating": 2}, {"id": 665919775, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d246190-r665919775-Gaudi_House_Museum-Barcelona_Catalonia.html", "text": "Great to be in the house where Gaudí lived for 20 years to see his inspired design and how that had been influenced by nature. ", "publishedDate": "2019-04-13", "language": "en", "rating": 4}, {"id": 663789236, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d246190-r663789236-Gaudi_House_Museum-Barcelona_Catalonia.html", "text": "Glad we went to visit the home. Located in park Guell, beautiful home, beautiful views, nice part of park. Paid just for the home tickets and still was able to walk the park. Happy I didn’t pay for the Park Guell crowded and noisy. Maybe not for everyone but we were happy to have made the effort to see.", "publishedDate": "2019-04-04", "language": "en", "rating": 4}, {"id": 662612832, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d246190-r662612832-Gaudi_House_Museum-Barcelona_Catalonia.html", "text": "I felt it necessary to learn about Gaudí before seeing La Sagrada Familia. I am so glad we did. Home is located in Parc Guell. We came by taxi. You go into the parc through the entrance to the  far right . There are several paths and stairs that lead up higher and to the home. The grounds are beautiful. The home took about 30 minutes to go through. There’s a short film to watch that gave you a glimpse into Gaudí’s way of life. The home has his bedroom set up and furnishings he designed for specific homes. \nIt was a beautiful morning, we spent an hour walking through the grounds and the park. \nThere is a great view from Barcelona the higher you walk up the park. Take a hat and some water. There will be water for sale in the park.", "publishedDate": "2019-03-31", "language": "en", "rating": 5}, {"id": 662587821, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d246190-r662587821-Gaudi_House_Museum-Barcelona_Catalonia.html", "text": "Not a lot to add here since it's been detailed pretty well.  \n\nMy suggestions - \nBuy the tickets when you are in the US so you can pick your time.\nvisit park Guell - EAIRLY - like right when they open\nvisit Gaudi's house after the part.\n\nWhat we did is visit the house first, then the park.  We had to wait until 10am when the house opened.  By the time we were done with the house the park was slammed with people.  Would of been better to hit the park up right when they opened.", "publishedDate": "2019-03-31", "language": "en", "rating": 4}, {"id": 661273460, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d246190-r661273460-Gaudi_House_Museum-Barcelona_Catalonia.html", "text": "The house built by Gaudí’s friend Guell is a modest house, architecturally simple on the outside.\nInside it’s very modest, clean and light with beautiful crafted wooden seating.\nGaudí’s bedroom is sparse & very modest, a place to pray and a place to sleep.\nIt’s beauty is its simplicity!", "publishedDate": "2019-03-26", "language": "en", "rating": 5}, {"id": 656949731, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d246190-r656949731-Gaudi_House_Museum-Barcelona_Catalonia.html", "text": "Just outside the grounds is Gaudis House. Entrance cost is a few euros and well worth a visit. Just to see how this wonderfully talented person lived. There are various pieces of his furniture but that is a on display in the Sagrada Familia too. I was more moved by seeing where he slept, where he prayed (he was extremely religious) even where he bathed. An interesting hour.", "publishedDate": "2019-03-07", "language": "en", "rating": 4}, {"id": 653744260, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d246190-r653744260-Gaudi_House_Museum-Barcelona_Catalonia.html", "text": "The actual house of Gaudi was quite small and lacked a lot of interesting information. There was furniture and stuff but very little. The garden around it was beautiful though.", "publishedDate": "2019-02-20", "language": "en", "rating": 3}, {"id": 652122101, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d246190-r652122101-Gaudi_House_Museum-Barcelona_Catalonia.html", "text": "It was very different from what I expected- Gaudi lived a very simple life, almost monastic and without the lavish trappings you would expect from someone with his vision, ability and skill.  It is such a shame he died when he did, as he still had so much to give.", "publishedDate": "2019-02-13", "language": "en", "rating": 5}, {"id": 651340705, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d246190-r651340705-Gaudi_House_Museum-Barcelona_Catalonia.html", "text": "This museum is an add on at Park Guell. You'll get to tour Gaudi's residence and Park Guell as well. The house is simple. It has fantastic views of Barcelona to the west. It was a bit warm, but that is how Spain is in the summer.", "publishedDate": "2019-02-10", "language": "en", "rating": 4}, {"id": 651074808, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d246190-r651074808-Gaudi_House_Museum-Barcelona_Catalonia.html", "text": "Park Guell is a must to visit. Museum is quaint and interesting but there could have been a bit more literature as not wholly informative, however, for €5 it is worth a visit. We most enjoyed the room where a video was played about Gaudi’s life", "publishedDate": "2019-02-09", "language": "en", "rating": 4}, {"id": 646177238, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d246190-r646177238-Gaudi_House_Museum-Barcelona_Catalonia.html", "text": "I loved the archetecture and the jazz concert on the roof. Warm air, nice breeze, good champane, excellent music, and good friends. Excellent Evening.", "publishedDate": "2019-01-15", "language": "en", "rating": 5}, {"id": 641409583, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d246190-r641409583-Gaudi_House_Museum-Barcelona_Catalonia.html", "text": "Visited the Antoni Gaudi’s House and the surrounding environment in the morning 25 Dec 2018. Great views and weather - Overlooks the city on a hilltop.  Short movie illustrated the famous unpretentious simple religious  architect.  Bought tickets online directly with the tickets for Sagrada Familia", "publishedDate": "2018-12-25", "language": "en", "rating": 5}, {"id": 639238208, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d246190-r639238208-Gaudi_House_Museum-Barcelona_Catalonia.html", "text": "Is one of the must destinations that everyone has to visit during his stay at the beautifull city of Barcelona. When u visit this place you can feel like you are many years back and you leaving this place with a hive feeling", "publishedDate": "2018-12-12", "language": "en", "rating": 5}, {"id": 638500815, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d246190-r638500815-Gaudi_House_Museum-Barcelona_Catalonia.html", "text": "It's worth a visit if you are already in Park Guell. The price is 22€ for the museum plus ticket to Sagrada Familia with Audioguide. Price for only the house museum I think is around €5. Do visit the house garden as well. Great place to relax before making your way back down to the metro. The museum itself is informational and beautiful though the exterior design is kinda bland.", "publishedDate": "2018-12-09", "language": "en", "rating": 4}, {"id": 636195613, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d246190-r636195613-Gaudi_House_Museum-Barcelona_Catalonia.html", "text": "Gaudi House Museum is an \"add on\" for those who don't know any better, really. It is quite small and unexciting if you expect to see lots of works and \"big things\". After you visit the Sagrada Familia, nothing else will do! And there is no need to visit this \"museum\", unless you have nothing better to do in a large city, like Barcelona!", "publishedDate": "2018-11-27", "language": "en", "rating": 2}, {"id": 634421246, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d246190-r634421246-Gaudi_House_Museum-Barcelona_Catalonia.html", "text": "Gaudi's house is very interesting, you can see a little bit into his life and also follow the progression of his architecture throughout his lifetime. Go at an odd hour because this museum can get very crowded (comes and goes in waves). Make sure to go right when you leave the house to check out the garden area (he built a plant wall that you can walk through too). Quite a unique experience, I recommend visiting if you are in Park Guell. ", "publishedDate": "2018-11-19", "language": "en", "rating": 5}, {"id": 632843096, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d246190-r632843096-Gaudi_House_Museum-Barcelona_Catalonia.html", "text": "Made a wrong reservation online, we bought a combined ticket but we thought it was with the house of Gaudi. Turned out it was this museum. Not worth it, too small, nothing 'new' if you visit the Sagrada Familia and it's museum. You even cannot enter the park with that ticket. Very disappointing", "publishedDate": "2018-11-12", "language": "en", "rating": 1}, {"id": 631309340, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d246190-r631309340-Gaudi_House_Museum-Barcelona_Catalonia.html", "text": "I added this on to your Segrada Familia tour for an extra 2 euros.   It was OK to visit, took about 15 minutes to walk through.  ", "publishedDate": "2018-11-06", "language": "en", "rating": 3}, {"id": 629029398, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d246190-r629029398-Gaudi_House_Museum-Barcelona_Catalonia.html", "text": "I don’t think this is a must see. A 2 storey small house with very little items to show. This was Gaudi’s house on Guell Park and he lived here for 20some years. You will see some pieces he designed and will have an idea on his works. They would make more money if the entrance is 2 Euros or less. But for 5 euros, not worth your while. ", "publishedDate": "2018-10-27", "language": "en", "rating": 2}, {"id": 625518273, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d246190-r625518273-Gaudi_House_Museum-Barcelona_Catalonia.html", "text": "We did the tour of the house as an extra option when we bought our Sagrada de familia tour ticket. The Park Guell is beautiful and worth the trip, but the house museum is quite small and most of the information is already covered with the Church tour.", "publishedDate": "2018-10-16", "language": "en", "rating": 3}, {"id": 624938274, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d246190-r624938274-Gaudi_House_Museum-Barcelona_Catalonia.html", "text": "Very interesting and a gem of Spain. Pre buy tickets to save money. Go early the lines are very long as the days progress. It will be crowded at most times. A lot of unique architecture ahead of its time.", "publishedDate": "2018-10-15", "language": "en", "rating": 5}, {"id": 624392787, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d246190-r624392787-Gaudi_House_Museum-Barcelona_Catalonia.html", "text": "Interesting but not as spectacular as his other structures. There are many amazing Gaudi works to admire in this beautiful cityand while this is recommended, but if you have limited time, I'd say put the others (Sagradi Familia, Casa Guell, casa Battlo) on your list ahead of this one.", "publishedDate": "2018-10-13", "language": "en", "rating": 4}, {"id": 624242744, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d246190-r624242744-Gaudi_House_Museum-Barcelona_Catalonia.html", "text": "My first trip to Barcelona I had no clue who Gaudi was or is. After going to see his Unique home I was in Awe of this  Spanish architect. I am lost for word with what I saw if you want to know what a talented architect he is. I have since wanted to know so much more. Sagrada Família Park Güell are also just amazing\nIT was well worth waiting in line and paying to see such an amazing piece of art \nloved it", "publishedDate": "2018-10-12", "language": "en", "rating": 5}, {"id": 622325402, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d246190-r622325402-Gaudi_House_Museum-Barcelona_Catalonia.html", "text": "Is the House (Casa)in which Gaudi lived, working for the construction of Sagrada Familia, but then when he worked creating the Park Güell. Is a special place to visit and have to buy additional ticket. From the moment that you approach the Perimeter of the building and the entrance, you can notice the Elegance in taste and impeccable detail in everything that exists, as decoration or as a functional piece of the House Among the various objects that are at home, you will see several furniture by Gaudi as a designer, similar to those that exist in the Interior museums of Sagrada Familia.\nDeeply religious and having failed to conquer the love of his life, Pepeta Moreau, dedicated to his main task, the Sagrada Familia, rightly given by the world to him, the nickname '' the Architect of God ''.\nThe House is distinguished by its design and facilities. The impressive for visitors is the bedroom of Gaudi, in which there is a wardrobe and his bed. It is strange that the bed is very narrow, as should be necessary. While he had the money to have a bigger and comfortable bed, he imposed on itself restrictions with rigor. As a deeply religious Catholic, drew motivation from the perfection of the Divine!\nMy personal view of his works is that he managed to find the symmetry and harmony, characteristics which established his works as Monuments, which are close to the ‘’Divine Perfection’’! In my photos I tried to ‘’catch’’ the moment, to ‘’ steal’’ a piece of this Perfection, even in a digital form !!!\nAll rooms of the House are open to visitors and in some one specific, projected a short film on the life of Anthony Gaudi. In another room on the second floor, also there is a small exhibition with photos of the life and work of the Architect. In one of the outer rooms housed a small souvenir shop.\nI highly Recommend to visit the House, because you will have the opportunity to experience another dimension of character of Gaudi and maybe you can decode (if you try), the hidden messages in every point of his works, which have been rightly included in UNESCO World Heritage sites.", "publishedDate": "2018-10-05", "language": "en", "rating": 5}, {"id": 621990467, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d246190-r621990467-Gaudi_House_Museum-Barcelona_Catalonia.html", "text": "\"Show home\" inside Park Guell. Very austere home of Gaudi during his life. Simple but interesting including some furniture that Gaudi built. Only requires a short visit.", "publishedDate": "2018-10-03", "language": "en", "rating": 5}, {"id": 620541518, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d246190-r620541518-Gaudi_House_Museum-Barcelona_Catalonia.html", "text": "It takes an open mind and a quest for the greatest and truly innovative minds and talent on earth. Even though there was hundreds, or even a thousand visitors, it was worth seeing.", "publishedDate": "2018-09-29", "language": "en", "rating": 5}, {"id": 617234226, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d246190-r617234226-Gaudi_House_Museum-Barcelona_Catalonia.html", "text": "It was nice to see but I suggest combining the visit with visit to Parc Guell, as we thought we could buy the Park tickets there and then, however next available ones were 5 hours later. The house itself is ok and the tour was done in 10 minutes. Not worth coming to se the house on its own", "publishedDate": "2018-09-17", "language": "en", "rating": 3}, {"id": 613365761, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d246190-r613365761-Gaudi_House_Museum-Barcelona_Catalonia.html", "text": "the Museum is situated inside Gnell Park which is such a lovely place well worth a visit. We spent best part of a day here", "publishedDate": "2018-09-03", "language": "en", "rating": 5}, {"id": 612135441, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d246190-r612135441-Gaudi_House_Museum-Barcelona_Catalonia.html", "text": "The house represents Gaudi really good. If you like art, or interested in Gaudi's lifestyle, you will love this museum. Really small, but tickets are not too pricey and you can enjoy the house in a little time, max 30 minutes will be enough. A must for Gaudi fans.", "publishedDate": "2018-08-29", "language": "en", "rating": 5}, {"id": 604243574, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d246190-r604243574-Gaudi_House_Museum-Barcelona_Catalonia.html", "text": "We took the touristic bus and got off at Park Güell stop. After a 10min walk we arrived at the entrance of Park Güell and Gaudí’s house museum situated inside the park. It was a simple house but has its own style. One can spend around 15-30min to finish the whole tour already.", "publishedDate": "2018-08-08", "language": "en", "rating": 3}, {"id": 603192658, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d246190-r603192658-Gaudi_House_Museum-Barcelona_Catalonia.html", "text": "Found in the \"Free entry\" garden area of Park Guell which is worth a visit, the museum is a bonus when the main Park is unavailable (full). Some very interestingly designed furniture, and garden pieces, he did everything well or not at all, it signifies his great attention to detail which is seen in most if not all of his work. Clearly a driven, hard working man who left his mark in so many ways throughout his life. His small but beautiful garden here and the arbour are delightful, a real pleasure to look out of his windows and see why he placed so many things where did. Enjoyed it very much indeed, small but grand.", "publishedDate": "2018-08-06", "language": "en", "rating": 4}, {"id": 603050353, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d246190-r603050353-Gaudi_House_Museum-Barcelona_Catalonia.html", "text": "To see where Gaudi lived in the latter part of his life gives another aspect to his creativity.  It is a small museum but well displayed and thought out. The film of the nuns describing how they helped with the housekeeping gives an insight into Gaudi's life at that time.  There is a small garden area showing a few pieces of Gaudi design. The entrance fee is €5.50.  It is a little way out of the main city but worth the effort.", "publishedDate": "2018-08-05", "language": "en", "rating": 5}, {"id": 598258857, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d246190-r598258857-Gaudi_House_Museum-Barcelona_Catalonia.html", "text": "The visit to Gaudi's house was nice, nothing more\nIf you are short in time or money then leave and do not go there (ticket price for the house is not included in the ticket price to the park)", "publishedDate": "2018-07-21", "language": "en", "rating": 3}, {"id": 598006726, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d246190-r598006726-Gaudi_House_Museum-Barcelona_Catalonia.html", "text": "Walking in the rooms and on the stairs that Gaudi once walked, I could not stop smiling at the history beneath my feet. You get a real sense of presence and feel for Gaudi here. To learn about the history of the man ( and hear nuns who knew him tell there stories on screen ) was just lovely. His religious beliefs and love of nature are spoken about as well. \nArrive early whilst its cooler and before the crowds arrive, to make the most of the walk in the park which is wonderful.", "publishedDate": "2018-07-20", "language": "en", "rating": 4}, {"id": 597415301, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d246190-r597415301-Gaudi_House_Museum-Barcelona_Catalonia.html", "text": "Gaudi House Museum was very informative as you found out all about Gaudi and the museum itself was very interesting and was showed many of his beautiful and wonderful designs but it was extremely busy and to get tickets to get in the queue was quite long and the actual space in the Museum is not very spacious and the handsets that were required sometimes were unreliable and did not work.", "publishedDate": "2018-07-18", "language": "en", "rating": 3}, {"id": 596372245, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d246190-r596372245-Gaudi_House_Museum-Barcelona_Catalonia.html", "text": "Great house & grounds. I'd say its worth a visit once, to get a few pics etc. General ticket costs 5.50 euros.", "publishedDate": "2018-07-15", "language": "en", "rating": 5}, {"id": 595556882, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d246190-r595556882-Gaudi_House_Museum-Barcelona_Catalonia.html", "text": "This is where Gaudi lived while he was overseeing the building of the Sagrada.  Nice way to get some insight on this brilliant mind.  You can wander through his personal garden too.  Located in the public park.  Small entry fee required.  I would allow 30 minutes for a leisurely stroll through.", "publishedDate": "2018-07-12", "language": "en", "rating": 4}, {"id": 594681444, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d246190-r594681444-Gaudi_House_Museum-Barcelona_Catalonia.html", "text": "This place isnt tht big so my husband was happy (not much walking) we took a stroller that was light weight but my daughter walked the whole place and she was 2.\nThe gaudi museum is like a little ceramic village kinda place great to sight see and just relax at the top taking in the great views of Barcelona i would definitely recommend a one time visit at the very least well worth the pictures if anything.", "publishedDate": "2018-07-09", "language": "en", "rating": 4}, {"id": 589218361, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d246190-r589218361-Gaudi_House_Museum-Barcelona_Catalonia.html", "text": "If you’re a fan of this guy then it really is a must I loved it, even if you don’t know of him take a look and go up to the chimneys fabulous not a straight line on sight quite something", "publishedDate": "2018-06-20", "language": "en", "rating": 5}, {"id": 589091059, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d246190-r589091059-Gaudi_House_Museum-Barcelona_Catalonia.html", "text": "the house with barcelona view \nand gaudi could have saw his sagrada familia from his house windows\nyou can see the gaudi bed room , Worship Room , .....\nif you intrested gaudi's life i sugest you to see this house", "publishedDate": "2018-06-19", "language": "en", "rating": 3}, {"id": 588971135, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d246190-r588971135-Gaudi_House_Museum-Barcelona_Catalonia.html", "text": "We loved being in his home and learning about how he lived and his passion. The entrance into the museum is well worth it and is a must do if you are interested in his work and his extraordinary life.", "publishedDate": "2018-06-19", "language": "en", "rating": 5}, {"id": 588741175, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d246190-r588741175-Gaudi_House_Museum-Barcelona_Catalonia.html", "text": "Loved this whole place, certainly worth a visit, awesome building and so much to see and do. Would love to go back and spend more time here.", "publishedDate": "2018-06-18", "language": "en", "rating": 4}, {"id": 587128246, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d246190-r587128246-Gaudi_House_Museum-Barcelona_Catalonia.html", "text": "His actual home for some 20 years. He moved into a room at la sagrada familia. and was killed by a Street Car . Should have stayed here. Beautiful furniture and d signs here  and you get a feeling of the man.  Can get crowded so go early in th day and not on weekends. Learned a lot and you can get a pass just here instead of the whole park. Good value. Thank ", "publishedDate": "2018-06-13", "language": "en", "rating": 5}, {"id": 586286632, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d246190-r586286632-Gaudi_House_Museum-Barcelona_Catalonia.html", "text": "The first thing that is disappointing is that every single Gaudi related thing in Barcelona has a separate expensive entrance fee but not all are equal in their value and this site is probably the worst. I wish we had just gone to see the Sagrada Familia twice.\nThe house is sort of far away from the other Gaudi sites in a residential neighborhood and its a LONG steep climb to get up to the top of the park that it's in. It meant that we spent a fat half of one of our precious days getting there on a city bus, climbing up the hill, waiting in line,to spend 30 minutes in the house, walking back down, then busing back into town.\nCompared to the other sites this house is pretty dull and there wasn't that much interesting information about him. I liked the ergonomic chairs he designed but thats hardly worth the trip and you can Google it.", "publishedDate": "2018-06-09", "language": "en", "rating": 2}, {"id": 585366005, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d246190-r585366005-Gaudi_House_Museum-Barcelona_Catalonia.html", "text": "The house is quite small (2 floors) and doesn't offer that much to see. The staff is not welcoming, on the contrary: very rude and costumer unfriendly. ", "publishedDate": "2018-06-05", "language": "en", "rating": 2}, {"id": 585199973, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d246190-r585199973-Gaudi_House_Museum-Barcelona_Catalonia.html", "text": "I am intrigued by the architect so nothing is a waste of time or money.  However, it is a small part of the park and you do have to pay an extra entrance fee.  May not be of interest to the average visitor", "publishedDate": "2018-06-04", "language": "en", "rating": 4}, {"id": 583962180, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d246190-r583962180-Gaudi_House_Museum-Barcelona_Catalonia.html", "text": "So this is the house Gaudi lived in for almost the last 20 years of his life. He did not design the house and it is not unique. There is a small collection of furniture in the attributed to him, but that is it. If you had to miss only one tourist trap in  Barcelona, this would be the one to miss. \n\nThe only redeeming grace is the very inflated admission fee is spent on the continuing construction at the Sagarata Famnillia. Tis is the only reason I did not rate it as a one star!", "publishedDate": "2018-05-30", "language": "en", "rating": 2}, {"id": 583240031, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d246190-r583240031-Gaudi_House_Museum-Barcelona_Catalonia.html", "text": "We had the full gaudi experience first the parks and all of the gaudi designs then the house in the park now a museum, beautifully restoured and well looked adter great tour and excellent insight on the man", "publishedDate": "2018-05-28", "language": "en", "rating": 5}, {"id": 583167929, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d246190-r583167929-Gaudi_House_Museum-Barcelona_Catalonia.html", "text": "It is nice to see Gaudi’s house. There isn’t much to see since it’s not that big but the price is 5€. There is a discount if you have a Barcelona card.", "publishedDate": "2018-05-27", "language": "en", "rating": 4}, {"id": 582998793, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d246190-r582998793-Gaudi_House_Museum-Barcelona_Catalonia.html", "text": "You can pay at the entrance or enter for free, Even  if you go in for free you have to pay for every single place you go into. $5 Euros here and $5 Euros there add up. Plus its really not that interesting. You get more bang for your buck and a much better experience at Casa Batllo and at La Sagrada Familia.", "publishedDate": "2018-05-27", "language": "en", "rating": 3}, {"id": 582584354, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d246190-r582584354-Gaudi_House_Museum-Barcelona_Catalonia.html", "text": "Not worth going if you are only visiting this and not the parc. It's really small and it can be done in 10 minutes", "publishedDate": "2018-05-25", "language": "en", "rating": 3}, {"id": 581042692, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d246190-r581042692-Gaudi_House_Museum-Barcelona_Catalonia.html", "text": "Our tickets for the central part of  Park Guell were for 2 hours away, so in order to kill time we entered this museum. It is small, on the first floor you see a short film about Gaudi's life, and some designs he made, and on the second floor you can see the rooms he lived in. We loved the garden", "publishedDate": "2018-05-18", "language": "en", "rating": 3}, {"id": 580598751, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d246190-r580598751-Gaudi_House_Museum-Barcelona_Catalonia.html", "text": "This is very interesting and beautiful. This is located in Parc Guell , so can visit both sites together. It was a bit difficult to get to, but well worth it. The man was obviously a genius and the city is filled with his influence. Truly amazing.", "publishedDate": "2018-05-16", "language": "en", "rating": 4}, {"id": 577225919, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d246190-r577225919-Gaudi_House_Museum-Barcelona_Catalonia.html", "text": "Set within the grounds of Park Guell. Interesting insight into how the genius that is Gaudi lived. Examples of furnicture and fittings designed by Gaudi on display along with detailed information. In addition there is a 10 min video that plays on a loop in different languages which gives more information on Gaudi.\n\nBooked tickets online and entry to the house was painless via mobile phone. \n\nA cheap and cheerful way to gain an insight into Gaudi’s life and inspirations.", "publishedDate": "2018-05-01", "language": "en", "rating": 4}, {"id": 575692002, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d246190-r575692002-Gaudi_House_Museum-Barcelona_Catalonia.html", "text": "Interesting to see where and how the great man lived. There are also some interesting objects that he designed for various buildings.  Well worth visiting if you go to Park Guell or make it a reason to go and enjoy the Park itself.", "publishedDate": "2018-04-25", "language": "en", "rating": 4}, {"id": 574279907, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d246190-r574279907-Gaudi_House_Museum-Barcelona_Catalonia.html", "text": "A small but very interesting museum. A little crowded as to be expected. Gives you some background on how talented and interesting Gaudi really was as you walk through the house where he lived, slept, prayed and dreamt up incredible projects like La Sagrada Familia. \n\nThe house and grounds has an interesting history as well. We got tickets at the door but it might be best to book ahead. Located at park guell. No need to pay for entry to the park. You can tickets separately for the house.", "publishedDate": "2018-04-18", "language": "en", "rating": 4}, {"id": 573526782, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d246190-r573526782-Gaudi_House_Museum-Barcelona_Catalonia.html", "text": "The only think that I could recommend in this museum are 3D glasses where you can discover the Gaudi buildings in Barcelona. The rest of the museum is a litle bit disappointing. Voice guided phones stopped working afer 10 minutes.", "publishedDate": "2018-04-15", "language": "en", "rating": 3}, {"id": 571777778, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d246190-r571777778-Gaudi_House_Museum-Barcelona_Catalonia.html", "text": "Ok this is weird. It’s kind of impressive. Some of the features in the house are great, particularly the staircase and balconies. However, as a visitor experience it leaves something to be desired. The headphone guide is awful. The most pretentious bollocks. You walk about in a single line like sheep. You have virtually no time to look at anything. It’s designed to separate you from your money with a minimum of human interaction. You even by mementos from a ending machine.  Basically, the house is surprising, but look from outside and look at all the pictures online.", "publishedDate": "2018-04-07", "language": "en", "rating": 3}, {"id": 568926310, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d246190-r568926310-Gaudi_House_Museum-Barcelona_Catalonia.html", "text": "This house was built as the show house for an estate of 60 houses, but only one other house was built.  There was some chairs that were copies of the type made by Gaudi.  We were surprised to find that there was a special room for Gaudi to pray to God, he used to go to church once every day and twice on a Sunday!", "publishedDate": "2018-03-26", "language": "en", "rating": 5}, {"id": 568558337, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d246190-r568558337-Gaudi_House_Museum-Barcelona_Catalonia.html", "text": "After our personal tour of Park Güell was anxious to see the beautiful terracotta pink house that was built by Antoni Gaudí the location is atop the Carmel mountainside and can be viewed before or afterwards. The exterior of the house as his home is the centrepiece of this museum... the color, the designs on the windows, the green shutters, the tiles that surround the gardens.  It does have examples of Gaudí s ergonomic wooden chairs.. The video is worth watching. Cost is 4,5 € for seniors. I’m not sure high energy children would enjoy the visit. ", "publishedDate": "2018-03-24", "language": "en", "rating": 4}, {"id": 567039427, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d246190-r567039427-Gaudi_House_Museum-Barcelona_Catalonia.html", "text": "In October 2017, I went to Barcelona with friends. It's an amazing city, very unusual. Most of all we liked the houses built according to the project of the famous architect Gaudi. Very unusual and interesting museum of Gaudi. I advise with friends or family to see interesting places of this city 💕", "publishedDate": "2018-03-17", "language": "en", "rating": 5}, {"id": 565658139, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d246190-r565658139-Gaudi_House_Museum-Barcelona_Catalonia.html", "text": "Gaudi House Museum is the former residence of architect Antoni Gaudí i Cornet (1852-1926), a noted Spanish architect. Gaudi lived in the house from 1906 to 1925 with his father and niece. His father died in 1906 and his niece died in 1912. Built between 1903 and 1905, the four-storey building, which was constructed as a show house for the Park Güell residential project, was designed by Francesc d’Assís Berenguer i Mestres (1866-1914), Gaudí’s friend Gaudí House Museum is the former residence of architect Antoni Gaudí i Cornet (1852-1926), a noted Spanish architect. Gaudí lived in the house from 1906 to 1925 with his father and niece. His father died in 1906 and his niece died in 1912. Built between 1903 and 1905, the four-storey building, which was constructed as a show house for the Park Güell residential project, was designed by Francesc d’Assís Berenguer i Mestres (1866-1914), Gaudí’s friend and right-hand-man. The site opened to the public as the Gaudí House Museum on September 28, 1963 and currently showcases furniture Gaudí designed as well as objects and documents linked to his life. Gaudí House Museum is currently under the care of the Construction Board of La Sagrada Família Foundation. During the summer months, it is open daily from 9:00 in the morning until 8:00 at night. Tickets cost €5.50. Budget about 45 minutes to an hour.right-hand-man. The site opened to the public as the Gaudi House Museum on September 28, 1963 and currently showcases furniture Gaudí designed as well as objects and documents linked to his life. Gaudi House Museum is currently under the care of the Construction Board of La Sagrada Família Foundation. During the summer months, it is open daily from 9:00 in the morning until 8:00 at night. Tickets cost €5.50. Budget about 45 minutes to an hour.", "publishedDate": "2018-03-10", "language": "en", "rating": 3}]}}]