[{"locationId": 6942942, "name": "Church of Sant Francesc de Sales", "placeType": "ATTRACTION", "reviewListPage": {"reviews": [{"id": 643348360, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d6942942-r643348360-Church_of_Sant_Francesc_de_Sales-Barcelona_Catalonia.html", "text": "This is a lovely church that has a fabulous alter consisting of murals and exquisite stained glass windows. It also has a beautiful pattern on it's stone walls.", "publishedDate": "2019-01-03", "language": "en", "rating": 4}, {"id": 628594670, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d6942942-r628594670-Church_of_Sant_Francesc_de_Sales-Barcelona_Catalonia.html", "text": "We found this church as we wandering around this part of town and what an eye catching gem of a church this is .\nThere not much history  to be found about this church,built in 1885 in the Gothic style of architecture that looks so pleasing on the eye ,we had just been to the magnificent Sagrada Familia and this church was only a little bit further down the exceptionally long street Avinguda Diagonal, it's such a lovely looking church ,the spire looks unusual ,the church makes for some great photographic opportunities and is most definitely well worth seeking out. \nEasily found on Passeig De Sant Joan.", "publishedDate": "2018-10-26", "language": "en", "rating": 5}, {"id": 613896688, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d6942942-r613896688-Church_of_Sant_Francesc_de_Sales-Barcelona_Catalonia.html", "text": "We were walking down Av Diagonal and came across the church. It looks beautiful from outside and very prominent on the main road.  Worth a look if you're close by.  However we walked past the church again on a Sunday and noted that it was closed which we were surprised at", "publishedDate": "2018-09-04", "language": "en", "rating": 4}, {"id": 544401589, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d6942942-r544401589-Church_of_Sant_Francesc_de_Sales-Barcelona_Catalonia.html", "text": "Nice building when you pass near by. It deserve to go in or spend few minutes having a look the structure", "publishedDate": "2017-12-01", "language": "en", "rating": 5}, {"id": 409493428, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d6942942-r409493428-Church_of_Sant_Francesc_de_Sales-Barcelona_Catalonia.html", "text": "We got a little lost on our way back from Sagrada Familia and found this church.  The area around it is quiet and there are benches under the trees on the opposite side of the road to just sit and look. It is set on a beautiful broad avenue.", "publishedDate": "2016-08-23", "language": "en", "rating": 4}, {"id": 317015434, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d6942942-r317015434-Church_of_Sant_Francesc_de_Sales-Barcelona_Catalonia.html", "text": "Whilst on a very long and grueling walk, on a very hot day, from our hotel located just off Las Ramblas to see the Basilica of the Sagrada Familia, we came upon this beautiful little church. \nIt had a classical architectural style and a really appealing appearance.\nThe church is located on a corner, on what was a relatively quiet main street, by Barcelona standards. We spent a few minutes sitting in the shade of the street trees and admired the church’s beautiful appearance. The sculptured entrance and the church’s spires were particularly appealing.\nIf you are visiting the Basilica of the Sagrada Familia, then why not takes a walk along a few blocks and have a look at this classical, beautiful church.", "publishedDate": "2015-10-08", "language": "en", "rating": 4}]}}]