[{"locationId": 4123720, "name": "Palau Sant Jordi", "placeType": "ATTRACTION", "reviewListPage": {"reviews": [{"id": 732272436, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d4123720-r732272436-Palau_Sant_Jordi-Barcelona_Catalonia.html", "text": "Not easy to get to, bus only takes you so far.  Quite a walk from the bus to the venue, then as the bus finishes at 11pm, after the show there  is a long walk down to the Metro which can take about 30 minutes. However, a great venue. Only problem we had were people smoking around us in the venue although it stated no smoking.  No one seemed to bother.", "publishedDate": "2019-12-12", "language": "en", "rating": 5}, {"id": 717981727, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d4123720-r717981727-Palau_Sant_Jordi-Barcelona_Catalonia.html", "text": "We came from UK to see Michael Buble, block 122 was amazing view. Seat numbering is unusual with odd numbers together and even numbers together ( we were seat 11 and 13 next to each other) .\nWe checked out the area the day before and caught the bus (150) up from Plaza Espanya to concert. It was all straight forward and less chaotic than London venues. Venue was very hot even last September and dint feel air con was that effective and was commented on by others.\nStaff were pleasant. Bars were reasonable price and we took take drinks outside onto terrace prior to concert. Plenty of bathrooms. \nLeaving was understandably bit chaotic and we came out of different door so maybe pay more attention on way in so you are not disoriented. We ended up walking 15 minutes downhill to Plaza Espanya where our hotel was which was easy walk and we felt safe. Only one bus passed us and wonder what queues would have been like.", "publishedDate": "2019-10-13", "language": "en", "rating": 4}, {"id": 711352356, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d4123720-r711352356-Palau_Sant_Jordi-Barcelona_Catalonia.html", "text": "Fantastic venue for a concert. I was sat in section 224 and had the perfect view of the stage (Billie Eilish). The atmosphere was great. The views from the outside area are fantastic and there are many bars to get drinks.", "publishedDate": "2019-09-20", "language": "en", "rating": 5}, {"id": 660271137, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d4123720-r660271137-Palau_Sant_Jordi-Barcelona_Catalonia.html", "text": "Actually was surprised how organized was everything at the concert. Really good. Specially for fans who came early in the morning. I have visited a lot of concerts and was really impressed about this one. Good sound as well! Staff were giving water if you asked and this was highly appreciated. ", "publishedDate": "2019-03-21", "language": "en", "rating": 5}, {"id": 660143521, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d4123720-r660143521-Palau_Sant_Jordi-Barcelona_Catalonia.html", "text": "I went into Florence and the machine concert the 20.03.19. I was with my friend and even though the line was big, they quickly got everyone in the venue. \n\nWhen we got in there a girl/woman saw that I was walking with a crutch. She saw our tickets where up/down a lot of stairs and then she said come with me.\nShe then took us to an elevator and went inside with us and showed us were to go, not by pointing but she walked in front of us! Really good service\n\nFor the venue the sound was really good and clear! \n", "publishedDate": "2019-03-21", "language": "en", "rating": 5}, {"id": 648452946, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d4123720-r648452946-Palau_Sant_Jordi-Barcelona_Catalonia.html", "text": "Palau Sant Jordi is a good venue however, the show we just laboured through was terrible. Have been to a few Cirque du Soleil's before and genuinely enjoyed the experience, this time though we were all in complete dismay at how bad TORUK was? The whole show was visual chaos, hardly any acrobatics, none of which was particularly amazing, there was an APP which we couldn't get to work on our andriod device, and there was a translation board for the show's story which couldn't be seen if your seat was at the sides (basically 2 thirds of the audience can see it properly). Again, very disappointed in the Cirque du Soleil TORUK show.\nOne last thing, as well as the ticket price for this show being way overpriced, so was food and beverage prices, which unfortunately seems normal when going to these types of events.", "publishedDate": "2019-01-26", "language": "en", "rating": 1}, {"id": 634836167, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d4123720-r634836167-Palau_Sant_Jordi-Barcelona_Catalonia.html", "text": "Nice place for an indoor concert BUT way too slow to let people inside!\nWe waited for more than an hour, in a 800meter long line with the rain pouring down!\nNo wonder they opened the doors at 4 in the afternoon for a concert that began at 7.30 in the evening!\n\nSound was good and Slayer was fantastic!", "publishedDate": "2018-11-21", "language": "en", "rating": 4}, {"id": 611457775, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d4123720-r611457775-Palau_Sant_Jordi-Barcelona_Catalonia.html", "text": "we decided to walk up taking the escalator through the beautiful gardens. \nWe had plenty of time before the concert started so we decided to take the walk. \nas you go up , you cant help but imagine the cost of all the buildings, structures and overall set up. \nits impressive. \nas we reached the top, we were again impressed , just a sense of grandure overwhelms you. \narchitecture is palpable.", "publishedDate": "2018-08-28", "language": "en", "rating": 5}, {"id": 598864201, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d4123720-r598864201-Palau_Sant_Jordi-Barcelona_Catalonia.html", "text": "I attended Shakira's El Dorado World Tour at the Palau Sant Jordi, and as we ahd travelled from Scotland I was unsure what to expect. I know from personal experience at concerts at home that the venue can often get too hot when it is full of people, but I was pleasantly surprised at how cool the arena stayed all night. There aren't any metro stations nearby that I know of, but it is around a kilometer walk from Placa d'Espanya if you're fit enough to do so. Staff were also very helpful when looking to buy merchandise. I would definitely attend a concert here again!", "publishedDate": "2018-07-23", "language": "en", "rating": 5}, {"id": 595674301, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d4123720-r595674301-Palau_Sant_Jordi-Barcelona_Catalonia.html", "text": "OK venue but organization isn’t very good, we had to pick up our tickets in afternoon and it was horrible waiting in the sun for an hour with no sign of organization until Pearl Jam staff turned up. Then there is nothing there so apart from one bar was that was shut and a kiosk that was open but tiny we had to head back down the hill to town. Place ok for a show but over priced like most places, the real nightmare didn’t start until you get out and 17,000 people fighting for taxis as no rail link or bus, took us over 2 hours to get back to hotel when it should have taken 40mins", "publishedDate": "2018-07-12", "language": "en", "rating": 3}, {"id": 595341124, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d4123720-r595341124-Palau_Sant_Jordi-Barcelona_Catalonia.html", "text": "Went to see a sold-out concert of Pearl Jam..wonderfull place and very good organised.Save and very naerby travelfacility", "publishedDate": "2018-07-11", "language": "en", "rating": 5}, {"id": 593912270, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d4123720-r593912270-Palau_Sant_Jordi-Barcelona_Catalonia.html", "text": "Went here 07-07-2018 for Shakira el dorado world tour. This place needs ALOT of improvement. The entrances were like a maze getting in was very slow going. The bathrooms were a water ballet and no cleaning in between. The foodstands and bars were closed?!? During the concert seriously what kind of idiot would close bars and food stands during the concert you don't think people get hungry or thirsty???\nThe chairs are plastic with barely any backspace a hard sit. The sound quality is not that good to much echo. \nAfter the concert it was a stampede to get out which is maybe normal but not even the people working there can tell you where you need to go. Taxis are all trying to rip you off our hotel was 2.5km from the stadium bit they asked 50€!! We decided to walk. \nThe concert was amazing though and during the day the scenery is beautiful but this place needs alot of improvement to become a quality veneu for concerts.", "publishedDate": "2018-07-07", "language": "en", "rating": 2}, {"id": 591324659, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d4123720-r591324659-Palau_Sant_Jordi-Barcelona_Catalonia.html", "text": "This indoor stadium is right next to the Olympic stadium on Montjuic hill. I used the metro and the funicular railway to reach the top and then walked about 15 minutes to the stadium. You can also walk up the whole way from Plaza Espanya, there are escalators to make it easier and it takes about an hour. Or the Barcelona sightseeing bus stops just outside the stadium. I spent the day sightseeing at the museums and the Castle on the hill and the cable car Telerific and then went to the concert. \n\nThere was some confusion about which gate was for which ticket, the security kept changing their minds but finally we did get in about an hour before the show after several ticket checks along the way. Try to get front standing tickets if you can, its the best place to watch a great show and meet other die hard fans too.\n\nRoger Waters and his musicians were amazing, brilliant show, terrific acoustics, great lights and lasers and special effects. Could hear and see really well and the atmosphere was electric. Highly recommend this venue for a rock concert.\n\nAfter the show a lot of people were walking down the hill, joined them down to Plaza Espanya with its bus and metro stops.", "publishedDate": "2018-06-27", "language": "en", "rating": 5}, {"id": 574800815, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d4123720-r574800815-Palau_Sant_Jordi-Barcelona_Catalonia.html", "text": "In the top of the mountain of Montjuich, there is this palace. Used for sports also concerts and spectacles. You can go there with the metro to Plaza España, then go up with mechanical stairs. Full services inside.", "publishedDate": "2018-04-21", "language": "en", "rating": 5}, {"id": 574298632, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d4123720-r574298632-Palau_Sant_Jordi-Barcelona_Catalonia.html", "text": "Nice place with bad acoustic. Not the best option for concerts. The building is probably more appropriated for sports (it was built for the Olympia games '92 in Barcelona). Very nice location and great view from Montjuïc.", "publishedDate": "2018-04-19", "language": "en", "rating": 3}, {"id": 573241660, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d4123720-r573241660-Palau_Sant_Jordi-Barcelona_Catalonia.html", "text": "A great venue situated on the hills above Barcelona. The Olympic Stadium is a fantastic architectural gem. The museum is fabulous. ", "publishedDate": "2018-04-14", "language": "en", "rating": 5}, {"id": 546043049, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d4123720-r546043049-Palau_Sant_Jordi-Barcelona_Catalonia.html", "text": "The \"Wonderful Crazy Night\" tour of Elton John. Kind of cool to take the escalators from street level Plaza España on your way up to a concert.", "publishedDate": "2017-12-08", "language": "en", "rating": 5}, {"id": 529672430, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d4123720-r529672430-Palau_Sant_Jordi-Barcelona_Catalonia.html", "text": "We didn't go in but it's an impressive building.\nWe were walking and exploring this area of Barcelona and enjoyed taking in the different buildings.", "publishedDate": "2017-10-03", "language": "en", "rating": 4}, {"id": 474882257, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d4123720-r474882257-Palau_Sant_Jordi-Barcelona_Catalonia.html", "text": "Incredible place. Beautiful scenery. Nicely settled on top of a hill so you can look out over the city. Queue wasn't too bad to get into the arena. Once in the arena we found our seats nice and easily. Staff all very helpful. Arena itself is very nice. Queues for the food weren't that bad but the staff were incredibly slow. Meant a queue that should have taken 30 mins ended up taking over and hour (not an exaggeration). Prices were as you would expect for a concert. Only down side I would say was the servers at the bars. I ordered food and drinks and she got me then and then told me it was €16 which is fair enough. Then told me it was €2 charge for the cup which I get back if I return it which was fair enough again I suppose. This made me think it was €20 anyway but when I went back later to get some snacks I checked the board and it was €16 including the charges for the cups and the server just kept the change. I wasn't impressed with that but that's the only downside to the whole evening. Ed was incredible!!", "publishedDate": "2017-04-12", "language": "en", "rating": 4}, {"id": 474848506, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d4123720-r474848506-Palau_Sant_Jordi-Barcelona_Catalonia.html", "text": "This place is modern and big. I went to the Dans Ara 2017 and it is very nice in the interior. There are some screens to watch all the performances, due sometimes is not possible to see everything because of the distance, but the screens help you so much. There are lots of parkings around. \n\nYou can get there by bus. ", "publishedDate": "2017-04-11", "language": "en", "rating": 5}, {"id": 460126036, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d4123720-r460126036-Palau_Sant_Jordi-Barcelona_Catalonia.html", "text": "A great reminder of the 1992 Olympics, the Sant Jordi holds a special place in the hearts of Brazilians like me, being the place of the first gold medal the nation has won in volleyball. Sadly it is usually closed and not easy to see how it is inside.", "publishedDate": "2017-02-15", "language": "en", "rating": 4}, {"id": 443457465, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d4123720-r443457465-Palau_Sant_Jordi-Barcelona_Catalonia.html", "text": "Almost everything about plau sant jordi is great, great venue, great sound, great sit distribution.... But not the chairs themselves. We went yesterday to a 5-6 hours event and it was an horrific experience, not only were they uncomfortable but after 2 hours it began to be painful. It made the whole thing less memorable than it shoul've been.", "publishedDate": "2016-12-11", "language": "en", "rating": 3}, {"id": 440142233, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d4123720-r440142233-Palau_Sant_Jordi-Barcelona_Catalonia.html", "text": "Took my wife here for the Justin Bieber concert as she's a belieber and we had a great time. Terrific atmosphere, arrived at eight, got in quickly and found our seats no problem. ", "publishedDate": "2016-11-26", "language": "en", "rating": 5}, {"id": 439673345, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d4123720-r439673345-Palau_Sant_Jordi-Barcelona_Catalonia.html", "text": "This has to be one of the worst run venues I've ever been to.\n\nArrived at the concert at 5.30 to see a HUGE queue with hundreds of people.  The queue was moving along nicely so we decided to join it.  Then very abruptly the movement in the queue stopped.  The doors to the venue didn't open till seven so they let in just enough people to stand inside the grounds of the venue while the rest of us were just stood in a queue.\n\nThere were only three security men at the top of the queue.  Eventually it wasn't a queue anymore as people were just skipping to the top of the line which is very very unfair to those that have been stood there for ages.  There should have been security stopping people from skipping.\n\nEventually got into the grounds at 7.30 after a two hour wait.  There were toilet cubicles outside which we went straight into.  They were the most disgusting toilets I've ever been in my life. Used tampons all over the floor and not a scrap of toilet paper.  Absolutely disgusting.\n\nEventually got in line to the arena and were stopped abruptly for not having signed a consent form for my 13 year old stepson (how were we to know this) then had to leave the queue to join another queue for a consent form which was all in Spanish.  then had to join the queue again.  We eventually got to our seats at 8.10.\n\nOnce inside the venue is great with clean toilets and a clean area.  Queues for the shops and bar were enormous I wouldn't even attempt to join.\n\nJustin Bieber was amazing", "publishedDate": "2016-11-23", "language": "en", "rating": 3}, {"id": 412508353, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d4123720-r412508353-Palau_Sant_Jordi-Barcelona_Catalonia.html", "text": "Old olympic stadium not much to see really. I think there are activities for children and disabled people too on the tracks", "publishedDate": "2016-08-29", "language": "en", "rating": 3}, {"id": 388971515, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d4123720-r388971515-Palau_Sant_Jordi-Barcelona_Catalonia.html", "text": "Was there with my spouse for Adel concert. Great sound, convenient to get in and out. Would love to visit more often for great events!", "publishedDate": "2016-07-04", "language": "en", "rating": 5}, {"id": 378899516, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d4123720-r378899516-Palau_Sant_Jordi-Barcelona_Catalonia.html", "text": "We were here just last week to watch the amazing Adele! Well what can I say, probably one of the best music concert venues I have been to! Very chilled atmosphere, grass area all around once inside the venue so if your a smoker that's for u! Is a very long walk up a very steep hill to get to it but once there it's amazing! Only negative I have is that when u come out the metro is shut and to get a taxi is a nightmare! We walked back into town and there was no one about no bars u could go into wait or anything which is a real shame as I'm sure if there was more around people would ideally like to have a drink whilst waiting so long for a taxi! Other then that will Definitely go back to this venue.  ", "publishedDate": "2016-06-01", "language": "en", "rating": 5}, {"id": 355921295, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d4123720-r355921295-Palau_Sant_Jordi-Barcelona_Catalonia.html", "text": "Its a beautiful arena with a huge size outside with a beautiful fountain the bottom floor toilets are not the best they have graffiti I think they have not been revamped yet but you will hardy use it the once for the public are clean it's such an surrounding picture moments with views ", "publishedDate": "2016-03-15", "language": "en", "rating": 5}, {"id": 316485600, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d4123720-r316485600-Palau_Sant_Jordi-Barcelona_Catalonia.html", "text": "Beautiful setting overlooking the city; very good concert facilities - but tricky with public transport at night, so be prepared to walk back to your hotel.", "publishedDate": "2015-10-06", "language": "en", "rating": 4}, {"id": 262390544, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d4123720-r262390544-Palau_Sant_Jordi-Barcelona_Catalonia.html", "text": "went to see Robbie Williams, an impressive stadium.  Easy to reach via taxi.  We stayed at the Crowne Plaza Barcelona Fira Centre, only a 20 minute walk from hotel to stadium. we found it easier to get a taxi up, and a walk back as the stadium is up hill.  You could cut through the park, however didn't fancy that at night!  The area of the stadium is quite isolated, with no bars or restaurants around, unless we did not see them.", "publishedDate": "2015-03-29", "language": "en", "rating": 5}, {"id": 248637664, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d4123720-r248637664-Palau_Sant_Jordi-Barcelona_Catalonia.html", "text": "Wonderful experience in this stadium on the monjiuc. To come back for a new experience . Easy to get by taxi from placa de españa", "publishedDate": "2015-01-10", "language": "en", "rating": 4}, {"id": 229421691, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d4123720-r229421691-Palau_Sant_Jordi-Barcelona_Catalonia.html", "text": "You can wait for a taxi for one hour if you are out there by 22:00 or something. It is very isolated from the city", "publishedDate": "2014-09-17", "language": "en", "rating": 2}, {"id": 217398157, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d4123720-r217398157-Palau_Sant_Jordi-Barcelona_Catalonia.html", "text": "I went to the SANT JORDI CLUB, not the Palau Sant Jordi. This is an adjacent building where they do some concerts. There are no signs and it's a big area: Lluís Companys Stadium, Palau Sant jordi, this building, some pools, some gardens... Nothing indicated there. There are buses but again you need to ask the driver where to stop.\nThe space is quite big and the sound good (some eco but nothing bad). The concert I went to was Katie Melua and was announced at 20h but that was the time the doors opened and nobody knew the concert started actually at 21h. So another bad thing, maybe from the organizer.", "publishedDate": "2014-07-25", "language": "en", "rating": 2}, {"id": 192699534, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d4123720-r192699534-Palau_Sant_Jordi-Barcelona_Catalonia.html", "text": "Having already seen Michael Buble in Dublin last year I was looking forward to seeing  him again in Barcelona but I am afraid the venue was a bit of a let down.  It is a large arena and there just wasn't the atmosphere of the Dublin 02.  There are only a couple of small bars with limited choice and the sellers in the hall carried coke, beer and water only.  Definite shortage of wine!  And maybe that was the problem.  It wasn't full and there seemed to be a lot of people there who weren't really fans unlike in Dublin. Many  did not come in to watch the warm up band which are really great and then seemed reluctant to join in or be vey demonstrative.  Maybe Barcelona people are too cool to party.  They certainly don't seem to show much enthusiasm unlike the Andalucian crowds I am used to seeing in Malaga. But  Michael was fab!!", "publishedDate": "2014-01-31", "language": "en", "rating": 3}]}}]