[{"locationId": 6673955, "name": "Tramvia Blau", "placeType": "ATTRACTION", "reviewListPage": {"reviews": [{"id": 605182243, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d6673955-r605182243-Tramvia_Blau-Barcelona_Catalonia.html", "text": "Last time I came here it only ran the odd day - revisited and find it closed again this time for refurbishment but some sites say for Health and Safety grounds. Maybe one day I will travel on it if they get their act together.", "publishedDate": "2018-08-10", "language": "en", "rating": 1}, {"id": 561197376, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d6673955-r561197376-Tramvia_Blau-Barcelona_Catalonia.html", "text": "I wanted to take pictures and ride the old fashioned tramvia up to Tibidabu but was very disappointed to find out they were closing the same day I came. It was a demonstration there instead and a long line to ride for the last time. I can't understand how they can remove this amazing cultural attraction. Very sad! Hope they will start circulating soon again.", "publishedDate": "2018-02-18", "language": "en", "rating": 3}, {"id": 531049021, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d6673955-r531049021-Tramvia_Blau-Barcelona_Catalonia.html", "text": "Arrived at the stop to take the tram to the funicular and hadnt done my homework and found that in September it only ran at weekends. Ok my fault then I saw the price!! wow 5.50 for a single ride!! I am a transport enthusiast and am used to high prices but thats a rip off big time and its only 1 way !!  11.00 return.It is no length either. Someone having a laugh.", "publishedDate": "2017-10-08", "language": "en", "rating": 3}, {"id": 529036209, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d6673955-r529036209-Tramvia_Blau-Barcelona_Catalonia.html", "text": "Was planning on going up with this old tram. Ok, I know, bus is cheaper (even for free if you have the right metro card) but we wanted something else. After half an hour waiting, still no tram. We crossed the road and took the bus up. During the way up I never saw the tram. \nIf you plan on taking it, make sure it really goes. ", "publishedDate": "2017-10-02", "language": "en", "rating": 1}, {"id": 523902290, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d6673955-r523902290-Tramvia_Blau-Barcelona_Catalonia.html", "text": "The tram takes you up a very steep hill to the amusement park.  It's a fun old fashioned ride.  But that is the only place it takes you.", "publishedDate": "2017-09-12", "language": "en", "rating": 3}, {"id": 519368808, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d6673955-r519368808-Tramvia_Blau-Barcelona_Catalonia.html", "text": "Only if you wanna enjoy a ride with the tramv.\nIt's a little to expensive in comparation with the bus that is also faster.", "publishedDate": "2017-08-30", "language": "en", "rating": 3}, {"id": 511017434, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d6673955-r511017434-Tramvia_Blau-Barcelona_Catalonia.html", "text": "Don't get on the tram. Biggest rip off ever. We arrived with two kids and it cost 18 euro just one way. You then have to pay to go to the top of the hill on a different tram. To get back down you need to pay another 18 euro. There were no taxis. It's cheaper to get to the top by taxi from the centre of Barcelona. Definitely give the tram a miss", "publishedDate": "2017-08-10", "language": "en", "rating": 1}, {"id": 505302394, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d6673955-r505302394-Tramvia_Blau-Barcelona_Catalonia.html", "text": "The last time I visited Barcelona I really wanted to get to Up to Tibidabo so this time I worked to schedule. I bought a classic Tibidabo from Tourism Barcelona for 11 Euros that included using the Tramvia Blau. \n\nUpon existing the subway, the tram was just pulling in as I crossed the street.  I then boarded and despite the crowds got a seat. We then started up the mountain winding through a great neighborhood that includes several amazing but unknown modernisma buildings, especially a great one at the top designed by Sanier. Anyways what the tram lacks in speed it makes up in character. I thought it was a fun Andy good experience that I would recommend for those looking to get to the top of the mountain.", "publishedDate": "2017-07-24", "language": "en", "rating": 4}, {"id": 493954619, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d6673955-r493954619-Tramvia_Blau-Barcelona_Catalonia.html", "text": "Planed trip To Go On Tram  even booked local hotel \nWeekends ONLY   ??????\nsort it out      lots of people  we had to use a bus 192", "publishedDate": "2017-06-18", "language": "en", "rating": 1}, {"id": 491938888, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d6673955-r491938888-Tramvia_Blau-Barcelona_Catalonia.html", "text": "We took the ride up and paid €5.50 per person. On the way down we took a taxi instead all the way back to our hotel for less and it took the exact same route as the tram. ", "publishedDate": "2017-06-10", "language": "en", "rating": 2}, {"id": 491495478, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d6673955-r491495478-Tramvia_Blau-Barcelona_Catalonia.html", "text": "We took the tram on the way back from Tibidabo it quite cheap touristic tram and it runs every ~30 min. Do not expect to much but it has an old charm.", "publishedDate": "2017-06-08", "language": "en", "rating": 4}, {"id": 490465919, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d6673955-r490465919-Tramvia_Blau-Barcelona_Catalonia.html", "text": "On route to Tibibado amusement park we made the decision to travel on the Metro to the start location of this tram ride. The tram stop is where we purchased tickets from the ticket vendors. The tram apparently only runs at weekends during certain periods so check on line in advance. In terms of cost it was 5.50 Euros each which for a ride of circa a mile is a bit much in my opinion, especially as it only takes the user half way up the mountain, and you then have to pay another circa 7 Euros to use the Funicular Railway to complete the journey. When you consider that traveling from the City Centre you have to use the Metro, Tram and Funicular Railway to reach Tibibado and each has its own ticket cost, and that for a fraction of the cost (Circa 2.5 Euros) you can get a dedicated bus from the same City Centre (Place Catanya) direct to Tibibado then unless you want a different photo op, taking the Metro/Tram/Funicular railway does not make a great deal of sense.", "publishedDate": "2017-06-04", "language": "en", "rating": 3}, {"id": 488699905, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d6673955-r488699905-Tramvia_Blau-Barcelona_Catalonia.html", "text": "I used the tramvia blau with my wife and children and I was very surprised by how short the trip was, considering that the Price was 5.50 € p/person and you don't even have a guaranteed seat!!!\n\nOk, the tram was nice to see but, really, two euros would have been more than enough for the \"piece of history\". I would not recommend it to anybody as it is really not worth it.", "publishedDate": "2017-05-29", "language": "en", "rating": 2}, {"id": 488548483, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d6673955-r488548483-Tramvia_Blau-Barcelona_Catalonia.html", "text": "Not worth it at tickets are expensive tram does nothing more than just a ride it covers the same route as the bus, tram is small full of people on a hot day it can be very steamy. Route is super short something like 15 by foot. Taking tramvia blau only if you have lots of money and you want to spend them.", "publishedDate": "2017-05-28", "language": "en", "rating": 2}, {"id": 488496812, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d6673955-r488496812-Tramvia_Blau-Barcelona_Catalonia.html", "text": "Getting to the tram is either via the Metro (L7) or by one of the City tour Buses. We caught the first tram on Good Friday - No 5 built in 1904. A bit late starting and this meant it was full - all 32 seats plus quite a few standing. The fare was 5.50@€ pp each and we were given a voucher for 1€ off for a return trip.\n\nThe jouney between Av. Tibidabo & Plaça de Doctor Andreu (for Tibidabo Fuinicular) is about 10 minutes.Uphill speed is about 6 mph and downhill a bit slower.\n\nWhen we got back to lower tram stop, the queue was enough to fill 2-3 trams", "publishedDate": "2017-05-28", "language": "en", "rating": 5}, {"id": 485237138, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d6673955-r485237138-Tramvia_Blau-Barcelona_Catalonia.html", "text": "This is a very expensive way to reach the Funicular to go up to Tibidabo. It makes exactly the same road that also the bus does,but it will cost you more than double the bus price. It conveys you no particular vibe and it doesn't feel authentic at all. If you have to make a progra, consider queueing at least 30 minutes, bucause the tickets can be bought just in the tram and the process is quite long.\nIn my opinion a waste of time and money.", "publishedDate": "2017-05-18", "language": "en", "rating": 1}, {"id": 472969045, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d6673955-r472969045-Tramvia_Blau-Barcelona_Catalonia.html", "text": "The blue tram takes you up the first part of the ride to the top of mount tibidabo. It is just across the road from one of the stops on the hop on bus. Buy your ticket at the stop, and get a bit knocked off the price from the books of vouchers available on the tour buses. The tram is a delight of restored victorian engineering, and shares the road which is a fair hill climb, with nomal traffic. It's quite costly at 6 euros each for a fairly short ride, but worth it. Two cars run up and down the hill, and if you watch carefully on the way up or down you will see the tram depot of to one side of the road. Interested in victorian ingenuity,?  then work out how the cars change tracks and move in and out of the depot with no moveable points. Genius.", "publishedDate": "2017-04-05", "language": "en", "rating": 5}, {"id": 446425555, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d6673955-r446425555-Tramvia_Blau-Barcelona_Catalonia.html", "text": "The historic 1901 Blue Tram costs 5.50 Euros per person each way for a short ride from Plaza Kennedy to the base of the Tibidabo funicular, but the back-in-time feel coupled with the slow-moving views of modernist buildings on Avinguda Tibidabo is worth the price one way for one or two people (large families should consider alternatives).  Note that the 196 bus follows the same route uphill and is included on T-10 bus pass.  On the way down, the 196 bus goes by way of Gaudi’s Torre de Bellesgard, which offers a chance to see that attraction.  A taxi is also a realistic alternative, as the cost from the funicular base station to Plaza Kennedy (the Blue Tram route) is only about 6 Euros.  Although the hill is steep, it can be walked, as well.", "publishedDate": "2016-12-24", "language": "en", "rating": 3}, {"id": 430957062, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d6673955-r430957062-Tramvia_Blau-Barcelona_Catalonia.html", "text": "If you don't mind paying 5.5 euro for a pretty short ride uphill - go for it,\nIt's a slice of the past and probably strictly for the tourists. If you can walk it, it's not far and will save you some dough. You can take a short cut through the public gardens on the way up. ", "publishedDate": "2016-10-23", "language": "en", "rating": 4}, {"id": 430490594, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d6673955-r430490594-Tramvia_Blau-Barcelona_Catalonia.html", "text": "For Euro 5.50, this is an expensive tram ride, which is only a short link between the Avinguda Tibidabo Metro station and the funicular railway to Tibidabo.\nThe route 196 bus takes you to the same place via a slightly different route. You can use a T10 ticket for this.\nTip - The L7 station at Placa de Catalunya is located in the south west corner of the square, at the north end of La Rambla.", "publishedDate": "2016-10-21", "language": "en", "rating": 3}, {"id": 427894393, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d6673955-r427894393-Tramvia_Blau-Barcelona_Catalonia.html", "text": "An old tram that you can use to go to Tibidabo amusement park.It's a picturesque mean of transportation but nothing more.You need a special ticket for it,more expensive than an usual one.", "publishedDate": "2016-10-14", "language": "en", "rating": 3}, {"id": 427427661, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d6673955-r427427661-Tramvia_Blau-Barcelona_Catalonia.html", "text": "To get to the bottom of the Tibidabo funicular, you have to climb up hill about 1.5 miles. The Blue tram is a nice way to make this climb. My wife and I enjoyed the trip as it gave us a chance to relax.", "publishedDate": "2016-10-12", "language": "en", "rating": 4}, {"id": 426537447, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d6673955-r426537447-Tramvia_Blau-Barcelona_Catalonia.html", "text": "A pleasant trip up to Tibidabo and onwards if you wish via the funicular to the funfair at the top.  It only takes around 15 minutes, but it is an interesting trip with views back to the city and a look at the stately mansions which line the road.  Not much at the top, but a light lunch or drink in the Mirablau restaurant (see separate review) which has a great view over Barcelona is a good option.", "publishedDate": "2016-10-09", "language": "en", "rating": 4}, {"id": 421844058, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d6673955-r421844058-Tramvia_Blau-Barcelona_Catalonia.html", "text": "So the bus 196 has a stop 10 m (!) away. It has the same end point (funicular), offers much better scenery and costs a lot less ( 1 standard trip or free with hola bcn).\n\nThe tram stinks, it's very crowded and the 10 minute ride is hardly enjoyable. Would definitely not recommend.", "publishedDate": "2016-09-24", "language": "en", "rating": 1}, {"id": 420937833, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d6673955-r420937833-Tramvia_Blau-Barcelona_Catalonia.html", "text": "Took a trip on the Tramvia and it was a pleasant experience. It is expensive at €5.50 each, each way! For all of 15 mins! However, if you're not up to trekking half way up Tibitabo then it is worthwhile. We walked back as didn't think it was worth the return. It is well kept and run every efficiently. Worth a go.", "publishedDate": "2016-09-21", "language": "en", "rating": 3}, {"id": 416915786, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d6673955-r416915786-Tramvia_Blau-Barcelona_Catalonia.html", "text": "When arriving to board the tram, I went over to one of the rudest people I have even spoken to asking 'excuse me, do you sell the tram tickets ?' To the reply I got 'I'll be over to see you in five minutes.' While he stood scroll through Facebook! This is a very pricey activity as it cost you €5.50 to get up half way and then €4.50 with your going up ticket, however you are not told this and I only know this from seeing the people in front of me asking. Once you get to the end of where the tram takes you,\nYou have to get another train the rest of the way up. The second train however is a lot better and you can buy a return ticket for €7.", "publishedDate": "2016-09-10", "language": "en", "rating": 2}, {"id": 414547991, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d6673955-r414547991-Tramvia_Blau-Barcelona_Catalonia.html", "text": "You are transported back in time when sitting in the Tramvía Blau and it is a lovely experience, travelling slowly up and down the hill with enough time to take in the views of the wonderful mansions lining the road for a lot of the route. ", "publishedDate": "2016-09-04", "language": "en", "rating": 5}, {"id": 410442362, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d6673955-r410442362-Tramvia_Blau-Barcelona_Catalonia.html", "text": "The touristic bus stops here and you think you are taking the blue tram to Tibidabo but that is not the case.  It just takes you to the funicular which takes you to Tibidabo and you have to pay again there.  It is 5.50 each way not round trip also, so we just walked down and we actually beat the tram. Just walk or take the local bus, it is a much better deal. ", "publishedDate": "2016-08-25", "language": "en", "rating": 2}, {"id": 408777498, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d6673955-r408777498-Tramvia_Blau-Barcelona_Catalonia.html", "text": "As others point out, it's not a cheap trip, 5.5euro up for adults and 4.5euros down (if you keep your up ticket).\nThe tram stops at a site with three restaurants and the funicular up the rest of the mountain.", "publishedDate": "2016-08-22", "language": "en", "rating": 3}, {"id": 406138773, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d6673955-r406138773-Tramvia_Blau-Barcelona_Catalonia.html", "text": "The Tramvia Blau is an historic tram ( wooden seating, interior etc ) that winds its way up the hill ( some people were energetic enough to walk up in the 30 degree C plus temperature !) and back again ( no return tickets but there is a discount on the return ticket if you have taken the tram up). What's the point of taking the tram - well it's a fantastic experience and, once you are at the top, you can have lunch at one of the restaurants or you can catch the funicular to the top of the mountain at Tibidabo where there is an entertainment park for kids or you can simply soak up the magnificent view ( probably the best ) of Barcelona and visit the two side - by - side chapels.", "publishedDate": "2016-08-16", "language": "en", "rating": 4}, {"id": 403531607, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d6673955-r403531607-Tramvia_Blau-Barcelona_Catalonia.html", "text": "€11 for one way trip up to tip of aveniguda tibidado. The staff do not tell you this does not include the tram journey to the top of the mountain, so it costs €20 to get up and down before you even get to the top of he mountain which requires a separate ticket. The staff crammed as many people as possible on so we did not even get a seat for our €11 journey. We were so annoyed we decided we weren't wasting any more money on this tourist trap so we went for a beer and got a taxi instead, much cheaper!", "publishedDate": "2016-08-10", "language": "en", "rating": 1}, {"id": 397572573, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d6673955-r397572573-Tramvia_Blau-Barcelona_Catalonia.html", "text": "Unless you are a real tram enthusiast, don't bother with this \"attraction\". Why pay 5.50 Euros when Bus 196leaves and returns to the same spot for less than a euro? Them tram passes some great expensive homes but the Bus 196 does the same", "publishedDate": "2016-07-26", "language": "en", "rating": 2}, {"id": 393192978, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d6673955-r393192978-Tramvia_Blau-Barcelona_Catalonia.html", "text": "Old traditional trams from the end of metro L7. Great bit of nostalgia, but at a price - €5.5 to go up the hill and €4.5 to come back. We walked downhill - an easy walk and you get a good view of the tram as it slowly goes by. ", "publishedDate": "2016-07-16", "language": "en", "rating": 4}, {"id": 392572599, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d6673955-r392572599-Tramvia_Blau-Barcelona_Catalonia.html", "text": "We hopped off the Barcelona Tours bus to get the Tram to the top of Tibidabo. I was concerned over how getting to the mountain top might be but honestly its so much easier than it seemed. Directly across the road from the tour bus stop was the tram stop. A conductor gave us our fares in advance of the tram arriving to save extra queuing\n\nThe tram itself is an old fashioned delight, however very safe seeming. Its well worth it on a hot day to get the tram rather than walk\n\nThe tram stops half way up tibidabo but the funnicular to the peak stops directly across the road", "publishedDate": "2016-07-14", "language": "en", "rating": 5}, {"id": 387170421, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d6673955-r387170421-Tramvia_Blau-Barcelona_Catalonia.html", "text": "A nice little side trip from the bus tour of the city. Uses a vintage tram to transport you to the funicular up to the TIBIDABO park at the top of the mountain. A must for transport fans. Also has a reasonable restaurant at the top serving Tapas with a view over the city. ", "publishedDate": "2016-06-28", "language": "en", "rating": 4}, {"id": 384688258, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d6673955-r384688258-Tramvia_Blau-Barcelona_Catalonia.html", "text": "I love public transportation and especially ones 100+ years old. While there are cheaper and faster ways to go up or down Avenida Tibidabo, I had to do this once.\n\nIt's €5,50 per person, one way for about a 7 minute ride. Not a good value and if it's a crowded weekend day you'll wonder why you did it. If you are a public transportation geek you'll understand.\n\nIf your mission is to be atop Mt. Tibidabo (amusement park) and not fuss with the team, take the #22 bus from Placa Catalunya for €2,15 and then the funicular or take a hike like we did. ", "publishedDate": "2016-06-21", "language": "en", "rating": 3}, {"id": 379716659, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d6673955-r379716659-Tramvia_Blau-Barcelona_Catalonia.html", "text": "easy to find by public transport and a nice journey up to the funicular which then takes you up to Mount Tibadabo. From the top stop it is easy enough to walk back down. A novelty and little bit pricey but if it is quiet well worth the price.", "publishedDate": "2016-06-04", "language": "en", "rating": 5}, {"id": 372041750, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d6673955-r372041750-Tramvia_Blau-Barcelona_Catalonia.html", "text": "We booked our tickets online and got the return ticket of the tram and funicular and 2 rides at sky walk for €11 per person. It was great deal because if bought individually it would have costed us €21.20 each. The tram ran very frequently so did not have to wait for long at all. The queues weren't very long either. The staff was nice. It was a good experience for my 6 year old, he really enjoyed himself. ", "publishedDate": "2016-05-11", "language": "en", "rating": 4}, {"id": 359745765, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d6673955-r359745765-Tramvia_Blau-Barcelona_Catalonia.html", "text": "Ok, got to give some kudos to whomever thought up the idea of refurbishing an old tram and charging tourists a song to be sardine canned into a carriage and driven up a hill at a donkey's pace with little of a view due to the crowded space. Hey, even better, offer a 1€ discount if they decide to make the trip back! We fell for this one only to notice the metrobus after the fact. It will take you in airconditioned comfort with large windows for viewing up the hill at a far more moderate pace. For less than half the price. Or for almost nothing if you happen to take the metro to the bottom of the hill as the bus trip will be considered a transfer as part of the metro fare. You can catch the bus a few metres from the tram. ", "publishedDate": "2016-03-29", "language": "en", "rating": 2}, {"id": 358931278, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d6673955-r358931278-Tramvia_Blau-Barcelona_Catalonia.html", "text": "This popular attraction transports you to and from Avenue Tibidabo to the funicular and gives an insight into transport of a hundred years ago", "publishedDate": "2016-03-27", "language": "en", "rating": 4}, {"id": 345798879, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d6673955-r345798879-Tramvia_Blau-Barcelona_Catalonia.html", "text": "This was good for the novelty factor, however quite expensive as it is only a short journey, but I suppose it costs to maintain anything like this.    If you are counting your pennies then you can catch a bus up the mountain.  We caught the bus back.", "publishedDate": "2016-02-08", "language": "en", "rating": 4}, {"id": 319152583, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d6673955-r319152583-Tramvia_Blau-Barcelona_Catalonia.html", "text": "Took the 'blue tram' up to Mount Tibadabo, it was a fun experience but at €5.50 for a single it's not cheap, also they cram passengers in so we ended up a bit squashed, standing by driver on way up. \nGot seat on way down but as there were 4 of us we did wonder if the return trip was worth €44!!!", "publishedDate": "2015-10-15", "language": "en", "rating": 3}, {"id": 318019014, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d6673955-r318019014-Tramvia_Blau-Barcelona_Catalonia.html", "text": "We were careful to inquire about ticket cost and schedule. Ticket agent at the bottom repeatedly assured us that the €11,00 tickets were round trip. Well now, after lunch at the top, when we tried to board the tram for the ride back down the woman ticket agent informs us that the return ride is €10,00 each. In summary, for our group of four, this little tram racket cost us €84,00. Webtalked with others on the way down who were also mis", "publishedDate": "2015-10-12", "language": "en", "rating": 1}, {"id": 316417165, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d6673955-r316417165-Tramvia_Blau-Barcelona_Catalonia.html", "text": "This was by far the worst experience during our wonderful trip to Barcelona. This was caused by two terribly rude ticket sellers who wanted to let us pay for our youngest kids who would normally travel for free. They are only after your money and the tram surely isn't worth that money! Take the cheaper and faster bus instead!", "publishedDate": "2015-10-05", "language": "en", "rating": 1}, {"id": 314337131, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d6673955-r314337131-Tramvia_Blau-Barcelona_Catalonia.html", "text": "A lovely way to travel up to the funicular railway.  Yes you can take the bus which is cheaper but not a much fun.  For the more fitter I suppose you could walk back down to save money.", "publishedDate": "2015-09-28", "language": "en", "rating": 4}, {"id": 307819178, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d6673955-r307819178-Tramvia_Blau-Barcelona_Catalonia.html", "text": "We waited forever before leaving, it was very slow, and too expensive for the short distance traveled. We decided not to get on the funicular after this because it was such a time suck. Skip it. ", "publishedDate": "2015-09-07", "language": "en", "rating": 1}, {"id": 304107980, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d6673955-r304107980-Tramvia_Blau-Barcelona_Catalonia.html", "text": "The only reason I took this tram was to get up to mount tibidabo, it's well worth it since it's quite uphill. More necessary than fun in my opinion!", "publishedDate": "2015-08-27", "language": "en", "rating": 3}, {"id": 295129820, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d6673955-r295129820-Tramvia_Blau-Barcelona_Catalonia.html", "text": "This is a nice experience to ride this tram. It is not a cheap ride and cost 4.5 euros each way. One thing you can do is take it up and then enjoy the walk down. It should take you about twenty minutes to walk the path down.", "publishedDate": "2015-08-02", "language": "en", "rating": 4}, {"id": 292549280, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d6673955-r292549280-Tramvia_Blau-Barcelona_Catalonia.html", "text": "We used the tramvia as it appeared to be 'the' way to get up to the mountain. A good taste of how historically people traveled up the hill locally. I'm sure it would be nice for children to experience this, it is not the fastest or most comfortable way to go up, but good for a change. The bus travels about the same roads and goes more often.\nOn our way back, the tram left, barely anyone in there, so we took the bus down. That was faster as well. And, the regular metro card works in that bus too. So a single ride for EUR 5,50 is not very cheap if you compare it to the EUR 1,00 for the bus (or free if you're connecting from the metro)", "publishedDate": "2015-07-26", "language": "en", "rating": 3}, {"id": 283386927, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d6673955-r283386927-Tramvia_Blau-Barcelona_Catalonia.html", "text": "The period of service varies so check the website before setting off. \nThe journey is up/down hill towards the Tibidabo funicular bottom station, mainly through houses and villas\nThe tram (single car) starts close the end of the FGC Line L7 Av. Tibidabo banch\nThe trams are run by the transit authority but standard tickets are not valid. TMB bus services {Zone 1} run parallel services if you just want to take pictures\nThere are only single tickets sold (June 2015 € 7.20}\nGood views at the top", "publishedDate": "2015-06-27", "language": "en", "rating": 4}, {"id": 265842706, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d6673955-r265842706-Tramvia_Blau-Barcelona_Catalonia.html", "text": "Since there's only one cart going in every direction, the conductor's fill up the tram so much that people are crammed together (some are standing up).\nGoing slowly up the hill in a reconstructed (not even Genuinely old) Tram while cars and bicycles(!) keep passing it wasn't a really worthwhile.\n\nIn my eyes - there is really no reason what so ever to pay the fee and wait in line to get to mount Tibidabo with this \"authentic\" Tram. There's nothing romantic or special about it.\nJust take the bus instead...", "publishedDate": "2015-04-15", "language": "en", "rating": 2}, {"id": 258341200, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d6673955-r258341200-Tramvia_Blau-Barcelona_Catalonia.html", "text": "This is not the right address to get to the Tranvia Blau. Please people from TripAdvisor fix this error.  Thanks. ", "publishedDate": "2015-03-08", "language": "en", "rating": 1}, {"id": 243190772, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d6673955-r243190772-Tramvia_Blau-Barcelona_Catalonia.html", "text": "The Tramvia Blau is operated by Transports Metropolitans de Barcelona (TMB) but it is not part of Autoritat del Transport Metropolità (ATM) integrated fare network. Tickets must be purchased from the tram conductor (4.50e/person/way).\n\nThe trip is kind of short and you can easily walk the way down, or take the TMB-bus what you can use with your travel-card or much cheaper than Tramvia Blau.", "publishedDate": "2014-12-06", "language": "en", "rating": 3}, {"id": 238325429, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d6673955-r238325429-Tramvia_Blau-Barcelona_Catalonia.html", "text": "Worth a go for the experience, but short journey and only need to buy ticket up the mountain one way. Some others were catching the 196 bus which was probably cheaper and more frequent. Best advice is leave early and get thee son after 10am if you can....", "publishedDate": "2014-11-05", "language": "en", "rating": 3}, {"id": 216267357, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d6673955-r216267357-Tramvia_Blau-Barcelona_Catalonia.html", "text": "The tram takes you up the penultimate stretch to Tibidabo amusement park.\nIt's quite a hike uphill so a single fare of €4.2, one way, was worth it - coming back down we were able to get to the bottom long before those who waited for the tram to go down!\nTram is quite photogenic, and €4.2 keeps a bit of history running.", "publishedDate": "2014-07-19", "language": "en", "rating": 3}, {"id": 211907672, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d6673955-r211907672-Tramvia_Blau-Barcelona_Catalonia.html", "text": "After you leave the Tibidabo metro stop, then you walk across street to catch this cable car/tram.  It is 4.5 euros one way which is expensive compared to the metro tickets but unless you want to walk uphill to the funicular building, then it is worth it.  You also have a choice of getting on the bus but seems like it takes the fun out of the experience. You can save the money of buying a ticket back down since it is a fairly easy walk downhill. Besides you may get a few extra picture opportunities walking back down.  There is a shortcut walking down through a park near the top of the hill and the cable car stop.", "publishedDate": "2014-06-24", "language": "en", "rating": 3}, {"id": 208913254, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d6673955-r208913254-Tramvia_Blau-Barcelona_Catalonia.html", "text": "This was good for the novelty factor but quite expensive- I think about 5 euros each way? We just got the bus back down which was free with our Hola BCN travel pass. This is a good experience but I would probably have got as much from just going to see the tram and then going across the road to get the bus to be honest! ", "publishedDate": "2014-06-04", "language": "en", "rating": 4}]}}]