[{"locationId": 7161481, "name": "Casa de l'Ardiaca", "placeType": "ATTRACTION", "reviewListPage": {"reviews": [{"id": 735069973, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d7161481-r735069973-Casa_de_l_Ardiaca-Barcelona_Catalonia.html", "text": "Very lovely house with a beautiful garden, a bit hidden but very close to Catedral de Barcelona. You can see here a roman city wall, a nice fountain with a very old palm tree and also a nice marble-mail box with three swallows and a turtle. Definitely worth the stop if you are in the area, entry is free. ", "publishedDate": "2019-12-28", "language": "en", "rating": 5}, {"id": 715079017, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d7161481-r715079017-Casa_de_l_Ardiaca-Barcelona_Catalonia.html", "text": "Next to the Roman city wall is the entrance to the Casa de l'Ardiaca  from the 12th century.  This medieval work was in 1924 declared a Heritage of cultural interest. The architect Domènech i Montaner added to the Renaissance portal a unique marble-mail box with three swallows . In the courtyard of the house a palm tree was planted in the late19th century and next to it is a fountain. One of the most beautiful gothic buildings in Barcelona, ​​just behind the cathedral .The patio with fountain in the center is very beautiful, a very cozy atmosphere. Free entrance.", "publishedDate": "2019-10-03", "language": "en", "rating": 5}, {"id": 707247037, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d7161481-r707247037-Casa_de_l_Ardiaca-Barcelona_Catalonia.html", "text": "There is an artistic postbox right outside with a figure of a turtle that gives good luck to those who touch it! Inside there are plants and a fountain. Peaceful.", "publishedDate": "2019-09-06", "language": "en", "rating": 5}, {"id": 642558670, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d7161481-r642558670-Casa_de_l_Ardiaca-Barcelona_Catalonia.html", "text": "From a small entrance (with the most lavish letter box) off a passage perpendicular to the entrance steps to the Cathedral, you are led into the most peaceful courtyard to sit and recover from sightseeing and all the tourist crowds, with working fountain and hanging vegetation.  Wander up the staircase to the open upper level for unusual views of the Cathedral.\nAnd for once the experience is free!", "publishedDate": "2018-12-30", "language": "en", "rating": 5}, {"id": 571361697, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d7161481-r571361697-Casa_de_l_Ardiaca-Barcelona_Catalonia.html", "text": "It is a peaceful spot in the city to see flowers, tile and listen to the fountain. It also has a wheelchair ramp to the entrance but not to the upstairs. Good place for families as well to look around. The historical information is only in Catalan otherwise I would have rated this higher.", "publishedDate": "2018-04-05", "language": "en", "rating": 3}, {"id": 541015357, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d7161481-r541015357-Casa_de_l_Ardiaca-Barcelona_Catalonia.html", "text": "A bit hard to find, even the staff in the church office didn't know where this was. It's just around the back of the cathedral, the right side then to the left. We'd read the history and wanted to see it. Beautiful tile work and the famous Palm tree. Take a minute to go upstairs to a small photo gallery.", "publishedDate": "2017-11-14", "language": "en", "rating": 4}, {"id": 495832337, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d7161481-r495832337-Casa_de_l_Ardiaca-Barcelona_Catalonia.html", "text": "Being so close to the cathedral I suspect a lot of people walk past this building en route to other places but it is a lovely little courtyard with a nice fountain and palm tee. Not much else to see but worth popping in for a few minutes on your way past. ", "publishedDate": "2017-06-25", "language": "en", "rating": 3}, {"id": 460854281, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d7161481-r460854281-Casa_de_l_Ardiaca-Barcelona_Catalonia.html", "text": "Somehow overlooked by most tourists, this is a beautiful retreat located just next to the stunning cathedral.\nThe retreat, which dates back to the 12th century, includes a lovely patio with a nice fountain in its center and is worth a 15-minute visit to experience  its Gothic-Renaissance style.", "publishedDate": "2017-02-18", "language": "en", "rating": 4}, {"id": 380677446, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d7161481-r380677446-Casa_de_l_Ardiaca-Barcelona_Catalonia.html", "text": "The current House of L'Ardiaca was built in the 1400s AD by the Archdeacon Lluís Desplà, who converted the traditional 12th-century site of his residence into a Gothic palace. The palace is in the heart of the Gothic Quarters, and as the archdeacon’s residence, it sits just to the side of the Barcelona Cathedral’s main portal, its entry facing the cathedral. And if you prefer Roman history to Catholic medieval, the back wall of the palace uses the original Roman wall that forms the gateway into what had been imperial Barcelona, called Barcino by Romans. If you circle the exterior of the palace structure, you will see the Roman gateway. Entry into the palace is free, and although it is in the midst of possibly the busiest tourist square in Barcelona, the inner courtyard is amazingly peaceful. There is beautiful tile work all along the cloistered courtyard and at the center is a huge palm tree and sweet fountain. While the palace is likely not worth an independent visit, definitely check it out if you are in the Gothic Quarters. At the very least, walk by to see its famous turtle and swallows mailbox that is to the right of the entry. In 1895, the city’s Lawyers’ Association moved into the palace and commissioned architect Lluís Domènech i Montaner to design the letter box with five swallows to guarantee the freedom of justice and a turtle to represent bureaucratic procedures that delay the legal processes.", "publishedDate": "2016-06-07", "language": "en", "rating": 4}, {"id": 316118474, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d7161481-r316118474-Casa_de_l_Ardiaca-Barcelona_Catalonia.html", "text": "Outside this building may well be the most attractive mailbox you've ever seen, adorned with swallows and a turtle--an earlier era's way of suggesting air mail and slow mail? But the Archbishop's Palace is also home to temporary exhibits and features a restful courtyard.  So go on in and see what else is there.", "publishedDate": "2015-10-04", "language": "en", "rating": 4}, {"id": 237103862, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d7161481-r237103862-Casa_de_l_Ardiaca-Barcelona_Catalonia.html", "text": "This little house is right outside the cathedral and is worth a minute of two.  It is a typical 16th/17th century house with a central courtyard (fountain in this one) with a balcony around the upper courtyard...", "publishedDate": "2014-10-30", "language": "en", "rating": 3}]}}]