[{"locationId": 295879, "name": "Palau Güell", "placeType": "ATTRACTION", "reviewListPage": {"reviews": [{"id": 752167548, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d295879-r752167548-Palau_Guell-Barcelona_Catalonia.html", "text": "Firstly, I didn't have to pay an entry fee due to the attraction being free on the first Sunday of a month (though you do need to pre-book the ticket in advance still). It really was quite interesting, and I really enjoyed my visit. The views from the top of the building particularly with the ceramic art incorporated was particularly nice. The house was fun to explore with many organic themes.", "publishedDate": "2020-04-02", "language": "en", "rating": 5}, {"id": 749501085, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d295879-r749501085-Palau_Guell-Barcelona_Catalonia.html", "text": "Palau Güell has a fascinating  history and is well worth a visit for €12pp. Guided tours are also available at certain times at no extra cost. We did the English tour which started at 10 am and lasted approx 2 hours. It was excellent, our guide Virginia was very knowledgeable and passionate about her subject. Best of all, there was no crowds and no queue to get in, even though the house is situated just a short stroll from La Rambla. \n\nGüell Tapas on the opposite side of the road is great for lunch after your tour (see separate review).", "publishedDate": "2020-03-06", "language": "en", "rating": 5}, {"id": 749343235, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d295879-r749343235-Palau_Guell-Barcelona_Catalonia.html", "text": "This was one of my favourite visits when in Barcelona. It is not crowded like the rest of the Gaudi attractions but it is definitely worth visiting especially if you're into more gothic architecture", "publishedDate": "2020-03-05", "language": "en", "rating": 5}, {"id": 749235902, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d295879-r749235902-Palau_Guell-Barcelona_Catalonia.html", "text": "An authentic and magical place full of creativity, that any tourist who comes to visit will be amazed", "publishedDate": "2020-03-05", "language": "en", "rating": 5}, {"id": 749059242, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d295879-r749059242-Palau_Guell-Barcelona_Catalonia.html", "text": "We were fortunate to be in Barcelona on the first Sunday of the month, so we were able to get tickets for free, but you do have to book them ahead of time online and arrive about 10 minutes before your scheduled time to line up to get in. This house is impressive! We have toured many castles throughout Europe, but this was the most impressive house I have ever been in (at least until the next Gaudi house we visited). I was impressed at the intricate work and how every part of the house was so detailed and carefully planned. I enjoyed doing the audio guide so there was time to go at our own pace and really take in all of the details of the design. It is worth paying to go in and it much more affordable than some of the other Gaudi buildings.", "publishedDate": "2020-03-04", "language": "en", "rating": 5}, {"id": 749056049, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d295879-r749056049-Palau_Guell-Barcelona_Catalonia.html", "text": "quite an interseting hour. we got a free ticket as 1st Sunday in the month is free. you still have to book your time slot online. Very intersting and glad we visited", "publishedDate": "2020-03-04", "language": "en", "rating": 4}, {"id": 748150646, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d295879-r748150646-Palau_Guell-Barcelona_Catalonia.html", "text": "I think this is one of the hidden gems of Barcelona. While you have to climb lots of stairs, it was so enthralling and amazing we hardly noticed until we were coming down from the roof to exit. Unbelievable craftsmanship on the wood, iron and brick work. From the stables in the basement to the chimneys on the roof, exquisite in every since.", "publishedDate": "2020-02-28", "language": "en", "rating": 5}, {"id": 747126570, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d295879-r747126570-Palau_Guell-Barcelona_Catalonia.html", "text": "The Palau Güell is a mansion designed by the architect Antoni Gaudí for Eusebi Güell and built in the late 1800’s. A must visit as you get a lot of insight into both people. The inside is incredibly beautiful and you can see all the thought that went into every little detail, from the stables all the way to the rooftop. The audio guide is perfect as it walks you through the building and explains the little minutiae that are easy to be missed. At only 11€ for entry, which includes the self guided audio, it is a very reasonable fee.", "publishedDate": "2020-02-23", "language": "en", "rating": 5}, {"id": 746932796, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d295879-r746932796-Palau_Guell-Barcelona_Catalonia.html", "text": "We were pushed for time so decided not to enter the 'pay for' part of the park. We entered from Vallcarca metro stop and this was at the back of the park where it was much quieter and wandered around, stopping at the Viaducts (stunning) before heading out by the main entrance. For me, this is what the park was originally for, a place of peace and quiet - beautiful", "publishedDate": "2020-02-23", "language": "en", "rating": 5}, {"id": 744812252, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d295879-r744812252-Palau_Guell-Barcelona_Catalonia.html", "text": "Enjoyed going through this old house - very interesting. You get a good feel for his design styles. It is expensive tho.", "publishedDate": "2020-02-13", "language": "en", "rating": 4}, {"id": 744748377, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d295879-r744748377-Palau_Guell-Barcelona_Catalonia.html", "text": "If you are strolling on La Rambla  get one step out of your way and visit this place - you will not regret it . \nAt the first sight I didn't know how to feel about it ,as it was one of the first pit stops on our trip to Spain..\nBut now, after completing our trip ,I finally get it  ..Spain is a whole \" experience  \" in itself : the vibes , the nature , the people, the culture...they fill up your heart in such a big way ! Gaudi must have felt the same and wanted to share this through his genius art .\nThe inside of the house takes you a century back in time: try to picture yourself dressed in the moment and living a lavish life-style at the end of the 19th century ...\nBut once you get on the roof ,the shapes. the colors, the lights take you to a whole different level : \" Barcelona\"  state of mind  : embrace it and take it all in , you're now hooked for life ...", "publishedDate": "2020-02-12", "language": "en", "rating": 4}, {"id": 743608579, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d295879-r743608579-Palau_Guell-Barcelona_Catalonia.html", "text": "It’s a nice, reasonably priced audio tour that takes about an hour. So much of the house is actually quite different from what you’d expect if you’ve only seen photos of the chimneys/roof. It’s sort of dark and not as flamboyant but it’s still great with so many unique touches, big and small, that it’s always interesting. ", "publishedDate": "2020-02-07", "language": "en", "rating": 4}, {"id": 742673568, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d295879-r742673568-Palau_Guell-Barcelona_Catalonia.html", "text": "We caught the free entry, but I booked in advance, which was lucky, as all the tickets were sold out. The inside of the palace is amazing, beautiful, a glimpse into master Gaudi's mind. The architectural solutions he used are so smart and creative. The audioguide was very informative! The rooftop was my favourite part, with all the colourful chimneys!", "publishedDate": "2020-02-02", "language": "en", "rating": 5}, {"id": 741867067, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d295879-r741867067-Palau_Guell-Barcelona_Catalonia.html", "text": "We only had a quick visit to Palace Guell when we were walking on the avenue. Didn’t buy a ticket to enter. Exterior architecture was amazing. So many details. I don’t think it’s necessary to buy tickets online in advance. The day we were there we saw no line waiting. ", "publishedDate": "2020-01-28", "language": "en", "rating": 4}, {"id": 740825995, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d295879-r740825995-Palau_Guell-Barcelona_Catalonia.html", "text": "I was unfamiliar with Gaudi's work and wanted to visit Parc Guell, but woke up late and didn't want to deal with the crowd so we visited Palau Guell instead. It was a great decision! Tickets are reasonably priced, and it wasn't that busy (we went on a Friday afternoon) so it was easy to navigate at my own pace. The audio guide is provided with the price of the ticket and available in several languages. I was impressed by how everything was functional yet so ornate, with incredible attention to detail. I really loved the central room with the chapel, as well as the stables and the rooftop. I'm glad we decided to stop here, it was very interesting and well worth the time and money.", "publishedDate": "2020-01-23", "language": "en", "rating": 5}, {"id": 740643743, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d295879-r740643743-Palau_Guell-Barcelona_Catalonia.html", "text": "Reprimand me for my ignorance, but I confused the names and spent 11 Euros touring Gaudi's Palau Guell when I meant to have gone to Park Guell. I broke every rule of tourism and failed to prepare in advanced during this sporadic decision after my lecture (here on college exchange). I doubt anyone made the same mistake as me, but just in case - use Google first!", "publishedDate": "2020-01-22", "language": "en", "rating": 3}, {"id": 738072425, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d295879-r738072425-Palau_Guell-Barcelona_Catalonia.html", "text": "Beautiful building and very well preserved.  Audio guide very helpful in giving background to the Guell family’s life and Gaudi’s methods.  Essential for Gaudi and Modernista fans.  Worth visiting for anyone and very handily located just off the Ramblas.", "publishedDate": "2020-01-09", "language": "en", "rating": 5}, {"id": 737853335, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d295879-r737853335-Palau_Guell-Barcelona_Catalonia.html", "text": "We were lucky to pick a quiet day so had a minimal wait before going in. The cost of the entry ticket was reasonable and included a free audio guide which was very comprehensive. The tour through the palace from basement  to roof top takes about an hour. The craftmanship and attention to detail was fantastic. The City Council has also taken enormous care with respect to renovation and where replacement has been necessary the emphasis is to be as authentic as possible. The decoration throughout is stunning. There are examples of the original furniture is some rooms but many of the spaces are not 'dressed', which was a slight disappointment. Gaudi's flair and style shines through. For me the highlight was the roof and the magnificent chimney pots. If you've got time...go. ", "publishedDate": "2020-01-08", "language": "en", "rating": 4}, {"id": 735948386, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d295879-r735948386-Palau_Guell-Barcelona_Catalonia.html", "text": "We diverted from our walk up Las Ramblas to catch our first glimpse of Gaudi at Palau Guell. We only saw the outside, which seemed darker and more depressing than the other works we saw (Casa Batllo and Casa Mila, Parc Guell, and Sagrada Familia) but I'm glad we made the effort to go by.", "publishedDate": "2019-12-31", "language": "en", "rating": 4}, {"id": 734819116, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d295879-r734819116-Palau_Guell-Barcelona_Catalonia.html", "text": "This house is a great introduction to Gaudi's work. A great combination of wood, metal work and mosaics. It's worth the walk all the way to the top to see the chimneys.", "publishedDate": "2019-12-26", "language": "en", "rating": 5}, {"id": 733060941, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d295879-r733060941-Palau_Guell-Barcelona_Catalonia.html", "text": "I recommend going to the free portion of the park and walking the paths. Gaudi’s vision in the park is strong and worth seeing. The monumental area is under renovation and you can see much of it from the free areas so I suggest skipping it for now.", "publishedDate": "2019-12-16", "language": "en", "rating": 4}, {"id": 733045703, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d295879-r733045703-Palau_Guell-Barcelona_Catalonia.html", "text": "Guell Palace has jumped to my No. 2 must-visit-place of Gaudi’s works of art in Barcelona!  So many thoughtful detailed creations poured into this elegant yet luxe mansion.  It is indeed a ‘palace’ even if it happens to be in a small alley of the city.  We surprisingly spent 2+ hours here taking endless photos while enjoying the stories with the audio guide.  (honestly, I would recommend this place over Guell Park from my experience)", "publishedDate": "2019-12-16", "language": "en", "rating": 5}, {"id": 731424014, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d295879-r731424014-Palau_Guell-Barcelona_Catalonia.html", "text": "I'm not a fan of crowds or queues, so when I found Palau Guell, I felt like I had hit the jackpot. Best value for money, no jostling for a better view. Amazing history and beautiful, but practical designs by Gaudi. I loved this but sshhhh let's keep it a secret.", "publishedDate": "2019-12-08", "language": "en", "rating": 5}, {"id": 731418041, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d295879-r731418041-Palau_Guell-Barcelona_Catalonia.html", "text": "It’s easy to get to on the subway from tourist hotels and historical sights and also easy to book your tickets online for the designated time you want to go.  They limited the number of people on the property by the hour so it’s necessary to prepurchase.  The other benefits of online purchasing is that there are senior and student discounts and your ticket includes a round trip bus ride from the subway stop to the park.(15 minute ride).  The park has a couple of houses and a small interesting park and should take no more than an hour to see.", "publishedDate": "2019-12-08", "language": "en", "rating": 3}, {"id": 730550319, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d295879-r730550319-Palau_Guell-Barcelona_Catalonia.html", "text": "It has the best audio guide among other museums / sights. It takes around 1 hour to visit everywhere with audio guide. There is free lockers to put your stuff. Definitely recommend anyone. ", "publishedDate": "2019-12-03", "language": "en", "rating": 5}, {"id": 730497059, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d295879-r730497059-Palau_Guell-Barcelona_Catalonia.html", "text": "This is well worth the time to see the details and imagination of Gaudi. The audio guide tour is really well done-good information, at your own pace, with the ability to stop and start as needed. ", "publishedDate": "2019-12-03", "language": "en", "rating": 5}, {"id": 729909680, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d295879-r729909680-Palau_Guell-Barcelona_Catalonia.html", "text": "The interior is nice, but being one of Gaudi's earlier works, is a little more conventional than most of his buildings. Still great to see, but not as unique. The chimneys, however, are super fun. Wandering around the roof looking at all the neat things he did with them is great! It's worth a visit for those alone.", "publishedDate": "2019-11-30", "language": "en", "rating": 4}, {"id": 729789634, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d295879-r729789634-Palau_Guell-Barcelona_Catalonia.html", "text": "I'm aware of Gaudi and saw Sagrada Familia and Park Guell, and even still was blown away by this Palace. The detail, design, thought and genius is hard to describe. You will not regret, book in advance and go!", "publishedDate": "2019-11-30", "language": "en", "rating": 5}, {"id": 728874840, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d295879-r728874840-Palau_Guell-Barcelona_Catalonia.html", "text": "This was a fascinating building. Some absolutely stunning ceilings and windows. Good value. Audio was a little tricky at first. An amazing roof terrace too well worth a visit. ", "publishedDate": "2019-11-25", "language": "en", "rating": 5}, {"id": 728860510, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d295879-r728860510-Palau_Guell-Barcelona_Catalonia.html", "text": "My advice is get in the park before 8 am before the rush. And  watch the sun come up over Barcelona for true magic, you must visit the home of Gaudi and hike to the park over looking the city \nYou will not be disappointed, I suggest grabbing a local bread and some snacks for a nice picnicking on the vista over looking Sagrada Familia. Water is a must have but the locals are selling plenty of small waters for 1 euro 1 euro 1 euro.", "publishedDate": "2019-11-25", "language": "en", "rating": 5}, {"id": 728198293, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d295879-r728198293-Palau_Guell-Barcelona_Catalonia.html", "text": "The tiles in the park are quite lovely indeed.  However, I was somewhat surprised with the small size of the inner park area, perhaps rendered even smaller by the enormous crowds.  The metro with free bus connection is the best way to visit the park, as it is a very long walk uphill from the Eixample.  ", "publishedDate": "2019-11-22", "language": "en", "rating": 4}, {"id": 727712575, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d295879-r727712575-Palau_Guell-Barcelona_Catalonia.html", "text": "It is NOT deaf friendly.  Insufficient English scripts.  No booklet in English language for deaf Americans traveling who cannot hear or lipread Catalan language!  We were motivated to learn and appreciate cultural richness but missed out a lot the history behind that catheral due to lacking of English language in print for us to read.   What i recalled from my college course in Art History on Gothic, Romansque, etc that i studied 45 years ago.  It was not helpful.   I only took pictures and left after 15-30 minutes of touring there.", "publishedDate": "2019-11-20", "language": "en", "rating": 1}, {"id": 727069373, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d295879-r727069373-Palau_Guell-Barcelona_Catalonia.html", "text": "A group of us traveled to Barcelona on October 30, 2019...we took a guided tour with Barcelona Day Tours\nAnd our experience was wonderful..great guide and a lot of interesting sights..would recommend ", "publishedDate": "2019-11-17", "language": "en", "rating": 5}, {"id": 726822658, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d295879-r726822658-Palau_Guell-Barcelona_Catalonia.html", "text": "Loved this place, the people are extremely nice and the house was lovely. You really get to experience Gaudi's work. We visited the other places of Gaudi designed but was limited to one room or area. However, here you get to see the entire home from the basement to the roof. It was amazing. I could not beleive how big this place was and the amount of detail in Gaudi's work. This is a must see if you are a fan of Gaudi.", "publishedDate": "2019-11-16", "language": "en", "rating": 5}, {"id": 726155337, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d295879-r726155337-Palau_Guell-Barcelona_Catalonia.html", "text": "The monumental area is a good introduction to the Gaudi style if you haven't seen much of it before.  It is worth the admission price but his best work (to my taste) is elsewhere in the city.  However, the park a a whole is wonderful:  interestingly designed and built, pretty views, and free.", "publishedDate": "2019-11-13", "language": "en", "rating": 5}, {"id": 725969978, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d295879-r725969978-Palau_Guell-Barcelona_Catalonia.html", "text": "We could not stop photographing every detail and every chimney in the building. The highlight is the roof which is an outstanding example of Gaudi's creativity.", "publishedDate": "2019-11-12", "language": "en", "rating": 5}, {"id": 725769442, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d295879-r725769442-Palau_Guell-Barcelona_Catalonia.html", "text": "A Gaudi playground. Lots to see but as must happen, a fair amount was under scaffolding and being restored. It’s worth the trip. And the Bus Güell from the Metro worked perfectly. Really well done. Climbing to the top of the park is worth it for the views on a fair day.", "publishedDate": "2019-11-11", "language": "en", "rating": 4}, {"id": 725659420, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d295879-r725659420-Palau_Guell-Barcelona_Catalonia.html", "text": "Again a must see in Barcelona. Close to the market of the Ramblas. Audio guide gives heaps of info. My kids (13 and 9) tuned in totally. What I really liked is the fact that all the Spanish  surveillance/ guards are so super friendly. You can ask them anything and they know it. I had a conversation for about 20 min with one of them and it was really good. She had great extra knowledge/ things to tell.  Their English is perfect. We are truly impressed by the Spanish employees in these wonderful tourist attractions.", "publishedDate": "2019-11-11", "language": "en", "rating": 5}, {"id": 725344758, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d295879-r725344758-Palau_Guell-Barcelona_Catalonia.html", "text": "This palace is just off La Rambla & the interior visit is well worth the time & money.  Designed by Gaudi, the architecture & design was spectacular.  The view of the city from the roof top is breathtaking.", "publishedDate": "2019-11-09", "language": "en", "rating": 5}, {"id": 724987194, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d295879-r724987194-Palau_Guell-Barcelona_Catalonia.html", "text": "Interesting place, full of colours but not so many things to see or houses to visit....I had higher expectations...", "publishedDate": "2019-11-08", "language": "en", "rating": 4}, {"id": 724978245, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d295879-r724978245-Palau_Guell-Barcelona_Catalonia.html", "text": "It seemed very Medieval!  The only thing I have seen in the US that slightly compares in Hearst Castle, which is also very different.  \n\nThe workmanship is astounding and sometimes fanciful.", "publishedDate": "2019-11-08", "language": "en", "rating": 4}, {"id": 724524960, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d295879-r724524960-Palau_Guell-Barcelona_Catalonia.html", "text": "Having loved Gaudi's ideas of space, textures, colour, architectural concepts for years, to be in his spaces was truly remarkable and awe-inspiring.", "publishedDate": "2019-11-06", "language": "en", "rating": 5}, {"id": 724224827, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d295879-r724224827-Palau_Guell-Barcelona_Catalonia.html", "text": "We walked past Palau Guell one afternoon, and as there was no queue, thought we would pop in right there and then.  It is an absolutely stunning showcase of Gaudi's unusual architecture, and we thought it was the best example of his work, after being to other Gaudi places.  It is a mansion, 6 storeys high, and stunning in every aspect.  The audio guide is very informative.  Highly recommend.", "publishedDate": "2019-11-05", "language": "en", "rating": 5}, {"id": 723566888, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d295879-r723566888-Palau_Guell-Barcelona_Catalonia.html", "text": "What you see in the picture is not sufficient to understand what this palace was...not even close.  It's hard to imagine the contours, the views and the mosaic features so if you are going to Barcelona include this on your trip.", "publishedDate": "2019-11-03", "language": "en", "rating": 5}, {"id": 722672490, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d295879-r722672490-Palau_Guell-Barcelona_Catalonia.html", "text": "Wish we had picked Casa Battlo instead.  Palace Guell was fine but the whole visit was somewhat less than expected.  Early work of the artist and so was less \"like\" the other sites. But, the audio guide was hard to operate (wrong room,  wrong narrative and then fixing that was difficult by going back and forth in the audio guide) and it would have been more interesting to note how this structure influenced future works. ", "publishedDate": "2019-10-30", "language": "en", "rating": 3}, {"id": 722619733, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d295879-r722619733-Palau_Guell-Barcelona_Catalonia.html", "text": "Worth a visit. The audio tour is very well done. Very clean and easy to tour. Some stairs, be careful. ", "publishedDate": "2019-10-30", "language": "en", "rating": 5}, {"id": 722141690, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d295879-r722141690-Palau_Guell-Barcelona_Catalonia.html", "text": "Palau Guell was never on my list of sights to see. After walking in the Gothic quarter, we had some time to kill before lunch and came across this place. There were no queues and this made our decision easy to buy the tickets and spend some time in the interior. The audio guide comes free with the tickets, which was very useful. Overall we spent a bit more than an hour here and enjoyed every bit of it. There was hardly any crowd here which was a big plus. I was blown over by the stained glass windows, the massive staircase, the wooden ceilings and gates, wrought iron doors, the cellar which used to be stables for horses, the facade which is entirely built of limestone, beautiful ceramics in the bathroom and the mosaic chimneys on the rooftops- brilliant Gaudi creation. Glad that we visited this place. Even the kids loved it- the audio guide has a separate kids tour as well.", "publishedDate": "2019-10-28", "language": "en", "rating": 4}, {"id": 721734816, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d295879-r721734816-Palau_Guell-Barcelona_Catalonia.html", "text": "Located right off the main drag in the Gothic Quarter and it was NEVER crowded.  Gorgeous interiors and they give you access to the entire home.  It is a MUST!  Self guided tour was really well done.", "publishedDate": "2019-10-27", "language": "en", "rating": 5}, {"id": 721574678, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d295879-r721574678-Palau_Guell-Barcelona_Catalonia.html", "text": "We did not actually go in because it was close on Mondays.  Had I known that this place was literally steps from our hotel I would have walked over instead of taking an afternoon nap that Sunday.  From the outside it looked incredible just like all of Gaudi's designs.  A lot of intricate detail on the facade.  We will definitely have to go back to see it.", "publishedDate": "2019-10-26", "language": "en", "rating": 3}, {"id": 721452364, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d295879-r721452364-Palau_Guell-Barcelona_Catalonia.html", "text": "Wonderful example of work Gaudi did for his wealthy benefactors. Although hard to heat, this would have been a beautiful house to live in.You get an excellent audio tour and can appreciate the architecture and sumptuous decor without being too crowded. A must visit for any Gaudi aficionado.", "publishedDate": "2019-10-26", "language": "en", "rating": 5}, {"id": 721155878, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d295879-r721155878-Palau_Guell-Barcelona_Catalonia.html", "text": "Visited solo and picked my time at around 1 pm, when most people seem to eat. Not busy, no wait for ticket, headphone set to talk you through the rooms. I love the easy, set - your - own - pace option of this. Compared to other Gaudi masterpieces, this one is totally different again, and a lot of dark colours are used but in a splendid way. Lots of woodwork, amazing shapes and as always, lots of surprises that you can expect from this genius. Take the family bathroom and the shape of the toilet for instance (Yeah, weird to be impressed by a toilet, but I was!), or the curved arches in the utility section of this palace.\nFrom the curved stables to the top floor, an amazing, and far less busy option to see the work of this man; that doesn't mean you shouldn't see his other houses and works. Easily located just off Las Ramblas. By the time I walked out around 3.45, it was much busier at the entrance, and inside it was still very comfortable but more crowded too. So, go early, or at lunch time to enjoy the best photo opportunities", "publishedDate": "2019-10-25", "language": "en", "rating": 5}, {"id": 720535676, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d295879-r720535676-Palau_Guell-Barcelona_Catalonia.html", "text": "What a gorgeous park!  Visit the Palau of course, and revel in it's beauty, then spend some time walking around the park which is a wonder!  Beautifully kept, an oasis in Barcelona! ", "publishedDate": "2019-10-22", "language": "en", "rating": 5}, {"id": 720324168, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d295879-r720324168-Palau_Guell-Barcelona_Catalonia.html", "text": "From a distance it looks like Dr. Seuss took inspiration of this.  Perched atop a hill in Barcelona is Palau Guell.  You will need to buy a ticket ahead of time, otherwise you will not get it. Gaudi envisioned a housing development complex that  unfortunately was not a commercial  success. (it was up  high on the hill and in the early 1900's was too isolated)  Nevertheless several elements of the complex were built, including 2 houses, an entrance way, aqueducts, and several wonderful mosaic designs.  A circular arena with mosaic benches is being restored.  Another must see in Barcelona.  Metro takes you close.  Then go up several outdoor escalators to get to the top.  A very interesting place to visit.  Allow 3-4 hours to see it all.  Pretty grounds and landscaping.  You will not be disappointed.", "publishedDate": "2019-10-21", "language": "en", "rating": 5}, {"id": 719893460, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d295879-r719893460-Palau_Guell-Barcelona_Catalonia.html", "text": "Gaudi never disappoints.  When in Barcelona, visit all the Guadi that you have time for.  His creativity and color combinations are a delight to the eyes.  ", "publishedDate": "2019-10-20", "language": "en", "rating": 5}, {"id": 719812976, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d295879-r719812976-Palau_Guell-Barcelona_Catalonia.html", "text": "Maybe a lesser known Gaudi palace. We felt that alongside the Sagrada Família this completes a wholesome experience.\n\nEasy to book tickets in their web site. Even just 1 day in advance. Place is surprisingly lightly toured\n\n The roof is captivating\n\nTook the audio guide (free) but decided to unplug and just take in the beauty, the psychedelic genius without the mind getting in the way\n", "publishedDate": "2019-10-20", "language": "en", "rating": 5}, {"id": 719775282, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d295879-r719775282-Palau_Guell-Barcelona_Catalonia.html", "text": "I am actually a bit disappointed with this since many places or spots were under construction, and it was extremely crowded even i booked it. I mean the time slot was full of tourists. Maybe it is better to book earlier and then you can stay longer without many tourists. I would suggest to pick an early time so less tourists will be there and you can take better pictures with nice breeze. the terrance was mostly under construction so it is kind of destroying the scene. ", "publishedDate": "2019-10-19", "language": "en", "rating": 3}, {"id": 719194798, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d295879-r719194798-Palau_Guell-Barcelona_Catalonia.html", "text": "This is a great place to experience Gaudi's designs without the crush of tourists at his more popular buildings or the prices.  It was just the right amount of information and time for our kids (9 and 12).  Audio guides in any language are included in the entrance - my younger son got the \"kids\" version, but we probably should have taken the adult for him as the kids version just cuts out a lot of the rooms.  Informative video upstairs with some background on Guell and Gaudi and their partnership.  Recommend pre-booking a day or so ahead, but some tickets are probably available at the door.", "publishedDate": "2019-10-17", "language": "en", "rating": 4}, {"id": 718892871, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d295879-r718892871-Palau_Guell-Barcelona_Catalonia.html", "text": "The Palau Güell is a mansion designed by the architect Antoni Gaudí for the industrial tycoon Eusebi Güell.  It was  built between 1886 and 1888. . It is part of the UNESCO World Heritage Site . It's absolutely beautiful. The wood work, the wrought iron workmanship is unbelievable.  The stain glass and shutter system to control light . Each rooms have great furniture and decorations. The most impressive part is the roof.  The stables are also not to be missed. The best is that you could visit it for free. Just go online and find a free ticket, by reserving anticipated, make sure you would be able to visit it on any first Sunday's of any month. . Plan for between 1-1.5 hours to visit. Enjoy!", "publishedDate": "2019-10-16", "language": "en", "rating": 5}, {"id": 718663910, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d295879-r718663910-Palau_Guell-Barcelona_Catalonia.html", "text": "Amazing introduction to Gaudis work.  The palace is an amazing work of art .  Definitely recommend spending an hour or so doing the tour and I would suggest first doing an overview tour of Gaudi offered by one of the free local tour companies and then doing this and other sites to supplement an understanding of Gaudis genius talent.", "publishedDate": "2019-10-15", "language": "en", "rating": 5}, {"id": 718593539, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d295879-r718593539-Palau_Guell-Barcelona_Catalonia.html", "text": "We had a free day so we visited Palau Guell but I wouldn't go out of your way to put this in your schedule. It was interesting to learn the history of the family.", "publishedDate": "2019-10-15", "language": "en", "rating": 3}, {"id": 718304198, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d295879-r718304198-Palau_Guell-Barcelona_Catalonia.html", "text": "make sure you visit this park if you have time and buy tickets in advance. The park tickets sold out very fast and they won't allow more than 400 people to visit per day. \nyou will see Gaudi's housing modern designs/color and columns.   ", "publishedDate": "2019-10-14", "language": "en", "rating": 4}, {"id": 718252316, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d295879-r718252316-Palau_Guell-Barcelona_Catalonia.html", "text": "Adding this visit to the other Gaudi designed properties gave us more perspective on Gaudi’s genius and how his designs developed over time. Thank goodness there were people willing to take a chance on him early in his career.  This is a must see if you are interested in Gaudi. ", "publishedDate": "2019-10-14", "language": "en", "rating": 5}, {"id": 718150397, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d295879-r718150397-Palau_Guell-Barcelona_Catalonia.html", "text": "Amazing building. Opulent, solid, stunning. Nextdoor neighbours rundown, precarious additions... Worth visiting - definitely more than a house!!", "publishedDate": "2019-10-13", "language": "en", "rating": 4}, {"id": 718102587, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d295879-r718102587-Palau_Guell-Barcelona_Catalonia.html", "text": "I heard from some local guides that this site is often overlooked, but worth a visit.  I found it to be the most interesting of the Gaudi houses. Gaudi did not design everything in this house, but I think that it is a must see.", "publishedDate": "2019-10-13", "language": "en", "rating": 5}, {"id": 717915504, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d295879-r717915504-Palau_Guell-Barcelona_Catalonia.html", "text": "Gaudi designed and built incredible buildings and we believe he was way before his time. Innovative ideas for getting air into and out of his building and having a safe environment for the occupants.", "publishedDate": "2019-10-13", "language": "en", "rating": 5}, {"id": 717535467, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d295879-r717535467-Palau_Guell-Barcelona_Catalonia.html", "text": "Bought tickets in advance for 8am to avoid crowds. Arrive early and find it’s free before 8 and crowded with selfish people hogging limited spots for photography with multiple selfies or just sitting and looking at their phones. The Park is undergoing significant repair but there is no information of this on their website. Hugely disappointing and therefore felt ripped off. ", "publishedDate": "2019-10-12", "language": "en", "rating": 1}, {"id": 716723400, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d295879-r716723400-Palau_Guell-Barcelona_Catalonia.html", "text": "Would recommend this place, better than Casa Batllo and half the price. Less crowded and more to see,", "publishedDate": "2019-10-09", "language": "en", "rating": 4}, {"id": 716518582, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d295879-r716518582-Palau_Guell-Barcelona_Catalonia.html", "text": "This Park which was designed and overseen by Gaudi is awesome.  The quirky little things he has added make it almost like being in a Storybook", "publishedDate": "2019-10-08", "language": "en", "rating": 5}, {"id": 716153641, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d295879-r716153641-Palau_Guell-Barcelona_Catalonia.html", "text": "Several stories but small in overall size - has a hall for concerts, a basement for the horses and carriages, a beautiful living and dining room that is all sculptured with functional and magnificent art.  It is the art itself.  You couldn't afford it when it was built but you can roam around it for a small fee.", "publishedDate": "2019-10-07", "language": "en", "rating": 5}, {"id": 715831012, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d295879-r715831012-Palau_Guell-Barcelona_Catalonia.html", "text": "If you are into architecture and/or Gaudi's work, do yourself a favor and visit Palau Guell. It is NOT the same as the famous Park Guell. The building is amazing.Very close to the Gotic neighborhood.  ", "publishedDate": "2019-10-06", "language": "en", "rating": 5}, {"id": 715612114, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d295879-r715612114-Palau_Guell-Barcelona_Catalonia.html", "text": "Don’t miss this beautiful ornate home of the Guell Family. I could live in this house, unlike the other more outlandish, however spectacular Dr. Seuss like dwellings. Don’t miss the basement stable and the decorated rooftop. The entrance dome-like  ceiling is beautiful as is the chapel and all! ", "publishedDate": "2019-10-05", "language": "en", "rating": 5}, {"id": 715291870, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d295879-r715291870-Palau_Guell-Barcelona_Catalonia.html", "text": "I feel this is an under rated attraction. If you have not prebooked Parc Guell or Casa Batillo, do not dispair. A visit to this less crowded building is a excellent if not better substitute. This early Gaudi work is incredibly detailed and still has fanciful touches. ", "publishedDate": "2019-10-04", "language": "en", "rating": 5}, {"id": 715222936, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d295879-r715222936-Palau_Guell-Barcelona_Catalonia.html", "text": "Would I go again?  Not now I have seen it.\n\nThis is a stunning building with some really interesting architectural features.  You get a great audio guide, that is very informative.   They only allow so many visitors in each day which enables you to take your time and take in all the amazing things the building as to offer.  \n\nA visits to the roof is a must, the stunning chimneys where amazing.  \n\nI would recommend booking in advance as you then secure a timed slot.  It is well worth a visit.  The only reason I wouldn't go back is that I have now seen in and I cant imagine much will change.", "publishedDate": "2019-10-04", "language": "en", "rating": 5}, {"id": 715065385, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d295879-r715065385-Palau_Guell-Barcelona_Catalonia.html", "text": "Only €9 to enter as a student (show any international student ID card) which includes a free audioguide. It is a more Gothic style house than the other Gaudi building but less expensive and no less interesting. Even better because it is less popular there is more space to take your time and explore. The upper floor has a mini museum of sorts and of course the rooftop terrace has Gaudis infamous chimneys - although you can get better city views elsewhere. To me this Gaudi house is the best value for money in the city", "publishedDate": "2019-10-03", "language": "en", "rating": 5}, {"id": 715043368, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d295879-r715043368-Palau_Guell-Barcelona_Catalonia.html", "text": "We enjoyed the Palau Guell especially after visiting the Sagrada Familia a couple of days earlier since we didn’t need to pre-book here and thus we could go when we felt like it. I also was relieved at the much more reasonable number of visitors (compared to some of his other buildings). Still a compelling architectural statement and insight into his work.", "publishedDate": "2019-10-03", "language": "en", "rating": 4}, {"id": 713600670, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d295879-r713600670-Palau_Guell-Barcelona_Catalonia.html", "text": "Lovely park with an interesting story especially if you are a fan of Gaudi. Because I was on a Gaudi quest, the candy house architecture of Park Guelle was of particular interest to me. However , it was quite crowded. We were on a guided tour, which was very informative. It made the trip more interesting to know the origins of the park. Gaudi lived in one of the houses for many years and would walk, daily, from this location to Sagrada Familia, while he oversaw the design & construction. \nIt is a lovely place to saunter if it’s not busy. ", "publishedDate": "2019-09-28", "language": "en", "rating": 4}, {"id": 713169303, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d295879-r713169303-Palau_Guell-Barcelona_Catalonia.html", "text": "It is so worthwhile to come here. 12 euros plus audioguide!  We bought the ticket online and avoided the lines.  This house is amazing in all the architectural details.  Such an artistic mixture of wood, tile, wrought iron, and stone.  You get to hear a recording of the organ playing.  When it stopped raining, they reopened the roof and terrace which we weren't expecting, but appreciated so much! Many photo opportunities! Just a half block off Las Ramblas.", "publishedDate": "2019-09-26", "language": "en", "rating": 5}, {"id": 712436845, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d295879-r712436845-Palau_Guell-Barcelona_Catalonia.html", "text": "Gaudi designed this palatial home for his friend, benefactory & patron. It is full of unique and clever design features. Of the many things to see and do in Barcelona, this is also one of the least expensive to visit...and it comes with a pre-recorded tour in a wide variety of languages.", "publishedDate": "2019-09-23", "language": "en", "rating": 5}, {"id": 711528049, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d295879-r711528049-Palau_Guell-Barcelona_Catalonia.html", "text": "Not as ornate (or expensive) as Casas Batllo and Mila, Palau Guell is definitely worth a visit. You won't find the crowds there, either, so it's easier to go through as a tourist and seems more like a home than a stunt. If you are suffering from Gaudi overload, you may feel like skipping it, but I'd advise against it. It provides a great contrast to his later projects while still displaying his ingenuity. Also, the audio tour is definitely worth it!", "publishedDate": "2019-09-20", "language": "en", "rating": 5}, {"id": 711186138, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d295879-r711186138-Palau_Guell-Barcelona_Catalonia.html", "text": "A Gaudí building that is unassuming from the outside but quite striking on the inside. \nThere are furnished rooms to see as well as unfurnished. \nThe audio guide is very useful and interesting. ", "publishedDate": "2019-09-19", "language": "en", "rating": 5}, {"id": 710580280, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d295879-r710580280-Palau_Guell-Barcelona_Catalonia.html", "text": "This house / palace is a very interesting building hidden in the centre of Barcelona. We accidentally walked by and took a guided tour. The architecture is very interesting and this visit is recommended for people interested in architecture.", "publishedDate": "2019-09-17", "language": "en", "rating": 5}, {"id": 710167353, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d295879-r710167353-Palau_Guell-Barcelona_Catalonia.html", "text": "Very impressive architecture.  Free tickets on first Sunday was a nice touch.  Close to Rambas and across street from my hotel.", "publishedDate": "2019-09-16", "language": "en", "rating": 4}, {"id": 710005732, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d295879-r710005732-Palau_Guell-Barcelona_Catalonia.html", "text": "My wife and I were staying in the neighborhood and chose to visit this Gaudi shrine. It's a remarkable work of architectural design. as one might expect from Gaudi. Alas, the people who run the place are not on Gaudi's level.\n\nYou have no problem entering this remarkable former residence of an industiral magnate, and the usual options of an audio tour are available. Then the disappointment begins.\n\nI understand that this structure was reclaimed from a run-down state, and that the renovation was aimed to be as true to the original as possible. But overall the curation was poor.\n\nAre we going to have informative plaques and signs in four languages, or three, or one? No consistency, figure out the Spanish if you can.\n\nGoing through, you walk up several flights of stairs--not too bad. Finally you get to the glorious roof, Then you walk down about seven fligths of servants' stairs to reach the exit, some of them so ill lit that they pose a fall hazard. I wish I could find fhe people in charge and say Damn You! I am a senior citizen with creaky knees and you not only don't extend a senior discount for my ticket, you make we walk painfully down stairway after stairway, the last one so dark I feared I might fall--there is an elevator but I guess it's only for lazy staffers.\n\nI'd recooounmmend a different Gaudi unless you're younger and more nimble, and for them to operate on this basis is unethical. I loved experiencing Gaudi first hand, but the fools in charge are unforgiveable.\n\nMoreover this TripAdvisor entry seems to think this is a shop, Well heir gift shop did have great merch and we bought some, but it's a \"thing to do\" TA. Get it right.\n\nToo much mediocrity here,", "publishedDate": "2019-09-15", "language": "en", "rating": 3}, {"id": 709385739, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d295879-r709385739-Palau_Guell-Barcelona_Catalonia.html", "text": "Pre-booked for the morning before our afternoon flight home. Really pleased we went - fleshed out the history of Guadi and Guell and the house is fascinating. The audio tour in English was really good - interesting musical additions too. Took about an hour overall, so well worth fitting in a visit.", "publishedDate": "2019-09-13", "language": "en", "rating": 5}, {"id": 708358038, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d295879-r708358038-Palau_Guell-Barcelona_Catalonia.html", "text": "The building is incredible and worth a visit even if you are not attending an event at the theatre. A great place to dine, shop and stroll. But if you can attend an event here, do so! The theater is fantastic.", "publishedDate": "2019-09-09", "language": "en", "rating": 5}, {"id": 708015330, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d295879-r708015330-Palau_Guell-Barcelona_Catalonia.html", "text": "Maybe it’s not located in high end neighborhood, it is not as popular as other work of Antony.\n\nBut Palau guell by no means is a boring design.\n\nTo the contrary it is one of the more spectacular with many of Gaudis signature design. From rooftop ... to chapel ... to living  room ... it was truly awe inspiring.", "publishedDate": "2019-09-08", "language": "en", "rating": 5}, {"id": 707915338, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d295879-r707915338-Palau_Guell-Barcelona_Catalonia.html", "text": "Most beautiful mosaic playground like heaven created on earth. Love the place and Gaudi is so Creative and the place is so beautiful you cannot find another place like this. Enjoy Barcelona and enjoy Gaudi art and enjoy life !! Cheers ", "publishedDate": "2019-09-08", "language": "en", "rating": 5}, {"id": 707162080, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d295879-r707162080-Palau_Guell-Barcelona_Catalonia.html", "text": "If you are coming to Barcelona to explore the work of Gaudi and the Modernista movement, this is an excellent place to start. Here is where the young genius did his early work for one of this great patrons. It's hard to believe until you see it, and you must see it.", "publishedDate": "2019-09-06", "language": "en", "rating": 5}, {"id": 707026301, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d295879-r707026301-Palau_Guell-Barcelona_Catalonia.html", "text": "Great example of Gaudi’s architectural philosophy.  So much to see.  Spare plenty of time to take in many of the elements of Gaudi’s design work.  ", "publishedDate": "2019-09-05", "language": "en", "rating": 5}, {"id": 706429350, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d295879-r706429350-Palau_Guell-Barcelona_Catalonia.html", "text": "Without hesitation I recommend a visit to the Palau Guell, a mansion house of the Eusebi Guell / Lopez family.  The family commissioned Antoni Gaudi to design this home for them and is where they lived before moving to Parc Guell.  The space, materials, details, colors, light of the Palau Guell gives a new dimension to the work of Gaudi especially because this was early in Gaudi's career. What a contrast to the light and height of Sagrada Familia.  The Palau Guell is an insight into how this wealthy family lived back in the late 1800 and how they invited music and concerts into the home. And outdoor space they could enjoy.  Of course the roof with 20 chimney caps & an impressive spire and views is a cannot miss!  The audio guide is quite good. I was charmed by the what the audio guide describes as the hallway where the children's art was displayed.", "publishedDate": "2019-09-04", "language": "en", "rating": 5}, {"id": 706217078, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d295879-r706217078-Palau_Guell-Barcelona_Catalonia.html", "text": " Being able to see the  creations  close-up  and from  many  angles   gives a  strong  feeling aboutthe  work.  Very  exciting.  ", "publishedDate": "2019-09-03", "language": "en", "rating": 4}, {"id": 705751553, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d295879-r705751553-Palau_Guell-Barcelona_Catalonia.html", "text": "We were given complimentary tickets from our hotel, Le Meridien and it was a real gem. We never would have gone if our hotel didn’t offer the tickets. It was hot( little a/c) but very informative with free audio and gaudi art on the rooftop. Lots of great information, good architecture and lots of history.", "publishedDate": "2019-09-02", "language": "en", "rating": 5}, {"id": 705380877, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d295879-r705380877-Palau_Guell-Barcelona_Catalonia.html", "text": "An interesting home that is quite different from Casa Batllo (except for the roof). Takes about 2 hours to visit. ", "publishedDate": "2019-09-01", "language": "en", "rating": 4}, {"id": 705042611, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d295879-r705042611-Palau_Guell-Barcelona_Catalonia.html", "text": "I visited Palau Guell on a free entrance day, but not sure if I would pay the full price. The rooftop is very interesting, like Casa Mila's, but the rest is not as impressive as Casa Batllo or Casa Mila. On the other hand, I can imagine that normally it is far less crowded than more famous houses.", "publishedDate": "2019-08-31", "language": "en", "rating": 3}, {"id": 704151807, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d295879-r704151807-Palau_Guell-Barcelona_Catalonia.html", "text": "Gorgeous place so beautiful.  Well worth doing a tour our guide was so informative and funny.  So much more to know about the history of it and the architect.", "publishedDate": "2019-08-28", "language": "en", "rating": 5}, {"id": 703881103, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d295879-r703881103-Palau_Guell-Barcelona_Catalonia.html", "text": "Really cool place for a visit.\n\nIf it is raining you cannot see the roof because it is dangerous (which was my case) and was still totally worth it. The insides of the house is amazing. ", "publishedDate": "2019-08-28", "language": "en", "rating": 5}, {"id": 703876274, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d295879-r703876274-Palau_Guell-Barcelona_Catalonia.html", "text": "This fantastic off the beat and path palace is a great place to spend an hour or so. Cost is 12 euros. There is a free audio guide that was easy to follow and provided interesting information on the palace. There are stairs and ramps to maneuver but I saw an elevator so it may be handicap accessible. Part of the tour takes you outside on the balcony so if it's raining beware. \n\nThe architecture and design of the palace is hard describe. It is opulent and over the top but simply gorgeous. My jaw dropped several times. A must see.\n\nThere is a mediocre gift shop. I had wanted to find a nice takeaway but it wasnt very impressive. ", "publishedDate": "2019-08-28", "language": "en", "rating": 5}, {"id": 703388279, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d295879-r703388279-Palau_Guell-Barcelona_Catalonia.html", "text": "It was one of the highlights of my Barcelona trip. I really enjoyed the visit with the audioguide. It is so classy and beautiful. My favorite Gaudì chef d'oeuvre.", "publishedDate": "2019-08-26", "language": "en", "rating": 5}, {"id": 701929511, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d295879-r701929511-Palau_Guell-Barcelona_Catalonia.html", "text": "Our visit to the Palau Guell was great. We booked our tickets for the morning, so we were some of the first people of the day. The audio guide was amazing with a lot of great details about the architecture and relationship of Gaudi and Guell.", "publishedDate": "2019-08-22", "language": "en", "rating": 5}, {"id": 701302642, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d295879-r701302642-Palau_Guell-Barcelona_Catalonia.html", "text": "It is an amazing place, and the audio is good. It gets a bit hot inside, so you might want to plan this stop early in the day. ", "publishedDate": "2019-08-20", "language": "en", "rating": 5}, {"id": 699842226, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d295879-r699842226-Palau_Guell-Barcelona_Catalonia.html", "text": "I stumble across this residence as I was wandering the streets. The exterior looks kind of cool but I wasn't sure if I wanted to pay to see the inside. I'm glad I decided to go in.  The interiors are dramatic, beautiful, intricate. The rooftop has the amazing mosaic work of Gaudí. Audio tour is included with the price of your ticket.", "publishedDate": "2019-08-16", "language": "en", "rating": 5}, {"id": 699000151, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d295879-r699000151-Palau_Guell-Barcelona_Catalonia.html", "text": "An often missed treasure in the heart of the city. Built in an area thought to be up and coming, this palace off the Rambla is definitely worth a stop from the typical cathedrals and shopping.", "publishedDate": "2019-08-14", "language": "en", "rating": 5}, {"id": 698696158, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d295879-r698696158-Palau_Guell-Barcelona_Catalonia.html", "text": "Even if you don’t know who Gaudi was ( a famous architect of the Modernista period in Bar Elena) this palace will put you in a state of wa. Gaudi was ahead of his time and even ours!  ", "publishedDate": "2019-08-13", "language": "en", "rating": 5}, {"id": 697065759, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d295879-r697065759-Palau_Guell-Barcelona_Catalonia.html", "text": "An attractive and well proportioned building, far more conventional that Gaudi's other designs. It sits in a small narrow street and is difficult to photograph, unfortunately it was closed the day we visited, check opening hours before visiting.", "publishedDate": "2019-08-08", "language": "en", "rating": 4}, {"id": 696292314, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d295879-r696292314-Palau_Guell-Barcelona_Catalonia.html", "text": "Love the visit at this park in Barcelona, it is a must see if you are visiting the city. Will need about 2 hours.", "publishedDate": "2019-08-06", "language": "en", "rating": 5}, {"id": 695243264, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d295879-r695243264-Palau_Guell-Barcelona_Catalonia.html", "text": "We toured the Palau, and it was so much more interesting than we expected! Also, it was very sparsely attended, so we could take our time and really look, listen, and learn about Gaudi's first private house. The rooftop is spectacular, as is the lovely organ in the small sanctuary. Definitely worth a stop!", "publishedDate": "2019-08-03", "language": "en", "rating": 5}, {"id": 695052863, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d295879-r695052863-Palau_Guell-Barcelona_Catalonia.html", "text": "One of a few of Gaudi's spectacular architectural masterpieces here in Barcelona.  It is like all the rest of his works, a MUST SEE.  From the ground up it is amazing.  He truly was a man before his time.", "publishedDate": "2019-08-02", "language": "en", "rating": 5}, {"id": 694482325, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d295879-r694482325-Palau_Guell-Barcelona_Catalonia.html", "text": "Had a free tickets from our hotel-Le Meridien.\nInteresting architecture.Roof was the most impressive part.", "publishedDate": "2019-07-31", "language": "en", "rating": 4}, {"id": 692069605, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d295879-r692069605-Palau_Guell-Barcelona_Catalonia.html", "text": "I hadnt heard about this one before we got to Barcelona. But very happy we went to check it out. Its just off la rambla. Very well preserved and the audio guide was very good too.", "publishedDate": "2019-07-23", "language": "en", "rating": 5}, {"id": 692059310, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d295879-r692059310-Palau_Guell-Barcelona_Catalonia.html", "text": "cheap than others gaudi buildings. first sunday of the month the ticket is free. It's not as crowded as La Pedrera or Casa Batllo.", "publishedDate": "2019-07-23", "language": "en", "rating": 5}, {"id": 691189449, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d295879-r691189449-Palau_Guell-Barcelona_Catalonia.html", "text": "What a beautiful mansion designed by a genius.  There is so much attention to detail, and the details are quirky but mesh so well. The self guided tour was a great help to understand Gaudi and his relationship with the Guell family.  As we were walking past the \"chapel\" , the organ started playing.  What a spiritual moment that was.  Unlike other Gaudi creations, this one is on a side street off of La Rambla and doesn't have a lot of visitors.  It's a special treat!", "publishedDate": "2019-07-20", "language": "en", "rating": 5}, {"id": 690853057, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d295879-r690853057-Palau_Guell-Barcelona_Catalonia.html", "text": "A must if visiting Barcelona!  Such an incredible park and to see the design of Gaudi in this setting is awesome! ", "publishedDate": "2019-07-19", "language": "en", "rating": 5}, {"id": 689551471, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d295879-r689551471-Palau_Guell-Barcelona_Catalonia.html", "text": "Pleasantly surprised by this hidden gem. A beautiful home with wonderful architecture and furnishings. Audio guide included was very informative.  Allow about an hour to get through the entire palace.", "publishedDate": "2019-07-14", "language": "en", "rating": 5}, {"id": 688241753, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d295879-r688241753-Palau_Guell-Barcelona_Catalonia.html", "text": "Another stunning work done by Gaudí. Surprising location just of la Ramba. Many well period preserved rooms. Self guided audio tour very helpful. ", "publishedDate": "2019-07-09", "language": "en", "rating": 5}, {"id": 687867954, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d295879-r687867954-Palau_Guell-Barcelona_Catalonia.html", "text": "This was a self-guided tour of a house using a headset provided by the people that managed the building. We went in mid-June and found this to be easy to handle. The tour is self-paced and you can listen to the explanations as many times as you want. This is a mansion that Gaudí designed and it has elements that you can see in his other work around Barcelona. Every detail in the house is a work of art and speaks of luxury, showing that the owner spared no expense in allowing the artist free reign to do whatever he wanted to make each space unique, yet functional.", "publishedDate": "2019-07-08", "language": "en", "rating": 5}, {"id": 687347331, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d295879-r687347331-Palau_Guell-Barcelona_Catalonia.html", "text": "We chose to explore Palau Guell since it is a more concentrated example of Gaudi's work. You get a audio guide with the price of admission and as you walk through you get a good explanation of what you're looking at. the detail of the wood work is exceptional and when you get to the roof you see the different \"chimneys\" with their colorful designs. we did go by some of Gaudi's other works and admired them from outside.\n", "publishedDate": "2019-07-06", "language": "en", "rating": 5}, {"id": 686887710, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d295879-r686887710-Palau_Guell-Barcelona_Catalonia.html", "text": "On a hot and humid July day - a visit to this wonderful artistic, inspiring oasis was like a tonic.The textures and shapes Gaudi used in this house are perhaps a little more rustic than at some of his other buildings , but i loved the contrast of the textured stone and brick to the wood , stained glass and tiles used also within the same building .It is wonderful to think of the horses being led down under the house into their curved and spiral home , with special attention (as always)to the practicalities like ventilation and light.So clever .Please go and wander around this home - surrounded by lots of other great places to visit , this area is an ideal spot.", "publishedDate": "2019-07-04", "language": "en", "rating": 5}, {"id": 686809220, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d295879-r686809220-Palau_Guell-Barcelona_Catalonia.html", "text": "Gaudi designed this house for Eusebi Guell. It has a different style compared to his other  buildings. It is luxuriant, expensive and gloomy. It is worth paying a visit to this classical mansion full of symbols.", "publishedDate": "2019-07-04", "language": "en", "rating": 5}, {"id": 686761826, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d295879-r686761826-Palau_Guell-Barcelona_Catalonia.html", "text": "We saw this place when we walked past, thought it looked interesting and as there was no queue we bought tickets there and then. We were not disappointed, a fascinating insight into the early life of Gaudi and well worth a visit.", "publishedDate": "2019-07-04", "language": "en", "rating": 4}, {"id": 686648076, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d295879-r686648076-Palau_Guell-Barcelona_Catalonia.html", "text": "I visited Güell Palace for the second time in Barcelona. This time, the price of the visit included an audio guide that was very helpful. I recommend to schedule about 1.5 hours to get a leisurely look at everything.", "publishedDate": "2019-07-04", "language": "en", "rating": 5}, {"id": 686637969, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d295879-r686637969-Palau_Guell-Barcelona_Catalonia.html", "text": "A beautiful Gaudí designed home for the Uber wealthy Guell family of Barcelona.\nThe stables and carriage house, bedrooms and terrace are pretty incredible but it was uncomfortably hot and stuffy in the residence.\nTop floor only is air conditioned and thankfully it wasn’t too busy when we visited after lunch.\nDefinitely worth a visit but needed to cut it a bit short due to the heat.", "publishedDate": "2019-07-03", "language": "en", "rating": 4}, {"id": 686509551, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d295879-r686509551-Palau_Guell-Barcelona_Catalonia.html", "text": "This palace was directly across the street from our wonderful hotel.  A must do to see Gaudi's first works.  Really interesting how he designed such a home for a large family.  The corner apartments may be better according to the travel books but this was worth the visit.  How could you miss staying across the street?", "publishedDate": "2019-07-03", "language": "en", "rating": 4}, {"id": 686375145, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d295879-r686375145-Palau_Guell-Barcelona_Catalonia.html", "text": "A lesser known and lesser crowded Gaudi work. This place was a private residence for Mr Guell and was one of early Gaudi's design. As it is less known, it is not as busy and expensive as other Gaudi's building. It is situated near La Rambla and is easily missed from the outside.\n高第早期的作品之一.這個地方是奎爾先生之前的私人住宅.由於這個地方沒有像其他高第建築那樣有名.因此也比較少人參觀.門票也比其他的建築便宜.而且參觀起來也不會那麼壅擠.是個可以讓人放鬆的地方!", "publishedDate": "2019-07-03", "language": "en", "rating": 5}, {"id": 686174929, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d295879-r686174929-Palau_Guell-Barcelona_Catalonia.html", "text": "Fabulous house on street just off the Rambla. You'd never guess from looking at it from the exterior that it is an amazing place inside.\nWell worth a detour. Great audio description, easy to follow whilst traveling through each too.\nA Must", "publishedDate": "2019-07-02", "language": "en", "rating": 5}, {"id": 686140718, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d295879-r686140718-Palau_Guell-Barcelona_Catalonia.html", "text": "We took a tour with Get Your Guide.  We have noticed that with Get Your Guide they are not gret about organization or the meeting points.  However, our guide was Sylvia and she was very knowledgeable.  ", "publishedDate": "2019-07-02", "language": "en", "rating": 5}, {"id": 686106801, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d295879-r686106801-Palau_Guell-Barcelona_Catalonia.html", "text": "If you like architecture, Gaudi, or even just enjoy a beautiful home, then you won't be disappointed. \n\nThe Palau Guell is simply beautiful, both inside and outside, with some clever innovations at the time for optimising the whole building and making it a wonderful home. \n\nI missed it my first time around, and I'm really glad I got to see it this time, it was very much worth the visit. Make sure to get your audio guide and to go all the way to the ceiling.", "publishedDate": "2019-07-02", "language": "en", "rating": 5}, {"id": 686017298, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d295879-r686017298-Palau_Guell-Barcelona_Catalonia.html", "text": "As most of other reviews put it, this is one of Gaudi’s most spectacular works. It’s true the building doesn’t look much from the outside - but the insides will let you appreciate the true masterpieces of Gaudi’s early works.", "publishedDate": "2019-07-02", "language": "en", "rating": 5}, {"id": 685915078, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d295879-r685915078-Palau_Guell-Barcelona_Catalonia.html", "text": "Avoid the crush at La Pedrera. This first major interior design work by Anton Gaudi is more digestible.  Hats off to cement monopolist Guell, who appreciated art (unlike his industrialist dad) and funded Gaudi before he became \"Gaudi\".  Ironwork creativity, outstanding.  Imagine 10 Guell cnildren living here, hmmm.\n\nWe stayed across the street in Hotel Gaudi and awakened each morning to the rooftop amazement.  Is that green ooze a stack of Catalan olives? ... an interesting mushroom? ... a 3am upchuck out of a dark Gaudi dream?  A wonderful & memorable start bah Barcelona day.\n\nHighly recommend in strongest sense of appreciation", "publishedDate": "2019-07-02", "language": "en", "rating": 5}, {"id": 685422087, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d295879-r685422087-Palau_Guell-Barcelona_Catalonia.html", "text": "I was pleasantly surprised by this building. I felt that after the Sagrada Familia and the Parc Guell, this was the most interesting Gaudi work I've seen. ", "publishedDate": "2019-06-30", "language": "en", "rating": 5}, {"id": 685263619, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d295879-r685263619-Palau_Guell-Barcelona_Catalonia.html", "text": "We were two families from Texas spending 2 weeks on a European vacation, visiting London, Paris and Barcelona European 14 Day trip from Texas. We had spent months planning this trip, to get the best bang for our bucks and see as many sites as possible. This was the last of the 4 Gaudi building we had visited and were not disappointed . Gaudi build this for the Guell family and it had so many architectural marvels that blew us away. Great audio tour that you do  at  you own pace.", "publishedDate": "2019-06-29", "language": "en", "rating": 5}, {"id": 685015973, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d295879-r685015973-Palau_Guell-Barcelona_Catalonia.html", "text": "This mansion is a must seen for all visitors not just for the Gaudi enthusiasts. The visit comes with a free audioguide (several languages available) and covers most of the palau's many areas. The self-guided tour has a duration of about 1 hour. The building seems severe but that makes his charm. Many inventive features imagined by Gaudi fill the mansion. The well-known rooftop chimnees top it off and the end.\n\nNot as many people visits this palau which makes the visit pleasant and it is just a few meters from the Rambla, down in the old Barcelona. Must see!", "publishedDate": "2019-06-28", "language": "en", "rating": 5}, {"id": 684808459, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d295879-r684808459-Palau_Guell-Barcelona_Catalonia.html", "text": "Stroll at your own leisure through this beautiful park. Take  a seat and relax on beautiful mosaic benches. Marvel at the creations of Gaudi and his genius with light. A definite must see when in Barcelona.", "publishedDate": "2019-06-27", "language": "en", "rating": 5}, {"id": 684301779, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d295879-r684301779-Palau_Guell-Barcelona_Catalonia.html", "text": "This may have been Gaudi’s first large construction project, but he did an incredible job. We arrived early and found a short lineup. We bought tickets at the reduced price with our passports because we are seniors. There is a separate line for ticket holders but it was also very short early in the morning.\n\nA free audio guide is included with your ticket and it is a great guide. There are about 25 numbered locations throughout the several floors of the house. The guide includes a screen so that you can see photographs of the location you are standing in as well as background photographs. At several points in the audio guide, there are wonderful pieces of music which were composed by Mrs. Güell. \n\nAs others have noted, the rooftop is one of the highlights and a great place to take pictures of yourself and the surrounding area. Note that this house is off on a side street but still easy to fine using your GPS or maps.\n\nUsing your audio guide, you can go down into the basement which is the former location of the horse stalls. You also climb up to different floors. At one point, you enter a room where your audio guide is synchronized with the movie that is being shown on a continuous loop in that room. There is also another location which has a short film about the relationship between Gaudi and Güell but it is in Spanish.\n\nIf you like this review or the photos, please give me a thumbs up. You may also like to check my reviews of other tourist sites in Barcelona, and other Spanish cities, as well as Lisbon, Sintra, Porto, and cities in Australia and New Zealand, Southeast Asia and South America.", "publishedDate": "2019-06-25", "language": "en", "rating": 5}, {"id": 683455077, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d295879-r683455077-Palau_Guell-Barcelona_Catalonia.html", "text": "Heard the classical guitars and saw amazing flamenco dancing. The UNESCO Palau is well worth the visit.", "publishedDate": "2019-06-22", "language": "en", "rating": 5}, {"id": 682656964, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d295879-r682656964-Palau_Guell-Barcelona_Catalonia.html", "text": "Good spot to visit but be aware of the tour groups. Preferable to be visited off-season.Take time to enjoy the little details.", "publishedDate": "2019-06-19", "language": "en", "rating": 4}, {"id": 682544208, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d295879-r682544208-Palau_Guell-Barcelona_Catalonia.html", "text": "Another building by Gaudy that doesn't disappoint. Charming and architectonically surprising and very interesting. Quick but very informative place.", "publishedDate": "2019-06-18", "language": "en", "rating": 5}, {"id": 682525041, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d295879-r682525041-Palau_Guell-Barcelona_Catalonia.html", "text": "I found it is a less popular or better say crowded Gaudí house and it is worth to see as it has beautiful details. We arrived early and site purchased the tickets so haven't waited too long. They give free audio guides and provide a locking room if you have luggage which is great. The building is impressive, especially the chimneys ", "publishedDate": "2019-06-18", "language": "en", "rating": 5}, {"id": 681513779, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d295879-r681513779-Palau_Guell-Barcelona_Catalonia.html", "text": "Sometimes you get lucky when you are travelling and we were given free tickets to enter this Gaudi masterpiece.  Maybe it was because we are over 65 or maybe because it was a public holiday, I don't know but it was a fabulous treat. The continuity of style throughout the building where Gaudi had worked on his parabolas made the house a delight.  Even the fireplaces had the same shape and the furnishings also designed by Gaudi completed the picture.  Well worth a visit especially if you can get in for free!", "publishedDate": "2019-06-14", "language": "en", "rating": 5}, {"id": 680823866, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d295879-r680823866-Palau_Guell-Barcelona_Catalonia.html", "text": "This tour offers an audio guide which is fantastic.  This property is truly a masterpiece and a thoroughly enjoyable experience. It takes about an hour or so to get through the house with the guide. One room is more magnificent than the next", "publishedDate": "2019-06-11", "language": "en", "rating": 5}, {"id": 680581594, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d295879-r680581594-Palau_Guell-Barcelona_Catalonia.html", "text": "Anything by Gaudi is worth visiting, he was a master of his craft and a visionary. Not only did he design beautiful buildings be he had to invent new methods of building to make them work. This park is no exception and is a must see.\nVisit his appointment and se how simply this master craftsman lived. It is doout if keeping with the grandeur of his designs.", "publishedDate": "2019-06-10", "language": "en", "rating": 5}, {"id": 680032469, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d295879-r680032469-Palau_Guell-Barcelona_Catalonia.html", "text": "This palace was the residence of Guell Family and was the first or one of the first works of Gaudi. Every corner of the house has an amazing detail! It is very easy to go there since it is in the Ramblas", "publishedDate": "2019-06-08", "language": "en", "rating": 5}, {"id": 679792587, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d295879-r679792587-Palau_Guell-Barcelona_Catalonia.html", "text": "It's not apparent from the street, but this Gaudi-designed house, well ok, palace, built for wealthy industrialist Guell is a spacious, over-the-top structure inside. The detailed features and rooms were amazing, and the rooftop gives a small taste of what Gaudi did with La Pedrera. It's worth a visit even if you've seen La Pedrera.", "publishedDate": "2019-06-07", "language": "en", "rating": 4}, {"id": 679249361, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d295879-r679249361-Palau_Guell-Barcelona_Catalonia.html", "text": "We opted to attend a concert in the theater. The classical concert was wonderful with the audience giving the performers several standing ovations. The real star, however, is the hall, which is breathtaking. Tickets are very reasonably priced compared with other cities and the concert itself was a real pleasure. ", "publishedDate": "2019-06-05", "language": "en", "rating": 5}, {"id": 678958652, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d295879-r678958652-Palau_Guell-Barcelona_Catalonia.html", "text": "Words cannot adequately describe the incredible beauty of this Gaudi house. Every room and every surface is thought out and detailed with an amazing use of materials and intense beauty; the wrought iron, the floors, the ceilings ...just everything all the way up to the roof where you are greeted by Gaudi's usual chimneys. Don't miss the lower lever - it was designed and sued for horses back in the day and even here the brick/stone details are inspiring", "publishedDate": "2019-06-04", "language": "en", "rating": 5}, {"id": 678918154, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d295879-r678918154-Palau_Guell-Barcelona_Catalonia.html", "text": "This place near to Las Ramblas was relatively quiet - meaning you can take time to enjoy the complex architecture and take loads of photos. You get to explore from the basement to the roof. Guell was one of Gaudi's greatest supporters - and the architecture in this building is amazing.", "publishedDate": "2019-06-04", "language": "en", "rating": 5}, {"id": 678373102, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d295879-r678373102-Palau_Guell-Barcelona_Catalonia.html", "text": "Please don’t miss this extraordinary home that introduces you to the genius of Gaudi. Be in the moment and absorb the visual artistry of a man who introduced his clients and thereby the world with his incredible insight and translation in architecture and art. ", "publishedDate": "2019-06-02", "language": "en", "rating": 5}, {"id": 677892037, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d295879-r677892037-Palau_Guell-Barcelona_Catalonia.html", "text": "Strangely we didn't come across this as a must see in our guide book but happened upon it late in the afternoon when strolling down Las Ramblas and just walked in and bought tickets.  No queues and no guided groups.  It was Gaudi's first commission for the industrialist visionary Guell.  Upon completion Gaudi told him he didnt want to become known as Guell's architect.  But Guell encouraged him to think bigger and together they went on to produce stunning  masterpieces.  Their relationship is captured in a beautiful little film that we watched on the upstairs floor. The audio guide included in the price brings all the finer details of this palace to light.  Spending time outside on the roof amidst the colourful array of chimneys in the early evening light was sheer magic.  As was the sound of organ music played on the hour.", "publishedDate": "2019-05-31", "language": "en", "rating": 5}, {"id": 677655195, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d295879-r677655195-Palau_Guell-Barcelona_Catalonia.html", "text": "We design furniture, mostly Art Deco style and then to find Gaudi over these past years and to visit his works. Wonderful legacy and frankly - not to be repeated structural designs. his use of light and openings as well as massing and structure is beyond most of us. All thanks to Gaudi and the City of Barcelona for preserving his and other architectural works.", "publishedDate": "2019-05-30", "language": "en", "rating": 5}, {"id": 677638796, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d295879-r677638796-Palau_Guell-Barcelona_Catalonia.html", "text": "Gaudi's town house for entertaining. Interesting, especially the central light well and rooftop, and we went at 7pm (closes at 8pm) so very few people. (I would imagine it would be quite difficult to work your way around if very busy). Worth the trip", "publishedDate": "2019-05-30", "language": "en", "rating": 3}, {"id": 677546866, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d295879-r677546866-Palau_Guell-Barcelona_Catalonia.html", "text": "This was my favourite of the main Gaudi houses. It’s not as busy and so had room to move around. The audio guide was very good. ", "publishedDate": "2019-05-30", "language": "en", "rating": 5}, {"id": 677441053, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d295879-r677441053-Palau_Guell-Barcelona_Catalonia.html", "text": "This building is one of Gaudi's first commissions - and while it is interesting in itself, it really needs to be paired with Casa Battlo to see where his ideas developed to over time.", "publishedDate": "2019-05-29", "language": "en", "rating": 4}, {"id": 677379314, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d295879-r677379314-Palau_Guell-Barcelona_Catalonia.html", "text": "Astonishing inside, a little \"heavier\" in style than the rest of Gaudí' s works. But more suitable for a palace. Buy your souvenirs here, than the rest of the shops in Gaudí's buildings; better prices. I visited on rainy day, so the rooftop was closed.", "publishedDate": "2019-05-29", "language": "en", "rating": 4}, {"id": 676869852, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d295879-r676869852-Palau_Guell-Barcelona_Catalonia.html", "text": "I've included details on my Park Guell review. Buy tickets online in advance and if possible time for beginning or end of day.", "publishedDate": "2019-05-27", "language": "en", "rating": 5}, {"id": 676644599, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d295879-r676644599-Palau_Guell-Barcelona_Catalonia.html", "text": "So glad we stopped her, totally unplanned. Add this to your must-sees. So interesting and well done. Free electronic guide which is educational and easy to understand. Beautiful art and gives you further insight to the genius Gaudi. Warning:  lots and lots of steps.", "publishedDate": "2019-05-26", "language": "en", "rating": 5}, {"id": 676590719, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d295879-r676590719-Palau_Guell-Barcelona_Catalonia.html", "text": "We went round on a Wednesday morning with a self guided audio tour. Absolutely stunning!! I love Gaudi anyway; but this is the icing on the cake. Not his best known; but a must see.", "publishedDate": "2019-05-26", "language": "en", "rating": 5}, {"id": 676424756, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d295879-r676424756-Palau_Guell-Barcelona_Catalonia.html", "text": "Mr. Guell was rich beyond compare and his house designed by Gaudi is as stunning as you would expect for a man whose net worth in 1895 was the equivalent of 70 billion (yes, billion) euros in today's currency. Simply gorgeous. If you are a fan of fantastic architecture and design, do not miss this building.  ", "publishedDate": "2019-05-25", "language": "en", "rating": 5}, {"id": 676304873, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d295879-r676304873-Palau_Guell-Barcelona_Catalonia.html", "text": "This is one of Gaudi's early architectural works and we were impressed with his innovative designs and attention to detail. No expense was spared in the building of this and it shows. It is less, shall we say outrageous, than later works, so has good appeal to most. ", "publishedDate": "2019-05-25", "language": "en", "rating": 5}, {"id": 675841285, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d295879-r675841285-Palau_Guell-Barcelona_Catalonia.html", "text": "Inspired and amazed. Palau Guell is the epitome of Art in function. The architecture is breathtaking and the designs of Antoni Gaudi are ahead of their time. A must see if you’re in the Gothic Quarter of Barcelona.", "publishedDate": "2019-05-23", "language": "en", "rating": 5}, {"id": 675707835, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d295879-r675707835-Palau_Guell-Barcelona_Catalonia.html", "text": "This was the Guell family house and it does have some unique Gaudi features. Only 9 euros for ticket and audio guide which was nice as you didn’t have to book in advance and it was not crowded even in peak tourist season.", "publishedDate": "2019-05-22", "language": "en", "rating": 4}, {"id": 675591671, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d295879-r675591671-Palau_Guell-Barcelona_Catalonia.html", "text": "Our hotel faced here and had great views from our rooftop terrace.  The facade of the palace is amazing. ", "publishedDate": "2019-05-21", "language": "en", "rating": 4}, {"id": 675580680, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d295879-r675580680-Palau_Guell-Barcelona_Catalonia.html", "text": "My husband and I visited this early work of Gaudi on 7/19/2018.  Cost was 18€/$21.02 for the 2 of us-discounted rate. Included audio guide which is available in several languages.   Located in the El Raval neighborhood.  Just off La Rambla.  We spent around 2 hours here.\n\nGaudi designed this mansion from 1886-1890.  Darker and more Neo-Gothic than Gaudi's famous later works.  6 story building.  Rich decorations in wrought iron, pottery, glass, stone, and wood.  One of the 7 pieces UNESCO World Heritage Site-Works of Antoni Gaudi.  Large enough for Eusebi Guell, his wife, and their 10 children.  Guell was Gaudi's patron.  Guell was a wealthy industrialist.  \n\nHome centered around a main room for entertaining Guell's guests.  They would have entered the home by way of horse drawn carriages through the front iron gates.   The horses and other animals were taken down a ramp to the livery stable in the basement.  Grand staircase lined with sandstone columns.  The main party room has a high ceiling with small holes near the top.  Lanterns could be hung at night here.  Kitchen, washrooms, and house staff were in the attic.  The roof has tiled mosaics and colorful quirky chimney pots.", "publishedDate": "2019-05-21", "language": "en", "rating": 5}, {"id": 675511584, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d295879-r675511584-Palau_Guell-Barcelona_Catalonia.html", "text": "This home, designed by Gaudi for the Guell family was fabulous! We used the free audio tour and saw all of the home. This is one property where you get to see most of the building. I especially enjoyed hearing the pipe organ play. The genius of Gaudi is on full display in the mansion.", "publishedDate": "2019-05-21", "language": "en", "rating": 5}, {"id": 675491159, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d295879-r675491159-Palau_Guell-Barcelona_Catalonia.html", "text": "A nice place to visit right in the center of las Ramblas. \nNo big queue at the enterence which I loved", "publishedDate": "2019-05-21", "language": "en", "rating": 5}, {"id": 675349478, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d295879-r675349478-Palau_Guell-Barcelona_Catalonia.html", "text": "An excellent example of Gaudí architecture, Spanish Art Nouveau. There is the rooftop terrace overlooking the city. The interior is amazing, the tour guides explains everything in small details, difficult to describe in words, a must see to understand Gaudí world. \nFYI every Friday at 8pm they offer a light and sound show in the atrium, so if in Barcelona on a Friday evening take a tour to see this amazing building. ", "publishedDate": "2019-05-20", "language": "en", "rating": 5}, {"id": 674602653, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d295879-r674602653-Palau_Guell-Barcelona_Catalonia.html", "text": "What a beautiful, over-the-top experience this was! All tours are artfully guided throughout the Art Nouveau music space. If you are in Barcelona this is a MUST SEE for an overall perspective of the Nouveau movement It is really indescribable - everywhere you look is spectacular lighting, mosaics, sculpture, stained glass, and many other artful aspects. Seeing a concert there would be a never-forgotten experience but you must purchase tickets in advance to see a performance. I just wish i had done so!", "publishedDate": "2019-05-17", "language": "en", "rating": 5}, {"id": 674443468, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d295879-r674443468-Palau_Guell-Barcelona_Catalonia.html", "text": "This palace designed by the young Gaudí is absolutely breathtaking.  You don’t need a guided tour pay 12euro and you get a free audio guide which explains everything. \nYou can take pictures and spend as long as you like going round.  Highly recommended. ", "publishedDate": "2019-05-16", "language": "en", "rating": 5}, {"id": 674055071, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d295879-r674055071-Palau_Guell-Barcelona_Catalonia.html", "text": "Very interesting house built in early 1900’s.  House had chapel with organ with beautifully carved staircase and lots of marble. Be certain to visit roof and basement. ", "publishedDate": "2019-05-14", "language": "en", "rating": 5}, {"id": 673506893, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d295879-r673506893-Palau_Guell-Barcelona_Catalonia.html", "text": "We’ve been lucky not to find any people queuing in front of the palace. So even if we weren’t supposed to enter... we actually bought the ticket and go for the visit. \nStrongly recommended. \nA very interesting palace. It takes not more than an hour and it’s very different from Casa Batlo. Very nice visit. ", "publishedDate": "2019-05-12", "language": "en", "rating": 4}, {"id": 672932550, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d295879-r672932550-Palau_Guell-Barcelona_Catalonia.html", "text": "Have visited all Gaudi buildings as am a massive fan and was really interesting to see this house which was a very early work and more of a renovation that’s other projects.\nIt certainly has the wow factor and an interesting history which you learn about as you move through the different levels. \nA particular highlight was the playing of the organ whilst we were in the grand hall, just amazing and gave me goosebumps. Think we dropped lucky, we were there at 12.00 so not sure if this is a daily occurrence but worth bearing in mind. \n\nEasy to book online for a timed entry, no need to,print out the ticket if you have it on your phone and you just turn up 10 minutes before your chosen time. \nIt was all very relaxing and the audio guide is really informative.\nWell worth the 12€ entry fee and you can spend a good chunk of time exploring. \nAnother one ticked off my list! \n", "publishedDate": "2019-05-09", "language": "en", "rating": 5}, {"id": 672875961, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d295879-r672875961-Palau_Guell-Barcelona_Catalonia.html", "text": "At first, looking from the outside, I was considering passing on the visit.  What a mistake that would have been!\nThe creativity of design and workmanship in this building is beyond imagination (and $ budget!).\nAs we ventured through, with an electronic device explaining what we saw in the language of our choice, we were amazed time and time again.\nThe numbering process to identify the area being visited, which corresponded to the electronic device, were not always easily located.  However, for the rest, a marvel at what was accomplished over 100 years ago!", "publishedDate": "2019-05-09", "language": "en", "rating": 4}, {"id": 672874422, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d295879-r672874422-Palau_Guell-Barcelona_Catalonia.html", "text": "You'll spend at least 30 minutes touring the house.   You must buy tickets in advance so plan to purchase then return.  It's worth touring especially if you are on La Rambla.", "publishedDate": "2019-05-09", "language": "en", "rating": 4}, {"id": 672746320, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d295879-r672746320-Palau_Guell-Barcelona_Catalonia.html", "text": "It’s very close to the subway station, just 5 min walk, if you are wandering in the city, don’t miss this. Inside, you can find the those antique", "publishedDate": "2019-05-09", "language": "en", "rating": 4}, {"id": 672176187, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d295879-r672176187-Palau_Guell-Barcelona_Catalonia.html", "text": "Very important building by Gaudi.  the design and the architectural feature are a must see, from the basement to the rooftop. ", "publishedDate": "2019-05-07", "language": "en", "rating": 5}, {"id": 672099647, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d295879-r672099647-Palau_Guell-Barcelona_Catalonia.html", "text": "This is an aboslute GEM, not far from La Rambla.\nWent there on a whim, but utterly enjoyed it.\n\nIt's a fantastic place, especially the central chamber/room and the roof ofcourse.\n\nRecommended", "publishedDate": "2019-05-07", "language": "en", "rating": 5}, {"id": 672087734, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d295879-r672087734-Palau_Guell-Barcelona_Catalonia.html", "text": "After seeing many of Gaudi’s amazing works, I’d say, Start Here. \n\nAs one of Gaudi’s early projects, this shows his early thinking – that you’ll see more fully developed and refined in Casa Battló, Vasa Milo and Sagrada Familia. ", "publishedDate": "2019-05-07", "language": "en", "rating": 5}, {"id": 671985364, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d295879-r671985364-Palau_Guell-Barcelona_Catalonia.html", "text": "After visiting Casa Mila (La Pedrera) and La Sagrado, this was not my favorite and could be passed if you done the other two which are more interesting and not so far out.  However, it has a good view of Barcelona once you get on the roof park but everything else is very Gauldi.  If you can't get into the other two than you should visit Park Guell.  If you love nature, you would love this too, a lot of open space.  I was there on April 28th and there is construction going on and seem to be for a little more so bare that in mind when you are deciding which to visit.\n\nI was told that you can get into the park free prior to 8 am and after 8 pm.  True enough, I got tickets for 7:30 pm and shortly after that, all the gate people start cleaning up and closing down. Just an FYI", "publishedDate": "2019-05-06", "language": "en", "rating": 3}, {"id": 671705424, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d295879-r671705424-Palau_Guell-Barcelona_Catalonia.html", "text": "This was my second favorite Gaudi attraction, after Sagrada Familia. Get a timed ticket. The roof is fantastic and the relationship between Guell and Gaudi is fascinating and described very well. ", "publishedDate": "2019-05-05", "language": "en", "rating": 5}, {"id": 671597042, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d295879-r671597042-Palau_Guell-Barcelona_Catalonia.html", "text": "One of works of Gaudi. This is the reinterpretation of the Venetian palace. Very interesting entrance with metal decorations.", "publishedDate": "2019-05-05", "language": "en", "rating": 4}, {"id": 671343803, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d295879-r671343803-Palau_Guell-Barcelona_Catalonia.html", "text": "An interesting experience. Excellent audio guide available. The climb to the rooftop is well worth the effort.", "publishedDate": "2019-05-04", "language": "en", "rating": 5}, {"id": 670709459, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d295879-r670709459-Palau_Guell-Barcelona_Catalonia.html", "text": "We decided to visit after not being able to secure tickets for Parc Guell.\n\nAs we went to buy the tickets we were told that it was free entry that day (23rd of April) and that out time was 6pm.\n\nWe arrived slightly early as instructed.  When we entered we were given a free audio guide and started out tour.  \n\nThe audio guide was great and very informative.  The follow of the house made walking around with the audio guide very easy.\n\nWe were even treated to someone playing the organ and the music reverberated around the house and enhanced our experience.\n\nI wont ruin the experience by writing too much more as you really feel the house as you walk around.\n\nThe roof top was a great finish to a great tour.", "publishedDate": "2019-05-01", "language": "en", "rating": 5}, {"id": 670265216, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d295879-r670265216-Palau_Guell-Barcelona_Catalonia.html", "text": "Palau Guell is one of Gaudi’s best pieces of architecture, right in the heart of the city. Magnificent on every one of the 5-6 levels including the rooftop. The dome is unexpected and so many other features of a beautiful palace. Recommend this as highly as is possible. Don’t miss it!!", "publishedDate": "2019-04-29", "language": "en", "rating": 5}, {"id": 670053979, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d295879-r670053979-Palau_Guell-Barcelona_Catalonia.html", "text": "Barcelona is a  great place to visit. its history and wonderful guides add much to bringing this great place alive.definitely to be recommended.", "publishedDate": "2019-04-28", "language": "en", "rating": 5}, {"id": 669976841, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d295879-r669976841-Palau_Guell-Barcelona_Catalonia.html", "text": "If you like Gaudi's architecture, it is unfair to miss this gem. It's less crowded than Pedrera for example, hence can be more enjoyable. Lots of details worth to be discovered with the included audio guide. It definitely deserves a visit also for the roof terrace.", "publishedDate": "2019-04-28", "language": "en", "rating": 5}, {"id": 669649176, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d295879-r669649176-Palau_Guell-Barcelona_Catalonia.html", "text": "We booked tickets online the day before which worked out cheaper and made it easier when arriving. Amazing example of Gaudi’s work and we were able to explore each room. It’s definitely worth using the audio tour which explains each room clearly on the way around. It took us about 2 hours walking around as we took our time but it’s not something you want to rush. The building seems hidden just off the Las Ramblas but it’s one of the best Gaudi buildings that we visited whilst in Barcelona. ", "publishedDate": "2019-04-27", "language": "en", "rating": 5}, {"id": 669460855, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d295879-r669460855-Palau_Guell-Barcelona_Catalonia.html", "text": "Get tickets in advance, specially in summer when so many tourists want to get in.  The architecture, details in decoration....all so Guadi.  The first palace he designed and constructed for the Guell Family.  It's near the Ramblas and the Royal Plaza.", "publishedDate": "2019-04-26", "language": "en", "rating": 5}, {"id": 669116413, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d295879-r669116413-Palau_Guell-Barcelona_Catalonia.html", "text": "This is not the tipical house of Gaudi, it is in the area of raval. Very good palace. But there is plenty of people and the qeuee is large", "publishedDate": "2019-04-25", "language": "en", "rating": 5}, {"id": 668942939, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d295879-r668942939-Palau_Guell-Barcelona_Catalonia.html", "text": "I feel this is slightly underrated!\n\nThis was one of my favourite places to see - it was beautifully done and has a lot to see!\n\nWasn’t too crowded, so you walk around with the audio guide at your own pace, whilst learning the history.\n\nWorth a visit if you are in Barcelona! ", "publishedDate": "2019-04-24", "language": "en", "rating": 5}, {"id": 668758135, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d295879-r668758135-Palau_Guell-Barcelona_Catalonia.html", "text": "We had the great fortune to get tickets free through our hotel. What a beautiful example of Gaudi’s genius. We really loved learning about him through his art. ", "publishedDate": "2019-04-23", "language": "en", "rating": 5}, {"id": 668328499, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d295879-r668328499-Palau_Guell-Barcelona_Catalonia.html", "text": "The 7 UNESCO Heritage Sites By Gaudi\n1). Sagrada Familia  2). Casa Mila – La Pedrera  3). Parc Guell 4). Guell Palace  \n5). Casa Batllo  6). Casa Vicens 7). The Crypt of the Colonia Guell\n#1, #2, #3, all have extremely long lines. The tickets to #1 are over 7 days in advance. \n\nIt's absolutely beautiful. The wood work, the wrought iron workmanship is unbelievable. The pillars design in the old Stables under the Palace and the way the stalls worked with them. The stain glass, wrought iron workmanship and shutter system to control light and circulation. It's definitely is correct to be under the World Heritage Sites. It's a must see if your in Barcelona.", "publishedDate": "2019-04-22", "language": "en", "rating": 5}, {"id": 667453334, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d295879-r667453334-Palau_Guell-Barcelona_Catalonia.html", "text": "This multi-story residence built for Gaudi's patron and friend Eusebio Guell, was my favorite. From the stables on the lower level (with their graceful brick arches and clever design) to the dramatic chapel and the family's living quarters, we were impressed by the no-expense-was-spared use of first-rate materials, innovative design, and just plain beauty of the place. ", "publishedDate": "2019-04-18", "language": "en", "rating": 5}, {"id": 667379926, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d295879-r667379926-Palau_Guell-Barcelona_Catalonia.html", "text": "This gaudi building has less queues and is cheaper (5 euros for up to 17 year old) than casa batila and casa mila. It's in the centre of town and well worth a visit. We're so glad we went.", "publishedDate": "2019-04-18", "language": "en", "rating": 5}, {"id": 667012013, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d295879-r667012013-Palau_Guell-Barcelona_Catalonia.html", "text": "This is a fascinating way to spend a couple of hours in the heart of the city.  I learned a lot about both Gaudi's design, but also about the relationship between Gaudi and his primary benefactor, Guell.", "publishedDate": "2019-04-16", "language": "en", "rating": 4}, {"id": 666386275, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d295879-r666386275-Palau_Guell-Barcelona_Catalonia.html", "text": "If you have to choose to visit only one of Gaudi’s works, make it Palau Güell. It’s an amazing tour of the entire house, with very detailed audio guide included into the ticket price. Rooms, terraces, roof, and even stables are open to see, very beautifully restored and renovated. According to the guide, it is the only example of domestic architecture that Gaudi completed and has not undergone significant alterations. To walk around and listen to entire audio guide it takes from one to one and half hours. ", "publishedDate": "2019-04-14", "language": "en", "rating": 5}, {"id": 666383624, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d295879-r666383624-Palau_Guell-Barcelona_Catalonia.html", "text": "Fascinating place, not just as a display of Gaudi's infinite artistry but as an illustration of how Barcelona's economic elite lived. It's more comprehensive than Casa Battlo -- and the entry fee is half the price!", "publishedDate": "2019-04-14", "language": "en", "rating": 5}, {"id": 666296704, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d295879-r666296704-Palau_Guell-Barcelona_Catalonia.html", "text": "Far from city centre and you need really enough energy to go around this park. Very nice place to buy souvenir from pavement stalls. ", "publishedDate": "2019-04-14", "language": "en", "rating": 5}, {"id": 666147230, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d295879-r666147230-Palau_Guell-Barcelona_Catalonia.html", "text": "Pictures do not do justice to this Gaudi gem. Stunning detail and beauty. Gaudi was a genius- do not miss this tour", "publishedDate": "2019-04-13", "language": "en", "rating": 5}, {"id": 666084016, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d295879-r666084016-Palau_Guell-Barcelona_Catalonia.html", "text": "We lived in an apartment for two weeks next door to Palau Guell and just before leaving Barcelona decided to take a look.\nVery thankful we did to take in the beautiful treasures found inside and up on the roof.", "publishedDate": "2019-04-13", "language": "en", "rating": 5}, {"id": 666050560, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d295879-r666050560-Palau_Guell-Barcelona_Catalonia.html", "text": "Very close to Las Ramblas, but yet not fully discovered by the tourists.  Well worth the visit.  Once again Gaudi is extraordinary!", "publishedDate": "2019-04-13", "language": "en", "rating": 5}, {"id": 665443119, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d295879-r665443119-Palau_Guell-Barcelona_Catalonia.html", "text": "Very interesting visit of this beautiful and original 'Palau Guell'. I however had a hard time with the bad quality of the audio guide, the staff should definitely do something about this.", "publishedDate": "2019-04-11", "language": "en", "rating": 4}, {"id": 664265815, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d295879-r664265815-Palau_Guell-Barcelona_Catalonia.html", "text": "Well worth a visit as well as the recently opened Casa Vincens. Both exude originality and are Gaudi icons.", "publishedDate": "2019-04-06", "language": "en", "rating": 5}]}}]