[{"locationId": 9570798, "name": "Fundacio Gaspar", "placeType": "ATTRACTION", "reviewListPage": {"reviews": [{"id": 494459793, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d9570798-r494459793-Fundacio_Gaspar-Barcelona_Catalonia.html", "text": "Paul McCarthy show was fantastic. So refreshing to view contemporary art like these paintings and drawing, as well as the exhibitions before this one at Fundacio Gaspar. Quality of choice of  equals what is next door at Picasso Museo. Defo won't miss any exhibition here in the future.", "publishedDate": "2017-06-20", "language": "en", "rating": 5}, {"id": 413076990, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d9570798-r413076990-Fundacio_Gaspar-Barcelona_Catalonia.html", "text": "I popped in at the cafe after lunch for q coffee and to read for a bit. I got a cafe con leche (and followed it up with another one). The staff were very nice, and the atmosphere is so calm and relaxing. A beautiful decor, modern and comfortable. Highly recommended, even if you don't visit the museum. I didn't eat anything, but the small sandwiches and pastries looked amazing, and they have some other menu offerings as well. ", "publishedDate": "2016-08-31", "language": "en", "rating": 5}, {"id": 373235711, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d9570798-r373235711-Fundacio_Gaspar-Barcelona_Catalonia.html", "text": "A charming cafe by the Picasso museum and we called in. Lovely welcoming staff and delicious coffee and cake.  Very helpful staff who directed us to the beach.  The cafe also serves savoury snacks etc but go for the cake!!!!", "publishedDate": "2016-05-15", "language": "en", "rating": 4}, {"id": 369229256, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d9570798-r369229256-Fundacio_Gaspar-Barcelona_Catalonia.html", "text": "We didn't go into the museum but am writing a review about the really amazing coffee shop downstairs. \n\nThey serve fantastic coffee that is to die for! The seating areas are very arty, comfortable and beautiful. \n\nThe coffee shop also serves great sandwiches and pastries.", "publishedDate": "2016-05-01", "language": "en", "rating": 5}, {"id": 339588966, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d9570798-r339588966-Fundacio_Gaspar-Barcelona_Catalonia.html", "text": "This brand new Art Museum has a great selection of modern art from known artists. It's a beautiful space set in an old 15th century palace in the Born area of Barcelona. A must visit on any trip!", "publishedDate": "2016-01-13", "language": "en", "rating": 5}]}}]