[{"locationId": 8677305, "name": "Aventura Park Barcelona", "placeType": "ATTRACTION", "reviewListPage": {"reviews": [{"id": 725230843, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d8677305-r725230843-Aventura_Park_Barcelona-Barcelona_Catalonia.html", "text": "Worst day of my life! Me and my friends did two rides in total for the whole day. Almost all the rides were closed and we waited 6 hours in queue. ", "publishedDate": "2019-11-09", "language": "en", "rating": 1}, {"id": 706431918, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d8677305-r706431918-Aventura_Park_Barcelona-Barcelona_Catalonia.html", "text": "Nice rides and attractions, for all ages. Big park; not as many people as I expected to find during the month of August (Friday day of the week) . Although I enjoyed it. \nTo me it lacks the charm I get when I visit the Disney Parks, but that’s me \nPlenty of food and drink and spaces to sit down and relax.", "publishedDate": "2019-09-04", "language": "en", "rating": 4}, {"id": 652056170, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d8677305-r652056170-Aventura_Park_Barcelona-Barcelona_Catalonia.html", "text": "We stayed at one of the local hotels - full board - and got a pass that let us thru to the park and its attractions without having to queue up. It's a fun place for people - and kids - of all ages. The attractions are superb - do not try the kamikaze ones though if you are not a jet pilot :) The shows were very good, too. We spent two full days there enjoying its various world zones, the atmosphere, and the sunny weather. Definitely a must if you visit Catalunya in summer!", "publishedDate": "2019-02-13", "language": "en", "rating": 5}, {"id": 533071111, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d8677305-r533071111-Aventura_Park_Barcelona-Barcelona_Catalonia.html", "text": "Going to Barcelona? Wait, please spare a day and do visit this amusement park located around 1-1.30 hrs from Barcelona \nIt has different themes and the rides out there are breathtaking \nAlso adjoining to the park - Ferrari World has been opened which is a better version than the Dubai one\nSuitable for kids to elders i.e everyone \nMust Visit😻\n", "publishedDate": "2017-10-15", "language": "en", "rating": 5}, {"id": 417208933, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d8677305-r417208933-Aventura_Park_Barcelona-Barcelona_Catalonia.html", "text": "This is right next to our hotel and we have been 3 times. It is about 9 euro to get in but you can play until close. My almost 2 year old loves it there. The staff will happily join in, play and save her when she gets stuck in the ball pit. There are different areas for different age ranges. Parents are allowed in 1 part for the infants. Don't forget to bring socks. If you forget they do sell them for your little ones. Well worth the stop if you need to get the little ones good and tired so you can go explore.", "publishedDate": "2016-09-11", "language": "en", "rating": 5}, {"id": 366226444, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d8677305-r366226444-Aventura_Park_Barcelona-Barcelona_Catalonia.html", "text": "Great for a hot day as multiple of the rides involve water. Only bad point was the lines were too long. 2 hrs was the longest I had to wait  for a 1 minute roller coaster, which is crazy. Overall it was loads of fun and the rides I went on were really cool. ", "publishedDate": "2016-04-21", "language": "en", "rating": 4}]}}]