[{"locationId": 1467904, "name": "Ethnology Museum of Barcelona", "placeType": "ATTRACTION", "reviewListPage": {"reviews": [{"id": 715543607, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d1467904-r715543607-Ethnology_Museum_of_Barcelona-Barcelona_Catalonia.html", "text": "Museum of the history of barcelona was very interesting. You get to go under ground and see the excavation of history in person and they even admit in writing Constantinople made christianity the main religion because it made money for the goverment. Audio tour is hard to follow but informative.", "publishedDate": "2019-10-05", "language": "en", "rating": 5}, {"id": 680310265, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d1467904-r680310265-Ethnology_Museum_of_Barcelona-Barcelona_Catalonia.html", "text": "You'd definitely find Ethnological museums in the world or in every city you visit. but the Ethnology Museum of Barcelona, despite its simplicity offers a huge variety of details to admire.", "publishedDate": "2019-06-09", "language": "en", "rating": 5}, {"id": 649239861, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d1467904-r649239861-Ethnology_Museum_of_Barcelona-Barcelona_Catalonia.html", "text": "We happened to be walking by and it was getting near the end of the day and we hadn't seen anything. So we said \"what the hell\", particularly since it was free at that time. And it was worth every penny. That's harsh. It's about Catalan culture and history. It's a real mixed bag of artifacts, almost bizarre in its choice of how to represent this culture and history. It was not completely uninteresting. However, a lot of people, I imagine would have almost no interest whatsoever in what this place has to offer. I'm not certain that even Catalans are interested. We were the only people there. And I believe that's the only place in Barcelona that I saw that. And that's two separate trips to Barcelona covering maybe 10 days.\n\nBy the way, Catalans called mimeograph machines, Vietnamese machines because the Viet Cong used them to churn out propaganda during their insurgency against the Viet Nam government. This was actually one of the strange factoids shown. My wife and I couldn't help but chuckle at the inclusion of this exhibit. That gives you a small taste of what this museum has to offer. Don't think I have anything against Catalans or even this museum for that matter. It's just in most tourists limited budget of time, this is probably not the optimal expenditure of that precious resource.", "publishedDate": "2019-01-30", "language": "en", "rating": 3}, {"id": 636044433, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d1467904-r636044433-Ethnology_Museum_of_Barcelona-Barcelona_Catalonia.html", "text": "The museum displays are showing old furniture from Catalonia, old tools from a variety of crafts (boat, winepress, shepherd’s cabin, blacksmith’s bellows), and toys.", "publishedDate": "2018-11-27", "language": "en", "rating": 4}, {"id": 561239727, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d1467904-r561239727-Ethnology_Museum_of_Barcelona-Barcelona_Catalonia.html", "text": "It takes less than 1 hour to visit this museum. It's not necessarily a must do. It has a collection of objects and pictures of how the city evolved in the last century due to Olympic Games. Visit it while walking in Montjuic and before going to the bigger and more interesting Archeologic Museum down the road.", "publishedDate": "2018-02-18", "language": "en", "rating": 3}, {"id": 509038158, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d1467904-r509038158-Ethnology_Museum_of_Barcelona-Barcelona_Catalonia.html", "text": "Till now I never gave a terrible review, but unfortunately for this musem there is not other option. This musem is boring, uninteresting and the whole concept about museum is bad. It is a wasting of time.", "publishedDate": "2017-08-05", "language": "en", "rating": 1}, {"id": 422540950, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d1467904-r422540950-Ethnology_Museum_of_Barcelona-Barcelona_Catalonia.html", "text": "Most museums that are devoted to Ethnology, display non-European artefacts.  This museum used to do the same but all these have now moved to Museum of World Cultures in the centre of Barcelona.  \n\nWhat is left are items relating to Catalonian life such as fishing, festivals, etc.  Only one floor was open when I visited so there was little to see.", "publishedDate": "2016-09-26", "language": "en", "rating": 2}, {"id": 376716816, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d1467904-r376716816-Ethnology_Museum_of_Barcelona-Barcelona_Catalonia.html", "text": "We thoroughly enjoyed our visit to this small museum.  We first noticed  it 6 months ago when we were going somewhere else in Montjuic. We decided that we go and visit the next time we were in BCN.  We were very happy that we went to see it this time.   It cost €3.50 for seniors and the entry ticket  also included entrance to the Museum of World Cultures. (The staff told us this other museum is somewhere near the Picasso Museum.)  At the moment the Ethnology Museum is displaying artefacts from every day Catalunyan life.   Some quite modern and others quite old. It has info in Catalunyan, Spanish and English.   There are buttons to press for further info.   When we went we were virtually the only people there.  (Sadly for the museum as it should have more visitors.)  The young man on duty was very helpful and had very good English.  He was there to answer any question we put to him.  It was like having a personal guide.  You can go downstairs and see the artefacts not included in the main display.   We think that this museum should be seen by more people!", "publishedDate": "2016-05-26", "language": "en", "rating": 5}, {"id": 115811978, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d1467904-r115811978-Ethnology_Museum_of_Barcelona-Barcelona_Catalonia.html", "text": "The children liked the museum, it was a visit to all continents within Barcelona! The only minor was that it was very hot at midday, so plan your visit in the morning or not in July.", "publishedDate": "2011-07-26", "language": "en", "rating": 4}]}}]