[{"locationId": 7376615, "name": "Palo Market Fest", "placeType": "ATTRACTION", "reviewListPage": {"reviews": [{"id": 742664006, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d7376615-r742664006-Palo_Market_Fest-Barcelona_Catalonia.html", "text": "Save your time and money. It is not worth the efforts. Do not expect an intriguing market. You get overpriced commercial goods and fast food. ", "publishedDate": "2020-02-02", "language": "en", "rating": 1}, {"id": 736076669, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d7376615-r736076669-Palo_Market_Fest-Barcelona_Catalonia.html", "text": "One weekend per month there is this Palo Alto Market Fest in Poblenou with lots of stalls where designers sell their own stuff, lots of food trucks, drinks,  live music and full of happy people of all ages. Fun, I do recommend this. Partly outdoor, partly indoors.", "publishedDate": "2020-01-01", "language": "en", "rating": 4}, {"id": 734315824, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d7376615-r734315824-Palo_Market_Fest-Barcelona_Catalonia.html", "text": "We believed that there was a flea market to be held here, but when we arrived we found out that it is just one day a month. However we were invited to the recital - which was a charity event that was wonderful!\n\nThere was also a hands on exhibition of dome really clever percussion instruments and we played with them for a while too. \n\nIf there is something on in the area it is well worth a visit - I guess they have a website.", "publishedDate": "2019-12-23", "language": "en", "rating": 4}, {"id": 723766959, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d7376615-r723766959-Palo_Market_Fest-Barcelona_Catalonia.html", "text": "We love going to local farmers markets and were very excited to hear about this one happening while we were in town. The food options are a great and lots of interesting booths", "publishedDate": "2019-11-04", "language": "en", "rating": 5}, {"id": 717205936, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d7376615-r717205936-Palo_Market_Fest-Barcelona_Catalonia.html", "text": "Good atmosphere and quite friendly. Plenty of cheap stalls and meals. Nice area near/in Poblenou part of town", "publishedDate": "2019-10-10", "language": "en", "rating": 4}, {"id": 689986471, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d7376615-r689986471-Palo_Market_Fest-Barcelona_Catalonia.html", "text": "And we found a lot of varieties there.  Went during their July music weekend.  Very nice, not an absolute crowd either.  Lots of food choices.  Good way to spend an hour and a half.", "publishedDate": "2019-07-16", "language": "en", "rating": 4}, {"id": 637441753, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d7376615-r637441753-Palo_Market_Fest-Barcelona_Catalonia.html", "text": "Nice market with mix of food and product stalls. You can easily spend a few hours here, eating, having a drink and browsing the stalls. Then .... it’s not a cheap option. We are 5 .... 5x€4 entry = €20 Lunch (basic burger) 5x€7.50 = €37.50 ..... drinks = €22.50. .......€80 spent before we even started to look around the stalls !! My wife and I thought that the food, drinks and entry were each a couple of euros too much ! Not sure if we will go back - or at least if we do we will have Lunch before going ! ", "publishedDate": "2018-12-04", "language": "en", "rating": 4}, {"id": 633584100, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d7376615-r633584100-Palo_Market_Fest-Barcelona_Catalonia.html", "text": "I go every Palo Alto Market (when it’s not raining that much). The place is super cool, music is always great and vermouth never ruins your evening. ", "publishedDate": "2018-11-15", "language": "en", "rating": 5}, {"id": 631359540, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d7376615-r631359540-Palo_Market_Fest-Barcelona_Catalonia.html", "text": "A fun hipster market that's open the first weekend every month with lots of food stalls, bars, craft and clothing stalls, and live music.  It's located in the large garden space surrounding an artist's studio in El Poblenou (not a big tourist area).  You can buy tickets online ahead of time for 3 euros.  We spent several hours there on a lazy afternoon eating great Mexican food (duck tacos with mole), wonderful desserts (we marveled at but passed on the cheesecake on a stick dipped in chocolate), and drinking  a variety of adult beverages.  It was a great break in the middle of a long Gaudacious weekend in Barcelona.  There's a metro stop nearby (Selva de Mar on the #4 line), and there's also a nearby stop for the #7 bus that will provide you with you a tour of many of Barcelona's architectural highlights.", "publishedDate": "2018-11-06", "language": "en", "rating": 5}, {"id": 622995182, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d7376615-r622995182-Palo_Market_Fest-Barcelona_Catalonia.html", "text": "Really great food market and also for jewellery and clothes. Great atmosphere! there is an entrance fee of 4€, but was definitely worth it! ", "publishedDate": "2018-10-07", "language": "en", "rating": 5}, {"id": 558429684, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d7376615-r558429684-Palo_Market_Fest-Barcelona_Catalonia.html", "text": "Very cute market filled with food trucks/stalls and local designers (bags, jewelry, sunglasses, clothing, etc). Definitely had a bit of a cool hipster vibe. You can also get drinks and it seemed like they had live music later in the day. \n\nWould recommend for a more local experience. Only downside is the 4 euro entrance fee. Oh-and it's 80% outdoors, so rainy days make for less crowds, but also, you know, you might get wet. ", "publishedDate": "2018-02-04", "language": "en", "rating": 4}, {"id": 523786365, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d7376615-r523786365-Palo_Market_Fest-Barcelona_Catalonia.html", "text": "I stumbled on the Palo Alto Market via a travel website. If you are here on the first weekend of the month, go. 60% locals, 40% tourists. High degree of hipsters. With a small entrance fee, you have exposure to several food carts and trucks parked inside the grounds. Several music venues throughout. We were there in the middle of the afternoon. Little crowded but people watching was fantastic.  Lots of cool shopping opportunities as well.", "publishedDate": "2017-09-12", "language": "en", "rating": 4}, {"id": 493237502, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d7376615-r493237502-Palo_Market_Fest-Barcelona_Catalonia.html", "text": "With nice little booths between flowers and trees and bushes. From street food till sweets to eat and nice local designer who sell their created works - nice place to hang out a morning or afternoon. ", "publishedDate": "2017-06-15", "language": "en", "rating": 5}, {"id": 472066056, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d7376615-r472066056-Palo_Market_Fest-Barcelona_Catalonia.html", "text": "Palo Alto market is one of the greatest things you can do at the weekend in Barcelona. It only occurs during the first weekend of each month. The atmosphere is full of innovation, entrepreneurship and happiness. It's focus on local brands and food places. For me it's very recommendable", "publishedDate": "2017-04-02", "language": "en", "rating": 5}, {"id": 457273399, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d7376615-r457273399-Palo_Market_Fest-Barcelona_Catalonia.html", "text": "Clearly a lot of effort has gone into aesthetics here, so the market is certainly \"cute\", but an experience is so much more than that and this one fails in a few areas. The main one being the time it takes to get in. DO NOT reserve in advance, it affords you no benefit, and you will then be less willing to walk away if the queue is unacceptably long (think 1-2 hours as a typical wait). There is also an issue with seating: lots of food stalls, hardly anywhere to eat what you might buy.  Given the time it takes to get to the far end of Poblenou, the wait in what is a chaotic queue, and what's on offer inside it would be hard to recommend a visit when there is so much to do in central parts of Barcelona.The experience here is like a scaled down version of Borough or Spitalfields or Brick Lane markets in London.", "publishedDate": "2017-02-04", "language": "en", "rating": 3}, {"id": 438733261, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d7376615-r438733261-Palo_Market_Fest-Barcelona_Catalonia.html", "text": "Every first weekend of the month you can enjoy Palo Alto Market at Poblenou. It is a fantastic  place to discover  new designers, eat trendy food, listen  to music or have nice cocktail. You cannot miss it.", "publishedDate": "2016-11-20", "language": "en", "rating": 5}, {"id": 425944230, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d7376615-r425944230-Palo_Market_Fest-Barcelona_Catalonia.html", "text": "A really nice and cool market once a month in Poble Nou a bit outside the center of Barcelona. Food trucks, dj:s, live music and market. All situated in a beautiful garden area. A must!", "publishedDate": "2016-10-07", "language": "en", "rating": 5}, {"id": 415402850, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d7376615-r415402850-Palo_Market_Fest-Barcelona_Catalonia.html", "text": "Definitely worth a visit! A very good combiation of food trucks, music and atmosphere. Only 3€ entrance and fairly prices drinks and food. Defnitely recommendable", "publishedDate": "2016-09-06", "language": "en", "rating": 5}, {"id": 398756984, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d7376615-r398756984-Palo_Market_Fest-Barcelona_Catalonia.html", "text": "Well it is a very nice experience the people the food the drinks \n\nYou will see traditional food everywhere and other types for sure\n\nBut the day we went there was a live DJ and followed by a band. \n\nThe band was nice and they presented really nice music \n\nBut that DJ if i can describe him with a word i would say international or amazing\n\nWe listened to him for maybe two hours and he did an amazing selection of songs different types and languages never something off and would always appreciate his enthusiasm and how he lives and enjoyes the music   ", "publishedDate": "2016-07-29", "language": "en", "rating": 5}, {"id": 381517029, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d7376615-r381517029-Palo_Market_Fest-Barcelona_Catalonia.html", "text": "palo alto is happening every first weekend of a month, lucky for me that it's happen on the weekend that visit barcelona. the market is like seven metro stops from placa catalunya, the market is in a small complex of warehouses that the market happen between and inside them, there are lot of stalls that loaded with goodies, and a food truck area for drink something and a lot of selctions food. go there special!!!", "publishedDate": "2016-06-10", "language": "en", "rating": 5}, {"id": 367265980, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d7376615-r367265980-Palo_Market_Fest-Barcelona_Catalonia.html", "text": "Incredible adventure! A so called \"hipster\" market vibrant with life and wonderful things to do. There are articles of a variety of things, including bikes. A good place to take a glimpse and enjoy new products from the city, all the way from beer to handcrafted sunglasses! All in a beautiful and big terrace (more recomendable to go at sunset). A wonderful experience.", "publishedDate": "2016-04-25", "language": "en", "rating": 5}, {"id": 362314029, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d7376615-r362314029-Palo_Market_Fest-Barcelona_Catalonia.html", "text": "After some of online research before a long weekend in Barcelona, I came across this market and although it was a little bit of a trek from our hotel, we were so pleased we made the effort to visit. Great vibe, cool stalls and interesting mix of street food. We enjoyed a few drinks in the afternoon and bought a few original things. Would thoroughly recommend for anyone who enjoys visiting Shoreditch/Spitalfields in London.", "publishedDate": "2016-04-07", "language": "en", "rating": 5}, {"id": 337056719, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d7376615-r337056719-Palo_Market_Fest-Barcelona_Catalonia.html", "text": "Palo Alto Market is for those seeking for original and hip design, alternative street food (they serve both great vegan and organic food as well as all sorts of tasty meat!) and/or simply a drink in a nice mellow atmosphere. We've been there twice (the market is held only once a month) and it's hands down our favourite in Barcelona. There are loads of interesting things to see, foods to try, and drinks to have in the warm vibrant evening, under the lanterns, listening to live music and being surrounded by a nice crowd.\n\nI don't get the fuss about the 3€ entrance fee though. It really is not much for the experience. The fee does appear to keep away the tourists who think it's their right to \"take a peek\" everywhere they want to (while ending up swarming the place). But despite the fee, there always seems to be a lot of happy people on the market grounds, both locals and not, gladly enjoying the nice vibe of the place. It is indeed a special experience!", "publishedDate": "2016-01-03", "language": "en", "rating": 5}, {"id": 336754762, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d7376615-r336754762-Palo_Market_Fest-Barcelona_Catalonia.html", "text": "The concept of this market is nice, young creators showing their brand in an old factory area and surroundings... The idea is very nice but the 3Eur entrance fee is just not correct. It's a market, to present new brands... don't charge an entrance fee..... The place is always crowded, because of the food truck at the event, so you pay to be inside of a 'sardine can'. In my opinion the entrance fee charge had to be only for the small concerts held late afternoon or after 6pm. Before this time people want to check the young creator stores and eat something at the food trucks. For 3Eur entrance plus a food purchase is just too much for a street food event midday or mid-afternoon.\nThere are cheaper/free options in Barcelona like All Those Market, Lostandfound, Fleamarket Raval, etc...", "publishedDate": "2016-01-02", "language": "en", "rating": 3}, {"id": 317102740, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d7376615-r317102740-Palo_Market_Fest-Barcelona_Catalonia.html", "text": "Open to new proposals in design and in organic products space. \"Picoteo\" to spend the day ... in my opinion unreasonable prices", "publishedDate": "2015-10-08", "language": "en", "rating": 3}, {"id": 316080108, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d7376615-r316080108-Palo_Market_Fest-Barcelona_Catalonia.html", "text": "Today we visited for the first time the monthly Palo Alto Market. It is located in Poblenou and can be easily reached by public transport. Inside you find in a former factory a wonderful picturesque garden - as I have never seen before in Barcelona. In some of the buildings Barcelona designers show (mostly) fashion, local food and small gifts to take back home. You also find a lot of food trucks (better come hungry) and a really enjoyable atmosphere. The long queue  and the waiting time of more than 45 minutes was a price well paid - but we need to find the ideal entry time, next time. We will be back for sure", "publishedDate": "2015-10-04", "language": "en", "rating": 5}, {"id": 316012917, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d7376615-r316012917-Palo_Market_Fest-Barcelona_Catalonia.html", "text": "Some great, artisan makers and sellers and fabulous food - well worth the walk/metro journey and in a fantastic location! This is not a flea market - it is more of a craft market, high end, and is only held once a month, but is a must if you're in Barcelona at the right time!", "publishedDate": "2015-10-04", "language": "en", "rating": 4}, {"id": 287139983, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d7376615-r287139983-Palo_Market_Fest-Barcelona_Catalonia.html", "text": "Great place for all the beer lovers. There are many micro breweries promoting their beer from the stands and a couple of nice street food shops. Great atmosphere, loved it.", "publishedDate": "2015-07-09", "language": "en", "rating": 4}, {"id": 266445251, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d7376615-r266445251-Palo_Market_Fest-Barcelona_Catalonia.html", "text": "Is held only once a month. It is mainly a food market with some clothes etc, not a flea market the quality of everything on sale is very high. We arrived about 11am and the q was small but when we left about 3 hours later the q had about 150 people so go early. ", "publishedDate": "2015-04-18", "language": "en", "rating": 4}, {"id": 265354124, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d7376615-r265354124-Palo_Market_Fest-Barcelona_Catalonia.html", "text": "Visited with my partner and found it to be largely uninspiring. Most stalls offered clothes that you can buy direct from supiers/shops in the UK for half the price. It was a nice experience to wander around the market and area, but would not recommended it. ", "publishedDate": "2015-04-12", "language": "en", "rating": 1}, {"id": 262900396, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d7376615-r262900396-Palo_Market_Fest-Barcelona_Catalonia.html", "text": "This is a good street market in Barcelona. You would have a good time here. If you plan in a good way, then you can attend some of events happening here. Must visit", "publishedDate": "2015-03-31", "language": "en", "rating": 5}, {"id": 253213167, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d7376615-r253213167-Palo_Market_Fest-Barcelona_Catalonia.html", "text": "It is the second time I go to Palo Alto Market! It is full if very original things a great food and drinks! \nFor me a real hipster experience!\nFood for me is the best!\nAnd also for close or accessories you find tons or things!\nJust a few things to consider! \nAs good market you must pay a almost everything with cash! In side you don't find any casher machine so this is particular important as the queue to get in is usually long.", "publishedDate": "2015-02-08", "language": "en", "rating": 3}]}}]