[{"locationId": 8610971, "name": "Casa Thomas", "placeType": "ATTRACTION", "reviewListPage": {"reviews": [{"id": 733882849, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d8610971-r733882849-Casa_Thomas-Barcelona_Catalonia.html", "text": "Pretty interesting house with beautiful arhitecture, we stumbled upon it while walking on the streets after we just visited Casa Batllo and we had to stop and admire it. Worth a stop to see it if you are in the area though not necesarily a must visit, especially if yoi have a limited time frame. ", "publishedDate": "2019-12-20", "language": "en", "rating": 3}, {"id": 689534932, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d8610971-r689534932-Casa_Thomas-Barcelona_Catalonia.html", "text": "Casa Thomas is one of the many examples of Modernist buildings in Example and Avinguda Diagonal. Designed by Lluís Domènech i Montaner for Spanish industrialist Josep Thomas in 1903. The building is every centimetre a Modernist style, plus hints of Neo-Gothic architecture. especially in the long straight lines of the bay windows. The facade of the building is filled with sgraffito floral motifs in blue and yellow hues.\n\nA nice example of modernism and only worth a look if you’re in the area and into this architectural style.", "publishedDate": "2019-07-14", "language": "en", "rating": 3}, {"id": 681925917, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d8610971-r681925917-Casa_Thomas-Barcelona_Catalonia.html", "text": "An innovative business & residential building from the 19th Century.\nCurrently there is a furniture store at street level, on two floors. Most original architechtural elements are still there.\nThe store is a private business open to general públic (you must check commercial opening times). There is no fare to pay, nevertheless you should ask for permission. I assume that you will not disrupt business activity. A dress code does not apply, but smart casual dress will be welcome.", "publishedDate": "2019-06-16", "language": "en", "rating": 4}, {"id": 671848391, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d8610971-r671848391-Casa_Thomas-Barcelona_Catalonia.html", "text": "Great building and La Cubiña interiors is excellent, high quality design. The owners are very nice and helpful too. Can recommend a visit!", "publishedDate": "2019-05-06", "language": "en", "rating": 5}, {"id": 630970284, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d8610971-r630970284-Casa_Thomas-Barcelona_Catalonia.html", "text": "Actually, I do not have much information about this building, but only what I read on the Wikipedia. I just happen to pass by it and it caught my eyes. It is quite a beautiful building from the outside, but I did not walk inside.", "publishedDate": "2018-11-05", "language": "en", "rating": 4}, {"id": 342300621, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d8610971-r342300621-Casa_Thomas-Barcelona_Catalonia.html", "text": "The Neo-Gothic facade and light blue tones in floral decorative elements are the main features of this building and a trade mark of its architect, Lluis Domenech i Montaner. Josep Thomas wanted to have a workshop on the ground floor and the family apartment on the upper floor. Later, Francesc Guardia, the Montaner’s son-in-law added three more floors but managed to retain the original idea of his predecessor.", "publishedDate": "2016-01-24", "language": "en", "rating": 5}]}}]