[{"locationId": 3467712, "name": "Nova Mar Bella Beach", "placeType": "ATTRACTION", "reviewListPage": {"reviews": [{"id": 744484061, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d3467712-r744484061-Nova_Mar_Bella_Beach-Barcelona_Catalonia.html", "text": "no one should miss the beautiful morning sunrise in this beautiful beach. A long walk on the beach will relax you. ", "publishedDate": "2020-02-11", "language": "en", "rating": 4}, {"id": 721706233, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d3467712-r721706233-Nova_Mar_Bella_Beach-Barcelona_Catalonia.html", "text": "Barcelona has decided to let immigrants take over all the best places.  Aggressively selling crapy merchandise on the board walk and actually on the beach.  I saw a local man yelling at one of these people telling him to get off the beach and within minutes there were several immigrants standing there and the guy was in danger.  Barcelona needs to do something about this blight.  Police are outnumbered 50-1 all over town.  If you want to buy drugs or crapy merchandise then Barcelona is the place for you.  It is a terrible shame as it coiuld be one of Europe's best cities.", "publishedDate": "2019-10-27", "language": "en", "rating": 1}, {"id": 719683764, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d3467712-r719683764-Nova_Mar_Bella_Beach-Barcelona_Catalonia.html", "text": "Nova Mar Bella Beach was just across the road from our Hotel Occidental. It was a very long clean beach. It had a lot of facilities like, toilet, shower, bars, restaurants, water sports. tennis court, open gym and football ground. It was full of family crowd. It was much quieter than city beach\nWorth visiting !!", "publishedDate": "2019-10-19", "language": "en", "rating": 5}, {"id": 714004998, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d3467712-r714004998-Nova_Mar_Bella_Beach-Barcelona_Catalonia.html", "text": "The beach was relatively clean, tourists from different countries, the sea was not very clean, there was not much amenities Of course I wasn't very familiar with different parts of the beach, I prefer the Kish Island beach in Iran!", "publishedDate": "2019-09-29", "language": "en", "rating": 3}, {"id": 707659841, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d3467712-r707659841-Nova_Mar_Bella_Beach-Barcelona_Catalonia.html", "text": "The beach was large. Cold wind and sunshine. Should visit during peak time else a ok place. Water is clean and cold", "publishedDate": "2019-09-07", "language": "en", "rating": 3}, {"id": 702314139, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d3467712-r702314139-Nova_Mar_Bella_Beach-Barcelona_Catalonia.html", "text": "Rented bicycles and cycled here. Quieter than beaches nearer town. spacious toilets, bike racks to lock up rental bikes, showers. Relaxed unintimidating beach for people of all ages and all shapes and sizes! ", "publishedDate": "2019-08-23", "language": "en", "rating": 5}, {"id": 699016386, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d3467712-r699016386-Nova_Mar_Bella_Beach-Barcelona_Catalonia.html", "text": "Easy beach to get to from the city, so my friend and I went early in the morning before we started walking around (and we went in November so didn't stay in the water too long anyway).", "publishedDate": "2019-08-14", "language": "en", "rating": 4}, {"id": 690176964, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d3467712-r690176964-Nova_Mar_Bella_Beach-Barcelona_Catalonia.html", "text": "We stayed on the hop on hop off bus right at the end of the day and saw this beautiful Barcelona beach.", "publishedDate": "2019-07-16", "language": "en", "rating": 4}, {"id": 683408183, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d3467712-r683408183-Nova_Mar_Bella_Beach-Barcelona_Catalonia.html", "text": "Very nice tapas bar in the middle of the beach, very nice sand and clean water. Very convenient and free parking", "publishedDate": "2019-06-22", "language": "en", "rating": 5}, {"id": 682264339, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d3467712-r682264339-Nova_Mar_Bella_Beach-Barcelona_Catalonia.html", "text": "A nice place to enjoy the sun and the fresh air in barcelona! It’s clean but sometimes really crowded. Still a clean place, with some good spots all around it, even if you want to have a nice work.", "publishedDate": "2019-06-17", "language": "en", "rating": 5}, {"id": 658269270, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d3467712-r658269270-Nova_Mar_Bella_Beach-Barcelona_Catalonia.html", "text": "Close to Havana ( 25 min). Very clean. Great services on beach . Bathroom facilities absolutely disgusting, just FYI .", "publishedDate": "2019-03-13", "language": "en", "rating": 5}, {"id": 645604489, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d3467712-r645604489-Nova_Mar_Bella_Beach-Barcelona_Catalonia.html", "text": "Especially if your tourists like us. Well, we took our socks and shoes off, stuck them in the water, felt the ice and ran back up the sand. It’s called simulated swimming in winter! Apart from that, the path overlooking the beach was great to walk along from one end to the other. Very scenic, watch the yachts sailing away, take note of the pedestrians walking and roller blading in all directions along the path. Great fun. Recommend getting dropped off by a taxi near Platja del Llevant beach and walking along Nova Mar Bella beach back toward the Barcelona Aquarium. Took us about 45 minutes. \n\nHope this helps!", "publishedDate": "2019-01-13", "language": "en", "rating": 4}, {"id": 645015752, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d3467712-r645015752-Nova_Mar_Bella_Beach-Barcelona_Catalonia.html", "text": "City of Barcelona beach, for families, here you enjoy beach pleasures and can later on have a drink on a nice terrace or visit the great city of Barcelona.", "publishedDate": "2019-01-10", "language": "en", "rating": 5}, {"id": 639137285, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d3467712-r639137285-Nova_Mar_Bella_Beach-Barcelona_Catalonia.html", "text": "A beach so close to the city centre is not something we see every day, but Barcelona has one even if it's man made. Very popular in the summer and a great way to relax, people watch or whatever for a few hours. We visited at sunset on a cold December evening but it's fun on the sand and the waves come right up to your feet which is something you don't get every day where I live. Obviously free with all the amenities you would expect on your doorstep.", "publishedDate": "2018-12-12", "language": "en", "rating": 4}, {"id": 623477670, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d3467712-r623477670-Nova_Mar_Bella_Beach-Barcelona_Catalonia.html", "text": "good beach in barcelone city for everyone:  families, friends etc. etc. nier the city center. Not pet allowed in the summer", "publishedDate": "2018-10-09", "language": "en", "rating": 5}, {"id": 621569454, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d3467712-r621569454-Nova_Mar_Bella_Beach-Barcelona_Catalonia.html", "text": "The beach was closed to swimming because of high wind and surf conditions but that didn't stop us from dipping our feet in the water and enjoying the bikini clad sun bathers!!", "publishedDate": "2018-10-02", "language": "en", "rating": 5}, {"id": 617965984, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d3467712-r617965984-Nova_Mar_Bella_Beach-Barcelona_Catalonia.html", "text": "I was expecting something secluded.  Bus service is nearby.  Did not try the metro.  Small bar on the beach with good service.", "publishedDate": "2018-09-19", "language": "en", "rating": 3}, {"id": 614709826, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d3467712-r614709826-Nova_Mar_Bella_Beach-Barcelona_Catalonia.html", "text": "It is rare to find a nude beach that is accessible by public transportation in an urban area with amenities that is also beautiful and well maintained and welcoming. We loved our day here and really appreciated that there was some privacy on the beach due to the natural bluff and the amenities shielding gawkers from the park. Totally worth a visit if you want to soak in the sun and sand in the buff. ", "publishedDate": "2018-09-07", "language": "en", "rating": 5}, {"id": 611036385, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d3467712-r611036385-Nova_Mar_Bella_Beach-Barcelona_Catalonia.html", "text": "This has the potential to be an amazing beach but unfortunately it is extremely crowded to the extent where you can barely get any space on the SAND!! if you're going to visit the beach be sure to go early to get a good spot!", "publishedDate": "2018-08-27", "language": "en", "rating": 3}, {"id": 604003789, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d3467712-r604003789-Nova_Mar_Bella_Beach-Barcelona_Catalonia.html", "text": "Second time here this time with my partner. This is a really nice beach if you want a gay beach adn want to be nude. Clean beach, food & drinks nearby - adn you can walk here if you want to.", "publishedDate": "2018-08-07", "language": "en", "rating": 5}, {"id": 603474630, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d3467712-r603474630-Nova_Mar_Bella_Beach-Barcelona_Catalonia.html", "text": "I went to the nude beach and LOVED it. If you have children I would not go to this side. If you have friends who have the slightest problem with nudity I would not recommend you take them to this side. There’s plenty more parts that aren’t nude beaches though. ", "publishedDate": "2018-08-06", "language": "en", "rating": 5}, {"id": 598915245, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d3467712-r598915245-Nova_Mar_Bella_Beach-Barcelona_Catalonia.html", "text": "We took taxi from city centre and it cost about 14 Euro. The taxi stopped at a park and when we walked passed the park , on the left hand side it was beach #29, I believed it was the area where the nudist beach located as I could see some nudist men and women. Topless was also common here , not only on the nudist beach . We went there during a weekday in July and there were quite a lot of people . We were able to find a space near windsurf area and enjoy some fun time there! ", "publishedDate": "2018-07-23", "language": "en", "rating": 5}, {"id": 598102463, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d3467712-r598102463-Nova_Mar_Bella_Beach-Barcelona_Catalonia.html", "text": "For the last day of a 9 day, 3 city vacation filled with tours and the like, all I wanted to do was sit by the Mediterranean Sea, drink some sangria and relax. That’s exactly what we did at Nova Mar Bella Beach. My husband and I took a mytaxi from our hotel and dropped off at the path down to the beach Chiringuito Baobab #bcnbaobab. We had 2 small couches and a table to ourselves at the edge of the deck about 50 ft from the water’s edge. We shared 2 jugs of sangria and some tapas then I went and put my feet in the gentle waves. It’s shallow for a very short distance then it drops off into a pool where others swam around. It was pretty quiet compared to some of the beaches closer to the Center of town. It was exactly what I wanted to do and is one of the best memories from a trip filled with them. The beach was very clean, nearby restrooms were clean, staff at the Baobab were nice. You can rent an umbrella and lounge chairs, not sure of the cost, our little booth was free. If you forget your beach towel there are street vendors selling large, colorful cotton tapestries for 15-20€ that can fit across 2 lounge chairs. ", "publishedDate": "2018-07-21", "language": "en", "rating": 5}, {"id": 595404973, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d3467712-r595404973-Nova_Mar_Bella_Beach-Barcelona_Catalonia.html", "text": "This is a great and clean beach to rent a chaise chair and enjoy the beach activities, people watching...they bring chairs, towels, and drinks if you want to enjoy in style...the cost is worth it.", "publishedDate": "2018-07-11", "language": "en", "rating": 5}, {"id": 593690692, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d3467712-r593690692-Nova_Mar_Bella_Beach-Barcelona_Catalonia.html", "text": "Nova Mar Bella beach is the northernmost beach of the strip, and is NOT a nudist beach! The nudist beach is actually Mar Bella beach (between #30 and #31), just south of Nova Mar Bella. So if you are looking for--or to avoid--the nudist area, you know exactly where now.\nNova Mar Bella has a few restaurants, is alive, yet is relatively quiet.", "publishedDate": "2018-07-07", "language": "en", "rating": 5}, {"id": 591846724, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d3467712-r591846724-Nova_Mar_Bella_Beach-Barcelona_Catalonia.html", "text": "Nova Mar Bella beach is a popular nudist beach. The beach has lot of activities. Beautiful and clean place, definitely recommended.", "publishedDate": "2018-06-30", "language": "en", "rating": 5}, {"id": 575780217, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d3467712-r575780217-Nova_Mar_Bella_Beach-Barcelona_Catalonia.html", "text": "Good and clean beach with loads of activities to do. Water was too cold for me in April so I just wet by feet.", "publishedDate": "2018-04-26", "language": "en", "rating": 4}, {"id": 563479132, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d3467712-r563479132-Nova_Mar_Bella_Beach-Barcelona_Catalonia.html", "text": "I visited this beach unfortunately on january and hence it was empty. If you could visit this beach by Aug, sep, oct i guess it will be awesome.", "publishedDate": "2018-02-28", "language": "en", "rating": 5}, {"id": 538886797, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d3467712-r538886797-Nova_Mar_Bella_Beach-Barcelona_Catalonia.html", "text": "It's quite ok for a lunchtime snack and drink.  Service wasn't particularly quick but it was fine and ok", "publishedDate": "2017-11-06", "language": "en", "rating": 3}, {"id": 529033526, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d3467712-r529033526-Nova_Mar_Bella_Beach-Barcelona_Catalonia.html", "text": "Like all beaches, the water quality can vary and the wind can pick up, but this is a nice beach to hang out at. Met some cool other guys. Felt comfortable as a couple. Felt comfortable clothed or not. Very accepting and nice place :) ", "publishedDate": "2017-10-02", "language": "en", "rating": 5}, {"id": 522308609, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d3467712-r522308609-Nova_Mar_Bella_Beach-Barcelona_Catalonia.html", "text": "Clean sand and lovely clear water, it is also a nudist beach in certain areas which I joined in on. The all over tan. I did lots of swimming and sunbathing, great beach the best apparently. There are also beach cafes and bars for a light lunch and two or three beers while I was there. I will be back.", "publishedDate": "2017-09-07", "language": "en", "rating": 4}, {"id": 500919689, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d3467712-r500919689-Nova_Mar_Bella_Beach-Barcelona_Catalonia.html", "text": "A little further along from the main Barceloneta beach, but very quiet & peaceful. Really nice place, plenty of space, mainly Spanish swimmers & sun seekers...only downside was after arriving @ 230pm still having to pay €30 for sun beds & parasol!! Two beach bars close by...\nBest beach in Barca!", "publishedDate": "2017-07-11", "language": "en", "rating": 4}, {"id": 488128274, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d3467712-r488128274-Nova_Mar_Bella_Beach-Barcelona_Catalonia.html", "text": "I came to this beach as it was a ten minute walk from our hotel. We got some sun loungers which was part of a bar called Begay bar I think. It is a nudist beach and there was a lot of male nudity. \n\nMy boyfriend and I went for the day and has a lovely day swimming and sunbathing and ordering the food and drinks from the bar. The loungers weren't too expensive either. I think two loungers with an umbrella came to under 20 euros. \nWe both joined in with the nudity..although there are way more naked men than women although there were a few. \n\nI had a lovely day swimming and sunbathing and enjoying the beach. \n\nI liked how clean it was...bins provided on the beach..plus male and female toilets and showers. \n\nDon't go here if offended by male nudity.", "publishedDate": "2017-05-27", "language": "en", "rating": 5}, {"id": 481073795, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d3467712-r481073795-Nova_Mar_Bella_Beach-Barcelona_Catalonia.html", "text": "Beach is one block from Hotel Diagonal Mar where we stayed.  Went to a hut/restaurant on the beach that had great food, drinks.  Service was a bit slow, but on vacation and honesty wasn't a big deal.  Loved it. Definitely would go back.", "publishedDate": "2017-05-02", "language": "en", "rating": 5}, {"id": 467590797, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d3467712-r467590797-Nova_Mar_Bella_Beach-Barcelona_Catalonia.html", "text": "Our first time in Spain in July 2016. All beaches were overly crowded. We came to see the nudist but didn't see any, only the usual topless beach goers. It was hot and we were tourist so we didn't have any beach towels or anything. Restaurants are packed. The water so blue and beautiful. I bet it's much better off season and if you have all your beach gear with you like umbrella, beach towel, especially water cooler.", "publishedDate": "2017-03-15", "language": "en", "rating": 4}, {"id": 451076727, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d3467712-r451076727-Nova_Mar_Bella_Beach-Barcelona_Catalonia.html", "text": "There are many beaches in Barcelona and all are comparable. To their credit Barcelona has set aside one of those beaches for naturists.  \nThe beach is relatively screened from non nudist by-passers and is clearly designated with many signs noting it is a nudist beach. On maps of Barcelona beaches it is also clearly noted as a nudist beach.\nSo nudists can enjoy the sunshine and water and non nudists are certainly not disadvantaged as there are many textile beaches.\nI visited there for the first time this afternoon and despite it being mid afternoon in winter I thoroughly enjoyed the freedom that it offered.\nThose naturists who live in Barcelona are indeed fortunate.\n\nIt is such a shame that some costs cities in other parts of the world have not taken a leaf out of Barcelona's book.", "publishedDate": "2017-01-10", "language": "en", "rating": 5}, {"id": 436446088, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d3467712-r436446088-Nova_Mar_Bella_Beach-Barcelona_Catalonia.html", "text": "I believe this is the one below the skate park. If I have it wrong I apologize, did not see any signs to confirm. We walked over to Mar Bella after spending time on Bogatel? on the south side of Mar Bella, because from the pier I saw a shower in the distance. As we were walking towards the showers I suddenly noticed about a dozen naked men, no naked women that we could see. I pointed that out to the wife and she could not get us to the showers and off the beach fast enough. Looks like it is a nice beach, but be aware if you are offended by public male nudity.", "publishedDate": "2016-11-11", "language": "en", "rating": 5}, {"id": 424659406, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d3467712-r424659406-Nova_Mar_Bella_Beach-Barcelona_Catalonia.html", "text": "Beach is nice and clean, water is lovely and blue, there are little huts that provide food and refreshments and you can hire a beach umbrella for about 8 euro for the day. (deck chairs also available at an extra cost) \nOn some parts of the beach, there are slides and climbing frames which is nice for the children. There is also an out door gym area which is nice. \nBe aware that parts of the beach is nudist, so don’t be alarmed if you come across stark naked people in some areas! There are other areas that are just normal, so abit of everything for everyone", "publishedDate": "2016-10-03", "language": "en", "rating": 4}, {"id": 423448020, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d3467712-r423448020-Nova_Mar_Bella_Beach-Barcelona_Catalonia.html", "text": "stayed nearby and managed to make the beach on 3 out of the 4 days\neverything was kept very clean and the beach bars / toilets etc were first class", "publishedDate": "2016-09-29", "language": "en", "rating": 4}, {"id": 422360646, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d3467712-r422360646-Nova_Mar_Bella_Beach-Barcelona_Catalonia.html", "text": "A very pleasant beach. we had visited end of 21st of September so not a lot of beach goers. It was quite moderate crowd.. we spent like 5 to6 hours and was a good one.", "publishedDate": "2016-09-26", "language": "en", "rating": 5}, {"id": 422107239, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d3467712-r422107239-Nova_Mar_Bella_Beach-Barcelona_Catalonia.html", "text": "Lovely beach and plenty of nice chiringhitos. \nSands nice beach cristal clear 💦 nice place to relax.", "publishedDate": "2016-09-25", "language": "en", "rating": 4}, {"id": 422040566, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d3467712-r422040566-Nova_Mar_Bella_Beach-Barcelona_Catalonia.html", "text": "Several posts suggest the nude beach and gay area is at NOVA MAR. IT IS NOT. It is immediately next to Nova Mar at Mar Bella beach. Walk down to the beach and go to the far right towards the W Hotel. There is a dining bar at the middle of the beach called BE GAY. This is where the male section begins and continues to the far right. If you rent a chair and umbrella be prepared to pay. OVERPRICED. 24 Euros for 2 chairs without cushions and an umbrella. The water is clean and warm so that is the positive. We followed all these other stupid posts and wasted and hour walking Nova Mar Bella beach. That is what is bad about the internet. You have stupid people posting careless information.", "publishedDate": "2016-09-25", "language": "en", "rating": 4}, {"id": 421474683, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d3467712-r421474683-Nova_Mar_Bella_Beach-Barcelona_Catalonia.html", "text": "Lovely beach with a nice atmosphere. Lots of choices of food and drink. The water is nice and it's quite clean too.", "publishedDate": "2016-09-23", "language": "en", "rating": 4}, {"id": 416983417, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d3467712-r416983417-Nova_Mar_Bella_Beach-Barcelona_Catalonia.html", "text": "We enjoyed this beach as it was a short walk from our apartment. The sand is fairly coarse so it rubs off easily, the sea shore gets deep pretty quickly so maybe not great for little ones. Of course you get the people trying to sell you towels, massages and Aqua, beer etc but that's pretty standard. Good facilities like showers and bars. Seem to be mainly locals. ", "publishedDate": "2016-09-10", "language": "en", "rating": 4}, {"id": 415908486, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d3467712-r415908486-Nova_Mar_Bella_Beach-Barcelona_Catalonia.html", "text": "Fairly easy to get to from Barcelona via the metro to Poblenou and then a 10 minutes walk down Bilbao street. We found the \"be gay\" cafe everyone refers to and grabbed a drink and wandered down to the beach. There were a lot of girls topless but only a handful of guys nude with most people clothed. People selling drinks regularly and massages on offer. Recommend if your comfortable with nudity. ", "publishedDate": "2016-09-07", "language": "en", "rating": 4}, {"id": 415400893, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d3467712-r415400893-Nova_Mar_Bella_Beach-Barcelona_Catalonia.html", "text": "Was looking for a beach to relax and snorkel and found this near my hotel. While right downtown, this beach is not over crowded and the water was very pleasant and relatively clean when we went early September. \n\nBe aware that there is a naturist section on the south end of the beach and, being in Europe, the entire beach can have topless sunbathing.  If you are not offended by this, you surely will enjoy. \n\nThe few negatives I would have are that there are many vendors selling their stuff and for snorkelers, few fishes can be seen as this is a sandy bottom sea where I ventured. ", "publishedDate": "2016-09-06", "language": "en", "rating": 5}, {"id": 414418169, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d3467712-r414418169-Nova_Mar_Bella_Beach-Barcelona_Catalonia.html", "text": "Nice beach great for a day out! Get there early to get a spot. There are bars with food and drinks but also locals trying to sell beer which is only about 2 Euro which is super cheap and just what you need!", "publishedDate": "2016-09-03", "language": "en", "rating": 5}, {"id": 414112801, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d3467712-r414112801-Nova_Mar_Bella_Beach-Barcelona_Catalonia.html", "text": "As with Mar Bella, nearby, this is a naturist or clothing optional beach. We came here often for an afternoon too, when the sun is not too hot and the water is warmer. Our Barcelona week was of course mostly spent visiting beautiful Gaudi' masterpieces, but this means taking queues and metros and so on. Therefore, sometime the need for beach-style relax took over. There are several beaches in Barcelona, similar to each other (mostly sandy), this one - like Mar Bella - is special as it is clothes optional. Good for those who, like us, don't like this damp stuff clinging to your skin all the time. True relax in a respectful and friendly environment... go for it!", "publishedDate": "2016-09-03", "language": "en", "rating": 4}, {"id": 411635298, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d3467712-r411635298-Nova_Mar_Bella_Beach-Barcelona_Catalonia.html", "text": "Went in July and exceeded expectations. Was actually mar bella beach where there is a nude section. However it spilled over into the textile area so it wound up as a mixed nude and clothed section for both males and females. Females were about 80 percent topless and very nonchalant about it. Males were about 20% and the were strutting their stuff amongst the females. it was the most blatent CFNM situation I have ever seen. Even the showers outside were nude, My wife and I were naked and sunned swam and drank at the bar for an afternoon of bliss. This is probably the best, most naked and sexy beach in the world. Run, do not walk if this is your thing. Far surpasses Greece.", "publishedDate": "2016-08-27", "language": "en", "rating": 5}, {"id": 409479098, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d3467712-r409479098-Nova_Mar_Bella_Beach-Barcelona_Catalonia.html", "text": "We came here most days on our recent week trip to Barcelona. We were staying near Place Catalonia, and took the metro, 15 minutes, and ten minutes walk. The beach is clean, busy, and OK for swimming.", "publishedDate": "2016-08-23", "language": "en", "rating": 4}, {"id": 397416344, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d3467712-r397416344-Nova_Mar_Bella_Beach-Barcelona_Catalonia.html", "text": "This beach was perfect. There is a bar that makes the best drinks and the sand is nice (without a lot of shells). You may see people nude, but its cool because there is no body shaming of any kind. ", "publishedDate": "2016-07-26", "language": "en", "rating": 5}, {"id": 392412893, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d3467712-r392412893-Nova_Mar_Bella_Beach-Barcelona_Catalonia.html", "text": "Visit during the week if you want to rent an umbrella and 2 loungers. The beach is a popular nudist and gay friendly spot in the sun.  There are clean bathrooms and showers.  The Mediterranean is cool with a moderate surf.  The wind can kick up quickly for fun with sailing or windsurfing.  My favorite bar, Be Gay, makes a killer mojito!\n\n", "publishedDate": "2016-07-14", "language": "en", "rating": 5}, {"id": 384832847, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d3467712-r384832847-Nova_Mar_Bella_Beach-Barcelona_Catalonia.html", "text": "After a previously bad impression from the very touristy beaches further south, we decided to give this a shot. Putting \"playa nudista\" into google maps finds it, taking you through a skatepark first. The nude section is well shielded by a wall and has almost 100% nudity. To the side of it is a section less shielded by wall where you'll find more clothed beachgoers.\nThe sand is nice and clean and the natural beauty and feel of the beach is on par with the whole of this coast. Very pleasant.\nYou can get two loungers for 16 euros and an umbrella for 5, cheaper than the more touristy beaches. The touts are still present and annoying but they come round less than on the more touristy beaches. Of course it also feels less pleasant as they're fully clothed.\nOverall, I'd recommend. It's a lovely beach and the most pleasant of what we tried in barca.", "publishedDate": "2016-06-22", "language": "en", "rating": 4}, {"id": 384063732, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d3467712-r384063732-Nova_Mar_Bella_Beach-Barcelona_Catalonia.html", "text": "Lovely beach , clean although the sea was quite cold in June. We were there for a music festival was nice to swim in the morning  ", "publishedDate": "2016-06-19", "language": "en", "rating": 5}, {"id": 382428332, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d3467712-r382428332-Nova_Mar_Bella_Beach-Barcelona_Catalonia.html", "text": "I came here with a friend and had an amazing time hitting the beach mid afternoon lazing away in the sun. The beach is beautiful with clean sand, clean water & of course great local restaurants around to dine from. The beach it self is a nudist beach (which I found out later after already booking our trip) however from the other reviews it wasn't at all what I felt it to be badly described. Mainly females were sunbathing with their top half exposed, and of course men were always fully covered up. We didn't at all feel uncomfortable as honestly we were too busy having fun, eating ice cream & enjoying the sun. I perhaps would suggest that if you do have young children - this may not be as suitable for you however it is an extremely long strip of a beach (therefore you may find a quiet spot) there is also a lot of fixtures on the beach (such as an outdoor gym, a kids play area and of course an outdoor shower).. All in all I would give it an 8/10 👍🏾", "publishedDate": "2016-06-14", "language": "en", "rating": 5}, {"id": 381547726, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d3467712-r381547726-Nova_Mar_Bella_Beach-Barcelona_Catalonia.html", "text": "We dropped in fairly early in the evening with two children, and ordered the tapas. The best part was the tomato bread, although the Iberian ham was nice.\n\nThe calamari was so tough my 6yo daughter couldn't actually bite into it. The potatas bravas was sautéed potatoes drizzled with Marie rose sauce. The cheese bore a close resemblance to cubes of rubber, what was described as chicken nuggets contained a grey paste.\n\nIt wasn't just us who were struggling. On the next table two couples in their 60s had ordered fish. One man sent his back, and the two ladies barely touched theirs.\n\nThe seats on the ramblas were nice, and the service was efficient, but the food was truly awful.", "publishedDate": "2016-06-11", "language": "en", "rating": 2}, {"id": 372402264, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d3467712-r372402264-Nova_Mar_Bella_Beach-Barcelona_Catalonia.html", "text": "This area is lovely either for strolling along the prom or sitting on the beach! It is lovely and clean with beach bars where you can get a drink or meal! A pleasant contrast to the hustle and bustle of the city!", "publishedDate": "2016-05-12", "language": "en", "rating": 5}, {"id": 369661116, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d3467712-r369661116-Nova_Mar_Bella_Beach-Barcelona_Catalonia.html", "text": "Just along from a busier beach but just as lovely.  This was a more peaceful spot and we enjoyed spending the early evening here paddling in the sea and relaxing on the beach. ", "publishedDate": "2016-05-02", "language": "en", "rating": 5}, {"id": 365060943, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d3467712-r365060943-Nova_Mar_Bella_Beach-Barcelona_Catalonia.html", "text": "People were playing volleyball and they seemed to have atleast 6 nets up. I went to just relax in the sun. I thought the beach was clean and not very crowded. It isn't somewhere I would go to specifically if I wanted to bring my family on vacation. Only because it is just average, I imagine there are better beachs near barcelona that are worth checking out.", "publishedDate": "2016-04-18", "language": "en", "rating": 3}, {"id": 353136333, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d3467712-r353136333-Nova_Mar_Bella_Beach-Barcelona_Catalonia.html", "text": "Unexpectedly dirty, I love the beach and for such a modern city this beach was a total disappointment, there were empty cups, plastic wraps and all kinds of garbage not only on the beach but also in the water, even at 8 am when there's no one else on the beach which makes me think they don't clean at all. I had to actually pick up a few things because I was so grossed out, they definitely need to clean the sand and the shoreline.", "publishedDate": "2016-03-05", "language": "en", "rating": 3}, {"id": 348247216, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d3467712-r348247216-Nova_Mar_Bella_Beach-Barcelona_Catalonia.html", "text": "In Barcelona you have this fantastic beach where you can surf in a mild climate, in a maximum comfort to approach (both public and private transport) and magnificent breakwaters leading into the sea to facilitate entries and exits of water .. . a luxury to take advantage of it!", "publishedDate": "2016-02-16", "language": "en", "rating": 5}, {"id": 334758496, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d3467712-r334758496-Nova_Mar_Bella_Beach-Barcelona_Catalonia.html", "text": "Quiet beach, with mostly men. Clothing optional although many people choose to stay clothed. Can be busier at peak times.", "publishedDate": "2015-12-24", "language": "en", "rating": 4}, {"id": 333792314, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d3467712-r333792314-Nova_Mar_Bella_Beach-Barcelona_Catalonia.html", "text": "A good walk from the metro rail station. very friendly beach mostly men ,some with bathers on  Toilet and showers could be cleaner. The sea can be rough. Take plenty of sunscreen. Guys walk along selling drinks.", "publishedDate": "2015-12-18", "language": "en", "rating": 4}, {"id": 324873963, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d3467712-r324873963-Nova_Mar_Bella_Beach-Barcelona_Catalonia.html", "text": "So close to hotel and easy walking access. I loved the Beach bar that was right there. Some people were bathing topless, some fully clothed. ", "publishedDate": "2015-11-06", "language": "en", "rating": 5}, {"id": 324845960, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d3467712-r324845960-Nova_Mar_Bella_Beach-Barcelona_Catalonia.html", "text": "We visited Playa Nudista, a section of Mar Bella beach for the purpose of nude swimming and sunbathing and it was great. \n\nWe have read that Mar Bella beach, just north of the Olympic village, was a beach dominated by nude gay men. We visited the beach because we wanted nude sunbathing and found that the other beach goers were a diverse mix of gender, age and groupings. By that I mean we saw nude couples and singles, we saw families with children (from toddlers to teens) and we saw plenty of women who were topless (only) and some men with swim trunks on. It was a very friendly and comfortable place to be. No gawkers or stalkers in sight. \n\nThe beach itself is well groomed and full of charming shells and sea glass and the Mediterranean is such a beautiful sea!\n\nHighly recommended for a clothing optional experience. ", "publishedDate": "2015-11-06", "language": "en", "rating": 5}, {"id": 313761757, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d3467712-r313761757-Nova_Mar_Bella_Beach-Barcelona_Catalonia.html", "text": "As all of yhe beaches in Barcelona, this too is a great place to spend the day. The water is amazing. Nearby you can get food and drinks. Great place to beach vacations.", "publishedDate": "2015-09-26", "language": "en", "rating": 5}, {"id": 313608305, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d3467712-r313608305-Nova_Mar_Bella_Beach-Barcelona_Catalonia.html", "text": "Its a free beach in the heart of Barcelona. Just 10 min walks from one of the metro stations. It is a nudist beach but of course you can wear swimwear too. The toilette is not nice and there are no dressing cabins...but wait..its a nudist beach, why would you need dressing cabins ;)", "publishedDate": "2015-09-25", "language": "en", "rating": 4}, {"id": 313605413, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d3467712-r313605413-Nova_Mar_Bella_Beach-Barcelona_Catalonia.html", "text": "An excellently clean and large beach suitable for everyone young and old, evenly spaced out beach bars provide drinks and toilets all along the long stretch of beach", "publishedDate": "2015-09-25", "language": "en", "rating": 4}, {"id": 313231390, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d3467712-r313231390-Nova_Mar_Bella_Beach-Barcelona_Catalonia.html", "text": "fantastic clean beach with all ameneties . the small bar and resteraunt are well stocked with local produce as well as beers from around the world. ", "publishedDate": "2015-09-24", "language": "en", "rating": 5}, {"id": 313099563, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d3467712-r313099563-Nova_Mar_Bella_Beach-Barcelona_Catalonia.html", "text": "This is nudist a beach which I have no issue with at all it's also a gay beach with I have no issue with at all \"but it's not very well signed it's a two minute walk from the skate board park and other well pedestrianised areas , we walked across this beach what a mistake! Two men having sex in in view of everybody  avoid this at all costs!!!\n\n", "publishedDate": "2015-09-23", "language": "en", "rating": 1}, {"id": 312367853, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d3467712-r312367853-Nova_Mar_Bella_Beach-Barcelona_Catalonia.html", "text": "In the Nova Mar area there is a small strip dedicated to those wishing to sunbathe naked. It is on the Barcelona side of the \"Be Gay\" bar and is tastefully protected from general view by a wall.\nThere were some families there but mainly couples (mixed and same gender) .\nWe went as a couple in late August. It was pleasant enough, but became very crowded in the afternoon.\nNote: all Barcelona beaches have a sunbed/ parasol charge.", "publishedDate": "2015-09-21", "language": "en", "rating": 4}, {"id": 305399490, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d3467712-r305399490-Nova_Mar_Bella_Beach-Barcelona_Catalonia.html", "text": "Great beach bar called 'be gay', nice nachos. It's a more mature gay crowd and really there are mostly adults here. A long walk along the beach as it's typically at the end. Showers toilets lockers etc. it gets very busy. Clothing is optional and mixed. Nice clean water with things to do. Metro nearby on Bilbao street. ", "publishedDate": "2015-08-31", "language": "en", "rating": 5}, {"id": 304797461, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d3467712-r304797461-Nova_Mar_Bella_Beach-Barcelona_Catalonia.html", "text": "Now that is a beach for all tastes you sunbathe or swim or do all sort of activities surfing renting a scoter enjoying every aspect of the beach and walking range from all the other beachs loved it and advice keep half of your trip to barcelona there so if your staying 6 days at least 2 days will be perfecto.", "publishedDate": "2015-08-29", "language": "en", "rating": 5}, {"id": 304682083, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d3467712-r304682083-Nova_Mar_Bella_Beach-Barcelona_Catalonia.html", "text": "Water & beach was clean, not as crowded, two great cabana restaurants, bring a volleyball or join a game on the beach. We met some locals Marko & Fabio started a game 2v2 others joined in fun times.  ", "publishedDate": "2015-08-29", "language": "en", "rating": 5}, {"id": 303153380, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d3467712-r303153380-Nova_Mar_Bella_Beach-Barcelona_Catalonia.html", "text": "Lovely beach, lots of nudeness & gays. Sunday was busy, however plenty of space. Their are 2 bars, nice food and drink. No shop's on the beach so take supplies. ", "publishedDate": "2015-08-25", "language": "en", "rating": 4}, {"id": 299273981, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d3467712-r299273981-Nova_Mar_Bella_Beach-Barcelona_Catalonia.html", "text": "Gays and naturists will love this beach.  Cocktails served on the beach by fun staff.  Great music and such wonderful people watching.  We had to hit this spot 2 days in a row!!!", "publishedDate": "2015-08-14", "language": "en", "rating": 5}, {"id": 296204234, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d3467712-r296204234-Nova_Mar_Bella_Beach-Barcelona_Catalonia.html", "text": "Laid back, local beach where we spent a few hours before leaving Barcelona for the airport. It was a great place to watch the locals setting out their picnics for a Sunday afternoon's lazing on the beach. The waves were big the day we were there - swimming was great fun. Life-guard on duty. It was very packed. There's a bar area and you can buy ice-creams/snacks.", "publishedDate": "2015-08-05", "language": "en", "rating": 4}, {"id": 295938680, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d3467712-r295938680-Nova_Mar_Bella_Beach-Barcelona_Catalonia.html", "text": "Great beach, very gay and with clothing optional. Closest metro station is Poblenou.  You'll know you're there when you see the BeGay Cafe on the  beach. ", "publishedDate": "2015-08-05", "language": "en", "rating": 4}, {"id": 294667133, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d3467712-r294667133-Nova_Mar_Bella_Beach-Barcelona_Catalonia.html", "text": "This part of the beach is nice. In our opinion this is better than other parts of Barcelona beach.\n\nIf you have small children, then parts of water is shielded for waves, the children will enjoy the calm water. You want some waves, then walk 50 meter north or south then you got waves.", "publishedDate": "2015-08-01", "language": "en", "rating": 4}, {"id": 291991761, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d3467712-r291991761-Nova_Mar_Bella_Beach-Barcelona_Catalonia.html", "text": "I spent two days at this beach. It was the first beach I went to which in Spain and the last before I left. It is very clean and an obvious busy destination for both tourist and locals. It was very relaxing to be nude on the beach without being bothered. Everyone around me was very friendly. All over the beach people will be walking around selling water, beers and liquor. I didn't purchase anything but the prices I heard seemed reasonable and they weren't pushy. The water was very nice. The water was clean and clear but I believe the water at the beaches in Sitges were cleaner. However, if you want to mingle and make friends Mar Bella is the place to be. I will recommend anyone that is ok with nudity to visit. I will be returning on my next trip to Barcelona!", "publishedDate": "2015-07-24", "language": "en", "rating": 5}, {"id": 288620794, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d3467712-r288620794-Nova_Mar_Bella_Beach-Barcelona_Catalonia.html", "text": "We visit this beach before flight departure, for a couple of hours. Was very hot, the panorma was wonderful, lot of peoples obviously a good and cold beer at beach bar.\nif you are in Barcelona must visit.", "publishedDate": "2015-07-13", "language": "en", "rating": 5}, {"id": 287901512, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d3467712-r287901512-Nova_Mar_Bella_Beach-Barcelona_Catalonia.html", "text": "Nova mar bella was a more crowded beach with people of various levels of undress. The waters were amazing and there is enough room for the crowd that comes there. There are a few great restaurants lined up near the beach. A must visit while in Barcelona.", "publishedDate": "2015-07-11", "language": "en", "rating": 4}, {"id": 287410974, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d3467712-r287410974-Nova_Mar_Bella_Beach-Barcelona_Catalonia.html", "text": "A less overcrowded beach in Barcelona.  Visited it on several days, very relaxing it's the only beach to permit nudism officially. Not a huge number partake but not an issue between those that do and those that don't.\n\nGetting to the beach I found challenging.  Whilst transport in Barcelona is excellent I found you do need to plan otherwise it is a significant walk from either the tram or metro lines.  Eventually I used the H16 or V27 bus which gets you relatively close.to the beach.\n\nMy only other comment would be regarding the toilets, the facilities on the beaches are very good.  However, on two occasions I went to use the gents toilet under the promenade but found some males were using it for 'other purposes'.  I would suggest using the toilets towards the middle of the beach especially if you have kids.", "publishedDate": "2015-07-09", "language": "en", "rating": 4}, {"id": 286807351, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d3467712-r286807351-Nova_Mar_Bella_Beach-Barcelona_Catalonia.html", "text": "It was crowded with nude, semi nude and dressed people, alike! Water looked really inviting and though was a little cold for our liking, it felt awesome. Waves are gentle and facilites are good in terms of shower and WC. There are couple of shacks which serve good food and they were kind enough to customize pizzas and burgers for the Vegeterian us! Ideal location to spend a quiet, romantic and funfilled evening in Barcelona . We did not realise how we spent 4-4.5 hours here!", "publishedDate": "2015-07-08", "language": "en", "rating": 5}, {"id": 281755028, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d3467712-r281755028-Nova_Mar_Bella_Beach-Barcelona_Catalonia.html", "text": "We are loving our relaxing day before heading home to Mississippi The sand is wonderful, the sea refreshing and I love any where people from every nationality can be all natural! I highly recommend!", "publishedDate": "2015-06-21", "language": "en", "rating": 5}, {"id": 278721303, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d3467712-r278721303-Nova_Mar_Bella_Beach-Barcelona_Catalonia.html", "text": "Although parking was a bit tight, we managed to get onto a meter on the main road by the beach. It was a good 27 degrees and the beach was not overcrowded and the people were friendly. The great thing about Barcelona is that whether you want a beach holiday, sight seeing or historic Architecture, there is something for everyone. Great food and eating houses. Ideal for shopaholics too!", "publishedDate": "2015-06-08", "language": "en", "rating": 5}, {"id": 274755528, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d3467712-r274755528-Nova_Mar_Bella_Beach-Barcelona_Catalonia.html", "text": "Loved the fact that we just crossed the road from our hotel, walked about 10 minutes and we were on the Beach, stunning cleaning beach.", "publishedDate": "2015-05-26", "language": "en", "rating": 5}, {"id": 267485605, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d3467712-r267485605-Nova_Mar_Bella_Beach-Barcelona_Catalonia.html", "text": "Went heer With a friend who had a scooter since this Beach is located a bit far from the center of Barcelona. But if you are looking for a Place that offers a mainly gay Beach and the possibility to be nude - then it's Worth going here. I was here in april - so there were not taht many People - just very Nice Beach. If I come back to Barcelona I will surely og here again. But I can imagine the Place being packed during the summer.", "publishedDate": "2015-04-23", "language": "en", "rating": 4}, {"id": 262650771, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d3467712-r262650771-Nova_Mar_Bella_Beach-Barcelona_Catalonia.html", "text": "This is a lovely beach, slightly gritty but not too much. It is a nudist beach but there are lots of families and so on, as well as non-nude bathers. Closest metro station is Poblenou so it's about a ten min walk from there. ", "publishedDate": "2015-03-30", "language": "en", "rating": 5}, {"id": 260119543, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d3467712-r260119543-Nova_Mar_Bella_Beach-Barcelona_Catalonia.html", "text": "It's very hot during summer. Walking in the sand  barefoot is agonizing. I feel I'm completely over cook in an hour. Over all it's still nice. It's was just crowded.", "publishedDate": "2015-03-17", "language": "en", "rating": 3}, {"id": 242259225, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d3467712-r242259225-Nova_Mar_Bella_Beach-Barcelona_Catalonia.html", "text": "It is located at the end of the Paeso Maritimo seafront promenade that starts in Barcelona. It is a sandy beach with access for the disabled, and there are often strong winds here, si it sends to attract many surfers and windsurfers. ", "publishedDate": "2014-12-01", "language": "en", "rating": 5}, {"id": 239942336, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d3467712-r239942336-Nova_Mar_Bella_Beach-Barcelona_Catalonia.html", "text": "For a city beach, it works. Good place to cool of after exploring. Close by bars and restaurants. Good spot.", "publishedDate": "2014-11-15", "language": "en", "rating": 4}, {"id": 239288770, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d3467712-r239288770-Nova_Mar_Bella_Beach-Barcelona_Catalonia.html", "text": "It is a beach well maintained by the city hall, with good bars for a drink, good showers to clean yourself, with good breakwaters to break the potential aggressive waves on a day of rough seas and a sand bottom with gentle slope that allows you to enjoy a smooth bath. Even in winter you can take a bath with a water that keeps the heat inertia of the Mediterranean Sea.\nI really recommend it!", "publishedDate": "2014-11-11", "language": "en", "rating": 5}, {"id": 231184998, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d3467712-r231184998-Nova_Mar_Bella_Beach-Barcelona_Catalonia.html", "text": "We visited in fall and I'm glad we did because it was still hot but not the crushing heat that Barcelona can get in summer.  The water was still warm enough to enjoy a swim and there are a couple of bars selling food and drink at reasonable prices. It was Saturday when we went so the beach was busy but there was still plenty of room. We used public transport to get here and it was simple to do. I made a couple of trips.", "publishedDate": "2014-09-27", "language": "en", "rating": 4}, {"id": 230746995, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d3467712-r230746995-Nova_Mar_Bella_Beach-Barcelona_Catalonia.html", "text": "We went her a few times in September. This is a relly nice clean beach, not overly busy and it felt very safe. There is the normal guys going round selling beer, water and cola but we felt like we could both go in the sea and leave our bags and didn't really have to worry about them. There are plenty sunbeds and umbrellas to hire near the beach bar and ample showers to wash the sand off. Also plenty of grass and trees covering the view from the road so the beach isn't being overlooked by anyone. ", "publishedDate": "2014-09-24", "language": "en", "rating": 5}, {"id": 227081085, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d3467712-r227081085-Nova_Mar_Bella_Beach-Barcelona_Catalonia.html", "text": "Since Barcelonata beach was expected to be terribly crowded as it is nearest to the city,  the hotel guy and the cab driver  both suggested Nova Mar Bella.  This was inspite of insisting that we wanted to go to a family beach... the guys looked proud of their beach!  \n\nWe went early in the morning to escape the crowd and the summer sun.... Sun beds are pretty cheap.  Even after checking with the vendors on the beach about a family area,  we were surrounded by nudists all around! This particularly made the trip not so great.  The water wasn't too clean n clear either but was pleasantly cool. We were there for a couple of hours and left.. We aren't really the sun worshipping sort but we felt we were sent to the wrong beach! The guys we checked with before we left in the morning did not know of a beach called Llevant which was actually recommended on blogging sites as secluded n neat.  ", "publishedDate": "2014-09-05", "language": "en", "rating": 3}, {"id": 225858051, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d3467712-r225858051-Nova_Mar_Bella_Beach-Barcelona_Catalonia.html", "text": "It was a little busy on here. However everybody was considerate, the waves can be choppy if it's windy but with care great fun. We had a 2 year old with us so we hired an umbrella and a couple of beds for the day. We spent a couple of days by the beach. It was great to relax after the bustle of Barcelona", "publishedDate": "2014-09-01", "language": "en", "rating": 4}, {"id": 224859156, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d3467712-r224859156-Nova_Mar_Bella_Beach-Barcelona_Catalonia.html", "text": "We stayed for a week in the a Princess Barcelona Hotel with the purpose to visit the nearby beaches. This is a long stretch of connected beaches with yellow sand and the gentle waves of the Mediterranean Sea. They have in every piece of beach a bar snacks called \"chiringuitos\" where you can have a  drink and even some decent lunch. The people,are mostly locals since these beaches are not close to the city center. In one area we found very relaxing the atmosphere where topless or even totally nude people mingled with the dressed one even playing volleyball together. We only visited the beach in the afternoons because the,weather wasn't hot enough for us, but in general,it was a wonderful experience and the locals are very friendly. We even met a guy who offered us to serve as a guide the next two days just for the sake of a spontaneous friendship. Thanks Pepe for the amazing torus you gave us of Bsrcelona.", "publishedDate": "2014-08-27", "language": "en", "rating": 5}, {"id": 220160350, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d3467712-r220160350-Nova_Mar_Bella_Beach-Barcelona_Catalonia.html", "text": "On the Sunday..it was hot and jammed pack with sun worshippers. Crowded but you can find a small spot to lay your blanket and jump into the water. Beach bar on site with excellen food. Love it nevermind the crowd. ", "publishedDate": "2014-08-06", "language": "en", "rating": 4}, {"id": 217923534, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d3467712-r217923534-Nova_Mar_Bella_Beach-Barcelona_Catalonia.html", "text": "The beach is silent and clean. No a lot of people so you can relax. Its a nudist beach so expect to see people naked. You can rent bed chairs and umbrellas. Its safe. You can buy good cold bear and water for the guys walking around with bags shouting bear. Very nice beach overall  ", "publishedDate": "2014-07-28", "language": "en", "rating": 4}]}}]