[{"locationId": 6857198, "name": "Enrique Tomas", "placeType": "ATTRACTION", "reviewListPage": {"reviews": [{"id": 601376519, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d6857198-r601376519-Enrique_Tomas-Barcelona_Catalonia.html", "text": "The ham is just great. Also you can enjoy an evening with different types of local sausages, meat and cheese while drinking a glass of wine. It was a worthy visit!", "publishedDate": "2018-07-31", "language": "en", "rating": 5}, {"id": 419736234, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d6857198-r419736234-Enrique_Tomas-Barcelona_Catalonia.html", "text": "We entered to have a browse ending up having information on the many hams available with age and process employed. This led to a tasting of 2/3 and having a snack lunch with cava whilst still chatting about the lovely flavours and texture of some great meat. A good way to learn and much cheaper than the museum on the Ramblas with personal service. ", "publishedDate": "2016-09-18", "language": "en", "rating": 5}, {"id": 364768634, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d6857198-r364768634-Enrique_Tomas-Barcelona_Catalonia.html", "text": "The shop is exquisite and very appealing to the senses - it is a feast for all charcuterie lovers. Th shop is filled with mouth watering delicacies and the smell is to die for.  Suffice to say that I was sold just with the smell alone. I bought a cone with different types of freshly thickly cut salami and it was superb! I've never tasted salami this good. If one is in Barcelona, one must go to this shop to taste their fares.", "publishedDate": "2016-04-17", "language": "en", "rating": 5}, {"id": 318902869, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d6857198-r318902869-Enrique_Tomas-Barcelona_Catalonia.html", "text": "Go there, choose the ham you think look best, and see how the cut slices. If you want, they vacumpack it, so you can bring it with you back home.\n\nCharming staff - smiles and speak good English.\n\nConsidering the type of shop, and the location, not too expensive.", "publishedDate": "2015-10-15", "language": "en", "rating": 4}, {"id": 279984906, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d6857198-r279984906-Enrique_Tomas-Barcelona_Catalonia.html", "text": "This chain is an easy choice for a quick bite all around Barcelona, especially if you just want to enjoy a ham sandwich, without all the tapa bar crowd and clamor.", "publishedDate": "2015-06-13", "language": "en", "rating": 4}, {"id": 259391879, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d6857198-r259391879-Enrique_Tomas-Barcelona_Catalonia.html", "text": "The Enrique Tomas chain of high quality jam chacuterias. Lovely hams are available to buy and in some stores, to eat. Lovely lovely lovely. I like!", "publishedDate": "2015-03-14", "language": "en", "rating": 4}]}}]