[{"locationId": 8866286, "name": "Jardins de Laribal", "placeType": "ATTRACTION", "reviewListPage": {"reviews": [{"id": 750623475, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d8866286-r750623475-Jardins_de_Laribal-Barcelona_Catalonia.html", "text": "Beautiful sloped and terraced garden on Montjuic mountain, with nice views, beautiful architecture and quiet places.", "publishedDate": "2020-03-12", "language": "en", "rating": 5}, {"id": 730875117, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d8866286-r730875117-Jardins_de_Laribal-Barcelona_Catalonia.html", "text": "At the point the cable car drops you off half way down the hill you will come across this beautiful garden. It is full of maintained greenery, fountains and paths. It is a real treasure and not very crowded.", "publishedDate": "2019-12-05", "language": "en", "rating": 5}, {"id": 676783730, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d8866286-r676783730-Jardins_de_Laribal-Barcelona_Catalonia.html", "text": "If you like stairs this is a great place.  Seriously nice park and relaxing to stroll around.  We walked up all the stairs and ended up at miro.  We had taken the bus there and it’s up all the way.  Next time we will start at miro and walk down ", "publishedDate": "2019-05-27", "language": "en", "rating": 4}, {"id": 674582627, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d8866286-r674582627-Jardins_de_Laribal-Barcelona_Catalonia.html", "text": "We visited the Gardens on a beautiful sunny day and it proved to be a lovely day indeed. The Gardens are quite large with numerous features. There are several landscaped terraces, many trees, bushes, and a wide range of plants and flowers, as well as statues, fountains and a variety of other water features. It is a really beautiful environment to be in and have a wonderful experience. We walked through the gardens for quite some time and loved being \"lost\" in the lovely wilderness. We did not see too many other people around, but we did not mind that at all. At the beginning of the last century, the area used to be a venue for public and private meetings. Most of the area occupied by the gardens used to belong to a famous lawyer, by the name Josep Laribal, after whom the gardens are named. This is an exceptional environment in Barcelona and we would highly recommend a visit.", "publishedDate": "2019-05-17", "language": "en", "rating": 5}, {"id": 648329545, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d8866286-r648329545-Jardins_de_Laribal-Barcelona_Catalonia.html", "text": "Just visited the garden de Laribal with my wife and daughter. The location is very tranquil but BEWARE.\n\nAs we were exiting a shady couple sprayed some liquid on my wife and daughters hair and clothes.  They pointed to the sky and said it was birds.  They commenced cleaning my wife’s hair and daughters jacket then suddenly the man started cleaning liquid off my trouser.  The lady gave me tissues and said “quick quick clean your wife’s hair”.  The man started pushing my wallet out of my pocket as though he was cleaning my trouser leg. At this stage I got suspicious and started pushing the wallet back and thanked them and looked at their faces.  They quickly left.\n\nSo enjoy the garden but be careful!", "publishedDate": "2019-01-26", "language": "en", "rating": 4}, {"id": 626472583, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d8866286-r626472583-Jardins_de_Laribal-Barcelona_Catalonia.html", "text": "I was disappointed as the gardens looked unkept, they could do with a bit of TLC. With so many other things to do in Barcelona I wouldn't recommend visiting", "publishedDate": "2018-10-19", "language": "en", "rating": 2}, {"id": 624787882, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d8866286-r624787882-Jardins_de_Laribal-Barcelona_Catalonia.html", "text": "One of the prettier gardens around Montjuic, it was nice and quiet. A good place to visit and relax for 20 minutes or so.", "publishedDate": "2018-10-14", "language": "en", "rating": 4}, {"id": 583156053, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d8866286-r583156053-Jardins_de_Laribal-Barcelona_Catalonia.html", "text": "Nice park away from the city and clise to the Fundacio Joan Miro. Lots of treese for some nice shade to cool down!", "publishedDate": "2018-05-27", "language": "en", "rating": 5}, {"id": 538939704, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d8866286-r538939704-Jardins_de_Laribal-Barcelona_Catalonia.html", "text": "Read about this garden so after a failed attempt to visit the Miro gallery (strikes etc) we walked down through the gardens and stopped for a drink at the cafe. (Toilets there were fine by the way!) As it was autumn not so many flowers etc but still a lovely place and I wish we had had time to explore more or just sit and drink it all in. Will definitely go back next time.", "publishedDate": "2017-11-06", "language": "en", "rating": 4}, {"id": 529675042, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d8866286-r529675042-Jardins_de_Laribal-Barcelona_Catalonia.html", "text": "I don't know if we were there the wrong season but there were no flowers and the garden just didn't seem kept up.\nLots of potential and a different time of year.......", "publishedDate": "2017-10-03", "language": "en", "rating": 3}, {"id": 495465804, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d8866286-r495465804-Jardins_de_Laribal-Barcelona_Catalonia.html", "text": "It was so hot the weekend of June 18-20 so I decided to go to the Jardins the Laribal for freshness and serenity. It was a Monday so there were few visitors. The gardens are well maintained. The entrance is free. There are several entrances (one is just next to the Miro Foundation). I enjoyed to cool off and freshen up my feet in the little waterfalls. y favorite part was the", "publishedDate": "2017-06-23", "language": "en", "rating": 5}, {"id": 492353416, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d8866286-r492353416-Jardins_de_Laribal-Barcelona_Catalonia.html", "text": "It does depend on where you enter this garden as to the first impression. We came in by a rather tatty parterre. The box and the rest of the plantings were in pretty poor shape. Fortunately as we moved on through the garden things improved. Interesting water features like the Escasdas de Generalife, inspired by the Generalife at the Alhambra.", "publishedDate": "2017-06-11", "language": "en", "rating": 4}, {"id": 480004890, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d8866286-r480004890-Jardins_de_Laribal-Barcelona_Catalonia.html", "text": "Wonderful, calm place, with lots of greenery, water ponds, stairs and porcelain accents, which all together create a really calm, unique atmosphere. A really nice place to wander around.", "publishedDate": "2017-04-29", "language": "en", "rating": 4}, {"id": 477443179, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d8866286-r477443179-Jardins_de_Laribal-Barcelona_Catalonia.html", "text": "Great spot for a picnic far away from crowds.\n\nEnjoy the beautiful garden very well taken care of. There are other parcs in the neighbourhood if you want to see more green. The botanical garden is very close and worth a tour.", "publishedDate": "2017-04-20", "language": "en", "rating": 4}, {"id": 475391378, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d8866286-r475391378-Jardins_de_Laribal-Barcelona_Catalonia.html", "text": "Spent quite a time wandering around this area. Liked the waterfalls flowing down the handrails of the steps and the fountains and the Greek Theatre (although it could have down with a sweep around as there was a lot of broken glass)", "publishedDate": "2017-04-13", "language": "en", "rating": 4}, {"id": 472754706, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d8866286-r472754706-Jardins_de_Laribal-Barcelona_Catalonia.html", "text": "Adorable, well maintained park on the Montjuic, free entry, priceless views, escape from the noice and crowd. Loved it.", "publishedDate": "2017-04-04", "language": "en", "rating": 5}, {"id": 435957375, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d8866286-r435957375-Jardins_de_Laribal-Barcelona_Catalonia.html", "text": "We enjoyed the Laribal gardens with pergolas, stairs, plants, even small amphitheatre! And the from there is really something!", "publishedDate": "2016-11-09", "language": "en", "rating": 4}, {"id": 420240098, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d8866286-r420240098-Jardins_de_Laribal-Barcelona_Catalonia.html", "text": "Barcelona is crowded and noisy, there's always something going on. \n\nWe decided to spend the day venturing up to and around Montjuic where there's not a huge amount happening. Even top sights up here like the Olympic stadium and the castle are fairly low key. \n\nWe wondered past this garden on our way to the Olympic stadium so we decided to have a walk around. It was really nice to finally hear some birds sing while enjoying to cool breeze under the shade of the trees and plants. \n\nMy one issue with the gardens - there are some free public toilets and they are horrendous. They really don't look like they are maintained or cleaned. There was no toilet roll in the male or female rooms and the flush in the female toilets didn't work. The men's toilets had no lighting at all. Honestly, if I were here again I'd settle for a bush, it would be more hygienic. ", "publishedDate": "2016-09-19", "language": "en", "rating": 4}, {"id": 370233015, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d8866286-r370233015-Jardins_de_Laribal-Barcelona_Catalonia.html", "text": "If you are up to climb Montjuic by yourself instead of using a car or the public transport, think about passing through this incredible garden.\nPeaceful place that connects the Museum of Art of Catalunya and the Poble Sec with the Miramar Avenue. But to go from bottom to top of this place you will have to use your legs, becasuse there is plenty of stairs, worth the climbing, because the fountains besides make the experience beautiful, and this is one of the first spots to see the city while you are going up.\nThere is a zone calle the Pergola that is kind of my favorite, there you can make a pause and have a great time because it is so calm. I liked to go to read there, almost no people go through the Pergola and the most you will hear is the singing of the birds and the parrots that nest near of the gardens.\nAfter making the pause, you can keep going up and discover all the magic that Montjuic have for you.", "publishedDate": "2016-05-04", "language": "en", "rating": 5}, {"id": 329972384, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d8866286-r329972384-Jardins_de_Laribal-Barcelona_Catalonia.html", "text": "We spent several hours in the National Museum of Catalonian Art.  We thought that a garden visit would be a complete change! We found this pleasant and hilly garden which is at the side of the Museu Etnologic  when we were looking for the other nearby garden, Jardin de Joan Maragall.  We were happy to be out  in the fresh air in different surroundings to the NMAC.  It is hilly and there are steps.   It has water features, lots of trees and if you go at the right time of year - the rose garden will be in flower.  At this time of year it is a green labyrinth!  Most enjoyable!  There is a good restaurant in the middle of the garden.", "publishedDate": "2015-11-30", "language": "en", "rating": 4}]}}]