[{"locationId": 2669781, "name": "Bubbleparc", "placeType": "ATTRACTION", "reviewListPage": {"reviews": [{"id": 735353116, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d2669781-r735353116-Bubbleparc-Barcelona_Catalonia.html", "text": "I absolutely adore this bubble park. It's great fun. I had a blast. Trampoline and the bubble are superb. All the things that are there are 6 euros but if you more tickets it's better value and we got ignored by the staff even though he saw us waiting.", "publishedDate": "2019-12-29", "language": "en", "rating": 3}, {"id": 564120115, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d2669781-r564120115-Bubbleparc-Barcelona_Catalonia.html", "text": "Came across this place when walking around the back outdoor area of the shopping centre (see pic).  I was disappointed it was just for kids because it looked so much fun - lots of water play and splash games, bungee jumping with harness and so many fun activities.", "publishedDate": "2018-03-03", "language": "en", "rating": 4}, {"id": 337386145, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d2669781-r337386145-Bubbleparc-Barcelona_Catalonia.html", "text": "Its located right next to the food court and the shopping mall and the aquarium right next to the port, there are 5 activists. 1 the bubble race 2 the water cars 3 the trampoline rope jumper 4 the gravity spinner 5 the tricycle race each game takes 5-10 minutes but you can pay for more than one round. ", "publishedDate": "2016-01-04", "language": "en", "rating": 4}, {"id": 218553894, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d2669781-r218553894-Bubbleparc-Barcelona_Catalonia.html", "text": "Located next to the aquarium. Bungee jumping was great fun for my eleven yr old, a group of teenage girls and a couple of little kids. The other activities were a bust. Was way too hot for the bikes and the water bubbles. My kid came out soaked with sweat and unhappy! 6€ for each turn or 15€ for 3. Overall, different and pretty cheap activity if you're in the area in Barcelona.", "publishedDate": "2014-07-30", "language": "en", "rating": 4}]}}]