[{"locationId": 8332676, "name": "Opera Lounge", "placeType": "ATTRACTION", "reviewListPage": {"reviews": [{"id": 747717870, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d8332676-r747717870-Opera_Lounge-Barcelona_Catalonia.html", "text": "My husband and I found the Opera Lounge online and stopped in early in the day hoping for a walk in appointment since this was only a three day holiday in Barcelona and lucked out. Andrea washes, cut and styled my hair (which was an absolute rats nest after poorly done coloring in the states and traveling for weeks), with amazing results! He followed that with a nice close shave for my husband, all for just under 90 Euros. I felt pampered and Andreas advice on how best to cut the damaged hair without losing much length was perfect. \nThe salon itself has a great vibe, with the original artwork and light refreshments (the coconut macaroons were light and fresh). Overall, a terrific way to freshen up and feel cultured all at once. ", "publishedDate": "2020-02-26", "language": "en", "rating": 5}, {"id": 730467090, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d8332676-r730467090-Opera_Lounge-Barcelona_Catalonia.html", "text": "I came through browser seauch and read the Comments and made a reservation. Very good communication and fast 10 point for that.. I arrived and the space looks great fancy nice design.. It talks to your eyes. Person who cut my hair was nice too and indeed they cut very nice especially I have a short hair and not easy to find a good hairdresser. The problem was when I came to casa and pay. On website it mention cut 30 euro 19 euro blow-dry 5 euro stylish advise. All perfect however they charge me all. No any customer like surprises.. First of all blowdry should be stylish dry if u just dry my hair u can not charge me 19 euro if u cut for 30 euro. also styling hair 5 euro. Hmm I just show u picture and u kind of agreed or give your openion and this cost u 5 euro.. Happy that conversation was fast because other wise I could not imagine the charge. I pointed out and indeed the person was fast and instead of 19euro  he charged for wash 10 euro only and I did not mention the 5 euro.. I was like ok no big deal. A little advise if u wanna charge stylish advise than u have to do more than u did than u can charge whatever u want but if u do a normal conversation to decide how to cut is a routine conversation at hairdresser and u can not show on website the price choosble but than it looks like mandatiry service. I advise inform directly cut-wash-dry 50 euro and change the concept  styling advise 5 euor or do the stylish job. Because u atrack people Pero u will not keep them.. Pricing need to be clear. And it's ugly to adding up many amounts after. Will I come yes I will because again I think they cut nice and will try color too. It's need to be same feeling with pricing list. Thanks", "publishedDate": "2019-12-03", "language": "en", "rating": 3}, {"id": 727252293, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d8332676-r727252293-Opera_Lounge-Barcelona_Catalonia.html", "text": "My experience at Opera was simply amazing! Everything was incredibly well done! They truly value and care about their customers and it shows as soon as you step in the beautifully decorated lounge! And my hair! It was a mess but the hairdresser took such good care of it! It still feels super smooth even after one month! (Apologies for forgetting his name, he was so amazing! He did miracles with my hair wow!!!) I will definitely go back to Opera Lounge for a haircut when I come back to Barcelona!! 12/10 !!", "publishedDate": "2019-11-18", "language": "en", "rating": 5}, {"id": 725943077, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d8332676-r725943077-Opera_Lounge-Barcelona_Catalonia.html", "text": "Great cut with Andrea! He gave a good trim and my hair feels lighter and looks really nice.  \n\nMust visit him while you’re here in Barcelona ", "publishedDate": "2019-11-12", "language": "en", "rating": 5}, {"id": 675609916, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d8332676-r675609916-Opera_Lounge-Barcelona_Catalonia.html", "text": "Couldn’t be happier with Opera Lounge. Very professional and helpful. One of the best haircuts ever!", "publishedDate": "2019-05-21", "language": "en", "rating": 5}, {"id": 646944737, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d8332676-r646944737-Opera_Lounge-Barcelona_Catalonia.html", "text": "Today I had an amazing experience at the Opera lounge! I was looking for a long time for a good hairstylist and I finally found her! Thank you Julia, for making my hair beautiful! One of the best and sweetest stylists that I have ever met! I am always very picky with my blond hair, but with her I don’t need to concern about my hair. So if you are looking for a good hairstylist, it’s Julia for sure! 🥰", "publishedDate": "2019-01-19", "language": "en", "rating": 5}, {"id": 630084905, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d8332676-r630084905-Opera_Lounge-Barcelona_Catalonia.html", "text": "One of the best haircuts I’ve ever had. The only problem now is that I will need to fly to Barcelona now to get my hair cut. Giovanni is fantastic. \n", "publishedDate": "2018-11-01", "language": "en", "rating": 5}, {"id": 597561021, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d8332676-r597561021-Opera_Lounge-Barcelona_Catalonia.html", "text": "My wife and I have just finished having haircuts from Giovanni (for wife) and Larrs (for me). Amazing service ", "publishedDate": "2018-07-19", "language": "en", "rating": 5}, {"id": 571740744, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d8332676-r571740744-Opera_Lounge-Barcelona_Catalonia.html", "text": "I really found the best hairdresser in that salon... her name was julia and she did a great work was really polite and knew exactly what I want ! The salon is modern, special and you feel home in a second. Soo if you need a haircut go to julia she will change your life. The whole team was very nice and friendly thanks alooot", "publishedDate": "2018-04-07", "language": "en", "rating": 5}, {"id": 551701268, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d8332676-r551701268-Opera_Lounge-Barcelona_Catalonia.html", "text": "What a wonderful experience at Opera Lounge.. super cool vibe and I can’t believe how fabulous Julia is and how skilled. I’m super picky about my hair and Julia delivered on all fronts. Not only the most perfect blowout but the cut/trim made all of the difference in the world. Definitely will be returning and Julia is not only super talented but the sweetest person you’ll meet!!!", "publishedDate": "2018-01-05", "language": "en", "rating": 5}, {"id": 549081818, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d8332676-r549081818-Opera_Lounge-Barcelona_Catalonia.html", "text": "My experience at Opera Lounge is exceptional. First, it is very easy getting there, as it is right off a main road (I took the bus there from Rambla and it took 15 minutes). Second, the space is gorgeous. You walk in to an impressive hall with artwork on the walls and into a space with three salon chairs placed in a non-traditional way. There is exposed brick that is charming and very Barcelona. And the staff. They greet you with warm and friendly smiles and ask upon arrival if you would like something to drink (water, coffee, coke). Julia is great, not only because she’s very good at hair, but she’s an English speaking hairstylist who is really good in Barcelona! I got a trim and wanted to keep my length. Although I have some thin and somewhat (ok, very) damaged hair from my use of the curling iron, she listened to my request of cutting as little as possible and delivered a beautiful cut. It’s healthy and bouncy and she styled it very well too. 5 stars. Thank you everyone at Opera lounge and thank you Julia for your kindness and talent.", "publishedDate": "2017-12-24", "language": "en", "rating": 5}, {"id": 534121830, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d8332676-r534121830-Opera_Lounge-Barcelona_Catalonia.html", "text": "I was in Barcelona for a short vacation there i decided it was really time to get a new haircut, On my way looking for a good hairdresser I stoped by opera lounge and i had the honor to get an appointment with the talented and very nice girl JULIA! the salon is very modern and artistic I felt very comfortable and JULIA really knows what's doing! Not was she only responsive but she also gave me good advise what she thinks would fit me best and what not ! And what else should i say since I am back in Austria I am just getting compliments for my new hairstyle and I feel very happy and comfortable with my sexy beautiful short hair!! Thx , I will definitely come back for another haircut :)", "publishedDate": "2017-10-18", "language": "en", "rating": 5}, {"id": 501134537, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d8332676-r501134537-Opera_Lounge-Barcelona_Catalonia.html", "text": "My family spends every summer in Spain.  As many readers can appreciate, there are many wonderful things in Spain that are more difficult to find elsewhere (Jamón, Avant Garde Clothes, Efficient Transport...etc).  But may I suggest that one of the things I most look forward to in Spain is actually Italian?  Giovanni is a wonderful stylist.  His artistic skill is out of this world.  His salon is beautiful and airy.  He has friendly, attentive staff and I always enjoy my time there.  There is nothing like a great haircut to make life sweeter and he gives me that gift every time I come in.  Huge hug and see you next year!", "publishedDate": "2017-07-12", "language": "en", "rating": 5}, {"id": 487600032, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d8332676-r487600032-Opera_Lounge-Barcelona_Catalonia.html", "text": "Beautiful venue, friendly staff, easiness in scheduling appointments, one of my best hearcuts and nice events that combine this place really into a venue for Art, Beauty & Culture", "publishedDate": "2017-05-25", "language": "en", "rating": 5}, {"id": 486576154, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d8332676-r486576154-Opera_Lounge-Barcelona_Catalonia.html", "text": "I had a wonderful experience at Opera. We came in randomly for my husbands trim. It looked so good I had my hair cut and honestly Giovanni is sweet, kind, handsome and amazing at what he does. All the staff is amazing. I bought loads of artwork and wish all salons had such amazing staff.", "publishedDate": "2017-05-22", "language": "en", "rating": 5}, {"id": 481863740, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d8332676-r481863740-Opera_Lounge-Barcelona_Catalonia.html", "text": "Wonderful experience, so glad I visited for a wash and blow dry . Just when I thought it couldn't get any better after the amazing wash and condition the blow dry that followed was of the highest quality .Would highly recommend a visit whilst on Holidays, your hair will love you for it . \nI made the appointment via email and got in the same day. Excellent service at a very reasonable price.", "publishedDate": "2017-05-05", "language": "en", "rating": 5}, {"id": 472948285, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d8332676-r472948285-Opera_Lounge-Barcelona_Catalonia.html", "text": "Was visiting for the week and wanted a blowout.  Was recommended by local and absolutely loved it!  Great people and my hair looked fabulous!  Very reasonably priced!  Highly recommend!", "publishedDate": "2017-04-05", "language": "en", "rating": 5}, {"id": 465661816, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d8332676-r465661816-Opera_Lounge-Barcelona_Catalonia.html", "text": "I will just say that I've been here a week ago for a haircut and I am so glad that after 2 years living in Barcelona I've finally found a place where I want to come back. I am a brand new regular customer.\nThank you for your passion and work, guys!", "publishedDate": "2017-03-08", "language": "en", "rating": 5}, {"id": 464488154, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d8332676-r464488154-Opera_Lounge-Barcelona_Catalonia.html", "text": "After 8 years living in Barcelona I found finally Giovanni! A former employee at Coppola hairdresser, the celebrity hairdresser in Milan and Montecarlo.\nHe is The Master of Shatush, a well known technique for hair highlights in Italy but hard to find in Barcelona. \nI just cannot miss my regular rendez-vous!\nThe Opera Lounge is nicely decorated, there are always exhibitions and offers great complimentary services!\nWell done Giovanni!\n", "publishedDate": "2017-03-04", "language": "en", "rating": 5}, {"id": 463701420, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d8332676-r463701420-Opera_Lounge-Barcelona_Catalonia.html", "text": "A art gallery and hair salon! Very good work, very professional. Giovanni and his Team are very nice and give you more than a haircut!Highly recommend this place !", "publishedDate": "2017-03-01", "language": "en", "rating": 5}, {"id": 462387792, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d8332676-r462387792-Opera_Lounge-Barcelona_Catalonia.html", "text": "Opera, it's not only a hairdress... is a total experience... not only   they cut your hair  but also they manage to convert  it in a fantastic experience!!!\n\nAnd Giovanni makes music with the scissors!!!!", "publishedDate": "2017-02-23", "language": "en", "rating": 5}, {"id": 458640305, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d8332676-r458640305-Opera_Lounge-Barcelona_Catalonia.html", "text": "Great professionals. Unique place where you can have your hair cut with a lot of art.\nThe guys they run it are fantastic. Really recommend it.", "publishedDate": "2017-02-11", "language": "en", "rating": 5}, {"id": 338999120, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d8332676-r338999120-Opera_Lounge-Barcelona_Catalonia.html", "text": "Great ambience and shows. Good gallery and acoustics. Very affordable a must experience when in Barca.", "publishedDate": "2016-01-10", "language": "en", "rating": 4}]}}]