[{"locationId": 10467498, "name": "Palau Moja", "placeType": "ATTRACTION", "reviewListPage": {"reviews": [{"id": 743546242, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d10467498-r743546242-Palau_Moja-Barcelona_Catalonia.html", "text": "I went there for food with a couple of friends, we were a bit sceptical since the place is in La Rambla. \n\nHowever, WOW! The chicken curry and the blue cheese salad was amazing, the staff was very kind and they also helped us in the tourist office. \n\nThey also have a cute shop with better souvenirs than most places in Barcelona... you can tell it’s good quality! ", "publishedDate": "2020-02-07", "language": "en", "rating": 5}, {"id": 741584865, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d10467498-r741584865-Palau_Moja-Barcelona_Catalonia.html", "text": "Beautiful and fascinating place to get a look at catalyuna culture.  Found out about it on the SelfTour App for Barcelona", "publishedDate": "2020-01-27", "language": "en", "rating": 5}, {"id": 720517507, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d10467498-r720517507-Palau_Moja-Barcelona_Catalonia.html", "text": "The Palau Moja is an 18th century Merchants town house now housing government units and a tourist info office and shop with touch screens that show the history of the city , very informative and nicely laid out . the building itself is lovely and was restored after damage in a fire.", "publishedDate": "2019-10-22", "language": "en", "rating": 4}, {"id": 703984818, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d10467498-r703984818-Palau_Moja-Barcelona_Catalonia.html", "text": "We absolutely loved it! The place is bright and clean, the staff is friendly and speak English, the food is delicious and fresh, we had Patatas Bravas, avocado salad, vegetarian lasagna and drinks. \nWe highly recommend.", "publishedDate": "2019-08-28", "language": "en", "rating": 5}, {"id": 688786982, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d10467498-r688786982-Palau_Moja-Barcelona_Catalonia.html", "text": "This is where you go to get some valuable information about Barcelona. The staff was very friendly and helpful. ", "publishedDate": "2019-07-11", "language": "en", "rating": 4}, {"id": 655178006, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d10467498-r655178006-Palau_Moja-Barcelona_Catalonia.html", "text": "Excellent place to know about history, socio-cultural heritage and Catalan territory. Through touch screens is posible to find information about new places to discover near Barcelona also advisors in the Tourism Office. In the shop you can buy original souvenirs, local products, tasty food and very good coffee! ☕️👌🏽", "publishedDate": "2019-02-27", "language": "en", "rating": 5}, {"id": 618361419, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d10467498-r618361419-Palau_Moja-Barcelona_Catalonia.html", "text": "Went here to convert my voucher to documents from buying the Barcelona Pass.  We got the 2-day with travel.  It is a great deal.  We got admission to several things we wanted to do, and others that we learned about and really enjoyed.  The travel adder gives you 2-day, all day access to the subway, busses and trains.  This is a real money saver.  You also get a 1-day pass for the Barcelona hop on hop off. The book you get gives you discounts, like the one we used for the Telefenic de Montjuïc.", "publishedDate": "2018-09-21", "language": "en", "rating": 5}, {"id": 585731712, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d10467498-r585731712-Palau_Moja-Barcelona_Catalonia.html", "text": "Going there to print some documents. Pol was really helpfull, nice and professional. Definitely i will come back if I need some tips for Barcelona!", "publishedDate": "2018-06-07", "language": "en", "rating": 5}, {"id": 549778542, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d10467498-r549778542-Palau_Moja-Barcelona_Catalonia.html", "text": "For us, this is not a top Barcelona attraction but one that if you have time and are a musician or music lover is an option to consider. We had tickets for Catalan music tour at 2:00 p.m. We got there at 1:45 and we found almost all entrance doors closed. We had to go around the building a few times to finally find someone who checked our ticket and let us in. The tour began with a short video which unfortunately we missed most of it because somehow they had decided to start earlier than scheduled and then we were taken upstairs. Unfortunately, our tour guide was not very knowledgeable and weakly versed in English. She also had a low volume of voice which did not work for a crowd of 30 something people who had gathered around her in a large music hall. We barely could understand what she was saying about the history of the building and the music. In this sense, this was an utter waste of money and time. The building on its own, if you explore, is quite lovely inside and out. The pillars are beautiful and the main music hall is gorgeous, especially the ceiling.", "publishedDate": "2017-12-28", "language": "en", "rating": 3}, {"id": 444301738, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d10467498-r444301738-Palau_Moja-Barcelona_Catalonia.html", "text": "We ordered the duck confit with onions and apple, and the beef stew.  Unfortunately, the person who served us got confused and served us the cod fish with vegetables instead.  He was apologetic and did ask if we would like the beef stew, which was our original order.  However, we thought it would be wasteful not to eat the cod fish, so we said it was OK.  When it came to payment, we didn't realise it till we walked out of the restaurant but we were charged for the beef stew which was $5 euro cheaper than the cod fish.  We are assuming this was deliberate - and would consider this good service.  In addition, the gentleman who served us was cheerful and obliging.  Food wise, OK - nothing to shout about - but the cod fish with vegetables was served hot and with a tasty tomato sauce.", "publishedDate": "2016-12-14", "language": "en", "rating": 4}, {"id": 421952630, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d10467498-r421952630-Palau_Moja-Barcelona_Catalonia.html", "text": "This place was quite interesting but what made the trip there worthwhile was Carlos the tourism advisor (not in the main shop but on the right of the restaurant when you face it from Las Ramblas) .  We found him cheerful, unfailingly patient and polite, more so than any other person we encountered in our month's travelling.  He sat with us for ages and helped us find good tapas, old Roman ruins and never rolled his eyes at our repeat visits or \"we don't understand, we don't think we can find it\".  He just found another way to tell us and never looked at us like we were thick.  He even came out to the restaurant to chat with us when he saw us eating there, even though the tourism advice part had closed and he was off duty.  Bravo Carlos, you are worth your weight in gold and made our trip so much easier and more enjoyable than it would have been otherwise!  We also ate dinner at the restaurant and the food was pretty good as a bonus.", "publishedDate": "2016-09-25", "language": "en", "rating": 5}, {"id": 411876356, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d10467498-r411876356-Palau_Moja-Barcelona_Catalonia.html", "text": "Palau Moja is a very cool concept that I wish was more widespread. What they've done is brought together the very best of Catalan products, put them under one roof, and explained the long history behind the regional artistic traditions that forged these souvenirs. It's part museum, part shop - with interactive exhibits and a friendly staff. I personally walked away with several cookbooks (since Catalan cuisine is outstanding) and a few handicrafts for friends and family. I'd actually recommend visiting this shop early in any Barcelona adventure, since it'll open your eyes to a whole new world of Catalan crafts (many of which I hadn't come to Barcelona to experience, simply because I didn't know they exist). And the curators did a great job in selecting the products. Most of them I couldn't find elsewhere on my trip.", "publishedDate": "2016-08-28", "language": "en", "rating": 5}, {"id": 409134791, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d10467498-r409134791-Palau_Moja-Barcelona_Catalonia.html", "text": "Unfortunately, I am unable to find a Tripadvisor reference for the restaurant but if the Heritage House offers the same level of customer service as the restaurant then it will be worth the trip  We popped in for lunch and was treated to a top London level of food, service, ambience but of course being Spanish, the welcome was far greater than in London.  I recommend this restaurant, in the middle of the Rambla - a perfect location.  Maybe visit the House first, then take lunch then maybe take a look around the shop. The items in the shop seem to be expensive but they are excellent quality - you get what you pay for.", "publishedDate": "2016-08-23", "language": "en", "rating": 5}, {"id": 397718569, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d10467498-r397718569-Palau_Moja-Barcelona_Catalonia.html", "text": "This is a neat place with historical displays, food items to buy and souvenirs.  Found best buy on kalidoscope and mini puzzles here.  The staff is fluent in a number of languages and were very helpful.", "publishedDate": "2016-07-26", "language": "en", "rating": 4}, {"id": 388397783, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d10467498-r388397783-Palau_Moja-Barcelona_Catalonia.html", "text": "Do you think this is good for your body. Wasting that many on such simple foods. The octopus is Gigantic and the worst is you can't cut it because of your lazy knife not made for cutting. The food is light so thats just one good point. Don't even think of going to eat here because the food doesn't get you full for that price.", "publishedDate": "2016-07-02", "language": "en", "rating": 2}]}}]