[{"locationId": 4498104, "name": "Royal Artistic Circle of Barcelona", "placeType": "ATTRACTION", "reviewListPage": {"reviews": [{"id": 755242407, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d4498104-r755242407-Royal_Artistic_Circle_of_Barcelona-Barcelona_Catalonia.html", "text": "This is one of the strangest art museums I've been in.  It seems like a hodgepodge of art... and nothing too spectacular.  The best it has to offer are about 40 small bronze sculptures by one of Spain's most famous artist Salvador Dali, probably enjoyable to only Dali fans.  In my opinion it is not worth the high cost of admission.", "publishedDate": "2020-05-19", "language": "en", "rating": 3}, {"id": 666047926, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d4498104-r666047926-Royal_Artistic_Circle_of_Barcelona-Barcelona_Catalonia.html", "text": "Interesting experience using total  virtual immersion to get a flavour of what climate change will mean.  However, the scenarios (like the flooded Plaça d’Espanya) still seem too much within the boundaries of BAU when in fact it could be far worse due to societal breakdown of norms worsened by climate-induced stress. Experiencing fascism / social violence / mass refugee / lack of food crisis -even virtually- would have been probably too controversial (and not enough ‘entertaining’) but probably more ‘realistic’! \n\nObviously, the ‘hope’ ending is nearly exclusively focused on the individuals and in an individualistic way. Nothing about the economic system and its values which are the drivers of climate change.  What about collective / social solutions to change the system ?  \n\nIn summary:  this ‘entertaining’ virtual experience will appeal to people who love the ‘game’ epoch in which we live in.  However, for me climate change is already here and now, every day in the ‘real’ world.  ", "publishedDate": "2019-04-13", "language": "en", "rating": 3}, {"id": 642606342, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d4498104-r642606342-Royal_Artistic_Circle_of_Barcelona-Barcelona_Catalonia.html", "text": "Opened amazing hall exhibition with an expert sign who manage this space and characteristic social art team, historial building and a good restaurant with good views", "publishedDate": "2018-12-31", "language": "en", "rating": 4}, {"id": 629955561, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d4498104-r629955561-Royal_Artistic_Circle_of_Barcelona-Barcelona_Catalonia.html", "text": "I didn't stay for dinner or even appetizers. The front desk staff and server were so  snobby that they ruined the anticipation of the wonderful food that I'd heard about. Life is too short to waste time on a place that thinks they don't need clientele or an occasional tourist. Maybe the employees can pay to eat there so the place will stay open.", "publishedDate": "2018-10-31", "language": "en", "rating": 1}, {"id": 620759956, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d4498104-r620759956-Royal_Artistic_Circle_of_Barcelona-Barcelona_Catalonia.html", "text": "A hidden gem !, such a great setting for a restaurant for lunch or evening socialising, the razor clams were to die for and the simple but delicious potato bravas excellent, I would go back in a heart beat !", "publishedDate": "2018-09-30", "language": "en", "rating": 5}, {"id": 597738986, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d4498104-r597738986-Royal_Artistic_Circle_of_Barcelona-Barcelona_Catalonia.html", "text": "We actually just went to the roof terrace for a drink (didn’t know about the Dali exhibition or would have gone to see it). \nThere was a lot of faff  at the reception desk where they checked if there was a table available for us (there were lots of free tables!!). Also, on a hot day in Barcelona, we had to leave our water bottles at the desk!!\nBut once we got to the upstairs terrace, it was actually really nice. The staff were very welcoming and, for the venue, the drink prices were reasonable. We had a very pleasant stay there, up above the throngs, while we waited for evening rush hour to pass. Oh, and lots of people were just having drinks!", "publishedDate": "2018-07-19", "language": "en", "rating": 4}, {"id": 566887259, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d4498104-r566887259-Royal_Artistic_Circle_of_Barcelona-Barcelona_Catalonia.html", "text": "It's a really fancy place and you pay the price for the food. But when you pay for the position, the food has to follow: beef steak was good, portion was OK but grilled octopus was a starter dish even though it was listed as main. I was left hungry. ", "publishedDate": "2018-03-16", "language": "en", "rating": 3}, {"id": 474948595, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d4498104-r474948595-Royal_Artistic_Circle_of_Barcelona-Barcelona_Catalonia.html", "text": "Lovely sushi and nice meat. Effective service. Nice view, not a long wait for food or table service. Nice quality for a good price.\n", "publishedDate": "2017-04-12", "language": "en", "rating": 5}, {"id": 458802706, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d4498104-r458802706-Royal_Artistic_Circle_of_Barcelona-Barcelona_Catalonia.html", "text": "We've visited Barcelona several times and even twice ventured to Figueres for the Dali Museum but that is pretty much a full day trip. Still, if you want a sampling of Dali while actually in Barcelona there is a venue. There are 4 or 5 rooms and even hallways are used as display space. Its layout is such that you think each room is the last but then there is more. There are several hundred prints, dozens and dozens of photographs. ( more than I'd ever seen of Dali before) and few sculptural pieces I'd never seen before. The place lacks the imprint of Dali's design for the layout - the prints are displayed from ceiling to floor in almost every room - but indeed the place is a treat. The biggest problem with the place is finding it. I'd seen a banner on a pole mentioning a Dali Exhibition but no one at the hotel could find any info. Of all the hits on the internet only one way down the list finally gave an address. Eventually we found it on a small Calle leading of La Rambla on the opposite side near the Central Boqueria Market; even then there were no signs. Nevertheless, a hidden treat worth the search.", "publishedDate": "2017-02-11", "language": "en", "rating": 4}, {"id": 448347980, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d4498104-r448347980-Royal_Artistic_Circle_of_Barcelona-Barcelona_Catalonia.html", "text": "If you like surrealistic art, don´t miss this museum. But maybe don´t make it a family visit because much of these works are subtantially erotic. To have the wavy designs by Gaudi and Dali in the same city is really exciting. In a addition to a host of engrossing sculptures, you can view lots of watercolors, sketches, drawings, engravings, as well as works in ceramic and glass. Above the museum is an exhibition and concert venue as well as a trendy Japanese style restaurant. Check for what else is happening while you are there. This place is close by the Cathedral at Place Nova. It´s relatively non-descript so you might pass it if you´re not looking out for it. It´s still open in the early evening if you want to visit it then.", "publishedDate": "2017-01-01", "language": "en", "rating": 4}, {"id": 442709137, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d4498104-r442709137-Royal_Artistic_Circle_of_Barcelona-Barcelona_Catalonia.html", "text": "Very intrensting to see that,A lot of status made from dali.The is a room under hiden that is maybe the best part of the visit.", "publishedDate": "2016-12-07", "language": "en", "rating": 4}, {"id": 437704201, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d4498104-r437704201-Royal_Artistic_Circle_of_Barcelona-Barcelona_Catalonia.html", "text": "Almost by chance, ant thanks to Google Maps, we found this hidden jewel. It blew mi mind! So many objects from this great master! you can spend hours inside, i was just driven out by hunger and the need of a bathroom. Well, the collection is not very well preserved not explained, but if you love Dali, you MUST come. And this is a great option to get to see lots of his work if you don`t make it to Figueres and Cadaqués, where his works` main Museums are.", "publishedDate": "2016-11-15", "language": "en", "rating": 4}, {"id": 431592063, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d4498104-r431592063-Royal_Artistic_Circle_of_Barcelona-Barcelona_Catalonia.html", "text": "Its a tragedy seeing this masters work of art treated så bad. Worn out, missing lights, it was almost surreal, because several of the items are really interesting. \nShame, shame, shame.", "publishedDate": "2016-10-25", "language": "en", "rating": 2}, {"id": 417423441, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d4498104-r417423441-Royal_Artistic_Circle_of_Barcelona-Barcelona_Catalonia.html", "text": "For many years we have thought about visiting the Dali Museum in Barcelona and finally we did it. It is a very extensive collection of everything Dali ever laid hands on. But but but ... it is a mess. It is a shame to see a lot of great art being treated this way. To little room for the art and not properly looked after :-(", "publishedDate": "2016-09-12", "language": "en", "rating": 3}, {"id": 342517236, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d4498104-r342517236-Royal_Artistic_Circle_of_Barcelona-Barcelona_Catalonia.html", "text": "I went to this exhibition ten years ago in Barcelona when it opened and liked it very much. Upon my return this year I looked forward to seeing the exhibition again because I also loved the building it was housed in. Much to my horror the 'museum' (I use that word lightly as any museum reputable would not let this happen to the works), had allowed the exhibition to fall into ruin. \n\nDrawings and watercolors were yellowing and falling out of the frames, missing pieces in empty glass boxes, and terrible broken lighting to see what was left of this great artist in the exhibition. Paintings were rippling in their frames and literally coming unglued from their mounts falling into the matte surrounding.\n\nI have never seen such a travesty in my life for works of art. I will not say you should not go because even damaged Dali is better than nothing but be forewarned that this is tragic and Spain itself should be ashamed that whomever runs this exhibition has allowed this to happen.", "publishedDate": "2016-01-24", "language": "en", "rating": 1}, {"id": 339312529, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d4498104-r339312529-Royal_Artistic_Circle_of_Barcelona-Barcelona_Catalonia.html", "text": "Having being to Figures, this is not worth it. €10 to enter , €7 for kids. A lot of stuff assembled in various room with very little interactivity and explanation. This museum could be great but the presentation is owfull", "publishedDate": "2016-01-11", "language": "en", "rating": 1}, {"id": 334945167, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d4498104-r334945167-Royal_Artistic_Circle_of_Barcelona-Barcelona_Catalonia.html", "text": "Some of the lesser seen pieces, sketches of Dali. Loved it, a must if you appreciate the Great surrealist's work.", "publishedDate": "2015-12-25", "language": "en", "rating": 5}, {"id": 330817250, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d4498104-r330817250-Royal_Artistic_Circle_of_Barcelona-Barcelona_Catalonia.html", "text": "Lots of limited editions and sculptures  very little explanation and poorly laid out. Desperately needs a curator. Claustrophobic. Avoid. ", "publishedDate": "2015-12-05", "language": "en", "rating": 2}, {"id": 228558803, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d4498104-r228558803-Royal_Artistic_Circle_of_Barcelona-Barcelona_Catalonia.html", "text": "I've listed this review under \"Royal Artistic Circle of Barcelona\", but thought I'd rate it here too since it's the same exhibit:\n\nWe didn't have time to go to Figueres and we knew that Dali had a collection on display in Barcelona . It required some research on our part to actually find this place though, since no one we asked had even heard about it! But believe me, it exists. It's easy to find too, in the Gothic Quarter (housed in the Royal Art Circle right by La Catedral). It contains some of his sculptures, paintings, drawings, documents and photos. It's a neat display and although it doesn't contain any of his famous work, it's still worth visiting if you don't have time for Figueres. Even if you're not a Dalí fan, this is an interesting place (which includes secret \"rooms\" hidden behind red curtains -- look for the arrows on the ground giving you permission to enter). This place is virtually empty so it's refreshing to avoid the crowds that you encounter at other Barcelona attractions. Price is a bit much for what you get though - I believe it was 10 Euros.", "publishedDate": "2014-09-12", "language": "en", "rating": 3}, {"id": 223050698, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d4498104-r223050698-Royal_Artistic_Circle_of_Barcelona-Barcelona_Catalonia.html", "text": "We didn't have time to go to Figueres and we knew that Dali had a collection on display in Barcelona .  It required some research on our part to actually find this place though, since no one we asked had even heard about it!  But believe me, it exists.  It's easy to find too, in the Gothic Quarter (housed in the Royal Art Circle right by La Catedral).  It contains some of his sculptures, paintings, drawings, documents and photos.  It's a neat display and although it doesn't contain any of his famous work, it's still worth visiting if you don't have time for Figueres.  Even if you're not a Dalí fan, this is an interesting place (which includes secret \"rooms\" hidden behind red curtains -- look for the arrows on the ground giving you permission to enter).  This place is virtually empty so it's refreshing to avoid the crowds that you encounter at other Barcelona attractions.  Price is a bit much for what you get though - I believe it was 10 Euros.", "publishedDate": "2014-08-19", "language": "en", "rating": 3}, {"id": 217082472, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d4498104-r217082472-Royal_Artistic_Circle_of_Barcelona-Barcelona_Catalonia.html", "text": "This place is stuffed with the works of Dali, yet very few knows about it. They call it \"Reial Cerle Artístic\". There are no banners, no advertisements whatsoever. You may have passed this place while walking narrow lanes of Barcelona yet you did not know what gems they have inside it.\n\nOnce you are inside they have a \"secret room\" downstairs. It is on the other side of the heavy curtains behind a sculpture. I guarantee you that you will be amazed to see the works in that room.\n\nThough have a rich collection, but their organization and infrastructure is quite poor. In many pieces the tags are missing, lots and lots of works in a single wall (which disables you to admire them properly). The curator have not done a good job, after all it is a museum, not a art studio. Another heads up, there are no toilets, no water inside.", "publishedDate": "2014-07-23", "language": "en", "rating": 4}, {"id": 182859171, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d4498104-r182859171-Royal_Artistic_Circle_of_Barcelona-Barcelona_Catalonia.html", "text": "It took some effort to find this museum as it doesn't seem to be well advertised locally and certainly not sign posted like many of the attractions. Although at 10 euro it was a little expensive for the size of the exhibition I was more than happy with what we saw. Only being in Barcelona for a few days meant we didn't have time for the main museum in Figuere and found this satisfied us as an appetizer. It could have done with WC's though...sorry, just saying.", "publishedDate": "2013-10-29", "language": "en", "rating": 4}, {"id": 173912356, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d4498104-r173912356-Royal_Artistic_Circle_of_Barcelona-Barcelona_Catalonia.html", "text": "The permanent exhibition of Dali in Palau Pignatelli in Barcelona was a disappointment. We paid 41€ for 2 adults & 3 children. There are some nice works, but it's far too much money for the small amount of works you can see there. Better go to the Dali Museum in Figueres, that is really fantastic.", "publishedDate": "2013-08-25", "language": "en", "rating": 2}]}}]