[{"locationId": 243171, "name": "Arc de Triomf", "placeType": "ATTRACTION", "reviewListPage": {"reviews": [{"id": 752473134, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d243171-r752473134-Arc_de_Triomf-Barcelona_Catalonia.html", "text": "One of the things I learned while in Barcelona was how important World’s Fairs were to its history along with the 1992 Olympics. I was able to briefly visit the Arc de Triomf which was constructed to be the main entrance gate for the 1888 World’s Fair. The detailed carvings and red brickwork are appropriately majestic and still very well maintained. It was well worth a brief visit during a visit to Barcelona.", "publishedDate": "2020-04-10", "language": "en", "rating": 4}, {"id": 752212379, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d243171-r752212379-Arc_de_Triomf-Barcelona_Catalonia.html", "text": "We happened to be here on February 15th when the Barcelona marathon was on and this was right by the end of the course.  An impressive structure in a very open area, which at this particular time was very busy.\n\nAnother case of if you are nearby go and see it and read about its 130+ year history and its link to the worlds fair.", "publishedDate": "2020-04-03", "language": "en", "rating": 4}, {"id": 751294825, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d243171-r751294825-Arc_de_Triomf-Barcelona_Catalonia.html", "text": "This is a fantastic monument built in 1888 that showcase Barcelona's architect designs. Great for photography. Walk through the arch, you will find yourselves in a wide promenade. Take a break from the busy city here,  just relax, take a stroll, watch people or the street performance or walked further into Ciutadella park for more greenery. Beware of pick pockets though.", "publishedDate": "2020-03-18", "language": "en", "rating": 4}, {"id": 750872908, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d243171-r750872908-Arc_de_Triomf-Barcelona_Catalonia.html", "text": "This is a fantastic monument in a great location. You can walk through the Arc de Triomf and wonder at the amazing architecture. It’s situated on a long walkway which at the end is the Parc de Las Cuitadeld.\n\nA great place to spend a few hours. Just be aware of the street performers who will jump in front of your photos to try to be photographed in them and demand payment.\n", "publishedDate": "2020-03-14", "language": "en", "rating": 5}, {"id": 750818308, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d243171-r750818308-Arc_de_Triomf-Barcelona_Catalonia.html", "text": "We noticed the Arc earlier in the day & didn’t really pay much attention as there wasn’t anything going on. But when we walked back past it later on in the day we heard some music, so grabbed a couple of beers from a local shop & just sat by the arc & enjoyed the music. There was a lovely atmosphere & we really enjoyed it. Be careful of pick pockets- we were fine but noticed some dodgy looking people! ", "publishedDate": "2020-03-14", "language": "en", "rating": 4}, {"id": 749244094, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d243171-r749244094-Arc_de_Triomf-Barcelona_Catalonia.html", "text": "I like the colors!\nThe urban chromatic composition is interesting, the attraction goes well with surroundings and leads the visitors into a nice park.", "publishedDate": "2020-03-05", "language": "en", "rating": 4}, {"id": 748322466, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d243171-r748322466-Arc_de_Triomf-Barcelona_Catalonia.html", "text": "Whenever we got lost the Arc always was a perfect sight to continue the journey in the right direction - near the bus station and the subway entrance.", "publishedDate": "2020-02-29", "language": "en", "rating": 5}, {"id": 748063827, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d243171-r748063827-Arc_de_Triomf-Barcelona_Catalonia.html", "text": "This is a very unsafe area to be in due to the amount of pickpocket/thieves working (even told this by local police!)\n We were unfortunate and had items stolen in a scuffle with 2 thieves.  Please keep your wits about you if you go to this area.", "publishedDate": "2020-02-27", "language": "en", "rating": 2}, {"id": 747267821, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d243171-r747267821-Arc_de_Triomf-Barcelona_Catalonia.html", "text": "It is a pretty nice walk around the Arc. Definitely worth visiting. Near the Gothic area and the zoo, it has plenty of things someone can do.", "publishedDate": "2020-02-24", "language": "en", "rating": 4}, {"id": 746536365, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d243171-r746536365-Arc_de_Triomf-Barcelona_Catalonia.html", "text": "Come here for small version of Paris arch de triumph.  Take metro bus L19 to arch. Along the way see the arch, slight copper red in color and walk down the park. Relaxing place to spend time \n", "publishedDate": "2020-02-21", "language": "en", "rating": 4}, {"id": 743606503, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d243171-r743606503-Arc_de_Triomf-Barcelona_Catalonia.html", "text": "I don’t know how impressive or distinct it is compared to other arcs around the world but on its own it is very grand and beautiful.  Just outside the gothic quarter and near the park/zoo, there is plenty of stuff in the area and it’s free so really no reason to miss this one. It won’t disappoint. As with many things going earlier in the morning will give you a less crowded experience if that kind of thing matters to you. ", "publishedDate": "2020-02-07", "language": "en", "rating": 4}, {"id": 740257151, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d243171-r740257151-Arc_de_Triomf-Barcelona_Catalonia.html", "text": "It is a large monument at the head of a nice open space and is at the crossroads of various communities. It is very similar to the Arc in Paris and it has some interesting statues incorporated in it.", "publishedDate": "2020-01-20", "language": "en", "rating": 4}, {"id": 737536620, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d243171-r737536620-Arc_de_Triomf-Barcelona_Catalonia.html", "text": "Nice monument, good architecture on the top, but nothing special, near by market area, which is handy and a metro station also. I haven't tried in night time, so not sure about it. ", "publishedDate": "2020-01-07", "language": "en", "rating": 4}, {"id": 735951349, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d243171-r735951349-Arc_de_Triomf-Barcelona_Catalonia.html", "text": "The pretty Arc de Triomf was built as the main access gate for the 1888 Barcelona World’s Fair, and leads to the path into Ciutadella Park.", "publishedDate": "2019-12-31", "language": "en", "rating": 4}, {"id": 733405597, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d243171-r733405597-Arc_de_Triomf-Barcelona_Catalonia.html", "text": "I admire such big buildings that made by human hand, with no obvious use... Just to showcase architecture and mechanic.", "publishedDate": "2019-12-18", "language": "en", "rating": 5}, {"id": 730974103, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d243171-r730974103-Arc_de_Triomf-Barcelona_Catalonia.html", "text": "Walked to the Arc from our hotel on a beautiful day. We had perfect weather and had a good time taking pictures. Be careful of the pick pockets with the white painted faces and the guy giving out coconuts ", "publishedDate": "2019-12-06", "language": "en", "rating": 5}, {"id": 730864871, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d243171-r730864871-Arc_de_Triomf-Barcelona_Catalonia.html", "text": "The huge Arc leads you into the beautiful Parc Ciutadella. The road traveling under it is closed to traffic which makes for a nice stroll. Outside of the Arc there are quite a few good dining choices. The Arc makes a great backdrop for pictures.", "publishedDate": "2019-12-05", "language": "en", "rating": 5}, {"id": 729994104, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d243171-r729994104-Arc_de_Triomf-Barcelona_Catalonia.html", "text": "Another one of those things you do if in the area. We walked past it on our way to brunch. It is impressive but I don't know that we would have made a special effort to visit here unless there had been a reason to be in the area, however a small diversion to take a look was more than justified.", "publishedDate": "2019-12-01", "language": "en", "rating": 3}, {"id": 729960486, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d243171-r729960486-Arc_de_Triomf-Barcelona_Catalonia.html", "text": "We past this monument initially on a bus and decided to come back for a closer look. It was built in the late 1800s for the world fair and now sits at the start of a nice green area that is a relaxing place to be after a busy day. The architecture is dazzling, even better from close up. It is really easy to photograph from a distance rather than close up though.", "publishedDate": "2019-12-01", "language": "en", "rating": 4}, {"id": 728706766, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d243171-r728706766-Arc_de_Triomf-Barcelona_Catalonia.html", "text": "We walked all around the arch and read all of the marks and inscriptions, learned as much as we could.  Impressive, set up for a big expo years ago.  Great cafes all around and a major transit site.", "publishedDate": "2019-11-24", "language": "en", "rating": 4}, {"id": 727418143, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d243171-r727418143-Arc_de_Triomf-Barcelona_Catalonia.html", "text": "The Arc is located very close to Las Ramblas, but is also part of a very nice park. There are some street vendors along the way, along with the people blowing bubbles for the kids.", "publishedDate": "2019-11-18", "language": "en", "rating": 4}, {"id": 727382223, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d243171-r727382223-Arc_de_Triomf-Barcelona_Catalonia.html", "text": "This large, easy to identify part of Barcelona is impressive in its contrast to the park and zoo.  It  is really great to walk up close and see how it is constructed.  I liked how it jumped out at us as we were passing by on a bus.  We had to quickly jump off and go have a look", "publishedDate": "2019-11-18", "language": "en", "rating": 4}, {"id": 727358428, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d243171-r727358428-Arc_de_Triomf-Barcelona_Catalonia.html", "text": "We passed by this place multiple times and saw the arc many times. I think it's a great building. The zoo is at the end if you walk through the park.", "publishedDate": "2019-11-18", "language": "en", "rating": 5}, {"id": 726645392, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d243171-r726645392-Arc_de_Triomf-Barcelona_Catalonia.html", "text": "The Arc de Triomf is located at the end of a long park and I’d a great spot to mill about, stroll and take photos. The Zoo’s located at the end of the park. ", "publishedDate": "2019-11-15", "language": "en", "rating": 4}, {"id": 726434810, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d243171-r726434810-Arc_de_Triomf-Barcelona_Catalonia.html", "text": "We saw the Arc de Triomf when we went out from subway station with the same name. \nThere is a street from the one side, and a big alley from another side, we found this as a very good place for taking photo. The nearest alley is good for walking, where you can see many different street entertainment.", "publishedDate": "2019-11-14", "language": "en", "rating": 4}, {"id": 725042887, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d243171-r725042887-Arc_de_Triomf-Barcelona_Catalonia.html", "text": "Interesting arc. Originally I thought the reason for the building was a major event, however, the truth was different. Never mind, nice creation, really bog fun with all tourists trying to take the perfect picture! A lot of sellers as well, a bit annoying though", "publishedDate": "2019-11-08", "language": "en", "rating": 5}, {"id": 725015316, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d243171-r725015316-Arc_de_Triomf-Barcelona_Catalonia.html", "text": "The Arc de Triomf (Catalan pronunciation: [ˈaɾk də tɾiˈomf]) or Arco de Triunfo in Spanish, is a triumphal arch in the city of Barcelona in Catalonia, Spain. It was built by architect Josep Vilaseca i Casanovas as the main access gate for the 1888 Barcelona World Fair. ", "publishedDate": "2019-11-08", "language": "en", "rating": 4}, {"id": 724976103, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d243171-r724976103-Arc_de_Triomf-Barcelona_Catalonia.html", "text": "We saw the Arc on a bike tour.  It is in a nice park and interesting to see.  The details in the arc are amazing!", "publishedDate": "2019-11-08", "language": "en", "rating": 4}, {"id": 722930244, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d243171-r722930244-Arc_de_Triomf-Barcelona_Catalonia.html", "text": "We visited the Arc de Triomf as part of a bike tour; without that I'm not sure whether we would have come, since it's not really near to other attractions we wanted to visit. It was a fun place to stop, in a nice little park, with the large brick arch available for photos. It isn't a must-see, but if you are in the area it's a pretty sight to enjoy.", "publishedDate": "2019-10-31", "language": "en", "rating": 3}, {"id": 722514685, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d243171-r722514685-Arc_de_Triomf-Barcelona_Catalonia.html", "text": "Fabulous structure in Barcelona and a must see; a miniature version of the Arc De Triomphe in Paris but still an impressive sight. Lovely architecture and a great photo opportunity though this attraction was very busy and therefore lots of people in your photos! A lovely tree lined walkway leads up to the arc.\nUnfortunately we did not get into the park as it was closing due to the protests but looked lovely from what we could see through the gates.", "publishedDate": "2019-10-30", "language": "en", "rating": 5}, {"id": 722341544, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d243171-r722341544-Arc_de_Triomf-Barcelona_Catalonia.html", "text": "We arrived from airport by Metro.  This is the first piece of architecture we saw.  It is very beautiful and it’s the entrance to a large park.  The park was very relaxing. It was packed with people.", "publishedDate": "2019-10-29", "language": "en", "rating": 5}, {"id": 722306851, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d243171-r722306851-Arc_de_Triomf-Barcelona_Catalonia.html", "text": "Barcelona’s version of their Arc de Triomf, surrounded by a pretty park, lots of people selling tourist trinkets, watch your money in the crowds but did not feel unsafe.  Easy to walk to and add to your walking tour.", "publishedDate": "2019-10-29", "language": "en", "rating": 4}, {"id": 722026554, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d243171-r722026554-Arc_de_Triomf-Barcelona_Catalonia.html", "text": "One of the top sights to see, with a fab avenue running down to the Parc de la Cuitadella.\n\nThe brick and stone built arch was erected for the 1888 Barcelona World fair. It served as the entrance and the Parc is now on the site where the fair was hosted.", "publishedDate": "2019-10-28", "language": "en", "rating": 5}, {"id": 721777520, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d243171-r721777520-Arc_de_Triomf-Barcelona_Catalonia.html", "text": "Nicely framed by rows of palm trees, the architecture of the arc means it is worth visiting this location.", "publishedDate": "2019-10-27", "language": "en", "rating": 4}, {"id": 720696204, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d243171-r720696204-Arc_de_Triomf-Barcelona_Catalonia.html", "text": "Arc de Triomf was an amazing site with great detail and beautiful day or night.  The arc leads to a long pathway that is lined with palm trees and is a nice stroll and away from all the stores and some of the people.  There are bikes to go on either side of the arc that can be rented and used as a starting point for a nice bike ride to the beach or ??? When you walk under the arc don't forget to look up at all the detail.", "publishedDate": "2019-10-23", "language": "en", "rating": 5}, {"id": 719688488, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d243171-r719688488-Arc_de_Triomf-Barcelona_Catalonia.html", "text": "Lovely place, where people chill out and many street entertainers. Best viewed from the ‘zoo’ side.  Difficult to photo on the car roundabout side...", "publishedDate": "2019-10-19", "language": "en", "rating": 4}, {"id": 718976444, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d243171-r718976444-Arc_de_Triomf-Barcelona_Catalonia.html", "text": "The brick face is a nice contrast to monument that you see in Paris.  Lots of things to see in the surrounding area. Don’t need much time at this landmark get your photo op and move on. Sunset is a nice time to go.  ", "publishedDate": "2019-10-16", "language": "en", "rating": 4}, {"id": 718153214, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d243171-r718153214-Arc_de_Triomf-Barcelona_Catalonia.html", "text": "Great park with the arc as a bonus, would recommend and it’s right near the zoo .. great for pictures too xx", "publishedDate": "2019-10-13", "language": "en", "rating": 5}, {"id": 716038432, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d243171-r716038432-Arc_de_Triomf-Barcelona_Catalonia.html", "text": "We have seen other Arcs in other countries so we decided to go take a look it’s very close to Parc de la Ciutadella where the big fountain was so why not", "publishedDate": "2019-10-07", "language": "en", "rating": 3}, {"id": 714922754, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d243171-r714922754-Arc_de_Triomf-Barcelona_Catalonia.html", "text": "Lovely arch, seen all the arches, Rome, Paris and now here! This arch is a nice colour in comparison, recommend a visit", "publishedDate": "2019-10-03", "language": "en", "rating": 5}, {"id": 714775784, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d243171-r714775784-Arc_de_Triomf-Barcelona_Catalonia.html", "text": "The Arc de Triomf    was built by architect Josep Vilaseca i Casanovas as the main access gate for the 1888 Barcelona World Fair which was held in the Parc de la Ciutadella.  It is located at the northern end of the promenade, facing the Passeig de Sant Joan. The arch is built in reddish brickwork .Sculptural and decorative finishes replete with symbolism.Very nice area with parks around perfectly kept. Lots of life, plenty of tourists.  It has become one of the city's iconic landmarks.", "publishedDate": "2019-10-02", "language": "en", "rating": 4}, {"id": 713219422, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d243171-r713219422-Arc_de_Triomf-Barcelona_Catalonia.html", "text": "We first saw the Arc de Triomf from the top of the hop on hop off bus. We then realized that it was a relatively short walk from our hotel. There is a wonderful green space in the vicinity which is a nice distraction from the hustle and bustle of the city.", "publishedDate": "2019-09-26", "language": "en", "rating": 4}, {"id": 712672491, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d243171-r712672491-Arc_de_Triomf-Barcelona_Catalonia.html", "text": "This is a great example of Arch de Triumph. It is even prettier than the same one in the Paris which is grey.", "publishedDate": "2019-09-24", "language": "en", "rating": 5}, {"id": 709894984, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d243171-r709894984-Arc_de_Triomf-Barcelona_Catalonia.html", "text": "Beautiful structure located close to the Gothic quarter in Barcelona. Access to the arc is quite easy. Fairly level ground. The surrounding park is very nice. A great spot to sit and people watch. We spent about an hour here. Nice and relaxing. ", "publishedDate": "2019-09-15", "language": "en", "rating": 4}, {"id": 708792745, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d243171-r708792745-Arc_de_Triomf-Barcelona_Catalonia.html", "text": "We went for a little walk and explore down here. Impressive views. Street sellers everywhere but do leave you alone if you say no. Leads to an amazing park and can then reach the beach from here. Easy to get to from the metro. Beautiful place. ", "publishedDate": "2019-09-11", "language": "en", "rating": 5}, {"id": 708670763, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d243171-r708670763-Arc_de_Triomf-Barcelona_Catalonia.html", "text": "Lovely Archway. In my opinion it looks better than the ones in London and Paris. It should be just as famous.", "publishedDate": "2019-09-10", "language": "en", "rating": 5}, {"id": 708610877, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d243171-r708610877-Arc_de_Triomf-Barcelona_Catalonia.html", "text": "It's just an arch in brick stones that is located close to the zoo. Nothing special. The parking under the arch is also expensive", "publishedDate": "2019-09-10", "language": "en", "rating": 4}, {"id": 707570191, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d243171-r707570191-Arc_de_Triomf-Barcelona_Catalonia.html", "text": "We visited via a short walk from Place de Catalunya but you can get the bus, metro or train there. \nThe arc is impressive and behind it is a pedestrianised area leading down to a park with buildings on either side. Worth visiting if you are passing. ", "publishedDate": "2019-09-07", "language": "en", "rating": 4}, {"id": 707285152, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d243171-r707285152-Arc_de_Triomf-Barcelona_Catalonia.html", "text": "Beautiful arc, which is like a grand entrance to the park! It's made of red bricks and is huge! Once you pass through there are palm trees to the right and left and if you walk ahead you will find Parc Dr la Ciutadella!", "publishedDate": "2019-09-06", "language": "en", "rating": 4}, {"id": 704497274, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d243171-r704497274-Arc_de_Triomf-Barcelona_Catalonia.html", "text": "My family enjoyed a walk here and stopped for tapas overlooking the arc. The red bricks stand out like nothing around it. It's an amazing piece of architecture worth visiting.", "publishedDate": "2019-08-29", "language": "en", "rating": 4}, {"id": 700556799, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d243171-r700556799-Arc_de_Triomf-Barcelona_Catalonia.html", "text": "The Arc de Triomf is a beautiful sight. Lovely to walk through the square. There’s lovely statues around and some shopping and entertainment.", "publishedDate": "2019-08-19", "language": "en", "rating": 4}, {"id": 699357222, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d243171-r699357222-Arc_de_Triomf-Barcelona_Catalonia.html", "text": "We stopped by here around 7:30AM. You can get some really nice photos here if it isn't super crowded. Really nice to visit.", "publishedDate": "2019-08-15", "language": "en", "rating": 4}, {"id": 697864185, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d243171-r697864185-Arc_de_Triomf-Barcelona_Catalonia.html", "text": "It was beautiful to walk there in the square that’s front of it \nAt night it has some singers, weird guys and prostitution so be careful ", "publishedDate": "2019-08-11", "language": "en", "rating": 4}, {"id": 697465235, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d243171-r697465235-Arc_de_Triomf-Barcelona_Catalonia.html", "text": "Yes, Barcelona has an arc of triomf! I did not see anyone going to the roof, guess you should just see it. \nThere is a bust stop just in the corner, if you plan to go to somewhere else after seeing the arc.", "publishedDate": "2019-08-10", "language": "en", "rating": 4}, {"id": 696152876, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d243171-r696152876-Arc_de_Triomf-Barcelona_Catalonia.html", "text": "This is definitely a fun place to take pictures and just watch people from all over have a good time. When the weather is great you will often see a lot of street vendors and artists. It is also not a far walk from Gothic Quarter or the zoo or the lake. It is a very central location, very similar to the sight in Paris.", "publishedDate": "2019-08-06", "language": "en", "rating": 5}, {"id": 693162482, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d243171-r693162482-Arc_de_Triomf-Barcelona_Catalonia.html", "text": "Amazing piece of architecture in the centre of Barcelona. Not too crowded either nice place to get a photo opportunity the whole area is very clean and beautiful ", "publishedDate": "2019-07-27", "language": "en", "rating": 4}, {"id": 691031862, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d243171-r691031862-Arc_de_Triomf-Barcelona_Catalonia.html", "text": "This arch is at the beginning of the Las Ramblas.\nBeautiful arch worth a quick stop to photograph.\nThe up the Las Ramblas", "publishedDate": "2019-07-19", "language": "en", "rating": 4}, {"id": 690455652, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d243171-r690455652-Arc_de_Triomf-Barcelona_Catalonia.html", "text": "We literally stumbled across the Arc and it was actually...gorgeous! It's even prettier and more ornate in person and also has a park attached to it. There are people around trying to sell things or entertain but it's not something you can't just walk by and ignore. Try to stop by and at least see this it really is beautiful.", "publishedDate": "2019-07-17", "language": "en", "rating": 5}, {"id": 690180067, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d243171-r690180067-Arc_de_Triomf-Barcelona_Catalonia.html", "text": "It does feel a little strange to see this here but don't expect it to be as large as Paris. It's not but still interesting to see.", "publishedDate": "2019-07-16", "language": "en", "rating": 4}, {"id": 689215598, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d243171-r689215598-Arc_de_Triomf-Barcelona_Catalonia.html", "text": "When visiting Barcelona, this is a must see. The detail on this arch is just spectacular and palm fringed road running through it complements it in a beautiful way.", "publishedDate": "2019-07-13", "language": "en", "rating": 4}, {"id": 689027137, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d243171-r689027137-Arc_de_Triomf-Barcelona_Catalonia.html", "text": "Great for a quick picture on your way around the city. Asides that nothing else to this arc in my opinion ", "publishedDate": "2019-07-12", "language": "en", "rating": 4}, {"id": 687504339, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d243171-r687504339-Arc_de_Triomf-Barcelona_Catalonia.html", "text": "I wish there was a way to learn more about the Arc de Triomf while at the attractions itself. While this is a great architectural piece, it would be better to have some history or information about the piece WHILE seeing it. \n\nFor those Instragrammers, please realize that many people want to take photos. And 485 photos of you turning and/or laughing is probably too many. Also, very difficult to get a clear photo of the whole thing because of trees and lampposts. Go to the end where the metro is and take it from the street. You will get a clearer photo. \nNice place to sit for a few minutes. Sadly, there's no breeze. :( Or at least we didn't feel any.", "publishedDate": "2019-07-07", "language": "en", "rating": 3}, {"id": 686228643, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d243171-r686228643-Arc_de_Triomf-Barcelona_Catalonia.html", "text": "A sight to behold, a stone's throw from the Air bnb, the adjoining park and recreation area was a hub for musicians, performers and even a zumba group. The atmosphere could only be described as happy, a playground for both young and old alike!", "publishedDate": "2019-07-02", "language": "en", "rating": 4}, {"id": 685785034, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d243171-r685785034-Arc_de_Triomf-Barcelona_Catalonia.html", "text": "If you do not know the significance of this structure it is only a beautiful architecture, as it was in our case as a family. At least on the Hop on hop off busses the audio guide give some perspective.", "publishedDate": "2019-07-01", "language": "en", "rating": 4}, {"id": 685506607, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d243171-r685506607-Arc_de_Triomf-Barcelona_Catalonia.html", "text": "We had just walked from a nearby park and spotted the Arc de Triomf and thought we'd take a closer look.\n\nUnfortunately, although we could appreciate some of the architecture, large scaffolding in readiness for stage construction blocked our further inspection of the Arc de Triomf.\n\nIt's worth taking a stroll towards as its architecture is quite striking, but it's impossible to say whether you can enter it due to the obstruction encountered on our visit.", "publishedDate": "2019-06-30", "language": "en", "rating": 4}, {"id": 685104887, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d243171-r685104887-Arc_de_Triomf-Barcelona_Catalonia.html", "text": "Not sure what it celebrates. Interesting style. At the top of wide pedestrian plateau running down to Parc Ciutadella. Trees, shade, buskers.", "publishedDate": "2019-06-28", "language": "en", "rating": 4}, {"id": 684873739, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d243171-r684873739-Arc_de_Triomf-Barcelona_Catalonia.html", "text": "Beautiful and historical! It was right by our hotel or we may not have chosen this as a spot to see with only two days in Barcelona. But I'm glad we did. In the adjoining park there were musicians, a man making huge bubbles with bubbles blowing everywhere, and a general happy atmosphere. The arc is much larger than it looks in pictures. Definitely worth seeing!", "publishedDate": "2019-06-27", "language": "en", "rating": 5}, {"id": 684400308, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d243171-r684400308-Arc_de_Triomf-Barcelona_Catalonia.html", "text": "Nothing much to do or say once you know the historical and cultural significance of the structure.\n\nThe area is good for a morning walk on the way to the Ciutadella Park.", "publishedDate": "2019-06-25", "language": "en", "rating": 4}, {"id": 682863663, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d243171-r682863663-Arc_de_Triomf-Barcelona_Catalonia.html", "text": "A good sight to see if have a spare moment. Has a beautiful park close by which is also nice to have a walk though or to chill out in. ", "publishedDate": "2019-06-20", "language": "en", "rating": 4}, {"id": 681818020, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d243171-r681818020-Arc_de_Triomf-Barcelona_Catalonia.html", "text": "When we were walking to the Sagrada Familia we walked by the Arc de Triomf. It's very nice and in a good state and connected to the park.", "publishedDate": "2019-06-16", "language": "en", "rating": 4}, {"id": 680739588, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d243171-r680739588-Arc_de_Triomf-Barcelona_Catalonia.html", "text": "Triumphal arch built as the entrance to the 1888 World Fair that gives way to the Ciutadella Park. Great place for a photo op early in the morning when no one is around and the sun is shining bright.", "publishedDate": "2019-06-11", "language": "en", "rating": 4}, {"id": 679574607, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d243171-r679574607-Arc_de_Triomf-Barcelona_Catalonia.html", "text": "We loved it! A huge building, that looks lovely, a bit smaller than the one in Paris. Around it, you will see a lot of green parts and places to relax. Very nice!", "publishedDate": "2019-06-06", "language": "en", "rating": 5}, {"id": 679129395, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d243171-r679129395-Arc_de_Triomf-Barcelona_Catalonia.html", "text": "This arc reminds all of the other arcs in the world. It reminds the sacrifices of the citizens of that city to keep it safe and intact.", "publishedDate": "2019-06-05", "language": "en", "rating": 5}, {"id": 677873715, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d243171-r677873715-Arc_de_Triomf-Barcelona_Catalonia.html", "text": "It is an interesting monument that is impressive, but dark. It is located in a beautiful park. We just stumbled across it. I would not seek it out. ", "publishedDate": "2019-05-31", "language": "en", "rating": 4}, {"id": 677835351, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d243171-r677835351-Arc_de_Triomf-Barcelona_Catalonia.html", "text": "We stayed just 2 minutes away from this beautiful Arc at a great hotel ( Hotel Rec 4 nights)  Since this Arc is in a beautiful park and right across from the metro/train station and several bus stops it's a great landmark for getting your bearings around this part of Barcelona.", "publishedDate": "2019-05-31", "language": "en", "rating": 4}, {"id": 677387052, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d243171-r677387052-Arc_de_Triomf-Barcelona_Catalonia.html", "text": "I never knew that Barcelona had its own Arc de Triomf. The are and the surrounding is nice for a walk and it is pretty close to the Zoo if You are into it. But the Arc itself is nothing special in my opinion. ", "publishedDate": "2019-05-29", "language": "en", "rating": 3}, {"id": 676971417, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d243171-r676971417-Arc_de_Triomf-Barcelona_Catalonia.html", "text": "This is a very nice and Interesting piece of art located right before an awesome park. I took one of my favorite pictures here. It looked even nicer up close.", "publishedDate": "2019-05-27", "language": "en", "rating": 5}, {"id": 676888634, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d243171-r676888634-Arc_de_Triomf-Barcelona_Catalonia.html", "text": "Unless you're big on Imperial history or military history, no need to go out of your way to see it. It's in the middle of a large, main thoroughfare in central Barcelona as you walk towards Barceloneta and you'll probably fall across it as you wander about anyway. It's very monumental, of course, but is set in quite nice gardens. So it is a pleasant place for a stroll.", "publishedDate": "2019-05-27", "language": "en", "rating": 3}, {"id": 676756388, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d243171-r676756388-Arc_de_Triomf-Barcelona_Catalonia.html", "text": "Very plesent for a stroll anytime of the day/night anytime of the year, no better way to explore one of the main roads in this area of Barcelona", "publishedDate": "2019-05-27", "language": "en", "rating": 5}, {"id": 676715728, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d243171-r676715728-Arc_de_Triomf-Barcelona_Catalonia.html", "text": "This Arc is located near la cuitadella park. Surrounded by clean and spacious pedestrian spaces, it is easy to visit and photograph.\n\nMade of brick and contains symbols of the city.\n\nWorth a visit while in the area.  It far from the town’s center.", "publishedDate": "2019-05-26", "language": "en", "rating": 4}, {"id": 676350330, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d243171-r676350330-Arc_de_Triomf-Barcelona_Catalonia.html", "text": "Title says it all. The surrounding area is very well put together, clean and functional. There wasn’t an overwhelming amount of people here either which made seeing and taking pictures of the structure very easy.", "publishedDate": "2019-05-25", "language": "en", "rating": 5}, {"id": 675602048, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d243171-r675602048-Arc_de_Triomf-Barcelona_Catalonia.html", "text": "Built apparently for the world fair in the 1800s,it leads to the park. Another impressive monument in this impressive city.", "publishedDate": "2019-05-21", "language": "en", "rating": 4}, {"id": 674747853, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d243171-r674747853-Arc_de_Triomf-Barcelona_Catalonia.html", "text": "The name Arc de Triomf conjurs up visions of the neoclassical stone Arc de Triomphe in Paris or Marble Arch in London.\n\nThis is different.  Architect Josep Vilaseca decided to create something more Spanish, constructed in brick, and stylistically referencing the historic mudejar style found in southern Spain.\n\nThe decorations show Barcelona welcoming the different nations to the exhibution, along with friezes representing agriculture, industry, commerce and art.\n\nThe arch stands at the top of a long path in the Passeig de Lluis Companys, a popular park by day and night, with sculptures at the end, before you cross the road to the Parc de la Cuitadella, worth exploring, where the Universal Exhibition itself was held.  ", "publishedDate": "2019-05-18", "language": "en", "rating": 4}, {"id": 672640008, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d243171-r672640008-Arc_de_Triomf-Barcelona_Catalonia.html", "text": "My girlfriend and I were walking in the Gothic area when we saw a sign showing * Arc de Triomf * . Curious, we decided to go this way and what a lovely surprise when we saw this beautiful architecture !! All around it the place is wonderful, with trees and grass everywhere .\nIts definitely worth it", "publishedDate": "2019-05-08", "language": "en", "rating": 5}, {"id": 671993137, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d243171-r671993137-Arc_de_Triomf-Barcelona_Catalonia.html", "text": "This  Arc de Triomf was built as the gateway to the 1888 World Fair, so it was intended to welcome people, rather than celebrate military triumphs, as other similar Arches do, like the one in Paris or in London. It is a little different, as it is built in red brick which really gives it a striking presence! It has friezes on its walls which depict representations from agriculture, industry, trade and similar areas, all related to the  World Trade Fair of 1888.", "publishedDate": "2019-05-06", "language": "en", "rating": 4}, {"id": 671483018, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d243171-r671483018-Arc_de_Triomf-Barcelona_Catalonia.html", "text": "My husband and I visited here on 7/13/18.  Coming out of a site we had just toured I noticed a street sign pointing the way to the Arc de Triomf.  So we thought we'd take a look.  Took us a nice 15-20 minutes walk.  \n\nThere it was.  Huge arch.   Main entrance gate to the 1888 World's Fair held in Parc de la Ciutadella/Citadel Park.  Designed by Josep Vilaseca i Casanovas in the neo Mudejar style.  30 meters tall. Red brick.  Stone friezes above shows Barcelona welcoming nations to the exhibition.  Shields of 49 provinces of Spain.  Coat of Arms of Barcelona.  Repeated symbols.  Bats-King Jaume's lucky charm.  Sides-carvings of agricultural and industrial, trade and arts.  \n\nEntering the park from the Arc de Triomf you will find a big green space-home to the Barcelona Zoo, a museum of geology, a greenhouse.....", "publishedDate": "2019-05-04", "language": "en", "rating": 4}, {"id": 670778774, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d243171-r670778774-Arc_de_Triomf-Barcelona_Catalonia.html", "text": "Arc de triomf is an impressive and beautiful monument. But all around it is also absolutely beautiful. You can have nice walks at any time of the day and just chill and relax and maybe find the perfect spot!", "publishedDate": "2019-05-01", "language": "en", "rating": 5}, {"id": 668832774, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d243171-r668832774-Arc_de_Triomf-Barcelona_Catalonia.html", "text": "We have been staying in Barcelona just around the corner from this beautiful building on Carrer Roger de Flor so passed it each day on our way from and back to the apartment.\nIt be came ‘ our’ arc de Triomf during our stay.\nThere was always something to see and watch each day- dance, singing, puppets and more.\nThe walk through the park was lovely and We looked forward to it each day.\nThere is a stop here on the Hop on/ off bus route.", "publishedDate": "2019-04-24", "language": "en", "rating": 5}, {"id": 668021343, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d243171-r668021343-Arc_de_Triomf-Barcelona_Catalonia.html", "text": "Free.\nVisit Duration: 30 minutes.\nLocation: Passeig de Lluís Companys,  Barcelona, Spain (Close to Cituadella Park)\n\nThe Arc de Triomf was the main access gate for the 1888 Barcelona World Fair. The arch is leading to the world fair (Now ciutadella Park). It is a non-military Arc. It does not celebrate the country's military victories.\n\nThe arch is built in reddish brickwork. \nThe combination of red brick with the series of friezes around the arch, make it a singularly beautiful landmark.\n\nThere are reliefs on one side symbolising agriculture and industry, and commerce and art on the other. At the top of the arch the shields of the 49 Spanish provinces are presided over by the coat of arms of the city of Barcelona.\nThe Arc is decorated with four monumental friezes:  ‘Barcelona’ (depicted as a woman) can be seen welcoming the nations to the Exposition. On the opposite side, she gives out medals to participants at the festival. On the North-East façade a depiction of art and commerce; while the South-West face displays images of agriculture and industry.", "publishedDate": "2019-04-21", "language": "en", "rating": 4}, {"id": 667742884, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d243171-r667742884-Arc_de_Triomf-Barcelona_Catalonia.html", "text": "The Arc d Triomf is a very attractive sculpture  in Barcelona .It was built as the entrance gate to the 1888 World Fair. We took a walk from the arch to the Park de la Ciutadella along the Passeig Lluís Companys.The views were awesome with the palm trees and the intricate design of the lampposts.Definitely one of my top favorites in this beautiful city.", "publishedDate": "2019-04-19", "language": "en", "rating": 5}, {"id": 667446564, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d243171-r667446564-Arc_de_Triomf-Barcelona_Catalonia.html", "text": "Built for the 1888 Barcelona World Fair, and still standing proudly over the wide central promenade of the Passeig de Lluís Companys, leading to the Ciutadella Park that now occupies the site of the world fair. The craftsmanship of the arch, street lights and the other artwork is magnificent.", "publishedDate": "2019-04-18", "language": "en", "rating": 5}, {"id": 666255947, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d243171-r666255947-Arc_de_Triomf-Barcelona_Catalonia.html", "text": "I was impressed by the Arc De Triomphe of Barcelona - one of the most famous monuments of Barcelona. As is known, in some cities of the world there are similar Triumphal arches. However, only in Barcelona, it is completely made of red brick.  ", "publishedDate": "2019-04-14", "language": "en", "rating": 5}, {"id": 664979797, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d243171-r664979797-Arc_de_Triomf-Barcelona_Catalonia.html", "text": "This is a beautiful arch and a great place to start your walk into the park. Great place to take pictures and has its own metro station. ", "publishedDate": "2019-04-09", "language": "en", "rating": 5}, {"id": 664753179, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d243171-r664753179-Arc_de_Triomf-Barcelona_Catalonia.html", "text": "This is a part of a park actually it leads you to the park. Easy to reach by tube and there are plenty of benches to relax and observe locals and tourists.", "publishedDate": "2019-04-08", "language": "en", "rating": 4}, {"id": 662293774, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d243171-r662293774-Arc_de_Triomf-Barcelona_Catalonia.html", "text": "One of the more unique arches as it is build out of red brick. Absolutely beautiful. Located in a great spot, people just relaxing or walking their dogs. Such a nice atmosphere.", "publishedDate": "2019-03-30", "language": "en", "rating": 4}, {"id": 661182921, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d243171-r661182921-Arc_de_Triomf-Barcelona_Catalonia.html", "text": "I got robbed today, sitting in the sun, enjoying the music and ambiance.  I sat down on a bench to feed the pigeons. I set my backpack down and had my eyes on the pigeons for 10 seconds and turned around and the BLUE Camelback brand backpack was gone.  I am so distressed by this event, it has profoundly made me loose faith in humanity.  It was not crowded, I am an experienced traveler, so be aware!", "publishedDate": "2019-03-25", "language": "en", "rating": 5}, {"id": 660417402, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d243171-r660417402-Arc_de_Triomf-Barcelona_Catalonia.html", "text": "Decided to go for an evening walk to see the Arc de Triomf, absolutely stunning all lit up at night. Very quiet, so got loads of good photos. Felt very safe walking around the area.", "publishedDate": "2019-03-22", "language": "en", "rating": 4}, {"id": 660342814, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d243171-r660342814-Arc_de_Triomf-Barcelona_Catalonia.html", "text": "I love this area and I love this arc. It is a place where you can relax and there are lots of bars and restaurants not too far away.\n\nIt is near the zoo and the Parc de la Ciutadella. You can walk directly from here across the road. You can sit here and watch the world go by.\n\nThere is always a lot going on in or around the place. Worth a walk down and a sit down to see what happens along the walk way. People spotting.\n\nThe Barcelona marathon passes under this arch back to the finish.", "publishedDate": "2019-03-22", "language": "en", "rating": 5}, {"id": 660062485, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d243171-r660062485-Arc_de_Triomf-Barcelona_Catalonia.html", "text": "Beautiful architecture and an interesting new place with many street performers, also loved seeing birds nesting up on the arch.", "publishedDate": "2019-03-21", "language": "en", "rating": 5}, {"id": 658184878, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d243171-r658184878-Arc_de_Triomf-Barcelona_Catalonia.html", "text": "Went for a walk from our hotel and stumbled across this. The Arc de Triomf is situated within a large paved area and a park. The Arch is nice and good if you want some photo opportunities. Lovely area for a stroll. ", "publishedDate": "2019-03-13", "language": "en", "rating": 4}]}}]