[{"locationId": 2223636, "name": "MEAM Museu Europeu d'Art Modern", "placeType": "ATTRACTION", "reviewListPage": {"reviews": [{"id": 730892381, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d2223636-r730892381-MEAM_Museu_Europeu_d_Art_Modern-Barcelona_Catalonia.html", "text": "I really enjoyed MEAM -- it well exceeded my expectations; and, located just around the bend and a negligible few footsteps away from Museu Picasso, provided an excellent, exciting, and contemporary counterpoint to the great 20C master's work.\n\nFirst, a disclaimer: I don't know about you...but so much of what passes for \"contemporary art\" leaves me flat-out cold and bewildered.    Happily, MEAM was a surprising antidote to all that flotsam. Here, exciting and emotive figurative art holds sway!  \n\nWhile the museum's building (a former villa) was interesting in and of itself, its permanent and temporary exhibits of contemporary figurative art drew me in. The temporary exhibit (sadly, however, finished as of 1 December) of works by Pedro del Toro, a brilliant and accomplished contemporary Spanish artist, was just as riveting as some of El Greco's and Rubens's priceless figurative paintings that I later admired in the Prado Museum. I trust that MEAM will continue to offer shows of similarly high quality in the future, and that modern European painters will continue to excite!", "publishedDate": "2019-12-05", "language": "en", "rating": 5}, {"id": 726944668, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d2223636-r726944668-MEAM_Museu_Europeu_d_Art_Modern-Barcelona_Catalonia.html", "text": "The museum has a small but interesting permanent collection (1 floor) plus another 1-and-a-bit floors of temporary space — maybe worth an hour to visit.  I stayed for a concert and it was brilliant.  Very enjoyable.", "publishedDate": "2019-11-16", "language": "en", "rating": 5}, {"id": 715833112, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d2223636-r715833112-MEAM_Museu_Europeu_d_Art_Modern-Barcelona_Catalonia.html", "text": "This was a really nice museum.  It’s not particularly large but really nice modern art.  There was a Julia Mathiu exhibit while I was there and it was fabulous.  The building was also quite nice.  I highly recommend this for about an hour stop.  The sculptures were also really good.  I highly recommend this for art lovers.  ", "publishedDate": "2019-10-06", "language": "en", "rating": 5}, {"id": 710516833, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d2223636-r710516833-MEAM_Museu_Europeu_d_Art_Modern-Barcelona_Catalonia.html", "text": "We kept quite busy with museums when in Barcelona, but this is one I want to recommend, it is right next to the Picasso museum, but really easy to miss as it is on a side road and maybe a little anonymous.\nWith that said I think it is well worth a visit, and you are already in the neighbourhood, right? I think you will found at least a few pieces that you will find intriguing and interesting. I found a few favorites at least, but this of course also is the type of art that I found most interesting, but even if this is not your cup of tea, I still think you should give it a chance!", "publishedDate": "2019-09-17", "language": "en", "rating": 5}, {"id": 698513484, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d2223636-r698513484-MEAM_Museu_Europeu_d_Art_Modern-Barcelona_Catalonia.html", "text": "Amazing museum! Lots of cool artists.\nAll the paintings and sculptures are astonishing and awe-inspiring from the beginning til the end. Everything is impressive. The tour can be completed in less than an hour, but we spent there more than 2hours. Highly recommend", "publishedDate": "2019-08-13", "language": "en", "rating": 5}, {"id": 691417141, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d2223636-r691417141-MEAM_Museu_Europeu_d_Art_Modern-Barcelona_Catalonia.html", "text": "Just few steps from Picasso museum... Yet nearly nobody knows that. You need to look for it carefully, it is hidden in the small street of the old city. Compact space - 3 small floors to explore. Yet we liked this very much! The exhibition we admired was ModPortrait 2018, showing the winners for the contest for modern, realistic portrait. Indeed, some were realistic, some - hiperrealistic, all of them - worth knowing. Afters years of neglecting realistic arts, what a change! Brand new approach to painting, a lot of emotions, secret stories... We will be happy to came back to this place for more, as soon as we visit Barcelona again! Practical hint: no shop, nor cafe available. However, in the lobby there is a nice cold place, and you may bring your coffee from cafe round the corner.", "publishedDate": "2019-07-21", "language": "en", "rating": 5}, {"id": 689146608, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d2223636-r689146608-MEAM_Museu_Europeu_d_Art_Modern-Barcelona_Catalonia.html", "text": "The true meaning of a hidden gem. Very quiet when I visited on a 4pm Friday afternoon. I wasn't expecting much after my visit to the 'other' modern art museum in Barcelona but his place was one of the better art museums I have seen of late - provocative, thought provoking, dark and beautiful! It's over 3 floors - but the top floor is just a single room, so it won't take you longer than an hour, longer if you get caught up in the artwork like I did. Good value for 9 Euros. Go and see it for yourself. Note: if you have younger children, there is a high level of nudity. ", "publishedDate": "2019-07-13", "language": "en", "rating": 5}, {"id": 685427628, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d2223636-r685427628-MEAM_Museu_Europeu_d_Art_Modern-Barcelona_Catalonia.html", "text": "This small museum has rotating shows and seemingly very little permanent collection.  After being to large museums like the Picasso or the Prado it’s a nice (and relatively inexpensive) way to see the works of living artists.  There are few tourists or guards throughout the museum so you can freely share comments with a companion.  The show there now has artists from around the world although Spanish works are predominate. ", "publishedDate": "2019-06-30", "language": "en", "rating": 4}, {"id": 677556706, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d2223636-r677556706-MEAM_Museu_Europeu_d_Art_Modern-Barcelona_Catalonia.html", "text": "even if you don't like art but wish to appreciate the art world of the modern area this is a great place to enjoy\n\nadmire some, scoff at others but it's an interesting place to see a range of different art", "publishedDate": "2019-05-30", "language": "en", "rating": 4}, {"id": 674278363, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d2223636-r674278363-MEAM_Museu_Europeu_d_Art_Modern-Barcelona_Catalonia.html", "text": "This museum is an absolute gem that gets missed by a lot of tourists. The exhibits rotate but are always the latest in great art, and will definitely widen your eyes.\nFull video review at TravelClast on Youtube", "publishedDate": "2019-05-15", "language": "en", "rating": 5}, {"id": 669233379, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d2223636-r669233379-MEAM_Museu_Europeu_d_Art_Modern-Barcelona_Catalonia.html", "text": "having just been bored nearly to death by the Picasso museum, visiting this museum gave so much interest and pleasure that it made the cartoon art of the late Picasso era fade to insignificance along side the presentations in this near bye museum. It was gorgeous.\nThe principal show at the time of our visit last week was from a selection of  Chinese modern realism - simply spectacular, thought provoking , and beautiful. On the upper levels of the gallery there was (still ) an international collection of modern realism. As the shows apparently change with a degree of regularity, one can come back each time traveller returns to Barcelona. Inexpensive, varied, stunning, modernist, all very enjoyable ie it is an alive art gallery.\n\nWell worth the nine euros, especially so for those who value thought provoking realism. The current show on the first level is from a number of Chinese artists of truly wonderful thought provoking realism.  ", "publishedDate": "2019-04-25", "language": "en", "rating": 4}, {"id": 668105825, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d2223636-r668105825-MEAM_Museu_Europeu_d_Art_Modern-Barcelona_Catalonia.html", "text": "Love this small museum close to Picasso and really fun for quick walk through without spending hours there.  We have been several times and the art changes often so we joined as members. They have jazz on Friday nights for €14 or so in a small room upstairs.  We’ve enjoyed each show we’ve seen there as well as the wine, cava and beer they serve while your there.  Check it out!", "publishedDate": "2019-04-21", "language": "en", "rating": 5}, {"id": 656792359, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d2223636-r656792359-MEAM_Museu_Europeu_d_Art_Modern-Barcelona_Catalonia.html", "text": "A very nice museum with much contemporary figurative art.\nYou can look at it all in peace as there are not many people.\nVery nice. Worthwhile. Just a few yards from the Picasso museum.", "publishedDate": "2019-03-06", "language": "en", "rating": 5}, {"id": 655827713, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d2223636-r655827713-MEAM_Museu_Europeu_d_Art_Modern-Barcelona_Catalonia.html", "text": "This museum is in the city center.  Highly recommend for a quick visit to a very impressive museum.  The art is amazing.  Very impressive surreal art.  The paintings in particular are hyper realistic.", "publishedDate": "2019-03-02", "language": "en", "rating": 5}, {"id": 654512034, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d2223636-r654512034-MEAM_Museu_Europeu_d_Art_Modern-Barcelona_Catalonia.html", "text": "This little museum is housed in an 18th century palace. We came for a concert of Argentine music (which was lovely) and then toured the two floors of the museum. The contemporary works on display when we attended were prize-winners of the Art Renewal Center Salon, an organization representing realism in art. The paintings were a spectacular collection of that genre. Some of them were difficult to distinguish from photographs. The permanent collection contains works of 21st century artists. There are also art classes, which make great subjects for your photographs. So glad we found this little jewel of a museum.", "publishedDate": "2019-02-24", "language": "en", "rating": 5}, {"id": 645805152, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d2223636-r645805152-MEAM_Museu_Europeu_d_Art_Modern-Barcelona_Catalonia.html", "text": "This museum is a real hidden gem!  It was recommended to us by an artist sitting next to us on the plane.  It is a small museum around the corner from the Picasso Museum.  The paintings and the sculptures are VERY realistic - almost photographs.  Fascinating.  And there are wonderful concerts in the museum on Friday night (blues/jazz) and Saturday night (classical).  A definite go!", "publishedDate": "2019-01-14", "language": "en", "rating": 5}, {"id": 643142380, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d2223636-r643142380-MEAM_Museu_Europeu_d_Art_Modern-Barcelona_Catalonia.html", "text": "As stated in another report, this is only a few minutes from the Picasso museum. It is saved out over 4 floors and there is no sense of pressure to move quickly. The art styles are markedly different and includes sculptures and photographs through to typical portraiture. There are places to sit and appreciate and, I think, for anyone who enjoys art, this is money (not expensive) and time well spent. ", "publishedDate": "2019-01-02", "language": "en", "rating": 4}, {"id": 642157187, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d2223636-r642157187-MEAM_Museu_Europeu_d_Art_Modern-Barcelona_Catalonia.html", "text": "Attended a blues music concert in Barcelona - absolutely brilliant night of music in a lovely location. The museum entrance is set in a beautiful old street in the old town. Also surrounded by many bars and restaurants. The concert lasted around 90mins with a short interval. Excellent soul and blues classics sung by a superb singer and band. Highly recommended. We did this as an alternative to the guitar concerts we usually attend at this time of year and didn’t regret it. A must see for any visit let to Barca. The ticket price also includes a visit to the museum. Excellent value all round. After we visited a local tapas restaurant in Born - review to follow!!! ", "publishedDate": "2018-12-29", "language": "en", "rating": 5}, {"id": 638443529, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d2223636-r638443529-MEAM_Museu_Europeu_d_Art_Modern-Barcelona_Catalonia.html", "text": "I was surprised to find an exhibition of hyper realist paintings that, while technically superb, are not what I enjoy. The museum is small so doesn't take long to explore.", "publishedDate": "2018-12-09", "language": "en", "rating": 3}, {"id": 621881110, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d2223636-r621881110-MEAM_Museu_Europeu_d_Art_Modern-Barcelona_Catalonia.html", "text": "The MEAM is located very close to the Picasso Gallery.  The entrance contains a few interesting sculptures but is not very enticing so I was a bit dubious about it.  As I wandered around the collection housed in a somewhat run down palace over three floor I was totally won over.  The collection is modern but it is art in the traditional sense.  The paintings and sculptures contain modern themes.  Some of the paintings are so life like you would confuse them as photographs.  The sculptures capture modern life.  Highly recommend this gallery especially if you are attending the Picasso Gallery.  A lovely way to spend 1-2 hours.", "publishedDate": "2018-10-03", "language": "en", "rating": 4}, {"id": 611225129, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d2223636-r611225129-MEAM_Museu_Europeu_d_Art_Modern-Barcelona_Catalonia.html", "text": "Really pulled together a huge collection of work around the theme and set that out comfortably in a nicely proportioned space in an interesting building. It was quiet and relaxing in contrast to the Picasso museum just around the corner which is great but busy.", "publishedDate": "2018-08-27", "language": "en", "rating": 4}, {"id": 607267760, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d2223636-r607267760-MEAM_Museu_Europeu_d_Art_Modern-Barcelona_Catalonia.html", "text": "Museum situated in a very interestingly looking building - there's much more to lay eye on than just canvases. Generally paintings show a great asset of artists technical skills, most of them are portraits what makes the exhibition accessible for everyone. \nMuseum itself isn't big, however its size is just right for visitors to keep attention and get satisfied. Stuff is very friendly - I appreciated listening Olafur Arnalds music when contemplating art pieces, thank you MEAM for making my birthday even more special ;) Would certainly recommend it to everyone.", "publishedDate": "2018-08-17", "language": "en", "rating": 5}, {"id": 604036138, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d2223636-r604036138-MEAM_Museu_Europeu_d_Art_Modern-Barcelona_Catalonia.html", "text": "We were here at the opening so almost all alone. We really enjoyed the museum - and the building is beautiful. Only be aware that the museum is a really small one.", "publishedDate": "2018-08-07", "language": "en", "rating": 3}, {"id": 601981736, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d2223636-r601981736-MEAM_Museu_Europeu_d_Art_Modern-Barcelona_Catalonia.html", "text": "We visit this small museum every time we are in Barcelona.  \nThe exhibits are well worth a visit as is the building itself. \nIt is located very close to the Picasso museum. \nIt does not have large crowds so one can easily enjoy the artworks in peace. ", "publishedDate": "2018-08-01", "language": "en", "rating": 5}, {"id": 597882646, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d2223636-r597882646-MEAM_Museu_Europeu_d_Art_Modern-Barcelona_Catalonia.html", "text": "Being a lover of contemporary art I had high hopes for this place based on previous reviews. However, on reading the pretentious statements on the walls of the stairs leading into the exhibition my expectations dropped... \"We must achieve a language to create a genuine art of our century. And this we have not yet achieved\"...certainly not if the contents of this place are anything to go by. It is essentially a portrait gallery with a little bit of sculpture. Some of the hyper-realism paintings are great but most are very very dull indeed, sometimes bordering on kitsch. There were so many fuzzy nudes it sometimes felt like I'd walked into a live 'Mills & Boon' book cover. I also couldn't bear the 'musak' being pumped in throught the gallery. I'm a classical musician by trade and whilst I like a bit of minimalism, with no context or information of what was playing, it all sounded a bit 'beige' and added nothing to the enjoyment of the art. If you're a lover of contemporary art, give this place a miss and visit MACBA or CCCB instead - they both do it SO much better than this place which delivers quantity over substance and with its choices dominated by someone with questionable and incredibly conservative taste... ", "publishedDate": "2018-07-20", "language": "en", "rating": 1}, {"id": 592949647, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d2223636-r592949647-MEAM_Museu_Europeu_d_Art_Modern-Barcelona_Catalonia.html", "text": "we bought a pass for this musee as its small and interesting and fun.  the art is modern and exhbits are changed often to keep it interesting.  Nice intimate spot for classical music on Saturdays and Jazz/blues on Fridays at 6 for a very reasonable fee.  friendly staff and nice cava available at the shows.", "publishedDate": "2018-07-04", "language": "en", "rating": 5}, {"id": 587693481, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d2223636-r587693481-MEAM_Museu_Europeu_d_Art_Modern-Barcelona_Catalonia.html", "text": "Our first day in Barcelona was capped by an evening at the museum and a classical guitar concert in one of the halls.  Delightful and charming and civilized.  Treat yourself and go.", "publishedDate": "2018-06-15", "language": "en", "rating": 5}, {"id": 581089534, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d2223636-r581089534-MEAM_Museu_Europeu_d_Art_Modern-Barcelona_Catalonia.html", "text": "This is a lovely place to visit.  It’s like a visit to the the BP Portrait Award at the National Portrait Gallery in London and every painting you like or even love!\nDon’t bother with the long boring queues for the Picasso museum if you like art.  Spend your time in this little gem and also visit the National Art Museum of Catalonia. You will not be disappointed. ", "publishedDate": "2018-05-18", "language": "en", "rating": 5}, {"id": 571337565, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d2223636-r571337565-MEAM_Museu_Europeu_d_Art_Modern-Barcelona_Catalonia.html", "text": "Much smaller than the MOMA, and less crowded than the Picasso museum across the street, the MEMA is one of the pearls in Barcelona. \nI can't remember a museum where most of the exhibits there were interesting, amazing or funny like in MEAM.\nWe have been there with young children and teenagers (14, 11, 7 and 2), and it had been really great morning to all of us.", "publishedDate": "2018-04-05", "language": "en", "rating": 5}, {"id": 568677327, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d2223636-r568677327-MEAM_Museu_Europeu_d_Art_Modern-Barcelona_Catalonia.html", "text": "Well I am an amateur art collector and find myself living it Barcelona for 12 months. \nWe found MEAM today and love the place, staff really friendly, helpful and professional.  One room was closed for an art tutorial, but was opened for me to see the Lita Cabellut paintings I wanted to see.  We joined and became “annual friends” there and then.\nWe will be back soon\nThanks for making our day, loved the place!\nSimon, Montserrat, Scarlett 11 and Tristan 6", "publishedDate": "2018-03-25", "language": "en", "rating": 5}, {"id": 568339835, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d2223636-r568339835-MEAM_Museu_Europeu_d_Art_Modern-Barcelona_Catalonia.html", "text": "If you are going to Picasso museum, definitely stop by.  Wide range of modern art types, including sculpture and painting.  More accessible than some other modern art museums. I found a Groupon for this museum which was a deal.    Decent amount of nudes so might think about that if you have children.  ", "publishedDate": "2018-03-23", "language": "en", "rating": 4}, {"id": 550890672, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d2223636-r550890672-MEAM_Museu_Europeu_d_Art_Modern-Barcelona_Catalonia.html", "text": "Even if contemporary figurative art is not your cup of tea, you should go to this lovely site for the Friday & Saturday recitals that take place in the 18th century grand salon (classical music on Saturdays, and blues on Fridays). It's intimate, unpretentious yet classy, and the artists are quite good. I tend to prefer the classical music recitals which, btw, come with tea and cookies... I did see one Jazz Manouche recital, but was disappointed by the singer.                                                                                                                            Right now there is a special exhibit of the great sculptor Grzegorz Gwiazda’s works.                                                                                                                                The MEAM is steps away from the overcrowded and disappointing Picasso museum, in a great area full of delightful boutiques and restaurants.", "publishedDate": "2018-01-02", "language": "en", "rating": 4}, {"id": 548329809, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d2223636-r548329809-MEAM_Museu_Europeu_d_Art_Modern-Barcelona_Catalonia.html", "text": "Surprising collection of modern art in old town of Barcelona, close to the Picasso Museum. Excellent works of hyper realistic art exposed in a beautifully restaured palace right in the Borne (old part of Barcelona). It is worth a visit and so far it is not too frequented by the tourists!", "publishedDate": "2017-12-20", "language": "en", "rating": 5}, {"id": 548314148, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d2223636-r548314148-MEAM_Museu_Europeu_d_Art_Modern-Barcelona_Catalonia.html", "text": "We hace visited Meam 6 times in 3 years. Impressive and very personal collection of contemporary figurative art. Lots of hyper realists. Our favorite in BCN although none of the top world famous artists.", "publishedDate": "2017-12-20", "language": "en", "rating": 5}, {"id": 533165593, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d2223636-r533165593-MEAM_Museu_Europeu_d_Art_Modern-Barcelona_Catalonia.html", "text": "Late Summer afternoon in Barcelona, boiling hot and endless crowds of tourists...200m queue in front of Museum of Picasso and this place nearby almost empty. If you want to find a peaceful almost meditative place away from crowds even during the main season, there are at least two places to visit  : Poblenou Cemetery and MEAM. Fantastic experience, great works I could have stared at for hours! Coming back soon!", "publishedDate": "2017-10-15", "language": "en", "rating": 5}, {"id": 528231221, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d2223636-r528231221-MEAM_Museu_Europeu_d_Art_Modern-Barcelona_Catalonia.html", "text": "I discovered this place by accident after looking at the Picasso Museum website and decided to give it a visit, especially as its around the corner from the Picasso.\nThe works to view are superb ranging from oil paintings to sculptures and cover all kinds of subjects, some of which may not to be to all peoples tastes.\nI especially liked on the first floor the pieces had respect descriptions written by the artists which added to there appeal. Some were also available to purchase. \nI highly recommend a visit.", "publishedDate": "2017-09-29", "language": "en", "rating": 5}, {"id": 524185648, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d2223636-r524185648-MEAM_Museu_Europeu_d_Art_Modern-Barcelona_Catalonia.html", "text": "Like many people, we ended up here because we could not get into the Picasso Museum for Free Night. This turned out to be the coolest stumble on of our trip. Amazing exhibit of nudes and brush work like I have never witnessed. I also caught my photo of the trip here when I watched a Flamenco dancer through the window juxtaposed next to a nude male figure on a poster. This is really a cool museum and deserves a shout out. Contemporary art. Lots of nudes so if you have issues with the naked body, maybe not for you.", "publishedDate": "2017-09-13", "language": "en", "rating": 5}, {"id": 511726991, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d2223636-r511726991-MEAM_Museu_Europeu_d_Art_Modern-Barcelona_Catalonia.html", "text": "A great place with so many talented and interesting european artists. The best we have seen in many years! ", "publishedDate": "2017-08-12", "language": "en", "rating": 5}, {"id": 510937808, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d2223636-r510937808-MEAM_Museu_Europeu_d_Art_Modern-Barcelona_Catalonia.html", "text": "My boyfriend and I stumbled upon this gallery so we decided to give it a go (especially since the Picasso lines were so long and this was just nearby with no lines). It was a very large gallery which was surprising - the actual building wasn't very large but there was a vast collection of works; almost all of these works were portrait pieces or paintings/sculptures of people. I'm not sure if this is due to a current theme of the gallery or if it is the permanent focus, but it was interesting. \n\nHowever after seeing 200+ portraits (most of which were Spanish and European artists' works) it does blur all into one after a little while, and a larger variety of works/movements would've been appreciated. There are no super famous artists here, but the quality was high, and it is a beautiful building in itself making it worth the visit. We also saw that they do wine and dancing nights there which would've been great. \n\nIf you're going to Picasso, this would be nice to do along the way (or like us, instead of due to the long waits!) ", "publishedDate": "2017-08-10", "language": "en", "rating": 3}, {"id": 508998087, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d2223636-r508998087-MEAM_Museu_Europeu_d_Art_Modern-Barcelona_Catalonia.html", "text": "What a beautiful little museum right around the corner from the famous Picasso Museum.  This is a gem well worth visiting if you appreciate excellent work that is realistic in a more classically trained sense.  We visited several times and enjoyed an evening of music and flamenco there as well.  Highly recommend this little museum.  It's not huge, but well worth it.  ", "publishedDate": "2017-08-05", "language": "en", "rating": 5}, {"id": 506666110, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d2223636-r506666110-MEAM_Museu_Europeu_d_Art_Modern-Barcelona_Catalonia.html", "text": "A hidden Gem in the Gothic Quarter. We discovered this great gallery by chance. We were attracted to the figurative art class occurring at the entrance, and then found that there was to be a Flamingo and guitar performance that same evening. We experienced the most superb guitar and Flamengo performance with greatly talented performers with a glass of wine in an extraordinary historic building. The gallery art exhibits are also wonderful, presenting international figurative artists. A great find in Barcelona.", "publishedDate": "2017-07-28", "language": "en", "rating": 5}, {"id": 504033550, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d2223636-r504033550-MEAM_Museu_Europeu_d_Art_Modern-Barcelona_Catalonia.html", "text": "Fifth visit to Barcelona - and still I'm finding new and interesting museums.\nMEAM focuses on modern art, with an emphasis on paintings that are so well crafted that they almost seem to be photographs. Mainly paintings, some sculptures and a few mixed media.\nMany nudes, a few of which may disturb the more sensitive viewer.", "publishedDate": "2017-07-20", "language": "en", "rating": 4}, {"id": 502376411, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d2223636-r502376411-MEAM_Museu_Europeu_d_Art_Modern-Barcelona_Catalonia.html", "text": "A little museum with lots of contemporary (mostly erotic and body-oriented) art. Eclectic, very much liked it. But actually the most interesting part -and was drew our attention in the first place- was the cafe-concerts they organize throughout the summer every Saturday (I believe). 30' coffee & cakes (those could be a bit better in quality), then 60' of classical music, for a total of €19pp (17:30-19:00). Seating for around 30-40 people. Nice experience, recommended.", "publishedDate": "2017-07-15", "language": "en", "rating": 5}, {"id": 502334542, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d2223636-r502334542-MEAM_Museu_Europeu_d_Art_Modern-Barcelona_Catalonia.html", "text": "When going into this modern art museum, you're not going to get something which looks like a 10 year old was let loose with crayons and then charged a million.  The gallery is packed full of skillful and highly accurate depictions of modern life, or relatively recently painted images.  Some stunning artwork, some paintings being indistinguishable from photographs at distances of more than a few cm.  This was much more to my taste than the rather stuffy and more crowded Picasso museum across the street!", "publishedDate": "2017-07-15", "language": "en", "rating": 5}, {"id": 500805771, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d2223636-r500805771-MEAM_Museu_Europeu_d_Art_Modern-Barcelona_Catalonia.html", "text": "We went here because the Picasso Museum queue was extremely long.\nThe museum was almost entirely figurative art - hence a lot of portraits, mostly nudes, some of which were pretty grotesque and/or explicit. As I went with a work colleague that was a bit strange.\nThe building itself is very impressive, in particular the music room on the first floor.\nI was expecting a wider range of pictures and over a wider range of dates - mostly they were painted from 1990 and later.", "publishedDate": "2017-07-11", "language": "en", "rating": 3}, {"id": 491053829, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d2223636-r491053829-MEAM_Museu_Europeu_d_Art_Modern-Barcelona_Catalonia.html", "text": "If \"Modern European Art\" makes you think of work produced by European artists during the late 19th to mid-20th century, you will be very disappointed here, as I was. It's really a museum of \"Contemporary European Photorealist Portraiture.\" Look at the photos shared by other travelers. If the images don't appeal to you, don't go to this museum. That's all there is. And it's dreadful -- technically proficient but soulless. I ended up here because my husband read the (inexplicably) positive TA reviews and the museum we planned to visit was closed. I'll never visit a museum again without looking at photos of the collection. At least we had a nice walk in the Barri Gotic. Lesson learned. Don't make the same mistake we did!", "publishedDate": "2017-06-06", "language": "en", "rating": 1}, {"id": 490745090, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d2223636-r490745090-MEAM_Museu_Europeu_d_Art_Modern-Barcelona_Catalonia.html", "text": "Being able to paint something so realistically that looks like a photo has its merits. It is definitively a technical achievement. In this museum you will see many gifted artists who are able to depict a person in such way that you will ask yourself whether it is a painting or a picture. However, some of these art works fail to transmit any emotion to me. It is like when you go to a store to buy photo frames and they place a generic photo inside. In my point of view, good art should always generate a feeling. There were some hyperealistic works of art that achieved this. In addition to the monothematic content, another weakness is how cramped is the Museum. I think the museum will create a better experience if there is some rotation and some of the paintings are not presented to the public. Despite these shortcomings, I recommend the museum, I had a good time there.", "publishedDate": "2017-06-05", "language": "en", "rating": 4}, {"id": 488628529, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d2223636-r488628529-MEAM_Museu_Europeu_d_Art_Modern-Barcelona_Catalonia.html", "text": "MEAM is a gem of a Gallery on three floors with modern portraits that delight the eye as you stroll around nodding to the few other visitors who have determined to discover it's wonderful pieces.\n\nClose to the Picasso Museum it gives the visitor more than just a taste of modern Catalan portraiture. \n\nMany of the works in oils & acrylics are sublime and are complimented by fine statuary.\n\nThis is a Gallery that I will visit from now on whenever I am in Barcelona and one whose art will live long in my memory.\n\nEnjoy\nAnthony", "publishedDate": "2017-05-28", "language": "en", "rating": 5}, {"id": 482106036, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d2223636-r482106036-MEAM_Museu_Europeu_d_Art_Modern-Barcelona_Catalonia.html", "text": "We went here around noon after visiting the Picasso Museum (few meters away). During our visit we met only few other visitors...on the one hand it made our visit more enjoyable on the other it is a shame. This fantastic museum would deserve more recognition.\nNot only the art on display is fantastic but the whole atmosphere is so unique. The changes of colors and materials. Hyper-realistic paintings hanging on rustic walls....\nHighly recommended!", "publishedDate": "2017-05-06", "language": "en", "rating": 5}, {"id": 477148582, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d2223636-r477148582-MEAM_Museu_Europeu_d_Art_Modern-Barcelona_Catalonia.html", "text": "We came across this museum by accident whilst looking for the Picasso Museum, but as there was a large queue for that we went to MEAM instead. We weren't disappointed. The museum is beautifully designed, in a historic building, really well lit with atmospheric music playing throughout. Unlike other museums of modern art there were no pieces that left you scratching your head, just three floors of wonderful figurative pictures, mostly portraits, We were amazed that there only seemed to be two other visitors when we were there. The museum wasn't listed in my 2017 guide book either. This museum deserves to be better known as it's excellent.", "publishedDate": "2017-04-19", "language": "en", "rating": 5}, {"id": 475582877, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d2223636-r475582877-MEAM_Museu_Europeu_d_Art_Modern-Barcelona_Catalonia.html", "text": "This museum is just across from the Picasso Museum but had hardly any visitors. I like art and had some time to spare so headed in and couldn't have been more delighted. After the busyness of the aforementioned museum it was delightful to have all the time in the world to appreciate the paintings on the walls and the sculptures. Set in a stunning four storey building with a music room and an array of interesting art works, I highly recommend a visit. Not all of the art was to my taste but it was fantastic nonetheless.", "publishedDate": "2017-04-14", "language": "en", "rating": 5}, {"id": 475581986, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d2223636-r475581986-MEAM_Museu_Europeu_d_Art_Modern-Barcelona_Catalonia.html", "text": "Really nice collection, original and inspiring, if you visit Barcelona its a must to do . Localised in the center of the city, in the Born, you will love it, don't hesitate to go in !", "publishedDate": "2017-04-14", "language": "en", "rating": 5}, {"id": 474683875, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d2223636-r474683875-MEAM_Museu_Europeu_d_Art_Modern-Barcelona_Catalonia.html", "text": "One of the most awesome museum which I've ever visited.\nPerfect selection of contemporary artists, looking at this pieces you realized what art is alive.\nGreat atmosphere.\nHighly recommend to visit people who loves art.", "publishedDate": "2017-04-11", "language": "en", "rating": 5}, {"id": 469465935, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d2223636-r469465935-MEAM_Museu_Europeu_d_Art_Modern-Barcelona_Catalonia.html", "text": "MEAM is one of these places that deserve a visit, although it´s not so popular as others in Barcelona, being somehow what some would call a hidden gem. Located in the Born neighbourhood, a typical part of the city where interesting spots mix with sordid alleys, a few meters from the popular Museu Picasso, the MEAM is an original option for those who like arts. This Museum is devoted to figurative modern art, so you won´t find here the typical abstract works that leave so many people cold. It gives an alternative vision of contemporary art. The only downside, in my opinion, is its small size, considering that the ticket costs 9€. The building has only three floors: the first floor is devoted to a temporary exhibition of an outstanding catalan sculptor, the second and third, to the permanent collection, most of it made up by paintings, being the third floor just a couple of rooms. Anyway, the quality and variety of the paintings were amazing, most of them from contemporary Spanish artists as well as foreigners. I really enjoyed my visit and I highly recommend this museum.", "publishedDate": "2017-03-22", "language": "en", "rating": 4}, {"id": 456222441, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d2223636-r456222441-MEAM_Museu_Europeu_d_Art_Modern-Barcelona_Catalonia.html", "text": "Went along as heard read reviews saying the Friday night blues concerts were amazing. We were not disappointed! The ticket includes museum entry plus the concert and this was a great way to spend our first night in Barcelona. There was such a great atmosphere with people sitting with drinks and enjoying the music. Didn't know the date we picked was an Elvis night but it was amazing! The museum itself has an interesting selection of modern art. Definitely do the concert too though.", "publishedDate": "2017-01-31", "language": "en", "rating": 5}, {"id": 450515734, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d2223636-r450515734-MEAM_Museu_Europeu_d_Art_Modern-Barcelona_Catalonia.html", "text": "The museum has a great collection, and was lovely to walk around and take in all of the art. There is a really realistic piece with a screen above the painting showing a sped up video of the artist at work, without this you would think it was a photo. Worth the visit.", "publishedDate": "2017-01-08", "language": "en", "rating": 5}, {"id": 450260111, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d2223636-r450260111-MEAM_Museu_Europeu_d_Art_Modern-Barcelona_Catalonia.html", "text": "Don't be discouraged if you arrive early and the gate is down, you're in the right place.  It isn't well marked on the street.  This is a superb collection of realist, photorealist, surrealistic paintings--mostly of the human figure, with a scattering of still life and landscape.  In addition to the superb installation in a magnificent building, the other striking aspect of the museum is that all the work was created in the 21st century, much of it by artists in their 20s and 30s.  Their youth contrasted with \"traditional\" approaches, as well as an ancient building reimagined for today, make a visit to this museum an unforgettable experience.", "publishedDate": "2017-01-07", "language": "en", "rating": 5}, {"id": 447723289, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d2223636-r447723289-MEAM_Museu_Europeu_d_Art_Modern-Barcelona_Catalonia.html", "text": "Unlike most modern art, the works in this wonderful museum are mainly figurative, often highly detailed.  Some of the paintings could easily fool the eye into thinking they are photographs.  Within the genre of figurative art, the works displayed, including both paintings and sculpture, encompass a wide range of styles and mediums, and feature works by artists from around the world.  The galleries are nicely laid out, with interesting juxtapositions between various works.  When we visited, the museum was fairly empty, making it an even more enjoyable experience.  Highly recommended.", "publishedDate": "2016-12-30", "language": "en", "rating": 5}, {"id": 443498540, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d2223636-r443498540-MEAM_Museu_Europeu_d_Art_Modern-Barcelona_Catalonia.html", "text": "This museum was on our \"if we have time to get to it list\" - and it was superb.  Beautifully curated, full of gorgeous, thought provoking pieces in a lovely setting.  It was one of the highlights of our trip.", "publishedDate": "2016-12-11", "language": "en", "rating": 5}, {"id": 441205722, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d2223636-r441205722-MEAM_Museu_Europeu_d_Art_Modern-Barcelona_Catalonia.html", "text": "I visited museum Friday evening at about 6 p.m. and had an excellent opportunity to see Istvan Sandorfi exhibition. I would highly recommend it, especially to the fans of hyperrealism.", "publishedDate": "2016-11-30", "language": "en", "rating": 5}, {"id": 435798430, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d2223636-r435798430-MEAM_Museu_Europeu_d_Art_Modern-Barcelona_Catalonia.html", "text": "Close to the Picasso museum, the MEAM is definitely worth a visit. It displays figurative art, and it is always a pleasure to wander around its ample rooms,\n\nIt has got an excellent permanent collection and it keeps changing its displays, therefore every visit is different, plus there is a various choice of monographic exhibitions over the year.\n\nIf you are into easily \"understandable\" quality art, this is for you.", "publishedDate": "2016-11-09", "language": "en", "rating": 5}, {"id": 435061849, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d2223636-r435061849-MEAM_Museu_Europeu_d_Art_Modern-Barcelona_Catalonia.html", "text": "I visited this museum twice, the first time two years ago, and I enjoyed both times.\nThis is a museum only for modern figurative art. Sadly only few people visit here so it is a very peaceful place and you can fully enjoy the art.", "publishedDate": "2016-11-06", "language": "en", "rating": 4}, {"id": 432630932, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d2223636-r432630932-MEAM_Museu_Europeu_d_Art_Modern-Barcelona_Catalonia.html", "text": "Museum offers workshops for children. If interest you will need to contact in advance. We went there specialy for our 5 year old girl. She loved it. During this time we could  enjoy the exposition. ", "publishedDate": "2016-10-29", "language": "en", "rating": 5}, {"id": 431499756, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d2223636-r431499756-MEAM_Museu_Europeu_d_Art_Modern-Barcelona_Catalonia.html", "text": "Not a massive place so the exhibition can be taken up by one artist. When we went the artist was a little dark and morbid so not quite my cup of tea. However I have been on other occasions and enjoyed it so let thing to do is your research on the artists before you visit. ", "publishedDate": "2016-10-25", "language": "en", "rating": 3}, {"id": 423237813, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d2223636-r423237813-MEAM_Museu_Europeu_d_Art_Modern-Barcelona_Catalonia.html", "text": "We stumbled across this by accident when visiting the Musea Europea d'art Modern (MEAM) in the late afternoon. It was a perfect way to end the day, sipping wine and enjoying the performance of three excellent musicians. I wish our grown up kids could have been with us - they would have also enjoyed it! Quality art, music and wine.", "publishedDate": "2016-09-28", "language": "en", "rating": 5}, {"id": 421795486, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d2223636-r421795486-MEAM_Museu_Europeu_d_Art_Modern-Barcelona_Catalonia.html", "text": "The subject matter of 21st century figurative art seems specialised to this museum. No other museum seems to dedicate themselves to this or at least give much attention to it.  It could be a unique selling point.\n\nHowever, while I was there they were preparing a retrospective of Istvan Sandorfi.  This seems to necessitate putting the vast majority of their permanent collection into storage so could not get a sense of what their normal collection is like.  They do not appear to have dedicated exhibition space for this.  The exhibition was arranged over two small floors.\n\nThe price of entry is €9, which by comparison to other museums in Barcelona seems a lot.  The Picasso museum a stone throw away charges €11 but has much more on permanent display plus rotating exhibitions.  \n\nIt could be so much better.", "publishedDate": "2016-09-24", "language": "en", "rating": 2}, {"id": 421495355, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d2223636-r421495355-MEAM_Museu_Europeu_d_Art_Modern-Barcelona_Catalonia.html", "text": "This is worth a visit. A great building with lots of exhibition space. I didn't warm to the paintings on show but enjoyed the sculpture. Having said that the paintings were a good quality but I doubt the painter was a happy man. I found it quite depressing as an exhibition.\nIt's also a quiet oasis in a very busy part of town. There is a nice area to sit in the foyer but no cafe which is a shame.", "publishedDate": "2016-09-23", "language": "en", "rating": 3}, {"id": 416488966, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d2223636-r416488966-MEAM_Museu_Europeu_d_Art_Modern-Barcelona_Catalonia.html", "text": "MEAM is just moments away from the Museu Picasso but somehow wonderfully quiet. The gallery specialises in 21st Century figurative art. It's quite small, spread over four floors of varying sizes, but well worth the €10/€7(under 30s) ticket price. An unpretentious collection of impressive work with some serious talent on display. \nDuring our visit we were treated to live classical piano playing from the central room of the first floor, which was stunning and really complimented the curation of the gallery. \nA small gift shop with helpful staff - we would have bought more if there was wider selections on offer. \nThe building itself was utterly gorgeous and award wining, we learnt. We probably would have enjoyed looking around that without the art on display too. ", "publishedDate": "2016-09-09", "language": "en", "rating": 5}, {"id": 411561260, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d2223636-r411561260-MEAM_Museu_Europeu_d_Art_Modern-Barcelona_Catalonia.html", "text": "Cannot believe that it was nearly empty in the late afternoon on a Saturday. Beautiful building and amazing art. A much nicer experience than the Picasso museum - friendly staff, make your own way round, great value.", "publishedDate": "2016-08-27", "language": "en", "rating": 5}, {"id": 409933868, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d2223636-r409933868-MEAM_Museu_Europeu_d_Art_Modern-Barcelona_Catalonia.html", "text": "I enjoyed the whole experience of visiting this museum.  The building where the art is housed is beautiful--the combination of original architectural details with the modern lighting and different colored rooms was effective. Much of the art was grouped by theme, which added to the experience and interpretation.  Lots to think about in these rooms...", "publishedDate": "2016-08-24", "language": "en", "rating": 5}, {"id": 409542667, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d2223636-r409542667-MEAM_Museu_Europeu_d_Art_Modern-Barcelona_Catalonia.html", "text": "very disappointing museum, especially considering there are 2 world-class places just around the corner on c/montcada - amateur quality, derivative - the only thing to recommend the place is the building itself - lovely old palace - too bad the artworks are atrocious", "publishedDate": "2016-08-23", "language": "en", "rating": 2}, {"id": 393389497, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d2223636-r393389497-MEAM_Museu_Europeu_d_Art_Modern-Barcelona_Catalonia.html", "text": "A newer museum of 21st century figurative contemporary paintings and sculpture. Just around the corner from the Picasso museum but a bit hard to find.  None of the three guards in the Picasso museum I asked claimed to know how to get here - but that seemed typical of my interaction with staff at the Picasso museum.\n\n On three floors.  Easily accessible art but still contemporary.  Some beautiful works and actually more enjoyable than the crazy busy Picasso museum.  Generally large works and many of them very realistic.", "publishedDate": "2016-07-16", "language": "en", "rating": 5}, {"id": 393316923, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d2223636-r393316923-MEAM_Museu_Europeu_d_Art_Modern-Barcelona_Catalonia.html", "text": "Amazing elective modern art! Go, no line, and a great space, but, needs to look at entry cost, and more punters will come after all the waiting for Picasso musuem for so long if a couple of euro cheaper.", "publishedDate": "2016-07-16", "language": "en", "rating": 5}, {"id": 383443612, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d2223636-r383443612-MEAM_Museu_Europeu_d_Art_Modern-Barcelona_Catalonia.html", "text": "GPS was all over the place near here as it's in amongst tall buildings, but we found it eventually, and it was very worth it. Entry is 7 euros for students.\nIt is currently arranged in 3 floors. The first floor has a sculpture exhibition, the second a figurative art exhibition, and the third a workshop-style museum explaining some of the first floor. The whole gallery is bright and airy. It felt spacious, though we were the only visitors at the time.\nWhile the sculptures didn't blow me away the contemporary figurative art really did. Excellent exhibition I would recommend to anyone.\nThe pieces don't have any given context or analysis, so it might be worth buying a guide.\nThe only downside was the lighting/framing of some of the work was horrendous. For one painting in particular, I couldn't find any angle where the oil on a key part of the work didn't glisten distractingly. Surely they noticed this when setting up?\nThere are some adult themes dealt with, but if you're willing to confront them I also think this would be worthwhile for children. Each piece naturally asks the question of \"what story does this tell?\"\nTiny shop by the entrance with all the standard stuff - books, bookmarks, etc. Seemed appropriately priced.\nOverall I'd recommend.", "publishedDate": "2016-06-17", "language": "en", "rating": 4}, {"id": 381453058, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d2223636-r381453058-MEAM_Museu_Europeu_d_Art_Modern-Barcelona_Catalonia.html", "text": "Online we stumbled on a weekly Friday evening blues event at the MEAM in what was once a grand salon in the original palace, set up as a small dinner theatre with beverages and small snacks available. We got tickets for tonight's concert and were treated to the most phenomenal, energetic blues presentation by Wax & Boogie ( Ster Wax- Vocals; David Giorcelli- Piano; Reginald Vilardell- Drums).\nA performance from the heart, by all.\nThank you for a memorable last evening in Barcelona.", "publishedDate": "2016-06-10", "language": "en", "rating": 5}, {"id": 375208677, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d2223636-r375208677-MEAM_Museu_Europeu_d_Art_Modern-Barcelona_Catalonia.html", "text": "Going to Barcelona for the first time in years, I thought I would mug up on what art offerings were around. One of the major guidebooks (Rough Guide?) mentioned this one in its coverage of the barrio, almost as an afterthought. \n\nI wanted to visit as it shows modern figurative art only - that is, no abstracts and no old tellies and other stuff that should have gone straight to the tip. \n\nWalking to it, I was struggling to call to mind any other modern collection which excludes such works, managing only KogArt in Budapest (and there may have been a few abstracts there). \n\nI visited on a Friday morning in May, fighting my way past the hordes trying to get into the Picasso museum, a few steps further along the street to MEAM.\n\nIt must be pretty heartbreaking for the staff. While I was picking up a guide book, 3 or 4 people came in to ask where the PM was. Those people who did ask about MEAM itself seemed to be deterred by an admission fee the equivalent of 2 or 3 cups of coffee in St****cks. A real shame.\n\nMost kinds of figurative art are here but, principally, were are literally looking at oil or acrylic on canvas with a strong minority sculpture offering. \n\nOne floor was devoted to a special exhibition on a Catalan sculptor ( Josep Clara) but the permanent collection floor is the star of the show.\n\nWithout exception (and I wouldn't say that about many places) pieces here show talent in thought and execution, sometimes humour, sometimes other emotions. Some refer back to other painters (Ingres for nudes say) or to biblical or classical subjects.\n\nThere are portraits and self-portraits in different styles. Nudes are of a similar proprotion to more general exhibitions but landscape or cityscape do not figure to any great degree (although the one or two there are very good). Some of the sculpure is remarkable.\n\nOne needs to put away preconception of figurative art (and its subjects) as something that only happened in the past. And we are unused to modern paintings of contemporary situations (girls taking selfies or motor cars), so some of the subjects come as a shock. This says more about the policies of art galleries, and probably us, than the quality of paintings.\n\nPaintings such as Dresden (1990) by Marti Teixador, Vaticano IV (2014) by Josep Anaya, S/T (2013) by Carlos Marijuan (2013) or the modern interpretation of the Temptation of St Anthony by Jorge Villalba (2008) would be worth a pitch in any national collection.\n\nAnyway, if you can cope with two visits to galleries in Barcelona, go to this one (and MNAC, obviously). You can see equally good - or better - Picasso collections in lots of places.\n\nGo on, give it a try. You'll enjoy it. You won't get jostled here, either.\n\nTo the gallery - well done! and keep trying. I hope it all comes good and that people ask at the Picasso where YOU are!", "publishedDate": "2016-05-21", "language": "en", "rating": 5}, {"id": 374033525, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d2223636-r374033525-MEAM_Museu_Europeu_d_Art_Modern-Barcelona_Catalonia.html", "text": "we were in picasso museum and after visis it we suddenly found  museum of modern art only 50 metr. from picasso museum  very nice  and collection of modern art of 21-st century  with a concerts of live music- on friday blues  and on saturday in the same place. it was really very nice  but of tourists  after great picasso  don't see anything more. to our mind it was wonderful evening with very good blues and modern art price 14 euro and  reduced if you buy day before . very recommended  place!!!!!", "publishedDate": "2016-05-18", "language": "en", "rating": 5}, {"id": 371479320, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d2223636-r371479320-MEAM_Museu_Europeu_d_Art_Modern-Barcelona_Catalonia.html", "text": "What a truly wonderful gallery, right next to the Picasso Museum. It's very quiet, the staff were very inviting (which in my experience is rare in Barcelona) The collection was magnificent, I had the good fortune of seeing the Josef Clara exhibit while I was there.\n\nI cannot recommend this museum enough, it was breathtaking.", "publishedDate": "2016-05-09", "language": "en", "rating": 5}, {"id": 365826697, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d2223636-r365826697-MEAM_Museu_Europeu_d_Art_Modern-Barcelona_Catalonia.html", "text": "Went here because the Picasso Museum was packed with a major queue and it was a great decision.  Incredible 18th century palace turned 3-story museum space.  The Joseph Clara sculpture exhibit was very impressive.  The main floor was filled with hyper realism which I'd not seen so extensively before, and it was really striking.  I found it to be beautiful, exciting, evocative, and captivating.  Highly recommend, can see in just over an hour", "publishedDate": "2016-04-20", "language": "en", "rating": 5}, {"id": 364539759, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d2223636-r364539759-MEAM_Museu_Europeu_d_Art_Modern-Barcelona_Catalonia.html", "text": "We had originally wanted to get online tickets for the Picasso Museum, but the slots were full, so what to do on a Sunday? A friend of the Lady said you must go to the MEAM; now this is Modern Art as opposed to Contemporary Art. My only other introduction to Cotemporary was in Nice and my reaction was if I had the guts to exhibit stuff like that I could make a fortune. \nThis is so much different, and I suppose depending when you go to this museum the exhibitions might change. This is well worth a couple of hours of your time. Josep Clara was being exhibited and never having heard of him was well surprised by what I saw an read.\nFabulous place and relaxed as there were no queues or hassle in getting round. Being able to wander back and forth between the galleries and comparing style and work gave this place an A+.\nNice easy walk back thru the Gothic area and into the cathedral, really made a great Sunday.  \nAs an aside we did get into the Picasso on a walk in immediately after the MEAM (before noon). More on the Picasso later.", "publishedDate": "2016-04-16", "language": "en", "rating": 5}, {"id": 362599784, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d2223636-r362599784-MEAM_Museu_Europeu_d_Art_Modern-Barcelona_Catalonia.html", "text": "I simply love this place! There are some remarkable pieces in that collection, but the best thing about this museum is the Friday & Saturday evening recitals it hosts. It's an intimate, unpretentious yet classy atmosphere, and although I went a couple of times already, I will def go back.", "publishedDate": "2016-04-08", "language": "en", "rating": 5}, {"id": 361780266, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d2223636-r361780266-MEAM_Museu_Europeu_d_Art_Modern-Barcelona_Catalonia.html", "text": "Personally I learned here that I dont appreciate the hyper realism, that deserves alot respect to the technical abilities of the artists, but dont add artistic value compared to high resolution photography.\nIn top of that, too many of the subjects are beautiful naked, sexy girls.\n All in all I find the museum very remote from a high quality contemporary museum.", "publishedDate": "2016-04-05", "language": "en", "rating": 3}, {"id": 357819829, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d2223636-r357819829-MEAM_Museu_Europeu_d_Art_Modern-Barcelona_Catalonia.html", "text": "2nd floor is amazing, this museum is worth it if you like modern art, 2nd floor only, 1st and 3rd are very bad, very bad first impression.", "publishedDate": "2016-03-23", "language": "en", "rating": 5}, {"id": 354019142, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d2223636-r354019142-MEAM_Museu_Europeu_d_Art_Modern-Barcelona_Catalonia.html", "text": "The museum is located in a renovated old building close to the Picasso museum. The paintings are modern, with a focus on people and hyper realism, almost photographic. Tip: combine your visit with a small music concert. Classical on Saturday and Blues on Friday.", "publishedDate": "2016-03-09", "language": "en", "rating": 4}, {"id": 353808995, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d2223636-r353808995-MEAM_Museu_Europeu_d_Art_Modern-Barcelona_Catalonia.html", "text": "We were told by a friend of this museum's quality but we're very much surprised on the high quality of the works that is showed there. Hiperrealism is one of my favorite's oainting expressions and they have plenty of excellent paintings there. Must see for sure.", "publishedDate": "2016-03-08", "language": "en", "rating": 5}, {"id": 334036213, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d2223636-r334036213-MEAM_Museu_Europeu_d_Art_Modern-Barcelona_Catalonia.html", "text": "Visited whilst they are hosting the ARC winners which I think are there till2016. Very good and interesting art all within a gorgeous old building. \nWe had trouble finding it but it is right round the corner from the Picasso museum and this is much better if you are interested in new art.", "publishedDate": "2015-12-20", "language": "en", "rating": 5}, {"id": 332495791, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d2223636-r332495791-MEAM_Museu_Europeu_d_Art_Modern-Barcelona_Catalonia.html", "text": "MEAM is a unique museum in that it is one of the few museums in the world that specializes in contemporary figurative art.  When I visited they were exhibiting the work of the \"winners\" of 2 major figurative art competitions.  Like all museums, there were works that I loved along with works that I found less interesting.  As an art professional I consider a trip to a museum successful if I find just one artwork that I absolutely love.  On this visit I found 3 works that I would love to have in my art collection.  So this was time well spent.", "publishedDate": "2015-12-13", "language": "en", "rating": 4}, {"id": 332222499, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d2223636-r332222499-MEAM_Museu_Europeu_d_Art_Modern-Barcelona_Catalonia.html", "text": "I have visited it at least 3 times including once with a small concert. Simply great. Small but wonderful artworks: sculpture and pictures. I am happy to see that XXI still creates wonderful treasures. ", "publishedDate": "2015-12-12", "language": "en", "rating": 5}, {"id": 329615456, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d2223636-r329615456-MEAM_Museu_Europeu_d_Art_Modern-Barcelona_Catalonia.html", "text": "We managed to hit an excellent exhibit, simply meaning it was our style of art.  Based on the photos I don't think we would have liked other exhibits as much.  So definitely check the website to see what's showing to see if it's your cup of tea.\nThey had an exhibit of the sculptor Josep Llimona when we went.  Llimona has a simple, but pleasing style.  This took up about a quarter of the museum.  \nAnother quarter of the museum was primarily crafted objects like old beer steins and religious works.  \nThe remaining half was taken up with contemporary works.  There some astounding photorealism that was hard to tell they weren't photos.  There were other more expressive works that we really enjoyed and yet other works that were a bit challenging.  \nWe spent an hour an half taking the museum at a leisurely pace.", "publishedDate": "2015-11-28", "language": "en", "rating": 5}, {"id": 329053422, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d2223636-r329053422-MEAM_Museu_Europeu_d_Art_Modern-Barcelona_Catalonia.html", "text": "I've visited the MEAM twice, and both times the quality of work and the atmosphere of the place have taken my breath away. The music played in the background is perfect, and the selection of figurative art is simply wonderful. There was a point when I was gazing upon a beautiful piece of work and Yann Tiersen's \"Mother's Journey\" began to play...well, it was a truly lovely moment. I stumbled upon this gallery by accident a few years ago, and couldn't wait to return - it did not disappoint. It will definitely be at the top of my list when I visit Barcelona again. I'd encourage anyone with an interest in figurative art to make a beeline for this exemplary gallery.", "publishedDate": "2015-11-25", "language": "en", "rating": 5}, {"id": 328376419, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d2223636-r328376419-MEAM_Museu_Europeu_d_Art_Modern-Barcelona_Catalonia.html", "text": "What a wonderful work of art!!! This building is fantastic!! And the art work is also fantastic!! What a treat!!  Off the best and path... ", "publishedDate": "2015-11-22", "language": "en", "rating": 5}, {"id": 320068049, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d2223636-r320068049-MEAM_Museu_Europeu_d_Art_Modern-Barcelona_Catalonia.html", "text": "The European Museum of Modern Art is owned by the Foundation of Arts and Artists and its aim is to promote figurative art of the 20th and 21st centuries. It \nexhibits the best contemporary art of the world. Its aim is to feature modern \nart that is at the same time traditional, showing the human body in recognizable \nform. The difference between this museum and other contemporary art museums is that the art it exhibits comes from living artists who have created figurative art that is not abstract and is clearly figurative. There are 200 artists from 50 countries represented in the collection, and many of the artists won \ninternational competitions that were organized by the Foundation.\n\nThe site of the museum is the Gomis Palace in the Born District of Barcelona. \nThe Palace was built by the merchant Francesc Gomis in 1791 and the architect \nwas Joan Garrido. The style of the palace is Neoclassic. When Napoleon's troops invaded Barcelona, the Palace was used as the residence of the French General Lechi.\n\nThe museum was opened in June, 2011. There are four different types of \ncollections which include contemporary figurative art, modern sculpture from the \n20th century, Catalan sculpture from the 20th century, and the Art-Deco \ncollection. The ground floor houses a cafe and a small museum shop.", "publishedDate": "2015-10-19", "language": "en", "rating": 5}, {"id": 319541346, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d2223636-r319541346-MEAM_Museu_Europeu_d_Art_Modern-Barcelona_Catalonia.html", "text": "We found this place by accident and we were just mesmerized by the atmosphere and the Odd Nerdrum display they had there. A well worthed visit.", "publishedDate": "2015-10-17", "language": "en", "rating": 5}, {"id": 318934093, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d2223636-r318934093-MEAM_Museu_Europeu_d_Art_Modern-Barcelona_Catalonia.html", "text": "We primarily went for a concert by Therese Aune that was part of a focus on Nordic art and music.  There was also an exhibition of paintings by Odd Nordrum.  Well worth a visit, the museum has a pleasant relaxed atmosphere.", "publishedDate": "2015-10-15", "language": "en", "rating": 4}, {"id": 316047249, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d2223636-r316047249-MEAM_Museu_Europeu_d_Art_Modern-Barcelona_Catalonia.html", "text": "What a little gem, 3 floors of Modern art in a quirky, quiet building away from the crowds. I was the only person there on a Sunday afternoon. In some ways the art is quite traditional, Odd Nerdrum reminded me of Carravaggio, striking nudes and unsettling images all in beautiful orange hues. Other floors show a wonderful mix of paintings and sculptures. It's not large, so you can take time. It also has wonderful music playing, unusually in a gallery, not wallpaper music, more Einaudi and Nyman. A wonderful place.", "publishedDate": "2015-10-04", "language": "en", "rating": 5}, {"id": 312438184, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d2223636-r312438184-MEAM_Museu_Europeu_d_Art_Modern-Barcelona_Catalonia.html", "text": "After being given a leaflet on the street my wife and I paid a visit to the MEAM and loved it.\nThere was an exhibition on displaying the work of Odd Nerdrum, a Swedish artist. The artist himself was there at the time. The exhibition is dark but thought inspiring; a showcase of incredible talent!\nThere are two floors of other work at the museum, work that can rival that of the main exhibition. \nThe collections provoke a range of emotions and at times was awe inspiring. We were very glad with our decision to visit the MEAM over the Picasso museum.", "publishedDate": "2015-09-21", "language": "en", "rating": 5}, {"id": 311500869, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d2223636-r311500869-MEAM_Museu_Europeu_d_Art_Modern-Barcelona_Catalonia.html", "text": "My husband and I found the listing for this museum accidentally, and decided to try it after enjoying the many works from earlier periods (up to about 1950) in the other \"must see\" museums, especially the Reina Sofia and Prado in Madrid. The collection really rounded out our experience in Barcelona. The collection is well curated, with exceptional sculptures in particular. The pieces are consistently selected to meet a theme of questioning and interpreting the experience of modern life. If you don't read Spanish, I recommend having a translator downloaded on your phone so that you can read the titles of the works.", "publishedDate": "2015-09-18", "language": "en", "rating": 5}, {"id": 310847152, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d2223636-r310847152-MEAM_Museu_Europeu_d_Art_Modern-Barcelona_Catalonia.html", "text": "The visit to this museum was one of my highlights in Barcelona. Exquisite collection, very well appointed and selected with care . A must visit .", "publishedDate": "2015-09-15", "language": "en", "rating": 5}, {"id": 310578823, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d2223636-r310578823-MEAM_Museu_Europeu_d_Art_Modern-Barcelona_Catalonia.html", "text": "On the last day- it rained! In Barcelona! Right off the Picasso museum we went, but the queues were massive as everyone else had same plan! A lovely man was handing out flyers for MEAM, so on a whim, we sacked off the queue and went there instead. It was great! Beautiful building, with lots of new, original art. Mainly super reality stuff, but lots of sculpture and generally fascinating. A goof half day, rainy day activity in Barca. sadly no Picasso, but had seen his stuff in Ceret the week before!", "publishedDate": "2015-09-15", "language": "en", "rating": 4}, {"id": 308790014, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d2223636-r308790014-MEAM_Museu_Europeu_d_Art_Modern-Barcelona_Catalonia.html", "text": "I had not planned to visit this museum, as it is not very well known.  I was standing in a very long line for tickets to the Picasso Museum, when a man carrying a clutch of brochures approached the line and asked if anyone wanted to see the Modern Art museum.  On an impulse (and because I tend not to like crowds) I broke off from the Picasso line, and went to see the MEAM instead, which is a 3-minutes walk away.\n\nI am very glad of my decision.  The museum had some wonderfully original paintings and sculptures.  The place was alive with artistic expression and spirit.  Perhaps the highlight of my stay in Barcelona.  \n\nLater in the day I did go back to the Picasso Museum, and saw the predictable works among hordes of people.  Next time, I will visit the MEAM and let the crowds have their Picasso.", "publishedDate": "2015-09-09", "language": "en", "rating": 5}]}}]