[{"locationId": 6116899, "name": "Park of Joan Miro", "placeType": "ATTRACTION", "reviewListPage": {"reviews": [{"id": 755306121, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d6116899-r755306121-Park_of_Joan_Miro-Barcelona_Catalonia.html", "text": "We are fortunate enough to overlook this park from our rooftop patio.\nAn ideal park for jogging and other forms of exercise including yoga and table tennis. \nDuring the day there are plenty of families here taking advantage of the time slot for families during the ongoing State of Alarm. However, the play areas with where the swings and slides are located are still cordoned off.\nFrom Carrer de Diputacio as you go into the park, walk to the other side heading towards Tarragona metro station and you'll find a large patio are with an art sculpture and a small expanse of water. Three ping pong tables are close to here once you pass the fire station\n", "publishedDate": "2020-05-21", "language": "en", "rating": 4}, {"id": 741293449, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d6116899-r741293449-Park_of_Joan_Miro-Barcelona_Catalonia.html", "text": "Great activity if you’re traveling with kids. Many different areas with playgrounds and parrot crowded trees, open spaces to play frisbee or just sit and have the kids chasing pigeons. Has a big nice iconic Miró sculpture.", "publishedDate": "2020-01-26", "language": "en", "rating": 5}, {"id": 735352245, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d6116899-r735352245-Park_of_Joan_Miro-Barcelona_Catalonia.html", "text": "As I saw the Torre agbar of the bullring shopping centre roof I spotted the park. The statue itself isn't very good.", "publishedDate": "2019-12-29", "language": "en", "rating": 3}, {"id": 735131077, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d6116899-r735131077-Park_of_Joan_Miro-Barcelona_Catalonia.html", "text": "The park is a small one behind the Arenas and seems to cater to the local dog owners but you will come here mostly for the Woman and Bird sculpture by  Miro, its a striking modernist piece of art close to Placa d Espana but I fail to see the woman and bird , its a wonderful thing to photograph as the colours just burst out but.....", "publishedDate": "2019-12-28", "language": "en", "rating": 3}, {"id": 690330894, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d6116899-r690330894-Park_of_Joan_Miro-Barcelona_Catalonia.html", "text": "This park is west of central Barcelona is named in honour of the surrealist artist of the same name. The park was built on the grounds of the former municipal slaughter house, and is pretty park area that features lots of lovely tree lined paths as well some gardens. There's a library located at the eastern edge of the park, although it's more for locals than tourists.\n\nThere's an artificial water channel that runs along the park, but it was dry when I was there. And just in case, you still don't see any connection to the artist, there a giant  22-metre-high monumental sculpture Dona i Ocell by Joan Miró at the north west end of the park.\n\nNot a must see, but worth a quick detour if in the Plaça d'Espanya area.", "publishedDate": "2019-07-17", "language": "en", "rating": 4}, {"id": 687197158, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d6116899-r687197158-Park_of_Joan_Miro-Barcelona_Catalonia.html", "text": "On our first visit to Barcelona we visited the Place de Espanya and did some sightseeing in the area. We took the elevator to the top of the Arenas Shopping Mall...It is an outdoor walkway at the top of the old stadium that has been converted to a large multi-level shopping center.\n\nThe views from the walkway were pretty amazing. As we walked around you get unobstructed views of the plaza, government buildings, and Park of Joan Miro. The park is a beautifully landscaped area with palm trees, monuments. and nice open spaces.", "publishedDate": "2019-07-06", "language": "en", "rating": 4}, {"id": 675993107, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d6116899-r675993107-Park_of_Joan_Miro-Barcelona_Catalonia.html", "text": "This is an artificial park mostly near Plaça d’Espanya.\n\nMainly made of sandy grounds, some seem to be dedicated to dogs and their owners. Decent walk, but Barcelona definitely has much nicer parks like Guell and Cuitadella.", "publishedDate": "2019-05-23", "language": "en", "rating": 3}, {"id": 675085901, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d6116899-r675085901-Park_of_Joan_Miro-Barcelona_Catalonia.html", "text": "We enjoyed a very happy afternoon here with our daughter, so you can imagine my surprise at all the negative comments by prior reviewers! The park is home to Dona i Ocell, which I found more captivating in person than I had expected. However, the BIG attraction is not the art but the living. If you are looking for a botanical wonderland inspired by Joan Miró’s great works, you should keep looking. If, however, you are looking for a peaceful afternoon amongst and with the locals, this park is a gem! \n\nThe park is split roughly in half by a wide, even walking path festooned by vibrant flora (primarily bougainvillea). The Dona is well-displayed with a reflecting pool in a corner on one side of the park, where it abuts a shaded pavilion-performance area. The rest of that side of park has a landscaped area with lawns, which have a lot of central wear due to both dogs and children at play, and some courts for ball sports. (Didn’t look closely enough to be able to say what kind - sorry!)\n\nMain features on the other side of the park are the library, a water feature (that is currently drained so not 100% sure if just for viewing), and play spaces for all ages. The grounds (aside from those previously mentioned) are sand, dotted with palms for shade, occasional other shrubs (particularly in a section I think of as the ‘reading/meditation zone’, and benches. There is a reasonably-sized enclosed dog play area, a large space for ~6 volleyball nets/games (2 happening while we were there), a section with ~6 table tennis tables (2 in use while we were there), a section for ~4 courts for a smaller yard/ground sport (perhaps pétanque??), at least 4 playgrounds/play structures for children of differing ages, a zip line for children, and probably more. \n\nWe were there in a drizzle around 5pm on a cool Sunday, and the park positively teemed with locals and good cheer. We look forward to coming back for more afternoon fun throughout the week, which can then wrap up with tapas at La Terraza Miró - exceptional on all counts and perfectly located under the watchful presence of Dona i Ocell!", "publishedDate": "2019-05-19", "language": "en", "rating": 5}, {"id": 674592636, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d6116899-r674592636-Park_of_Joan_Miro-Barcelona_Catalonia.html", "text": "When we first saw Park of Joan Miro we did not realise it was actually a park. Nothing indicated that there was a park in that area. We did see the huge \"Woman and Bird\"  sculpture by Joan Miro. We were at a loss to explain why it was there! Later we realised this was a park..... Barcelona has so many wonderful things, places and spaces, and then it has other spaces such this park. This is a sad place more than anything else, despite it having been landscaped with palms and pines and other things. Locals perhaps love it, but for us not very impressive!", "publishedDate": "2019-05-17", "language": "en", "rating": 3}, {"id": 673175224, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d6116899-r673175224-Park_of_Joan_Miro-Barcelona_Catalonia.html", "text": "This ugly park is located near Plaça Espanya and next to the Arenas de Barcelona shopping center.\n\nThe most important sight in this park is Joan Miro's 22-meter-high monumental sculpture Dona i Ocell (Woman and Bird).", "publishedDate": "2019-05-11", "language": "en", "rating": 3}, {"id": 583612191, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d6116899-r583612191-Park_of_Joan_Miro-Barcelona_Catalonia.html", "text": "I was curious when I first sighted this towering sculpture and managed to get a good photo. I later asked the ticket seller on Bus Turistic if she knew what it represented. \nIt seems that it is a sculpture of a woman and bird by artist Joan Miró and is finished in multi-coloured pieces of ceramic tiles. You need to stretch your imagination on this one.", "publishedDate": "2018-05-29", "language": "en", "rating": 3}, {"id": 561023539, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d6116899-r561023539-Park_of_Joan_Miro-Barcelona_Catalonia.html", "text": "We returned to this park some 6 years after our previous visit, and to our dismay, the park actually looks worse - totally neglected and unworthy of the name of Joan Miro.\nSkip it.", "publishedDate": "2018-02-17", "language": "en", "rating": 2}, {"id": 549664048, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d6116899-r549664048-Park_of_Joan_Miro-Barcelona_Catalonia.html", "text": "Went there specifically for the sculpture \"Dona i Ocell\". Unfortunately the area is fenced up and under reconstruction.", "publishedDate": "2017-12-28", "language": "en", "rating": 1}, {"id": 542032692, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d6116899-r542032692-Park_of_Joan_Miro-Barcelona_Catalonia.html", "text": "Fairly horrible little park.  No grass just red earth. It’s being rebuilt. Unless you need somewhere to run the dog or let the kids run around a bit it’s a waste of time.  Also underneath the Park is where your car is towed to should you need to know. \n", "publishedDate": "2017-11-19", "language": "en", "rating": 1}, {"id": 529216169, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d6116899-r529216169-Park_of_Joan_Miro-Barcelona_Catalonia.html", "text": "The park is under reconstruction, not Miró's 70-ft-tall, tile-covered \"Dona i Ocell\" sculpture (\"Woman and Bird\") stands erect in the park as construction goes on around it. I simply appreciated it as abstract, not recognizing its representation until I saw the Wikipedia article on it.", "publishedDate": "2017-10-02", "language": "en", "rating": 3}, {"id": 524371413, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d6116899-r524371413-Park_of_Joan_Miro-Barcelona_Catalonia.html", "text": "Pleasant park to walk through, interesting artwork to see, relaxed atmosphere, near to metro at Plaza Espanya", "publishedDate": "2017-09-14", "language": "en", "rating": 4}, {"id": 519666037, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d6116899-r519666037-Park_of_Joan_Miro-Barcelona_Catalonia.html", "text": "Oasis of calm in bustle of big city, the Miro sculpture is the center of a lovely park, locals come to relax under the trees, perfect place to read a book or catch up on the newpapers", "publishedDate": "2017-08-30", "language": "en", "rating": 5}, {"id": 504740398, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d6116899-r504740398-Park_of_Joan_Miro-Barcelona_Catalonia.html", "text": "Just right in front of the Centro comercial Las Arenas in Plaza España. A place to go with kids. There is also a municipal library and a dog  park. It is always crowded by locals. Nice spot to take a pause while walking in Barcelona.\n\nIf you are a runner every lap lenght is of 1 km.", "publishedDate": "2017-07-23", "language": "en", "rating": 5}, {"id": 486121459, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d6116899-r486121459-Park_of_Joan_Miro-Barcelona_Catalonia.html", "text": "We went by this landmark in a open top tour bus and later got the opportunity to view it from the rooftop of Las Arenas shopping plaza. It's rather sad looking in it's building site context. Shame.", "publishedDate": "2017-05-21", "language": "en", "rating": 3}, {"id": 485043086, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d6116899-r485043086-Park_of_Joan_Miro-Barcelona_Catalonia.html", "text": "An area under heavy development with a stretch of grass. Really not worth going ... unless you have a dog.", "publishedDate": "2017-05-17", "language": "en", "rating": 1}, {"id": 481703659, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d6116899-r481703659-Park_of_Joan_Miro-Barcelona_Catalonia.html", "text": "Nice little park with a variety of swings/slides/climbing frames etc for young kids. There is a library there too although we didn't visit. The little bar in the park is great and gave us a break from playing with kids! It's basic but you'll get a cold beer. Clean park that gives the kids an opportunity to run wild in the confines of a city. Feels reasonably safe too with gated entrance to park areas. Free.\n\n", "publishedDate": "2017-05-04", "language": "en", "rating": 3}, {"id": 474860442, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d6116899-r474860442-Park_of_Joan_Miro-Barcelona_Catalonia.html", "text": "It's a regular park, perfect if there's a sunny day or if you want to have a sandwich there. You could walk freely. Better not to go in the evenings (homless,)", "publishedDate": "2017-04-11", "language": "en", "rating": 3}, {"id": 473237741, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d6116899-r473237741-Park_of_Joan_Miro-Barcelona_Catalonia.html", "text": "The big woman and child sculpture, tiled, typically Miro, is visible. Much of the rest of the park is covered by plant and machinery.", "publishedDate": "2017-04-06", "language": "en", "rating": 3}, {"id": 472472917, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d6116899-r472472917-Park_of_Joan_Miro-Barcelona_Catalonia.html", "text": "Nothing to see or do... Just one thing to take few pictures...not worth it... Just watch it from bus or car while passing.. .  But place is in good locality... With malls... Shopping street... And many sight seeing places... ", "publishedDate": "2017-04-03", "language": "en", "rating": 2}, {"id": 460851813, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d6116899-r460851813-Park_of_Joan_Miro-Barcelona_Catalonia.html", "text": "While the park itself is truly underwhelming (looks more of a construction site rather than a park), the sculpture of Joan Miro - \"Dona i Ocell\" (\"Woman and bird\") is lovely, but can also be appreciated from the roof of the nearby Arenas de Barcelona shopping mall.", "publishedDate": "2017-02-18", "language": "en", "rating": 3}, {"id": 459159280, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d6116899-r459159280-Park_of_Joan_Miro-Barcelona_Catalonia.html", "text": "while the library at the outer edge of the park is worth a visit, the park itself is more of a construction site and a place to walk the dog... the one monument of Miro does not really make it a Miro park yet.", "publishedDate": "2017-02-13", "language": "en", "rating": 3}, {"id": 436673514, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d6116899-r436673514-Park_of_Joan_Miro-Barcelona_Catalonia.html", "text": "A colourful sculpture in an area that is about to be developed apparently - the structure is a great piece of modern art and  brings vibrency to the area ", "publishedDate": "2016-11-12", "language": "en", "rating": 4}, {"id": 435172238, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d6116899-r435172238-Park_of_Joan_Miro-Barcelona_Catalonia.html", "text": "When we visited in October of this year there was a lot of building work going on around the sculpture which was such a shame as it detracted from the park and artwork\n\nHopefully the work will be completed soon and will enhance the structure  ", "publishedDate": "2016-11-06", "language": "en", "rating": 3}, {"id": 432784689, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d6116899-r432784689-Park_of_Joan_Miro-Barcelona_Catalonia.html", "text": "Hard to really say much we popped to see this back in May whilst I was staying in Barcelona with my partner there was some building work going on around it but really not much to see or be impressed about! I wouldn't make a special effort to see it!", "publishedDate": "2016-10-29", "language": "en", "rating": 2}, {"id": 431887322, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d6116899-r431887322-Park_of_Joan_Miro-Barcelona_Catalonia.html", "text": "The schedule on trip advisor didnt meet the reality and there where not any show on sundays. Not the shows problem but I don't have any real feedback on the show. It's a struggle to find your way to the show and make sure to be there in good time before the show. ", "publishedDate": "2016-10-26", "language": "en", "rating": 1}, {"id": 428727198, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d6116899-r428727198-Park_of_Joan_Miro-Barcelona_Catalonia.html", "text": "The fine Miro sculpture Dona i Ocell is in itself very good, but construction is taking place (Oct 16), so you can't get close to it. The parc is not interesting, construction is also taking place there. It is hard to see a connection to Miro, except for the sculpture.", "publishedDate": "2016-10-17", "language": "en", "rating": 2}, {"id": 417417850, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d6116899-r417417850-Park_of_Joan_Miro-Barcelona_Catalonia.html", "text": "On our way to Plaza Espana we stopped to visit the Park of Joan Miro. We shouldn't have stopped. The park itself was OK, though a lot of construction was going on. If you expect anything Miro, you will be disappointed.", "publishedDate": "2016-09-12", "language": "en", "rating": 2}, {"id": 410454959, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d6116899-r410454959-Park_of_Joan_Miro-Barcelona_Catalonia.html", "text": "Beautiful park with local Barcelona people only. Beautiful colorful birds sitting on palm trees. Amazing to chill. ", "publishedDate": "2016-08-25", "language": "en", "rating": 5}, {"id": 402080725, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d6116899-r402080725-Park_of_Joan_Miro-Barcelona_Catalonia.html", "text": "Definitely not worth a visit. There is a building/library? that is closed, this was designed to be surrounded by water but all the ponds were drained and badly maintained, it nearly looked like the place had been evacuated.\nOn the opposite side, the big Miro sculpture is not accessible as it is surrounded by a big construction site that takes nearly half of the park. Near this and still within the \"supposed\" park boundary there is a fire station ( which I could not see in any map...).\nThere are different playground areas for different ages, my kids were not very impressed but the equipment looked good to me. Be prepared for some dust though.", "publishedDate": "2016-08-06", "language": "en", "rating": 2}, {"id": 393554783, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d6116899-r393554783-Park_of_Joan_Miro-Barcelona_Catalonia.html", "text": "Certainly not worth going out of your way to visit, but OK if you happen to be nearby and you want somewhere for the kids to run around. There are three play areas, with the usual swings and slides and a short zip line. The park itself is quite large with quite a few trees to provide shade, but would be so much better with a bit of grass instead of the usual dust. The only other thing of note is the Miró statue \"woman with bird\", which stands in one corner. However, they are currently building something nearby and there is a big hole in the ground right next to it, preventing you from getting very near.", "publishedDate": "2016-07-17", "language": "en", "rating": 3}, {"id": 382502086, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d6116899-r382502086-Park_of_Joan_Miro-Barcelona_Catalonia.html", "text": "Under renovations at the moment but still an awesome statue, it's like nothing I've ever seen and photographs at all angles differently. Even with the water below it under renovation it was still good to see", "publishedDate": "2016-06-14", "language": "en", "rating": 4}, {"id": 380945450, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d6116899-r380945450-Park_of_Joan_Miro-Barcelona_Catalonia.html", "text": "Very nice, but kind of disappointing, it was under the construction where the main statue is, so I couldn't go in, plus the pond was drained. ", "publishedDate": "2016-06-08", "language": "en", "rating": 4}, {"id": 380411455, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d6116899-r380411455-Park_of_Joan_Miro-Barcelona_Catalonia.html", "text": "The Woman and Bird sculpture is in the Miro Park, directly behind Las Arenas shopping center which is housed in a converted bull-ring. Las Arenas is at one end of Plaza Espanya with the Museum of Catalan Art (MNAC) at the other end.  So, I highly recommend a visit to Miro Park before/after a visit to the Plaza Espanya and/or MNAC since the park offers a nice, clean rest stop after (or in the midst) of a busy day of sightseeing.  The park is spacious and quiet, but is currently under renovation.  The Miro sculpture, Woman and Bird, is especially fun to see! Tip: pick up a snack from the Las Arenas shopping center, exit through the back of the shopping center and you’ll see the park where you can then perhaps have a peaceful snack/drink with your Las Arenas purchase.  There is an inexpensive organic foods market on the bottom level of Las Arenas, which would be perfect for collecting picnic options. Also, the metro can be accessed at the bottom level of Las Arenas, so this is an easy spot to visit.", "publishedDate": "2016-06-06", "language": "en", "rating": 3}, {"id": 340391070, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d6116899-r340391070-Park_of_Joan_Miro-Barcelona_Catalonia.html", "text": "Huge park is also known as the Parc l’Escorxador, the Catalan expression for the slaughterhouse which stood here till 1979. It is a great spot, with many different elements put around the central plaza as a big puzzle pieces. Along the water channel lies a 22 meters high sculpture “Woman and Bird” designed by the great artist in 1983.", "publishedDate": "2016-01-16", "language": "en", "rating": 5}, {"id": 326087081, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d6116899-r326087081-Park_of_Joan_Miro-Barcelona_Catalonia.html", "text": "beautiful and full of green parrots which live there as well as great nature. and it's not full of tourists, so you will really be able to relax there.", "publishedDate": "2015-11-11", "language": "en", "rating": 5}, {"id": 318082726, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d6116899-r318082726-Park_of_Joan_Miro-Barcelona_Catalonia.html", "text": "This park is nicely designed. It has sculptures, fountains, a play area for kids, a place to eat and on the Sunday I visited, live music. I wouldn't go out of my way to visit it. But if you like parks its really nice. Not real big but pretty and good for families. If you are visiting Montjuic its worth popping next door to visit the park.", "publishedDate": "2015-10-12", "language": "en", "rating": 4}, {"id": 309185554, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d6116899-r309185554-Park_of_Joan_Miro-Barcelona_Catalonia.html", "text": "This busy park is right in the centre of the city and a great meeting place for the locals. People walking dogs and groups doing yoga. Nice ", "publishedDate": "2015-09-11", "language": "en", "rating": 4}, {"id": 295575269, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d6116899-r295575269-Park_of_Joan_Miro-Barcelona_Catalonia.html", "text": "This city park is worth a visit if you are walking up Calle Tarragona to the Arenas shopping centre (Old bullring).  Started in 1979  on the demolition of the old city slaughterhouse.   It is the space of 4 city blocks and dominated by the huge and colourful Joan Miro statue called woman and bird.  It is standing in a pool of water.  Much loved by the local dogs and their owners.   It's fun to see how much the dogs enjoy being in the water!   There is a lawned area with a \"river\" of taller flowering grasses snaking across the middle.  Also an area of palm trees which seemed to be loved by a flock of green and noisy parrots!   To the side are some wonderful flowering bougainvilleas and pale blue plumbago.  All in all a really nice and welcome open space.  Local people  come to enjoy the space and comparative quiet and sit reading in the shady areas,", "publishedDate": "2015-08-04", "language": "en", "rating": 5}, {"id": 293805849, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d6116899-r293805849-Park_of_Joan_Miro-Barcelona_Catalonia.html", "text": "We actually went to this park because we were doing some geocaching and a geocache was hidden nearby.  Very nice park and nice area to walk so I recommend you stop in if you are nearby.", "publishedDate": "2015-07-29", "language": "en", "rating": 4}, {"id": 286683186, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d6116899-r286683186-Park_of_Joan_Miro-Barcelona_Catalonia.html", "text": "we saw this from the top of the arenas shopping centre, former bullring -  good to see green areas in such a busy city.  there is a water feature and we saw a dog enjoying having a dip in it, which was quite funny.  wouldn't go out of the way to visit but if you want to have a seat and get away from the bustle, it is an option.  not impressed with the sculpture though", "publishedDate": "2015-07-08", "language": "en", "rating": 2}, {"id": 285676446, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d6116899-r285676446-Park_of_Joan_Miro-Barcelona_Catalonia.html", "text": "Looking out our hotel window was the view of Joan Miró's monumental sculpture Dona i Ocell (Woman and Bird), we were intrigued by the sculpture so we paid the park a visit.  \n\nThe park is right by the Las Arenas shopping centre on Plaza Espana.  The park is a large open landscaped space which covers four city blocks there are lots of grassy areas to sit.  In days gone by the area was the home of the municipal slaughterhouses, a big improvement. \n\nI must admit we are not fans of the famous Catalan surrealist works, but we did ponder for awhile to interpret with brightly tiled sculpture.", "publishedDate": "2015-07-04", "language": "en", "rating": 3}, {"id": 285582054, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d6116899-r285582054-Park_of_Joan_Miro-Barcelona_Catalonia.html", "text": "The park not very nice. It's mostly a big square qith a large monument by Joan Miro.If you stay in the neighbourhood you may take a photo and walk on by. Not worth taking the subway to get there.", "publishedDate": "2015-07-04", "language": "en", "rating": 1}, {"id": 275680103, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d6116899-r275680103-Park_of_Joan_Miro-Barcelona_Catalonia.html", "text": "This is a great place to visit in Barcelona if you're a Miró lover. The park is super green and you can spend some good time on the grass contemplating the massive colourful sculpture. It's just next to a very busy road so it's not so quiet...", "publishedDate": "2015-05-30", "language": "en", "rating": 4}, {"id": 264125670, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d6116899-r264125670-Park_of_Joan_Miro-Barcelona_Catalonia.html", "text": "Doubled up on a visit here with Las Arenas. Nice play park for the children, not your typical \"park\" with grassy areas, more urban with sandy paths and play areas. Enjoyed watching/feeding the pigeons and parakeets. And the Joan Miró statue - \"Woman and the bird\" had us puzzled for a while. Worth 30 minutes visit for a change of scenery. ", "publishedDate": "2015-04-06", "language": "en", "rating": 4}, {"id": 264068258, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d6116899-r264068258-Park_of_Joan_Miro-Barcelona_Catalonia.html", "text": "Miro park is amazing with lots of different styles and techniques. He defiantly is a unique artist from all the others creating always a very simple but effective and powerful artwork. Barcelona is a fantastic location for the park. Don't miss it!  ", "publishedDate": "2015-04-06", "language": "en", "rating": 4}, {"id": 262118930, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d6116899-r262118930-Park_of_Joan_Miro-Barcelona_Catalonia.html", "text": "This park was just beside our hotel so we did visit there every day. Nice place to spend some time. That park would be great if would have grass instead of sand. But nice place to spend time, beside arena Barcelona.", "publishedDate": "2015-03-27", "language": "en", "rating": 4}, {"id": 243158401, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d6116899-r243158401-Park_of_Joan_Miro-Barcelona_Catalonia.html", "text": "Designed specifically for the display of Miro's creations, even the building is a work of art in it's own right.\n\nThe audio guide was fantastic, taking you through the fascinating history of Miro and how he came to develop his style.\n\nA great collection of Miro's works.", "publishedDate": "2014-12-05", "language": "en", "rating": 5}, {"id": 242615381, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d6116899-r242615381-Park_of_Joan_Miro-Barcelona_Catalonia.html", "text": "The Miro Museum is nestled among the trees atop a hill in Barcelona.It is within walking distance from the Museum of Catalonia.  Gleaming white and glass, the building itself is a piece of art. The works of Joan Miro are a testament to the modern era. Be sure to step out onto the roof for the views and additional artwork. Photos are not allowed inside.  The gift shop offers unique items related to the artist and the modernists. We ate in the restaurant which was quite nice. There are two options, not well marked for dining. In the same room there is a small glass atrium that is for sit down diners where you will be waited on...the rest of the room is order from the counter and find a spot. The food was good, but we found the staff not particularly English speaking friendly. We managed fine, but it took a bit of work. You have to ask for menus in other languages. ", "publishedDate": "2014-12-02", "language": "en", "rating": 5}, {"id": 235897948, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d6116899-r235897948-Park_of_Joan_Miro-Barcelona_Catalonia.html", "text": "We went up to this place on a sunday, and it was free for geezers and the audio was half price.\nThe museum is fabulous and well worth a visit. It was designed by Sert for his friend Miro, and the art on view is wonderful, especially the sculptures and paintings. My wife is convinced that Miro was the better Spanish genius (compared to Picasso) because he was a nice person. We saw at the Sabanci Museum in Istanbul a lot of the major stuff that had been taken there for an exhibit.", "publishedDate": "2014-10-23", "language": "en", "rating": 5}, {"id": 235032630, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d6116899-r235032630-Park_of_Joan_Miro-Barcelona_Catalonia.html", "text": "Great place, we loved the atmosphere there as well as the way you are impressed since of the presentation there. \nIt is a good museum and there you can both understand the history of the artist as well as his contribution to Spain", "publishedDate": "2014-10-18", "language": "en", "rating": 5}, {"id": 234981068, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d6116899-r234981068-Park_of_Joan_Miro-Barcelona_Catalonia.html", "text": "This is a lovely park area next to the Barcelona zoo. Lots of fountains, flowers and monuments. Walk and get lost...peaceful. This area extends inland toward the Arch of Triumph Promenade. Great walking. Lots of great pic opportunities. If you continue to walk inland along Passeig de Sant Joan you can go nearly straight to Basilica Sagrada Familia. Great walk.  We walked from La Rambla to near seaside(Passeig de Colom)-to Park area and inland to the Basilica in about 90 min.", "publishedDate": "2014-10-18", "language": "en", "rating": 5}, {"id": 210786209, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d6116899-r210786209-Park_of_Joan_Miro-Barcelona_Catalonia.html", "text": "Miro Park is directly behind Las Arenas shopping center which is housed in a converted bull-ring.  Las Arenas is at one end of Placa Espanya with the Museum of Catalan Art (MNAC) at the other end.  The beautiful waterworks span between both points.  So, I highly recommend a visit to Miro Park after a visit to the Placa Espanya and/or MNAC since the park offers a nice, clean rest stop after (or in the midst of) a busy day of sightseeing.  The park is spacious and quiet, even with the hub of activity from the nearby plaza and metro.  The Miro sculpture, Woman and Bird, is especially fun to see!  Tip: pick up a snack from Las Arenas shopping center, exit through the back of the shopping center and you’ll see the park where you can then enjoy a peaceful snack/drink.  There is an inexpensive organic foods market on the bottom level of Las Arenas, which would be perfect for collecting simple picnic options.", "publishedDate": "2014-06-17", "language": "en", "rating": 4}, {"id": 207370295, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d6116899-r207370295-Park_of_Joan_Miro-Barcelona_Catalonia.html", "text": "This is an urban park, not a tourist attraction; but, with the huge sculpture, it is likely to be on many visitor's 'to-see' lists.\n\nIt's not like a park in London - no grassy areas where you can sunbathe, just dust, with trees and shrubs. But to many locals this is were they can come to relax.\n\nThere are plenty of benches, you can take a picnic. Parrakeets were flying around overhead when we were there, their somewhat insane flying kept us entertained for ages.\n\nThe trees are statuesque; the smaller trees and shrubs colourful when in flower.\n\nThere were no hawkers, street salesmen or buskers. It was nothing like as crowded as Ramblas, and we felt less exposed to pickpockets and suchlike. It's free too!\n\nRecommended!", "publishedDate": "2014-05-27", "language": "en", "rating": 4}, {"id": 200834040, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d6116899-r200834040-Park_of_Joan_Miro-Barcelona_Catalonia.html", "text": "The sun was shining when we visited and I loved it, sat in the sun under the palm trees listening to the birds and watching the dogs.", "publishedDate": "2014-04-12", "language": "en", "rating": 5}, {"id": 200793241, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d6116899-r200793241-Park_of_Joan_Miro-Barcelona_Catalonia.html", "text": "Lovely park by the Joan Miro foundation. We accessed it from the Barcelona bus tour stop. There is a beautiful restaurant down the steps, playing old fashioned music with outside seating. Sculptures, fountains and statues are dotted amoungst the foliage. Trees were out in pink blossom in April.", "publishedDate": "2014-04-12", "language": "en", "rating": 5}]}}]