[{"locationId": 8498163, "name": "Parc de la Trinitat", "placeType": "ATTRACTION", "reviewListPage": {"reviews": [{"id": 753576107, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d8498163-r753576107-Parc_de_la_Trinitat-Barcelona_Catalonia.html", "text": "The place itself isn't bad but what's with the naked girl bending over? Really? Some of us don't need pervy sculptures when we go to a park, ever.", "publishedDate": "2020-05-16", "language": "en", "rating": 1}, {"id": 394061697, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d8498163-r394061697-Parc_de_la_Trinitat-Barcelona_Catalonia.html", "text": "It's not located at the center of the city but we happened to be hosted nearby so we took a look and liked what we saw.\n\nThe park is very calm.", "publishedDate": "2016-07-18", "language": "en", "rating": 4}, {"id": 295743808, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d8498163-r295743808-Parc_de_la_Trinitat-Barcelona_Catalonia.html", "text": "A wonderful parc right smack in the middle of an awful road interchange which was made as a part of the infrastructure for the Olympic games back in the early 1990's. This was one of the reasons for this trip to Barcelona. This 7 hectare parc was the remains of land left in the center of the massive road structure and was originally used to provide a 6,000 lot parking area. It has been reborn into a very pretty and functional parc containing walking trails, washrooms, sculptures (running horses and a maiden washing clothes), a water feature, tennis and basketball courts, a picnic and BBQ area and a garden area where local seniors can grow vegetables. This is proof that with some imagination and some investment a community can reclaim what is otherwise wasted space, into a benefit for the community. Easily accessible by metro (via L1, Trinitat Vella, access right at the metro station) and in an often unvisited area of the city, Sant Andreu, which has often been neglected by the city of Barcelona. Well worth a trip off the beaten path and while you are there spend some time in this interesting and very non tourist neighborhood, you will be glad that you did.", "publishedDate": "2015-08-04", "language": "en", "rating": 4}]}}]