[{"locationId": 7914040, "name": "Museum of Illusions", "placeType": "ATTRACTION", "reviewListPage": {"reviews": [{"id": 746247670, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d7914040-r746247670-Museum_of_Illusions-Barcelona_Catalonia.html", "text": "This place gave us our best souvenir from Barcelona: a selection of very entertaining photos. We spent a fun 75 minutes totally engaged in immersing ourselves into the pictures which had so cleverly been thought through in their compositions, entertainment and diversity.", "publishedDate": "2020-02-19", "language": "en", "rating": 5}, {"id": 745829388, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d7914040-r745829388-Museum_of_Illusions-Barcelona_Catalonia.html", "text": "Very funny and unusual experience! A lot of fan! A log of pictures! For children and for adults! For exellent mood for hole day and nice memories! 1,5 or 2 hours is enought for your visit! Also good combination with Big Fan Museum, they have exellent entrance price for 2 museums!", "publishedDate": "2020-02-17", "language": "en", "rating": 5}, {"id": 745530121, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d7914040-r745530121-Museum_of_Illusions-Barcelona_Catalonia.html", "text": "The museum is composed of many pictures on the walls (pictures are big, from the floor to the ceiling) where you are invited to become a part of these pictures!\nAll the pictures are of different themes - so just use your fantasy to complete them with yourself!\nIf your fantasy is not in a good mood today, there are some ideas proposed as well as the points from where it is better to take a picture.\nDon't forget your photo-camera!", "publishedDate": "2020-02-16", "language": "en", "rating": 5}, {"id": 743664163, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d7914040-r743664163-Museum_of_Illusions-Barcelona_Catalonia.html", "text": "We had great fun with all of the Illusions. Something you can do without a lot of effort, but it looks very physical. Perfect for me and my disabled Mother.", "publishedDate": "2020-02-07", "language": "en", "rating": 5}, {"id": 741140152, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d7914040-r741140152-Museum_of_Illusions-Barcelona_Catalonia.html", "text": "It was amazing!Good and kind people from the staff and funny attractions.Unforgettable experience,thank you!", "publishedDate": "2020-01-25", "language": "en", "rating": 4}, {"id": 735201328, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d7914040-r735201328-Museum_of_Illusions-Barcelona_Catalonia.html", "text": "A fantastic experience with extremely helpful staff. Every second spent there was so enjoyable and worth the money Highly recommended specially for families with children. Even as adults we had a fabulous time.", "publishedDate": "2019-12-28", "language": "en", "rating": 5}, {"id": 734856592, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d7914040-r734856592-Museum_of_Illusions-Barcelona_Catalonia.html", "text": "We were laughing a lot and enjoyed this place 😁\nThis museum is very big and we passed 2,5 hours , but we will go to the museum of Illusions which is close and belongs to Big Fun. Here we saw 8 museums in one place, the giants house is amazing 😂", "publishedDate": "2019-12-26", "language": "en", "rating": 5}, {"id": 732959848, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d7914040-r732959848-Museum_of_Illusions-Barcelona_Catalonia.html", "text": "We stumbled across the museum with no real intentions to go there. We got in and had two hours of unexpected fun with our 2 teenagers. Lots of opportunities for selfies in various funny locations and situations.\nVery recommended.", "publishedDate": "2019-12-15", "language": "en", "rating": 5}, {"id": 730505698, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d7914040-r730505698-Museum_of_Illusions-Barcelona_Catalonia.html", "text": "There was a lot of illusion snaps available including Salvador Dali pieces, Star War, Spongebob Square-pants and Adventure Time. However it would have been better if they have all the examples on the walls on how the photo will look rather than just a few examples for specific illusions. Although it was really quiet there, there wasn’t anyone there to assist with taking photos of us with the illusion all images if it was just you and a friend.", "publishedDate": "2019-12-03", "language": "en", "rating": 3}, {"id": 724802731, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d7914040-r724802731-Museum_of_Illusions-Barcelona_Catalonia.html", "text": "Great way to spend an hour ish taking fun pictures . Cheap fun for all ages. There is just one mural right after the other.", "publishedDate": "2019-11-07", "language": "en", "rating": 5}, {"id": 724678677, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d7914040-r724678677-Museum_of_Illusions-Barcelona_Catalonia.html", "text": "Went with my sister, she highly recommended it, she was there before. Two of the rooms were closed and the guy who sells the tickets tried to trick us out saying that we will have the full experience until my sister said she was there before and saw other rooms as well that he didn’t mention.The place it’s a bit confusing cause you buy the tickets on the main level and then you have to go down stairs to scan you ticket, we got lost and found the supervisor who was cocky and rude!! Instead of helping us out she treated us as one of her coworkers giving us orders and reminding us she was a supervisor In a very broken Spanish, rude!!! I won’t recommend it and won’t come back again!! Shame cause the idea and place itself it’s really cool and fun. But by the end of the day I’ve paid for those tickets and I expected to have fun and be treated like customers, you ruined my experience there so thank you very much.", "publishedDate": "2019-11-07", "language": "en", "rating": 1}, {"id": 716203945, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d7914040-r716203945-Museum_of_Illusions-Barcelona_Catalonia.html", "text": "Good and fun moment due to Janine who was there to explain us and take picture.\nThe museum is not big, but the moment was fun and cool.\nAnd we loved the location in the middle of serenity of Dubai Creek.\nThank you Janine for your smile and your kindness.", "publishedDate": "2019-10-07", "language": "en", "rating": 5}, {"id": 707120122, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d7914040-r707120122-Museum_of_Illusions-Barcelona_Catalonia.html", "text": "Well...it is a place where fun and creativity come together. You will not feel the time passing while you are in there. Take as much photos as you want and if you are alone, make sure you have a selfie stick or ask the team there to help you.", "publishedDate": "2019-09-06", "language": "en", "rating": 5}, {"id": 701836977, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d7914040-r701836977-Museum_of_Illusions-Barcelona_Catalonia.html", "text": "My boyfriend and me had a lot of fun taking amazing pictures and enjoying like kids. The dry pool was so much fun!  being a kid for couple of hours was an unforgattable experince. 100% recommended.", "publishedDate": "2019-08-22", "language": "en", "rating": 5}, {"id": 690202913, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d7914040-r690202913-Museum_of_Illusions-Barcelona_Catalonia.html", "text": "The Big Fun Museum was interesting but I wouldn't go in with high expectations. Each of the 5 \"museums\" are interesting but they're all very small. If you don't stop to take any photos you could walk through each in 5 minutes or less. Basically the whole museum is set up for you to take interesting photos, so if you want cool photos, go for it, but if photos aren't your thing you should pass. Keep reading for info on each \"museum\". \nThere are five \"museums\":\nGiant's house: includes a collection of extremely oversized everyday objects that you can take photos next to in order to give the illusion that you are in a giant's house playing with their things. There are about 20-25 items to pose with.\n\nSweets: includes large statues of assortments of candies and other sweets as well as a lot of pink and purple animals to pose with. Same here, about 20 different photo opportunities.\n\nTopsy Turvy: This one is really cool and if you opt to get a ticket for one \"museum\" only I suggest this one. This one has a bunch of different rooms staged upside down. if you take a picture of yourself and include both the ceiling and floor in your picture it will look like you're dangling from the ceiling. This one was really crowded though when we went so you should practice patience while trying to take the perfect photo.\n\nBelieve it Or Not: First, I don't recommend this for really small children. My daughter is 2 and she screamed and cried through most of it. There are some scary things in there, especially the 3rd room which includes an exhibit that has several demos of ancient torture methods...the other rooms have some creepy wax figures in them too that may scare small children as well.\n\nDry Pool: Basically a giant ball pit. Don't let the photos fool you, there are no cool props to play with or take cool photos on. It's literally a giant ball pit that adults and children horse around in. If you only purchase a ticket for 1 \"museum\", I don't suggest you use it on this one.", "publishedDate": "2019-07-16", "language": "en", "rating": 3}, {"id": 678389126, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d7914040-r678389126-Museum_of_Illusions-Barcelona_Catalonia.html", "text": "Decided to kill some time so wanted something fun to do. This place is very clever in its paintings and angles you take your pictures at. Warm welcome and explanation of how it works.  Would happily visit again. ", "publishedDate": "2019-06-02", "language": "en", "rating": 5}, {"id": 675692723, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d7914040-r675692723-Museum_of_Illusions-Barcelona_Catalonia.html", "text": "Was a last minute decision as it was peeing down with rain, \n\nAt first,\nWe checked online with groupon was doing a deal 50% \nBut for some reason which wasn’t clear we couldn’t use it so best to check as its 20 euros each \nWe ended up paying 10€\n\nOnly downside the women on reception was rude, on her phone and didn’t seem bothering or wanted to explain why we couldn’t use it\n\nGreat for a good laugh and some\nPictures ", "publishedDate": "2019-05-22", "language": "en", "rating": 4}, {"id": 666296358, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d7914040-r666296358-Museum_of_Illusions-Barcelona_Catalonia.html", "text": "Another fantastic place to be. A bit difficult in the beginning to get the right position to get the good effects on the fotos, but great fun to find it out. Great for kids and adults as well.", "publishedDate": "2019-04-14", "language": "en", "rating": 5}, {"id": 664765674, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d7914040-r664765674-Museum_of_Illusions-Barcelona_Catalonia.html", "text": "€10 for 1 museum, €20 for 5 rooms and €30 for 9 rooms. Absolute rip off! Not illusions at all just pictures/paintings on the wall. Don’t bother, very poor value! Nothing interactive or illusionist at all. ", "publishedDate": "2019-04-08", "language": "en", "rating": 1}, {"id": 660504874, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d7914040-r660504874-Museum_of_Illusions-Barcelona_Catalonia.html", "text": "At face value this is just 3D paintings on walls where you can put yourself \"in the picture\" for a fun foto. Inexpensive and a good way to spend an hour-give it a try and have some fun!", "publishedDate": "2019-03-23", "language": "en", "rating": 4}, {"id": 659369410, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d7914040-r659369410-Museum_of_Illusions-Barcelona_Catalonia.html", "text": "It’s off of The Rambla and a great stop for families especially ones traveling with smaller children! This was a fun stroller break where he was able to get up, climb, and crawl through the museum! Well worth the stop :)", "publishedDate": "2019-03-18", "language": "en", "rating": 5}, {"id": 656834469, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d7914040-r656834469-Museum_of_Illusions-Barcelona_Catalonia.html", "text": "From the moment we entered the museum, we knew it would be a fantastic experience. The staff are wonderfully welcoming and make the experience enjoyable. They are happy, helpful and comical. \n\nThe museum is full of different art that create photo illusions. So make sure you have a fully charged phone and a selfie stick if you’re visiting alone. A great experience if you’re fun loving and up for a laugh. ", "publishedDate": "2019-03-06", "language": "en", "rating": 5}, {"id": 653768720, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d7914040-r653768720-Museum_of_Illusions-Barcelona_Catalonia.html", "text": "Really good fun. Lots of pictures to take.\nSome of the photos you have to work out yourself.This can be abit baffling and maybe frustrating of you have kids.\n\nBut overall is fine", "publishedDate": "2019-02-20", "language": "en", "rating": 4}, {"id": 651981464, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d7914040-r651981464-Museum_of_Illusions-Barcelona_Catalonia.html", "text": "It is a very cool museum to see if you have kinds or you like cartoons. We had a lot of fun taking silly pictures. It really was not what we expected considering we had not read anything regarding the museum but we ended up having a lot of fun", "publishedDate": "2019-02-12", "language": "en", "rating": 5}, {"id": 649507724, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d7914040-r649507724-Museum_of_Illusions-Barcelona_Catalonia.html", "text": "“Museum” is a completely misleading term for this “experience”. Not worth your time or the ten euro price tag. Many other lovely places to go in Barcelona that are cheaper and much more entertaining. It’s just some painted walls, nothing illusion-like about it. Probably the worst tourist attraction I’ve ever been to. Spend your money on something else.", "publishedDate": "2019-02-01", "language": "en", "rating": 1}, {"id": 646033204, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d7914040-r646033204-Museum_of_Illusions-Barcelona_Catalonia.html", "text": "loved it\nkept the kids enteratained\nprice wasn't to bad\nstaff really friendly\nI would go back again   \n\n.", "publishedDate": "2019-01-15", "language": "en", "rating": 4}, {"id": 639095209, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d7914040-r639095209-Museum_of_Illusions-Barcelona_Catalonia.html", "text": "Quite ordinary and simple objects inside making me disappointed. It is quite a small house and especially for children not for adults. Simple illusion of objects and visuals. If you are a family with children under 12 or so then it is ideal.", "publishedDate": "2018-12-11", "language": "en", "rating": 2}, {"id": 637853348, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d7914040-r637853348-Museum_of_Illusions-Barcelona_Catalonia.html", "text": "Well spent hour of fun. Bring camera. Great for kids. Found just off La Ramble,you will be pleasantly surprised.", "publishedDate": "2018-12-06", "language": "en", "rating": 5}, {"id": 631598240, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d7914040-r631598240-Museum_of_Illusions-Barcelona_Catalonia.html", "text": "We went here to avoid the cold rain as it was close to our hotel. Definitely not worth a special trip. Basically not a museum at all and only one real illusion inside the sloping room, but otherwise a lot of paintings on walls where you position yourselves and take photos of each other, which do come out quite well on the whole. Pricey for 45 mins of entertainment at 10 euros each.", "publishedDate": "2018-11-07", "language": "en", "rating": 3}, {"id": 630538136, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d7914040-r630538136-Museum_of_Illusions-Barcelona_Catalonia.html", "text": "This is ok if you are looking for a cheap activity at €10. You can easily find discounts online too. It is just paintings on the wall and if you stand in the correct position you get a good photo. \nSo much more you can do in the city.", "publishedDate": "2018-11-03", "language": "en", "rating": 2}, {"id": 630435599, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d7914040-r630435599-Museum_of_Illusions-Barcelona_Catalonia.html", "text": "We got a leaflet which gave us a discount for entry. It was raining outside so it gave us something to do. You really have to make your own fun and everyone seemed to enjoy it, we were they for about an hour as it was quite busy. Lots of good pictures taken.", "publishedDate": "2018-11-03", "language": "en", "rating": 4}, {"id": 629335434, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d7914040-r629335434-Museum_of_Illusions-Barcelona_Catalonia.html", "text": "The whole this is a rip off - some painted walls and photo opportunities but nothing else. We were barely there for half an hour.", "publishedDate": "2018-10-29", "language": "en", "rating": 1}, {"id": 629186025, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d7914040-r629186025-Museum_of_Illusions-Barcelona_Catalonia.html", "text": "Lots of laughter imagining urself in the pic\n Small place could be done in 30 mins in a rainy day. 10 euro fun for all ages. Make sure u take ur camera with u. ", "publishedDate": "2018-10-28", "language": "en", "rating": 5}, {"id": 626107163, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d7914040-r626107163-Museum_of_Illusions-Barcelona_Catalonia.html", "text": "So badly done. Most of the time your shadow does not correspond to the painting! \nNo student price and it costs 10 euros. There is really no interest to go there. ", "publishedDate": "2018-10-18", "language": "en", "rating": 1}, {"id": 615481277, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d7914040-r615481277-Museum_of_Illusions-Barcelona_Catalonia.html", "text": "Totally not worth the price.\nJust some painted walls that have nothing to do with illusions, optical or physical.\nI don’t recommend visiting this museum with the thousands of other possibilities in this wonderful city, Barcelona.", "publishedDate": "2018-09-10", "language": "en", "rating": 1}, {"id": 611423786, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d7914040-r611423786-Museum_of_Illusions-Barcelona_Catalonia.html", "text": "Great and interesting museum where you can have a lot of fun! If you know how to take the pictures it can be really fun. \nTotally worth it and one of the must visit museum in Barcelona! Recommend!", "publishedDate": "2018-08-28", "language": "en", "rating": 5}, {"id": 606037525, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d7914040-r606037525-Museum_of_Illusions-Barcelona_Catalonia.html", "text": "Recently visited here with my partner. We got a voucher through Groupon so it was only €7 (€3.50 each) for the two of us. I really don't think it is worth the €10 each you would pay at the entrance. \nSome of the paintings were very good and worked well when photographed, some didn't look like a 3D illusion at all. It was much easier to do the ones with the sample pictures on the wall beside them. \nAlso there are camera symbols on the floor for you to stand to give you the correct angle for each photo. The attendant on the reception desk didn't tell us this and I just discovered it by chance after a few photos. Definitely more suitable for groups of 3s rather than 2s as we couldn't complete some of the pictures with only two of us. Would be a fun time filler activity on a wet day for children. ", "publishedDate": "2018-08-13", "language": "en", "rating": 3}, {"id": 604792545, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d7914040-r604792545-Museum_of_Illusions-Barcelona_Catalonia.html", "text": "I went to this place with my family really expecting a lot of visually innovative and interactive illusions. Was a trifle disappointed to discover it is just series of cleverly painted scenes on walls and floors into which the visitor can somehow appear to be be taking part when positioned in a certain way and the camera shot taken from a specific point in the rooms. Nothing really spectacular. \n\nThe teenagers seemed to have enjoyed it though. I also took a few photos for the money spent:-)", "publishedDate": "2018-08-09", "language": "en", "rating": 3}, {"id": 588671796, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d7914040-r588671796-Museum_of_Illusions-Barcelona_Catalonia.html", "text": "First off, the staff at counter were not friendly. \nSecondly : it was extremely hard to get good pictures due to the buildings terrible overhead lighting. (It was fun and would be great for families however). I will include some of the best pictures we got on our visit. (Also if you get the aerobus from airport, there is a map with a $2 off coupon for this place in it).", "publishedDate": "2018-06-18", "language": "en", "rating": 2}, {"id": 582133233, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d7914040-r582133233-Museum_of_Illusions-Barcelona_Catalonia.html", "text": "The only illusion worth speaking of is the illusion this place gave of being somewhere actually worth visiting. \n\nThis is not a museum. It is a series of backdrops you can stand by and take pictures. \n\nIf you are so desperate for quirky Instagram pics that you’d pay €10 to get some, this is perfect for you.\n\nI’d just point out that it was cheaper to see the collected works of Pablo Picasso, or an entire Roman city under the cathedral. \n\nBut again, if you really like wall paintings this may be for you.\n\nVisit ends by leaving through a fire door and being deposited into a back alley by some bins. It felt somehow apt. ", "publishedDate": "2018-05-23", "language": "en", "rating": 1}, {"id": 573603929, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d7914040-r573603929-Museum_of_Illusions-Barcelona_Catalonia.html", "text": "We didn't like this place. We thought there would be some optical illusions etc. However, it is a small place with painting on the wall. You stand close to the walls and get someone to take your picture making you look to be part of the scenery/event.\n\nIt was quite boring and at 10 euros per person, we don't we got our 40 euros worth. Disappointed. The restroom too was quite sad.", "publishedDate": "2018-04-15", "language": "en", "rating": 2}, {"id": 573256630, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d7914040-r573256630-Museum_of_Illusions-Barcelona_Catalonia.html", "text": "I was very disapointed. Bad paintings with even bad lighting. Ridiculous price of 10 € for that garbadge.\nGood only for kids.", "publishedDate": "2018-04-14", "language": "en", "rating": 1}, {"id": 571073809, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d7914040-r571073809-Museum_of_Illusions-Barcelona_Catalonia.html", "text": "Probably intentions to visit Museum of Illusions were higher than reality. Unfortunatelly pictures are mostly for kids, not running with now a days technologies. After first look it's getting too boring. ", "publishedDate": "2018-04-04", "language": "en", "rating": 3}, {"id": 569554022, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d7914040-r569554022-Museum_of_Illusions-Barcelona_Catalonia.html", "text": "You have to be young or young at heart (or perhaps have warped sense humor) to enjoy this “museum.”  It is really just 40-50 photo opportunities- but it is a blast. If you laughed when you read the museum description you will love it.  Come with a group for the best photo options.  An hour of photo fun. ", "publishedDate": "2018-03-29", "language": "en", "rating": 4}, {"id": 555961776, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d7914040-r555961776-Museum_of_Illusions-Barcelona_Catalonia.html", "text": "Definitely worth a visit, the art is fantastic and you can be very creative with your photos! Only criticism would be staff didn’t seem very friendly on entrance, but still worth going.", "publishedDate": "2018-01-23", "language": "en", "rating": 4}, {"id": 555374326, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d7914040-r555374326-Museum_of_Illusions-Barcelona_Catalonia.html", "text": "Shop converted into \"museum\" with some paintings on the wall for cell phone pics. \n\nCannot call this more than street art exhibit. Nothing special. Waste of time considering all the other things to see in Barcelona.", "publishedDate": "2018-01-22", "language": "en", "rating": 1}, {"id": 550288708, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d7914040-r550288708-Museum_of_Illusions-Barcelona_Catalonia.html", "text": "You can enjoy and have a good time here while taking cool and funny pictures only for 5 €. Be creative! ", "publishedDate": "2017-12-30", "language": "en", "rating": 3}, {"id": 528546172, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d7914040-r528546172-Museum_of_Illusions-Barcelona_Catalonia.html", "text": "Visited here and was surprised by the varied illusions on display. I really enjoyed the two rooms that confuse your senses and my wife still can't understand how the seat on rollers goes uphill! Find time to visit. Highly recommended ", "publishedDate": "2017-09-30", "language": "en", "rating": 4}, {"id": 528351392, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d7914040-r528351392-Museum_of_Illusions-Barcelona_Catalonia.html", "text": "The paintings are made with strange perspectives so that if you stand in front of them a certain way, and the person with camera stands a certain way, it will look like you’re part of the picture.  It’s an interesting concept; it works for most of the paintings but not all.  Worth going to to pass the time, but not a big draw.", "publishedDate": "2017-09-29", "language": "en", "rating": 3}, {"id": 527286837, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d7914040-r527286837-Museum_of_Illusions-Barcelona_Catalonia.html", "text": "Not really a museum but a number of paintings on a wall, by standing in a specific point it gives an illusion that you are in a scene.\n\nOK for a wet afternoon but a little silly and at £10 each  a bit steep for what uou get\n\nDefiantly not for children - they will die of boredom", "publishedDate": "2017-09-25", "language": "en", "rating": 2}, {"id": 525237272, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d7914040-r525237272-Museum_of_Illusions-Barcelona_Catalonia.html", "text": "Totally a fun time for any age group, no stress at all to get amazing pictures. And funny enough we went in offseason and there still was a ton of people so better to go early morning not midday", "publishedDate": "2017-09-17", "language": "en", "rating": 4}, {"id": 516372721, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d7914040-r516372721-Museum_of_Illusions-Barcelona_Catalonia.html", "text": "We are two adults and we really enjoyed our visit. This is a really fascinating find. The drawings on the walls and floors were brilliant although the lighting made it rather difficult to take photos of them.\nThe price is 10euros. I can imagine it being rather high for a family. Would have loved it to be bigger.", "publishedDate": "2017-08-22", "language": "en", "rating": 4}, {"id": 514303600, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d7914040-r514303600-Museum_of_Illusions-Barcelona_Catalonia.html", "text": "It was ok, but we expected something else. There werde only paintings on the walls. And the Lightning sometimes very poorly. 10€ is too much. But we had fun for about an hour.", "publishedDate": "2017-08-17", "language": "en", "rating": 2}, {"id": 509401243, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d7914040-r509401243-Museum_of_Illusions-Barcelona_Catalonia.html", "text": "We visited with a ten and eleven year old.  They were disappointed.  The museum is misnamed, not a museum of illusions but a museum of illusion photo opportunities.  Make sure you fully understand what this museum offers before you go.  I can imagine couples or groups of kids enjoying themselves.  It didn't make for a good small families activity and was way too expensive for a family (€10 pp).", "publishedDate": "2017-08-06", "language": "en", "rating": 2}, {"id": 492646751, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d7914040-r492646751-Museum_of_Illusions-Barcelona_Catalonia.html", "text": "This was great, we are 23 & 25 year old girls and we absolutely loved this museum. Its well worth the 10Euros.", "publishedDate": "2017-06-12", "language": "en", "rating": 5}, {"id": 464360090, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d7914040-r464360090-Museum_of_Illusions-Barcelona_Catalonia.html", "text": "Some of the illusions are better than others. It was a bit of fun but there aren't many illusions (even if I would call them that) to make it worth the €10 fee. They do have free lockers at the entrance to dump your coats do that you can easily take pictures etc which was handy. ", "publishedDate": "2017-03-03", "language": "en", "rating": 3}, {"id": 463442916, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d7914040-r463442916-Museum_of_Illusions-Barcelona_Catalonia.html", "text": "we went with our 3 teenaged girls in the summer, its not really a museum but more like an atraction. the murals are great and it fits perfectly for the kids that never leaves their phones and have some more to share with their friends on line, really fun", "publishedDate": "2017-02-28", "language": "en", "rating": 4}, {"id": 453972538, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d7914040-r453972538-Museum_of_Illusions-Barcelona_Catalonia.html", "text": "It doesn't worth the 10 euro entrance if you're an adult but for kids it's brilliant \nUnder 6 years it's free. Grab vouchers from your hotel for 2euro minor\nIt's basically pictures on the wall that if you stand on them looks like you're part of it. I'm 29 and liked it but it's up to you. Located in a street at the beginning of las ramblas.", "publishedDate": "2017-01-22", "language": "en", "rating": 3}, {"id": 450095319, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d7914040-r450095319-Museum_of_Illusions-Barcelona_Catalonia.html", "text": "We found this Museum while we were searching for an attraction nearby. The reviews were very positive about the place, so we thought it must be a good place to visit. \n\nThe entrance fee is 9 euros per person, expensive for what you would see in return. \nWe spent around 30 minutes in the place trying to capture the perfect photo without any shadows. Unfortunately 90% of what we photographed had the person's shadow. See the images.\n\nThe paintings on the wall aren't very artistic, and you can notice they are badly done. Some of which were scratched and the paints peeled out and weren't event fixed.\n\nThe worse thing was the exit. You don't exit from where you entered. \nThe exit is basically a backdoor that takes directly to a side street. You have to be very carful when you're opening the exit door, or you will get hit by a car passing from the side street.", "publishedDate": "2017-01-07", "language": "en", "rating": 3}, {"id": 447891479, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d7914040-r447891479-Museum_of_Illusions-Barcelona_Catalonia.html", "text": "After visiting a REAL illusions museum in Palma de Majorca, this was a big disappointment. No illusions what so ever, only pictures painted on the walls for you to take photos with. \nMy partner named it: a poor man's photoshop...", "publishedDate": "2016-12-30", "language": "en", "rating": 1}, {"id": 445818204, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d7914040-r445818204-Museum_of_Illusions-Barcelona_Catalonia.html", "text": "Great place for the youngest. Has a fantastic variety of funny and great pictures, being literally part of a painting.\n10 Euros but you can get collect hotel vouchers for a discount.", "publishedDate": "2016-12-21", "language": "en", "rating": 5}, {"id": 439222219, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d7914040-r439222219-Museum_of_Illusions-Barcelona_Catalonia.html", "text": "This was an amizing experience, being part of a painting... don't think twice about that! Just make sure you collect from your hotel the voucher for a discount. We just had one and the lady in the cashier said that this is per person. We went to the hotel next door and picked more! The collection is great, but make sure you take the picture from the \"right\" corner.", "publishedDate": "2016-11-22", "language": "en", "rating": 5}, {"id": 437346683, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d7914040-r437346683-Museum_of_Illusions-Barcelona_Catalonia.html", "text": "Stumbled across this place when we got given the discount booklet from our host at our Airbnb, originally 10euros each, but with the 2euro discount it was 8 each which wasn't too bad. a handful of rooms with imaginative, some fun and some just damn right cool images to take quirky funny photos with, Definitely not a place to go on your own, as you won't be able to take the photos!... a little stuffy in there, but all in all good.", "publishedDate": "2016-11-15", "language": "en", "rating": 5}, {"id": 433566344, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d7914040-r433566344-Museum_of_Illusions-Barcelona_Catalonia.html", "text": "Enjoyed everything, but not that well explored.\nHas an amazing variety of funny and great pictures that allows us to take great photographs , almost seems like we are on a scenery. \nStill is a place not to miss it.", "publishedDate": "2016-11-01", "language": "en", "rating": 4}, {"id": 430988476, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d7914040-r430988476-Museum_of_Illusions-Barcelona_Catalonia.html", "text": "We had a blast taking our photos with these paintings behind us.  It really did look like we were actually in the scene.  It may seem a bit pricey, but it is alot of fun. Recommend.", "publishedDate": "2016-10-23", "language": "en", "rating": 4}, {"id": 430233540, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d7914040-r430233540-Museum_of_Illusions-Barcelona_Catalonia.html", "text": "The title says it all ! \nIts basically a bunch of rooms with pictures on the walls that you stand and take pictures against.  May appeal to under 7s but i suggest your time could be spent more wisely.\nThey need to improve on staffing and lighting because all we seemed to capture was a bunch of shadows.\nThere are plenty of better places to visit in Barcelona.", "publishedDate": "2016-10-21", "language": "en", "rating": 1}, {"id": 427295795, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d7914040-r427295795-Museum_of_Illusions-Barcelona_Catalonia.html", "text": "I went with my wife my son and a friend on a holiday and when we saw the people queuing out the door we knew that perhaps it wouldn´t be the best day to visit but since we had already bought our tickets online we went in anyway. \nThe \"museum\" consists of about 30 painted walls which depict various scenes ranging from famous paintings by Dalí to Star Wars. The paintings are on the whole very well done and try to include elements which enhance the 3d illusion when a photo is taken. The main problem is that because the place is so cramped and the paintings are right next to each other , if it is busy it can be very difficult to take a decent photo. My advice is if it is busy don't go in as it will spoil the experience. \nThe other main complaint I have is that quite of few of the lights had blown and had not been replaced which of course will impact on the quality of your photos unless you have a good camera with a decent flash. This shows that the people running the place do not invest any money in basic maintenance. Considering that this must be a money making machine for the owners it's pretty inexcusable. \nWe took about an hour to get around it but if you go on a quiet day you would probably only need 40 mins or so. \nIn conclusion I love the idea and if the place were bigger and well maintained I would very much recommend it.", "publishedDate": "2016-10-12", "language": "en", "rating": 3}, {"id": 414140696, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d7914040-r414140696-Museum_of_Illusions-Barcelona_Catalonia.html", "text": "Nice little quirky place. Imaginative and fun for kids. Could do with a bit more exhibits. Perhaps some helpers to guide/ take photos will enhance service experience. ", "publishedDate": "2016-09-03", "language": "en", "rating": 4}, {"id": 413380949, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d7914040-r413380949-Museum_of_Illusions-Barcelona_Catalonia.html", "text": "A great little museum which entertains effortlessly. A very simple space full of inventions to stimulate the mind. It was a nice change from historical buildings - we stayed for 90 minutes with our children 7&11. We could have whizzed around in 20mins but it was fun and provoked a lot of interest. The cycle machine to burn calories to 'earn' your crisps was a big hit! My daughter now want to be an inventor, patent her invention and make a fortune......! What more could I ask for?", "publishedDate": "2016-08-31", "language": "en", "rating": 5}, {"id": 408811589, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d7914040-r408811589-Museum_of_Illusions-Barcelona_Catalonia.html", "text": "It is an unusual kind of museum, but we enjoyed our visit there very much and we did not regret going there, so I definitely recommend it to anyone who thinks might have fun at this museum.", "publishedDate": "2016-08-22", "language": "en", "rating": 5}, {"id": 408605339, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d7914040-r408605339-Museum_of_Illusions-Barcelona_Catalonia.html", "text": "There was roughly 25 illusions and they varied in theme. We took pictures with many of the illusions and it was something different. Children are classified as adults when purchasing tickets so you will be paying 10 euros for each person. In saying that, your hotel, local shops or restaurants hold vouchers at their reception area which give you a discount of 2 euros per ticket.", "publishedDate": "2016-08-22", "language": "en", "rating": 4}, {"id": 404232629, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d7914040-r404232629-Museum_of_Illusions-Barcelona_Catalonia.html", "text": "We took this as a last day activity but it was great experience specially with kid. We spent almost two hours by posturing and  taking pictures. These pictures are totally someting else than traditional pictures next to sight. ", "publishedDate": "2016-08-11", "language": "en", "rating": 4}, {"id": 402058981, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d7914040-r402058981-Museum_of_Illusions-Barcelona_Catalonia.html", "text": "A camera is a must. \n\nTeenage and younger children will love it. I takes about an hour to complete taking dozens of hilarious photos and staying out or the way of other people trying to take their own photos.\n\nTop tip. One brochure gives you 2 euros of admission for each person so collect one brochure for each member of your group.\n\nThe location is great off Las Ramblas and near to food , shopping and Catalunya and Liceu Metro stations.", "publishedDate": "2016-08-06", "language": "en", "rating": 4}, {"id": 401223549, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d7914040-r401223549-Museum_of_Illusions-Barcelona_Catalonia.html", "text": "Grab your camera and get ready to have some fun! The scenes are sure to bring a smile to your face AND THE PHOTOS ACTUALLY COME OUT FANTASTIC!", "publishedDate": "2016-08-04", "language": "en", "rating": 5}, {"id": 395991910, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d7914040-r395991910-Museum_of_Illusions-Barcelona_Catalonia.html", "text": "Expected more , it's basically just taking photos, novelty kinda wears off after the first few. Got us out of the hot sun for an hour or so", "publishedDate": "2016-07-23", "language": "en", "rating": 3}, {"id": 388497715, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d7914040-r388497715-Museum_of_Illusions-Barcelona_Catalonia.html", "text": "Hand-painted sceneries with guides how to take photos, great fun for 1-2 hours. Was not crowded whn we visited but would think not so fun if you have to wait at each picture stop. Good for a rainy day activity.", "publishedDate": "2016-07-02", "language": "en", "rating": 4}, {"id": 387023241, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d7914040-r387023241-Museum_of_Illusions-Barcelona_Catalonia.html", "text": "We visited the museum of illusions and it was good fun. Make sure to take a camera or phone - otherwise it will quickly become a pointless visit.", "publishedDate": "2016-06-28", "language": "en", "rating": 4}, {"id": 352551590, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d7914040-r352551590-Museum_of_Illusions-Barcelona_Catalonia.html", "text": "My son loves optical illusions and really wanted to visit this museum.  We thought that it would have more activities and games for kids, but it was only several rooms with painted walls.  At first we didn't even understand the point, but after we realized that the museum was just a place to take funny pictures.  It would be really unfortunate if you came alone, as you definitely need someone to be in the picture and another person to take the picture, selfies won't work in this museum.  I thought the price was a little expensive 10€ per person and even kids over the age of 6 have to pay the same amount.", "publishedDate": "2016-03-03", "language": "en", "rating": 3}, {"id": 331085580, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d7914040-r331085580-Museum_of_Illusions-Barcelona_Catalonia.html", "text": "Its a great program if our kids are a little bit fussy and bored in museums. Guaranteed to every kid will love.", "publishedDate": "2015-12-06", "language": "en", "rating": 5}, {"id": 314017085, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d7914040-r314017085-Museum_of_Illusions-Barcelona_Catalonia.html", "text": "Avoid this place, Its terrible & such a waste of money. cost us €10 each to enter & its tiny & all you do is take photos of badly painted pics on the walls. Such a waste of money. ", "publishedDate": "2015-09-27", "language": "en", "rating": 1}, {"id": 308049561, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d7914040-r308049561-Museum_of_Illusions-Barcelona_Catalonia.html", "text": "We came across this museum accidentally and decided to go in.  Price a little steep but much fun to work interactively with the paintings and to photograph your friends/family in situ against the paintings. Illusions include the escalators going up - an angel hovering - throwing water at Salvador Dali and finding oneself under a serving dome of a waiter!  A good time was had but be prepared to a) act well b) contort yourself to get in position.", "publishedDate": "2015-09-08", "language": "en", "rating": 4}, {"id": 302408580, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d7914040-r302408580-Museum_of_Illusions-Barcelona_Catalonia.html", "text": "I spent 8 euros to enter the museum, the same I paid to go to Guëlls park, and this museum is just stupid and small. I didn't see any fun taking photos there. It shouldn't be called museum of ilusion, it should be called, 'museum of dumb photos'. But the good thing was that the entrance girl was very kind", "publishedDate": "2015-08-23", "language": "en", "rating": 1}, {"id": 302211454, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d7914040-r302211454-Museum_of_Illusions-Barcelona_Catalonia.html", "text": "This museum is quite cool and my daughter seemed to enjoy it. I didn't. Ok, the paintings and illusions are well planned and nicely painted but there are people tripping over each other to take photos. In any other country this museum would work quite well however, we are in Spain and the Spanish seem to have big problems with the concept of queues.", "publishedDate": "2015-08-22", "language": "en", "rating": 3}, {"id": 298464115, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d7914040-r298464115-Museum_of_Illusions-Barcelona_Catalonia.html", "text": "The place is quite fun to visit if you're a fan of taking photos. It is not an expensive visit and you can have a lot of fun posing with the different wall painting, some of which quite impressive.", "publishedDate": "2015-08-12", "language": "en", "rating": 4}, {"id": 291466831, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d7914040-r291466831-Museum_of_Illusions-Barcelona_Catalonia.html", "text": "This place is great fun and we got some great photos! Not too expensive either and a good way to escape the afternoon heat. Spent about 90 minutes here and got about 30 photos.", "publishedDate": "2015-07-22", "language": "en", "rating": 4}, {"id": 291263409, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d7914040-r291263409-Museum_of_Illusions-Barcelona_Catalonia.html", "text": "We stumbled onto this little fun attraction while strolling around in Barcelona. We took a lot of super cool photos at some of the painted scenes inside. I reccomend this attraction for kids of all ages.", "publishedDate": "2015-07-21", "language": "en", "rating": 4}, {"id": 285551593, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d7914040-r285551593-Museum_of_Illusions-Barcelona_Catalonia.html", "text": "We needed to pass some hours in Barcelona and stumbled upon this museum. It was great fun and full of imagination, we got some great photographs.\n\nDefinitely worth a visit if in the area ", "publishedDate": "2015-07-04", "language": "en", "rating": 5}, {"id": 282469308, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d7914040-r282469308-Museum_of_Illusions-Barcelona_Catalonia.html", "text": "An amazing place to spend an hour or two and what you get in return is an album of memorable pictures.  The illusions swept me off my feet, atleast I hadn't seen anything like that before.  \nThe girl at the counter volunteered to walk me through the museum and click my pictures as I was travelling alone. She patiently clicked my pictures (more than 50) and told me that I could ask her if I wanted more at the end.  For 10 Euros, it was a good deal. It is less than a km away from Las Ramblas where most tourists like to spend some time so both these places can be covered together! ", "publishedDate": "2015-06-23", "language": "en", "rating": 5}, {"id": 278913285, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d7914040-r278913285-Museum_of_Illusions-Barcelona_Catalonia.html", "text": "OMG. This place is absolutely fantastic. It wasn't too busy, thankfully and there are lots of different things to take pictures of, regardless of your age. They have parts for children, parts for lovers, so many different things, make sure you don't forget your camera though as you will be gutted! \nReasonably priced at 8 euros!", "publishedDate": "2015-06-09", "language": "en", "rating": 5}, {"id": 278261645, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d7914040-r278261645-Museum_of_Illusions-Barcelona_Catalonia.html", "text": "For 10 euros to u have a series of paintings with which if you take photographs intelligently you can get visuals which make for amusing photographs. Good fun for teens. Need 1 hour - 2 hours to take all good snaps", "publishedDate": "2015-06-06", "language": "en", "rating": 4}, {"id": 278180589, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d7914040-r278180589-Museum_of_Illusions-Barcelona_Catalonia.html", "text": "It was fun taking photos in surreal backgrounds; and one of the museum staff helped us, took photos from both of us in front of many backgrounds and suggested cool poses as well.  Check their web site for sample of backgrounds. 10 Euros per person was worth it especially because of the personal help the staff gave us as I mentioned above. Lots of laughs at the museum and afterwards when we saw our photos.  It brought up the kid in me.", "publishedDate": "2015-06-05", "language": "en", "rating": 4}, {"id": 271783638, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d7914040-r271783638-Museum_of_Illusions-Barcelona_Catalonia.html", "text": "I had a great time at the Museum of Illusions, for the budget friendly price and the helpful staff there, it made the experience that much more enjoyable. Remember in this museum it is all about imagination and perception, having a good camera, or being a good photographer doesn't hurt either but even with a camera phone(we basically used that) you can take great shots and get really funny or mind boggling pictures. ", "publishedDate": "2015-05-13", "language": "en", "rating": 5}, {"id": 269529304, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d7914040-r269529304-Museum_of_Illusions-Barcelona_Catalonia.html", "text": "New and cool place like no other in Europe.\nIt's full of beautiful wall paintings that create the illusion of depth.\nExcept the beauty of the paintings, you can be photographed in them, the result looks like you are a part of the painting.\nThe staff is very nice and helps, can take a photo of you without a problem.\n\nRecommended, Come with a camera and a good mood.", "publishedDate": "2015-05-02", "language": "en", "rating": 5}]}}]