[{"locationId": 8807498, "name": "Font de Sant Just", "placeType": "ATTRACTION", "reviewListPage": {"reviews": [{"id": 690456728, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d8807498-r690456728-Font_de_Sant_Just-Barcelona_Catalonia.html", "text": "A Font de Sant Just is a fountain dispensing potable water and is located just in front of the church and square of the same name. The church is great, but if I hadn't been on the lookout I wouldn't even have noticed the fountain. As fountains go, it simply decorated with 3 faces and has two taps.\n\nNot really an attraction.", "publishedDate": "2019-07-17", "language": "en", "rating": 2}, {"id": 621176066, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d8807498-r621176066-Font_de_Sant_Just-Barcelona_Catalonia.html", "text": "Things are always a little fuzzy when going back to 304 AD but, going on faith and whatever records the Romans left behind, Diocletian ended the lives of a nine year old boy and his thirteen year old brother on religious grounds.  Justus (the elder) and Pastor are believed to be the subject of this fountain's naming.\n\nThis is the second oldest fountain in Barcelona.  In 1367 this fountain, in the Placa de Sant Just, sprung to life.  The original three heads would have been the sources for the water.  Today there are 2 spigots between the 3 heads.  Up above is a single figure of what looks to be a young boy; suppositions are that this is a depiction of Saint Just(us).  But, after 100 years, who can really say with any certainty?\n\nIn 1831, it had a minor face-lift/reconstruction.  It still looks like it is original.\n\nStill, it is a medieval treasure, so simple and free of formality and pomp.  Amazing how the people of Barcelona can set up tables, chairs, and cafes around treasures like this that are 1,700+ years old.  Seems like they should be under protective glass.", "publishedDate": "2018-10-01", "language": "en", "rating": 4}, {"id": 617424021, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d8807498-r617424021-Font_de_Sant_Just-Barcelona_Catalonia.html", "text": "Interesting to look at but very easy to miss if you do not know it is there. If you come from the bottom of the road look back as it is behind you on the wall. \n\nNo information with it but worth looking at when walking past", "publishedDate": "2018-09-17", "language": "en", "rating": 3}, {"id": 505271927, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d8807498-r505271927-Font_de_Sant_Just-Barcelona_Catalonia.html", "text": "There are some great fountains in Barcelona but this one is simply average. However, what it does have is a great history to 2 children martyrs Saint Justin and Pastor and a great Placa on which it sits. You could not ask for a better square in the NE part of the Gothic Quarter than this quaint, hidden place. There are a couple of restaurants in the area that use it for outside seating, but otherwise it is a great setting for the fountain.", "publishedDate": "2017-07-24", "language": "en", "rating": 4}, {"id": 500171159, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d8807498-r500171159-Font_de_Sant_Just-Barcelona_Catalonia.html", "text": "This a little quaint little old fountain within the Place de Sant Just  which is a visit if you stumble upon it within the Gothic Quarter", "publishedDate": "2017-07-10", "language": "en", "rating": 4}, {"id": 492191727, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d8807498-r492191727-Font_de_Sant_Just-Barcelona_Catalonia.html", "text": "Nice old water source. Freshen up your face or fill a water bottle for a free clean drink! Why not? ?", "publishedDate": "2017-06-11", "language": "en", "rating": 5}, {"id": 427899718, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d8807498-r427899718-Font_de_Sant_Just-Barcelona_Catalonia.html", "text": "A not very big fountain,on a old stone wall,in Barri Gothic neighborhood.Not very impressive,at least in my opinion.Besides,there wasn't any running water on it...", "publishedDate": "2016-10-14", "language": "en", "rating": 3}, {"id": 385928981, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d8807498-r385928981-Font_de_Sant_Just-Barcelona_Catalonia.html", "text": "attractive fountain located in the Gothic Quarter. stumbled upon it by chance while strolling one evening.", "publishedDate": "2016-06-25", "language": "en", "rating": 4}, {"id": 380417169, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d8807498-r380417169-Font_de_Sant_Just-Barcelona_Catalonia.html", "text": "The Fountain of Saint Justus is in the small plaza of what today remains of the old cemetery outside the Basilica of Saints Justus and Pastor. The fountain was installed in 1367 but is now a 19th century version, and it features the image of the two martyred saints, whose relics were buried near this sight. Justus and his brother Pastor were two schoolboys (Justus was 13 years old, Pastor less than 9) who were killed in 304 A.D. for their faith. According to Roman poet Prudentius, the boys protested the prosecutions of Christians by the Roman governor under the order of Emperor Diocletian. They were caught, flogged, and beheaded outside the Spanish city of Alcalá de Henares. There is something eerie about this fountain that features the martyrs’ likeness, but it is well worth a quick visit if you are in the area. The fountain may be difficult to find since it is in the Gothic Quarters, which is sometimes tight and confusing. I would recommend that you locate the Plaza de Sant Jaume on Carrer de Ferran. From the plaza, turn down the Carrer de la Ciutat, which runs alongside one of the large governmental buildings at the plaza, the Ajuntament of Barcelona. You will see an official tourist office in one corner of the ground floor of this building. Past this office and along the Carrer de la Ciutat, take the first road to your left, Carrer de Hercules. You will then be walking along the side of the basilica until the end of this street, which will open into the basilica plaza. The fountain is at one edge of this plaza.", "publishedDate": "2016-06-06", "language": "en", "rating": 4}, {"id": 340845938, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d8807498-r340845938-Font_de_Sant_Just-Barcelona_Catalonia.html", "text": "This fountain is the oldest water source in Barcelona, dated from 1367, although its today’s appearance is designed in the 19th century. It has three human faces carved in stone under a relief of Sant Just among two shields.", "publishedDate": "2016-01-17", "language": "en", "rating": 4}]}}]