[{"locationId": 7052313, "name": "Bogatell Beach", "placeType": "ATTRACTION", "reviewListPage": {"reviews": [{"id": 756815294, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d7052313-r756815294-Bogatell_Beach-Barcelona_Catalonia.html", "text": "It sucks. Too many people, too many guys walking around selling beer, massage, etc. Not a place to relax definitely", "publishedDate": "2020-06-02", "language": "en", "rating": 2}, {"id": 739532045, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d7052313-r739532045-Bogatell_Beach-Barcelona_Catalonia.html", "text": "We were there in January, so it wasn’t about swimming or something similar, but morning atmosphete was beatiful, chill 😎", "publishedDate": "2020-01-16", "language": "en", "rating": 5}, {"id": 716233315, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d7052313-r716233315-Bogatell_Beach-Barcelona_Catalonia.html", "text": "If you visiting in summer, the temp can rise till 38deg. Bring your own beach umbrellas if you have them to avoid being harassed by the vendors at the beach. Be careful of the people who sell mojito and other drinks for 5 -10 euros... its a scam, the drink dont actually contain any alcohol. Overall, its a  nice beach and good for couples and friends.", "publishedDate": "2019-10-08", "language": "en", "rating": 5}, {"id": 715530028, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d7052313-r715530028-Bogatell_Beach-Barcelona_Catalonia.html", "text": "Travelling solo, had to pay 15 euros for a chair and was advised not to go to the sea as people would steal my things? A \nNo go!!!! ", "publishedDate": "2019-10-05", "language": "en", "rating": 2}, {"id": 710865017, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d7052313-r710865017-Bogatell_Beach-Barcelona_Catalonia.html", "text": "Oktovriou is the evening time for me to come home and get my luggage in Baghdad is the evening or evening evening or tomorrow morning ", "publishedDate": "2019-09-18", "language": "en", "rating": 5}, {"id": 710202817, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d7052313-r710202817-Bogatell_Beach-Barcelona_Catalonia.html", "text": "Walked from the hotel, great beautiful beach.  Fun to touch the sea.  Clean beach with local vendors and peddlers.", "publishedDate": "2019-09-16", "language": "en", "rating": 4}, {"id": 706095381, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d7052313-r706095381-Bogatell_Beach-Barcelona_Catalonia.html", "text": "The beach is lovely, the water is nice and on paper it has everything you would want. The restaurant on the front is lovely for food and the hurricane cocktail is AMAZING. \n\nBUT you cant relax there\n- lucky lucky men are relentless. They stalk people. It went from polite \"no thank yous\" to  \"NO\". \n- they run away when the police arrive, its amusing. They take the stuff away from the ones they catch and dig up their drinks they burry. \n- we witnessed a man casually filming topless women when he was on facetime with friends but couldn't prove it\n- never leave your bags unattended. We were sat next to some fellow brits and took turns with watching each others belongings.\n- the hightlight being a random angry man tried to slap some random woman and was taken down by three undercover police officers with battons. He was led away to then escape and run back for his shoes. It was unbelievably entertaining.\n\nWe spent four hours there before deciding that it was best to stick to our hotel. ", "publishedDate": "2019-09-03", "language": "en", "rating": 3}, {"id": 700348321, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d7052313-r700348321-Bogatell_Beach-Barcelona_Catalonia.html", "text": "Love going to a beautiful city like Barcelona and getting to spend some time at the beach. This was a nice clean beach with plenty of ppl enjoying the sea and sun. You can rent a lounger or lay on a towel. Your choice. Water gets deep fast but it’s a beautiful swim. ", "publishedDate": "2019-08-18", "language": "en", "rating": 5}, {"id": 697736048, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d7052313-r697736048-Bogatell_Beach-Barcelona_Catalonia.html", "text": "Great beach to spend the day people watching: apart from the annoying massage women who seem to have the memory of a goldfish.", "publishedDate": "2019-08-11", "language": "en", "rating": 5}, {"id": 696165704, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d7052313-r696165704-Bogatell_Beach-Barcelona_Catalonia.html", "text": "I enjoyed my visit to Bogatell beach. The water was light blue and cool, and leading up to the beach is this cute strip of little shops and cafes. The only drawback is it was very crowded. ", "publishedDate": "2019-08-06", "language": "en", "rating": 3}, {"id": 694838775, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d7052313-r694838775-Bogatell_Beach-Barcelona_Catalonia.html", "text": "There are not too many people here and there is a nice park where you can rest, have a stroll or eat something. The sea is not so clear as the other beaches", "publishedDate": "2019-08-01", "language": "en", "rating": 3}, {"id": 694228257, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d7052313-r694228257-Bogatell_Beach-Barcelona_Catalonia.html", "text": "I ve been there today and surprise surprise Rats yes Rats the ones that’s are always underground’s in the middle of the water floating death! \nI feel sorry about the rats they are death floating there and lot of people, kids and everyone bathing at the same place! \nBe alert! ", "publishedDate": "2019-07-30", "language": "en", "rating": 1}, {"id": 693985195, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d7052313-r693985195-Bogatell_Beach-Barcelona_Catalonia.html", "text": "In comparison to the Barcelona beach there's a lot less people here.\nThere's enough room to spread out and it's not overly cramped. You can rent parasols and chairs (not sure how much they cost though).\n\nThe sand is soft and the water is nice and clean. The water does get deep pretty quick though so might not be ideal for small children.", "publishedDate": "2019-07-30", "language": "en", "rating": 4}, {"id": 691203981, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d7052313-r691203981-Bogatell_Beach-Barcelona_Catalonia.html", "text": "Just a couple of miles north of the downtown beaches, this is a quieter and cleaner beach, and my preferred beach in Barcelona.", "publishedDate": "2019-07-20", "language": "en", "rating": 5}, {"id": 690177725, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d7052313-r690177725-Bogatell_Beach-Barcelona_Catalonia.html", "text": "I still like the beach by the W hotel the best but this is a nice beach. Sand and water but doesn't have the restaurants and patios.", "publishedDate": "2019-07-16", "language": "en", "rating": 4}, {"id": 689764140, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d7052313-r689764140-Bogatell_Beach-Barcelona_Catalonia.html", "text": "It's a beautiful place, unfortunately there aren't really any places to change (Just bathrooms) and no lockers to keep your things. This makes it a bit difficult for solo-travelers as you cannot leave your things unattended (Do invest in a waterproof case for your phone and other important things). There are very few people trying to sell you things on the beach which is nice. Unfortunately, it was still a bit too cold to swim at the end of May, so I was only able to dip my feet for a bit.", "publishedDate": "2019-07-15", "language": "en", "rating": 4}, {"id": 689487500, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d7052313-r689487500-Bogatell_Beach-Barcelona_Catalonia.html", "text": "Beautiful beach near the city. A 10 minute walk from the subway. \n\nWe found this beach to be more family oriented then Barceloneta and less crowded. ", "publishedDate": "2019-07-14", "language": "en", "rating": 4}, {"id": 687720932, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d7052313-r687720932-Bogatell_Beach-Barcelona_Catalonia.html", "text": "We had already strolled along the “tourist” beach (Barcelonetta).  Bogatell was very different.  Local people of all ages enjoying the white sand, clear water and boardwalk. All remarkably uncrowded on a beautiful June day. \nOur 3 generation family of 9 took a local bus from our apartment in the Eixample district and purchased a “beach mat\" from one of the many vendors on our short walk to the water’s edge.  A lovely, relaxing afternoon.", "publishedDate": "2019-07-08", "language": "en", "rating": 5}, {"id": 685509265, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d7052313-r685509265-Bogatell_Beach-Barcelona_Catalonia.html", "text": "Leave the shouts of Barceloneta’s sarong- and sangria-sellers behind; walk while keeping Frank Gehry's famous golden fish sculpture on your left (and eventually behind you), and you'll start to actually see some unoccupied stretches of sand. There’s ample space, plenty of sports courts, and, some nice chill out chringuitos to hang out by. ", "publishedDate": "2019-06-30", "language": "en", "rating": 5}, {"id": 677270296, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d7052313-r677270296-Bogatell_Beach-Barcelona_Catalonia.html", "text": "I’ve visited Bogatell Beach in March, when it was still too cold and windy to relax with a towel on the sand, but I got some rest on a bench along the promenade and I found the view in front of me was beautiful!", "publishedDate": "2019-05-28", "language": "en", "rating": 4}, {"id": 671522135, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d7052313-r671522135-Bogatell_Beach-Barcelona_Catalonia.html", "text": "Really great beach.\n\nEasy to get to in walking distance from the nearby hotels. Facilities here are very good, toilets, bars, volleyball nets, showers, deckchairs (at a cost) and not too far from other eateries. \n\nMinus the beach sellers it was very good. ", "publishedDate": "2019-05-05", "language": "en", "rating": 5}, {"id": 658400757, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d7052313-r658400757-Bogatell_Beach-Barcelona_Catalonia.html", "text": "A beautiful Sunday morning and we wanted to find something slow and leasurely. Checking online it came up with the beaches of Barcelona. Hop on the Metro and we were there, amongst thousands of Spaniards doing exactly the same as us. Wandering along the prom, arm in arm. OK, there were a few that were more energetic on roller blades,bicycles or jogging. But they never got in the way. Plenty of stop offs for drinks and/or toilets. An enjoyable few hours.", "publishedDate": "2019-03-14", "language": "en", "rating": 4}, {"id": 637392181, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d7052313-r637392181-Bogatell_Beach-Barcelona_Catalonia.html", "text": "Gorgeous beach in Barcelona, beautiful area, lots of fab seating and exercise machines on the promenade.  Lovely sandy 🏖 beach.  Plenty of restaurants and cafes to grab refreshments.\n\nThe upper promenade seating is lovely although  there are no barriers (there is an approximate 8ft drop). \n\nGreat for biking and roller skating! ", "publishedDate": "2018-12-04", "language": "en", "rating": 4}, {"id": 626868938, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d7052313-r626868938-Bogatell_Beach-Barcelona_Catalonia.html", "text": "A clean sandy beach with parasols, chairs and children's area. Plenty of sand and sea. Backed by a wide promenade with cycle way and grassy areas.", "publishedDate": "2018-10-20", "language": "en", "rating": 4}, {"id": 622577128, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d7052313-r622577128-Bogatell_Beach-Barcelona_Catalonia.html", "text": "Despite the fact that multiple Pages say so, there are NO lockers to keep valuables while you swimm, so if you go alone or with your partner you basicaly can not swimm. Or you can not go together wich really Just kills the hole point...", "publishedDate": "2018-10-06", "language": "en", "rating": 1}, {"id": 621436479, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d7052313-r621436479-Bogatell_Beach-Barcelona_Catalonia.html", "text": "There weren't a lot of people and salesmen around. Shops / restaurant aren't so close either. There is a free toilet near by. \nIf you prefer quiet and peaceful day at the beach (just like I do) then this is the perfect place for you.", "publishedDate": "2018-10-02", "language": "en", "rating": 5}, {"id": 619082515, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d7052313-r619082515-Bogatell_Beach-Barcelona_Catalonia.html", "text": "Bogatell beach is the best beach in Barcelona. It has the clearest water and it has a sandy surface all the way. The depth of the water level increases very slowly and is therefore perfect for families with children. McDonald's is very close and many possibilities to play beach volleyball as well! Enjoy", "publishedDate": "2018-09-24", "language": "en", "rating": 5}, {"id": 616470400, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d7052313-r616470400-Bogatell_Beach-Barcelona_Catalonia.html", "text": "We came here on Wednesday as we fancied a chilled out day after sightseeing the day before! The beach is clean and the water was warm after the initial chill factor! Bits of debris in the water but no worse than anywhere else in Spain. Yes there are hagglers selling very dubious looking cocktails, cans of beer and water but to be honest if you ignore them they just walk by - we didn’t find it a problem. A few restaurants near by where you can have a drink or meal but the staff are rude in the one we went to (can’t remember name of it). All in all a very pleasant day and it is packed ! By 3pm you couldn’t see sand for people but we liked it busy. There are loungers and parasols for hire but we just put towels down. Leave valuables at your accommodation though as I don’t think it’s safe to leave mobiles, cameras or large amounts of cash unsupervised whilst you go swimming. Having said this though, I left about €30 and my FitBit watch in my purse inside my beach bag whilst we was in the water for about 30 minutes and it was still there when we came back and so was our designer shades too so perhaps we were lucky ! I wouldn’t chance leaving an high end mobile in a beach bag hence no photos to show you! I would give the beach at Bogatell a thumbs up we had a marvellous day here.", "publishedDate": "2018-09-14", "language": "en", "rating": 5}, {"id": 612375681, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d7052313-r612375681-Bogatell_Beach-Barcelona_Catalonia.html", "text": "We got to the beach at 10.30am on a Thursday and it was already busy with people sunbathing and swimming in the sea.  Further down there were sunbeds and parasols for hire.  Along the walkway there are plenty of people jogging, cycling or playing table tennis.  There are various showers and toilets dotted around, however the toilet cubicles are very small.  As you'd expect there are numerous cafes along the beachfront.  All in all it's a lovely beach to chill from city life", "publishedDate": "2018-08-30", "language": "en", "rating": 4}, {"id": 610819208, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d7052313-r610819208-Bogatell_Beach-Barcelona_Catalonia.html", "text": "This is a better option among the multiple Barcelona beaches which is easily accessible by public transport - the sand is nice, the beach is relatively clean and the water is pleasant. I was safe because I always carried my valuables with me in a water proof pouch as Barcelona is notorious for pickpockets. Unfortunately there are a lot of haggling (beach towels, beer, water, massage, etc) but these people aren't pushy nor aggressive. There are showers and changing cabinets and multiple cafes nearby.", "publishedDate": "2018-08-27", "language": "en", "rating": 4}, {"id": 610648716, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d7052313-r610648716-Bogatell_Beach-Barcelona_Catalonia.html", "text": "We were here three times. Half an hour was the way to the beach from Barcelo Sants Hotel, by public transport. (Thats OK.) The beach is clean and calm. The water was clean. There is no tumult on the beach. \nToilet and shower are in the right amount on the beach. Two deck chairs and one para-sol were 30 euro. \nThe restaurants are in the right number on the beach.  Lots of people would come to sell you drink/food/rug/massage. (it was a bit confusing)", "publishedDate": "2018-08-26", "language": "en", "rating": 4}, {"id": 609033208, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d7052313-r609033208-Bogatell_Beach-Barcelona_Catalonia.html", "text": "We explored along the beach and it was beautiful with nice sand.  There is a great walkway all along the sand where you can take a long walk.", "publishedDate": "2018-08-21", "language": "en", "rating": 4}, {"id": 607633470, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d7052313-r607633470-Bogatell_Beach-Barcelona_Catalonia.html", "text": "Pay attention in this beach, you may find it crowded and placed in the center, but you could be victim of vandalism and theft. We left the car in the parking in front of the beach just nearby a well frequented restaurant \"Can fisher\", after 2 hours (4 pm) we found the car broken... And Police said that it's very usual and there are always cars that are broken in broad daylight. An advice, leave nothing in the car. ", "publishedDate": "2018-08-18", "language": "en", "rating": 1}, {"id": 606911418, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d7052313-r606911418-Bogatell_Beach-Barcelona_Catalonia.html", "text": "This is a super option to avoid the mass in Barceloneta. Within reach (metro L4 - Llacuna), the water is clean and it’s surrounded by nice chiringuitos", "publishedDate": "2018-08-15", "language": "en", "rating": 5}, {"id": 605367080, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d7052313-r605367080-Bogatell_Beach-Barcelona_Catalonia.html", "text": "We decided to spend the afternoon here instead of at Barceloneta Beach.  The beach was wonderful-clean, safe and relaxing.  We rented chairs and an umbrella for 30 euros for the day and it was worth it.  An afternoon well spent.  ", "publishedDate": "2018-08-11", "language": "en", "rating": 5}, {"id": 604215599, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d7052313-r604215599-Bogatell_Beach-Barcelona_Catalonia.html", "text": "This beach is packed, dirty and disgusting. After 5pm turns into a party.\n\nThe ajuntament (city council) should patrol the beach and fine people for dropping rubbish and cigarette butts. \n\nAlso stop the annoying people selling drinks to you every 3 minutes. Opposite of relaxing. ", "publishedDate": "2018-08-08", "language": "en", "rating": 1}, {"id": 604081130, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d7052313-r604081130-Bogatell_Beach-Barcelona_Catalonia.html", "text": "It's a nice sandy beach not too much people. Clean water and the waves are soo nice .nice cafes and restaurants in the area .this one in the pic was nice", "publishedDate": "2018-08-07", "language": "en", "rating": 4}, {"id": 600553070, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d7052313-r600553070-Bogatell_Beach-Barcelona_Catalonia.html", "text": "Beach is clean, sandy and big. Children definitely had a lot of fun there.\n\nWe rented two beds and 1 parasol which costed 30€ (not cheap).  Be prepared lots of people would come to sell you massage, rug, etc.\n\nI didn’t see changing facilities nearby but definitely shower for flushing ", "publishedDate": "2018-07-28", "language": "en", "rating": 4}, {"id": 599224266, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d7052313-r599224266-Bogatell_Beach-Barcelona_Catalonia.html", "text": "Barcelona officially has 10 beaches, but for most people, it is just one long beach. Generally the further away from Barceloneta beach the less busy the beaches become.", "publishedDate": "2018-07-24", "language": "en", "rating": 5}, {"id": 593546510, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d7052313-r593546510-Bogatell_Beach-Barcelona_Catalonia.html", "text": "We strolled up to this beach whilst spending the day in the area. It was mid evening, and a lot of people had gone home, so the beach was pretty quiet and peaceful.", "publishedDate": "2018-07-06", "language": "en", "rating": 4}, {"id": 593449354, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d7052313-r593449354-Bogatell_Beach-Barcelona_Catalonia.html", "text": "We enjoyed our time in the beach , not so crowded. Both  walkways above andin the beach are nice and useful for strollers like I had.  The showers well placed so you can have both beach and city day. Lovely ", "publishedDate": "2018-07-06", "language": "en", "rating": 5}, {"id": 588111397, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d7052313-r588111397-Bogatell_Beach-Barcelona_Catalonia.html", "text": "Kids enjoyed this beach for the day.  There are public bathrooms every block or so, but unless you can do it in this tight space (about the size of an airplane bathroom), there is no good place to change from swimsuits to street clothes.  A large number of the ladies were topless.  Overall there's no much scenic about this beach - it's just located very close to a major city, so it's popular due to location.  The few restaurants nearby have exorbitant prices with mediocre food, so we ended up at McDonald's, which was still nearly US$50 for 6 people.", "publishedDate": "2018-06-17", "language": "en", "rating": 3}, {"id": 585406348, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d7052313-r585406348-Bogatell_Beach-Barcelona_Catalonia.html", "text": "We had a lovely day at this beach. The beach itself was clean, there is a nice walkway behind it for runners or if you feel like a seaside stroll. There are cafes if you get hungry or thirsty (but we do recommend bringing things with you like water, etc, to save as you pay extra for the convenience). The only issue we had were the bathrooms were extremely filthy and it was hard to find changing areas. ", "publishedDate": "2018-06-05", "language": "en", "rating": 4}, {"id": 582788795, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d7052313-r582788795-Bogatell_Beach-Barcelona_Catalonia.html", "text": "Loved this beach, it really is so clean, nice and sandy with lots going on. There are stone seats and benches everywhere along the top, you can walk for ages along the seafront or just sit and relax. Loads of bikes to hire, ping pong tables, volleyball areas and lots of places to eat and drink, plenty of loos available too, you can hire beds and parasols but I thought these expensive, it cost us 30 Euro for the day, one of the best beaches I have experienced loads you can do", "publishedDate": "2018-05-26", "language": "en", "rating": 5}, {"id": 580356844, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d7052313-r580356844-Bogatell_Beach-Barcelona_Catalonia.html", "text": "If you want to escape from brick and mortar views then this is a good relaxing beach just at the end of La Ramblas. Good for enjoying sunny days. Its good for swimming.", "publishedDate": "2018-05-15", "language": "en", "rating": 4}, {"id": 572586382, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d7052313-r572586382-Bogatell_Beach-Barcelona_Catalonia.html", "text": "Perfect beach for spending an afternoon / evening. Wasn't too crowded. Lots of kids around having a good time. ", "publishedDate": "2018-04-11", "language": "en", "rating": 5}, {"id": 563373873, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d7052313-r563373873-Bogatell_Beach-Barcelona_Catalonia.html", "text": "Whenever possible I like to have a \"beach day\" during travel when there is no schedule for part of the day. This was a great beach but crowded. It was a nice walk down the Las Ramblas del Pobleneu from my hotel.", "publishedDate": "2018-02-28", "language": "en", "rating": 4}, {"id": 559620776, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d7052313-r559620776-Bogatell_Beach-Barcelona_Catalonia.html", "text": "This beach of Barcelona is very nice for walking. You can enjoy the great view over the beach to the sea.", "publishedDate": "2018-02-10", "language": "en", "rating": 4}, {"id": 555510185, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d7052313-r555510185-Bogatell_Beach-Barcelona_Catalonia.html", "text": "Me and my husband visited Bogatell in April, 2017. It was a pretty beach, we spent a great time there. The weather was awesome, the sunset breathtaking, after travelling from a northern place, it was a heavenly warmth for us! We strolled lazily and ate in the nearby restaurant. Overall it was a memorable day in a warm beach.", "publishedDate": "2018-01-22", "language": "en", "rating": 5}, {"id": 555322965, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d7052313-r555322965-Bogatell_Beach-Barcelona_Catalonia.html", "text": "Loved that this wasn't a super crowded beach. The water was So Clear! It was beautiful! We LOVED our time here. My 7, 5, 2 and 1 yr olds enjoyed playing in the sand and floating in the waves", "publishedDate": "2018-01-21", "language": "en", "rating": 5}, {"id": 550714224, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d7052313-r550714224-Bogatell_Beach-Barcelona_Catalonia.html", "text": "Very nice and clean beach, where you can enjoy awesome sunsets whether you choose to sit on a bench to admire the view or you take long walks or bicycle rides (during winter time).", "publishedDate": "2018-01-01", "language": "en", "rating": 3}, {"id": 538319022, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d7052313-r538319022-Bogatell_Beach-Barcelona_Catalonia.html", "text": "After non stop museums, walking and adventures we decided on consecutive days on this beach and overall had a great time. We did go all out and spend on chairs, umbrellas that are owned by the beachside restaurants. We also ordered drinks and snacks - and yes it would be cheaper bringing your own - really?  Life and short... relax, take in the surroundings and have fun!!  Lots of people watching. Enjoyed the lady who monitored (for tips) the public washroom - she ensured feet were washed and not tracking in sand, and keep soap available and doled out toilet paper. Ingenious!!  The touts selling blankets and wraps are always trying to out fox the police and seem to have a racket going with the beach restaurants. Pretty amusing and added to the people watching fun", "publishedDate": "2017-11-04", "language": "en", "rating": 4}, {"id": 537662669, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d7052313-r537662669-Bogatell_Beach-Barcelona_Catalonia.html", "text": "After spending more than 2 weeks touring Spain, this beach was a relaxing break! :) Beach volleys... warm sunshine... cold draft beer... blue waters... this was life in soothing simplicity! ", "publishedDate": "2017-11-01", "language": "en", "rating": 5}, {"id": 536592703, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d7052313-r536592703-Bogatell_Beach-Barcelona_Catalonia.html", "text": "spent the day here in august. got there 10am and almost had the place to ourselves , it soon got busy though . got the metro to bogatell and it was a short 5-10min walk from there to the beach.  there are public toilets which were out of loo roll, so bring your own just in case. \nwent to the macdonalds across the road and bought an ice cream and cold beer for cheap price then sat by the beach with it, was lush... and a lot cheaper the the beachside bars. \nwatch out for the men going around selling sangria....i thought they were from the restaurants but later saw them making up drinks up on the floor, getting ice and fruit out of a plastic carrier bag.", "publishedDate": "2017-10-28", "language": "en", "rating": 4}, {"id": 534026218, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d7052313-r534026218-Bogatell_Beach-Barcelona_Catalonia.html", "text": "My family of four spent a day on this beach in early October. It was a very nice experience. Sand was clean and water was crystal clear. As nice as any beach we have visited in the US. As other posters have stated you can rent umbrellas and  chairs for 10 Euro each per day. There are also vendors selling blankets and drinks. There are several small beach restaurants serving a very diverse menu. There is also a large concrete walkway excellent for running, biking, and people watching. Was only about a 12 Euro 10 minute cab ride from downtown Barcelona and Taxis were plentiful for the return trip. One poster mentioned this was a clothing optional beach. We did not experience that just the normal topless women which is the case on virtually all beaches in Spain.", "publishedDate": "2017-10-18", "language": "en", "rating": 5}, {"id": 533253738, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d7052313-r533253738-Bogatell_Beach-Barcelona_Catalonia.html", "text": "My wife and I wanted to spend a day at the beach and we picked this one as it seemed a little less touristy than Barcelonetta. We arrived before noon and had no trouble getting lounge chairs and an umbrella. The people watching is good and the vendors weren’t overly obnoxious.  For prudish Americans, this is a clothing optional beach, as I expect are most European beaches. It’s not a big deal and everyone just did their own thing. It was a great way to spend the day and the restaurants on the beach were good.", "publishedDate": "2017-10-15", "language": "en", "rating": 5}, {"id": 530191448, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d7052313-r530191448-Bogatell_Beach-Barcelona_Catalonia.html", "text": "We liked the beach by the W hotel but this is a nice beach too.\nJust preference.\nIn any case we walked along this beach too because there's just something being near the water.", "publishedDate": "2017-10-05", "language": "en", "rating": 4}, {"id": 525255313, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d7052313-r525255313-Bogatell_Beach-Barcelona_Catalonia.html", "text": "This was by far the best beach in Barcelona. Took us maybe 30 minutes on the metro from rambla cataluyna to get here but so worth it! This beach is a thousand times less crowded and touristy compared to barceloneta beach which my family and I were so thankful for. Yes you still get the odd person selling you something but no where near as chaotic as the other beach and you aren't sitting on top of each other. An umbrella/sun lounger will cost you 10 euros for the whole day but totally worth it. The water is a lot cleaner over here as well. There is a super cute little restaurant on the beach where they will bring drinks and food down to you but they have these beds and couches you can lie out on while eating up at the restaurant as well which we loved! We came here twice and loved it each time!! Definetely would recommed you going to this beach instead.", "publishedDate": "2017-09-17", "language": "en", "rating": 5}, {"id": 524611021, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d7052313-r524611021-Bogatell_Beach-Barcelona_Catalonia.html", "text": "A really nice beach! €10 to hire a sunbed right next to the sea. The water is really nice with pretty big waves. There aren't any dodgy people walking around, only a few random men walking around trying to sell a variety of items; but it's impossible to get away from them in Barcelona. \nWe read before we went that there are lockers, but there are not any. We went to the information centre on the beach and they told us to go to Barceloneta for lockers. Instead, we brought a rucksack and hired sunbeds and ran a combination lock through the zips of the bag and around a leg of the sunbed in order to secure it. Lots of other groups just left their belonging out, and we didn't see anything suspicious happening. \n\nThere are places to eat/drink on the beach, and a McDonald's nearby if you want a cheaper option", "publishedDate": "2017-09-15", "language": "en", "rating": 5}, {"id": 521944300, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d7052313-r521944300-Bogatell_Beach-Barcelona_Catalonia.html", "text": "We decided to take the metro to the beach...& Llacuna was nearer than Bogatell weirdly...Short stroll then just that delicious sight of sand & sea. And there was a superb bar two seconds away-one of two easy to reach places to dive into in order to get out of that sun...! ", "publishedDate": "2017-09-06", "language": "en", "rating": 4}, {"id": 515924371, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d7052313-r515924371-Bogatell_Beach-Barcelona_Catalonia.html", "text": "I love Barcelona! The beaches are amazing. Mostly for people watching.  The mojitos were to die for and the water was a little cold for me. I am from Florida but you can't go to Barcelona and not take a dip in the Mediterranean", "publishedDate": "2017-08-21", "language": "en", "rating": 4}, {"id": 514980067, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d7052313-r514980067-Bogatell_Beach-Barcelona_Catalonia.html", "text": "I had two beach days I wanted to spend in Barcelona and I opted for Bogatell Beach and was not disapointed. Nova Icaria - just next to it - was also clean, but to close to the port and the water was dirty, so I just walked up north to Bogatell Beach. If you need a chair costs 10€, the same as an umbrella. You can always lay on the sand and if you are near the bar, the waiters will bring you fresh, cold drinks to your place.", "publishedDate": "2017-08-18", "language": "en", "rating": 4}, {"id": 513125079, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d7052313-r513125079-Bogatell_Beach-Barcelona_Catalonia.html", "text": "Everybody goes to the Barceloneta beach. That's fun, if you like strange people on your lap. Bogatell beach is 2/3 more stops with the metro and a 10/15 min walk from there, but it is less crowded. Clean beach, more locals and you could even work on your gym routine once you are done swimming. Highly recommend it.", "publishedDate": "2017-08-15", "language": "en", "rating": 4}, {"id": 512104740, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d7052313-r512104740-Bogatell_Beach-Barcelona_Catalonia.html", "text": "To bogatell beach you have to walk a bit more then to the other parts of the city Beaches ( or take public Transportation) but it is worth it. \nIt is calmer then the other areas and Not so super crowded. It is more about Enjoy your Life and Not only about watching People. \nTherefore it is less tourists too ;)\nThe Water Quality is surprisingly good for a City beach so close to the Port and of course it has wonderful bars and restaurants with Great see View.", "publishedDate": "2017-08-13", "language": "en", "rating": 5}, {"id": 511982155, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d7052313-r511982155-Bogatell_Beach-Barcelona_Catalonia.html", "text": "Clean and less crowdy it is very nice for relaxing and comparing with Barceloneta it's way more clean and also the water! Enjoy it! ", "publishedDate": "2017-08-12", "language": "en", "rating": 5}, {"id": 509653749, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d7052313-r509653749-Bogatell_Beach-Barcelona_Catalonia.html", "text": "The beach is definitely for those seeking a quiet, relaxing atmosphere, not excluding fun activities. Table tennis,  volleyball and beach gym are all available. The restaurants serving the beach also have great food and bevarages. You could rent an umbrella and two beach seats for 18 €, but that is optional. The beach is open all day.", "publishedDate": "2017-08-07", "language": "en", "rating": 5}, {"id": 506103029, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d7052313-r506103029-Bogatell_Beach-Barcelona_Catalonia.html", "text": "Out of the beaches I have seen in Barcelona, this one was the best. It is wide, with a lot of volleyball courts, palm trees, restaurants, showers and big waves. It really gives you the summer-in- spain kind of vibe but it is also kind of tricky (as all the beaches in B) because you never know how clean the water is going to be. I think the safest call is to go earlier in the day even though the first time we went was in the evening and it was perfectly clean. The second time, however, it was gross - full of leafes, paper, plastic, panty liners, my bf even thinks he saw a dead rat/kitten rolling on the coast. I think it depends on the sea currents or the ships release their trash into the sea. We experienced the dirty sea on Barceloneta and Badalona as well, all in the afternoon hours.", "publishedDate": "2017-07-27", "language": "en", "rating": 5}, {"id": 506102768, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d7052313-r506102768-Bogatell_Beach-Barcelona_Catalonia.html", "text": "We only visited one beach in Barcelona so cant comapre to others. Bogatell beach was large and wasnt too crowded. There are bars and restaurants that will serve food and drinks to where you are sitting. We hired an umbrella for 5 euro so our baby had some shade when playing", "publishedDate": "2017-07-27", "language": "en", "rating": 4}, {"id": 503989968, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d7052313-r503989968-Bogatell_Beach-Barcelona_Catalonia.html", "text": "If you are looking for a beach with big waves, this is the place. My son and I had blast playing in the waves for hours. The beach was nice and the sand was great compared to the rocky shore of Barceloneta. The have outdoor showers. The beach was not very crowded. Well worth coming here over Barceloneta.", "publishedDate": "2017-07-20", "language": "en", "rating": 4}, {"id": 503396469, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d7052313-r503396469-Bogatell_Beach-Barcelona_Catalonia.html", "text": "Playa Del Bogatell:\n\nThis is a very beautiful beach which unlike many of the beaches I have seen around the world is not tricky at all.\nI loved it so much and people was helpful and friendly.\nit was like 10 mindsets from my hotel.", "publishedDate": "2017-07-19", "language": "en", "rating": 4}, {"id": 502628032, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d7052313-r502628032-Bogatell_Beach-Barcelona_Catalonia.html", "text": "Was visiting in the heart of the summer heat. Other beaches were packed with mainly young people. Take the 59 bus to the final stop and visit Bogatell beach instead. People are mainly locals or other tourists staying in the area. Family friendly, lots of diverse people. Found the atmosphere very welcoming and relaxing.", "publishedDate": "2017-07-16", "language": "en", "rating": 5}, {"id": 495886536, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d7052313-r495886536-Bogatell_Beach-Barcelona_Catalonia.html", "text": "It's hard to find a beach in a city, in Barcelona the beaches are man made so don't expect soft sand, however I love sitting on this beach in Barcelona as there's so much diversity ", "publishedDate": "2017-06-25", "language": "en", "rating": 5}, {"id": 494194959, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d7052313-r494194959-Bogatell_Beach-Barcelona_Catalonia.html", "text": "Not being a beach person, more of a wanderer, beaches really are somewhere I like to avoid. However, discretion being the better part of valour, off to the beach me and my wife go. busy but roomy, volleyball and beach tag rugby being played. Loads of people just lazing about, reading, people watching. Large areas of eth beach are flat and easily observable to little ones, if you have them. Shoreline is easily accessible, but once in the water, gets 6 foot deep, twenty foot out, so unconfident swimmers can still enjoy. Plenty of beach 'vendors' for drinks, but plenty of 'Supermercat' to fill up your cold bag en route.", "publishedDate": "2017-06-19", "language": "en", "rating": 4}, {"id": 492123491, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d7052313-r492123491-Bogatell_Beach-Barcelona_Catalonia.html", "text": "Platja del Bogatell happened to be the closest beach to our apartment, so we were drawn to it for that reason. But, as a family of four looking for relaxation, it turned out to be a great beach experience for us.  There are lots of people - locals and tourists alike - playing volleyball, sunbathing, swimming and so on, and there are two or three beach pubs in the vicinity, so it's active and exciting. At the same time, it lacks the throngs of people, plethora of bars, and accompanying noise one encounters just a little farther south (platja de sant sebastia, for example, which is also nice - just a lot more crowded and a lot busier).  We returned multiple times during our brief stay in Barcelona, including for beautiful views of the moon over the sea, as well as a stunning view of the sunrise.", "publishedDate": "2017-06-11", "language": "en", "rating": 4}, {"id": 489191244, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d7052313-r489191244-Bogatell_Beach-Barcelona_Catalonia.html", "text": "Don't get me wrong, I really liked Barcelona, but there were times where I still felt like I was in America (I probably didn't do Barcelona right :/), but when I stumbled upon this beach, I finally felt like I was in another country. It's a nude beach, which I didn't know before going, and I absolutely loved it. Everyone was respectful, carefree and I felt very safe. The beach itself was very clean. There were places to get drinks and a couple restaurants on the beach. The beach was a bit crowded the day we went (it was 85 and sunny), but we had plenty of space to lay out. There's a cool restaurant call Boo's right on the beach that looked cool, but we didn't end up going there.", "publishedDate": "2017-05-30", "language": "en", "rating": 4}, {"id": 488150736, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d7052313-r488150736-Bogatell_Beach-Barcelona_Catalonia.html", "text": "Short distance from city center, but so much more relaxing than other beaches in BCN. Drinks served on the beach by the beachbars.", "publishedDate": "2017-05-27", "language": "en", "rating": 5}, {"id": 476704610, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d7052313-r476704610-Bogatell_Beach-Barcelona_Catalonia.html", "text": "This was the closest beach to our hotel, and thankfully it was by far the least crowded out of all the BCN beaches that we saw. \n\nThere was always space at the restaurants, on the loungers and was never too busy. \n\nLoads of people playing volleyball, so keeps you entertained while relaxing! \n\nThe best restaurant/bar there was Vai Moana for us, we had breakfast and lunch there and they had a great selection of drinks!", "publishedDate": "2017-04-18", "language": "en", "rating": 5}, {"id": 475378417, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d7052313-r475378417-Bogatell_Beach-Barcelona_Catalonia.html", "text": "Carried on walking along this beach as part of my walk from Museu Blau and it looked incredibly well organised in terms of all of the volleyball matches and the coaching taking place and the equipment looked well looked after.", "publishedDate": "2017-04-13", "language": "en", "rating": 4}, {"id": 472209860, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d7052313-r472209860-Bogatell_Beach-Barcelona_Catalonia.html", "text": "Please don`t go here if you want to take a bath, in order to do so, go to Costa Brava. There a lot of options there...", "publishedDate": "2017-04-02", "language": "en", "rating": 2}, {"id": 470944816, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d7052313-r470944816-Bogatell_Beach-Barcelona_Catalonia.html", "text": "While this beach is quite far from the centre, it is worth going to. All the tourists go to Sant Miquel or Barceloneta, which makes it super, super crowded, and annoying. There aren't annoying beer, body shawl, water venders, Asian masseuses on this beach. It's worth going out of your way for.", "publishedDate": "2017-03-28", "language": "en", "rating": 5}, {"id": 468380695, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d7052313-r468380695-Bogatell_Beach-Barcelona_Catalonia.html", "text": "A beach with lots of people: people playing volleyball, couples kissing and vendors walking around trying to sell picnic blankets. \n\nThe crowded atmosphere gave an impression of a popular place, yet ruined the feeling of an exclusive beach. The sand felt dirty but it was nonetheless a great feeling of the Mediterranean. ", "publishedDate": "2017-03-18", "language": "en", "rating": 4}, {"id": 460085543, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d7052313-r460085543-Bogatell_Beach-Barcelona_Catalonia.html", "text": "It may be a bit far to reach from the typical beaches of Barcelona but this beach is worth it. With real sand and far less people you can truly take in the sun without distractions of people trying to sell you things or just the general crowdness present in Barceloneta or Villa Olympica beach. You can reach there using the  the train (there's a separate ticket or the last stop on the purple L5 line )", "publishedDate": "2017-02-15", "language": "en", "rating": 5}, {"id": 455900722, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d7052313-r455900722-Bogatell_Beach-Barcelona_Catalonia.html", "text": "Better than Barceloneta beach as it is slightly further away from the tourist area although not by much.\n\nThe restaurants with views of the beach in Bogatell are much better than in Barceloneta and the beach is cleaner.\n\nIf you want to go to a beach in BCN, the further you go from Barceloneta the better - if you still want to go to a city beach, Selva de Mar is even more local than Bogatell and only a couple of metro stops further from the centre than chaotic, touristy and expensive Barceloneta", "publishedDate": "2017-01-30", "language": "en", "rating": 3}, {"id": 448344986, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d7052313-r448344986-Bogatell_Beach-Barcelona_Catalonia.html", "text": "Of the different designated beach areas of Barcelona city, I liked this one best. It´s just down from the large marina but has good clear ocean views as well as an all year toilet nearby. This is important unless you want to plead to use one in a restaurant on the promenade or by the port. There are cycling paths which are also used by skaters, runners and electric scooters. There are sports fields around as well as  par courses and some interesting sculptures. I alos found a couple of permanent ping pong tables, but I think you might have to bring your own tools to play. On a nice day, this is a wonderful place to relax. The metro in nearby.  and the 59 bus comes from La Rambla. I was here out of season so I suspect when it really warms up, this place clicks on. Good for swimming but no so for surfing. Developed after the Barcelona Olympics - this is where the housing area was.", "publishedDate": "2017-01-01", "language": "en", "rating": 4}, {"id": 447681136, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d7052313-r447681136-Bogatell_Beach-Barcelona_Catalonia.html", "text": "The entire water front was rebuilt with industry moved out and beaches brought in as a tourist and local attraction.   The sand is reconstructed each spring and the beaches are keep clean.  I am not so sure about the water and did not find any health ratings available on the cleanliness of the water.", "publishedDate": "2016-12-29", "language": "en", "rating": 4}, {"id": 445691417, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d7052313-r445691417-Bogatell_Beach-Barcelona_Catalonia.html", "text": "Even though it was May it was still pretty hot. Water was a little cold. Great place if you want to meet some people and play some beach sports. There are also some good restaurants around the area of the beach if you want to go for a stroll. Really close to the city. Hope to go back one day!", "publishedDate": "2016-12-20", "language": "en", "rating": 5}, {"id": 436445369, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d7052313-r436445369-Bogatell_Beach-Barcelona_Catalonia.html", "text": "Looks like a great and clean beach. We only had about 30 minutes to taste the Mediterranean seawater, which was the main objective, but it was too cold for comfort (1st week of May) anyway. It was a very quick in and out, so we have been there and done that. We can now say we swam in 6 different oceans/seas across the globe. There were several sunbathers on the beach. Should be very nice in summer.", "publishedDate": "2016-11-11", "language": "en", "rating": 5}, {"id": 432233136, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d7052313-r432233136-Bogatell_Beach-Barcelona_Catalonia.html", "text": "We stayed in poble nou and so this beach was just a few minutes walk away. The sandy beach was free of rubbish but I did see one bit of dog mess. The sea was clean and it was lovely to swim end of october. The cafes on the beach were not too pricey. There are plenty of volleyball nets and other activities like table tennis tables you can use. It is great that you are so close to the city and have such a reasonable beach on your doorstep. Do note that walking up to poble nou you do get a slight smell of sewage in certain places. But not at the beach itself.", "publishedDate": "2016-10-27", "language": "en", "rating": 4}, {"id": 431499031, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d7052313-r431499031-Bogatell_Beach-Barcelona_Catalonia.html", "text": "Before coming to Barcelona, we heard lots of theft stories and people kept warning not to go to the beach alone... Our friend live at Dioganal Mar, close to Hilton and we decided to swim at Bogatell beach as it is close by... There are no changing cabinets but we manage to change at the small toilets... We had a light lunch at the bistro at the beach and bought a big cloth from the street sellers... As we were three adults, one stayed at the beach when others swam... Surprisingly, the beach and the sea was clean... We enjoyed every moment...", "publishedDate": "2016-10-25", "language": "en", "rating": 4}, {"id": 429675637, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d7052313-r429675637-Bogatell_Beach-Barcelona_Catalonia.html", "text": "This is arguably the best beach within the city center. It's a bit remote, so not so many tourists end up there. To get to even better beaches, you'd have to jump on the train and go south of Barcelona (or way north), to Gava or Castelldefels. ", "publishedDate": "2016-10-19", "language": "en", "rating": 4}, {"id": 427504091, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d7052313-r427504091-Bogatell_Beach-Barcelona_Catalonia.html", "text": "This excellent sandy beach was within walking distance from our apartment in Poble Nou and we among other had a morning swim at the time of the beautiful sunrise in the sea (around 7.45 am in early October). Air and water temparature around 20 and only few people on the beach.", "publishedDate": "2016-10-13", "language": "en", "rating": 5}, {"id": 424476599, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d7052313-r424476599-Bogatell_Beach-Barcelona_Catalonia.html", "text": "Went there in search of a less crowded beach on a Saturday evening . The other beach - barcelonata was thronging with people . \nYou can reach this beach by the city bus directly . It is on route 59.\nThe beach is clean , has public bathrooms and shower , less crowded , has watersport activities and a chilled out beach bar .\nWe had a great evening chilling at the bar - with direct view of beach and less people . \n", "publishedDate": "2016-10-02", "language": "en", "rating": 5}, {"id": 424225541, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d7052313-r424225541-Bogatell_Beach-Barcelona_Catalonia.html", "text": "My husband and I decided during our stay to walk an hour each way to this particular beach. It was the only non-tourist beach out of them all and so was well worth the walk. The beach was very clean and there was still a lot of space. The water was warm (end of September) and clean and the feeling of the beach was very nice.\n\nHowever, there was a real stench further along when we walked to find toilets - seemed like a drainage issue, or something. The smell was that bad we had to hold our noses as we walked. The toilets along the beach front were disgusting and we checked about 6 - all the same, and one with no seat. Crossing my legs we walked a further 5 minutes and found another unit of toilets set a bit further back, of which were clean and we were happy to use (although I still squatted). Apart from the toilets and the smell in the area, the beach was lovely and is worth a visit if you want a beach with no typical tourists and lots of irritating kids. We stayed an hour and a half before heading back (just enough to sample some of the beach scene and grab a spot of sunbathing). ", "publishedDate": "2016-10-01", "language": "en", "rating": 5}, {"id": 423745730, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d7052313-r423745730-Bogatell_Beach-Barcelona_Catalonia.html", "text": "We spent the whole Sunday afternoon at this beach, full of nets to play volleyball. It is the deal place to socialize, get to know someone and play. You can also lie down to sunbathe, relax, swim and watch others play ... Anyway, this is a beautiful sandy beach. ", "publishedDate": "2016-09-30", "language": "en", "rating": 5}, {"id": 423489543, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d7052313-r423489543-Bogatell_Beach-Barcelona_Catalonia.html", "text": "Nice looking beach and quieter than barceloneta but sometimes very smelly (sewage) - depending on wind direction. Went twice, toilets open on day 1 but not day 2. McDonald's close by if you  need wc. ", "publishedDate": "2016-09-29", "language": "en", "rating": 3}, {"id": 421738844, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d7052313-r421738844-Bogatell_Beach-Barcelona_Catalonia.html", "text": "Good and nice beach with plenty of chiringhitos. Nice place to sunbathing. Beach is clean and spacious. Recommended. 👍 ", "publishedDate": "2016-09-24", "language": "en", "rating": 4}, {"id": 420876596, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d7052313-r420876596-Bogatell_Beach-Barcelona_Catalonia.html", "text": "This is a nice beach.Not very crowded with a good mix of people.The water is fine.A good place to unwind after a long flight.", "publishedDate": "2016-09-21", "language": "en", "rating": 4}, {"id": 420614305, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d7052313-r420614305-Bogatell_Beach-Barcelona_Catalonia.html", "text": "This beach is better than Barceloneta in every way. It's cleaner, quieter, wider and cheaper!\n\nSun beds and parasols are cheaper here and there's less cigarette butts littering the beach. There's several cost guards here as well as free toilets (which are a bit horrible).  \n\nI can't quiet understand why Barceloneta is the most popular of the two. Perhaps because Bogatell is a further 15 minute walk? Or that the town and restaurants are further away? Either way this beach is a gem if your after somewhere less touristy. ", "publishedDate": "2016-09-20", "language": "en", "rating": 5}, {"id": 419119782, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d7052313-r419119782-Bogatell_Beach-Barcelona_Catalonia.html", "text": "This beach is 10-15 mins walk from Bogatell Metro station. Very well maintained. The water is inviting and perfect for playing on the edges even if you don't to go too deep. Port Olympic is only few minutes walk away with lots of water sports. You can rent chairs and shade at the beach for about 10 Euros or something. There are volleyball courts on the beach as well. Good place to play and relax with a swim and the sun.", "publishedDate": "2016-09-16", "language": "en", "rating": 5}, {"id": 418547825, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d7052313-r418547825-Bogatell_Beach-Barcelona_Catalonia.html", "text": "This is a lovely clean beach which has plenty of facilities. Beach Bars, toilets, gym equipment, volleyball nets, so plenty to keep you occupied. If you are a beach lover this is the place for you. ", "publishedDate": "2016-09-14", "language": "en", "rating": 5}]}}]