[{"locationId": 7785899, "name": "Cascada Monumental", "placeType": "ATTRACTION", "reviewListPage": {"reviews": [{"id": 732904622, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d7785899-r732904622-Cascada_Monumental-Barcelona_Catalonia.html", "text": "This fountain is quite lovely. No matter what angle you admire it from, it is very beautiful. Just a couple blocks away from the Arc so stop and check it out. ", "publishedDate": "2019-12-15", "language": "en", "rating": 4}, {"id": 730809725, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d7785899-r730809725-Cascada_Monumental-Barcelona_Catalonia.html", "text": "A huge statue, combined with fountain, inside a wonderful park that you won't get enough. People, kids and families wonder in this place.", "publishedDate": "2019-12-05", "language": "en", "rating": 5}, {"id": 725250878, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d7785899-r725250878-Cascada_Monumental-Barcelona_Catalonia.html", "text": "The Cascada Monumental is a breathtaking waterfall located inside of the huge Ciutadella Park. The Cascada  is located at the northern corner of the park opposite to the lake. It was erected by Josep Fontsére and to a small extent by Antoni Gaudí, who at that time was still an unknown student of architecture.  Beautiful tiered fountain rolling at the base of Venus statue.  One of the most impressive attractions in Barcelona. Beautiful.  Must see.", "publishedDate": "2019-11-09", "language": "en", "rating": 5}, {"id": 722614982, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d7785899-r722614982-Cascada_Monumental-Barcelona_Catalonia.html", "text": "Happened upon this when strolling through the park early one morning with the family. It’s an amazing installation. Go and see it. The moss and algae on the fountains makes them seem more lifelike and organic!", "publishedDate": "2019-10-30", "language": "en", "rating": 5}, {"id": 718180716, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d7785899-r718180716-Cascada_Monumental-Barcelona_Catalonia.html", "text": "Very nice place with lakes and ducks and the amazing monument. \nDidn’t get the 5th star because the toilet were a mess .", "publishedDate": "2019-10-14", "language": "en", "rating": 4}, {"id": 712663633, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d7785899-r712663633-Cascada_Monumental-Barcelona_Catalonia.html", "text": "This monument is really marvelous, view from the top after climbing is breathtaking. You can see the whole park. When we were there was a Street food festival and the whole place was crowded with people", "publishedDate": "2019-09-24", "language": "en", "rating": 5}, {"id": 703295618, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d7785899-r703295618-Cascada_Monumental-Barcelona_Catalonia.html", "text": "We had rented bikes and rode along the beach in both directions.  Coming back to drop off our bikes, we rode thru this park and found this fountain.  It was beautiful with plenty of trees surrounding it for a nice picnic or rest stop.", "publishedDate": "2019-08-26", "language": "en", "rating": 5}, {"id": 693097511, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d7785899-r693097511-Cascada_Monumental-Barcelona_Catalonia.html", "text": "This was one of the stops on our tour with buena vista. It was very nice. The entire park is very nice actually. ", "publishedDate": "2019-07-27", "language": "en", "rating": 5}, {"id": 690700965, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d7785899-r690700965-Cascada_Monumental-Barcelona_Catalonia.html", "text": "The Monumental Cascade of Ciudadela Park is an architectural and sculptural complex with waterfalls, fountains and water fountains, and located in the north east of the park.\n\nThe architectural ensemble consists of a central structure in the form of triumphal arch with two pavilions and steps on either sides, where there are a great many classical sculptures. The fountain faucets are created from four Griffins dotted around the based of the waterfall.\n\nA truly wonderful ensemble and very popular spot for selfies.", "publishedDate": "2019-07-18", "language": "en", "rating": 5}, {"id": 690689084, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d7785899-r690689084-Cascada_Monumental-Barcelona_Catalonia.html", "text": "such a beautiful fountain with so many architectural details.not everyone knows about this fountain, is a hidden gem for the tourist,but is worth to add it on you list if you visit Barcelona!", "publishedDate": "2019-07-18", "language": "en", "rating": 5}, {"id": 685037098, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d7785899-r685037098-Cascada_Monumental-Barcelona_Catalonia.html", "text": "I often stroll by and take photos with my boyfriend, but my students also enjoyed stopping by for photos.  The stone stairs and beautiful fountains make for a gorgeous backdrop!", "publishedDate": "2019-06-28", "language": "en", "rating": 5}, {"id": 685026435, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d7785899-r685026435-Cascada_Monumental-Barcelona_Catalonia.html", "text": "Shame no water currently. Aurora is goddess of the dawn. In her chariot she is fighting away the dark. Bringing the day. Her brother and sister are the sun and moon.", "publishedDate": "2019-06-28", "language": "en", "rating": 4}, {"id": 679848637, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d7785899-r679848637-Cascada_Monumental-Barcelona_Catalonia.html", "text": "it was dry - no cascade - no fun. but the design and idea are fabulous. hope they will fix it soon...", "publishedDate": "2019-06-07", "language": "en", "rating": 3}, {"id": 679468771, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d7785899-r679468771-Cascada_Monumental-Barcelona_Catalonia.html", "text": "It sits in a beautiful park which is much loved by locals and tourists alike.  The architecture is amazing and when the fountains start to flow it is fantastic. The views of it from the park are beautiful but do take time to climb the steps and take in the view out over the park from the tower as this is equally beautiful.", "publishedDate": "2019-06-06", "language": "en", "rating": 5}, {"id": 677556049, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d7785899-r677556049-Cascada_Monumental-Barcelona_Catalonia.html", "text": "add this to your list of parks and historic monuments to visit, best early evening or morning to avoid heat in summer and crowds", "publishedDate": "2019-05-30", "language": "en", "rating": 4}, {"id": 675592402, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d7785899-r675592402-Cascada_Monumental-Barcelona_Catalonia.html", "text": "This is a stunning monument in the heart of the park. I don't know what it represents but purely enjoyed the beauty of this stunning statue.", "publishedDate": "2019-05-21", "language": "en", "rating": 5}, {"id": 674229236, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d7785899-r674229236-Cascada_Monumental-Barcelona_Catalonia.html", "text": "We were walking from our hotel to the city centre and decided to take a stroll through a park we saw on Google maps. \n\nLittle did we know it would lead to Cascada Monumental, a huge monument in the middle of a park. Beautiful architecture with water flowing through it. \n\nEveryone there was enjoying it as it's so big, it's a monument you can walk in and around. \n\nWe spent quite a long time there, walking, taking photographs and venturing around the monument.\n\nThoroughly enjoyable, recommended and would return.", "publishedDate": "2019-05-15", "language": "en", "rating": 5}, {"id": 672100541, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d7785899-r672100541-Cascada_Monumental-Barcelona_Catalonia.html", "text": "It was under repair, so some was covered up.\nThere were also quite a number of locals and tourists around, so quite crowded.\nBut still, the park and the area is very attractive", "publishedDate": "2019-05-07", "language": "en", "rating": 4}, {"id": 671785297, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d7785899-r671785297-Cascada_Monumental-Barcelona_Catalonia.html", "text": "This area and piece of work is very nice to see. If you had time and the weather was nice you could a nice picnic here and enjoy watching the world go by.\nRecommend going to see it", "publishedDate": "2019-05-06", "language": "en", "rating": 4}, {"id": 668657412, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d7785899-r668657412-Cascada_Monumental-Barcelona_Catalonia.html", "text": "it is very big ;park, \nwhen you keep on going, you will find more facilities inside.\nvery impressive water fountain , small lake for roll boat,\nnice walk around", "publishedDate": "2019-04-23", "language": "en", "rating": 3}, {"id": 666960887, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d7785899-r666960887-Cascada_Monumental-Barcelona_Catalonia.html", "text": "Trevi fountain in Rome was an inspiration of this monument. \n\nLa casvada is divided into two levels.\nat the lowest level, on each side, two stairs that look like enormous pincers of gigantic crabs provide access to a small podium located in the center of the monument where a sculpture  representing the Birth of Venus, was elaborated in stone.\n \nAt the top, a sculpture forged in Iron, The chariot of Aurora - a Quadriga drawn by four horses. In his right hand a torch, a symbol of the light that illuminates the world every morning.\n\nThe top platform offers a wonderful view of the fountains and the Park of the Ciutadella. Don't miss it.", "publishedDate": "2019-04-16", "language": "en", "rating": 5}, {"id": 665297995, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d7785899-r665297995-Cascada_Monumental-Barcelona_Catalonia.html", "text": "This monyment is in the Parc de la Ciutadella, in a quiet area of the busy city. If you are tired or want to see some nice flowers or a fountain, just go there. You can have  arest, walk or have a picnic there. We had little time so we only spent there very short time, but we could take some nice photos, too.", "publishedDate": "2019-04-10", "language": "en", "rating": 4}, {"id": 664983504, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d7785899-r664983504-Cascada_Monumental-Barcelona_Catalonia.html", "text": "This fountain and monument is absolutely gorgeous. Unfortunately the fountain wasn’t running and the monument was under renovation but it was still worth seeing and taking pictures. ", "publishedDate": "2019-04-09", "language": "en", "rating": 4}, {"id": 653726640, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d7785899-r653726640-Cascada_Monumental-Barcelona_Catalonia.html", "text": "On a sunny day this is a little spectacle. Fortunately it's in our neighborhood so we can drop by any time. For visitors who may have headed to the Arc de Triomf, it is definitely worth the small effort to walk to the other end of the park to marvel at this fountain. A goodly variety of water birds are usually in attendance in the nearby pond. ", "publishedDate": "2019-02-20", "language": "en", "rating": 4}, {"id": 650406575, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d7785899-r650406575-Cascada_Monumental-Barcelona_Catalonia.html", "text": "The Cascada is huge. Start by viewing from the semi-circular area in front of it. Then climb the stairs to the second level for a different view. The best part is plants are designed right into the fountain. When was the last time you saw that? Very cool.", "publishedDate": "2019-02-05", "language": "en", "rating": 5}, {"id": 645819126, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d7785899-r645819126-Cascada_Monumental-Barcelona_Catalonia.html", "text": "Located on Passeig de Picasso, wonderful park, status, spring fountain, palms, orange trees and a lot of other exotic plants, for amazing walks with family or friends; very nice monument.", "publishedDate": "2019-01-14", "language": "en", "rating": 5}, {"id": 643345523, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d7785899-r643345523-Cascada_Monumental-Barcelona_Catalonia.html", "text": "For me this was one of the major highlights of my visit as I didn't realise it was so good. I knew there was a fountain within the park but didn't know it was so magnificent. It's centerpiece is a fabulous fifty foot high monument of figurines with gold leaf ornaments and a monumental horse drawn carriage with rider at the very top in gold leaf. There are dragon fountains, clear sky blue waters, and magnificent stairwells to each side allowing you high way up the monument. The front lake has six foot spring fountains dotted around it but the slight downside was that not all of them were working properly. Not to be missed!", "publishedDate": "2019-01-03", "language": "en", "rating": 5}, {"id": 640969314, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d7785899-r640969314-Cascada_Monumental-Barcelona_Catalonia.html", "text": "A must see if you're in the park, it's a treat for both the eyes and ears.  A huge endeavor that will possibly be a lasting memory of your visit to the park.", "publishedDate": "2018-12-22", "language": "en", "rating": 5}, {"id": 635250251, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d7785899-r635250251-Cascada_Monumental-Barcelona_Catalonia.html", "text": "Barcelona is enjoyed through the walk, this is a huge campus with awesome architecture, fountain, Griffin statues etc, it was drizzling hence not many were outside but it's an awesome walk with beautiful garden, parrots, trees full of oranges, the beautiful building of parliament and everything is breathtaking", "publishedDate": "2018-11-23", "language": "en", "rating": 5}, {"id": 635134785, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d7785899-r635134785-Cascada_Monumental-Barcelona_Catalonia.html", "text": "This was an amazing find! I personally did not expect to find such a beautiful monument is a city park. Then again, Barcelona never ceases to amaze! \nThis exquisite monument is in the centre of Parc de la Ciutadella. It's a bit off the main thoroughfare, but worth the detour! I don't know much of the history of the monument, but certainly enjoyed exploring the area and in taking a few pictures.\nThis area of the park is not too busy, so it is a great place to take a break and soak up the views. However, there seemed to be a number of homeless people roaming around, and you need to be aware of pickpockets.  \nWell worth a few minutes of your time to see.", "publishedDate": "2018-11-22", "language": "en", "rating": 4}, {"id": 633460270, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d7785899-r633460270-Cascada_Monumental-Barcelona_Catalonia.html", "text": "Cascada Monumental is a fountain similar to Rome's Trevi like fountain located in the Parc de la Ciutadella. The hydraulics were designed by Gaudi while he was a apprentice when a fellow apprentice was unable to solve the problem of circulating the water for this amazing fountain. This fountain is breathtaking, the true selfie grabber is the amazing gold statue of Aurora riding four horses. A true hidden gem, no crowds at all and it's free. Jolly Chriss.", "publishedDate": "2018-11-14", "language": "en", "rating": 5}, {"id": 627780200, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d7785899-r627780200-Cascada_Monumental-Barcelona_Catalonia.html", "text": "This ornate statue filled fountain is located in the north end of the Parc de la Ciudadella. High at the very top is a golden 4 horse drawn chariot rider. A Venus also comes out of a shell a la Bottichelli. There are also several large dragons near the bottom of the fountain. My only complain is that the fountain was fenced off, so you could only get near it and not touch the water. There are also some overgrown trees that need cutting back so as to not block the sides. I have read that it was designed to resemble the Trevi Fountain in Rome, it did not seem anything like that to me. While it's very ornate, the fact that you can't approach it loses some of the feeling of it's hugeness.", "publishedDate": "2018-10-24", "language": "en", "rating": 4}, {"id": 627579484, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d7785899-r627579484-Cascada_Monumental-Barcelona_Catalonia.html", "text": "The Ciutadella Park worth a visit on its own but the Cascada Monumental is the highlight of it. Just check out the pictures and you will understand why it is a must!", "publishedDate": "2018-10-23", "language": "en", "rating": 5}, {"id": 627429024, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d7785899-r627429024-Cascada_Monumental-Barcelona_Catalonia.html", "text": "Cascada Monumental is located in the The Parc de la Ciutadella and absolutely  incredible. The best is to sit down on the bank and only be fascinated by Cascade.", "publishedDate": "2018-10-23", "language": "en", "rating": 5}, {"id": 618226622, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d7785899-r618226622-Cascada_Monumental-Barcelona_Catalonia.html", "text": "Bring your own coffee or enjoy something from the convenient snack bar.  Good people watching location.\n\n", "publishedDate": "2018-09-20", "language": "en", "rating": 5}, {"id": 615982605, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d7785899-r615982605-Cascada_Monumental-Barcelona_Catalonia.html", "text": "Unfortunately the day we visited the fountain, it was undergoing maintenance. I would love to see the fountain operating. ", "publishedDate": "2018-09-12", "language": "en", "rating": 5}, {"id": 611506974, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d7785899-r611506974-Cascada_Monumental-Barcelona_Catalonia.html", "text": "This beautiful monument is in the centre of Parc de la Ciutadella overlooking the fountain. It's a bit of a hidden gem, not very busy which allows you to have a good look and a wander. ", "publishedDate": "2018-08-28", "language": "en", "rating": 4}, {"id": 606956445, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d7785899-r606956445-Cascada_Monumental-Barcelona_Catalonia.html", "text": "Parc de la Ciutadella is one of the main parks in Barcelona so, for sure, you will probably visit it. If you do, make sure to take some time to enjoy the impressive Cascada Monumental. The name perfectly sums up what it is!", "publishedDate": "2018-08-16", "language": "en", "rating": 5}, {"id": 602020984, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d7785899-r602020984-Cascada_Monumental-Barcelona_Catalonia.html", "text": "If you are in the park, this is a lovely monument for a photo stop. There is plenty of space as it never seems overcrowded. Small snack bar nearby for drinks etc but don't know costs as we took our own water. There is also a water fountain here if you need to refill your water bottles.", "publishedDate": "2018-08-02", "language": "en", "rating": 4}, {"id": 600541718, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d7785899-r600541718-Cascada_Monumental-Barcelona_Catalonia.html", "text": "The monument and fountain was breathtaking. There is a pond nearby where rowing a boat is possible. Also a life-size statue of a mammoth.", "publishedDate": "2018-07-28", "language": "en", "rating": 4}, {"id": 590884791, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d7785899-r590884791-Cascada_Monumental-Barcelona_Catalonia.html", "text": "we liked the park but it is not well maintained, fountain has green water and smells bad, garbage was present in many places. lots of people sleeping on the grass, perhaps expected", "publishedDate": "2018-06-26", "language": "en", "rating": 3}, {"id": 588677937, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d7785899-r588677937-Cascada_Monumental-Barcelona_Catalonia.html", "text": "I chanced ion this monument in my late teens and was lucky enough to have remembered this beautiful place and how roughly where to find it in my mid 30’s. It’s stunningly beautiful and absolutely tranquil.", "publishedDate": "2018-06-18", "language": "en", "rating": 5}, {"id": 587580765, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d7785899-r587580765-Cascada_Monumental-Barcelona_Catalonia.html", "text": "This monument is inside of a beautiful park with shadow spots! Very nice for a picnic or just rest! Aside from the green around it, it is a stunning fountain and unique lakes! It was the most beautiful place in Barcelona i have been!\nEverybody must go there!", "publishedDate": "2018-06-15", "language": "en", "rating": 5}, {"id": 584552473, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d7785899-r584552473-Cascada_Monumental-Barcelona_Catalonia.html", "text": "Nice park and although busy was not crowded. We saw ducks and ducklings enjoying the water too. Lots of good photo opportunities.", "publishedDate": "2018-06-02", "language": "en", "rating": 4}, {"id": 584362436, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d7785899-r584362436-Cascada_Monumental-Barcelona_Catalonia.html", "text": "The monument is impressive and like most in Barcelona is worth a look but the park itself is large and worth visiting but not special.", "publishedDate": "2018-06-01", "language": "en", "rating": 3}, {"id": 583550005, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d7785899-r583550005-Cascada_Monumental-Barcelona_Catalonia.html", "text": "This monumental fountain and pond is located at the Passeig De Pujaides  end of the Park. It was built between 1875 and 1881 and is claimed to loosely resemble the Trevi Fountain in Rome. I have seen the Trevi since visiting this monument and was unable to discern any similarity.\nIn the center of the fountain there is a white marble sculpture of Venus, emerging from a clamshell. On top of the triumphal arch, there's a golden statue of Aurora and her chariot drawn by four horses. Gaudi is reputed to have worked as an apprentice here while the monument was under construction. \nIt seems that you can legitimately climb to the top and enjoy the views, I owe the hordes of oriental selfie chasers an apology on this occasion.", "publishedDate": "2018-05-29", "language": "en", "rating": 5}, {"id": 580666555, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d7785899-r580666555-Cascada_Monumental-Barcelona_Catalonia.html", "text": "Saw this park on the TV show \"Better late than never\" and had to go. A very nice park with beautiful views. Pictures do not do this park justice. a must see in Barcelona.", "publishedDate": "2018-05-16", "language": "en", "rating": 5}, {"id": 577523472, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d7785899-r577523472-Cascada_Monumental-Barcelona_Catalonia.html", "text": "My girlfriend and I found this just by walking around on our first day in Barcelona. We heard of the park before but didn’t know about the magical, giant mansion like structure that came along with it. It was absolutely beautiful. The park itself was filled with kids, young adults, older adults and obviously tourists. You could tell this was a place where locals hang out a lot and soak up the sun, or have lunch in the park. It was well kept and I would totally recommend it to anyone who’s looking for an afternoon stroll in Barcelona! ", "publishedDate": "2018-05-02", "language": "en", "rating": 5}, {"id": 576559218, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d7785899-r576559218-Cascada_Monumental-Barcelona_Catalonia.html", "text": "This spot is great to take a photo. Also a really nice park and a neat by small lake where you can rent a boat.", "publishedDate": "2018-04-29", "language": "en", "rating": 5}, {"id": 576344525, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d7785899-r576344525-Cascada_Monumental-Barcelona_Catalonia.html", "text": "Center piece of the ciutadella park. Walk from the Arc de Triomf to Cascada Monumental and enjoy the park. This fountain is a really intriguing mix of the natural formations and the man-made structures. It's a really relaxing place to just chill out and spend a few minutes. The more photographically inclined members of our group said that it's best for pictures in the evening. Definitely worth spending some time here!", "publishedDate": "2018-04-28", "language": "en", "rating": 5}, {"id": 574785811, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d7785899-r574785811-Cascada_Monumental-Barcelona_Catalonia.html", "text": "Good place to take a walk around with performers, boating lake, a mammoth statue (?), good diversity of plants and trees. Also had the zoo next door. We cycled through here at dusk and also took a stroll on a sunny day. Close to beach also", "publishedDate": "2018-04-21", "language": "en", "rating": 4}, {"id": 572831560, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d7785899-r572831560-Cascada_Monumental-Barcelona_Catalonia.html", "text": "We happen to see this place purely by chance as we were walking past and soon discovered a gold colored statue shining in the evening sun. We were thrilled when we got to see this place up close. As we explored further, we came across gardens and finally the Catalan Parliament building. Nice place to walk specially in the evening to relax and recharge. No entry fee of any sort. We started the walk at the Arc and then moved along, crossed the road to access the park. Certainly worth a look. Great location to take pictures if you have a passion in photography. Highly recommended.", "publishedDate": "2018-04-12", "language": "en", "rating": 5}, {"id": 572202185, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d7785899-r572202185-Cascada_Monumental-Barcelona_Catalonia.html", "text": "This is a very eye catching monumental cascade. It really ornaments the park, and us a very good place for photos. It is also a cooling spot on a hit day and you can get refreshments just opposite", "publishedDate": "2018-04-09", "language": "en", "rating": 5}, {"id": 570713115, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d7785899-r570713115-Cascada_Monumental-Barcelona_Catalonia.html", "text": "Unfortunately it was under renovation when I was here but it was still beautiful to look at and take pictures of.", "publishedDate": "2018-04-03", "language": "en", "rating": 5}, {"id": 570332428, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d7785899-r570332428-Cascada_Monumental-Barcelona_Catalonia.html", "text": "The whole Barcelona is under construction. Even a taxi driver said one part has taken ten years, and he didnt mean catherdral. This had no water in it, and fenced off.still looked good from distance", "publishedDate": "2018-04-02", "language": "en", "rating": 3}, {"id": 564685916, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d7785899-r564685916-Cascada_Monumental-Barcelona_Catalonia.html", "text": "The Monument is located at the northern corner of the Parc de la Ciutadella opposite to the lake. Very nice.", "publishedDate": "2018-03-05", "language": "en", "rating": 4}, {"id": 564399093, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d7785899-r564399093-Cascada_Monumental-Barcelona_Catalonia.html", "text": "This monument fountain is different to so many others in Europe that are as tall and large because the staircase allows you to get up close to all the different areas of the monument.  You're not just viewing it from the front on the ground looking up (see pic), the staircase which is grand in itself (see pics), gives you viewing platforms in the middle where you'll see the statues up close (see pics).\n\nOnce you've reached the top you'll have gorgeous views over the park and be able to really enjoy the golden painted statues atop the fountain (see pic).\n\nUnfortunately I saw this in the winter when the water was turned off and it was being cleaned and maintained, but even with the water not running it was still stunning.  \n\nOn weekends there's people making giant bubbles for kids to pop at the base of the fountain (see pic), while on any day you can enjoy the giant life size wooly mammoth statue (see pic) located in the grassy area directly opposite the base of the fountain.", "publishedDate": "2018-03-04", "language": "en", "rating": 5}, {"id": 564151822, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d7785899-r564151822-Cascada_Monumental-Barcelona_Catalonia.html", "text": "The Cascade is really wonderful and it’s a nice idea to walk through the park but wait !!!! Not in the morning !! Schools visit the geology and natural history’s museums in the park and the peaceful and quiet of the park....just disappear:)\n", "publishedDate": "2018-03-03", "language": "en", "rating": 4}, {"id": 563308808, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d7785899-r563308808-Cascada_Monumental-Barcelona_Catalonia.html", "text": "For me this park is one of those corners of Barcelona that is often passed by , by visitors and it is well worth a visit, not only to see this amazing golden fountain but for the other buildings in the park. A walk through the tranquil gardens on a hot day is very welcome. At the weekend there is often some interesting event taking place here like the Lindy hop dancing;", "publishedDate": "2018-02-28", "language": "en", "rating": 5}, {"id": 559081724, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d7785899-r559081724-Cascada_Monumental-Barcelona_Catalonia.html", "text": "Nice looking monument, not something to rave about but if you’re in the area it’s worth a look. \nWe was unfortunate and visited when the surrounding water features were being cleaned.", "publishedDate": "2018-02-07", "language": "en", "rating": 3}, {"id": 552492465, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d7785899-r552492465-Cascada_Monumental-Barcelona_Catalonia.html", "text": "what a monumental place . simply loved the architect . we climbed up to have good view of the monument . it is a huge park close to zoo .\nfree of cost . Bathrooms are not really the best so keep your own roll of toilet papers .\nyou can have good pictures . over all very nice place .", "publishedDate": "2018-01-08", "language": "en", "rating": 5}, {"id": 552164632, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d7785899-r552164632-Cascada_Monumental-Barcelona_Catalonia.html", "text": "Worth seeing (its free of course) and is an impressive monument within a beautiful setting. Daughters took many selfies here", "publishedDate": "2018-01-07", "language": "en", "rating": 5}, {"id": 551707844, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d7785899-r551707844-Cascada_Monumental-Barcelona_Catalonia.html", "text": "We took some time to look really closely at this monument. Seeing parts of adoration of venus etc. This is a really nice public monument and you can take the time to move around it and look it at from different angles to see quite a lot for free outside. Very nice", "publishedDate": "2018-01-05", "language": "en", "rating": 4}, {"id": 550854763, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d7785899-r550854763-Cascada_Monumental-Barcelona_Catalonia.html", "text": "The Cascada monument is located at the northern corner of the Parc de la Ciutadella opposite to the lake.\n\nIt was designed by Josep Fontsere with the help of Antoni Gaudi and inaugurated in 1881 without sculptures. Before the 1888 Barcelona World Fair it was amended by the addition of a fountain and sculptures designed by Catalan artists.\n\nThe design of this Cascada was inspired by the Trevi fountain in Rome.", "publishedDate": "2018-01-02", "language": "en", "rating": 5}, {"id": 541952773, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d7785899-r541952773-Cascada_Monumental-Barcelona_Catalonia.html", "text": "When walking in Ciutadella Park, you cannot miss the monumental. It is a relaxing place to either sit or wander around and take photos.\nThe water is greenish, and the monumental is fabulous and worth seeing.", "publishedDate": "2017-11-19", "language": "en", "rating": 4}, {"id": 540339697, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d7785899-r540339697-Cascada_Monumental-Barcelona_Catalonia.html", "text": "What a lovely afternoon spent walking around the park before a stroll to Olympic port. The monument is lovely, very tranquil late afternoon weekdays. Lovely photo opportunity.", "publishedDate": "2017-11-11", "language": "en", "rating": 5}, {"id": 539310255, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d7785899-r539310255-Cascada_Monumental-Barcelona_Catalonia.html", "text": "Beautiful water feature\nLots of greenery and a sweet spot for resting and meditating.\nAlways nice to retreat onwards while visiting bustling city.\nLove barcelona", "publishedDate": "2017-11-07", "language": "en", "rating": 4}, {"id": 533239049, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d7785899-r533239049-Cascada_Monumental-Barcelona_Catalonia.html", "text": "This structure is a very large and spaciously designed building which seems to be purely ornamental and to be an attractive construction accompanied by a large water feature with ponds and fountains. A bit like the follies you often see on etc big country houses in the UK.\nThe wide steps allow you to ascend to the top which is covered by a great canopy. The balusters are topped at the pillars by black urns, and you can look over onto the ponds. You can ascend one side and down the other. A great place for taking a few selfies or other photos to remember your trip to Barcelona.", "publishedDate": "2017-10-15", "language": "en", "rating": 4}, {"id": 532772981, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d7785899-r532772981-Cascada_Monumental-Barcelona_Catalonia.html", "text": "Really beautiful when it turned on. Situated in a park very close to Barcelona center, but enough quite. There isn't crowds of people here. ", "publishedDate": "2017-10-13", "language": "en", "rating": 5}, {"id": 528524547, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d7785899-r528524547-Cascada_Monumental-Barcelona_Catalonia.html", "text": "We often take a walk in the Park de la Cituadella. The fontain is dantastic. I can realy recomend spending some time in the park.", "publishedDate": "2017-09-30", "language": "en", "rating": 4}, {"id": 526751863, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d7785899-r526751863-Cascada_Monumental-Barcelona_Catalonia.html", "text": "Very interesting, nice place, original atmosphere, do not forget to visit Barcelona. We recommend...", "publishedDate": "2017-09-23", "language": "en", "rating": 5}, {"id": 522775724, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d7785899-r522775724-Cascada_Monumental-Barcelona_Catalonia.html", "text": "Walking in the park, you can see see people exercising and relaxing! Even you can take a boat in the small lake and enjoy the nice weather in Barcelona. The most beautiful part is the gorgeous fountain! \n走在公園裡，你可以看到有人在運動或是曬日光浴，還可以滑船享受美好風光。其中最美的就是華麗的噴水池，但可惜是我九月去時，水放掉保養。\n", "publishedDate": "2017-09-09", "language": "en", "rating": 4}, {"id": 520403003, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d7785899-r520403003-Cascada_Monumental-Barcelona_Catalonia.html", "text": "This is lovely park. Fountains is beautiful. It is definitely worth visiting if you want to have some nice and relaxing time.", "publishedDate": "2017-09-02", "language": "en", "rating": 5}, {"id": 508552279, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d7785899-r508552279-Cascada_Monumental-Barcelona_Catalonia.html", "text": "This is a beautyful garden. Beautyful fountain and a beautyful lake with little boats which you could hire. There were too guys there making bubbles which the kids loved. Great place to spent a day and have a picknik.", "publishedDate": "2017-08-03", "language": "en", "rating": 4}, {"id": 504270702, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d7785899-r504270702-Cascada_Monumental-Barcelona_Catalonia.html", "text": "This is certainly worth a visit as the monument is located in a lovely park and much quieter than the centre. We were told thay the top is not made of real gold due to it being in Barcelona it wouldn't last 3 seconds without getting stolen.", "publishedDate": "2017-07-21", "language": "en", "rating": 5}, {"id": 503194943, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d7785899-r503194943-Cascada_Monumental-Barcelona_Catalonia.html", "text": "It is a marvelous statute and monument fountain in the park definitely worth to see. Landsacpe of monument can bee seen from different sights while you are cooling with your beverages. It is also possible to climb up to besides of statue and can be explored more closer.", "publishedDate": "2017-07-18", "language": "en", "rating": 5}, {"id": 501514148, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d7785899-r501514148-Cascada_Monumental-Barcelona_Catalonia.html", "text": "Its not a tourist area per say but worth the visit. Be careful with the local homeless people in the early mornings. Also if its after a party and they haven't finished cleaning after the crowds it may be a little smelly and dirty but sometime after that it comes to live and it is very enjoyable place to visit no mater what age. I went early bc i like to take photos and don't like the crowds.", "publishedDate": "2017-07-13", "language": "en", "rating": 4}, {"id": 499239622, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d7785899-r499239622-Cascada_Monumental-Barcelona_Catalonia.html", "text": "I would consider it a second tier attraction.  It is however very pretty.  The whole park is pretty.  Little bit out of the way. ", "publishedDate": "2017-07-06", "language": "en", "rating": 3}, {"id": 494911794, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d7785899-r494911794-Cascada_Monumental-Barcelona_Catalonia.html", "text": "We visited on a super hot day......so it was nice to sit under a shade tree and take in the beautiful cascading waters and the georgous greenery.", "publishedDate": "2017-06-21", "language": "en", "rating": 5}, {"id": 488064772, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d7785899-r488064772-Cascada_Monumental-Barcelona_Catalonia.html", "text": "This is a nice fountain in the middle of a serene park. It's worth seeing if you are nearby, and kids would especially enjoy seeing the dragons at the base of the fountain. I've heard it compared to the Trevi Fountain, but it is nowhere near as grand or beautiful.", "publishedDate": "2017-05-26", "language": "en", "rating": 4}, {"id": 486268976, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d7785899-r486268976-Cascada_Monumental-Barcelona_Catalonia.html", "text": "The Cascada Monumental is located in the Parc de la Ciutadella. The cascade flows into a beautiful pond from an architecturally stunning tower. The ornamented tower has a grand staircase. Various gold-plated figures and fountains line the pond. The Cascada is a short walk from the metro at Estación de França or a longer walk from the metro at Arc de Triomf.", "publishedDate": "2017-05-21", "language": "en", "rating": 5}, {"id": 483911250, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d7785899-r483911250-Cascada_Monumental-Barcelona_Catalonia.html", "text": "One of the many beautiful places in Barcelona. Impressive fountain, with a nice view from the top over the park.", "publishedDate": "2017-05-13", "language": "en", "rating": 4}, {"id": 483445091, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d7785899-r483445091-Cascada_Monumental-Barcelona_Catalonia.html", "text": "Loved this fountain in Parc de la Ciutadella.  It cascades down like a waterfall.  Very pleasant to sit nearby to hear the water.", "publishedDate": "2017-05-11", "language": "en", "rating": 5}, {"id": 482303817, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d7785899-r482303817-Cascada_Monumental-Barcelona_Catalonia.html", "text": "If you have time, stop by to visit this fountain that can easily be accessed by the subway. We took the subway to the Arc de Triomf stop, walked to the Parc de la Ciutadella, through the Arc de Triomf and across the street to the Cascada located in a park. Walk time was ~15 minutes but well worth it since the sights along the way that include the arc and park are absolutely beautiful and breathtaking. This isn't a \"must see\", but more one that you would enjoy. We thought the fountain itself was like Rome's Trevi Fountain. It seems to be on a schedule with the water shooting out for a few minutes, then they go off. But the size, intermixed with a pond and greenery set it apart from others in the City.\n\nAlthough the grounds and fountain are beautiful, leading to many great pictures, we were surprised that it hasn't been maintained to the level that one would expect. Our recommendation is that either the local government or park officials invest a little more into maintenance to make it that much better, and maintain it for future generations.", "publishedDate": "2017-05-07", "language": "en", "rating": 5}, {"id": 482108499, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d7785899-r482108499-Cascada_Monumental-Barcelona_Catalonia.html", "text": "Grandiose monumental with fountains and a little waterfall in a nice park close to Arc de Triomf. Nice place to spend a little time when weather is nice.", "publishedDate": "2017-05-06", "language": "en", "rating": 4}, {"id": 481597469, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d7785899-r481597469-Cascada_Monumental-Barcelona_Catalonia.html", "text": "Huge beautiful fountain with lake in the city park. I think you can climb over the fountain itself .", "publishedDate": "2017-05-04", "language": "en", "rating": 5}, {"id": 477308458, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d7785899-r477308458-Cascada_Monumental-Barcelona_Catalonia.html", "text": "The Cascada Monumental is in the Parc de Cuitadella, just down the \"Passieg de Llius Companys\" (nice boulevard) from the Arc de Triomf. The whole area is lovely for walking around, but make sure you head for this beautiful fountain and monumental structure. The photos you will see on line do not do it justice. The park and the Cascada are free to visit.", "publishedDate": "2017-04-19", "language": "en", "rating": 5}, {"id": 475633304, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d7785899-r475633304-Cascada_Monumental-Barcelona_Catalonia.html", "text": "This park and monument are beautiful, a must see when in Barcelona. \n\nWe walked from las ramblas to this park and was not disappointed. ", "publishedDate": "2017-04-14", "language": "en", "rating": 5}, {"id": 475327319, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d7785899-r475327319-Cascada_Monumental-Barcelona_Catalonia.html", "text": "This is huge. The planting out at the front is really well maintained, the gold coloured statues at the top grab your attention. Just where you want to be on such a hot day. To add to this it is in a wonderful park.", "publishedDate": "2017-04-13", "language": "en", "rating": 5}, {"id": 471793593, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d7785899-r471793593-Cascada_Monumental-Barcelona_Catalonia.html", "text": "Not sure why this isn't higher in the list of things to do. It's actually really nice to look at. I thought it was way more interesting than the Arc de Triumph.", "publishedDate": "2017-03-31", "language": "en", "rating": 5}, {"id": 470935929, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d7785899-r470935929-Cascada_Monumental-Barcelona_Catalonia.html", "text": "The fountain and park are definitely worth seeing in Barcelona. The fountain is much larger than people expect, and it's so beautiful. You can climb the monument, and the park from a different angle. It can be compared to the fountain in Madrid's El Retiro Park.", "publishedDate": "2017-03-28", "language": "en", "rating": 5}, {"id": 469600047, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d7785899-r469600047-Cascada_Monumental-Barcelona_Catalonia.html", "text": "located in Parc de la Ciutadella, this monument is def worth a visit.  From the golden horse & chariot to the fountains below.  We sat on the benches and watched the world go by.\nDef one not to miss on your visit to the city.", "publishedDate": "2017-03-23", "language": "en", "rating": 5}, {"id": 460870428, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d7785899-r460870428-Cascada_Monumental-Barcelona_Catalonia.html", "text": "This is a STUNNING waterfall monument located in the Ciutadella park.\nThe monument includes a structure you can go through, numerous statues, a pond with animal fountains and gilded statues along the structure.\nThe central piece of the monument, however, is a gorgeous waterfall coming down from the top to the pond.\nDo not miss this monument while in Barcelona. It's one of the most beautiful sights in the entire city.\nHighly recommended!", "publishedDate": "2017-02-18", "language": "en", "rating": 5}, {"id": 453342827, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d7785899-r453342827-Cascada_Monumental-Barcelona_Catalonia.html", "text": "Superb fountain.. the gold horse and chariot is amazing.. it's well worth checking out if you're in the area.   The fountain is surrounded by a decent park with a variety of bird species.   It's generally clean but I spotted one or two piles of dog mess,  watch your step.", "publishedDate": "2017-01-19", "language": "en", "rating": 5}, {"id": 452540998, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d7785899-r452540998-Cascada_Monumental-Barcelona_Catalonia.html", "text": "We visited this monument in the afternoon, sat near it with a coffee and watched the world go by, it is certainly well designed and very popular with tourists taking selfies etc and using this as a background.", "publishedDate": "2017-01-16", "language": "en", "rating": 4}, {"id": 447414506, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d7785899-r447414506-Cascada_Monumental-Barcelona_Catalonia.html", "text": "This is a really nice place, definitely worth a trip. Even if you are not particularly interested in the fountain itself, the view from the top is great and the surroundings are an interesting place for a walk.", "publishedDate": "2016-12-29", "language": "en", "rating": 4}, {"id": 446649689, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d7785899-r446649689-Cascada_Monumental-Barcelona_Catalonia.html", "text": "Try to find out which part a young Gaudi designed. Intriguing fountain with things to discover. One of the musts of Barcelona. ", "publishedDate": "2016-12-25", "language": "en", "rating": 5}, {"id": 444689778, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d7785899-r444689778-Cascada_Monumental-Barcelona_Catalonia.html", "text": "Lovely fountain, with Gaudi's touch. Great for pictures and a stroll or picnic around the park. Do play with the giant bubbles that the locals guys offer. You only need to give them a small coin but the pictures of you playing with the fountain in the background are priceless!", "publishedDate": "2016-12-16", "language": "en", "rating": 5}, {"id": 440635779, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d7785899-r440635779-Cascada_Monumental-Barcelona_Catalonia.html", "text": "This fountain, inspired by the Trevi fountain in Rome is a delight to see and photograph. Although not designed by Gaudi he was an assitant to Josep Fontsere the man who designed it in 1881.", "publishedDate": "2016-11-28", "language": "en", "rating": 4}, {"id": 436307101, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d7785899-r436307101-Cascada_Monumental-Barcelona_Catalonia.html", "text": "Nice park, awesome cascade, in the city centre. Do make sure to stop by, grab snacks and drinks and spend lovely moments there", "publishedDate": "2016-11-11", "language": "en", "rating": 5}]}}]