[{"locationId": 244821, "name": "Barcelona Zoo", "placeType": "ATTRACTION", "reviewListPage": {"reviews": [{"id": 752247274, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d244821-r752247274-Barcelona_Zoo-Barcelona_Catalonia.html", "text": "This zoo is located in the picturesque Ciutadella Park (which is worth a visit on its own). There is enough to do in the zoo for at least half a day, with plenty of animals to see.", "publishedDate": "2020-04-04", "language": "en", "rating": 4}, {"id": 752152285, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d244821-r752152285-Barcelona_Zoo-Barcelona_Catalonia.html", "text": "What a graet way to spend a day...The zoo is fabulous with some super animals to see. Well looked after, clean and so enjoyable", "publishedDate": "2020-04-02", "language": "en", "rating": 5}, {"id": 750897032, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d244821-r750897032-Barcelona_Zoo-Barcelona_Catalonia.html", "text": "I didn t was impressed about this place. I was expecting to be much easy to visit the zoo. Very complicated to follow the map.\nBut overall was a nice experience.", "publishedDate": "2020-03-14", "language": "en", "rating": 3}, {"id": 750495968, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d244821-r750495968-Barcelona_Zoo-Barcelona_Catalonia.html", "text": "The visit left me feeling terribly sad. The animals had so little space and looked miserable. The zoo itself looks rundown.\nWe've visited Valencia zoo, which was just lovely. The animals had so much space and freedom of movement. Barcelona needs to learn and invest.", "publishedDate": "2020-03-11", "language": "en", "rating": 1}, {"id": 750326410, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d244821-r750326410-Barcelona_Zoo-Barcelona_Catalonia.html", "text": "Zoo was ok, but it's really spaced out and the eating facilities were quite sparce.  I felt that some of the animals didnt really have enough space to run freely.  The tiger seemed distressed that everyone was looking at him and I thought this was quite sad.  We couldnt even see the Lions as they were hidden from site.  It was nice to see the animals we did, however I actually wouldnt rate it that high. ", "publishedDate": "2020-03-10", "language": "en", "rating": 3}, {"id": 749639051, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d244821-r749639051-Barcelona_Zoo-Barcelona_Catalonia.html", "text": "This zoo made me feel sad. I wanted to see all the animals but equally wanted to get round it quickly so I didn’t have to see how sad and enclosed some of them were. The orangutans had the biggest section but then a whole load of gorillas are in one tiny space, both pygmy and normal hippos have the tiniest of spaces. Very disappointed.", "publishedDate": "2020-03-06", "language": "en", "rating": 2}, {"id": 748373477, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d244821-r748373477-Barcelona_Zoo-Barcelona_Catalonia.html", "text": "Got our tickets half price on line before going in and saved queuing as well. It wasn’t too busy and some of the main animals were out. Good park for the kids, could do with a few more choices in the cafes. Good day out though, sea lions were good fun.", "publishedDate": "2020-02-29", "language": "en", "rating": 3}, {"id": 747011897, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d244821-r747011897-Barcelona_Zoo-Barcelona_Catalonia.html", "text": "I wish there had been a 3.5 rating...it was above average, but not very good...\nIt is a confusing place to walk around, and not very big. Still, very pleasant. I always recommend to go to the places locals would visit, and zoos show you what an area is really like, not just the shined up touristy area.\nThe first thing that struck me is the number of stray cats running around. Just odd for a zoo. Then, my wife spent as much time taking pictures of the bnirds in the trees as the animals. on display.\nAs far as I could see, there's no path that will take you to everything efficiently, but it's a quaint, charming place, with some very nice exhibits, including dolphins. \nThey have zoo food available, and the gift shop was less than thrilling, so no Barcelona Zoo t-shirts!\nConstruction did hinder some of our visit, and it was November, so no big crowds. \nStill, well worth a visit, especially for a family, or for any zoo people!", "publishedDate": "2020-02-23", "language": "en", "rating": 3}, {"id": 746357086, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d244821-r746357086-Barcelona_Zoo-Barcelona_Catalonia.html", "text": "We spent a very pleasant 4.5h here on a sunny winter midweek day. I hadn’t been for 15 years and it has much improved with obvious and ongoing investment. The children were entertained and content for the duration. Before you buy bottled water, look for the many public water fountains, many nearest hyenas. ", "publishedDate": "2020-02-20", "language": "en", "rating": 4}, {"id": 746076196, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d244821-r746076196-Barcelona_Zoo-Barcelona_Catalonia.html", "text": "It was a great last minute choice (mainly due to the online tickets being half price!). We had already visited the park it is situated in, saw it and ended up going a couple of days later. \n\nIt is a big zoo. We walked for hours and hours, at one point we couldn’t believe that we had only covered a third of the zoo. \n\nGreat selection of animals however dolphin area was closed. As mentioned in other reviews, some of the enclosures appear small for large animals etc hence the 4 stars. \n\nWe had food there and didn’t find it too expensive. \n\nI would recommend a visit. ", "publishedDate": "2020-02-19", "language": "en", "rating": 4}, {"id": 745523521, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d244821-r745523521-Barcelona_Zoo-Barcelona_Catalonia.html", "text": "It is a very big zoo, with a lot of animals to see! After walking the whole day inside the zoo our legs were hurting - and we just managed to see the last animals before the closing time. This side of the zoo was great!\nOn a negative note:\n- it is quite expensive (on the web-site it was written 50% discount till March - in reality it only applied for the tickets bought online - so do buy them online) \n- it is badly organized: delphinarium was closed the day we were at the zoo - nobody told us about it, we have learnt about it at the delphinarium door. There is no timetables for activities inside the park. The timetable on their web-site was not correct, or maybe has just changed the week we were in Barcelona. Inside the park they propose to use their internet to see the timetable for activities - but internet did not work (on any of our phones).", "publishedDate": "2020-02-16", "language": "en", "rating": 3}, {"id": 743709197, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d244821-r743709197-Barcelona_Zoo-Barcelona_Catalonia.html", "text": "Well, it's not the best zoo but it is a good one. It is big enough and very clean. The woman who sells tickets is veryy kind and helpful. Flamingoes are worth visit. Lot of animals seems bored. There are no lions and tigers, i don't know why. :( ", "publishedDate": "2020-02-08", "language": "en", "rating": 4}, {"id": 741025350, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d244821-r741025350-Barcelona_Zoo-Barcelona_Catalonia.html", "text": "Was a fairly nice Zoo, some of the areas appear somewhat tired and enclosures for large and mobile animals are far far too small. \nSome of the areas need more enrichment especially for the lions Tigers Rhino and Elephants.\nAnimals that live in family groups such as the primate family need far more space\nI’m sure the staff care for the animals without exception and the enclosures are but it seriously needs some money spending on it and the space for some of the animals needs to be c and changed.\nThey do have dolphins that I won’t even watch as these animals need to be in the wild and not in far too small tanks smaller than pools in hotels.\nZoos do have a purpose in the Education of human kind and breeding programmes but must be more flexible and aware of enclosure size and enrichment.\n ", "publishedDate": "2020-01-24", "language": "en", "rating": 3}, {"id": 740262564, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d244821-r740262564-Barcelona_Zoo-Barcelona_Catalonia.html", "text": "This zoo is a great environment for the animals. We did not find it easy to navigate even with map, but we got around entire zoo. We saw places to eat or snack. There was a good variety of animals. They had a wheelchair for me, which has access to all but dolphins. I can walk, but that day was a bad arthritis day. It was a Saturday, but low season so no crowds. It would be a nice treat for kids who are being dragged around to adult sites all day.", "publishedDate": "2020-01-20", "language": "en", "rating": 5}, {"id": 738498585, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d244821-r738498585-Barcelona_Zoo-Barcelona_Catalonia.html", "text": "We enjoyed the place a lot. Loved yhe wolves and also the reptile area. Very quiet on the Wednesday that we visited", "publishedDate": "2020-01-11", "language": "en", "rating": 5}, {"id": 736057527, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d244821-r736057527-Barcelona_Zoo-Barcelona_Catalonia.html", "text": "One of the best zoo’s we have visited. The animals are presented in a very nice environment and good design. Very good services (toilets, coffee bars and shops).\n", "publishedDate": "2020-01-01", "language": "en", "rating": 5}, {"id": 735577861, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d244821-r735577861-Barcelona_Zoo-Barcelona_Catalonia.html", "text": "You need to take some time to visit this Zoo because it’s pretty big and it takes time to find all the animals and to read about them.", "publishedDate": "2019-12-30", "language": "en", "rating": 4}, {"id": 735105142, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d244821-r735105142-Barcelona_Zoo-Barcelona_Catalonia.html", "text": "The zoo was extremely small. Very expensive for what you see. I expected much more and we thought we'd see lions but there weren't any just a sticker saying lions will be here shortly. Well we didn't see any at all. I do not recommend worst zoo I've ever been in .\n", "publishedDate": "2019-12-28", "language": "en", "rating": 1}, {"id": 734423887, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d244821-r734423887-Barcelona_Zoo-Barcelona_Catalonia.html", "text": "Location: East of the city, pretty good transport links and a nice park outside the zoo. \nPrice: Over 20E for adults on the gate, slightly cheaper online - book online if you can.\n\nThis zoo isn't the best zoo, the enclosures are pretty small and the animals look bored. This may be because it's December, but nonetheless, avoid this unless you're absolutely desperate for things to do in Barcelona.", "publishedDate": "2019-12-24", "language": "en", "rating": 2}, {"id": 733295757, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d244821-r733295757-Barcelona_Zoo-Barcelona_Catalonia.html", "text": "Being Zoo fans my wife and I have visited a large number of zoos in the US, Canada and Europe.  This is a small Zoo, but well organized, unique animals and well maintained.  Well worth the entry fee and time.", "publishedDate": "2019-12-17", "language": "en", "rating": 4}, {"id": 731046148, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d244821-r731046148-Barcelona_Zoo-Barcelona_Catalonia.html", "text": "This Zoo is great. The place is huge and you can spent hours walking. They provide a map so you will know where you are and what kind of animals they have. It was great and relaxing.", "publishedDate": "2019-12-06", "language": "en", "rating": 5}, {"id": 729653212, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d244821-r729653212-Barcelona_Zoo-Barcelona_Catalonia.html", "text": "Who doesn’t like to see beautiful animals and learn about their habitat!  The Barcelona Zoo is home to many endangered species as well as common animals.  We spent about 2 hours wandering around and had a blast!", "publishedDate": "2019-11-29", "language": "en", "rating": 5}, {"id": 729289144, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d244821-r729289144-Barcelona_Zoo-Barcelona_Catalonia.html", "text": "It was one of the best experience in barcelona. High recommended for those who have children to give a try", "publishedDate": "2019-11-27", "language": "en", "rating": 4}, {"id": 727827956, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d244821-r727827956-Barcelona_Zoo-Barcelona_Catalonia.html", "text": "Its a must do for families....the zoo is accesible for strollers...kids under 2 years are free..the down point is there was a maintenance in the lions cages..so didnt get to see", "publishedDate": "2019-11-20", "language": "en", "rating": 4}, {"id": 727369005, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d244821-r727369005-Barcelona_Zoo-Barcelona_Catalonia.html", "text": "We visited this zoo without knowing much about it and spent 2-3 hours walking around to cover everything. I think it was a good zoo. Most of the animals seemed to have enough space to move around.", "publishedDate": "2019-11-18", "language": "en", "rating": 4}, {"id": 724919645, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d244821-r724919645-Barcelona_Zoo-Barcelona_Catalonia.html", "text": "Very nice zoo, well kept and big. A lot of interesting animals. My young children loved it.\nThere is also a beautiful playing area for children.", "publishedDate": "2019-11-08", "language": "en", "rating": 4}, {"id": 724525925, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d244821-r724525925-Barcelona_Zoo-Barcelona_Catalonia.html", "text": "Came here today and it was very quiet which was nice having most of the zoo to ourselves, apart from a few small school groups! However half of the place was shut for maintenance etc! \nNice place but at 22€ an adult to see only half of the animals it’s a bit expensive! Should do off peak tickets or cheaper fair when out of season or doing work! ", "publishedDate": "2019-11-06", "language": "en", "rating": 2}, {"id": 723692743, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d244821-r723692743-Barcelona_Zoo-Barcelona_Catalonia.html", "text": "This review is not about the ZOO itself, but the \"ticketing\" site Headout, which appears to be a scam. I just spent ~40 EUR on them site for tickets (my bad that I didn't paid enough attention that it is NOT the official ZOO website), and no tickets were provided. When I wrote them an email complaining about the problem they replied \"We are giving you a cashback of €6 as a gesture of goodwill for booking on your BARCELONA experience reservation with our partnered website\" - equal crap. After that I realized that I was scammed, so I bought the tickets from official website of Zoo Park and, guess what, them were far cheaper (~31 EUR). So be advised, never use this scam site for booking tickets, neither her nor anyway in this world.", "publishedDate": "2019-11-04", "language": "en", "rating": 5}, {"id": 722405492, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d244821-r722405492-Barcelona_Zoo-Barcelona_Catalonia.html", "text": "I had requests ignored, ketchup packets thrown at me, charged for cups I didn't get (cupgate... still don't understand what that was about) and general spoken to like dirt at the food stalls. Really annoyed me, manners are free and there is no need for people to be so rude. \n\nStaff at the main gate were really nice, as were security. \n\nAnimals kept in decent sized enclosures most of the time but it's not the best zoo I've ever been to. \n\nOverall a tad overpriced - the food is very expensive - but still worth a look if you're interested.", "publishedDate": "2019-10-29", "language": "en", "rating": 3}, {"id": 719443856, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d244821-r719443856-Barcelona_Zoo-Barcelona_Catalonia.html", "text": "I had to exchange my voucher for a ticket, which I was not aware of doing.  I was handed a ticket and a map, and given no further information.  Me and my friend circled the same section a couple of times.  There was a rhino who was led down, and didn't seem to be moving initially, he then moved his head, so we knew he was alive.  Some of the enclosures seemed very small for the animal they were holding.  You can probably tell by my screen name that my favorite animal is a Tiger, and when we came across the Tiger enclosure it was empty with some workers doing some maintenance.  I asked a staff member if the Tigers were somewhere else, and they told us that they were not here today.  I was gutted, if I was informed of this on entry, I would have asked if I could exchange my ticket for the following day.  There was a lot of flies about, and my legs were bitten quite a bit.  The dolphinarium was also not open.  When I go to a zoo, I like to be there from open to close.  I was in here less than 4 hours.  Very disappointing visit, one of the worst zoos I have been to.  I would not recommend.", "publishedDate": "2019-10-18", "language": "en", "rating": 1}, {"id": 718891983, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d244821-r718891983-Barcelona_Zoo-Barcelona_Catalonia.html", "text": "We purchased a year long pass because it was similar price for 2 adults and 2 kids.  We ended up coming to the zoo 3 times during our stay.  It is a very cool place to see.  Must see.", "publishedDate": "2019-10-16", "language": "en", "rating": 5}, {"id": 718489765, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d244821-r718489765-Barcelona_Zoo-Barcelona_Catalonia.html", "text": "Visited the Barcelona zoo on a Saturday afternoon.  It is a comfortable walk from several metro stations including the Arc d'Triomphe and Barceloneta.  Many families were visiting with their young children.  While it was well attended, we did not find it crowded.\n\nThis zoo is quite large but overall a clean, pleasant walkable layout.  Most animal exhibits have multiple viewing locations, many of them allowing for very close watching the animals.  We especially liked the Aviary exhibit with many colorful birds.  The zoo has specific shows highlighting certain animals (e.g. seals) so check their website in advance of visiting to see if you can be there for one.\n\nThe entry fee currently is 20 euros for adults but if you are 65+, the admission fee is only half!  We found this to be a great value.  \n\nIf you have time in your visit to Barcelona, this is a good addition to your itinerary", "publishedDate": "2019-10-15", "language": "en", "rating": 4}, {"id": 717850093, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d244821-r717850093-Barcelona_Zoo-Barcelona_Catalonia.html", "text": "My mate is a massive zoo fan so I tagged along .. the zoo is tired and needs a good clean after a busy season and some of the enclosures are tiny . Poor Pedro the rhino .. we were disappointed that the tigers were not there . But it killed a morning , we were gonna spend a day but we’d seen it all.. the aquarium was closed too . Should of been told this before we bought a ticket xx ", "publishedDate": "2019-10-12", "language": "en", "rating": 3}, {"id": 717545754, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d244821-r717545754-Barcelona_Zoo-Barcelona_Catalonia.html", "text": "Second time coming here over 5 years and the zoo has changed so much, for the better! I got chased by those pesky peacocks. New enclosures and wierd animals, lots of information too! You can tell its a good zoo when you see keepers around looking at the animals etc which is great! I especially liked the birds and the small animals, whilst orangoutangs were massive and the monkeys were mischievous!", "publishedDate": "2019-10-12", "language": "en", "rating": 5}, {"id": 717315022, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d244821-r717315022-Barcelona_Zoo-Barcelona_Catalonia.html", "text": "We really enjoyed the zoo. Was very quite so had a nice walk and got to see all the animals without any crowds. Is a great zoo well laid out with lots to see.", "publishedDate": "2019-10-11", "language": "en", "rating": 5}, {"id": 716809207, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d244821-r716809207-Barcelona_Zoo-Barcelona_Catalonia.html", "text": "By international standards this zoo is rock bottom. Small enclosures, animals covered in flies and really expensive. In these modern times, surely we are better than this...", "publishedDate": "2019-10-09", "language": "en", "rating": 1}, {"id": 716808445, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d244821-r716808445-Barcelona_Zoo-Barcelona_Catalonia.html", "text": "Way past time that Zoo’s like this that are relics of bygone era are closed permanently. I horrible dreary place with an assortment of animals in small enclosures all looking bored senseless. My last trip to any zoo for sure.", "publishedDate": "2019-10-09", "language": "en", "rating": 1}, {"id": 716247528, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d244821-r716247528-Barcelona_Zoo-Barcelona_Catalonia.html", "text": "Mixed reviews on trip adviser, but I enjoyed the zoo. The dolphins were closed, which was a bit disappointing, as well as a lot of the stalls/shops due to the low season I guess. \n\nOverall the zoo was clean and animals looked happy, some of the enclosures were quite small. But there was plenty to see and easy to get around. The map wasn't particularly clear but we still managed to see everything in the time we had. The park outside the zoo looked lovely also and I think is worth a visit. \n\nWe really enjoyed the lizards, snakes and frogs! And all of the monkeys/gorillas and apes who seemed to be enjoying swinging about in the sunshine!", "publishedDate": "2019-10-08", "language": "en", "rating": 4}, {"id": 715631935, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d244821-r715631935-Barcelona_Zoo-Barcelona_Catalonia.html", "text": "I visited Barcelona yesterday and I wasn't disappointed. I really wanted to see the big cats and I seen the tiger who was awake and rooming around. I also got to see the lions which was cool. The park seems nice and clean with a relaxed atmosphere. There are plenty of areas where you can sit and chill out. I recommend the Barcelona zoo as it's worth it.", "publishedDate": "2019-10-05", "language": "en", "rating": 4}, {"id": 715543990, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d244821-r715543990-Barcelona_Zoo-Barcelona_Catalonia.html", "text": "Barcelona zoo was nice. Many exhibits were closed notably all the sealife exhibits. The zoo map is hard to follow and most of the snack and drink kiosks were closed. The animals were active and beautiful.", "publishedDate": "2019-10-05", "language": "en", "rating": 4}, {"id": 713707623, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d244821-r713707623-Barcelona_Zoo-Barcelona_Catalonia.html", "text": "Our last day in Barcelona, we had heard some good reviews of the zoo but when I looked on TripAdvisor I also noted the bad reviews. We took these with a pinch of salt...fast forward two hours, I am crying watching a spider monkey sat with his head hung down looking completely depressed. Crocodiles in tiny enclosures filled with turtles. Kangaroos infested with flies, mainly because they enclosure is covered in poo which obviously hasn’t been cleaned out recently. The rhino, as noted in below reviews was so thin with ribs clearly on show. After a short while I looked at my partner and asked him to leave - we therefore didn’t see the elephants etc. So sad and a very upsetting last day to finish our holiday. ", "publishedDate": "2019-09-28", "language": "en", "rating": 1}, {"id": 713239590, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d244821-r713239590-Barcelona_Zoo-Barcelona_Catalonia.html", "text": "I will start with the positive, I think the zoo was quite a big size with quite a bit of free spaces. The staff seem to care for the animals.\nNow for the negative’s the in closures far to small for some of the animals. There are animals in captivity that don’t really need to be there. It mentions about the zoo doing conservation but I don’t see how this would work as most of the animals look so depressed. ", "publishedDate": "2019-09-26", "language": "en", "rating": 2}, {"id": 713227489, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d244821-r713227489-Barcelona_Zoo-Barcelona_Catalonia.html", "text": "It's hard to believe how big this zoo is inside and how many big animals it has. We did not expect to be amazed but my animal conservationist girlfriend and I were so impressed. However she noted the tiger enclosure is too small and we saw one very stressed cockatoo. \n\nDidn't eat here but suggest taking a picnic as there's loads of benches to freely use with good views of the animals. Visibility of enclosures is amazing for taking photos and we spent about 4 hours seeing it all, except for the dolphins. Even though the website said open until 18:00 we were very sad to see staff closing off the dolphin area at 17:00 and we couldn't get in ", "publishedDate": "2019-09-26", "language": "en", "rating": 5}, {"id": 713141870, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d244821-r713141870-Barcelona_Zoo-Barcelona_Catalonia.html", "text": "It is a big Zoo, where it is possible to spend lots of hours. But lots of places where should be anomaly are closed like lions dolphins and many others", "publishedDate": "2019-09-26", "language": "en", "rating": 3}, {"id": 712880544, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d244821-r712880544-Barcelona_Zoo-Barcelona_Catalonia.html", "text": "Wide range of animals in decent environments. Animals were older and probably came here from other zoos.  not expensive.  Within walking distance of Las Ramblas.", "publishedDate": "2019-09-25", "language": "en", "rating": 4}, {"id": 712524402, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d244821-r712524402-Barcelona_Zoo-Barcelona_Catalonia.html", "text": "What a great place to spend a few hours in. I’d recommend anyone of any age to take a trip to here. Not all the restaurants were open to stop off for a snack. I’d say that’s just the time of year, but there is plenty to see. Very interesting and very enjoyable 👍🏻", "publishedDate": "2019-09-24", "language": "en", "rating": 5}, {"id": 711209407, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d244821-r711209407-Barcelona_Zoo-Barcelona_Catalonia.html", "text": "I really enjoyed my day at Barcelona zoo. Plenty animals to see and wasnt too badly priced. The food wasnt bad either and if you wanted to bring your own there is plenty of benches. There is a cracking childrens park there too, plus outside are the most stunning gardens!", "publishedDate": "2019-09-19", "language": "en", "rating": 5}, {"id": 710753523, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d244821-r710753523-Barcelona_Zoo-Barcelona_Catalonia.html", "text": "We decided to go here on our last day in Barcelona. Entry was 42 Euros for 2 adults which isn’t bad. There are all sorts of animals there we wanted to see. The park itself is inside a public park. It was very quiet as it was a Monday afternoon. The lions we couldn’t see and also the dolphin section was closed. The eating areas where sparse and not very clean. What we did notice was that the larger animals didn’t at all have sufficient areas, very small. We’ve been to some of the best zoos and compared to those it is small. Cannot be healthy for the animals. \nThe poor Rhino even though it was old was very thin and you could see it’s ribs clearly. \nFor value it was ok. ", "publishedDate": "2019-09-17", "language": "en", "rating": 3}, {"id": 710297566, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d244821-r710297566-Barcelona_Zoo-Barcelona_Catalonia.html", "text": "Horrible, animals here are so depressed. Some animals live in such small places here with no stimulation, if you think they are going to be there every day until the end of their life, it just makes me so sad. I would rather keep my money and spend them somewhere else, there are so many beautiful and magnificent attractions around Barcelona. Go elsewhere and save your money.", "publishedDate": "2019-09-16", "language": "en", "rating": 1}, {"id": 709946150, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d244821-r709946150-Barcelona_Zoo-Barcelona_Catalonia.html", "text": "Abit confused with the other reviews stating excellent and one of the best zoo’s in Europe, I must have been visiting a different one? \nBooked this excursion to take my 3 year old daughter and even she wasn’t really impressed. Now I know it is hot weather in summer and the animals like to sleep but most zoos I’ve been to you can view the animal in there sleeping quarters, this wasn’t the case here, in most enclosures it took us several minutes to even find if there was an animal in there behind the over grown bushes and trees with little viewing space, so if the animal was inside it can’t be seen. Several animals where also under veterinary treatment so they weren’t obviously in there enclosure. \nI found that majority of the animal enclosures where FAR to small for the species of animal, mainly the large cats (lions, tigers, jaguar and leopard) and defiantly the dolphins. \nAll enclosures are very old and really unkept. \nThe rhino enclosure was also on the small side, and you could tell the moat where water should be was all full of leaves and growing weeds so not had water in there for a long time. \nLack of signage and dirty food areas (sick all over the floor)  \nPerfect place if you like birds and parrots and plants/weeds and trees.", "publishedDate": "2019-09-15", "language": "en", "rating": 1}, {"id": 709163769, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d244821-r709163769-Barcelona_Zoo-Barcelona_Catalonia.html", "text": "Very lovely Zoo, probably the nicest one we saw so far, definitely recommend you try it. Especially loved the Dolphins, the Penguins and the Elephants. Plenty of animals variaty, you can definitely spend 3-4 hours here and you won't get bored. \nThe Dolphin access is from 11 am so make sure you don't miss the feeding time, same thing for the Penguins. \nDefinitely one attraction thats worth seeing, especially if you have kids, I recommend getting tickets online to avoid the entry queue. ", "publishedDate": "2019-09-12", "language": "en", "rating": 5}, {"id": 708047769, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d244821-r708047769-Barcelona_Zoo-Barcelona_Catalonia.html", "text": "Barcelona Zoo os located in La Ciutadella, near França train station, in Barcelona. It is a zoo, where you can see a lot of animals like kangaroos, lions, birds or giraffes. Really, it is one of the best zoos, that I have visited in Europe.\nIn fact, it is a very good place to come with children, because they can see and know a lot of different animals and they can play in some playgrounds in the zoo.", "publishedDate": "2019-09-09", "language": "en", "rating": 4}, {"id": 707574222, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d244821-r707574222-Barcelona_Zoo-Barcelona_Catalonia.html", "text": "At first I thought the zoo was quite expensive to get in, but after four hours of wandering round looking at all the animals that live there and the habitat that's been built for them I fully see now how the entrance cost is justified, its a superb zoo, well kept and tidy and all the animals seem happy and looked after, if I was in Barcelona again I wouldn't hesitate to look round again, well done to all the hard working staff for making it such an excellent place", "publishedDate": "2019-09-07", "language": "en", "rating": 5}, {"id": 707554674, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d244821-r707554674-Barcelona_Zoo-Barcelona_Catalonia.html", "text": "From the outside and the side we approached it from Barcelona zoo didn't look all that but then we got to the park it's inside and actually it's in a really nice place.I haven't been to a zoo for 35 odd years and they've got enough there to keep you interested , I was there over 3 and a half hours and you can easily spend even more time there as there are lots of shaded areas and a couple of cafes if the heat gets too much.\n\nI'd go early morning or later 2-3pm because all the animals seemed to get fed around 11am then went to sleep for an hour !!", "publishedDate": "2019-09-07", "language": "en", "rating": 4}, {"id": 706441764, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d244821-r706441764-Barcelona_Zoo-Barcelona_Catalonia.html", "text": "Went on holiday to Barcelona in July this year , had a lovely time visiting the zoo, many animals to see although a lot of them were to busy sleeping or keeping out of the sun. Spent around four hours looking round then stopped for drink and a look round the gift shop, had a great time well worth going to visit.", "publishedDate": "2019-09-04", "language": "en", "rating": 5}, {"id": 706296893, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d244821-r706296893-Barcelona_Zoo-Barcelona_Catalonia.html", "text": "We have visited the zoo with our kid of 2 years old. such a lovely zoo with a lot of animals to see. Recommend if you have kids but a worth visit for the adults as well. ", "publishedDate": "2019-09-03", "language": "en", "rating": 4}, {"id": 706238702, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d244821-r706238702-Barcelona_Zoo-Barcelona_Catalonia.html", "text": "Very pleasant as you walk in from the heat outside shady trees this place another Barcelona secrets don't want people too find these places when we got off bus had to ask where it was no signs up zoos need people too go animals need too be seen some of the enclosures need updating the r h I n o look sad and directions round park need too be more prominent did not see a children's part of zoo go in and meet the animals only a playground not many staff around too ask information about zoo ", "publishedDate": "2019-09-03", "language": "en", "rating": 4}, {"id": 705218663, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d244821-r705218663-Barcelona_Zoo-Barcelona_Catalonia.html", "text": "Really good zoo, the enclosures are a little small, but all animals seem really happy! I’ve been to zoo’s where they have massive enclosures but no activities and they look depressed, but these looked health active and fun! The zoo in massive can easily spend 3 hours here at least to see everything! If not a lot longer, all the food and drink places were open which was good! Wasn’t overly expensive, and they do a re-usable cup program, if you buy a cup drink you pay 2€ more and if you bring the cup back you get your money back, great idea! A lot of good things for the environment! Including a recycling centre! Also the best bit , it was roasting and in the play area , they have cold mist spraying all over the area to cool you down it’s lovely on a hot day!! \n\nVery impressed , only down side there was no dolphin show", "publishedDate": "2019-09-01", "language": "en", "rating": 5}, {"id": 703836446, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d244821-r703836446-Barcelona_Zoo-Barcelona_Catalonia.html", "text": "Was fuming had pre booked our tickets was looking forward to seeing the zoo as we heard it was unreal when we arrived it was dead there was no lions, tigers, snakes, gorillas and the dolphins and whales show wasn’t even open the animals looked looked sick of there lives was horrible to see and to top on the visit the gift shop was a rip off ", "publishedDate": "2019-08-28", "language": "en", "rating": 1}, {"id": 702978099, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d244821-r702978099-Barcelona_Zoo-Barcelona_Catalonia.html", "text": "We came across the Zoo accidentally looking for a walk in the Parc Ciutadella. The Zoo is amazingly set out. All the usual  animals are there - giant apes, monkeys, orangutans, giraffes, giant tortoises, lions, tigers, penguins etc. What is unique is the layout, All the animals seem to so relaxed and showing no sign of stress yet the space was surprisingly small. London Zoo should take note. Food was cheap too ! Admission was also good value - just £ 9 Euros for retirees. There is also a very helpful free app for iPhone and Android to guide you. The animals are very close and come right up to you safely which us great for photographs not possible in other zoos in my experience. Will definitely be going for a return visit !!!", "publishedDate": "2019-08-25", "language": "en", "rating": 5}, {"id": 702239106, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d244821-r702239106-Barcelona_Zoo-Barcelona_Catalonia.html", "text": "went for the day out amazing zoo and very big we really enjoyed are day here loved seeing all the animals you can grab somthing to eat in there a bit expensive also a couple of gift shops loved are day there", "publishedDate": "2019-08-23", "language": "en", "rating": 5}, {"id": 701958938, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d244821-r701958938-Barcelona_Zoo-Barcelona_Catalonia.html", "text": "We visit the place with my family and a young child. Really nice place..easy access if you have pram. Also areas for kids to play outdoor. Lots of cafe to make a stop. Highly recommended.", "publishedDate": "2019-08-22", "language": "en", "rating": 4}, {"id": 701956708, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d244821-r701956708-Barcelona_Zoo-Barcelona_Catalonia.html", "text": "This was the biggest zoo I’ve ever been to. Lots to see and one could spend hours to see everything. Food available inside. 17 Euros per adult admission. Postcards are available in the gift shop.", "publishedDate": "2019-08-22", "language": "en", "rating": 5}, {"id": 701346489, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d244821-r701346489-Barcelona_Zoo-Barcelona_Catalonia.html", "text": "After reading a few bad comments I decide to go myself , was a very good experience for the whole family specially for the small ones they had a great time watching the animals the shows and also playing in the children playground.", "publishedDate": "2019-08-21", "language": "en", "rating": 5}, {"id": 700083510, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d244821-r700083510-Barcelona_Zoo-Barcelona_Catalonia.html", "text": "Just don't go. Barcelona have much more to show you, save you time and money for something else. It is expensive; badly organized; many places are closed; in open places you do not see the animals and there not much animals. You can see much better zoos in many places. DO something else!!!\nIt place in a nice park (Parc de la Ciutadella), it could be nice to spend some time at the park without getting into the zoo.", "publishedDate": "2019-08-17", "language": "en", "rating": 1}, {"id": 699012406, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d244821-r699012406-Barcelona_Zoo-Barcelona_Catalonia.html", "text": "It was fun to see animals and there are a good variety also! Enclosures were extremely easy to see the animals and the nearby park around the zoo was nice to walk through afterwards.", "publishedDate": "2019-08-14", "language": "en", "rating": 4}, {"id": 697803191, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d244821-r697803191-Barcelona_Zoo-Barcelona_Catalonia.html", "text": "Needed a good 3 hours here. Very user friendly zoo. Animals well visible in all areas. Refreshment points which were essential in the hot weather. Nice balance and number of animals to view. Beautiful grounds. Well enjoyed our time there. Would recommend.", "publishedDate": "2019-08-11", "language": "en", "rating": 5}, {"id": 697301408, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d244821-r697301408-Barcelona_Zoo-Barcelona_Catalonia.html", "text": "We had been in Barcelona Zoo with our kids. \nMy daughter is 15 and the other child is 12, it was a fantastic and emotional experience. \nWe were very tired at the end but happy. \nThe Gorilla group was spectacular.", "publishedDate": "2019-08-09", "language": "en", "rating": 5}, {"id": 697254437, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d244821-r697254437-Barcelona_Zoo-Barcelona_Catalonia.html", "text": "For a city zoo, this was a great visit! Usually we tend to walk around zoo’s quite quickly but for a change, we spent hours walking around with still more to see.\n\nPrices are quite reasonable!", "publishedDate": "2019-08-09", "language": "en", "rating": 4}, {"id": 697186463, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d244821-r697186463-Barcelona_Zoo-Barcelona_Catalonia.html", "text": "I spent about three hours here one morning seeing the various animals in the zoo. Some were very difficult to see due to the sun and overgrown plants in the enclosures. \nThe zoo has a wide variety of animals and the map was very helpful in allowing me to see them all in an efficient way. \nI visited not long after the zoo opened and didn’t have to queue for long to enter the zoo. \nI didn’t eat at any of the restaurants, or make use of the picnic facilities, nor would I. The peacocks openly roam the park and walk on the table tops, this is unhygienic. ", "publishedDate": "2019-08-09", "language": "en", "rating": 3}, {"id": 696562023, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d244821-r696562023-Barcelona_Zoo-Barcelona_Catalonia.html", "text": "This Zoo has a variety of many animals all of which look well looked after and cared for.\nWe was surprised by how many species were there to be seen.\nThere is lots of places to eat and drink.\nWe spent three hours there and still didn't see everywhere, its huge.\nWould highly recommend Barcelona Zoo, but we do love a zoo 😂", "publishedDate": "2019-08-07", "language": "en", "rating": 4}, {"id": 696553185, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d244821-r696553185-Barcelona_Zoo-Barcelona_Catalonia.html", "text": "I do visit many zoo's all over the world, I love this one. Not overcrowed, easy going to spend some peacefull hours watching various animals. The only thing I didn't like was the Dolphins. Once the basin opened people getting in waited for a show but nothing happened?. The basin is also very outdated. But hey I made some great pictures I like to share with you :-)", "publishedDate": "2019-08-07", "language": "en", "rating": 4}, {"id": 694792654, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d244821-r694792654-Barcelona_Zoo-Barcelona_Catalonia.html", "text": "We spent a couple of hours walking through the zoo. A good variety of animals, in some of the exhibitions it was hard to see them due to the sun and loads of fingerprints on the windows. I would never in a million years eat in any of the lunch places in the zoo based only on the view of the places. Filthy and disgusting looking with birds running around your feet and on top of the tables.", "publishedDate": "2019-08-01", "language": "en", "rating": 3}, {"id": 693018199, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d244821-r693018199-Barcelona_Zoo-Barcelona_Catalonia.html", "text": "This is not the best zoo I’ve been to but there is plenty to see and read about. the kids will enjoy it and there is a play park as well. It’s well shaded so even on a hot day your ok. Worth the time to visit.", "publishedDate": "2019-07-26", "language": "en", "rating": 3}, {"id": 692791882, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d244821-r692791882-Barcelona_Zoo-Barcelona_Catalonia.html", "text": "A fair bit of shadows going around, so even on a hot day it is okay. \nA visit to do if you run out of ideas in Barcelona.\nThe Zoo itself is ok, with some good attractions.\nThe gift shop should consider stocking on more relevant souvenirs, such as the Komodo Dragon which is pretty rare in a Zoo.", "publishedDate": "2019-07-26", "language": "en", "rating": 3}, {"id": 692298213, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d244821-r692298213-Barcelona_Zoo-Barcelona_Catalonia.html", "text": "We have been in zoo just today and iam a lot dissapointed. First we bought a tickets online to avoid waiting but it was even worst. They didnt accept the online ticket so.I.had to resend.the mail to.their email my net wasnt.working my baby cries..nonsense at all!!\nThen half of.the animals werent there it was closed.. at least we saw.doplhins I came.to a lade.2 asking.if.there is a.show she said no no no.shows and we just passed on.the way back seeing that they were feeding and with feeding they made the show they were jumping splashing etc \nIf we dont go near by we wouldnt see it..\nThere was nothing open to buy some food..for me it.should be half price asked for.that", "publishedDate": "2019-07-24", "language": "en", "rating": 2}, {"id": 692188724, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d244821-r692188724-Barcelona_Zoo-Barcelona_Catalonia.html", "text": "The zoo is family friendly and the information cards are well done. It is a small zoo. We were hot in July and walking around in the heat was perhaps not the wisest choice of activity in a city with so many a-other sights and sites to see. The bathrooms are good The gift shop has many things for children.\n", "publishedDate": "2019-07-23", "language": "en", "rating": 3}, {"id": 692154182, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d244821-r692154182-Barcelona_Zoo-Barcelona_Catalonia.html", "text": "A very good experience for the whole family! (Mum, dad and almost-thirteen-year-old daughter). We thought we would use an hour or so and then head back, but instead we spent three hours walking around a fantastic parc. We have earlier seen other zoos, e.g Central park zoo in NY, but this one here in Barcelona is much better and have more different animals. You can bring your own food to eat at the picnic areas, or there are places to buy food - contains lots of different things on the menu, but not so effective ordering systems.", "publishedDate": "2019-07-23", "language": "en", "rating": 5}, {"id": 691822180, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d244821-r691822180-Barcelona_Zoo-Barcelona_Catalonia.html", "text": "The zoo is located in a beautiful park in the center of the city. It is clean and has a lot of animals. I wish there would have been a dolphin show instead of a viewing while we were there. Make sure to bring the sunscreen.", "publishedDate": "2019-07-22", "language": "en", "rating": 4}, {"id": 691791624, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d244821-r691791624-Barcelona_Zoo-Barcelona_Catalonia.html", "text": "This is the best zoo I think I've been to. It was very clean, well organized and the animals really appeared to be happy. I saw animals behaving as though they were a part of families; mothers were caring for their young, adults were playing together, grooming one another, or just snuggling. The animals approached the glass and were easy to photograph as well. I'm a teacher so I go on a lot of zoo field trips and the animals always seem to be asleep or bored, but again, not here! They appear to be just living life! The staff also seemed to really care for the animals as well. The food is pretty great too! You should definitely let your children experience Barcelona Zoo if it fits in your schedule. It's very convenient to get to on the bus as well.", "publishedDate": "2019-07-22", "language": "en", "rating": 5}, {"id": 690466079, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d244821-r690466079-Barcelona_Zoo-Barcelona_Catalonia.html", "text": "There are many negative comments about the zoo but I give it 5 stars. It was a green oasis for little kids. They loved all the animal exhibits. I thought the park was laid out well with lots of shade and benches along the route, the staff were very polite and nice, the cafes had decent options, the bathrooms were clean, the exhibits were plenty. Water inside the park is expensive to buy, so bring your own. The zoo has many water fountains where you can refill the bottles. No diarrhea episodes so safe to drink.  The children's park was an added bonus with loads of rides and slides designed with little adventurous explorers in mind. The park also has a shaded area where there is a water mist so you can cool down as well. The zoo is conveniently located near metro stops. Best to visit in the morning when it opens to catch the animals outside and active. After the zoo you can walk to the Santa Del Mar cathedral which is a 10-15 min walk. In the afternoon, the big felines retreat into shade. The monkey exhibits, the Macaw exhibits are really good. The place for the animals seems cramped but I have been to many zoos and most are cramped for animals. Anything less than their natural surrounding is cramped.", "publishedDate": "2019-07-17", "language": "en", "rating": 5}, {"id": 688544523, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d244821-r688544523-Barcelona_Zoo-Barcelona_Catalonia.html", "text": "I had high hopes when visiting this zoo I was really looking forward to it. On entering the zoo I was given a map and as we were walking through I saw signs for a dolphinarium. I was shocked as I hadn’t seen any information prior about dolphins being kept here and I am not the biggest fan of them being in captivity. I thought I would look there later as I wanted to see other things first. Going round the zoo it was apparent these animals were being well cared for, their enclosures were quite big and they seemed to be content. When going to the dolphinarium it was apparent this may not be the case. We queued up to go and see what I thought was a show however it was a dingy, rusty pool (photo below) in which  just a few hours in the day where these dolphins were allowed out of their small holding pen into a slightly bigger holding pen to float around aimlessly. I had to leave soon after as it was quite upsetting seeing the dolphins in this way considering how they are in the wild. I was very confused as to why there was no information about them on the website, the map or anywhere else so I googled “Barcelona zoo dolphins” and to my horror I found that the zoo had been banned from hosting dolphin shows as they were mistreating them. The dolphins as I understand are now in the process of being sold of and therefore are just held in a pen for most of the day then let out for a couple of hours for the public to see. This really ruined what was a great day as like I said every other animal in the zoo had bigger enclosures and an overall better quality of care than these poor dolphins.", "publishedDate": "2019-07-10", "language": "en", "rating": 3}, {"id": 688448757, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d244821-r688448757-Barcelona_Zoo-Barcelona_Catalonia.html", "text": "It was ok but nothing special... it worked... RIP Snowflake! The maps were not up to date and the concession lines were slow.", "publishedDate": "2019-07-10", "language": "en", "rating": 3}, {"id": 687963798, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d244821-r687963798-Barcelona_Zoo-Barcelona_Catalonia.html", "text": "a good 3-4 hours spent. Not bad if you are an animal lover. they have a huge number of different species. The large animals were kept in a relatively smaller place, but I saw a number of renovation projects. There are a number of places where you can take rest and have food and drink. Plenty of free roaming peacocks. the zoo is easily accessible by public transport-about 7-8 minutes walk from the nearest station/bus stop.", "publishedDate": "2019-07-08", "language": "en", "rating": 4}, {"id": 686130103, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d244821-r686130103-Barcelona_Zoo-Barcelona_Catalonia.html", "text": "Booked online while in the city on a spur of the moment trip. We had visited a few years before and loved it then. \nThis visit was like a whole new experience. We saw thing we had forgotten from last time and were massively impressed by the cleanliness and order of the place. \nReasonable prices for food and drink not feeling like a tourist rip off place. Recommend recommend recommend", "publishedDate": "2019-07-02", "language": "en", "rating": 5}, {"id": 684754842, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d244821-r684754842-Barcelona_Zoo-Barcelona_Catalonia.html", "text": "Don’t go here! The treatment of dolphins is disturbing. Don’t waste your money. 4 adult dolphins trapped in a tiny pool which is as big as a swimming pool.", "publishedDate": "2019-06-27", "language": "en", "rating": 1}, {"id": 684676787, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d244821-r684676787-Barcelona_Zoo-Barcelona_Catalonia.html", "text": "The zoo is really easy to find and if you take the metro you even see the arc de triomf on the way! I personally had a great day at the zoo. I saw some animals i hadn’t before including African Elephants. That was the highlight of our trip as well as the orangutangs and dolphins. The only let down was how few shops/cafes were open and we really struggled to find water. There are vending type machines dotted around however they don’t say how much water is and you need exact change which is difficult to do as a tourist.", "publishedDate": "2019-06-27", "language": "en", "rating": 4}, {"id": 683452277, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d244821-r683452277-Barcelona_Zoo-Barcelona_Catalonia.html", "text": "We have a 2 and 4 yr old. They just loved it and we spent six hours in total wandering around. I can't understand the criticisms about closures; every attraction with a long history needs maintenance. We didn't miss anything, having seen Lions before; the kids were just enticed by the next attraction. In the context of a family visit to Barca, it worked extremely well and we all enjoyed the experience. It keeps going and there is a kids play park in the middle to distract them.Midweek in June, most of the cafe concessions are closed, but then again the zoo was not in the least crowded so you can understand! I imagine that, at the weekend, its a very different story.", "publishedDate": "2019-06-22", "language": "en", "rating": 5}, {"id": 682695489, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d244821-r682695489-Barcelona_Zoo-Barcelona_Catalonia.html", "text": "Beautiful walk up to the entrance of the Zoo. Lovely grounds, and it would be very good value for money if it was all open. Unfortunately, there was a lot of maintenance work going when we visited, a few empty cages and the Aquarium was closed. Glad to know they are improving their facilities but you should be warned of the scale of improvements before you go in. Only one restaurant was open, and the majority of vending machines were broke which I thought was poor. \nLuckily, the entrance fee wasn’t too much so would still recommend this Zoo but take your own food and water!", "publishedDate": "2019-06-19", "language": "en", "rating": 3}, {"id": 681639530, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d244821-r681639530-Barcelona_Zoo-Barcelona_Catalonia.html", "text": "Lots of the place was closed and several empty cages not at all impressed. They need to take a leaf out of Valencia’s Bio Park which is a million times better.", "publishedDate": "2019-06-15", "language": "en", "rating": 2}, {"id": 680138997, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d244821-r680138997-Barcelona_Zoo-Barcelona_Catalonia.html", "text": "The open exhibits are very poor. The animales, are not in very good shape especially the birds.\nThe aquarium exhibits are under maintenance and also other exhibits are under maintenance.\nCompared to the zoo in London this one has a very sad feeling and everything is very  depressing", "publishedDate": "2019-06-09", "language": "en", "rating": 2}, {"id": 679530620, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d244821-r679530620-Barcelona_Zoo-Barcelona_Catalonia.html", "text": "We enjoyed our trip to the zoo. The enclosures are clean and the variety of animals is interesting. \nHowever, no cafes or shops are working, there are some but they seem literally abandoned. One operating cafe was crowded. shame as the Zoo is large and we would have stayed longer if there were comfortable places to rest.", "publishedDate": "2019-06-06", "language": "en", "rating": 4}, {"id": 679095976, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d244821-r679095976-Barcelona_Zoo-Barcelona_Catalonia.html", "text": "My mom mother took 2 of my children (4yrs & 11 yrs) to the zoo. They all came back saying it was fabulous and they enjoyed it immensely. My 11 year old said it was the best trip during our week long holiday in Barcelona.", "publishedDate": "2019-06-05", "language": "en", "rating": 5}, {"id": 678975778, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d244821-r678975778-Barcelona_Zoo-Barcelona_Catalonia.html", "text": "Many of the animals looked too thin. Some of the exhibits were closed as were the food stands. My town zoo has more exhibits and the animals look much better cared for.", "publishedDate": "2019-06-04", "language": "en", "rating": 2}, {"id": 678650361, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d244821-r678650361-Barcelona_Zoo-Barcelona_Catalonia.html", "text": "Zoo Barcelona is attractive and clean, with very nice enclosures for the animals. We spent almost the entire day there and thoroughly enjoyed our visit. There is free wifi and an app to download as a guide, including an interactive GPS-based map. There is plenty of English everywhere, making language not a problem for us. Bring your own food though. The food service is horrible, with poor quality, selection, and high prices. Someone is making lots of money off of this bad, overpriced, food. Hopefully it's the zoo and not the contractor. ", "publishedDate": "2019-06-03", "language": "en", "rating": 5}, {"id": 678353596, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d244821-r678353596-Barcelona_Zoo-Barcelona_Catalonia.html", "text": "We had a few hours left before we went to the Airport. My son who is 11 wanted to go to the zoo. It is a very pretty zoo, and easy to walk around. He really loved the Monkey and giraffes. You could get really close to a lot of the animals and there were even peakcocks and parrots roaming free. Possibly not a must do but we had a great time", "publishedDate": "2019-06-02", "language": "en", "rating": 5}, {"id": 677352560, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d244821-r677352560-Barcelona_Zoo-Barcelona_Catalonia.html", "text": "While most people wouldn’t think of visiting a zoo while abroad, Zoo Barcelona is a wonderful place.  It is located in a beautiful park in the center of the city and has a very diverse collection of animals.  It is one of the European leading zoos for conservation of species and does a great job of educating visitors.  ", "publishedDate": "2019-05-29", "language": "en", "rating": 5}, {"id": 674646468, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d244821-r674646468-Barcelona_Zoo-Barcelona_Catalonia.html", "text": "We visited the zoo today as the weather has been so poor the past few days and we were looking for something to occupy our 12 year old daughter. We got the train from Salou into Barcelona (€53 return for the 3 of us). We walked the 30 minutes to the zoo from the station.\n\nWe bought our tickets online for the zoo ( €51) and we used online tickets to gain immediate access.\n\nIt was an OK day out, definitely not one of your best zoo's I've ever been to, but then again I live near Dublin Zoo which is amazing (so it's a bit of an unfair comparison in fairness).\n\nIt passed a few hours for us, and we enjoyed our time there. I would recommend going if you are already in Barcelona, but not travelling from Salou with the extra expenses of train fares because its not worth all the expense. ", "publishedDate": "2019-05-17", "language": "en", "rating": 3}, {"id": 674010472, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d244821-r674010472-Barcelona_Zoo-Barcelona_Catalonia.html", "text": "Took our young children here today and was pretty impressed.  The zoo was really big and the enclosures were kept very clean.  Went into the reptile room and the vivariums were huge!  The enclosures for the big cats were not nearly big enough for them though.  However, they are building a new enclosure for the lions which looks amazing and much more spacious for them. Spent 6 hours here and would have spent longer if we could.\nBad points.  The food was awful!  I had a Madison cheese lovers hotdog.  I am not a fussy eater and will eat most things but I spat this out and put it in the bin.  Hotdogs are not my favourite anyway but this one put me off for life. Second thing was the price of things in the souvenirs shop was shocking!  I expect the price to be little higher but it was ridiculously more than other places that sell the same things.\nOverall though, I would recommend visiting this zoo if in Barcelona.  We can’t wait to visit again if here.  Hopefully all the improvements they are making will be finished then too. A lovely day out!", "publishedDate": "2019-05-14", "language": "en", "rating": 4}, {"id": 673889664, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d244821-r673889664-Barcelona_Zoo-Barcelona_Catalonia.html", "text": "Large zoo. A lot of animals including larger ones such as Rhinos, elephants, giraffes, gorillas etc. All of which were kept in small enclosures and looked very unhappy, unhealthy and drowsy. I am not a big fan of zoos but only went for the kids otherwise I wouldn’t bother. Ok to fill half a day of you’re looking for something to do, particularly if you have young kids. ", "publishedDate": "2019-05-14", "language": "en", "rating": 2}]}}]