[{"locationId": 313697, "name": "Placa de Rius i Taulet", "placeType": "ATTRACTION", "reviewListPage": {"reviews": [{"id": 709837277, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d313697-r709837277-Placa_de_Rius_i_Taulet-Barcelona_Catalonia.html", "text": "Located in the Gracia neighbourhood of Barcelona. The square includes a nice clock tower and various cafes. There are park benches around the square. Lots of locals and lots of children playing. ", "publishedDate": "2019-09-15", "language": "en", "rating": 3}, {"id": 647694118, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d313697-r647694118-Placa_de_Rius_i_Taulet-Barcelona_Catalonia.html", "text": "The tower is in Villa de Gracia Square not in Av. de Rius i Taulet. Please correct the map and the title.", "publishedDate": "2019-01-22", "language": "en", "rating": 3}, {"id": 631758125, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d313697-r631758125-Placa_de_Rius_i_Taulet-Barcelona_Catalonia.html", "text": "The square in the famous quarter Gracia is sporting a big tower with a clock on top. Arround the square are cafes and restaurants. The place is very vivid, with, for instance, kids, locals and tourist, playing football.", "publishedDate": "2018-11-07", "language": "en", "rating": 4}, {"id": 601711350, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d313697-r601711350-Placa_de_Rius_i_Taulet-Barcelona_Catalonia.html", "text": "This square in Gràcia has a great easy going family vibe.  Late in the evening, there are still strollers parked next to people having dinner. Younger kids roam freely and politely :-) \n\nThere are several restaurants with indoor and outdoor seating around the square but at times it can become fairly busy and you may have to wait a bit.  Talk to the waiter or waitress and let them know that you were waiting for a table. Don’t grab your own. We made this mistake and were gently corrected :-)\n\nOver several nights there has been one accordion player but otherwise not a lot of street performers. It’s just a relaxed pleasant Square to have drinks and dinner with friends or family.", "publishedDate": "2018-08-01", "language": "en", "rating": 5}, {"id": 584176021, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d313697-r584176021-Placa_de_Rius_i_Taulet-Barcelona_Catalonia.html", "text": "It was not clear what this was all about but this area of Gracia has small streets and is not well known by tourists but worth a walk. Go north from Diagonal near Passieg Gracia and you will find it.", "publishedDate": "2018-05-31", "language": "en", "rating": 3}, {"id": 525731267, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d313697-r525731267-Placa_de_Rius_i_Taulet-Barcelona_Catalonia.html", "text": "This was our favourite place in Gracia (today called Placa Vila de Gracia) with its many cafes, restaurants, trees and the tower in the middle.", "publishedDate": "2017-09-19", "language": "en", "rating": 4}, {"id": 479373173, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d313697-r479373173-Placa_de_Rius_i_Taulet-Barcelona_Catalonia.html", "text": "You have to be patient to get a table around the square bars. It's better to go during week days, (best time may around noon)", "publishedDate": "2017-04-26", "language": "en", "rating": 4}, {"id": 468626117, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d313697-r468626117-Placa_de_Rius_i_Taulet-Barcelona_Catalonia.html", "text": "We had been to Barcelona before and had covered all the must see sights so this time around we walked and wandered into neighbourhoods we thought would be interesting.\nThis is part of the real Barcelona where Spanish is spoken and with fewer tourists.  This particular square is the heart of the neighbourhood and we enjoyed a leisurely hour having coffee and croissants and a tapas or two in one of the many outdoor cafes that ring the square.  I picked up a newspaper and tried to decipher it. Wrote in my journal. Spoke halting Spanish to the waiter.  Watched as the neighbourhood settled in for their noon time break.  One of Barcelona's many little unexpected treasures.", "publishedDate": "2017-03-19", "language": "en", "rating": 5}, {"id": 298810446, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d313697-r298810446-Placa_de_Rius_i_Taulet-Barcelona_Catalonia.html", "text": "Just a lovely square with some tapas bars and ice cream places. Full of families last night with a real, friendly  feel at 11pm! Nice place to relax. ", "publishedDate": "2015-08-13", "language": "en", "rating": 5}, {"id": 179945390, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d313697-r179945390-Placa_de_Rius_i_Taulet-Barcelona_Catalonia.html", "text": "Just sitting after some tapas at Bo, waiters friendly and ready to talk about anything ,gelats at pyreneum, kids playing around the tower, i'm in no rush to go anywhere. ", "publishedDate": "2013-10-06", "language": "en", "rating": 5}, {"id": 154032447, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d313697-r154032447-Placa_de_Rius_i_Taulet-Barcelona_Catalonia.html", "text": "Little sqare in Gracia district, and a tower called Campana de Gracia, with clocks from all sides. You can rest here and eat something in one of many restaurants. I ate paella and tapas in Bo Restaurant, manu of a day for 15 euros per person. Delicious food and a man playing the guitars ans singing, the bard playing for the money. At the base of a tower reliefs of faces wchich someone signed Carmen and Emilio. Nice, quiet square in the middle of Gracia.", "publishedDate": "2013-03-08", "language": "en", "rating": 4}, {"id": 145569023, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d313697-r145569023-Placa_de_Rius_i_Taulet-Barcelona_Catalonia.html", "text": "great atmosphere with restaurants and tables lining the small,lively square. We have tried tapas in Nou Candanchú and were the only tourist there, otherwise packed with locals, so that was good sign and the food was amazing. Also ice cream shop next door was good as a late night desert.", "publishedDate": "2012-11-16", "language": "en", "rating": 5}]}}]