[{"locationId": 7190997, "name": "Muralla Romana", "placeType": "ATTRACTION", "reviewListPage": {"reviews": [{"id": 385927942, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d7190997-r385927942-Muralla_Romana-Barcelona_Catalonia.html", "text": "nice old site located next to busy cathedral. Info sign in English is nice. As a history buff I was looking for this.  anyone else would probably walk by and never realize the ancient history", "publishedDate": "2016-06-25", "language": "en", "rating": 4}, {"id": 382842222, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d7190997-r382842222-Muralla_Romana-Barcelona_Catalonia.html", "text": "The Roman history in Barcelona is easy to miss although it is so present and well-preserved. This site is right outside the Barcelona cathedral, yet crowds tend to be blind to this remnant of the city’s ancient history. I recommend that after visiting the cathedral, visit the Roman Fort. Not only can you walk through the Roman gate, but you can visit the House of L'Ardiaca for free, which uses part of the Roman structure. Inside the house (a palace actually that was built in the 1400s AD by the Archdeacon Lluís Desplà) is a glimpse of the aqueduct system. Also, if you want to see more Roman remains, you might continue through the Roman gateway path (Carrer Bisbe) and up to the main Gothic Quarter. You will soon pass under a beautiful bridge, at which point the street opens into the Plaza de Sant Jaume. Turn left, and the immediate street now to your left again will be Carrer de Paradis. It runs parallel to Carrer Bisbe (so you will basically be walking a U-turn), but before you enter the street, you will see that it is short before bending right. Take the street, bend right, and straight ahead of you will be a building, in which is the Temple of Augustus—again, this area reaches back into the ancient Roman settlement of Barcino. The temple is free but well-maintained, so don’t be afraid to enter even if it’s a little neglected by the main tourist crowd that tends to take Carrer Bisbe instead of this tiny neighboring side street. The Temple of Augustus is a little Roman treasure amidst the Gothic Quarter that has been enclosed by medieval apartments—a fascinating sight.", "publishedDate": "2016-06-15", "language": "en", "rating": 4}, {"id": 378014297, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d7190997-r378014297-Muralla_Romana-Barcelona_Catalonia.html", "text": "Remains of the old Roman wall next to the Barcelona cathedrall are not the main star of this neighborhood, the cathedral is, but they are very well preserved and for those interested in ancient architecture they are wery vell worth visiting if only for a short while. There is an explanation of what one is looking at, and in english too which is very convenient.", "publishedDate": "2016-05-30", "language": "en", "rating": 3}, {"id": 359175361, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d7190997-r359175361-Muralla_Romana-Barcelona_Catalonia.html", "text": "This relatively unknown site in Barcelona isn't in a lot of guide books or websites for some reason. These old Roman defensive city walls are partially preserved including the two rounded guard towers that protected the city gate to Barcino (about 100 AD). There is also a section of the aqueduct that carried water to the old city. The old walls are right next to the Cathedral of Barcelona, so check them out while in the area.", "publishedDate": "2016-03-27", "language": "en", "rating": 4}, {"id": 289014011, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d7190997-r289014011-Muralla_Romana-Barcelona_Catalonia.html", "text": "This was the main gate to the Roman city of Barcino. The bottom of both towers contain Roman walls and remnants. The medieval towers were then built on top to expand the wall for defense.  In gives you a great perspective to understand the gothic city of Barcelona and how one history was built on another before it. Also a great piece of art that spells out Barcino is located in front of the gate. While you are visiting the Cathedral, walk a little further to check this out. Picasso mural is also across the square from this attraction.", "publishedDate": "2015-07-14", "language": "en", "rating": 4}]}}]