[{"locationId": 4414261, "name": "MUHBA Refugi 307", "placeType": "ATTRACTION", "reviewListPage": {"reviews": [{"id": 734423037, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d4414261-r734423037-MUHBA_Refugi_307-Barcelona_Catalonia.html", "text": "Location: South of the city, near the Castle. \nPrice: 3.50E each - book online. \n\nYou can book online via the MUHBA website for an English tour (we had 5 on ours, very intimate). It lasts about an hour and you're given a historical insight into why bomb shelters were needed in Barcelona and what happened inside them. Quite interesting and not overly expensive. The tour guide has great English too.", "publishedDate": "2019-12-24", "language": "en", "rating": 4}, {"id": 694988785, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d4414261-r694988785-MUHBA_Refugi_307-Barcelona_Catalonia.html", "text": "A fascinating tour which shows how the people of Barcelona (Poble Sec in this instance) took defence of the city into their own hands during the Spanish Civil War. It's a crucial period in history – for Europe, not just Spain – and it's shocking how little we are usually taught about it. Totally recommended.", "publishedDate": "2019-08-02", "language": "en", "rating": 5}, {"id": 691317965, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d4414261-r691317965-MUHBA_Refugi_307-Barcelona_Catalonia.html", "text": "Booking essential as theres only one tour in english and it's on Sunday at 1030. You can do it on the MUHBA website.\n\nOur guide, Laura, was very nice and clearly interested in her topic, though the English wasnt always completely clear. Very worth your time, especially since it takes about 45 minutes.", "publishedDate": "2019-07-21", "language": "en", "rating": 4}, {"id": 653066912, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d4414261-r653066912-MUHBA_Refugi_307-Barcelona_Catalonia.html", "text": "This was a very interesting and informative tour. There are over 1,000 bomb shelters in Barcelona dating back to the Spanish Civil War in the 1930's. This hidden history was reveled quite recently. It is very important to see and hear the stories of the people who built these shelters. The Historian was VERY good.", "publishedDate": "2019-02-17", "language": "en", "rating": 5}, {"id": 631122770, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d4414261-r631122770-MUHBA_Refugi_307-Barcelona_Catalonia.html", "text": "Refugi 307 is a bomb shelter constructed and used by the people of Barri Poble Sec during the Civil War.  It is only open Sundays, with tours in English at 10:30 a.m.  Very informative and brings the history of the neighbourhood to life.", "publishedDate": "2018-11-05", "language": "en", "rating": 4}, {"id": 626915302, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d4414261-r626915302-MUHBA_Refugi_307-Barcelona_Catalonia.html", "text": "The tour provides a great history of the civil war and the toll it took on the civilian population. The shelter itself was fascinating and kept in excellent condition. ", "publishedDate": "2018-10-21", "language": "en", "rating": 5}, {"id": 613978780, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d4414261-r613978780-MUHBA_Refugi_307-Barcelona_Catalonia.html", "text": "Travelled with my 12 year old son. Went on the English tour, which was restricted to a small number. The lady taking the tour was clearly passionate about this part of history, and had interviewed people that had originally used the shelter, which added to the history & atmosphere of the place. Great tour & in our top 2 of the places to visit in Barcelona- but you need to book well in advance!", "publishedDate": "2018-09-04", "language": "en", "rating": 5}, {"id": 610569788, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d4414261-r610569788-MUHBA_Refugi_307-Barcelona_Catalonia.html", "text": "Really worth to get an idea even if only in an hour of what the civil war produced and the after match of it as well. The guide spoke very (too?) fast and as soon as he was out he was onto another tour.", "publishedDate": "2018-08-26", "language": "en", "rating": 4}, {"id": 604263265, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d4414261-r604263265-MUHBA_Refugi_307-Barcelona_Catalonia.html", "text": "It's highly recommended that you book ahead, you can do so by emailing them (but only between 9-5 Monday to Friday). If, like me, you only discovered this on the weekend you want to visit you can book online on the MUHBA website or risk turning up and if there is a spare space they can squeeze you in. \nThe english tour was really interesting and well worth the nominal entrance fee, it gave a fascinating insight into the life of people during the civil war.", "publishedDate": "2018-08-08", "language": "en", "rating": 5}, {"id": 558479290, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d4414261-r558479290-MUHBA_Refugi_307-Barcelona_Catalonia.html", "text": "We took the English guided tour on Sunday 4th Feb, (only open weekends) the very knowledgable clearly spoken guide explained to us the how the Spanish Civil war affected Barcelona and is people.  This showed why the local residents built this air raid shelter (series of tunnels) into the rocks of the mountain (hillside).  Good preservation and presentation of the network of tunnels..  The tour is suitable for children say 8+ is about an 1 hour and includes a very short visual experience.", "publishedDate": "2018-02-04", "language": "en", "rating": 5}, {"id": 550482747, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d4414261-r550482747-MUHBA_Refugi_307-Barcelona_Catalonia.html", "text": "This is not a museum, but rather an old hideout (from the cuvil war) that you have a guide tour in. There is one in English, Spanish and Catalan. I went for the Catalan and I understood the gist as I speak Spanish. I thought it was very interesting, but maybe it’s not something for everyone. ", "publishedDate": "2017-12-31", "language": "en", "rating": 4}, {"id": 502877140, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d4414261-r502877140-MUHBA_Refugi_307-Barcelona_Catalonia.html", "text": "Please consider to visit this, it was an extraordinary good experience - and the guide she was extremely good at explaining the Spanish civil war which still seems to be a dark side in then Spanish history. We really recommend you to visit this if you are in Barcelona.", "publishedDate": "2017-07-17", "language": "en", "rating": 5}, {"id": 501715947, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d4414261-r501715947-MUHBA_Refugi_307-Barcelona_Catalonia.html", "text": "We were interested in visiting Refugi 307 but were not able to.  The only English tour is at 10:30am on Sunday mornings.  Due to the holiday on 24 June in Catalonia, MUHBA sites were closed so we could not make a reservation for Sunday the 25th.  We contacted them about visiting during the week but 3 people was too few for a tour and we could not join another group.  Disappointed we were not able to visit the site.", "publishedDate": "2017-07-13", "language": "en", "rating": 3}, {"id": 424487913, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d4414261-r424487913-MUHBA_Refugi_307-Barcelona_Catalonia.html", "text": "Highly recommend this tour - gives a great insight into life in Barcelona during the bombardment of the city from 1937 - 1939. The shelter is very well preserved. Our guide Maria was amazing - engaging, enthusiastic & full of interesting facts. Maria is definitely one of the best guides I have had on a tour. There are 3 tours on a Sunday - only one in English, which is the first one at 10:30. Tours last approx. 1 hour. You can make a reservation by email.", "publishedDate": "2016-10-02", "language": "en", "rating": 5}, {"id": 422372410, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d4414261-r422372410-MUHBA_Refugi_307-Barcelona_Catalonia.html", "text": "After a few days in Barcelona we were wondering where we could go to learn more about the history of the civil war. There was very little evidence of it in the city as far as we could see (no memorials, no plaques, etc) and it is totally absent from the Barcelona history museum which mainly covers the city's Roman origins. Our tour guide for Refugi 307 confirmed this, saying that the shelter is really the only site open to the public that deals with this part of the city's history. It was a a brilliant and fascinating tour, not to be missed. When we went there were only English tours on Sunday morning; there's an email address on the MUHBA website and they were very prompt in responding. We got in for free with the Barcelona Card. It's in Montjuic so handy for continuing the day exploring the Fundacion Joan Miro and going up in the cable car to the castle.", "publishedDate": "2016-09-26", "language": "en", "rating": 5}, {"id": 405875154, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d4414261-r405875154-MUHBA_Refugi_307-Barcelona_Catalonia.html", "text": "The tour guide was really good! She explained the history and motivation for building bomb shelters, of which this is one of the largest. The tour takes about an hour and is well worth for anyone who is interested in history, especially about the Spanish civil war.", "publishedDate": "2016-08-15", "language": "en", "rating": 4}, {"id": 388536625, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d4414261-r388536625-MUHBA_Refugi_307-Barcelona_Catalonia.html", "text": "It is number 307 of more than a thousand shelters that were built by the citizens of Barcelona during the civil war. It had a nursery, and an infirmary, and conversation was kept to a minimum to avoid the arguments that could erupt in a place of such stress. Our English-language tour, given by a very knowledgeable young woman on a drizzly Sunday morning, taught us all that and more. Very moving, and well worth it.\n\nAlso, you can climb the hill from here through Montjuic and to the Miró museum, down the hill toward the Magic Fountain, past the Pabellon Mies van der Rohe and then to the Caixa Forum. A good, full day.", "publishedDate": "2016-07-02", "language": "en", "rating": 4}, {"id": 363701162, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d4414261-r363701162-MUHBA_Refugi_307-Barcelona_Catalonia.html", "text": "Having been to Barcelona several times, and having visited the Sagrada Familia, and the various Gaudi buildings and Parc, we were looking for an unusual aspect of the city. This restored air raid shelter from the Spanish Civil war is fascinating for the insight it gives you about that period, bearing in mind that it was created by civilians by hacking into the mountain of Montjuic themselves. We had an hour visit with an excellent English speaking guide.", "publishedDate": "2016-04-12", "language": "en", "rating": 5}, {"id": 351413248, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d4414261-r351413248-MUHBA_Refugi_307-Barcelona_Catalonia.html", "text": "Went as a class trip. The tour guide is very nice and explained the history in details. Very knowledgable. And it's an interesting place to see for yourself. ", "publishedDate": "2016-02-27", "language": "en", "rating": 5}, {"id": 334876964, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d4414261-r334876964-MUHBA_Refugi_307-Barcelona_Catalonia.html", "text": "short, but very informative visit to an unusual and atmospheric place. our guide told us a lot about this place and civil war in general. and in spite the obvious darkness of the place managed to keep it positive and even fun!", "publishedDate": "2015-12-25", "language": "en", "rating": 5}, {"id": 316064149, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d4414261-r316064149-MUHBA_Refugi_307-Barcelona_Catalonia.html", "text": "Do yourself a favour and take this tour. I knew very little about the Spanish Civil war and the guide for our tour of Refugi 307 was passionate and extremely knowledgeable. Entry and the tour are free with your ticket from the History Museum of Barcelona. The area before the entry to the tunnels is well laid out with photos and descriptions in English of the Civil War and its impacts in Barcelona. See reviews below for times of tours in English and how to register for a tour. I used the email address below and received a very prompt reply.", "publishedDate": "2015-10-04", "language": "en", "rating": 5}, {"id": 315906665, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d4414261-r315906665-MUHBA_Refugi_307-Barcelona_Catalonia.html", "text": "I originally wasn't sure about this tour after my husband suggested it.  Sounded like it could be depressing on a beautiful autumn vacation.  However, if you want to be totally inspired by what ordinary humans are capable of doing in the face of adversity, go here.  Our guide spoke some English and we were able to get the gist of most of what she said.  You can pick up quite a bit of history pre WW II, but during Franco here.", "publishedDate": "2015-10-03", "language": "en", "rating": 4}, {"id": 297786653, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d4414261-r297786653-MUHBA_Refugi_307-Barcelona_Catalonia.html", "text": "The English tour is only on Sunday´s at 10:30am and you must pre-register for it. The tunnels are quite large and roomy so no need to be worried about being cramped during the tour.\n\nOur guide was passionate and very informative and gave much insight into the bombings of the area, by being able to recount stories from the locals.\n\nTo register:\nPhone 93 256 21 22 or email reservesmuhba@bcn.cat \nTunnels are located at - Nou de la Rambla, 175, only a few blocks from subway stop Paral-lel\n\nYou pay upon arrival 3.40 euro", "publishedDate": "2015-08-11", "language": "en", "rating": 5}, {"id": 240942016, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d4414261-r240942016-MUHBA_Refugi_307-Barcelona_Catalonia.html", "text": "There are not too many places in Barcelona which explain the Spanish Civil War. This is one of them so it’s worth the visit. \nThe bomb shelter by itself is not too impressive but the story which goes with it definitively is.", "publishedDate": "2014-11-22", "language": "en", "rating": 4}, {"id": 237604235, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d4414261-r237604235-MUHBA_Refugi_307-Barcelona_Catalonia.html", "text": "During the Spanish Civil War, Franco was supported by Nazi Germany and Fascist Italy. Italian and German airplanes for the first time in history bombed civilian targets -- massive sustained air attacks against the people and city of Barcelona.\n\nHere, on the side of Montjuic, the people of Barcelona built an air raid shelter in the rock of the mountain. The government, under attack was not able to build sufficient shelters for the population. Italian aircraft were bombing the city from the island of Mallorca, and Barcelona had no advance warning of the coming attacks. People had 2-3 minutes advance notice of the attacks. Shelters were needed in all neighborhoods of the city. The result is that the government distributed picks and axes, and gave out plans for the construction of shelters. Community associations, trade unions, social clubs, athletic clubs, churches all pitched in, building shelters, which the government then inspected to make sure they were up to standards and deep enough to withstand attacks.\n\nThe deep roots of Catalonian self-administration, distrust of government and anarchism are evident in the reality that more than two thousand such shelters were built in Barcelona - built by the people and their organizations, not by the government. Refugi 307 is one of the few tunnels that is preserved to this day.\n\nThe museum is open to the public only on Sundays. English language tour is at 10:30. Others tours in Catalan and Spanish. This is the only way for individuals to visit. Pre-registration is required. Visit http://museuhistoria.bcn.cat/en/node/661 . Email reservation request to: reservesmuhba@bcn.cat   \n(Museum is open to groups with advance reservation Mon - Sat)\n\nTickets are 3.40 EUR. Museum is on Nou de la Rambla (175), a few blocks walking distance from Metro stop Paral·lel on the L2 and L3 lines.", "publishedDate": "2014-11-02", "language": "en", "rating": 5}, {"id": 232403271, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d4414261-r232403271-MUHBA_Refugi_307-Barcelona_Catalonia.html", "text": "Took a guided tour in Catalan (tours are also available in English and Spanish). If you are interested to know more about what happened in Barcelona during the civil war and feel what people must have felt at that time, this is the place to visit.", "publishedDate": "2014-10-03", "language": "en", "rating": 5}]}}]