[{"locationId": 2067434, "name": "La Maquinista", "placeType": "ATTRACTION", "reviewListPage": {"reviews": [{"id": 749416525, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d2067434-r749416525-La_Maquinista-Barcelona_Catalonia.html", "text": "All shops are goods the food ground is perfect you can find any kind of foods the Fnac store is big and you can find all funko that you want ", "publishedDate": "2020-03-05", "language": "en", "rating": 5}, {"id": 738740432, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d2067434-r738740432-La_Maquinista-Barcelona_Catalonia.html", "text": "Was quiet busy on the Saturday we visited but its a really nice shopping mall with everything you need", "publishedDate": "2020-01-12", "language": "en", "rating": 5}, {"id": 735561141, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d2067434-r735561141-La_Maquinista-Barcelona_Catalonia.html", "text": "Didn’t really notice the shops but they looked pretty good. The public toilets came in handy since I needed too go.", "publishedDate": "2019-12-30", "language": "en", "rating": 4}, {"id": 732631277, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d2067434-r732631277-La_Maquinista-Barcelona_Catalonia.html", "text": "I like very much this Shopping Center has all you need to your reach, went for a charger and went 10 bags! ", "publishedDate": "2019-12-14", "language": "en", "rating": 3}, {"id": 731529132, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d2067434-r731529132-La_Maquinista-Barcelona_Catalonia.html", "text": "Very nice shopping mall with lot of shops of different brands. It's big and you can spent there full day", "publishedDate": "2019-12-09", "language": "en", "rating": 5}, {"id": 714767950, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d2067434-r714767950-La_Maquinista-Barcelona_Catalonia.html", "text": "The best thing about this mall that it is mainly an outdoor shopping mall with a very big space for visitors to enjoy everything.\nThe parking is free which is a unique thing in Barcelona.", "publishedDate": "2019-10-02", "language": "en", "rating": 5}, {"id": 685435741, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d2067434-r685435741-La_Maquinista-Barcelona_Catalonia.html", "text": "We decided to go to the mall, so they recommended La Maquinista ... it was a fiasco since only in the taxi we paid 50 euros in round trip... and when we arrived there were no good shops, no offers ... do not waste your time and money  Do not go to this mall.", "publishedDate": "2019-06-30", "language": "en", "rating": 2}, {"id": 670083746, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d2067434-r670083746-La_Maquinista-Barcelona_Catalonia.html", "text": "This shopping mall perfectly fits within the easy Spanish culture and nice climate of Barcelona. If you are into shopping , it offers great variety of brands. It has a hyper store as supermarket as well. If you are for eateries, again you are in for a treat as it has so many resturants from the usual fast food and up. As for entertainment you will find Cineplex and Bowling facilities in there. Even just walking around in this nice semi outdoor mall with its nice breez will make you feel good. If you are driving please make a note that the parking is free. Bus H8 will get you here in about 40 minutes from down town Barcelona.", "publishedDate": "2019-04-29", "language": "en", "rating": 5}, {"id": 652231621, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d2067434-r652231621-La_Maquinista-Barcelona_Catalonia.html", "text": "We visited this centre to do some shopping. It is a huge centre in the middle of nowhere. Be warned it’s hard to find a taxi as everyone drives in. On entering ot seems large but it’s only the area as most of the shops you wouldn’t really shop in. \nThis is a personal choice of course but there were limited clothes shops but many eateries.\nWe were disappointed as we expected it to be more useful.\nThe shopping centre near Diagonal is much better especially the lower ground level!\nIf you  want to explore food areas this is a great location otherwise we found that there were others that were better. \nFor designer wear Passeig de Gracia which has an amazing long road (remortgage your house beforehand) and some mid- range stores.\nThere were few eateries on this road but shop until you drop designer heaven.", "publishedDate": "2019-02-13", "language": "en", "rating": 3}, {"id": 641175912, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d2067434-r641175912-La_Maquinista-Barcelona_Catalonia.html", "text": "A bit of a trek as this shopping mall is not in the centre of Barcelona, bit it has all the choices you could wish for and a lovely open feel. It never gets too hot or crowded. Only problem is the limited public transport to take you back into town", "publishedDate": "2018-12-23", "language": "en", "rating": 4}, {"id": 638222843, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d2067434-r638222843-La_Maquinista-Barcelona_Catalonia.html", "text": "This shopping center had a big variety of shops for men and women (and home products etc). We had to walk a bit from the metro station but not bad distance at all.", "publishedDate": "2018-12-08", "language": "en", "rating": 4}, {"id": 631508972, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d2067434-r631508972-La_Maquinista-Barcelona_Catalonia.html", "text": "The shopping malla \" La Maquinista\" in Barcelona City is really a great experience todo go shopping becose there are a los of different shops and importants marks.\nUn the other hand you can have a good time in the cinema and you can taste different kinds of international cuisine.\nIt's ideal if you want to enjoy with your family.", "publishedDate": "2018-11-06", "language": "en", "rating": 4}, {"id": 621660081, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d2067434-r621660081-La_Maquinista-Barcelona_Catalonia.html", "text": "Very good shopping and eating. There are plenty of shops to go to for every budget and is easy to find.", "publishedDate": "2018-10-02", "language": "en", "rating": 5}, {"id": 617091259, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d2067434-r617091259-La_Maquinista-Barcelona_Catalonia.html", "text": "Loved this shopping centre, convenient to Barcelona city.\nBeing from Ireland we enjoyed the atmosphere from the local people!  ", "publishedDate": "2018-09-16", "language": "en", "rating": 5}, {"id": 612994838, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d2067434-r612994838-La_Maquinista-Barcelona_Catalonia.html", "text": "Was surprised and impressed with this mall. It's open air, but you could avoid the rain mostly if it did rain. Great variety of quality stores, chains and specialist. Food options are good for a mall - I really liked how they placed many of the better ones on the roof. Overall a really nice shopping experience - which my wife and kids will tell you, I wouldn't usually say.", "publishedDate": "2018-09-01", "language": "en", "rating": 5}, {"id": 611100993, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d2067434-r611100993-La_Maquinista-Barcelona_Catalonia.html", "text": "WARNING!! THIEVES IN THE PARKING LOT! We parked here for exactly 1h one day at midday for a quick lunch. When we got back to our car they had broken into it by breaking one of the windows. This happened at full daylight, with tons of people passing by and using the parking lot. There is no security, no cameras, the shopping mall completely abandoned us telling us that \"this happens EVERY DAY\". Wow. If this really happens every day, then why don't they put cameras and competent security personal? We called the police but apparently they never go there since this crimes happen so often. What a shame. Never again", "publishedDate": "2018-08-27", "language": "en", "rating": 1}, {"id": 609380329, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d2067434-r609380329-La_Maquinista-Barcelona_Catalonia.html", "text": "Great shopping Mall for families and couples. Has clothing, accessories, sports and kids shops also verity of foods shops. Also cinema and bowling center . The amazing combination between indoor and outdoor mall . Worth visiting \n", "publishedDate": "2018-08-22", "language": "en", "rating": 5}, {"id": 606154423, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d2067434-r606154423-La_Maquinista-Barcelona_Catalonia.html", "text": "La Maquinista right outside central Barcelons is a very good choice. All stores you expect to find in an ordinary shopping centre and more. This is not a luxury brand place with YSL and Gucci but with Ray Ban, Hollister, Super Dry, a huge Media Markt etc. All stores outdoor so dad can enjoy the sun while waiting.", "publishedDate": "2018-08-13", "language": "en", "rating": 5}, {"id": 601563426, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d2067434-r601563426-La_Maquinista-Barcelona_Catalonia.html", "text": "If you are looking for a fancy or luxurious shopping mall, this one is not for you.\nLa Maquinista has a lot of shops, cinemas, a huge Carrefour hypermarket, different  choices of restaurants and more.\nThe advantage is that they have the most popular shops all in one place, but there are no high-end stores. \nIt is also an outdoor shopping mall and at times it may be hot since there is no air conditioning. \n\n", "publishedDate": "2018-07-31", "language": "en", "rating": 3}, {"id": 598761595, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d2067434-r598761595-La_Maquinista-Barcelona_Catalonia.html", "text": "So you’re staying in the Costa Brava area and want to go to Barcelona for a day... Last year we drove the car there and parked in a secure car park near Sagarada Familia as the bus tour started from there.\n\nSee an older post: https://www.tripadvisor.nl/Attraction_Review-g187497-d670716-Reviews-Barcelona_Bus_Turistic-Barcelona_Catalonia.html?m=55595\n\nThis year we decided to used the subway and the advise we got was to park at La Maquinista shopping mall (free underground parking) and then walk about 15 minutes to metro station Sant Andreu. A day ticket is €8.60 and takes you all around Barcelona. It takes about 25-30 minutes from Sant Andreu to Plaça de Catalunya.\n\nLa Maquinista is easy to reach from the motorway.", "publishedDate": "2018-07-23", "language": "en", "rating": 5}, {"id": 564404592, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d2067434-r564404592-La_Maquinista-Barcelona_Catalonia.html", "text": "I have been going to that shopping Mall since I was 23 (that means 1.999) and it is simply Amazing. The only Open Spaced Shopping Centre in BCN well communicated and with any Store you could think of. It has been always renewing the brands and keep every single corner in fashion. They also have a pop-up space to Give small New Brand a chance to prove their acceptance. You cannot Miss Apple, Fnac, Hollister, Superdry, any inditex brand and of course, Nike & Adidas.\nAs for What eating concerns, you have any budget offer, from fast food to finest eating too!!! And of course, Starbucks coffee too! The car park is free and the night lights of the place are Beautiful, specially the third floor where all restaurants and bars are! By the way, cinemes by Cinesa are also Great!", "publishedDate": "2018-03-04", "language": "en", "rating": 5}, {"id": 563536152, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d2067434-r563536152-La_Maquinista-Barcelona_Catalonia.html", "text": "This is a big shopping mall, located in a less pretty part of Barcelona.\nIt’s accessible by metro, short walk away but no indication.\nStores are pretty much the same as everywhere in Barcelona - I have s feeling that only 10 different stores can be found in Barcelona and each of them is present about 100 times.", "publishedDate": "2018-03-01", "language": "en", "rating": 2}, {"id": 557705487, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d2067434-r557705487-La_Maquinista-Barcelona_Catalonia.html", "text": "If you are looking to shop while in Barcelona, this is the ideal location. Almost any store or major retailer you may be interested in is conveniently located in one place", "publishedDate": "2018-02-01", "language": "en", "rating": 4}, {"id": 551276090, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d2067434-r551276090-La_Maquinista-Barcelona_Catalonia.html", "text": "I go there when I need to do shopping, groceries, just for coffee. \nit has almost all brands ( the normal ones not fancy ) \nthere are lots of yummy restaurants, cinema and supermarkets.\nits outdoor so its perfect in summer and winter.", "publishedDate": "2018-01-03", "language": "en", "rating": 5}, {"id": 550061748, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d2067434-r550061748-La_Maquinista-Barcelona_Catalonia.html", "text": "We’re Pokémon players and they are one of the official sponsors of the game, so any time there’s an event, we normally go there and while shopping, we catch and we usually eat there too (Taco Bell, la tagliatella, McDonald’s, etc). They also have a cinema, so you can really spend the whole day there.", "publishedDate": "2017-12-29", "language": "en", "rating": 5}, {"id": 543294707, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d2067434-r543294707-La_Maquinista-Barcelona_Catalonia.html", "text": "I like the fact that all the corridors are shortages. It may be that weekends fill masses, about shops, nothing new ...", "publishedDate": "2017-11-26", "language": "en", "rating": 3}, {"id": 541379702, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d2067434-r541379702-La_Maquinista-Barcelona_Catalonia.html", "text": "Large mall, although we only nipped in to use the loo but the mall had great shops to wander about it.", "publishedDate": "2017-11-16", "language": "en", "rating": 4}, {"id": 533523122, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d2067434-r533523122-La_Maquinista-Barcelona_Catalonia.html", "text": "Beautiful location, plenty of places to have lunch/drinks outside in the sun. Lots of stores!! \nModern looking building ", "publishedDate": "2017-10-16", "language": "en", "rating": 5}, {"id": 518965645, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d2067434-r518965645-La_Maquinista-Barcelona_Catalonia.html", "text": "We luckily stayed close to this shopping mall and we had a nice time there. They have a very wide selection of shops & restaurants and you can easily spend several hours here or the whole day - depending on what you like.\nWe didnt see much public transport nearby, so dont know the best way to get there, if you live some distance away. Maybe that is why it seemed not to be so full of tourists.\nCan recommend it for any shopping needs. Several famous chains.", "publishedDate": "2017-08-29", "language": "en", "rating": 4}, {"id": 511054285, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d2067434-r511054285-La_Maquinista-Barcelona_Catalonia.html", "text": "A modern shopping center in the suburb of Barcelona. It has 3 open floors of shopping stores and cafeterias. We took the direct bus line H8 from Diagonal avenue and spent 4 hours with our 8 years old daughter. We had a good time.", "publishedDate": "2017-08-10", "language": "en", "rating": 4}, {"id": 510093041, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d2067434-r510093041-La_Maquinista-Barcelona_Catalonia.html", "text": "Multiple stores and restaurants, some places like Forever 21 thats only one at Barcelona.\nThere is also Carrefour-hypermarket but you can't go in if you have shopping bags, thats dumb. \nYou can get here by metro and small walk after that.", "publishedDate": "2017-08-08", "language": "en", "rating": 4}, {"id": 504274866, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d2067434-r504274866-La_Maquinista-Barcelona_Catalonia.html", "text": "It's an excellent place to do some shopping. You've got shops and restaurants, and even a cinema. Sometimes they offer special events. It's a great place to spend the day, however, I recommend not going at the weekend or bank holidays because it can get crowded quite easily.", "publishedDate": "2017-07-21", "language": "en", "rating": 5}, {"id": 502709087, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d2067434-r502709087-La_Maquinista-Barcelona_Catalonia.html", "text": "Great place for shopping, everything at the same place. Not as crowded as all the shopping centers in the city. It's easy to get there by a metro and easy to walk around even with strollers. Definitely worth a visit", "publishedDate": "2017-07-17", "language": "en", "rating": 5}, {"id": 490047339, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d2067434-r490047339-La_Maquinista-Barcelona_Catalonia.html", "text": "We took our youngest teenager here to satisfy her thirst for shopping. A lovely open air centre which provided plenty of shade. Good variety of shops and we had both coffee and lunch here in addition to doing our clothes shopping. There were lots of people but because of the size centre it never felt crowded and there were no queues. Overall a very pleasant shopping experience. ", "publishedDate": "2017-06-03", "language": "en", "rating": 5}, {"id": 479712036, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d2067434-r479712036-La_Maquinista-Barcelona_Catalonia.html", "text": "Was a good mall to visit with family open not closed so bring a jacketbif the weather is cold. Out door mall totally diffrent to the every day mall you would visit. No high class brands. ", "publishedDate": "2017-04-28", "language": "en", "rating": 5}, {"id": 475254873, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d2067434-r475254873-La_Maquinista-Barcelona_Catalonia.html", "text": "A nice shopping mall with restaurants, bars and a big movie theater. Free parking and well organized. Easy to reach and a lot of stores", "publishedDate": "2017-04-13", "language": "en", "rating": 3}, {"id": 472757234, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d2067434-r472757234-La_Maquinista-Barcelona_Catalonia.html", "text": "Great place to go for a shopping spree with out the crowds all the brands you need similar to most shopping malls in Barcelona. The stores range from the cheaper to more expensive stores. \n\nThey have a great restaurant terrace area on the roof to grab a bite to eat with a great range of cuisines to choose from, also a bowling alley and a cinema just a heads up but I'm pretty sure the cinema is only in Spanish for  those on holidays and don't know a lot of Spanish. \n\nEasy to get to via the metro line and walking distance from there great place to shop if wanting to get same satisfaction but with out the crowds in the touristy areas.\n", "publishedDate": "2017-04-04", "language": "en", "rating": 4}, {"id": 472470854, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d2067434-r472470854-La_Maquinista-Barcelona_Catalonia.html", "text": "Nice mall worth a visit... Big mall... Nice interior... Price range from cheap to expensive... Spain is good place for shopping... ", "publishedDate": "2017-04-03", "language": "en", "rating": 5}, {"id": 466500444, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d2067434-r466500444-La_Maquinista-Barcelona_Catalonia.html", "text": "very good mall,you have everything,but it is better to avoid going on saturday-too much people and also you have to wait like 1-2 hours for any restaurant", "publishedDate": "2017-03-12", "language": "en", "rating": 4}, {"id": 459720520, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d2067434-r459720520-La_Maquinista-Barcelona_Catalonia.html", "text": "The mall is very interesting in term of shopping brands and the number of stores. It looks like a small shopping town. The mall is remote, it will take you one hour in average to get there from the city center. There is also a limited choice regarding the restaurants. Beware of the pickpokets, my cell phone has been stolen there...", "publishedDate": "2017-02-14", "language": "en", "rating": 4}, {"id": 448529727, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d2067434-r448529727-La_Maquinista-Barcelona_Catalonia.html", "text": "A great mall in Barcelona to ensure your family finds all they need in a short amount of time. We spent 2 hours checking all the boxes on the lists. A very nice place, well worth the trip from downtown.", "publishedDate": "2017-01-02", "language": "en", "rating": 5}, {"id": 443854617, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d2067434-r443854617-La_Maquinista-Barcelona_Catalonia.html", "text": "It's a great shopping centre. You can go on a shopping spree, the cinema is right there and you can have something to eat, snack or more substantial. Now they even have an ice rink so it covers quite a lot in the entertainment field. ", "publishedDate": "2016-12-12", "language": "en", "rating": 5}, {"id": 424043752, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d2067434-r424043752-La_Maquinista-Barcelona_Catalonia.html", "text": "There were tons of great stores here! I work at Starbucks in the US so of course they had one at this mall and it just made me feel right at home. The employees everywhere I went to were great and the mall is beautiful.", "publishedDate": "2016-10-01", "language": "en", "rating": 5}, {"id": 422903297, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d2067434-r422903297-La_Maquinista-Barcelona_Catalonia.html", "text": "Really surprised to go there with young kids in carrefour market staff is lazy and not helpful.after we decide to take some help for shopping related so we go in attention clients.but they are also not give us good help.they just are there for Spanish Catalans people.we are surprised  how they are to rude.and rejected the customers.if u want really good shopping in Barcelona to many nice shopping malls.be carefull. to go in carrefour the maqinista .totally helpless staff.", "publishedDate": "2016-09-27", "language": "en", "rating": 1}, {"id": 410272795, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d2067434-r410272795-La_Maquinista-Barcelona_Catalonia.html", "text": "If you,r a brand looking fan like Hugo boss ,napapirji , pal Zalere ,harmont&blaine , or else this would not be your target , but for hollister I think this is the most big store in Barcelona .", "publishedDate": "2016-08-24", "language": "en", "rating": 3}, {"id": 401766312, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d2067434-r401766312-La_Maquinista-Barcelona_Catalonia.html", "text": "One of the best malls in Barcelona... The only Hollister shop and the only forever 21 are there! Even Desiguel shop is different than other ones all around the city.. Lots of other great places to shop. And restaurants to eat in\nThe only 2 disadvantages is that it's a little bit long walking distance from the nearest metro station and it's not suitable for a very hot summer day as it is in the open air.", "publishedDate": "2016-08-05", "language": "en", "rating": 5}, {"id": 396094051, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d2067434-r396094051-La_Maquinista-Barcelona_Catalonia.html", "text": "We stayed in the hotel side by side with the shopping mall, so we had the opportunity to go there multiple times.\n\nThis shopping mall is rather huge with many shops and for every kinds of prices (from cheap to expensive).\n\nIt's very well organized and clean. Has a good variety of types of shops and the restaurants are opened until 1am.\n\nSince it's a popular attraction it could have an enlarged schedule which is from 10am to 10pm.", "publishedDate": "2016-07-24", "language": "en", "rating": 5}, {"id": 393157648, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d2067434-r393157648-La_Maquinista-Barcelona_Catalonia.html", "text": "Visited on a Saturday morning at 10am in July as centre opened, hence easy to find parking (seemed to be a nightmare in open air car park by lunchtime).\nThey great advantage of this centre is it had everything to keep 2 teenagers happy - Superdry, Pull and Bear, Lefties, Hollister. Also a really big Carrefour to keep the adults happy. Easy to access from big highway beside it.\nWe came back on our last day (mid week) around 6pm, as he had a few hours to kill, and needed some dinner. Food court gave so many options.\nSo in summary, not the authentic Barcelona experience, but if mixed with a couple of days in the city, nice to get a bit of retail therapy in.", "publishedDate": "2016-07-16", "language": "en", "rating": 4}, {"id": 390780588, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d2067434-r390780588-La_Maquinista-Barcelona_Catalonia.html", "text": "I went there with my wife for shopping. The place covers most of the important brands and carries some local specialties as well. If you don't want to waste your time rooming around the overcrowded city this should be your place to go. Unfortunately leaving from there by taxi is not that convenient as there are not so many taxis around in this area even though they have several taxi stands around. But maybe this was also owed to the time we went there during the week. Nevertheless a great place to shop!", "publishedDate": "2016-07-09", "language": "en", "rating": 5}, {"id": 390759018, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d2067434-r390759018-La_Maquinista-Barcelona_Catalonia.html", "text": "Cinemas in spanish language only, bowling, shopping, supermarkets, kids day care , pets care, games for kids, playground,l and more ", "publishedDate": "2016-07-09", "language": "en", "rating": 5}, {"id": 390756167, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d2067434-r390756167-La_Maquinista-Barcelona_Catalonia.html", "text": "Visited this mall in the hope of getting relief from blistering heat. Too bad, this mall is open air. Shops that you can find anywhere in the wold, nothing remarkable. Even the food in totally commercialized. Not worth the visit except when you need to buy something you do not have.", "publishedDate": "2016-07-09", "language": "en", "rating": 1}, {"id": 389734074, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d2067434-r389734074-La_Maquinista-Barcelona_Catalonia.html", "text": "Large open space shopping, with all brands, including 3 floor Nike, and wide range of restaurants/fast food \"first time in Taco Bell\" a morning well spent :)", "publishedDate": "2016-07-06", "language": "en", "rating": 4}, {"id": 383617662, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d2067434-r383617662-La_Maquinista-Barcelona_Catalonia.html", "text": "Easy parking and great stores. Crowded over the weekends. Open area mall with stores ranging from electronics to supermarkets. Very good. ", "publishedDate": "2016-06-18", "language": "en", "rating": 5}, {"id": 381430107, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d2067434-r381430107-La_Maquinista-Barcelona_Catalonia.html", "text": "I was at maquinista mall today it is great, the location is bit far from the centre but still best one, one thing was very bad is customer service at forever 21!!!\nThey arw awful, nobody knows english and plus they are unpolite", "publishedDate": "2016-06-10", "language": "en", "rating": 4}, {"id": 381202704, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d2067434-r381202704-La_Maquinista-Barcelona_Catalonia.html", "text": "thank you - beautiful experience, good services- we eat somthing fast , many many reductions-sales and we enjoyed very much. is beautiful place, nce staff", "publishedDate": "2016-06-09", "language": "en", "rating": 5}, {"id": 378010904, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d2067434-r378010904-La_Maquinista-Barcelona_Catalonia.html", "text": "Beautifully designed shopping mall. Great stores including international brands of various price level. Very pleasant to explore and stroll. Includes very nice and comfortable resting areas that even offer the option to charge any portable devices. Of course has a well arranged food section and convenient parking for free. ", "publishedDate": "2016-05-30", "language": "en", "rating": 5}, {"id": 377116150, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d2067434-r377116150-La_Maquinista-Barcelona_Catalonia.html", "text": "This mall gathers all the main fashion chainstores in one place Together with a few more stores- and is not bad at all. \nBut still I would say it is a shame to spend a day at this quite newly built and unpersonalized mall when all stores are avalible in central Barcelona in much greater surroundings. ", "publishedDate": "2016-05-27", "language": "en", "rating": 2}, {"id": 376925012, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d2067434-r376925012-La_Maquinista-Barcelona_Catalonia.html", "text": "La Maquinista is one of the best shopping malls in Barcelona. It has shops of all the major brands and the stuff sold is also very good. Lots of awesome food places as well! The entire layout and atmosphere in the mall is fantastic! \nIt is a little far away from the centre of the city, the closest metro station is Torres i Bages on metro line 1. There are also buses that will get you here. ", "publishedDate": "2016-05-26", "language": "en", "rating": 5}, {"id": 376469565, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d2067434-r376469565-La_Maquinista-Barcelona_Catalonia.html", "text": "La Maquinista is the newest mall in Barcelona. If you want to do a lot of shopping with the least amount of traveling time, it is your best option in Barcelona. People who shop here are mostly locals so don't expect to find your swanky stores here. \n\nPlease be aware that getting a taxi here at the mall is a huge problem. Although they have a taxi stop, there's no taxi waiting there. Twice, when we were ready to leave the mall, we waited and waited forever for one taxi to come by. So please make sure you arrange transportation beforehand so you don't get stranded at the shopping center.", "publishedDate": "2016-05-25", "language": "en", "rating": 4}, {"id": 372285646, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d2067434-r372285646-La_Maquinista-Barcelona_Catalonia.html", "text": "Very nice shopping centre with great atmosphere. Plenty of shops and the food court on the top floor has a great variety", "publishedDate": "2016-05-12", "language": "en", "rating": 5}, {"id": 372251432, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d2067434-r372251432-La_Maquinista-Barcelona_Catalonia.html", "text": "One of the best shoppingcenters I have been to. Easy access from were we lived with the train. Many differerent stores, both cheap and expencive. Hope to come back one day.", "publishedDate": "2016-05-11", "language": "en", "rating": 5}, {"id": 353358741, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d2067434-r353358741-La_Maquinista-Barcelona_Catalonia.html", "text": "I can easily say that it is definitely one of the best shopping centres in Barcelona! Has every popular, known high street shop in one place plus a restaurant floor and even a cinema! ", "publishedDate": "2016-03-06", "language": "en", "rating": 5}, {"id": 351066583, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d2067434-r351066583-La_Maquinista-Barcelona_Catalonia.html", "text": "Big shopping mall with so many shops!!! Ideal for sunny days!! We had a little problem with the access since we went there using the metro, but then we had to walk about 10 minutes...and when we left Saturday evening it was quite hard finding a taxi... The mall itself is a place where you will find everything, plus the cinemas and the many choices for coffee, food or dessert.", "publishedDate": "2016-02-26", "language": "en", "rating": 5}, {"id": 342571392, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d2067434-r342571392-La_Maquinista-Barcelona_Catalonia.html", "text": "One of my favourite shopping malls I've been to, loads to do and so many different shops! Would definitely like to come back whenever next in Barcelona!", "publishedDate": "2016-01-25", "language": "en", "rating": 5}, {"id": 339077451, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d2067434-r339077451-La_Maquinista-Barcelona_Catalonia.html", "text": "La Maquinista is one of the best malls in Barcelona, you'll find a lot of shops like Zara, H&M ,,,, also there is a big branch of Carrfour there. but take care all shops close by 10 p.m.", "publishedDate": "2016-01-10", "language": "en", "rating": 5}, {"id": 324219288, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d2067434-r324219288-La_Maquinista-Barcelona_Catalonia.html", "text": "Ok, If you want to shop, you should go here. Shops for everyone. So don't spend your time in other shopping centrums.. Here's all you need", "publishedDate": "2015-11-03", "language": "en", "rating": 4}, {"id": 319225461, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d2067434-r319225461-La_Maquinista-Barcelona_Catalonia.html", "text": "mind that carrefour won't let you in if you have luggage with you. they have wide selection of jamons and other local specialties.", "publishedDate": "2015-10-16", "language": "en", "rating": 5}, {"id": 314229935, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d2067434-r314229935-La_Maquinista-Barcelona_Catalonia.html", "text": "La Maquinista is situated from few train stops from Barcelona, Spain. you can find a lot of shops from there. For ex. Hollister and hundreds of shops and many restaurants are there. It's partly covered with roof and partly outside. Very interesting place.", "publishedDate": "2015-09-28", "language": "en", "rating": 5}, {"id": 310118975, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d2067434-r310118975-La_Maquinista-Barcelona_Catalonia.html", "text": "Lots of shops. Here is almost everything you could imagine to find in Spain. Only shop that I was missing, was a disney shop. Still the best mall to shop in Barcelona. When we visited Barcelona, the center was very crowded, but here we could shop with more space. \n\nThe outdoor mall is very nicely implemented. The upper floor with lots of places to eat or just hang around was also quite cozy. But almost every restaurant is a fast food restaurant, as you can expect.", "publishedDate": "2015-09-14", "language": "en", "rating": 5}, {"id": 287920373, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d2067434-r287920373-La_Maquinista-Barcelona_Catalonia.html", "text": "Probably the best mall in Barcelona with a huge selectio of stores (including the only Forever21 in Barcelona). Also has a large Carrefour for your grocery needs and a large number of fast food joints. Beware that it's not under the roof and you have to step outside when isiting different stores, which is not that comfortable in the summer. You can reach it with public transportation using metro: the most convenient way is to use either Torras i Boges or Bon Bastor stations, but both require a 10-minute walk.", "publishedDate": "2015-07-11", "language": "en", "rating": 4}, {"id": 285591434, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d2067434-r285591434-La_Maquinista-Barcelona_Catalonia.html", "text": "I love this mall has it all.\nGood shops with brands, fast food, movie I can not complain.\nLovely If you are looking for a place where desepejar mind and have fun with your partner or family this is the place.", "publishedDate": "2015-07-04", "language": "en", "rating": 5}, {"id": 282801891, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d2067434-r282801891-La_Maquinista-Barcelona_Catalonia.html", "text": "Nice shopping centre with a lot of Brand stores. Prices on normal level so not an outlet village. Very easy to reach by car from north of Barcelona.", "publishedDate": "2015-06-24", "language": "en", "rating": 4}, {"id": 280346857, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d2067434-r280346857-La_Maquinista-Barcelona_Catalonia.html", "text": "As all people agreed, it's a great huge shopping center. I can access to all international and Spanish brands here. The Location is quite easy to find, just turn left whe u get outside the metro. \nHowever, there is no local restaurants here.", "publishedDate": "2015-06-15", "language": "en", "rating": 4}, {"id": 262893521, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d2067434-r262893521-La_Maquinista-Barcelona_Catalonia.html", "text": "This mall is really nice. I visited there with friends and had a good time. It is quite huge and you can spend 3-4 hours easily here doing shopping. The restaurants in this mall are quite good.", "publishedDate": "2015-03-31", "language": "en", "rating": 5}, {"id": 260358921, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d2067434-r260358921-La_Maquinista-Barcelona_Catalonia.html", "text": "La Maquinista is a big mall where you can find everything you need. In the last level you will find an cinema too. So everything is there to spend a hole day with friends or family.", "publishedDate": "2015-03-18", "language": "en", "rating": 4}, {"id": 254558894, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d2067434-r254558894-La_Maquinista-Barcelona_Catalonia.html", "text": "We went for some retail therapy. Getting there and back wasn't straight forward on the bus and metro. Shopping was above average. There was a lot of goods on sale but nothing spectacular. The food choices was pretty good eg, Kfc, Taco Bell, Burger King etc... Carrefour hypermarket was handy.", "publishedDate": "2015-02-16", "language": "en", "rating": 4}, {"id": 248241663, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d2067434-r248241663-La_Maquinista-Barcelona_Catalonia.html", "text": "free parking, lots of shops, nice cinema and lots of different resturants. On sunday the shops are closed but at least the rest is open", "publishedDate": "2015-01-08", "language": "en", "rating": 4}, {"id": 245973609, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d2067434-r245973609-La_Maquinista-Barcelona_Catalonia.html", "text": "Really nice mall, clean and huge!! A bit far from the city center of Barcelona but worth the trip, the mall has almost everything!!😊", "publishedDate": "2014-12-26", "language": "en", "rating": 4}, {"id": 240859440, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d2067434-r240859440-La_Maquinista-Barcelona_Catalonia.html", "text": "It´s like a outside shopping centre, where sun is shining in the \"streets\" and shops are around you. Lots of nice restaurants in 3rd floor. Price level quite low, except in Nike and Adidas shops, where prices seems to be even higher than in Finland. Free parking outside and free Wifi in area.", "publishedDate": "2014-11-21", "language": "en", "rating": 4}, {"id": 221381414, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d2067434-r221381414-La_Maquinista-Barcelona_Catalonia.html", "text": "It was a nice mall, I enjoyed eating the froyo here and shopping around. We spent a while searching for Forever 21 but couldn't find it. In the end it turns out it was closed =___= Lots of other shops here to shop at though", "publishedDate": "2014-08-12", "language": "en", "rating": 3}, {"id": 220658920, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d2067434-r220658920-La_Maquinista-Barcelona_Catalonia.html", "text": "By far, the very best mall in all of Barcelona. Open planned and very airy with no roof to the complex. Really good amount of national and internationally known brands.\nNot so easy to get to though on public transport, at least a 10 minute walk from either metro station (Can Peixauet / Torras i Bages) and poorly signposted en-route.", "publishedDate": "2014-08-09", "language": "en", "rating": 5}, {"id": 214733446, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d2067434-r214733446-La_Maquinista-Barcelona_Catalonia.html", "text": "A 3-storey modern space, an ensemble of buildings for quality shopping, fun, entertainment, snacks or a cup of coffee. \nThough some tourists say it is on outskirts of the city, don't worry. If you're fed up with crowded Plaça Catalunya and overpriced Rambla, jump into a R1 train on Renfe station \"Catalunya\" (Maçanet direction), go 2 stations to Clot-Arago, make a simple change to R2 (neighboring platform) and go only 1 station to Sant Andreu-Comtal. A 7-8 minutes walk from the station to La Maquinista lies through the Maquinista park. \nIf we went there first, I think we'd most likely never visit Diagonal Mar ))", "publishedDate": "2014-07-10", "language": "en", "rating": 5}, {"id": 214066974, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d2067434-r214066974-La_Maquinista-Barcelona_Catalonia.html", "text": "I went here  because of Forever 21 but the store is closed. I was disappointing because it is not in a central location, but I enjoyed a lot shopping in La Maquinista.\nIt is a  big mall, open space, not at all crowded, very nice and clean.\nYou can find everything you want and there are a lot of nice places to eat or have a drink.\nFor my next trip to Barcelona, I'll come back for sure.", "publishedDate": "2014-07-07", "language": "en", "rating": 4}, {"id": 213064786, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d2067434-r213064786-La_Maquinista-Barcelona_Catalonia.html", "text": "Huge outlet if you enjoy retail therapy. Easy access through public transport. Has all the usual brands at outlet prices and plenty of eating places.", "publishedDate": "2014-07-01", "language": "en", "rating": 4}, {"id": 212087807, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d2067434-r212087807-La_Maquinista-Barcelona_Catalonia.html", "text": "Went here mainly because of forever 21 but the store is closed. Dont know if it will be reopened. On the website no info.sucks.", "publishedDate": "2014-06-25", "language": "en", "rating": 3}, {"id": 207652426, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d2067434-r207652426-La_Maquinista-Barcelona_Catalonia.html", "text": "This shopping mall was good both for my teenager and me. It was not crowded and we had all time in the world to look for shops and clothes. This mall has everything, shoes, clothes, cosmetics ie. Forever 21 and Hollister vwere the main attractions for us. \n\nWe took the metro there, walked through the neighbourhood and back to the city centre we took the bus. \n\nThis place is clean and nice. If you like to shop this is the place for you.", "publishedDate": "2014-05-28", "language": "en", "rating": 5}, {"id": 199979528, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d2067434-r199979528-La_Maquinista-Barcelona_Catalonia.html", "text": "A great shopping center with all the spanish and not spanish stores you need. Takes about 30 minutes to go there from the city core with the metro. Not crowded and very clean and fresh. ", "publishedDate": "2014-04-05", "language": "en", "rating": 4}, {"id": 181516774, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d2067434-r181516774-La_Maquinista-Barcelona_Catalonia.html", "text": "A VERY nice place to go shopping. The biggest plus is that the store \"Forever 21\" is placed in the mall.\nBut it was a bit complicated to find.", "publishedDate": "2013-10-18", "language": "en", "rating": 4}, {"id": 181237468, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d2067434-r181237468-La_Maquinista-Barcelona_Catalonia.html", "text": "Loved visiting and the lay out of the shops. it is sort of out door in door malls yet gives a feeling of magnificence when you visit. many shops to see and many things to view.", "publishedDate": "2013-10-16", "language": "en", "rating": 5}, {"id": 174199245, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d2067434-r174199245-La_Maquinista-Barcelona_Catalonia.html", "text": "So the nearest metro comes out below an elevated highway in the middle of nowhere and you want me to visit your mall. Seriously two other couples got off at the same stop as we did, turned around and went back down to the metro station and went somwhere else.....\n\nWhy on earth would you build a mall half mile away from a metro station ??? ", "publishedDate": "2013-08-26", "language": "en", "rating": 1}, {"id": 165399171, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d2067434-r165399171-La_Maquinista-Barcelona_Catalonia.html", "text": "La maquinista definitely has what it takes to be a great shopping mall. Not only was it full of kinds of stores (including amazing restaurants), but also was for everyone's pocket. On a sunny (but not too hot) day, the place is great due to its openness (the whole mall is practically outside). Bought some great stuff in there. Furthermore, it is quite easy to get there through metro lines.", "publishedDate": "2013-06-27", "language": "en", "rating": 5}, {"id": 150522606, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d2067434-r150522606-La_Maquinista-Barcelona_Catalonia.html", "text": "Recommended to visit this nice mall , nice open air shoping area.\n\nApple store is there and many attractive shop.\n\nNice caffee also is there  , ", "publishedDate": "2013-01-24", "language": "en", "rating": 4}, {"id": 147510763, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d2067434-r147510763-La_Maquinista-Barcelona_Catalonia.html", "text": "I fell in love with it as soon as I walked in! It has tons of stores as well as a food court. I can assure, you´ll find whatever you need!there is everything from clothing stores,jewelry,travel angencies,restaurants, a supermarket (Carrefour) and movie theater in it. I personally think this is the perfect place to shop, just make sure you go with plenty of time since is pretty big!\n\nYou will probably have to walk a nice chunk since metro stations are not very close by, but I suggest you take the bus(#79 if I´m not mistaken) has a stop right in front of the mall...or you can always drive! :)\n\nCheck out it´s webpage if you´d like.... http://www.lamaquinista.com/W/do/centre/tiendas\nHappy Shopping!!", "publishedDate": "2012-12-15", "language": "en", "rating": 5}, {"id": 145845134, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d2067434-r145845134-La_Maquinista-Barcelona_Catalonia.html", "text": "I liked shopping here in the open air mall. lots of people and a nice environment. when they opened the 3rd floor of restaurants in August, it only made it better.", "publishedDate": "2012-11-20", "language": "en", "rating": 4}, {"id": 142907039, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d2067434-r142907039-La_Maquinista-Barcelona_Catalonia.html", "text": "Easy access through the metro system, attractive shops, a nice environment and good restaurants. One thing missing though: storage lockers so that you don't have to carry all your bags in to the next shops...", "publishedDate": "2012-10-15", "language": "en", "rating": 5}, {"id": 138405771, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d2067434-r138405771-La_Maquinista-Barcelona_Catalonia.html", "text": "You want to find everything you look for in terms of food, clothes and anything else..mostly a pleasant shopping experience..this is the place. There is no other. Its so blissful to shop here that we ended up being one of the last few families to leave the place. There are even little places where kids can play like slides or rides etc including a 'kids care' near the super market.", "publishedDate": "2012-08-26", "language": "en", "rating": 5}, {"id": 135281175, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d2067434-r135281175-La_Maquinista-Barcelona_Catalonia.html", "text": "This centre is a bit out of the way, but if your better half is after some good shopping, this is the place to visit. Large Zara, Mango, Apple and all the others you'd expect. Free wifi is a plus, like most Barcelona shopping centres.", "publishedDate": "2012-07-24", "language": "en", "rating": 4}, {"id": 135016164, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d2067434-r135016164-La_Maquinista-Barcelona_Catalonia.html", "text": "In the La Maquinista you will find a big shopping-center and a place to spend time in restaurants, cinema, some bars and game halls. A place which is definitely occupied by spaniards - you don't will find tourists. The best hour for shopping is from Monday to Friday at 10.00am. Its the time the shops open and the center isn't crowded. In the evening and on Saturday you will find it crowded by masses of people. Shops are open normally till 10pm. Big, wide, all the things you expect in a shopping-center are there - what you want more?", "publishedDate": "2012-07-21", "language": "en", "rating": 4}, {"id": 129471364, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d2067434-r129471364-La_Maquinista-Barcelona_Catalonia.html", "text": "Boring shopping centre with all the same stuff you get in the city centre. The only really unique place is the apple centre where they possibly have the worst service in the world. If Steve Jobs had a plan for Apple it certainly wasn't this.\n\nIf you need to find another Zara because along with jack jones because they are so hard to find head here. \n\nSeriously parking is ok but if you want out of hours shopping try mare magnum which is open on a Sunday unlike anywhere else in Barcelona.", "publishedDate": "2012-05-06", "language": "en", "rating": 3}]}}]