[{"locationId": 11930470, "name": "Montserrat", "placeType": "ATTRACTION", "reviewListPage": {"reviews": [{"id": 744397386, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d11930470-r744397386-Montserrat-Barcelona_Catalonia.html", "text": "Very good guide and well scheduled, high recommended as it is an early trip so there is not much tourists in the church . The guide recommended us to go a short walk to the cross and it is a beautiful walk with great view and photo point", "publishedDate": "2020-02-11", "language": "en", "rating": 5}, {"id": 726408567, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d11930470-r726408567-Montserrat-Barcelona_Catalonia.html", "text": "My friend and I visited Montserrat with Get Your Guide tour company which picked us up at our hotel.  Unfortunately they changed the travel plans and we didn't get the notice, making us all late.  As a result, our time at Montserrat was shorter than it would have been.  We didn't have time to see the Black Madonna or cable car, funicular.  But what we did see, which included the Boy's Choir, was well worth the trip.  The vista is beautifully inspiring.  It IS a trip worth going to if you have a half-day. Our trip could have been better with better planning of guide.", "publishedDate": "2019-11-14", "language": "en", "rating": 3}, {"id": 719494813, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d11930470-r719494813-Montserrat-Barcelona_Catalonia.html", "text": "I join a local tour, half day.  we 1st took the train and go up to the mountain.  once we arrive, the view of the Mountain, i have no word to describe.  Every person looks at the shape of the mountain has different shape or look like something.   very interesting !!\n\nthe monastery is very nice too and of course, we have to see black saint Maria.   She is special\n\nNice half day tour but you can spend a whole day here, so many thing to see and you cannot stop yourselves not to take picture as the view super nice !", "publishedDate": "2019-10-18", "language": "en", "rating": 5}, {"id": 718790018, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d11930470-r718790018-Montserrat-Barcelona_Catalonia.html", "text": "Great view and really interesting rock formation of the mountain. It's a great place to get away from the crowd and meditate. We used a tram to go to the monastery-there you can see the famous Black Madonna and the Choir boys. There is also a restaurant near the tram station but there arent many options to choose from. Highly recommend to bring own food and drinks! And please wear comfortable shoes, warm and water resistant clothing if possible. There's lot of walking and it was windy and cold on a gloomy day.\n\nWe took a funicular to go to the top of the mountain. You could also hike up top if you dont want to spend another 15 € or so. We hiked up the path on the right and saw the breathtaking view. After all that, we hiked back down to the monastery, took us 30 mins.", "publishedDate": "2019-10-16", "language": "en", "rating": 4}, {"id": 716873164, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d11930470-r716873164-Montserrat-Barcelona_Catalonia.html", "text": "We had a day tour with Ordonez and went to 3 places this being the first. It was little foggy on the way up so couldnd't see much until we arrived and then it was magnificent. Only regret is that we couldn't stay a l;ittle longer.", "publishedDate": "2019-10-09", "language": "en", "rating": 5}, {"id": 714809630, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d11930470-r714809630-Montserrat-Barcelona_Catalonia.html", "text": "An early morning visit Montserrat by bus and with guide . A beautiful amazing stunning must see place . Our only downfall was we had only 2 hrs free time . Felt our visit was rushed .", "publishedDate": "2019-10-02", "language": "en", "rating": 5}, {"id": 712430500, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d11930470-r712430500-Montserrat-Barcelona_Catalonia.html", "text": "Yes, I know that there are tourists all over the place, but there is something about the location - the serenity of the magnificent mountains, the location within those mountains - which causes one to stop and view the mountains and reflect. Walk around the edges of the property where it is quieter, and you will feel the beauty of this spot.\nUnfortunately, even the cathedral, where the black Madonna resides, is crowded and thus is not very quiet - still worth a visit, however.\nTip: As said, there are huge crowds, so go as early in the morning as you can. It seems that the crowds arrive around noon.\nTip: If you need a sandwich for lunch, go all the way back to the last restaurant on the left, near the statue of the bishop, where they will make your sandwich to order while you wait.\nBetter than the pre-made sandwiches in the gift shops. \nTip: Don't overlook the food stalls for some nifty snacks. I bought several huge fresh figs to serve as desert and they were delicious.\nRegrettably, we were not able to hear the boys choir, as it was their day off. They usually perform around noon-1PM daily.\nThis site takes some time to reach from Barcelona - about three hours total travel time - so plan to spend at least a half day for your visit.\nIt's worth it.", "publishedDate": "2019-09-23", "language": "en", "rating": 5}, {"id": 708278102, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d11930470-r708278102-Montserrat-Barcelona_Catalonia.html", "text": "Very impressive monastery built into the side of a mountain about an hour train ride from Barcelona.  It's worth the visit.  Plan ahead and spend time walking around the national park that surrounds the monastery.", "publishedDate": "2019-09-09", "language": "en", "rating": 4}, {"id": 695191761, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d11930470-r695191761-Montserrat-Barcelona_Catalonia.html", "text": "This statue stands as an allegorical reference to Santa Maria de Montserrat Abbey in the Catalonian city of Montserrat. The statue simply depicts classical female figure. Not much to see really.", "publishedDate": "2019-08-03", "language": "en", "rating": 2}, {"id": 685184462, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d11930470-r685184462-Montserrat-Barcelona_Catalonia.html", "text": "Located about one hour North of Barcelona, Montserrat is a worship monastery for our Lady of Montserrat. Right in the middle of the mountains, with breathtaking views, lies this monastery and church. If you are Catholic, like we are, you will thoroughly enjoy this visit!", "publishedDate": "2019-06-29", "language": "en", "rating": 5}, {"id": 680334489, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d11930470-r680334489-Montserrat-Barcelona_Catalonia.html", "text": "This place is amazing be sure to go into the basilica a truly iconic place my only concern was the amount of people it can get very crowded and if your driving in it’s not recommended there is a train station and that’s best way we got in by tourist bus and still was a delay\nIn any case it’s truly amazing place and the view is awesome", "publishedDate": "2019-06-09", "language": "en", "rating": 4}, {"id": 676318916, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d11930470-r676318916-Montserrat-Barcelona_Catalonia.html", "text": "The entry at the top of this Review page refers to Montserrat, Placa de Catalunya, Barcelona, Spain. So I find it strange that so many reviewers talk about Montserrat the mountain, which is not in Barcelona at all, but a very long way away! The Montserrat, Placa de Catalunya, is a bronze sculpture facing the north side (of the plaza) on a column on the east side of the Plaça de Catalunya. It was made by Eusebio Arnau in 1928, to pay tribute to the famous Santa Maria de Montserrat Abbey, which is in the mountain of the same name (Montserrat), outside Barcelona. The sculpture is that of a partly clothed, bearded, old man, holding  a small statue of the Virgin of Montserrat. It is worth having a look if you are in the Plaza. The plaza is a busy place, full of visitors. It is quite beautiful and is adorned with two lovely fountains, and numerous sculptures, as well as other items.", "publishedDate": "2019-05-25", "language": "en", "rating": 4}, {"id": 673523664, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d11930470-r673523664-Montserrat-Barcelona_Catalonia.html", "text": "Well worth visiting but the half day trip to Montserrat doesn't provide enough time to fully explore this site. We barely had time after the guided tour to make the hike to the cross.\nAwesome views both at the monastery and on the bus ride up and down. Access to the Black Madonna was a nice surprise - no other tour that we took offered a view from above looking out at the sanctuary.\nThe liquor tasting was not very interesting - nothing other than a 2-3 word description of the liquor.", "publishedDate": "2019-05-12", "language": "en", "rating": 5}, {"id": 659826621, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d11930470-r659826621-Montserrat-Barcelona_Catalonia.html", "text": "We booked an afternoon tour from Barcelona with a venicular ride to the top. The venicular is a modern style tram. Great ride with spectacular views. Our guide gave us an overview and showed us to the outside of the church. The star attraction was the Black Virgin. We were lucky, it wasn't crowded. We got fabulous photos of the facilities and the natural beauty. The only disappointing issue, there wasn't really enough time to take the other venicular to the top peak.", "publishedDate": "2019-03-20", "language": "en", "rating": 5}, {"id": 632305888, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d11930470-r632305888-Montserrat-Barcelona_Catalonia.html", "text": "Such a beautiful place, a little village with a church and the the different hills for hiking! The pictures with the view are taken from Sant Jeroni. A really quiet and peaceful place only 1,5 hours from the center of Barcelona!", "publishedDate": "2018-11-10", "language": "en", "rating": 4}, {"id": 567378798, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d11930470-r567378798-Montserrat-Barcelona_Catalonia.html", "text": "Very interesting and accommodating monastery for tourists and families. Adequate parking, bathrooms and food accommodations as well. Beautiful art work and atmosphere. Go early because the facility becomes very full as the day progresses.", "publishedDate": "2018-03-18", "language": "en", "rating": 5}, {"id": 554924973, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d11930470-r554924973-Montserrat-Barcelona_Catalonia.html", "text": "A brilliant day out of the city. Different routes, with great views of Barcelona and the surrounding areas. The mountains are composed of interesting rock formations, really beautiful. Impressive monastery too.", "publishedDate": "2018-01-20", "language": "en", "rating": 5}, {"id": 516042339, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d11930470-r516042339-Montserrat-Barcelona_Catalonia.html", "text": "On the northeast side of the beautiful Plaza de Catalunya there is an entrance surronded by two columns. On the right column there are two sculptures. Montserrat is one of them.\nMontserrat is a bronze sculpture made by Eusebi Arnau in 1928.", "publishedDate": "2017-08-21", "language": "en", "rating": 3}]}}]