[{"locationId": 501696, "name": "The Magic Fountain", "placeType": "ATTRACTION", "reviewListPage": {"reviews": [{"id": 757312269, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d501696-r757312269-The_Magic_Fountain-Barcelona_Catalonia.html", "text": "Amazing place must visit this magical fountain really enjoyed a lot it's really amazing give a big Thumbs up to this place", "publishedDate": "2020-06-13", "language": "en", "rating": 4}, {"id": 753496572, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d501696-r753496572-The_Magic_Fountain-Barcelona_Catalonia.html", "text": "I've been there first time with my parents when I was 10 and I loved it. it was like a fairy tale! Now it was good to be back.", "publishedDate": "2020-05-13", "language": "en", "rating": 5}, {"id": 753398293, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d501696-r753398293-The_Magic_Fountain-Barcelona_Catalonia.html", "text": "Barcelona is a beautiful city, and there's so many things to see that it's hard to choose. That being said, if you don't see this you'll regret it! Try to go in the sunset during summer months though, for you'll get to see this beautiful place without experiencing the scorching heat we did.", "publishedDate": "2020-05-09", "language": "en", "rating": 5}, {"id": 752826084, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d501696-r752826084-The_Magic_Fountain-Barcelona_Catalonia.html", "text": "My partner was very skeptical that I had scheduled time in our itinerary for a \"Magic Fountain,\" let alone the fact that I had us arrive over an hour before the show began to get a \"good seat.\"  We actually arrived several hours before the show and wandered the MNAC area at sunset, gorgeous views! Then we found a great seat and enjoyed chatting and watching the area fill as the show neared.  This is not your ordinary fountain, the lights and music truly make it a unique and free experience. If you are in Barcelona when the Fountain is active, take a few hours to slow down and enjoy this fountain! ", "publishedDate": "2020-04-22", "language": "en", "rating": 5}, {"id": 752462528, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d501696-r752462528-The_Magic_Fountain-Barcelona_Catalonia.html", "text": "Despite the fact that we didn't catch up the fountain live because we didn't know that the show was taking part certain hours the place is amazing and the whole area is really beautiful. ", "publishedDate": "2020-04-10", "language": "en", "rating": 5}, {"id": 752132835, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d501696-r752132835-The_Magic_Fountain-Barcelona_Catalonia.html", "text": "We stayed some years ago, when our sons are younger, and I remember they loved the lights and sound. This time, we came again to visit the Plaza de España e watch the font mágica. It was cold in the winter night, but is always interesting to see the show and listen the music. ", "publishedDate": "2020-04-01", "language": "en", "rating": 4}, {"id": 752043255, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d501696-r752043255-The_Magic_Fountain-Barcelona_Catalonia.html", "text": "Short walk from metro to fountain the fountain is up a hill it wasn't on but there is a nice view though you have to change metro to get there ", "publishedDate": "2020-03-30", "language": "en", "rating": 4}, {"id": 751953082, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d501696-r751953082-The_Magic_Fountain-Barcelona_Catalonia.html", "text": "A founain is really great! Little bit problematic to see because of many people around. But atmosphere is fantastic. The music, lights and a founains was transferred us to some different magic place for some time.", "publishedDate": "2020-03-28", "language": "en", "rating": 5}, {"id": 750819931, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d501696-r750819931-The_Magic_Fountain-Barcelona_Catalonia.html", "text": "Not as extravagant as the Bellagio or Burk Khalifa fountain shows, but a really lovely thing to do nonetheless. Do bear in mind though, if it’s windy, you will get wet. Possibly very wet. ", "publishedDate": "2020-03-14", "language": "en", "rating": 4}, {"id": 750733497, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d501696-r750733497-The_Magic_Fountain-Barcelona_Catalonia.html", "text": "The fountain show was impressive with the light, music and dancing waters. It was quite cold and windy so people sitting nearby or on the balcony got sprayed but it was fun. ", "publishedDate": "2020-03-13", "language": "en", "rating": 4}, {"id": 750509778, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d501696-r750509778-The_Magic_Fountain-Barcelona_Catalonia.html", "text": "We went in the evening for the water and light show.  It was WONDERFUL.  You must arrive 30-45 minutes early to ensure you find a place to view from.  ", "publishedDate": "2020-03-11", "language": "en", "rating": 5}, {"id": 749931979, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d501696-r749931979-The_Magic_Fountain-Barcelona_Catalonia.html", "text": "Really nice viewing and great to see. Was extremely busy and was no schedule etc to follow when a show started on finished. Not sure if it was just a continuous hour show or not. But was still great to see and very well put together. Be careful at the front might get a bit wet ", "publishedDate": "2020-03-08", "language": "en", "rating": 3}, {"id": 749353713, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d501696-r749353713-The_Magic_Fountain-Barcelona_Catalonia.html", "text": "This fountain was so beautiful. It was a great location to take pictures by. I went on a rainy day but it still came out great in pictures. Come early as it does get busy in the area and the fountain goes off at a certain time I think. ", "publishedDate": "2020-03-05", "language": "en", "rating": 4}, {"id": 748850410, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d501696-r748850410-The_Magic_Fountain-Barcelona_Catalonia.html", "text": "I feel this water magic fountain is beautiful, especially at night combined with LED lights that create the flow of water with all kinds of beautiful colors, I feel like watching a water magic show of a real magicians, it’s great that I came to this place.", "publishedDate": "2020-03-03", "language": "en", "rating": 5}, {"id": 748062705, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d501696-r748062705-The_Magic_Fountain-Barcelona_Catalonia.html", "text": "A long walk from the marine so dont recommend that. Get a bus or taxi. We went in the afternoon so no spectacular fountains, but nice to wander aroind and see the view. ", "publishedDate": "2020-02-27", "language": "en", "rating": 3}, {"id": 747259373, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d501696-r747259373-The_Magic_Fountain-Barcelona_Catalonia.html", "text": "Such a disappointment as the fountains not in operation The views from the top at dusk\nseeing the City were amazing. ", "publishedDate": "2020-02-23", "language": "en", "rating": 3}, {"id": 747211112, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d501696-r747211112-The_Magic_Fountain-Barcelona_Catalonia.html", "text": "Lots of little fountains with sculptures around the main fountain. Many street vendors, wild colourful birds flying in and around the trees", "publishedDate": "2020-02-23", "language": "en", "rating": 4}, {"id": 747105134, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d501696-r747105134-The_Magic_Fountain-Barcelona_Catalonia.html", "text": "Pictures of the Magic Fountain look stunning.  Sadly they were not working when we visited.  Very disappointed", "publishedDate": "2020-02-23", "language": "en", "rating": 1}, {"id": 747058550, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d501696-r747058550-The_Magic_Fountain-Barcelona_Catalonia.html", "text": "Very nice walk from Plaça d'Espanya to Museu Nacional d'Art de Catalunya. Highly recommended, even if the fountain is off.", "publishedDate": "2020-02-23", "language": "en", "rating": 4}, {"id": 746862481, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d501696-r746862481-The_Magic_Fountain-Barcelona_Catalonia.html", "text": "This area is very beautiful. This fountain is a fountain. \nNothing wrong with it, but it is, in fact....a fountain.\nChjeck it out of in the area...not worth a trip.", "publishedDate": "2020-02-22", "language": "en", "rating": 3}, {"id": 746723338, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d501696-r746723338-The_Magic_Fountain-Barcelona_Catalonia.html", "text": "I visited the fountain for the first time 9 years ago during my honeymoon. We came back and it is still magical, beautiful light and music show at night. We went on a weekday, arrived early, there was a private function nearby and the light show started 1 hour early. We were able to sit and see the show before people started to arrive and crowded the area.", "publishedDate": "2020-02-22", "language": "en", "rating": 5}, {"id": 746662286, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d501696-r746662286-The_Magic_Fountain-Barcelona_Catalonia.html", "text": "The location is amazing but the fountain was being painted when we visited so I could not give it a good rating.", "publishedDate": "2020-02-22", "language": "en", "rating": 3}, {"id": 746566949, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d501696-r746566949-The_Magic_Fountain-Barcelona_Catalonia.html", "text": "Nothing on line to tip people off and even the signs at the place informing of times not updated to notify not running or indeed when they expected back in operation. Very frustrating ", "publishedDate": "2020-02-21", "language": "en", "rating": 1}, {"id": 746175615, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d501696-r746175615-The_Magic_Fountain-Barcelona_Catalonia.html", "text": "Not working !! Under repair so was very disappointed with nothing to tell you online it wasn't operational ", "publishedDate": "2020-02-19", "language": "en", "rating": 1}, {"id": 745991734, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d501696-r745991734-The_Magic_Fountain-Barcelona_Catalonia.html", "text": "Beautiful picturesque fountain in the city. This is located in the downtown and a lot of people come to click pictures here.", "publishedDate": "2020-02-18", "language": "en", "rating": 4}, {"id": 745199812, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d501696-r745199812-The_Magic_Fountain-Barcelona_Catalonia.html", "text": "Impressive, large, spectacular with interesting repertoire of musical compositions. I love the singing fountains and this is one of the best. Of course it's not so grandiose and huge as I saw in Dubai, but definitely it's really awesome attraction in Barcelona.", "publishedDate": "2020-02-15", "language": "en", "rating": 5}, {"id": 745069821, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d501696-r745069821-The_Magic_Fountain-Barcelona_Catalonia.html", "text": "This is a great experience for both kids and adults.  We had our daughter with us so she loved seeing and listening to the music and water dancing.  Get their early to secure your spot.  The show doesnt take more then 15-20 minutes.  We went when there was a huge festival going on, so keep in mind that it might get very crowded.", "publishedDate": "2020-02-14", "language": "en", "rating": 5}, {"id": 744783872, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d501696-r744783872-The_Magic_Fountain-Barcelona_Catalonia.html", "text": "The Magic Fountain wasn't that magic, mind you it is one of the oldest. For a really magical exprience, I invite you to come and see the water show in Bucharest at Piata Unirii. Really spectacular, see photos!", "publishedDate": "2020-02-12", "language": "en", "rating": 3}, {"id": 744571531, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d501696-r744571531-The_Magic_Fountain-Barcelona_Catalonia.html", "text": "We really enjoyed the light show. It's free and if you get there a little earlier you'll get a good position. We discovered that if we stood too close to the fountain we got quite wet from the over spray. The show lasts for an hour, which is probably a little too long, but we did really enjoy it. ", "publishedDate": "2020-02-12", "language": "en", "rating": 4}, {"id": 744519869, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d501696-r744519869-The_Magic_Fountain-Barcelona_Catalonia.html", "text": "What a magic evening.  So worth the trip.  Absolutely beautiful experience.  Arrive early enough to be able to get a nice high seat on the stairs and just take it all in", "publishedDate": "2020-02-11", "language": "en", "rating": 5}, {"id": 744408419, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d501696-r744408419-The_Magic_Fountain-Barcelona_Catalonia.html", "text": "Very nice multimedia show with a very big fountain, lights and music. It is probably ideal if you travel with kids, whereas for adults it is surprising in the beginning, but might become a bit boring after a while. Make sure to check the schedules before you go though, they only run the show once per day, some days per week.", "publishedDate": "2020-02-11", "language": "en", "rating": 4}, {"id": 743397893, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d501696-r743397893-The_Magic_Fountain-Barcelona_Catalonia.html", "text": "During our stay we got really hot, we would have been younger I think we would have dared to bathe, it's clean and magic", "publishedDate": "2020-02-06", "language": "en", "rating": 5}, {"id": 742995107, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d501696-r742995107-The_Magic_Fountain-Barcelona_Catalonia.html", "text": "We travelled a couple of hours to see these and was disappointed, as they wasn’t working and were empty. \n\nNo signs or information telling you why \n\nMight be good when they are working ", "publishedDate": "2020-02-04", "language": "en", "rating": 1}, {"id": 742518952, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d501696-r742518952-The_Magic_Fountain-Barcelona_Catalonia.html", "text": "great pyretics and fireworks. despite the crowd and public event, organisers did great job. Very good experience overall ", "publishedDate": "2020-02-01", "language": "en", "rating": 5}, {"id": 742088501, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d501696-r742088501-The_Magic_Fountain-Barcelona_Catalonia.html", "text": "We have visited this place during city tour if Barcelona, this was nice to see this huge fountain with lights.", "publishedDate": "2020-01-30", "language": "en", "rating": 4}, {"id": 741614028, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d501696-r741614028-The_Magic_Fountain-Barcelona_Catalonia.html", "text": "Such a beautiful setting.  worth a wander through this area to see its beauty and setting.  Would recommend for a lovely walk!", "publishedDate": "2020-01-27", "language": "en", "rating": 5}, {"id": 741564714, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d501696-r741564714-The_Magic_Fountain-Barcelona_Catalonia.html", "text": "It’s an amazing display from the fountain and the various water features surrounding but it does get very crowded and had been made aware of that from reading various reviews. Because of the crowds we elected to sit outside the National Museum of Art of Catalonia looking down onto the main fountain and some of the other water features. The two main disadvantages were that the music to go with the show can only be heard nearer to the main fountain and we were bombarded with street sellers selling mainly bottles of water and soft drinks yet just behind us was a kiosk selling what the street sellers were selling plus other things. I can only assume that these street sellers are illegal and instead of enjoying the show was being constantly harassed by these sellers with no evidence of anyone policing them. We did see the first part of the show again the following night near the fountain where we could hear all the music clearly but was very crowded the other downfall is that we couldn’t see the display as well as we did on the previous night. ", "publishedDate": "2020-01-27", "language": "en", "rating": 4}, {"id": 740281952, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d501696-r740281952-The_Magic_Fountain-Barcelona_Catalonia.html", "text": "Very nice place to be, very crowded , very difficult to find a spot to sit or even stand. Almost an hour show,  I think 15 minutes would have been enough. But nice place to be.", "publishedDate": "2020-01-20", "language": "en", "rating": 5}, {"id": 739996218, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d501696-r739996218-The_Magic_Fountain-Barcelona_Catalonia.html", "text": "Got to the steps at 7 and was already very busy but got a good view and when the fountains started and Freddy Mercury’s ‘ Barcelona’ struck up it was magical.To see the colours and the power of the fountain was awesome.Would definitely recommend. ", "publishedDate": "2020-01-19", "language": "en", "rating": 5}, {"id": 739178138, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d501696-r739178138-The_Magic_Fountain-Barcelona_Catalonia.html", "text": "With one of the few things that’s free in Barcelona, magic fountain is lined by both kids and the adults. To get suitable place to watch, reach at least 1.5 hours before the time. The seatings provided are ideal place and make sure that you avoid places very near to fountain unless you enjoy soaking in the water. With lot of lights, varying water formations and songs it certainly charms the kids and adults alike. But we did not feel any coordinated rhythm between the fountains and songs. They were quite independent of each other. In all, it’s a nice place to be with kids.", "publishedDate": "2020-01-14", "language": "en", "rating": 3}, {"id": 738962317, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d501696-r738962317-The_Magic_Fountain-Barcelona_Catalonia.html", "text": "In front of the Catalunya museum, there is a magnificent Magic Fountain sitting inside the Plaça Marques De Foronda. This giant fountain has 3620 water jets within its 3.1 million litre pool. Each of its fountain show lasts 20 minutes and it runs every 10 mins. Its opening times are as follow:\nFrom now to 28th Feb 2020: Closed\nMarch 2020: 20:00 - 21:00 (Thu-Sat)\nApr-May 2020: 21:00 to 22:00 (Thu-Sat)\nJun-Sep 2020: 21:30 to 22:30 (Wed-Sun)\nOct 2020: 21:30 to 22:30 (Wed-Sun)\nUnfortunately, we were caught in the torrential downpour when we arrived at the Magic Fountain so we couldn't really enjoy our time there, but it still couldn't hide our admirations to this grand and impressive fountain and Placa. This is one of the most visited spots for the locals and it's free! We will definitely come back one day!\nTip: Don't get too close to the fountain during the show otherwise you might get wet!", "publishedDate": "2020-01-13", "language": "en", "rating": 4}, {"id": 738944700, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d501696-r738944700-The_Magic_Fountain-Barcelona_Catalonia.html", "text": "The show is very beautiful, so it attracts cents of people there. It can be viewed from some distance and it's really eye-catching. To cheer the public, the dancing waters in different colours is complemented by a playlist of nice pop/rock music and some traditional songs, according to festive dates. The surrounding area has a lack of structure, such as restaurant, cafe or bathroom. The alternative is Arenas shopping mall, about 500 m away. Its recommendable to arrive one hour before.", "publishedDate": "2020-01-13", "language": "en", "rating": 4}, {"id": 738718697, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d501696-r738718697-The_Magic_Fountain-Barcelona_Catalonia.html", "text": "Loved the fountain. Lots of people geather around it to watch the show even in winter time. It starts around 8 pm, depends on a season.", "publishedDate": "2020-01-12", "language": "en", "rating": 5}, {"id": 738146549, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d501696-r738146549-The_Magic_Fountain-Barcelona_Catalonia.html", "text": "Part of the light and sound show on certain evenings.  Worth going to see it.  It is quite magical.  For those who have been to Las Vegas, it reminded me what they do at the Bellagio Hotel.", "publishedDate": "2020-01-09", "language": "en", "rating": 5}, {"id": 738114164, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d501696-r738114164-The_Magic_Fountain-Barcelona_Catalonia.html", "text": "This is one of the best attarction of Barcelona. The fountain is huge. The light and sound show is extra ordinary. However it only works 3 days a week - Thursday to Staurday. Check the website for the fountain for schedule - before planning your visit. We visited from Sunday to Wednesday and got lucky on Tuesday - since it was the newyears eve - they had a special show. There is also a massive fireworks display around this fountain starting around midnight to celebrate the New Year. It is extremely crowded and securing a standing / seating place 3 hours in advance is recomended.", "publishedDate": "2020-01-09", "language": "en", "rating": 5}, {"id": 738093274, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d501696-r738093274-The_Magic_Fountain-Barcelona_Catalonia.html", "text": "It was a mystical & magical entertainment at the National arts museum, watching the huge magical fountain. It is a free visual treat to all for 30 minutes on select days of a week. Check for the days of performance before going, as the schedule changes to the season. The whole road from the magical fountain to Placa Espaniya is magnificent visual treat with fountains & colonial buildings flanged on either sides throughout the stretch.", "publishedDate": "2020-01-09", "language": "en", "rating": 5}, {"id": 737688988, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d501696-r737688988-The_Magic_Fountain-Barcelona_Catalonia.html", "text": "The beautiful show - water , color , music. Try to see it while in Barcelona. Make sure you know the schedule in advance.", "publishedDate": "2020-01-07", "language": "en", "rating": 5}, {"id": 737572019, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d501696-r737572019-The_Magic_Fountain-Barcelona_Catalonia.html", "text": "Placa d'Espanya is a great place to relax. Arenas de Barcelona is ok. Simply stroll and enjoy the view", "publishedDate": "2020-01-07", "language": "en", "rating": 4}, {"id": 737400531, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d501696-r737400531-The_Magic_Fountain-Barcelona_Catalonia.html", "text": "The palace and the fountain are wonders to see even when the waters are not dancing to music. But it is worth hanging out to see the show (when we were in Barcelona, it was 8-9:00 on Thursday and Friday nights only). It was crowded, but we stood on the walking bridge so that we had a wide angle perspective of all the different fountains that were flowing. It was fun.\n\nNOTE: We grabbed a bite on the roof at the Arenas de Barcelona (just down the street) while we waited for showtime. It is a shopping mall created in an old bull fighting ring. A fun spectacle in itself, but also terrific views from the roof. ", "publishedDate": "2020-01-06", "language": "en", "rating": 5}, {"id": 737362520, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d501696-r737362520-The_Magic_Fountain-Barcelona_Catalonia.html", "text": "I took our teenagers to see The Magic Fountain and it was heaps of fun and free. Basically it is a water, light and sound show free for everyone to enjoy. The music selection is wide and covers most languages and styles. We enjoyed some songs in English, Spanish and Italian Operettas. The fountain display changes with the music, so you see lots of different colours and combinations of water fountains. Visiting it at night was a short walk for us and we got a great spot looking up to the Museum. We tried to visited the museum today but it was shut so spent some time walking around the area. The fountain looks different in the day and it seems bigger in daylight. There were families, couples everywhere. ", "publishedDate": "2020-01-06", "language": "en", "rating": 5}, {"id": 737347576, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d501696-r737347576-The_Magic_Fountain-Barcelona_Catalonia.html", "text": "It was a magical moment when I reached there and got mesmerised by the dance I got water with a beautiful melody and this was it a great night with a fabulous display and music 🎶 ", "publishedDate": "2020-01-06", "language": "en", "rating": 5}, {"id": 737327732, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d501696-r737327732-The_Magic_Fountain-Barcelona_Catalonia.html", "text": "Magical fountain is really good but make sure to check the timing and day of display in advance. It changes from summers to winters and from day of the week to weekend. Do go there in plenty of time to get good view. ", "publishedDate": "2020-01-06", "language": "en", "rating": 5}, {"id": 737281382, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d501696-r737281382-The_Magic_Fountain-Barcelona_Catalonia.html", "text": "Worth a visit, despite the crowds that come to this spectacle in the evening. To see the fountains glowing and splashing, the music in the background, a great experience that, despite the large number of people, is worth a visit and a great start for an evening in Barcelona.\nCome in time to get a good spot.", "publishedDate": "2020-01-06", "language": "en", "rating": 4}, {"id": 737049634, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d501696-r737049634-The_Magic_Fountain-Barcelona_Catalonia.html", "text": "It was absolutely beautiful!!! We were there for the new years celebrations and it was truly spectacular!", "publishedDate": "2020-01-05", "language": "en", "rating": 5}, {"id": 736893871, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d501696-r736893871-The_Magic_Fountain-Barcelona_Catalonia.html", "text": "They had a nice light show by new years eve. They had good security too. Nice place to see for once and to be there", "publishedDate": "2020-01-04", "language": "en", "rating": 5}, {"id": 736532137, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d501696-r736532137-The_Magic_Fountain-Barcelona_Catalonia.html", "text": "There is nothing magical about it. Yes the synchronization and the music are good but there stops the story. There are not enough seating arrangements to watch the show and people sit wherever possible. Hawkers and street vendors throng the place and are an obstacle at times. I found Hyderabad and Mysore's (India) musical fountain much better than this. Only plus for this show is that there is no entrance fee.", "publishedDate": "2020-01-03", "language": "en", "rating": 3}, {"id": 736038152, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d501696-r736038152-The_Magic_Fountain-Barcelona_Catalonia.html", "text": "Very special fountain. We liked the evening show a lot. Amazing. At daytime it does not look so good, however, worth visiting.", "publishedDate": "2020-01-01", "language": "en", "rating": 4}, {"id": 735981373, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d501696-r735981373-The_Magic_Fountain-Barcelona_Catalonia.html", "text": "Celebrating 90 years of water fountains!! Simply beautiful!! The fountain is huge and located at the centre of the Spanish square.  It has other small fountains all over as a frame of beauty!!!", "publishedDate": "2019-12-31", "language": "en", "rating": 5}, {"id": 735973318, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d501696-r735973318-The_Magic_Fountain-Barcelona_Catalonia.html", "text": "Very, very good and for free! It was busy but not as bad as I had expected but it was December so I expect in the summer months it will be busier. We stood on the steps, depending on the way the wind is blowing you may get a little spray from the water, well worth watching", "publishedDate": "2019-12-31", "language": "en", "rating": 5}, {"id": 735955657, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d501696-r735955657-The_Magic_Fountain-Barcelona_Catalonia.html", "text": "We rode Metro Line 1 to Placa de Espanya. What a busy place in evening traffic! We walked to the Font Magica de Montjuic and having arrived early, found seats directly in front of the fountain. A group of young men put on a dance show as we waited and passed their hats for donations. Gradually the fountain began to send up sprays of water and the lights came on as a delightful show set to music – rock for the first part and classical for the second part – began. It was fun to watch the changing patterns of water, light, and music, and we enjoyed being out among families and tourists alike on a beautiful autumn night. We left before the show ended, hoping to beat the crowds on the Metro, and enjoyed strolling along the fountain-lined avenue leading back to Placa de Espanya and seeing the lighted Arenas de Barcelona, which once served as a bullfighting arena but is now filled with shops and restaurants.", "publishedDate": "2019-12-31", "language": "en", "rating": 5}, {"id": 735893235, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d501696-r735893235-The_Magic_Fountain-Barcelona_Catalonia.html", "text": "The magical fountain started right on time with very beautiful water works and colors. The synchronization was brilliant and also the mini fountains in the background made it even more special. The songs played were also mainstream so it was fun to sing along. I would definitely recommend it for a visit. It might look overcrowded as it was my first impression while we were walking towards the fountain but then the fountain area is massive so it is visible from quite a distance. I would suggest to go maybe  half hour early and get the good places behind the fountain. ", "publishedDate": "2019-12-31", "language": "en", "rating": 4}, {"id": 735475529, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d501696-r735475529-The_Magic_Fountain-Barcelona_Catalonia.html", "text": "I had heard about this Magic Fountain, and made sure not to miss it. Best to google the show times; they vary a bit per month, and no shows in Jan-Feb as far as I know. I went in Sept and made sure I was in the area at the top part (The museum side) at around 9. First, they switch on the cascades that come from the stately buildings of the Museo Nacional which is already a sight to behold, and then at 9.30 the Fountain started. Amazing show, many locals seem to enjoy it too. BEWARE however, of the drink vendors; they may sell you dodgy stuff in the dark (I was told this by a tour guide). Bring your own water bottle! Also, beware of your belongings; Barelcona has pickpockers in these busy locations where there are many distarcted people! Overall, felt very safe on my own though. You really do not need a ticket or a tour to do this, the event itself is free, and it's easy to get to.\nThe show runs for an hour but after 35 minutes I was happy, and wanted to leave before the big rush at the end. Keep heading down the stairs and you will easily find transport/taxis at the bottom at Av Reina Maria Christina. You cannot miss this spectacle!", "publishedDate": "2019-12-29", "language": "en", "rating": 5}, {"id": 735417791, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d501696-r735417791-The_Magic_Fountain-Barcelona_Catalonia.html", "text": "I was there today, but the spectacles are only 31 december, 1 st and 2 nd january, so if you wanna see the lighted fountain go in these days. But the view from the top place is the best you can see at night, just amazing.", "publishedDate": "2019-12-29", "language": "en", "rating": 3}, {"id": 735414388, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d501696-r735414388-The_Magic_Fountain-Barcelona_Catalonia.html", "text": "A popular show of a colourful fountain display to music. Also ensure you take the escalator up toward the house for a spectacular view.", "publishedDate": "2019-12-29", "language": "en", "rating": 5}, {"id": 735408736, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d501696-r735408736-The_Magic_Fountain-Barcelona_Catalonia.html", "text": "We visited the fountain in the morning, however, we were not amazed, except children liked to have some fun with the water. We decided to visit it next time in the evening, because we heard good reviews that it is worth visiting. We were amazed with the show, lights, music.", "publishedDate": "2019-12-29", "language": "en", "rating": 5}, {"id": 735334893, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d501696-r735334893-The_Magic_Fountain-Barcelona_Catalonia.html", "text": "Don't come here I the day it's not on. I gave it 3 stars not 1 because I've see videos and photos and they look good. Would recommend but at night\n", "publishedDate": "2019-12-29", "language": "en", "rating": 3}, {"id": 735109952, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d501696-r735109952-The_Magic_Fountain-Barcelona_Catalonia.html", "text": "The \"show\" is 30 minute long, but nothing really changes along the time. \n\nThe songs from the 80s are fun, with average quality ", "publishedDate": "2019-12-28", "language": "en", "rating": 4}, {"id": 735103968, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d501696-r735103968-The_Magic_Fountain-Barcelona_Catalonia.html", "text": "Amazing free display that played after 9pm on the Friday we were there in October but check the web for more details, the area around the fountains was very busy so we stayed back and watched the hypnotic colours and enjoyed the music from a distance , well recommended.", "publishedDate": "2019-12-28", "language": "en", "rating": 5}, {"id": 735075611, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d501696-r735075611-The_Magic_Fountain-Barcelona_Catalonia.html", "text": "This is an awesome place to go at night. You just have to get there early to get a very good seat. We have seen the dancing waters down in Longwood outside of Philadelphia but this is much better. You go up on the steps you can get a very good view.", "publishedDate": "2019-12-28", "language": "en", "rating": 5}, {"id": 734904295, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d501696-r734904295-The_Magic_Fountain-Barcelona_Catalonia.html", "text": "Having made an effort to visit this fountain due to it being advertised that music would play with the water movement I have to say we were a little disappointed. Every piece of music played the fountain had the same lighting and colours.  Glad I saw it but wouldn’t do it again", "publishedDate": "2019-12-27", "language": "en", "rating": 3}, {"id": 734790613, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d501696-r734790613-The_Magic_Fountain-Barcelona_Catalonia.html", "text": "Definitely a fun experience with beautiful lights water and music. Crowds are large. Definitely worth a nighttime visit and glad I went but I wouldn’t say it’s five star spectacular. ", "publishedDate": "2019-12-26", "language": "en", "rating": 4}, {"id": 734725143, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d501696-r734725143-The_Magic_Fountain-Barcelona_Catalonia.html", "text": "It's nice , splashy and musically but kitchy somehow , go there only if you've time , not a pure must.", "publishedDate": "2019-12-26", "language": "en", "rating": 3}, {"id": 734608757, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d501696-r734608757-The_Magic_Fountain-Barcelona_Catalonia.html", "text": "We got the metro to the watch the magic fountains. It was easy to find and a nice experience. Very pretty to watch the water flow from the top right the way down. It was a good experience and if you haven’t been to Las Vegas I could imagine it would be quite a spectacular thing to see. Unfortunately having been to Las Vegas and seeing the Bellagio fountains play to music this was a little disappointing but I’m reviewing it as if I hadn’t been to Las Vegas but at the same time if you have and you have limited time in Barcelona and are choosing between doing this or something else I’d probably choose the something else.", "publishedDate": "2019-12-25", "language": "en", "rating": 4}, {"id": 734223866, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d501696-r734223866-The_Magic_Fountain-Barcelona_Catalonia.html", "text": "The Magic Fountain is closely to Plaza De Espana on one sight, and Monjuic and Museum to another side. The experience of fountain is free of charge. ", "publishedDate": "2019-12-22", "language": "en", "rating": 5}, {"id": 733551814, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d501696-r733551814-The_Magic_Fountain-Barcelona_Catalonia.html", "text": "Just a wonderful acoustic and visual experience. Don't be put off by the illegal booze sellers....if you don't want a drink just tell them to walk on!", "publishedDate": "2019-12-19", "language": "en", "rating": 5}, {"id": 733470091, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d501696-r733470091-The_Magic_Fountain-Barcelona_Catalonia.html", "text": "We checked the website and also asked at the tourist information centre and was told 8pm to 9pm for the fountain. \nWe arrived 7:45 the place in darkness and very few people around, just like us a few tourists hoping it would be worth braving the cold night. \nUnfortunately it was all a waste of time, there was no show no signs anywhere to tell us one way or another what was going on and after nearly a hour we gave up along with the others a left!\nNeed more and better information on when and if the show is happening and some signs at the location too.\nLeft disappointed and I don't think I would try again.", "publishedDate": "2019-12-18", "language": "en", "rating": 1}, {"id": 733173373, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d501696-r733173373-The_Magic_Fountain-Barcelona_Catalonia.html", "text": "After experiencing the musical fountain in Hanoi, which was amazing, this magic fountain in Barcelona, came a bit on the down side fr me. Do not mis-understand me, it is nice but not beyond it. the magic fountain was not sophicticated and music responsive as I expected.  played music was American, English and Arabic. Not one piece in Spanish, strange I must admit.", "publishedDate": "2019-12-16", "language": "en", "rating": 3}, {"id": 733087659, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d501696-r733087659-The_Magic_Fountain-Barcelona_Catalonia.html", "text": "It's a very nice light show with good music. At night it plays every half hour. It's a sort of wonderful magical feeling you get when seeing it up close. Would definitely recommend seeing it if you're in Barcelona. Only downside is that everyone and i mean everyone will want to see it too. So lotsa tourists ( yourself included ). But do go!", "publishedDate": "2019-12-16", "language": "en", "rating": 4}, {"id": 732900601, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d501696-r732900601-The_Magic_Fountain-Barcelona_Catalonia.html", "text": "Yes it is a big beautiful fountain BUT it is till just a fountain like many many others in the world. It is a big draw so expect a crowd for the night “show”. I honestly enjoyed it more in the afternoon with no one there much better. ", "publishedDate": "2019-12-15", "language": "en", "rating": 3}, {"id": 732887790, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d501696-r732887790-The_Magic_Fountain-Barcelona_Catalonia.html", "text": "Very nice Light & Music show by the Magic Fountain. Go early to choose a good view of the fountain...", "publishedDate": "2019-12-15", "language": "en", "rating": 4}, {"id": 732462413, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d501696-r732462413-The_Magic_Fountain-Barcelona_Catalonia.html", "text": "did it last night beautiful light and water show,even though it was a cold night but a lot of people nice atmosphere quite magical", "publishedDate": "2019-12-13", "language": "en", "rating": 4}, {"id": 732353435, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d501696-r732353435-The_Magic_Fountain-Barcelona_Catalonia.html", "text": "We didn't know what to expect from the magic fountain, but it was so beautiful and relaxing. An experience of a lifetime. We didn't even know of it until we went for a walk in the evening and seen huge crowds gather around, so we waited for roughly an hour before the show started and got a great spot as well, right in front of the fountain.\nWould highly recommend it if visiting Barcelona.", "publishedDate": "2019-12-12", "language": "en", "rating": 5}, {"id": 732263422, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d501696-r732263422-The_Magic_Fountain-Barcelona_Catalonia.html", "text": "This is one of many attractions that were built in the Montjuic area for the 1929 Barcelona International Exposition.  This fountain is impressive not only for its size but also for the numerous and varied water fountain patterns and water shows that it performs.  There are over 3000 water jets, and the streams of water can blast to heights of over 170 feet.  There are numerous youtube videos of the free nighttime water fountain shows online.  This fountain is nearly 100 years old, so the innovative fountain shows are even more impressive when you realize that the fountain was designed before computers were invented.  ", "publishedDate": "2019-12-12", "language": "en", "rating": 4}, {"id": 732010037, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d501696-r732010037-The_Magic_Fountain-Barcelona_Catalonia.html", "text": "This was so beautiful! It does get very crowded and people arrive quite early to get in a good position and there are a few good places to sit on the wall opposite so people took them early so I’d recommend grabbing a some food or drink and getting a good view. The fountain was really spectacular. We got the subway and walked from there and was so easy. You’d be gutted if you missed it!", "publishedDate": "2019-12-11", "language": "en", "rating": 5}, {"id": 731921732, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d501696-r731921732-The_Magic_Fountain-Barcelona_Catalonia.html", "text": "Don't miss this orientation of music and lights at the fountain! Very beautiful. Arrive early to get a good viewing location. The grounds are scenic and it makes for a great evening out! ", "publishedDate": "2019-12-10", "language": "en", "rating": 5}, {"id": 731827701, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d501696-r731827701-The_Magic_Fountain-Barcelona_Catalonia.html", "text": "The fountains themselves are spectacular. I am really happy we visited. The light and music show was short, sweet, and superb, but, oh my, the number of people to see this spectacle is HUGE! It was hard to find a spot, impossible to be nowhere without being squished or pushed, but worth it. The show is 30 minutes long. We showed up 15 minutes before it started, and it was already packed, no way we could get close to it, but still, we saw it no problem. We left 10 minutes before it finished, since I just didn't want to deal with the amount of people trying to leave at the same time.", "publishedDate": "2019-12-10", "language": "en", "rating": 4}, {"id": 731424195, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d501696-r731424195-The_Magic_Fountain-Barcelona_Catalonia.html", "text": "A nice location with beautiful displays. Make sure to arrive at least an hour early to get a decent spot to see the fountain show. The displays are varied and stunning. It’s right by a metro station and the MNAC museum is at the top of the hill so you can make a day of it", "publishedDate": "2019-12-08", "language": "en", "rating": 5}, {"id": 731345194, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d501696-r731345194-The_Magic_Fountain-Barcelona_Catalonia.html", "text": "A fountain show to rival Las Vegas. What an amazing show. Music for all ages and lights. The show was wonderful. I would definitely recommend. For free it was a fantastic show. Just make sure you check the times. ", "publishedDate": "2019-12-08", "language": "en", "rating": 5}, {"id": 731241256, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d501696-r731241256-The_Magic_Fountain-Barcelona_Catalonia.html", "text": "Absolutely enchanting fountain in the middle of Barcelona.\nWith the sun shining ,  the fountain  beauty shone bright......amazing and tranquil.", "publishedDate": "2019-12-07", "language": "en", "rating": 4}, {"id": 731041830, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d501696-r731041830-The_Magic_Fountain-Barcelona_Catalonia.html", "text": "The fountain was one of my favorite things that we did in Barcelona on our trip. Truly a spectacular display of colour, light, motion, music and water acrobatics!!! It’s very famous and if you are planning to see it, you’ll be among the crowds but it only adds the magic in my opinion. The first performance of the fountain was on May 19, 1929. Now the show is scheduled several times a week at certain hours (check it online) and so worth the visit! We came with a local and she said she’s never seen the show before (apparently most of the locals don’t come to see this touristic thing unless they are forced to show it to the guests or bring kids). I think we all were beyond impressed and very happy that we managed to do it. It really wowed us! Must see! ", "publishedDate": "2019-12-06", "language": "en", "rating": 5}, {"id": 730880205, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d501696-r730880205-The_Magic_Fountain-Barcelona_Catalonia.html", "text": "This was an awesome night time attraction that I could not recommend more. We went on a Saturday night and the area was full with several thousand people. We were treated town awesome fountain and light show. To make it even better it was free. The pictures were some of the best of our trip. The whole area all the way down to the Placa Espanya was lit up and beautiful. The accompanying music made the show even better. The best fountain show I have ever seen.", "publishedDate": "2019-12-05", "language": "en", "rating": 5}, {"id": 730476702, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d501696-r730476702-The_Magic_Fountain-Barcelona_Catalonia.html", "text": "A wonderful fountain that fits so nicely with the museum behind it. We have been there during the night but should worth it. ", "publishedDate": "2019-12-03", "language": "en", "rating": 5}, {"id": 730390409, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d501696-r730390409-The_Magic_Fountain-Barcelona_Catalonia.html", "text": "One of the places you should definitely visit. The show was amazing and its free. It does get fairly busy so arrive in plenty of time.", "publishedDate": "2019-12-03", "language": "en", "rating": 5}, {"id": 730299515, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d501696-r730299515-The_Magic_Fountain-Barcelona_Catalonia.html", "text": "The setting is beautiful. But if you're choosing between seeing a show or going to this, pic the theater. It's pretty and the music coordination is fun, I just didn't think it was as spectacular as the other reviews I read. Don't get me wont, you'll enjoy it just fine. I'm just rating this average. As a side note, I read to get here early to get a good spot, but I showed up 10 mins late in Nov 2019 and I could see it perfectly well. It may be much busier in the summer, but that was my experience the winter. Enjoy!! ", "publishedDate": "2019-12-02", "language": "en", "rating": 3}, {"id": 729723948, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d501696-r729723948-The_Magic_Fountain-Barcelona_Catalonia.html", "text": "Go early to get a seat, it just kept going. covers all music tastes and endless combinations of fountains misting and colours. ", "publishedDate": "2019-11-29", "language": "en", "rating": 5}, {"id": 729300962, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d501696-r729300962-The_Magic_Fountain-Barcelona_Catalonia.html", "text": "Beautiful evening watching the fountains and lights dancing to music. Wandered around the grounds to watch the fountains from different levels. Would go again", "publishedDate": "2019-11-27", "language": "en", "rating": 5}, {"id": 728938759, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d501696-r728938759-The_Magic_Fountain-Barcelona_Catalonia.html", "text": "Colored-lights shine on the fountain that dances with music. Lots of couples, families, and groups of all ages will be out enjoying the show. ", "publishedDate": "2019-11-25", "language": "en", "rating": 5}, {"id": 728935885, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d501696-r728935885-The_Magic_Fountain-Barcelona_Catalonia.html", "text": "These fountains are huge and in a prominent area in front of a big museum up the hill and also at a big crossroads where the metro is provided.  Lovely spot.", "publishedDate": "2019-11-25", "language": "en", "rating": 5}, {"id": 728843910, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d501696-r728843910-The_Magic_Fountain-Barcelona_Catalonia.html", "text": "Magic Fountain show, so beautiful right in front of the State Capital. Music, mainly American pop through the ages, and colored lights on the fountains! The water is jetted up into the air so high and gorgeous. Just pay attention to the wind because you could get wet closer to the fountains. We sat on the wall on the bridge and had a perfect view...so romantic", "publishedDate": "2019-11-25", "language": "en", "rating": 5}, {"id": 728615394, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d501696-r728615394-The_Magic_Fountain-Barcelona_Catalonia.html", "text": "Very nisce fountain located in a lovely area. It attracts the sights of the visitors and it is really beautiful!", "publishedDate": "2019-11-24", "language": "en", "rating": 4}, {"id": 728384492, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d501696-r728384492-The_Magic_Fountain-Barcelona_Catalonia.html", "text": "Wonderful colours and spectacular for about 5 minutes and then there isnt really any change for rest of the 20 minute show other than a change in music.\nThe fountains dont change in tempo with music so once you've seen it for a little while it's done.", "publishedDate": "2019-11-23", "language": "en", "rating": 4}, {"id": 728222041, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d501696-r728222041-The_Magic_Fountain-Barcelona_Catalonia.html", "text": "Beats the Bellagio fountain in Las Vegas. With the music, lights, theatrics and fanfare, you can view this for hours on a nice day. Great venue for photos. ", "publishedDate": "2019-11-22", "language": "en", "rating": 5}, {"id": 728044302, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d501696-r728044302-The_Magic_Fountain-Barcelona_Catalonia.html", "text": "Pretty good.  It's a long show if you get there early.  The seats on the stairs get taken right away.  There are vendors selling some beer so that helps the enjoyment level.", "publishedDate": "2019-11-21", "language": "en", "rating": 4}, {"id": 728036991, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d501696-r728036991-The_Magic_Fountain-Barcelona_Catalonia.html", "text": "This is one of the things that you need to see in Barcelona. So whenever you are planning a trip to Barcelona make sure that your days are going to match with the days that the fountains are on. Because it's not every day. Also, it is a place that you need to arrive early to get a good spot because it gets really busy. ", "publishedDate": "2019-11-21", "language": "en", "rating": 5}, {"id": 727787212, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d501696-r727787212-The_Magic_Fountain-Barcelona_Catalonia.html", "text": "The water feature show to light and music starts at 8pm. If you already in the area then stroll by but don't make a special trip. Feels like needs revamping. Interesting was the local talent busking on the sidewalk.", "publishedDate": "2019-11-20", "language": "en", "rating": 2}, {"id": 727645611, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d501696-r727645611-The_Magic_Fountain-Barcelona_Catalonia.html", "text": "I’m sure this was exciting when it was first introduced in the 1920s...but - snoozeville tourist trap now.", "publishedDate": "2019-11-19", "language": "en", "rating": 2}, {"id": 727612623, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d501696-r727612623-The_Magic_Fountain-Barcelona_Catalonia.html", "text": "While exploring Montjuic one afternoon, we found out that the Magic Fountain light show happens every Thursday, Friday, and Saturday at 8:00pm. We ended up watching the sunset up there then went down the street to grab a drink and snack to eat. Headed back up for the light show, which is comprised of different colors and popular pop music to go with the dancing water fountains. Streams reached higher than I expected, not quite Bellagio (Las Vegas), but still a nice sight to see. The show is about an hour long--much longer than I expected. We ended up leaving about halfway through to beat the crowds. Yes, there are a LOT of people watching, so make sure to secure your seat on the steps or along the bridge for a good view! Be careful not sitting too close, you will get wet!!", "publishedDate": "2019-11-19", "language": "en", "rating": 4}, {"id": 727478504, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d501696-r727478504-The_Magic_Fountain-Barcelona_Catalonia.html", "text": "While you are touring the city go by and see these beautiful fountains. I believe they might have a show on Friday and Saturday nights. Very nice", "publishedDate": "2019-11-19", "language": "en", "rating": 4}, {"id": 727474109, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d501696-r727474109-The_Magic_Fountain-Barcelona_Catalonia.html", "text": "Wrap up warm if you are going late in the year we were here in November and arrived early to get a seat on the steps.  You really need something to sit on and the steps are very cold.  If you can stand easily then you get a great view from the bridge in front of the fountain.  Would recommend a visit if you are in Barcelona its worth it.  ", "publishedDate": "2019-11-19", "language": "en", "rating": 5}, {"id": 727420760, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d501696-r727420760-The_Magic_Fountain-Barcelona_Catalonia.html", "text": "The area is very pretty and right in front of the art museum. However,the day we went, the fountain was not on/functioning.", "publishedDate": "2019-11-18", "language": "en", "rating": 3}, {"id": 727308983, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d501696-r727308983-The_Magic_Fountain-Barcelona_Catalonia.html", "text": "The architecture, the fountains, the views, the grandeur of the whole area are beyond description. A must see for any tourist!", "publishedDate": "2019-11-18", "language": "en", "rating": 5}, {"id": 727025102, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d501696-r727025102-The_Magic_Fountain-Barcelona_Catalonia.html", "text": "I'd love to say we were out for a stroll in the evening and found this, but the truth is you have to plan it. In winter, it only happens on Thursdays to Saturdays, at 10pm.\nThe area around the fountain was packed. We stood back on a pedestrian bridge a few dozen metres back. It was still spectacular, but we did have to strain slightly to hear the music; on the other hand, we didn't get wet. Even so, I'd suggest trying to get closer.\nThe display started (by my watch) a few minutes early, so worth getting there an extra couple of minutes early. And mind out for the street vendors.\nThe display is fascinating and the atmosphere is great. That said, it wore a little thin after 15 minutes, so we wandered around the group, then back down to the Placa Espanya, which is a gentle walk in the evening, with little fountains down each side.", "publishedDate": "2019-11-17", "language": "en", "rating": 4}, {"id": 726886219, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d501696-r726886219-The_Magic_Fountain-Barcelona_Catalonia.html", "text": "Magnifique spectacle et gratuit! À voir en prenant des trucs à grignoter \n\nBeautiful ! You should be bring some food with you while enjoying the show ! ", "publishedDate": "2019-11-16", "language": "en", "rating": 5}, {"id": 726652094, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d501696-r726652094-The_Magic_Fountain-Barcelona_Catalonia.html", "text": "Definitely a nice touch after a great meal the different colors and the fresh clean smell of the water shooting in the air is very romantic in itself and fun to watch.", "publishedDate": "2019-11-15", "language": "en", "rating": 5}, {"id": 726468046, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d501696-r726468046-The_Magic_Fountain-Barcelona_Catalonia.html", "text": "The Magic Fountain was such a beautiful fountain, with lights to music. There is plenty of room for the crowds that come. Street vendors and musicians are along the avenue in front during the show", "publishedDate": "2019-11-14", "language": "en", "rating": 5}, {"id": 726447211, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d501696-r726447211-The_Magic_Fountain-Barcelona_Catalonia.html", "text": "This is a very popular spot both for the locals and tourists visiting the city. Depending on the time of day you get here it can be very busy. Great for selfie and/or group photos. Beware of the pick pockets as these criminal love to work the crowds when you are not paying attention to what is going on around you. A must see if you have the time as there is alot to do in this internationally known city.", "publishedDate": "2019-11-14", "language": "en", "rating": 4}, {"id": 726446152, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d501696-r726446152-The_Magic_Fountain-Barcelona_Catalonia.html", "text": "Very relaxing place. Good point to visit Montjic park and other places around... Best to visit in good weather conditions. ", "publishedDate": "2019-11-14", "language": "en", "rating": 5}, {"id": 726419094, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d501696-r726419094-The_Magic_Fountain-Barcelona_Catalonia.html", "text": "Amazing coloured fountain display set to music - free event so does get very busy, but well worth it, especially on a hot summer's night as the spray of the fountains cools you down!  Runs every night during the summer Wednesday to Sunday at 9pm I think.", "publishedDate": "2019-11-14", "language": "en", "rating": 5}, {"id": 726357380, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d501696-r726357380-The_Magic_Fountain-Barcelona_Catalonia.html", "text": "We just happened to be in the neighborhood and there it was all lit up. Lots of visitors but it was just a lovely sight to see. It would be very nice paired with an evening meal close by.", "publishedDate": "2019-11-14", "language": "en", "rating": 4}, {"id": 726296747, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d501696-r726296747-The_Magic_Fountain-Barcelona_Catalonia.html", "text": "What I love about Barcelona is that its sights run from the sublime, like Sagrada Familia, to the kinda smarmy.  The Fountain is on the smarmy end of the spectrum but great for teenagers and younger kids.  Major crowds.  We arrived by subway.  Two guys acting drunk walked DOWN the UP escalator until they got to us.  Then they turned around, right next to us, one by my wife and one by me. I hear velcro rip, realize the guy by me is trying to open my pants cargo pockets.  I carry nothing in my cargo pockets!  Anything of value is in a neck pouch, under my shirt.  Anyway, I yell at the guy and my wife figures out what's going on and she starts pounding the guy next to her on the back, yelling, \"BAD MAN! BAD MAN!, BAD, BAD, BAD MAN!!!\"  People around us start yelling, too, in Calatan, Spanish, French, German.  It was like a freaking tower of Babel.  Escalator is still moving, mind you. Gets us to  a landing and then, flying around a corner, comes a cop with a leashed but growling and barking german shepherd. Both of the cop and the dog are acting like they're on speed, eyes darting around looking for a culprit.  Two nice guys above us on the escalator grab the guy next to my wife and hold him for the cop.  The dog is still going wild, lurching at the bad guy.  The thief next to me leaps across to the down escalator and makes his escape.  The guy next to my wife is arrested and everyone around us acts encouraging and thankful and makes sure we're okay.  WAY better show than the fountain!", "publishedDate": "2019-11-13", "language": "en", "rating": 3}, {"id": 726259151, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d501696-r726259151-The_Magic_Fountain-Barcelona_Catalonia.html", "text": "A little chilly on a November evening, but a pleasant way to spend half an hour, totally free of charge, watching the Magic Founntain display. Just a few minutes walk from the Placa Espana, we stood on a bridge and had an excellent view of the display. The music could have been louder. but nevertheless, a must-see spectacle,", "publishedDate": "2019-11-13", "language": "en", "rating": 5}, {"id": 726256174, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d501696-r726256174-The_Magic_Fountain-Barcelona_Catalonia.html", "text": "Fabulous place to visit. We visited Barcelona for my birthday. There's lots to do and visiting this place is free! There are some little stalls and public toilets near to the fountain. The weather was lovely whilst we were there too which always helps! Highly recommended", "publishedDate": "2019-11-13", "language": "en", "rating": 5}, {"id": 725943505, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d501696-r725943505-The_Magic_Fountain-Barcelona_Catalonia.html", "text": "As it says on the tin, a spectacular combination of fountains and music, and its free of charge ! Show starts at 8pm and lasts for about 30 minutes. ", "publishedDate": "2019-11-12", "language": "en", "rating": 4}, {"id": 725938264, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d501696-r725938264-The_Magic_Fountain-Barcelona_Catalonia.html", "text": "If you are lucky enough to be there when the fountains are on then you will be amazed . Best viewed from the bottom of the stairs. When the fountains  are off its still a nice view.", "publishedDate": "2019-11-12", "language": "en", "rating": 4}, {"id": 725668946, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d501696-r725668946-The_Magic_Fountain-Barcelona_Catalonia.html", "text": "We just went there last minute, it was crowded but we still had a lovely show. Music, lights are great. Really nice to watch. Make sure not to stay on one side but walk around the fountain and watch the show from higher (stairs up toward royal palace).", "publishedDate": "2019-11-11", "language": "en", "rating": 5}, {"id": 725522628, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d501696-r725522628-The_Magic_Fountain-Barcelona_Catalonia.html", "text": "Very popular fountain set to lights & music.  Get there early if you want a close up view.  Worth visiting as it's free.", "publishedDate": "2019-11-10", "language": "en", "rating": 4}, {"id": 725491655, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d501696-r725491655-The_Magic_Fountain-Barcelona_Catalonia.html", "text": "First of all, get there early (at least 1 hour) and pick a good panoramic spot. At the top of the stairs is recommended. The show with the fountains is super and if you are lucky street artists will perform before or after.", "publishedDate": "2019-11-10", "language": "en", "rating": 4}, {"id": 725482849, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d501696-r725482849-The_Magic_Fountain-Barcelona_Catalonia.html", "text": "1) The sound system is not good, we were standing 5 feet from the fountain and can hardly hear.  Also the music and fountain don't sync up well. \n\n2) a lot of tourist (that is to be expected), who will record the whole thing on their cell phones while holding the phone high above their heads... blocking the view of everyone behind them. Why can't people just live in the moment? Nobody wants to look at your poor quality phone video that you post online.  Don't do it.\n\n3) a lot of vendors selling flashy accessories, same as #2. A lot of tourists buy them and wear them, flashing in front of your face,  rendering the show much less enjoyable. \n\nIn our opinions, this attraction is not worth it.", "publishedDate": "2019-11-10", "language": "en", "rating": 2}, {"id": 725415988, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d501696-r725415988-The_Magic_Fountain-Barcelona_Catalonia.html", "text": "The light and music at the fountain was amazing.  I would recommend seeing this it is well worth a visit", "publishedDate": "2019-11-10", "language": "en", "rating": 5}, {"id": 725344288, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d501696-r725344288-The_Magic_Fountain-Barcelona_Catalonia.html", "text": "This Is a free event you can attend and very worthwhile.  Takes about 20 minutes and the colourful fountains dance to music.  We attended the international music event at 8 pm but at 8:30 it played to symphonic music.", "publishedDate": "2019-11-09", "language": "en", "rating": 4}, {"id": 725277128, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d501696-r725277128-The_Magic_Fountain-Barcelona_Catalonia.html", "text": "Very nice light show with music. The water and lights effects are captivating, the music is sometimes tacky but it's overall a cool experience to have, especially on a warm night.", "publishedDate": "2019-11-09", "language": "en", "rating": 4}, {"id": 725205786, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d501696-r725205786-The_Magic_Fountain-Barcelona_Catalonia.html", "text": "Trip Advisor failed to point out that this fountain does not work 24/7.  Furthermore, the light shows are only (so we were told) held on Thursdays to Sundays in the evening.  Perhaps it was the time of year we visited, but make sure you check so as not to be disappointed like us!", "publishedDate": "2019-11-09", "language": "en", "rating": 1}, {"id": 725190286, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d501696-r725190286-The_Magic_Fountain-Barcelona_Catalonia.html", "text": "I ran to the fountain on my first day and decided to go back with my camera that evening. Although it’s busy the views were amazing especially at sun set. ", "publishedDate": "2019-11-09", "language": "en", "rating": 5}, {"id": 725182156, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d501696-r725182156-The_Magic_Fountain-Barcelona_Catalonia.html", "text": "Very nice show started a but earlier, be aware the it continues with another song:) I would say you will find a good spot for watching all the time as it is huge. ", "publishedDate": "2019-11-09", "language": "en", "rating": 5}, {"id": 725169674, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d501696-r725169674-The_Magic_Fountain-Barcelona_Catalonia.html", "text": "We enjoyed the fountain (and art museum) and the expansive public space around it.  It was also great fun walking the back streets of the city from our central hotel to find it.  Very doable for good walkers who can read a map.  Note that google maps proposes an oddly longer way (even using walking feature). ", "publishedDate": "2019-11-09", "language": "en", "rating": 4}, {"id": 725024130, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d501696-r725024130-The_Magic_Fountain-Barcelona_Catalonia.html", "text": "Located at the beginning of las Ramblet. Busy section but very attractive place to stop and look at. There are much to do around that area that you can explore shopping, restaurants, hotels etc....", "publishedDate": "2019-11-08", "language": "en", "rating": 4}, {"id": 725000294, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d501696-r725000294-The_Magic_Fountain-Barcelona_Catalonia.html", "text": "We couldn`t see the magic show, however we were hoping to see the fountains during the day. Well, we managed to get there only to see fountains with no water. That was 10 am, not sure if they do this during the day or the water is only for the magic show, who knows...a bit disappointed", "publishedDate": "2019-11-08", "language": "en", "rating": 3}, {"id": 724948037, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d501696-r724948037-The_Magic_Fountain-Barcelona_Catalonia.html", "text": "Its on each night to a different music theme.  people from everywhere of all ages come together to just sit and enjoy great fun for families as its spectacular to watch", "publishedDate": "2019-11-08", "language": "en", "rating": 5}, {"id": 724947281, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d501696-r724947281-The_Magic_Fountain-Barcelona_Catalonia.html", "text": "Fantastic display to music, starts around 8pm with a different theme each night, we were treated to a first half of a Beatles medley, Bruno Mars, Little Mix and Justin Timberlake followed by a classical mix and obviously \"Barcelona\" lots of drinks/food stands, If you stand next to the fountains, as we did, you may get a bit of spray if there's a breeze but it all adds to the fun!", "publishedDate": "2019-11-08", "language": "en", "rating": 5}, {"id": 724947171, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d501696-r724947171-The_Magic_Fountain-Barcelona_Catalonia.html", "text": "We saw it, it was ok and the surrounding park is ok. We spent maximum 20 minutes there. It was not running when we arrived or at least not as much as on the pictures we saw online. So we went to the Gothic quarter which is just next to it.", "publishedDate": "2019-11-08", "language": "en", "rating": 3}, {"id": 724713300, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d501696-r724713300-The_Magic_Fountain-Barcelona_Catalonia.html", "text": "Very good entertainment for all the family. Get there early ISH to get s vantage point. The steps overlooking the fountain were packed by the time we arrived but we're able to stand next to the fountain but think you probably saw more from higher up.", "publishedDate": "2019-11-07", "language": "en", "rating": 5}, {"id": 724673211, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d501696-r724673211-The_Magic_Fountain-Barcelona_Catalonia.html", "text": "We have lived in Barcelona for 4 years and we loved comming here even though we did not make the first years.", "publishedDate": "2019-11-07", "language": "en", "rating": 4}, {"id": 724652450, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d501696-r724652450-The_Magic_Fountain-Barcelona_Catalonia.html", "text": "The changing colors were quite beautiful. Stayed here for about an hour. Nice fountain to visit. But I have seen better.", "publishedDate": "2019-11-06", "language": "en", "rating": 4}, {"id": 724622382, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d501696-r724622382-The_Magic_Fountain-Barcelona_Catalonia.html", "text": "Unfortunately, I was not here on one of the days they do the show ( Thursday, Friday, and Saturday in October), but the experience of going was still really nice. There is a fountain, but there is also a water fall here as well. This area can serve as great back drops to awesome pictures. ", "publishedDate": "2019-11-06", "language": "en", "rating": 4}, {"id": 724538549, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d501696-r724538549-The_Magic_Fountain-Barcelona_Catalonia.html", "text": "This was a great find while on our Barcelona trip. It wasn’t something we expected to find until we searched online for local attractions near our hotel. It is often quite busy around here and rightly so. There is a museum which is really good during the day but the main attraction is the light up fountain show which isn’t dissimilar to the Bellagio fountains in Las Vegas (albeit a lot smaller). It’s a great place to hang out and grab some drinks and enjoy the show complete with various music tracks. ", "publishedDate": "2019-11-06", "language": "en", "rating": 5}, {"id": 724525923, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d501696-r724525923-The_Magic_Fountain-Barcelona_Catalonia.html", "text": "It's a beautiful place to visit - look around, the whole area is picturesque. I loved the Magic Fountain.I believe it's 30 min show with music and lights. You don't really need a tour, just walk there and enjoy your time. Check online the schedule of the shows.", "publishedDate": "2019-11-06", "language": "en", "rating": 5}, {"id": 724449338, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d501696-r724449338-The_Magic_Fountain-Barcelona_Catalonia.html", "text": "Great to see day or night. Busy square in the center of the city. Good meeting spot or just a nice place to sit a people watch.", "publishedDate": "2019-11-06", "language": "en", "rating": 4}, {"id": 724436878, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d501696-r724436878-The_Magic_Fountain-Barcelona_Catalonia.html", "text": "Caught a glimpse of it but apparently at night it is lit and there is fountain show with colours. Missed that!", "publishedDate": "2019-11-06", "language": "en", "rating": 4}, {"id": 724163467, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d501696-r724163467-The_Magic_Fountain-Barcelona_Catalonia.html", "text": "So if you go see the fort in Barcelona, your better off go see the fountain ⛲. Starting from the top down you do get an awesome view of the city, each level has a different fountain which is pretty cool. It's a nice place to take some pictures and maybe have a sandwich 🥪 if there aren't to many tourists. ", "publishedDate": "2019-11-05", "language": "en", "rating": 4}, {"id": 724005363, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d501696-r724005363-The_Magic_Fountain-Barcelona_Catalonia.html", "text": "great think to see in barcelona!! located on placa espania and truly it is magical. But you shoult come erlier because to much people comes to see. Don t be to close to the fontain you will get wet!!!! ", "publishedDate": "2019-11-05", "language": "en", "rating": 5}, {"id": 723835556, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d501696-r723835556-The_Magic_Fountain-Barcelona_Catalonia.html", "text": "We arrived about 7pm just in time to get a good spot to sit. Bring a picnic or snacks and drinks to enjoy. Recommend 100% , although tired the kids said it was worth the long walk and loved it!!! ", "publishedDate": "2019-11-04", "language": "en", "rating": 5}, {"id": 723785740, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d501696-r723785740-The_Magic_Fountain-Barcelona_Catalonia.html", "text": "The show lasted about 1h and was spectacular. Defenetely a must see! In high season it’s defentely worth arriving a bit early to gain a good wantage point.", "publishedDate": "2019-11-04", "language": "en", "rating": 5}, {"id": 723609770, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d501696-r723609770-The_Magic_Fountain-Barcelona_Catalonia.html", "text": "One of the true highlights of our trip to Barcelona was our night (actually two nights) visit to the Magic Fountain (Font magica de Montjuic). We had heard about the colors and varied spay patterns of the fountain, but seeing it in person was amazing and hard to leave. From 9 to 10 pm on certain evenings, hundreds, perhaps thousands, of people gather to watch the waters of the fountain shoot upward and change colors and patterns.", "publishedDate": "2019-11-03", "language": "en", "rating": 5}, {"id": 723573398, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d501696-r723573398-The_Magic_Fountain-Barcelona_Catalonia.html", "text": "Some of my best Barcelona pic's were taken area the Fountain, both day and night. Worth the time and effort to visit ", "publishedDate": "2019-11-03", "language": "en", "rating": 5}, {"id": 723320653, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d501696-r723320653-The_Magic_Fountain-Barcelona_Catalonia.html", "text": "Good evening entertainment. There are toilets here but you need to tip the lady with the mop or she gets angry!!! But the beer off the tours selling it, you can get 3 cans of estrella for 3E if you barter enough!!!! ", "publishedDate": "2019-11-02", "language": "en", "rating": 5}, {"id": 723306089, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d501696-r723306089-The_Magic_Fountain-Barcelona_Catalonia.html", "text": "We made it through the protests to get here and for a free show it is very impressive. I'm really glad we didn't miss it as we were recommended to go and check it out before getting to Barcelona. ", "publishedDate": "2019-11-02", "language": "en", "rating": 5}, {"id": 723225143, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d501696-r723225143-The_Magic_Fountain-Barcelona_Catalonia.html", "text": "Great tour and guide with fabulous views of the fountain and drinks after just topped it off! Well worth it. ", "publishedDate": "2019-11-02", "language": "en", "rating": 4}, {"id": 723099883, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d501696-r723099883-The_Magic_Fountain-Barcelona_Catalonia.html", "text": "After reading lots of reviews my family decided to visit this fountain and it really was fabulous. It’s completely free but be warned as it gets extremely busy. We got there about 2 hours before it was meant to start and ate our picnic there so we managed to sit on the steps but it filled up fast and even getting there half an hour early it is unlikely you will find a seat. Loved the display very impressive. Also saw it from afar from the Barcelona Arena!", "publishedDate": "2019-11-01", "language": "en", "rating": 5}, {"id": 722990726, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d501696-r722990726-The_Magic_Fountain-Barcelona_Catalonia.html", "text": "It's wonderful, it's a wonderful feeling to be there.\nA handful of people, good vibes, a pleasant spectacle, it's worth seeing for sure.\nHowever, given today's technology and the number of tourist visits, I resent the bad audio sound as well as the selection of songs, which are interrupted in half, and long silence until the beginning of the new song. The Barcelona song is great for the show's opening, but the others are really bad.", "publishedDate": "2019-11-01", "language": "en", "rating": 5}, {"id": 722956488, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d501696-r722956488-The_Magic_Fountain-Barcelona_Catalonia.html", "text": "beautiful shows each day watching the fountain and the ballet of colors...make sure you place yourself in the higher place to enjoy the romantic show", "publishedDate": "2019-10-31", "language": "en", "rating": 4}, {"id": 722929868, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d501696-r722929868-The_Magic_Fountain-Barcelona_Catalonia.html", "text": "We attended the Magic Fountain show on a Saturday evening. We arrived about 20 minutes before the show was scheduled to start (9:10 PM for a 9:30 show) and there was nowhere to sit with a view of the fountains. Once the show started, the water and lights and their synchronization to the music were fun. The opening song, about Barcelona that I recognized from the '92 Olympics, was a nice homage to the city.\n\nWe arrived thinking that there were two shows scheduled for the evening, each 20-25 minutes long with a break in between. However, we stayed about 45 minutes (until our feet were tired from standing) and there was never a break, the songs just kept going. We had thought there might be some sort of finale, but if so, we left before they got that far. It felt like most of the songs, although different, felt the same and the water and lights the same, so we didn't feel too bad about leaving.\n\nIt was still a fairly unique experience for a big city and we were glad that we'd gone.", "publishedDate": "2019-10-31", "language": "en", "rating": 4}, {"id": 722871847, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d501696-r722871847-The_Magic_Fountain-Barcelona_Catalonia.html", "text": "Although the crowds it is nice to arrive and watch the colors, music and the flow of the water. It works at weekends and at certain hours  after sunset. ", "publishedDate": "2019-10-31", "language": "en", "rating": 5}, {"id": 722867833, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d501696-r722867833-The_Magic_Fountain-Barcelona_Catalonia.html", "text": "The light show is impressive but once you’ve seen once cycle, the lights look the same each time. The songs played are like a playback from a British wedding. \n\nWe arrived 20 before the show started and struggled to find anywhere to sit. Without a seat I’d find it difficult to stand through for a full hour. Otherwise still enjoyed the show! ", "publishedDate": "2019-10-31", "language": "en", "rating": 4}, {"id": 722828009, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d501696-r722828009-The_Magic_Fountain-Barcelona_Catalonia.html", "text": "This is a fabulous experience and a must see.  There are a series of fountains that light up.  It is beautiful.", "publishedDate": "2019-10-31", "language": "en", "rating": 5}, {"id": 722725870, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d501696-r722725870-The_Magic_Fountain-Barcelona_Catalonia.html", "text": "Very beautiful to look at with the right light you can take amazing pictures. At the evening there are sometimes light iluminations.", "publishedDate": "2019-10-30", "language": "en", "rating": 5}, {"id": 722664622, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d501696-r722664622-The_Magic_Fountain-Barcelona_Catalonia.html", "text": "Very nice 👍 place to visit on a sunny afternoon you get great views of the city.\n\nLovely time walking around to take in the views", "publishedDate": "2019-10-30", "language": "en", "rating": 5}, {"id": 722647406, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d501696-r722647406-The_Magic_Fountain-Barcelona_Catalonia.html", "text": "The evening atmosphere was nice with people surrounding the fountains and eagerly waiting for the show.\nThe show is free with fountains changing colour and as if water is dancing to music .I feel the music choice could be improved.\nLots of street vendors selling local small souvenirs .", "publishedDate": "2019-10-30", "language": "en", "rating": 3}, {"id": 722564090, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d501696-r722564090-The_Magic_Fountain-Barcelona_Catalonia.html", "text": "This is a unique hangout in the city....a little bit like the Spanish Steps.   There are plenty of vendors and visitors, but it's not overly crowded.  There are plenty of steps between the fountain and the museum so we recommend starting at the top and working downward to the fountain.  ", "publishedDate": "2019-10-30", "language": "en", "rating": 5}, {"id": 722560298, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d501696-r722560298-The_Magic_Fountain-Barcelona_Catalonia.html", "text": "In a lovely area of Barcelona with so much to see in the immediate vicinity. We saw the fountains by day but returned again on the Thursday evening (as per the schedule) to see the Magic Fountain in action at night. The advertised programme started at 9pm however we turned up just after 8pm and there was already music and lights on the go. It was busy however the side we were standing at kept getting a spray of water due to the breeze catching it every now and again, didn't bother us but meant it wasn't as congested as everyone else moved around to the other side of the fountain! \nMake time in your visit to see this if you are there on a day that the schedule is operating.", "publishedDate": "2019-10-30", "language": "en", "rating": 5}, {"id": 722358505, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d501696-r722358505-The_Magic_Fountain-Barcelona_Catalonia.html", "text": "Went to Arenas de Barcelona to watch the fountains from the rooftop there. Obviously couldn’t hear the music but it was a great view and you are able to have a drink whilst watching! I will have to go again and try it from up closer as it was amazing and would probably have been better hearing the music with it. It started at 9pm still even though obviously being October it was dark a lot earlier than that.  ", "publishedDate": "2019-10-29", "language": "en", "rating": 4}, {"id": 722319261, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d501696-r722319261-The_Magic_Fountain-Barcelona_Catalonia.html", "text": "Went on a Thursday evening. Arrived half an hour before the show as advised it was busy but plenty of space. Whilst waiting for the fountains to start sellers constantly came up offering drinks etc. And continued to do this whilst watching the fountain show.\nThe show was good, if a bit repetitive and we did leave before it had finished. Unfortunately we struggled to hear the music from where we were, not sure if this was as the volume was low or speakers not working.\nA pleasant way to spend an evening in the city.\nIt was quite a walk form the centre.\n", "publishedDate": "2019-10-29", "language": "en", "rating": 3}, {"id": 722290058, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d501696-r722290058-The_Magic_Fountain-Barcelona_Catalonia.html", "text": "Very close to the metro.  I went here on a Saturday evening.  It was so busy.  I was lucky I was on my own, as I pushed my way to the front.  It was nice to hear the music, and watch the fountains.  It is in a beautiful setting, great for photo opportunities.", "publishedDate": "2019-10-29", "language": "en", "rating": 3}, {"id": 722124240, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d501696-r722124240-The_Magic_Fountain-Barcelona_Catalonia.html", "text": "It's worth a visit if you're in the area.  Get there early for best viewing positions (on the steps).  Gets crowded as show time nears.  A larger version of the water and light show at Bellagio in Las Vegas set to vintage rock music.  Make sure you check show times based on the date you're planning to go.", "publishedDate": "2019-10-28", "language": "en", "rating": 4}, {"id": 722090650, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d501696-r722090650-The_Magic_Fountain-Barcelona_Catalonia.html", "text": "We kept our two children up late to see the show, despite there being civil unrest it was still very busy and you would have to arrive very early to get a seat.\n\nThe show itself entertained our 2 year old and 5 year old with a good mix of light and music. For the adults we were entertained by the sellers who kept running off at the sight of the police.\n\nWe had been warned about pick pocketing and the crowd, however we stayed mostly out of the crowd so had no worries on this front.\n\nThere were also people selling light up toys and others selling drinks that were slightly intrusive but they got the message when you said no.\n\nOverall we enjoyed it as a family and the kids still talk about it a week or so afterwards.\n", "publishedDate": "2019-10-28", "language": "en", "rating": 4}, {"id": 722086436, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d501696-r722086436-The_Magic_Fountain-Barcelona_Catalonia.html", "text": "As we finished exploring Poble Espanyol and taking photos, The magic Fountain is only walking distance from Poble Espanyol it took us 10-15mins walk, the Plaza is huge wherein you can sit and relax and enjoy the magnificent fountain, the place is so relaxing, just be there early for you to have a good spot, and enjoy the fountains and have fun taking selfie's..Must visit while in Barcelona👍🏻👍🏻👍🏻😍", "publishedDate": "2019-10-28", "language": "en", "rating": 5}, {"id": 722060570, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d501696-r722060570-The_Magic_Fountain-Barcelona_Catalonia.html", "text": "Check the times out and get there early if you want a seat on the steps, also you may want to pack some food & drink. For free you can't knock it. The water & light show is great fun", "publishedDate": "2019-10-28", "language": "en", "rating": 5}, {"id": 722021454, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d501696-r722021454-The_Magic_Fountain-Barcelona_Catalonia.html", "text": "The pictures of this look majestic, do your research so you aren’t disappointed. We missed out due to the time of our visit and the changes to the seasonal timing of the show.\n\nWe had hoped to see the fountains running without the show. But when we got there they were still. We had nice views from the museum and the cascades down toward the Placa d’Espanya.", "publishedDate": "2019-10-28", "language": "en", "rating": 4}, {"id": 721861536, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d501696-r721861536-The_Magic_Fountain-Barcelona_Catalonia.html", "text": "The walk towards the fountain from Spanish Plaza is beautiful, with fountains on the roadside towards the grand magic fountain show. The show is amazing, well organized and fun. We stood on one of the over-crossings to get a good sight, but the traffic under the bridge does distract a bit from the music. If you don’t mind to get a little sprinkle from the water, then you can get closer for a better experience. The fountain light turns off shortly after the two shows, so if you want to take photos around, you may want to do so before or during the show. ", "publishedDate": "2019-10-27", "language": "en", "rating": 4}, {"id": 721778500, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d501696-r721778500-The_Magic_Fountain-Barcelona_Catalonia.html", "text": "A great variety of music accompanies a beautiful fountain show - don’t be afraid to work your way to the front, you may get a little wet from the spray, but it’s actually much less crowded than it appears from a distance!", "publishedDate": "2019-10-27", "language": "en", "rating": 4}, {"id": 721738098, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d501696-r721738098-The_Magic_Fountain-Barcelona_Catalonia.html", "text": "A great sight to see and so easy to get to. The metro brings you right to the start of the walk way up. The show lasts from 9-10 pm from memory but lots to do round there.", "publishedDate": "2019-10-27", "language": "en", "rating": 5}, {"id": 721266933, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d501696-r721266933-The_Magic_Fountain-Barcelona_Catalonia.html", "text": "One of the favorite things to do in Barcelona at night is to watch the Magic Fountain of Montjuic, at the beginning of Avinguda Maria Cristina in the Montjuic neighborhood. The Magic Fountain is a 'must-see' Barcelona attraction. You have never seen a fountain like this. It does feel magic to experience the beautiful show of water, light, and music. built-in 1929 as one of the main attractions for the 1929 Barcelona World Fair and the Font Magica is still one of the most famous places in Barcelona with millions of visitors annually.\n\nI would suggest reaching here early, it starts at 9 PM but stairs (where public sit) gets crowded easily. Don’t worry if you reach early, there is enough street show that happens and there is a big castle so there is ample to do here. \n\nIn the winter the fountain only has evening water and light shows on Friday and Saturdays. In the summer the evening light and music show are from Thursday to Sunday. And it's FREE...!!", "publishedDate": "2019-10-25", "language": "en", "rating": 4}, {"id": 721235496, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d501696-r721235496-The_Magic_Fountain-Barcelona_Catalonia.html", "text": "Practically one of those things that makes you realize how great people are when they want to do great things. One of the most beautiful experiences in Barcelona, you must definitely see. I advise you to arrive a little bit before in order to get places that are better suited to have the best view of Magic Fountain. It looks really magical.", "publishedDate": "2019-10-25", "language": "en", "rating": 5}, {"id": 720773380, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d501696-r720773380-The_Magic_Fountain-Barcelona_Catalonia.html", "text": "First you need to check the timetable. Then be there in advance and you can get a good place to watch the show. ", "publishedDate": "2019-10-23", "language": "en", "rating": 5}, {"id": 720536550, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d501696-r720536550-The_Magic_Fountain-Barcelona_Catalonia.html", "text": "Go at night when they light it up and do it to music!  Quite a scene!!  I took a night time bike ride through Barcelona which made a stop here!", "publishedDate": "2019-10-22", "language": "en", "rating": 5}, {"id": 720503558, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d501696-r720503558-The_Magic_Fountain-Barcelona_Catalonia.html", "text": "The fountain itself is beautiful.  But continue up the many many steps  (escalator is available for those unable to do a lot of steps) to get the most gorgeous view of the city.  Further up the mountain is a museum.  Yes, it is all free !", "publishedDate": "2019-10-22", "language": "en", "rating": 5}, {"id": 720478042, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d501696-r720478042-The_Magic_Fountain-Barcelona_Catalonia.html", "text": "The waterfalls were being repaired/cleaned so not much to see. The large fountain was lovely but again, a limited display. The gardens and pathways around the fountains could do with some tlc. ", "publishedDate": "2019-10-22", "language": "en", "rating": 3}, {"id": 720415151, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d501696-r720415151-The_Magic_Fountain-Barcelona_Catalonia.html", "text": "If you visit Barcelona this is a not to be missed experience. It is completely free. Great for all the family to go to and watch. If you google it you can find what times it is on, on what days and which months as it changes throughout the year. There are stands to get food and drink if you wish. Street sellers but they do not bother you unless you go to them. Great experience. \n", "publishedDate": "2019-10-22", "language": "en", "rating": 5}, {"id": 720274539, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d501696-r720274539-The_Magic_Fountain-Barcelona_Catalonia.html", "text": "See this fountain with a music and light show at night.  For the best experience, get as close to the fountain as you can, if you don't mind getting wet!", "publishedDate": "2019-10-21", "language": "en", "rating": 5}, {"id": 720267342, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d501696-r720267342-The_Magic_Fountain-Barcelona_Catalonia.html", "text": "One of the best show in Barcelona for one great  hour 3 times per the week, dont miss it when you are there made you feel you are fairytale. 💕🇪🇸💕", "publishedDate": "2019-10-21", "language": "en", "rating": 5}, {"id": 720262679, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d501696-r720262679-The_Magic_Fountain-Barcelona_Catalonia.html", "text": "a lovely sound and light show at night. A lot of people in attendance. Good to have seen it once and probably better to have seen it with some beers on board as it is kinda psychadelic", "publishedDate": "2019-10-21", "language": "en", "rating": 4}, {"id": 720118593, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d501696-r720118593-The_Magic_Fountain-Barcelona_Catalonia.html", "text": "My boyfriend and I trekked here on our last night in Barcelona to see the show and were not disappointed.\nThe place was buzzing, the fountain display was colourful and the music had something for everyone, started poppy and then when classical/orchestral...a must see.", "publishedDate": "2019-10-21", "language": "en", "rating": 5}, {"id": 720047582, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d501696-r720047582-The_Magic_Fountain-Barcelona_Catalonia.html", "text": "It’s not the most impressive water fountain displays I’ve ever seen but it’s really great and well worth a visit.  I loved the atmosphere and the music was prince and Bowie so great.  The music changes with each performance so check it out and go when your favs are playing.", "publishedDate": "2019-10-20", "language": "en", "rating": 4}, {"id": 720017803, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d501696-r720017803-The_Magic_Fountain-Barcelona_Catalonia.html", "text": "Worth seeing.  Happens at 9pm and lasts about 30 minutes. Get there by 830.  Crowds are huge...beware of pickpockets. Stand with your back to the wall near one of the bridges.", "publishedDate": "2019-10-20", "language": "en", "rating": 3}, {"id": 719986737, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d501696-r719986737-The_Magic_Fountain-Barcelona_Catalonia.html", "text": "Beautiful fountain with a nice light and music show on Friday and Saturday night.  Rate this as an average fountain though and not worth a long walk to see.", "publishedDate": "2019-10-20", "language": "en", "rating": 4}, {"id": 719919056, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d501696-r719919056-The_Magic_Fountain-Barcelona_Catalonia.html", "text": "We went for the full hour. Great show. Excellent choreography. Not too busy. Well worth the visit. Good and easy viewing spots.", "publishedDate": "2019-10-20", "language": "en", "rating": 4}, {"id": 719840550, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d501696-r719840550-The_Magic_Fountain-Barcelona_Catalonia.html", "text": "I found the show to be mildly impressive it not very entertaining. It's pretty for 5 minutes then it get boring ", "publishedDate": "2019-10-20", "language": "en", "rating": 3}, {"id": 719706339, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d501696-r719706339-The_Magic_Fountain-Barcelona_Catalonia.html", "text": "Was a highlight of our Barcelona trip. Would recommend to go early and watch the show from the steps of the art museum. Was spectacular. ", "publishedDate": "2019-10-19", "language": "en", "rating": 5}, {"id": 719598027, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d501696-r719598027-The_Magic_Fountain-Barcelona_Catalonia.html", "text": "I admit off the top that I did not visit the fountain during a time when you could appreciate it for its primary claim to fame, the evening light show.  But it was still quite a sight.  Towering over everything and everyone around it and constantly changing in its patterns.  It was quite enjoyable just to sit in the surrounding park while relaxing and enjoying its roaring jets of water.  \n\nAt the same time as our visit to the fountain, there was a crew filming a BBC series (at least that was what the army of production assistants told us).  Everytime they were ready to say action, all of the regular tourist had to be herded out of sight so the fake, back ground tourists could commence acting.  There were three young girls pretending to take selfies, a young woman who would push a stroller through and a man who would quickly pass through the frame on a bike.  All the while the primary actors would have volatile disagreement ending with the younger man storming off.  I really did feel bad for the PA's trying to preserve the sanctity of the shot by keeping passers by from walking through.  Most people who encountered the PA's miming a old timey camera filming would be agreeable and alter their path.  But there were several who just completely blew through the warnings and stormed through the set.  The PA's helplessly trailing them, trying to convince them to alter their course.\n\nUnfortunately I can't promise you a similar experience.  I don't think they film scenes for a BBC series at the fountain every day.", "publishedDate": "2019-10-19", "language": "en", "rating": 4}, {"id": 719569831, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d501696-r719569831-The_Magic_Fountain-Barcelona_Catalonia.html", "text": "This is a fantastic free show. 45 mins of music to fountain show. We didn’t sit, but stood close to the fountain. It was thrilling, we got a bit wet, but it was fun. The music is great and the colours, and water was beautiful. Highly recommend this show.", "publishedDate": "2019-10-19", "language": "en", "rating": 5}, {"id": 719535870, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d501696-r719535870-The_Magic_Fountain-Barcelona_Catalonia.html", "text": "The crowds were in the thousands at this fountain and the music of Queens lead singer Freddy Mercury was fitting", "publishedDate": "2019-10-18", "language": "en", "rating": 5}]}}]