[{"locationId": 10538541, "name": "Casa de la Lactancia", "placeType": "ATTRACTION", "reviewListPage": {"reviews": [{"id": 690181840, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d10538541-r690181840-Casa_de_la_Lactancia-Barcelona_Catalonia.html", "text": "La Casa de la Lactancia, is a late modernist building originally built for the purpose of providing care for abandoned children and a maternity hospital, but now a care home for the elderly. By the standards of Modernism, it’s a fairly simple building and lacks the opulent decoration that make it’s architectural style obvious. The facade is simply decorated with rectangular tiles of various hues of light blue. On the first floor, just above the entrance to the building is a stained glass window clearly influence by Art Nouveau. Directly above that are decorations that show both the building’s original purpose and it’s Modernista influences. The cornice is richly decorated with floral motifs and the roof is crowned with architectural sculptures, evidence of it’s Modernism influences. Other Modernista elements include the semi-circular balconies with wrought-iron railings and ceramic mosaic bannisters inside the building. The  sculptural relief depicts allegory of infancy, alludes to the building’s origins.\n\nAlthough, interesting on it’s own, it’s only worth a detour if you have an abiding interest in Catalan Modernism. There are many monumental and more important examples of this style throughout Barcelona.", "publishedDate": "2019-07-16", "language": "en", "rating": 3}, {"id": 672773513, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d10538541-r672773513-Casa_de_la_Lactancia-Barcelona_Catalonia.html", "text": "This building of Catalan Modernism was completed in 1913. It has a beautiful facade.\n\nThe house used to be a place where mothers offered their milk to other babies.\n\nToday Casa de la Lactancia no longer cares for babies. It is a nursing home for the elderly.", "publishedDate": "2019-05-09", "language": "en", "rating": 4}]}}]