[{"locationId": 9570223, "name": "Parc de les Cascades", "placeType": "ATTRACTION", "reviewListPage": {"reviews": [{"id": 712551212, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d9570223-r712551212-Parc_de_les_Cascades-Barcelona_Catalonia.html", "text": "Parc de les Cascades is a very good idea that has come to fruition. Instead of having two roads next  to each other with lots of traffic, the authorities created a \"park\" between them, and I think, above them too. That is a great idea actually! There are some water features, sculptures and other things, and people have the opportunity to walk through, to sit down, to do whatever they wish. It is not really very big, and in reality it is probably not a park you would want to go to have a picnic or to sit down and relax. But given the circumstances and the available space, the result is quite good. It is not something you have to visit, but if you stumble across it, as we did, then, you are there!", "publishedDate": "2019-09-24", "language": "en", "rating": 4}, {"id": 672372983, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d9570223-r672372983-Parc_de_les_Cascades-Barcelona_Catalonia.html", "text": "Overall its a nice place, but they could do more on the park end - given Barcelona is a wonderful city, its got nice architectural work around it -", "publishedDate": "2019-05-07", "language": "en", "rating": 3}, {"id": 656706145, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d9570223-r656706145-Parc_de_les_Cascades-Barcelona_Catalonia.html", "text": "Situated between two busy roads, some interesting sculptures but would not think it is a relaxing place to rest.", "publishedDate": "2019-03-06", "language": "en", "rating": 2}, {"id": 593548391, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d9570223-r593548391-Parc_de_les_Cascades-Barcelona_Catalonia.html", "text": "We walked along here whilst going to and from the metro to the beach.\n\nI wouldn't exactly call this a park. It's a central reservation between the two main roads running each side of it. Yes it's got some trees and benches and the odd fountain, but it's not somewhere you would really go to relax in a park", "publishedDate": "2018-07-06", "language": "en", "rating": 2}, {"id": 591698225, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d9570223-r591698225-Parc_de_les_Cascades-Barcelona_Catalonia.html", "text": "This is a lovely place to visit in Barcelona (do forget the Las Ramlas for the time being for shopping), with lots of greenery, sculptures and water fountain in the center of the park. The promenade is nice and not far from here is the Olympic Village and Stadium when Spain hosted the 1992 Olympic games.\n\nIt is interesting to come by here for a visit especially you happen to be in the area to get a sense of tranquility and serenity, away from the bustling city high traffic activities.", "publishedDate": "2018-06-29", "language": "en", "rating": 4}, {"id": 583793148, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d9570223-r583793148-Parc_de_les_Cascades-Barcelona_Catalonia.html", "text": "This park was built during the renewal of the port area for the 1992 Olympics and to serve as an area of recreation for athletes in the Olympic Village.. I would be interested to see photographs of the 1992 version and compare with the present. I just felt that the park was devoid of atmosphere, somewhat sterile although it has garden areas, sculptures in abstract design, trees and a fountain. The promenade and beach are nearby. Maybe it was the cold overcast day that influenced my opinion, worth viewing if in the area.", "publishedDate": "2018-05-29", "language": "en", "rating": 3}, {"id": 558161978, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d9570223-r558161978-Parc_de_les_Cascades-Barcelona_Catalonia.html", "text": "This is a rather neglected park with very little information provided on it in the few signs.\nIt was just next to our hotel so we went through it, but it's easily a park to skip while in Barcelona.", "publishedDate": "2018-02-03", "language": "en", "rating": 2}, {"id": 537512168, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d9570223-r537512168-Parc_de_les_Cascades-Barcelona_Catalonia.html", "text": "The whole area is very pretty to walk round; well maintained with sculptures and a spectacular fountain at the middle of the boulevard. Only a small distance from the well maintained harbour and beach", "publishedDate": "2017-10-31", "language": "en", "rating": 4}, {"id": 386073364, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d9570223-r386073364-Parc_de_les_Cascades-Barcelona_Catalonia.html", "text": "Barcelona is a metropolitan with many oasis.\nParc de les Cascades is one of them.\nEstablished in 1992 to the Olympic Games.\nIn the parc there are sculptures, green areas, walking areas, playing areas.", "publishedDate": "2016-06-26", "language": "en", "rating": 4}]}}]