[{"locationId": 7102217, "name": "Poblenou Cemetery", "placeType": "ATTRACTION", "reviewListPage": {"reviews": [{"id": 734424326, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d7102217-r734424326-Poblenou_Cemetery-Barcelona_Catalonia.html", "text": "Location: West of the city, near the zoo.\nPrice: free\n\nThis is an active cemetery so be respectful. The entrance of the cemetery is typical European with walls of gravestones dedicated to people/families. If you walk to the back of the cemetery, you'll start to see all of the old crypts and tombs. The Kiss of Death statue is on the west of the cemetery. This is someones gravestone though so be mindful, its also a lot smaller than the photos show.", "publishedDate": "2019-12-24", "language": "en", "rating": 4}, {"id": 719617915, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d7102217-r719617915-Poblenou_Cemetery-Barcelona_Catalonia.html", "text": "It's a good cemetery like many like this with the large grave stones. One in Paris is much better and seen better in South America", "publishedDate": "2019-10-19", "language": "en", "rating": 4}, {"id": 716026941, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d7102217-r716026941-Poblenou_Cemetery-Barcelona_Catalonia.html", "text": "Noted as one of the most famous and photographed cemeteries in Europe I HAD to see this for myself! LOVED IT! The entire place was really something to see! Go to the OLD section 100 + cripes with amazing architecture! You can do it in an hour I would so 2 to 2.5!", "publishedDate": "2019-10-07", "language": "en", "rating": 5}, {"id": 677792106, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d7102217-r677792106-Poblenou_Cemetery-Barcelona_Catalonia.html", "text": "In our recent trip, we stayed right across from this cemetery. This is also actually a tourist attraction now and they even provide a map for the whole place at the entrance. This was built in the late 18th century. The departed are “stacked” up in the wall in different sections and small memorabilia is displayed outside. Fresh and artificial flowers are kept depending on the visitors of the grave. Ample place to walk around. It is creepy no doubt....but beautiful and serene nevertheless!! This type of cemetery is unique to Spain and an important part of Spanish culture. ", "publishedDate": "2019-05-31", "language": "en", "rating": 5}, {"id": 676059116, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d7102217-r676059116-Poblenou_Cemetery-Barcelona_Catalonia.html", "text": "A beautiful cemetery with some amazing sculptures including the kiss of death which is situated on the left as you enter the cemetery in department 4t, it took me a while to find it as I went in the wrong direction but seen some stunning sculptures along the way, also came across a very scary, very angry seagull who kept swooping down aiming for my head and trying to poo on me, needless to say I screamed a few times in very quiet grounds but don't let the seagull put you off, this is a must see, a very beautiful, peaceful place.", "publishedDate": "2019-05-24", "language": "en", "rating": 5}, {"id": 659703246, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d7102217-r659703246-Poblenou_Cemetery-Barcelona_Catalonia.html", "text": "Easy to access and a real treasure dont just go in the entry area go deeper and you will find some really amazing shrines.oldest cemetery in bcn.", "publishedDate": "2019-03-19", "language": "en", "rating": 4}, {"id": 658827168, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d7102217-r658827168-Poblenou_Cemetery-Barcelona_Catalonia.html", "text": "This cemetery is beautiful, interesting and filled with fantastic examples of funerary sculptures.  A highlight is \"The Kiss of Death\" - but there are also an abudance of others that are sublime.  Some are worn by the weather that deepen the drama and are just exquisite.   \n\nIf you enjoy old cemeteries - this one should be missed.  It can be a bit of a maze as there are multiple courtyards.  A map is offered at the entrance pointing out some of the more notable monuments.", "publishedDate": "2019-03-16", "language": "en", "rating": 5}, {"id": 630307967, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d7102217-r630307967-Poblenou_Cemetery-Barcelona_Catalonia.html", "text": "I'm  not a big fan of cemeteries but this one is interesting.  Many of this city's rich and famous were buried here and they used their wealth to commission some of Spain's most important and famous artists to design their burial places.  Some are truly stunning.  The famous Kiss of Death is here.  Some of the cemetery is run down.  Ask at hotel and they may be able to set up an artist's tour of the place", "publishedDate": "2018-11-02", "language": "en", "rating": 4}, {"id": 618957101, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d7102217-r618957101-Poblenou_Cemetery-Barcelona_Catalonia.html", "text": "Such an interesting and tranquil place. I am glad we went there. Much more to see, but ofcourse ’Kiss of death’ called us to go; located at the far end of the cemetery.", "publishedDate": "2018-09-23", "language": "en", "rating": 5}, {"id": 584771908, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d7102217-r584771908-Poblenou_Cemetery-Barcelona_Catalonia.html", "text": "This burial site is unusually mostly built up rather than dug down. The multi story apartments for the departed, with their sad indications of loss, and either careful attention or even more moving neglect are different to the usual sights in such a place. Many memorials are extravagant, but many more are not.  The terrible revolutionary history of Barcelona is on display in memorials and the Fosse. It's hard to come here and be unaffected.", "publishedDate": "2018-06-03", "language": "en", "rating": 4}, {"id": 519068812, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d7102217-r519068812-Poblenou_Cemetery-Barcelona_Catalonia.html", "text": "The cemetery is really well maintained and signposted. The iconic \"Kiss of Death\" statue/headstone was particularly worth seeing. \nIt's a very peaceful place and contains some really beautiful, if melancholic, art. ", "publishedDate": "2017-08-29", "language": "en", "rating": 5}, {"id": 516354315, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d7102217-r516354315-Poblenou_Cemetery-Barcelona_Catalonia.html", "text": "I often visit cemeteries when travelling in Great Britan or Ireland. I have never seen an urn cemetery before. Not actually a tourstis attraction but still an interesting place to see.", "publishedDate": "2017-08-22", "language": "en", "rating": 5}, {"id": 500732860, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d7102217-r500732860-Poblenou_Cemetery-Barcelona_Catalonia.html", "text": "Historical place. Made me think of life and family. It was  interesting to look at the gravestones and hear the whispers from past. Had to trop few tears also.", "publishedDate": "2017-07-11", "language": "en", "rating": 4}, {"id": 459880095, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d7102217-r459880095-Poblenou_Cemetery-Barcelona_Catalonia.html", "text": "My teenage daughter suggested to go to this place and I'm glad she did. Stonework was beautiful but also mixed in were many interesting unique takes on mortality", "publishedDate": "2017-02-14", "language": "en", "rating": 4}, {"id": 442542751, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d7102217-r442542751-Poblenou_Cemetery-Barcelona_Catalonia.html", "text": "Poblenou Cemetery was on my tour list for my visit to Barcelona. I visited on the second day of my Hop on Hop Off tour. It was supposed to be right off Stop #7 on the Red Barcelona City Tour East Route.\n\nUnfortunately for me, the summer route is different from the winter route and the stop #7 for November was at least a couple of miles from the cemetery/Summer Stop 7.\n\nAfter my Google maps continually failed me and I had been wandering around for about 45 minutes getting directions from strangers, I met an old man who after asking me where I was from (I don't speak Spanish and he didn't speak English), he personally escorted me to the cemetery, a thirty minute walk from where he met me.\n\nSometimes in traveling you get your faith in mankind restored. With some of the obvious and subtle racism I have faced as a black man touring Europe, such kind gestures can completely surprise you.\n\nAnyways the cemetery itself is not large with a rectangular layout and for me quite different since all previous cemeteries I have visited have the dead below ground. This had the dead entombed in walls of crypts above ground. The place was very colorful with lots of pictures of the dead, flowers, etc adorning the crypts and lots of sculptures. There were ladders around to reach the upper crypts.\n\nI nearly wept when I observed an older lady praying at the crypt of someone. She clearly was overcome with emotion. I took quite a few pictures including the required selfie with the \"Petó de la mort\" (Kiss of Death).\n\nUnfortunately because I had wasted time finding the cemetery, I was pressed for time and could not explore it enough before the 6 PM closing.", "publishedDate": "2016-12-07", "language": "en", "rating": 4}, {"id": 430693557, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d7102217-r430693557-Poblenou_Cemetery-Barcelona_Catalonia.html", "text": "Very interesting how they are buried in Spain. They bring the coffin on a cart, place them in a 7 story high burial niches. The flowers are placed in front of the door which is cemented shut. Very old sculptures from the 1800's and small units that families very placed in.", "publishedDate": "2016-10-22", "language": "en", "rating": 4}, {"id": 429036754, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d7102217-r429036754-Poblenou_Cemetery-Barcelona_Catalonia.html", "text": "This site is still a cemetery, but as well it tells the story of different styles of architects and sculpturers from the 1770's to the 1880's. The cemetery is active on social media, has an app + guided visits on some sundays.", "publishedDate": "2016-10-17", "language": "en", "rating": 4}, {"id": 415383748, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d7102217-r415383748-Poblenou_Cemetery-Barcelona_Catalonia.html", "text": "Coming from Denmark I have never seen a cemetery like Poblenou Cemetery. It is like small boxes on top of each other for as long as you can see. Get a map at the entrance and experience the 30 sites described. Don't forget number 30 in the map \"El beso de la muerte\" -> Death dragging the dead man into the afterlife. Amazing and quite scary. Not a statue you would normally see in a cemetery.", "publishedDate": "2016-09-06", "language": "en", "rating": 3}, {"id": 387805927, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d7102217-r387805927-Poblenou_Cemetery-Barcelona_Catalonia.html", "text": "So where to begin... Our Mercedes driver could barely navigate the tight turns without tearing off his side view mirrors! There was one section where the only thing separating us from certain death due to  falling off the cliff was an orange plastic fence! The burial niches are only deeded for 60 years, then the \"remains\" are \"re-distributed\"?! BUT, once you get to the top... there is a peaceful and well maintained memorial garden honouring Jews who died in WW II, War Heroes and citizens who deserve being remembered. Then, if you're up for it, there's a Funerary Coach Museum which we spent at least 10 minutes!", "publishedDate": "2016-06-30", "language": "en", "rating": 3}, {"id": 369017476, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d7102217-r369017476-Poblenou_Cemetery-Barcelona_Catalonia.html", "text": "I was not prepared for the sheer size of this cemetery - you will definitely need to pick up a map otherwise risk getting lost! \nIt's interesting to see a cemetery set out in this way, it's such a peaceful way to spend your morning. Highly recommend it (also it's free)", "publishedDate": "2016-04-30", "language": "en", "rating": 3}, {"id": 330345559, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d7102217-r330345559-Poblenou_Cemetery-Barcelona_Catalonia.html", "text": "This ended up being one of the highlights of my trip to Barcelona. Historically significant and filled with magnificent architecture by famous architects and beautiful stone work, it is still an active place of contemplation. I disagree with people who say cemeteries are not places to visit. That is exactly why they are built. Respectively admiring them is a way to honour the dead and have them live on beyond the love ones they left behind. The works of art in cemeteries are built to be admired and looked upon. And this cemetery is filled with amazing works. I could have spent another 2 hours simply wandering in this beautiful place. The famous Kiss of Death sculpture is stunning but is certainly not the only work of art worth seeing. Plan for a good amount of time to wander the back area where most of the sculptures and mausoleums are located.", "publishedDate": "2015-12-02", "language": "en", "rating": 5}, {"id": 329614377, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d7102217-r329614377-Poblenou_Cemetery-Barcelona_Catalonia.html", "text": "This is a fairly typical European cemetery, with relatively few mausoleums and tombstones but quite a number of family burial niches, walls with a niche for a memorial plaque and space for photos, small person objects, and so on. There's a large memorial to the victims of the 1821 outbreak of yellow fever, with special commemoration of the doctors who treated the sick, and the graves of several Catalan historical and artistic figures, If you like cemeteries as an insight on cultural history, you'll find it interesting. \n\nThe cemetery is famous, though, for the sculpture El Peto de la Mort (The Kiss of Death in English, El Beso de la Muerte, in Spanish) which shows Death as a winged skeleton kissing the brow of a remarkably handsome young man. Some say that this sculpture inspired Ingmar Bergman's film The Seventh Seal.  \n\nThe tomb is of Josep Llaudet Soler, though the sculptor is unknown.\n\nThe cemetery is fairly small and you can pick up a map of the graves of historic or artistic interest at the entrance.", "publishedDate": "2015-11-28", "language": "en", "rating": 5}, {"id": 314188005, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d7102217-r314188005-Poblenou_Cemetery-Barcelona_Catalonia.html", "text": "I'm in love with this cemetery. maybe it sounds strange, but I really have never seen something so perfect. very good feeling inside after the visiting this place. Sad I can't get excursion there. I think it all can tells very interesting stories of life and love.", "publishedDate": "2015-09-27", "language": "en", "rating": 5}, {"id": 286170477, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d7102217-r286170477-Poblenou_Cemetery-Barcelona_Catalonia.html", "text": "I visited this cemetery thinking that it was just ruins from the 19th century. I didn't realise it was still a cemetery in use! People have their loved ones as recent as the past few years buried there. It felt very disrespectful walking around. \n\nI don't think it's right that this should be made into a tourist attraction. I wouldn't recommend visiting, let the dead rest in peace. ", "publishedDate": "2015-07-06", "language": "en", "rating": 2}, {"id": 237623813, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d7102217-r237623813-Poblenou_Cemetery-Barcelona_Catalonia.html", "text": "We spent a very peaceful early afternoon in Poblenou Cemetery on our recent trip to Barcelona.\n\nMy poor Husband knows my love of Funerary Art and that a visit to any City would not be complete without a visit to a cemetery wherever we may be.  \n\nThe Cemetery is very well cared for and some of the older sculptures are stunningly beautiful and very well preserved.  Some of the mausoleums are so large and magnificent and are the resting place of the wealthy families of Barcelona.  \n\nThere were so many monuments that I admired it would be difficult to pick my favourite.  Obviously the Kiss of Death being the most famous looked wonderful and tinged with sadness of the extinguishing of a young life, but the sadness was lifted somewhat by the gorgeous pink flowers growing through both sculptures. I also thought the Angel carrying the woman upwards was a beautiful representation of life/death journey.  \n\nOne of the stand out monuments for me was of the statue of the young man dressed in T-shirt & Jeans with sunglasses in shirt pocket, bottle in the other hand, covered in pink and white flowers. What an absolute fabulous way to remember a young man's life.  \n\nWorthy of another visit as there are so many monuments and statues to view.", "publishedDate": "2014-11-02", "language": "en", "rating": 5}]}}]