[{"locationId": 6401014, "name": "El Puerto de Barcelona", "placeType": "ATTRACTION", "reviewListPage": {"reviews": [{"id": 620340897, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d6401014-r620340897-El_Puerto_de_Barcelona-Barcelona_Catalonia.html", "text": "We were leaving from here on one of the larger cruise ships, but the departure (and return) could not have been more hassle-free.", "publishedDate": "2018-09-28", "language": "en", "rating": 5}, {"id": 618634062, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d6401014-r618634062-El_Puerto_de_Barcelona-Barcelona_Catalonia.html", "text": "I wasn’t sure if a cruise was for me or not but after a week in Symphony of the Seas I’m a fan. It was a fantastic week with loads to see and do with a fantastic Cruise Line Royal Caribbean.", "publishedDate": "2018-09-22", "language": "en", "rating": 5}, {"id": 604954703, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d6401014-r604954703-El_Puerto_de_Barcelona-Barcelona_Catalonia.html", "text": "Nothing special.We  arrived on MSC Fantasia cruiseship on july 1918.It is well located, a short taxi ride to Ramblas about 7-8 euros.Busy port full of cargo, cruise ships and container ships.Nothing importance to see and do.Most of the tourists confuse it with Port Veil.No restaurants,bars,shopping only few souvenirs,finger food and refreshments in the terminal.", "publishedDate": "2018-08-10", "language": "en", "rating": 3}, {"id": 602656296, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d6401014-r602656296-El_Puerto_de_Barcelona-Barcelona_Catalonia.html", "text": "My wife and I had a short stop off in Barcelona whilst on a TUI cruiser and enjoyed the visit. The port lies at one end of Las Ramblas and is home to a shopping mall, a museum, aquarium, the (amazing) Christopher Columbus monument and, of course, the marina. Nearby there’s lots of bars and restaurants as well.", "publishedDate": "2018-08-04", "language": "en", "rating": 4}, {"id": 588352324, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d6401014-r588352324-El_Puerto_de_Barcelona-Barcelona_Catalonia.html", "text": "Fairly close to downtown Barcelona - a short cab ride from the central part of downtown Barcelona. Have had the pleasure of leaving from here on more than one ocassion.", "publishedDate": "2018-06-18", "language": "en", "rating": 5}, {"id": 583886122, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d6401014-r583886122-El_Puerto_de_Barcelona-Barcelona_Catalonia.html", "text": "The port area is large and quite typical of port areas and not that attractive and there are better places in Barcelona to visit. If visitors to barcelona on cruise ships got no further than the port area they would be disappointed and mis what Barcelona is all about.", "publishedDate": "2018-05-30", "language": "en", "rating": 3}, {"id": 583771280, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d6401014-r583771280-El_Puerto_de_Barcelona-Barcelona_Catalonia.html", "text": "We enjoyed a drive past while on tour and enjoyed views of the commercial harbour, ferry port, the marinas an the relatively new cruise port. We then visited the area while heading to Maremagnum and a couple of restaurants. When departing the City, all services at the Cruise Port were efficient and handled with aplomb by friendly staff. The area is served by excellent transport facilities.", "publishedDate": "2018-05-29", "language": "en", "rating": 5}, {"id": 577499909, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d6401014-r577499909-El_Puerto_de_Barcelona-Barcelona_Catalonia.html", "text": "Barcelona port, Royal Caribbean, Cruising Symphony of the seas. The ship is amazing and not to be missed !!  On the last day of the cruise we had to leave the ship by 9.30am but our flight was at 10pm. We booked on BAGBNB a place to leave our cases it was 5 Euro a case. The place was a bike shop called Mattia 46 just off the Ramblas. ( taxi cost 15 euro) We collected our bags at 7 pm, we found a bus (Aerobus) which goes from El Corte Ingles for 5 euro each and takes about 25 mins (instead of 39 euro taxi.) The only draw back is you need to walk all the way up the Ramblas with your cases. ", "publishedDate": "2018-05-02", "language": "en", "rating": 5}, {"id": 577072211, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d6401014-r577072211-El_Puerto_de_Barcelona-Barcelona_Catalonia.html", "text": "Getting off the boat was really easy, but once outside you're on your own!!!\nTaxis are on the right and limos on the left. If you get in the wrong line, you had to walk to the end of the line and then double back to the front of the taxi line.", "publishedDate": "2018-05-01", "language": "en", "rating": 3}, {"id": 569742958, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d6401014-r569742958-El_Puerto_de_Barcelona-Barcelona_Catalonia.html", "text": "So much glamour, wealth and pretty views fill this area so it's a great place to go for a stroll.  You'll see the huge ferries travelling to other countries (see pic), the floating sculptures on the abandoned buoys (see pic), the bridge (see pic)  to Maremagnum shopping centre (see pic) is very popular at night and stunning.  \n\nDuring the day there are markets where people set out their fake designer brand handbags, shoes, clothing etc on giant rugs on the ground, along the path heading toward the expensive yachts.  Lots of millionaire yachts (see pic) and generally a pretty area.", "publishedDate": "2018-03-30", "language": "en", "rating": 5}, {"id": 560930812, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d6401014-r560930812-El_Puerto_de_Barcelona-Barcelona_Catalonia.html", "text": "It was a cloudy day and we took the harbor tour.  Having been to Barcelona several times I enjoyed the perspective from the water.  The cruise terminal, the commercial port, sea wall and wonderful yacht harbor.", "publishedDate": "2018-02-16", "language": "en", "rating": 5}, {"id": 559564905, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d6401014-r559564905-El_Puerto_de_Barcelona-Barcelona_Catalonia.html", "text": "The Port is a cool place to unwind after a tiring day to relax and take a stroll along , admiring Yachts and the cruise ships anchored in close proximity. The pier walkway is clean and neat ..we can spot locals and tourists wandering around relaxing. The views are amazing at dust with gentle breeze.You can do numerous activities as there is Maremagnum Shopping Complex is there with restaurants cafeterias , you can hop on a Marina Tour Boat cruise to have some superb vies of the port, you can stroll along the boardwalk, there is an aquarium inside the complex. There are snacks food vendors and outlets around where in you can grab some crunchy or some beer , this is the best place to hit  with friends to have a cool and relaxing atmosphere ", "publishedDate": "2018-02-10", "language": "en", "rating": 4}, {"id": 559060520, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d6401014-r559060520-El_Puerto_de_Barcelona-Barcelona_Catalonia.html", "text": "Definitely the place to gawp at the magnificent super yachts of the rich. Dilbar was in whilst we walked around its obscenely huge and ostentatious. Well worth a visit lots of bars to grab a beer and tapa. On another note though it is Sad to see homeless on the streets of the marina when such wealth is on show", "publishedDate": "2018-02-07", "language": "en", "rating": 5}, {"id": 558885821, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d6401014-r558885821-El_Puerto_de_Barcelona-Barcelona_Catalonia.html", "text": "It’s a nice port with a lot of things to do, you can go to the aquarium, or you can go shopping... you can also make a boat trip where you can discover the port by boat, it’s very nice. ", "publishedDate": "2018-02-06", "language": "en", "rating": 3}, {"id": 551706014, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d6401014-r551706014-El_Puerto_de_Barcelona-Barcelona_Catalonia.html", "text": "Really beautiful and relaxing to walk along but its a bit more commercialised and built up than the rest of the city in that way. That doesn't make the sea not lovely to stroll along though and check out some obscene yachts", "publishedDate": "2018-01-05", "language": "en", "rating": 3}, {"id": 549969157, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d6401014-r549969157-El_Puerto_de_Barcelona-Barcelona_Catalonia.html", "text": "I heard that previously, the port was a real dump, sometime back they changed the area into something very nice.  A great walking area, lots of promenades/rivas, statues in the water, very well done.  There is a modern shopping mall on the water with three floors of stores and restaurants,  A bit pricy, but its all fun.  I think I would enjoy taking the tram ride over the water, but didn't today.  One en appears to be near the Montjuic aerial tram station.  Lots to see and do in the area, They also have an aquarium...", "publishedDate": "2017-12-29", "language": "en", "rating": 4}, {"id": 548787966, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d6401014-r548787966-El_Puerto_de_Barcelona-Barcelona_Catalonia.html", "text": "Spend a week in Barcelona for my husbands Birthday. We discovered El Puerto on our first night and took many walks there to enjoy a gentle breeze and stunning sunsets. There are restaurants and shops nearby as well as Mercado's and tourist places. Enjoyed living statues and music. There was no hassling and we met friendly locals.", "publishedDate": "2017-12-22", "language": "en", "rating": 4}, {"id": 548438773, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d6401014-r548438773-El_Puerto_de_Barcelona-Barcelona_Catalonia.html", "text": "Always nice to walk around the port especially when there are no cruise ships in town. The Maremagnum shopping mall at the end of the wooden pier is a major attraction. At its best at sunrise. ", "publishedDate": "2017-12-21", "language": "en", "rating": 4}, {"id": 546594690, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d6401014-r546594690-El_Puerto_de_Barcelona-Barcelona_Catalonia.html", "text": "I go there every weekend to see the sunset and watch the birds and people. Always see emotional scene between family, couples, friends, even the birds fighting for breads. \n\nI suggest you guys to bring beer and some friends together. Even you can go for yourself, don't forget the beer.  ", "publishedDate": "2017-12-11", "language": "en", "rating": 5}, {"id": 544761996, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d6401014-r544761996-El_Puerto_de_Barcelona-Barcelona_Catalonia.html", "text": "This is a nice place to come on a hot day.  Beautiful sea breezes and lots of sights. There are snack food vendors here as well as lovely architecture to gaze at.  The location is at the end of Las Ramblas.\n\nNote: If you need a washroom, head over to the Maritime Museum where you will find clean washrooms in the lobby (no entrance fee required).", "publishedDate": "2017-12-03", "language": "en", "rating": 4}, {"id": 544296909, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d6401014-r544296909-El_Puerto_de_Barcelona-Barcelona_Catalonia.html", "text": "Well, it's a port... there are boats...\nIt's worth it to walk along the piers that connect different areas of Barcelona.  We found some nice little restaurants and breweries around here, as well as a maritime museum.  It's fascinating to look at the ultra-luxury yachts.  Worth the trip and a great way to get some exercise!", "publishedDate": "2017-11-30", "language": "en", "rating": 3}, {"id": 543298855, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d6401014-r543298855-El_Puerto_de_Barcelona-Barcelona_Catalonia.html", "text": "Ensuring that this is the best port in the world is a bit arrogant (better to visit the ports of Istanbul or Naples), perhaps the only interest that is given is the arrival of cruises that are becoming increasingly polluting and overcrowded with this low cost tourism", "publishedDate": "2017-11-26", "language": "en", "rating": 3}, {"id": 543078525, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d6401014-r543078525-El_Puerto_de_Barcelona-Barcelona_Catalonia.html", "text": "If you enjoy the ocean breeze, this is for you. If you enjoy people watching, this is the place. Very relaxing, and the people are wonderful. Just sit back and enjoy.", "publishedDate": "2017-11-24", "language": "en", "rating": 4}, {"id": 542180024, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d6401014-r542180024-El_Puerto_de_Barcelona-Barcelona_Catalonia.html", "text": "Luckily we arrived three hours before embarcation. The terminal is too small to acomodate all travelers. As we were early we had a seat. Only one small cafe and the lavatories are not enough to acomodate the masses of people that go through here. To get here you best take a taxi otherwise you need to walk a few kilometres upwards a bridge. There is also a cruise-bus. The taxi-driver charged us the meter rate plus a 3.5 euro extra for entering the port. Why do i feel this is a rip-off???", "publishedDate": "2017-11-20", "language": "en", "rating": 3}, {"id": 538027711, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d6401014-r538027711-El_Puerto_de_Barcelona-Barcelona_Catalonia.html", "text": "Not far from the centre of Barcelona and near to the Airport. Not delightful but fully functional. Sometimes there are more than 5 cruise ships docked at any one time. ", "publishedDate": "2017-11-03", "language": "en", "rating": 4}, {"id": 537305214, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d6401014-r537305214-El_Puerto_de_Barcelona-Barcelona_Catalonia.html", "text": "I don't know why but I couldn't like this port thing. This is not well blended with the architecture of Barcelona.", "publishedDate": "2017-10-30", "language": "en", "rating": 2}, {"id": 535839408, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d6401014-r535839408-El_Puerto_de_Barcelona-Barcelona_Catalonia.html", "text": "We took a cruise from El Puerto de Barcelona.  Not easy to get there but a short taxi ride from the La Ramblas.", "publishedDate": "2017-10-25", "language": "en", "rating": 4}, {"id": 533683623, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d6401014-r533683623-El_Puerto_de_Barcelona-Barcelona_Catalonia.html", "text": "It is a very lovely place for an evening stroll - lots of action. Really a chill time break. Not sure I recommend restaurants there, in my experience restaurants at sites like this often cut back on the quality of the food while relying on the view for the wow-factor. We went to one of the restaurants anyway, and regretted it.", "publishedDate": "2017-10-17", "language": "en", "rating": 4}, {"id": 533384557, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d6401014-r533384557-El_Puerto_de_Barcelona-Barcelona_Catalonia.html", "text": "One of the most beautiful ports I've ever seen. When you're accompanied on the walk through the port with the one you love on a nice sunny day there is nothing more relaxing.", "publishedDate": "2017-10-16", "language": "en", "rating": 4}, {"id": 533380150, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d6401014-r533380150-El_Puerto_de_Barcelona-Barcelona_Catalonia.html", "text": "We had a stroll along here as a break for a change, It’s great to take time out & just watch the world go by, immaculately clean area too, in fact I think all of Barcelona is very well looked after, there’s a shopping centre with sea life centre lots of restaurants & plenty to do, but also many seating areas where you can just chill & watch the boats come & go, great location for a chillout", "publishedDate": "2017-10-16", "language": "en", "rating": 5}, {"id": 533266589, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d6401014-r533266589-El_Puerto_de_Barcelona-Barcelona_Catalonia.html", "text": "Walked around the Port because it was by the open air (Miami Style) mall. Beautiful view of sunset and so many places to eat, drink and shop!\nGreat!!", "publishedDate": "2017-10-15", "language": "en", "rating": 5}, {"id": 530274344, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d6401014-r530274344-El_Puerto_de_Barcelona-Barcelona_Catalonia.html", "text": "A pleasant atmosphere on the port, seeing boats for tourists filled up, watching the marina and the ocean in the horizon, and the amusement part and malls in the southern part of the port, with their great restaurants - what else can you ask for? We went there twice, it was so much fun.", "publishedDate": "2017-10-05", "language": "en", "rating": 5}, {"id": 530209688, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d6401014-r530209688-El_Puerto_de_Barcelona-Barcelona_Catalonia.html", "text": "we had a cloudy day so we had a walk around the port area. its really worth the while to go and see the beautiful super yachts, and boats there. there is a good selection of shops and restaurants too. Barcelona is a lovely city, and this place is just a very small part of it.", "publishedDate": "2017-10-05", "language": "en", "rating": 5}, {"id": 527413280, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d6401014-r527413280-El_Puerto_de_Barcelona-Barcelona_Catalonia.html", "text": "beautiful views of the sea and amazing  boats and liners ,the shoppin center there is really good with good bars and restraunts ", "publishedDate": "2017-09-25", "language": "en", "rating": 5}, {"id": 527400208, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d6401014-r527400208-El_Puerto_de_Barcelona-Barcelona_Catalonia.html", "text": "Busy port full of cargo, tanker and cruise ships.  Big area to accommodate all of the traffic.  We left on a cruise ship from this port and it worked well with good traffic flow and good staffing to assist passengers.", "publishedDate": "2017-09-25", "language": "en", "rating": 4}, {"id": 525959464, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d6401014-r525959464-El_Puerto_de_Barcelona-Barcelona_Catalonia.html", "text": "We visited a couple of times during our city stay and it was lovely. Really nice area to look at expensive boats - if that's your thing. Or to sit and people-watch. Peaceful area near the shopping centre with lots of seats and places to grab a coffee.", "publishedDate": "2017-09-20", "language": "en", "rating": 4}, {"id": 521244307, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d6401014-r521244307-El_Puerto_de_Barcelona-Barcelona_Catalonia.html", "text": "Very accessible clean port. There is a large mall and aquarium at the port. We visited areas while we were on the hop on hop off bus. We felt secure in the area.", "publishedDate": "2017-09-04", "language": "en", "rating": 5}, {"id": 519444694, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d6401014-r519444694-El_Puerto_de_Barcelona-Barcelona_Catalonia.html", "text": "El Puerto de Barcelona it´s well located, big and easy to move! It´s not so far from the turistic zones, like, Las Ramblas, it´s 10min by taxi. \nGreat View in the evening!", "publishedDate": "2017-08-30", "language": "en", "rating": 3}, {"id": 518734996, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d6401014-r518734996-El_Puerto_de_Barcelona-Barcelona_Catalonia.html", "text": "Nice marina with a lot of yachts and a Mall available also in the zone.\nTo many street sellers for my taste.", "publishedDate": "2017-08-29", "language": "en", "rating": 4}, {"id": 518246194, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d6401014-r518246194-El_Puerto_de_Barcelona-Barcelona_Catalonia.html", "text": "this is one of the great places that BCN offers - walking distance to the old city, the hip city, the art city, the food city, the beach city. a little bit of a walk and you arrive at everywhere - restaurants, museum, events, shops. ", "publishedDate": "2017-08-28", "language": "en", "rating": 5}, {"id": 517690710, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d6401014-r517690710-El_Puerto_de_Barcelona-Barcelona_Catalonia.html", "text": "Spent a relaxing hour sitting on a park bench in the shade on a steamy, hot day watching the passerbys and eating ice cream. The marina is lovely and very close to many bus stops. Nice stroll to a very crowded Barcenoletta beach. Just be aware that there are many hawkers selling their wares along the sidewalks. As soon as the police are in sight, they quickly roll up their good and are on their way only to return a short time later.", "publishedDate": "2017-08-26", "language": "en", "rating": 4}, {"id": 515413192, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d6401014-r515413192-El_Puerto_de_Barcelona-Barcelona_Catalonia.html", "text": "The area is Great for a walk or run.\nWatch the ships, the sea the surrounding monuments and Architecture. \nVery special atmosphere when the sun is rising.", "publishedDate": "2017-08-20", "language": "en", "rating": 4}, {"id": 512793122, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d6401014-r512793122-El_Puerto_de_Barcelona-Barcelona_Catalonia.html", "text": "This beach is really near the city, it is very nice, and getting a big facelift . Restaurants nearby, and shops.", "publishedDate": "2017-08-14", "language": "en", "rating": 4}, {"id": 510594867, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d6401014-r510594867-El_Puerto_de_Barcelona-Barcelona_Catalonia.html", "text": "El puerto de Barcelona is yet another sight you have to see when visiting Barcelona. It has so much diversity and is so alive just like the rest of the city! The sea, the restaurants, the people, the atmosphere complete the space!", "publishedDate": "2017-08-09", "language": "en", "rating": 4}, {"id": 508097430, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d6401014-r508097430-El_Puerto_de_Barcelona-Barcelona_Catalonia.html", "text": "We were there for a stroll and lunch but ended on a 1 hour cruise that toom us around the port. It was nice catching view of the huge ships parked on the other side", "publishedDate": "2017-08-02", "language": "en", "rating": 3}, {"id": 507962583, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d6401014-r507962583-El_Puerto_de_Barcelona-Barcelona_Catalonia.html", "text": "In this place can to see the blue sea,  large cargo ships and cruises. Always are a lot of people. There is a mall, shops and, restaurant. ", "publishedDate": "2017-08-01", "language": "en", "rating": 4}, {"id": 505142385, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d6401014-r505142385-El_Puerto_de_Barcelona-Barcelona_Catalonia.html", "text": "If you want a 3 hour relaxing sailing trip in Barcelona this is your chance! Starting from this marina and for €77 I had a lovely day out in the ocean, went for a swim and came back! I was lucky that there was only one other person and we were treated like royalty! Thank you Polo and airbnb for this opportunity! ", "publishedDate": "2017-07-24", "language": "en", "rating": 5}, {"id": 502892855, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d6401014-r502892855-El_Puerto_de_Barcelona-Barcelona_Catalonia.html", "text": "In one of the tours that we had we got to stop here for 20 min, A lot of people took pictures of the boats and the panoramic scene. It a nice place to visit but I wouldnt spend much time here", "publishedDate": "2017-07-17", "language": "en", "rating": 3}, {"id": 501975776, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d6401014-r501975776-El_Puerto_de_Barcelona-Barcelona_Catalonia.html", "text": "Passed this on the tour bus, got off to explore. Not the best shopping mall, and only a few restaurants. All mainly fish based menu which restricted our dining, as my daughter has a shell fish allergy. The actual Marina  is very busy, with lots of boats. The sand looked very clean, and the water very clear.", "publishedDate": "2017-07-14", "language": "en", "rating": 4}, {"id": 501890656, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d6401014-r501890656-El_Puerto_de_Barcelona-Barcelona_Catalonia.html", "text": "Had to see this as we were riding the on and off bus. Would never make a point of going here unless I had to - e.g. cruise ships dock here and there is nothing of significant history or importance to see. If you like touristy places for the sake of chilling with tourists (like the pickpocket people out there) then this is your spot! Enjoy.", "publishedDate": "2017-07-14", "language": "en", "rating": 2}, {"id": 501549897, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d6401014-r501549897-El_Puerto_de_Barcelona-Barcelona_Catalonia.html", "text": "Its a nice place to have lunch or dinner or maybe just walk or sit in a coffee shop. People are all around. You can also go to the aquarium . You will have enjoy your time there.", "publishedDate": "2017-07-13", "language": "en", "rating": 4}, {"id": 501480836, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d6401014-r501480836-El_Puerto_de_Barcelona-Barcelona_Catalonia.html", "text": "Expect long walk under the sun without much shade. Other than the harbor itself, there isn't much shops and cafes to hang around on the way to the aquarium.", "publishedDate": "2017-07-12", "language": "en", "rating": 3}, {"id": 501062793, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d6401014-r501062793-El_Puerto_de_Barcelona-Barcelona_Catalonia.html", "text": "Here you will find a lot of tapas restaurant, great view and a lot of people. There is a plaza where people gather. There is one of those bridges that it opens to let boats go through.", "publishedDate": "2017-07-11", "language": "en", "rating": 1}, {"id": 500275089, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d6401014-r500275089-El_Puerto_de_Barcelona-Barcelona_Catalonia.html", "text": "If you love being around the water, you have to go there. It is so relaxing, even though there's always a lot of people. Have a drink, enjoy the view, listen to the see gulls and the boats, and just enjoy that moment.", "publishedDate": "2017-07-10", "language": "en", "rating": 4}, {"id": 499675240, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d6401014-r499675240-El_Puerto_de_Barcelona-Barcelona_Catalonia.html", "text": "Love the area. Besides the nice walk one finds a shopping centre and theaquarium which we visited and enjoyed.  A must visit for all the family. Great time.", "publishedDate": "2017-07-08", "language": "en", "rating": 5}, {"id": 499052157, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d6401014-r499052157-El_Puerto_de_Barcelona-Barcelona_Catalonia.html", "text": "Fab place to while away a few hours , spotless lotads of shops restaurants , cafes etc great for all ages and lots of boat trips to choose from if needed ", "publishedDate": "2017-07-06", "language": "en", "rating": 5}, {"id": 498727065, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d6401014-r498727065-El_Puerto_de_Barcelona-Barcelona_Catalonia.html", "text": "near the port is Columb statue, many taverns, Catalunya Museum, beach\nis a good place with excellent view\nis to arrive bus or subway", "publishedDate": "2017-07-04", "language": "en", "rating": 4}, {"id": 497875087, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d6401014-r497875087-El_Puerto_de_Barcelona-Barcelona_Catalonia.html", "text": "was lovely to be able to walk down the pontoon and shop then sit on a bench in the sun actually on the seafront ", "publishedDate": "2017-07-02", "language": "en", "rating": 5}, {"id": 494602654, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d6401014-r494602654-El_Puerto_de_Barcelona-Barcelona_Catalonia.html", "text": "Lots of people here but with enough space to see the great old buildings,and the cable car looks spectacular and is quite cheap.", "publishedDate": "2017-06-20", "language": "en", "rating": 5}, {"id": 494579184, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d6401014-r494579184-El_Puerto_de_Barcelona-Barcelona_Catalonia.html", "text": "Do not miss this for the world if you are in Barcelona. It has a quite expensive commercial center(MareMagnum), nice places to eat or have a beer, a very clean wooden platform(washed every morning), cleaner than I had in my hotel room, excellent places to sit and relax by the sea, to watch all the cruise vessels, the yachts, small boats coming and going out. If you are there at around 19.00, you can see a big passenger vessel approaching and mooring in the narrow part of the port(the one closer to the wooden platform). Impressive indeed!!! Great maneuver of that captain.  ", "publishedDate": "2017-06-20", "language": "en", "rating": 5}, {"id": 493395876, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d6401014-r493395876-El_Puerto_de_Barcelona-Barcelona_Catalonia.html", "text": "Loads to see, bars, restaurants, boats, cable cars, statues, people watching! \n\nLoved Barcelona full stop. Such a varied place to visit with great shops, markets, streets, activities and a beach too! \n\nGreat time to be had here!", "publishedDate": "2017-06-15", "language": "en", "rating": 5}, {"id": 489657489, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d6401014-r489657489-El_Puerto_de_Barcelona-Barcelona_Catalonia.html", "text": "Spent our first afternoon in Barcelona here. A very pleasant walk. There is a large shopping center full of high end label shops but we didn't go there.", "publishedDate": "2017-06-01", "language": "en", "rating": 4}, {"id": 489629736, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d6401014-r489629736-El_Puerto_de_Barcelona-Barcelona_Catalonia.html", "text": "the beach is beautiful and theirs a lot going on. people are really active but the best part are the bars on the beach and the restaurants along the port.", "publishedDate": "2017-06-01", "language": "en", "rating": 5}, {"id": 489212867, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d6401014-r489212867-El_Puerto_de_Barcelona-Barcelona_Catalonia.html", "text": "The old port of Barcelona lies at one end of Las Ramblas and is now home to a shopping mall, a museum, aquarium, Christopher Columbus monument and a marina. The marina is home to a lot of yachts including some super yachts while the aquarium is one of the biggest in Europe.\n\nIt still serves as a port for cruise ships and harbor cruises also depart from here as does the cable car.\n\nThe port offers great sunset views and is a great place for a nice evening walk or a quiet dinner overlooking the sea. \n\nDefinitely worth a visit.", "publishedDate": "2017-05-30", "language": "en", "rating": 4}, {"id": 488414924, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d6401014-r488414924-El_Puerto_de_Barcelona-Barcelona_Catalonia.html", "text": "Spent 3 days in Barcelona before getting on our cruise ship.  Took a couple of early morning walks down by the port.  Great spot.  Also had lunch there one day.  Lots of restaurant choices.  Cruise ship terminal is at the far end.  Definitely need a cab ride.  The taxi from our hotel to the terminal took about 10 minutes, most of which was in traffic on Las Ramblas.  Wouldn't hesitate to catch a ship there again.", "publishedDate": "2017-05-28", "language": "en", "rating": 5}, {"id": 487502895, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d6401014-r487502895-El_Puerto_de_Barcelona-Barcelona_Catalonia.html", "text": "We walked all around the water edge and saw so many boats.  Very fun with shops and cafes and yachts.  Enjoyed everything.", "publishedDate": "2017-05-24", "language": "en", "rating": 5}, {"id": 486503116, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d6401014-r486503116-El_Puerto_de_Barcelona-Barcelona_Catalonia.html", "text": "Went to the port and off on the boat that goes round the port.  Just beautiful and informative about the city.  Nice and relaxing morning and on the plus side weather was fantastic.", "publishedDate": "2017-05-22", "language": "en", "rating": 5}, {"id": 485910192, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d6401014-r485910192-El_Puerto_de_Barcelona-Barcelona_Catalonia.html", "text": "It will take approximately 20 minutes to get to town from the ship once you clear customs.  I highly recommend a taxi or a excursion to maximize your time.  The city is easy to walk around.  The port is huge and also serves cargo.", "publishedDate": "2017-05-20", "language": "en", "rating": 5}, {"id": 485785368, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d6401014-r485785368-El_Puerto_de_Barcelona-Barcelona_Catalonia.html", "text": "Decently located and clean.....felt sorry for those that thought it was an \"easy\" walk to board their cruise ships.....our exprience was a LONG line for check in...but that of course is depending on the cruise line.  \n\nNice views once you are onboard....taxis readily available....what can you say about a cruise port?  OH!  The DO have a snack bar and alcohol is availabe to purchase while waiting to check in....helps with those LONG lines!", "publishedDate": "2017-05-19", "language": "en", "rating": 3}, {"id": 485490755, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d6401014-r485490755-El_Puerto_de_Barcelona-Barcelona_Catalonia.html", "text": "We arrived on a cruise ship at the port and easily was able to transfer to our cab in the designated waiting area quickly and efficiently.  The port is really big, and if you are only docked there for a day you need a shuttle into town.", "publishedDate": "2017-05-18", "language": "en", "rating": 4}, {"id": 485298200, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d6401014-r485298200-El_Puerto_de_Barcelona-Barcelona_Catalonia.html", "text": "The port is really nice. We had a sail there with sea-Barcelona and really enjoyed it. Moreover it offers great views on the city skyline.", "publishedDate": "2017-05-18", "language": "en", "rating": 5}, {"id": 484887306, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d6401014-r484887306-El_Puerto_de_Barcelona-Barcelona_Catalonia.html", "text": "A boat trip is well worth taking,it only goes around the harbour but it isn't expensive & takes about an hour,you can get a coffee or drink on board,Don't go round the aquarium,it's expensive & very busy, they let in too many people & you can't see much because of the crowds,it was a Sunday when we went so there would be lots of families there,maybe a bad choice on our part.", "publishedDate": "2017-05-17", "language": "en", "rating": 5}, {"id": 484761025, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d6401014-r484761025-El_Puerto_de_Barcelona-Barcelona_Catalonia.html", "text": "Restaurants, shops, fish, close to hop on hop off bus route, aerial tram ride, friendly people, just plain nice!", "publishedDate": "2017-05-16", "language": "en", "rating": 5}, {"id": 483440066, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d6401014-r483440066-El_Puerto_de_Barcelona-Barcelona_Catalonia.html", "text": "There seems to be a nice breeze coming off of the ocean here.  A nice walkway follows along the port.  Good for a stroll and to see the yachts that have come into port!  ", "publishedDate": "2017-05-11", "language": "en", "rating": 4}, {"id": 483342892, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d6401014-r483342892-El_Puerto_de_Barcelona-Barcelona_Catalonia.html", "text": "There is a shopping centre at the marina with various restaurants & bars.  Sundays & holidays it can get busy though.  You can walk around the back of the shopping centre & its much quieter, with seats too.  There are some amazing, huge cruiser boats around the marina if thats something of interest. Also a cable car going across the area for quicker access to the beach.", "publishedDate": "2017-05-10", "language": "en", "rating": 4}, {"id": 482867725, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d6401014-r482867725-El_Puerto_de_Barcelona-Barcelona_Catalonia.html", "text": "Modern and well designed area for either shopping or just sitting watching the world go by. There are some mega yachts here and lots of extremely wealthy people! The shopping area is accessed over a swing bridge so if you approach and see huge queues it is just people waiting for a boat to leave the harbour. It didn't take very long but at high season the wait maybe longer.", "publishedDate": "2017-05-09", "language": "en", "rating": 4}, {"id": 482118358, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d6401014-r482118358-El_Puerto_de_Barcelona-Barcelona_Catalonia.html", "text": "Nice place, there are many attractions - aquarium, big mall, etc. On weekends it is quite full of people.", "publishedDate": "2017-05-06", "language": "en", "rating": 4}, {"id": 481670924, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d6401014-r481670924-El_Puerto_de_Barcelona-Barcelona_Catalonia.html", "text": "Many attractions (The Aquarium) shops, bars. Great for spending time and money. Take a break and sit down for a cup of coffe or glass of sangria ", "publishedDate": "2017-05-04", "language": "en", "rating": 5}, {"id": 480049528, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d6401014-r480049528-El_Puerto_de_Barcelona-Barcelona_Catalonia.html", "text": "Its a big place were you can have a nice walk, look at some ships, see the water and take some pictures. ", "publishedDate": "2017-04-29", "language": "en", "rating": 4}, {"id": 479494148, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d6401014-r479494148-El_Puerto_de_Barcelona-Barcelona_Catalonia.html", "text": "Very disappointed on last day of our cruise to find there were no left luggage lockers at the port. As we had a late flight, we had to take our cases to a company near the Hard Rock Cafe in Carrer Estruca, which is at far end of la Rambla in Playa Catalunya, so that we could spend the day sightseeing.", "publishedDate": "2017-04-27", "language": "en", "rating": 3}]}}]