[{"locationId": 2235346, "name": "Fran Daurel Foundation (Fundacio Fran Daurel)", "placeType": "ATTRACTION", "reviewListPage": {"reviews": [{"id": 751322945, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d2235346-r751322945-Fran_Daurel_Foundation_Fundacio_Fran_Daurel-Barcelona_Catalonia.html", "text": "It is a small contemporary art museum inside Poble Espanyol. The entrance was free so why not visit it. It has a lot of beautiful pieces of art inside although no pictures are allowed. That did disappoint me because I always like to keep photos of each museum in my archives and for further study. \nAnyway, if you do visit Poble Espanyol, do visit this small museum as well.", "publishedDate": "2020-03-18", "language": "en", "rating": 3}, {"id": 735121595, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d2235346-r735121595-Fran_Daurel_Foundation_Fundacio_Fran_Daurel-Barcelona_Catalonia.html", "text": "A nice bonus to the Poble Espanol visit was the entry to this museum which turned out to be very interesting and had lots of pieces by local artists such as Picasso and Miro ,free entry as well", "publishedDate": "2019-12-28", "language": "en", "rating": 5}, {"id": 568159860, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d2235346-r568159860-Fran_Daurel_Foundation_Fundacio_Fran_Daurel-Barcelona_Catalonia.html", "text": "So we went to the themed Spanish (Disney Like) display town on a lark and stumbled onto this delightful modern art museum.  It is like a single floor of most modern art museum's and has a very lovely and balanced selection of painting and sculpture.   A really nice treat of a spot.", "publishedDate": "2018-03-22", "language": "en", "rating": 4}, {"id": 388539270, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d2235346-r388539270-Fran_Daurel_Foundation_Fundacio_Fran_Daurel-Barcelona_Catalonia.html", "text": "I like art -- to a point. This museum gives you access to some very interesting pieces, but is small, so you're not there all day. Part of Spanish Village. ", "publishedDate": "2016-07-02", "language": "en", "rating": 5}, {"id": 146240472, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d2235346-r146240472-Fran_Daurel_Foundation_Fundacio_Fran_Daurel-Barcelona_Catalonia.html", "text": "The gallery itself was wonderful. They have Picasso, Miro, and Dali, Ponc and a long list of others, collecting paintings, drawings, sculptures, graphics, tapiseries and others since 70s. \n\nThere are just two minor problems. They are located in Spanish village (Pueblo Espanol) so every time you should pay 11 Euros and you can’t get to their shop without paying the entrance to Spanish village. But it doesn’t mind, because they have just catalogue for 30 EUR. This is actually available on their website. The other problem is, they don’t have monographies of those authors nor big posters.\n\nI was there twice. There is also open air exhibition of sculptures in Spanish villages. I haven’t been to other galleries in Barcelona as this was good enough to me.", "publishedDate": "2012-11-26", "language": "en", "rating": 4}]}}]