[{"locationId": 246171, "name": "Basílica de Santa Maria del Mar", "placeType": "ATTRACTION", "reviewListPage": {"reviews": [{"id": 752861688, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d246171-r752861688-Basilica_de_Santa_Maria_del_Mar-Barcelona_Catalonia.html", "text": "amazing and almost indescribable...many ways to see this edifice...however even in off season there were lines and lines...try also the park and houses gaudi designed farther back in the city", "publishedDate": "2020-04-23", "language": "en", "rating": 5}, {"id": 752857870, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d246171-r752857870-Basilica_de_Santa_Maria_del_Mar-Barcelona_Catalonia.html", "text": "This Basilica was incredible!  I would highly recommend the tour.  It wasn't too long, and it didn't cost much, but still provided some of the best views I saw of Barcelona!  The history was fascinating too.  ", "publishedDate": "2020-04-23", "language": "en", "rating": 5}, {"id": 752797128, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d246171-r752797128-Basilica_de_Santa_Maria_del_Mar-Barcelona_Catalonia.html", "text": "A classically beautiful church, worth a look and the journey brings to you a beautiful and happening area. Well worth the visit.", "publishedDate": "2020-04-21", "language": "en", "rating": 4}, {"id": 752564293, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d246171-r752564293-Basilica_de_Santa_Maria_del_Mar-Barcelona_Catalonia.html", "text": "\"Santa Maria del Mar\" is similary to the \"La Catedral de la Santa Creu i Santa Eulàlia\" in the Barri Gòtic district. Beside the \"La Sagrada Familia\", both cathedrals are very beautiful and impressive. \nAlready from the architecture it is an imposing building, worth to visit, even when not religious. It is definitely worth a visit.\n\nSanta Maria del Mar is a Gothic church, with a purity and uniformity of style that is otherwise unusual for large medieval buildings.\nWith its monumental towers, the church looks like a fortress from the outside. This is also due to the early period when the church was built, in the 14th century. In contrast to the facade, with the narrow streets, the interior gives the impression of spaciousness. It corresponds to the basilica type, with three naves that form a single room without transept. There is no architectural boundary between the main nave and the presbytery. Worth seeing is the concentration of the vault load on a few points, so that the simple rib vault of the main nave is supported by only four slim, octagonal columns.\nThe interior, with its 3 naves, shines wonderfully in the sunlight and is impressively designed with many decorations and with a lot of love for details. \n\nA tour of the church, a possibility, but not a must. However, in addition to interesting stories about the construction, the tour also offers the possibility of a spectacular view from the roof.\n\nVery worthwhile! A clear recommendation!\nAnd as with everything in Barcelona, ​​order tickets online. Then you save yourself the tedious and long queues.", "publishedDate": "2020-04-13", "language": "en", "rating": 5}, {"id": 752019348, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d246171-r752019348-Basilica_de_Santa_Maria_del_Mar-Barcelona_Catalonia.html", "text": "Beautiful Gothic Church in the Ribera District/Gothic Quarter of Barelona.  We were on a tour at the time and despite going back later in the day, we didn't get to see the interior of this magnificent building.", "publishedDate": "2020-03-29", "language": "en", "rating": 5}, {"id": 751624917, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d246171-r751624917-Basilica_de_Santa_Maria_del_Mar-Barcelona_Catalonia.html", "text": "This is a really beautiful basilica. Sure it doesn’t compare to Sagrada Família. But once you’ve seen that you really should come here also make sure you go to the roof the views are beautiful. It’s really easy to get at all here as well and I would recommend you do it it’s got a really interesting history. We only spent an hour here in total but it was a really good hour well spent. ", "publishedDate": "2020-03-22", "language": "en", "rating": 5}, {"id": 750986183, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d246171-r750986183-Basilica_de_Santa_Maria_del_Mar-Barcelona_Catalonia.html", "text": "Really enjoyed spending some time wandering around inside this gorgeous old building.  Well worth a visit.", "publishedDate": "2020-03-15", "language": "en", "rating": 5}, {"id": 750962931, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d246171-r750962931-Basilica_de_Santa_Maria_del_Mar-Barcelona_Catalonia.html", "text": ".... from the tower of this Basilica and should not be missed. By walking inside it looks much bigger than from outside expected.", "publishedDate": "2020-03-15", "language": "en", "rating": 5}, {"id": 750733074, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d246171-r750733074-Basilica_de_Santa_Maria_del_Mar-Barcelona_Catalonia.html", "text": "I took the guided tour of the church and rooftop. My guide was very knowledgeable and gave a lot of interesting details about the building of the church. After the official tour, I went on my own to the balconies to see the inner church from above. There are beautiful devotional images in the side chapels .", "publishedDate": "2020-03-13", "language": "en", "rating": 5}, {"id": 750506395, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d246171-r750506395-Basilica_de_Santa_Maria_del_Mar-Barcelona_Catalonia.html", "text": "Our hotel was located near this church and we were so happy to visit it and absorb the energy that surrounds it on a daily basis. ", "publishedDate": "2020-03-11", "language": "en", "rating": 5}, {"id": 750479075, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d246171-r750479075-Basilica_de_Santa_Maria_del_Mar-Barcelona_Catalonia.html", "text": "This was an amazing church to visit.  The inside is just too beautiful for words.  This was one of our favorite churches to visit.", "publishedDate": "2020-03-11", "language": "en", "rating": 5}, {"id": 750474104, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d246171-r750474104-Basilica_de_Santa_Maria_del_Mar-Barcelona_Catalonia.html", "text": "Absolutely worth it. Not only was the view amazing, but our guide was incredibly knowledgeable, with a great sense of humor. It is impossible to visit Barcelona and not make a stop here.", "publishedDate": "2020-03-11", "language": "en", "rating": 5}, {"id": 750101478, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d246171-r750101478-Basilica_de_Santa_Maria_del_Mar-Barcelona_Catalonia.html", "text": "Our favorite church in Barcelona,  probably one of the most beautiful, and there is always something interesting going on here.\nThis Christmas we could take part in an unusual show organized by the faithful from South America.\nThere were songs, dances and a great Christmas fiesta.\nMajka and Ryszard from Poland\n \nNasz ulubiony kościół w Barcelonie, chyba jeden z najładniejszych, i zawsze się tutaj coś dzieje ciekawego.\nW te Święta Bożego Narodzenia mogliśmy brać udział w niecodziennym pokazie zorganizowanym przez wiernych z Ameryki Południowej.\nByły śpiewy, tańce i wspaniała fiesta bożenarodzeniowa.\nMajka i Ryszard z Polski", "publishedDate": "2020-03-09", "language": "en", "rating": 5}, {"id": 749776378, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d246171-r749776378-Basilica_de_Santa_Maria_del_Mar-Barcelona_Catalonia.html", "text": "The tour guide was very interesting and had a lot of knowledge. The church itself was beautiful and the worth the visit. The view from the rooftop was amazing", "publishedDate": "2020-03-07", "language": "en", "rating": 5}, {"id": 749753867, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d246171-r749753867-Basilica_de_Santa_Maria_del_Mar-Barcelona_Catalonia.html", "text": "You are allowed to enter the basilica in the morning for free of charge. We went at 9am and were allowed in for free. Otherwise, I believe the fee is nominal for donation. There was no line. Bags were checked at the door by security. There are many worshipers inside so be respectful of their worship area and time. It would have been nice to have a guide to provide some information and explanation of what we were looking at. The plaques on the wall are difficult to understand... not all are in English. From what I’ve understood, the dates on the plaques are the dates that the artists completed the individual chapels and not the dates of the Saints lives or deaths. There is so much to look at. So much detail. So much art. It can take as little as walking through in 10 minutes or you can spend a considerable amount of time contemplating each chapel’s art. \nOverall, it is beautiful and worth a visit.", "publishedDate": "2020-03-07", "language": "en", "rating": 5}, {"id": 749665882, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d246171-r749665882-Basilica_de_Santa_Maria_del_Mar-Barcelona_Catalonia.html", "text": "The icon of Catalan Gothic! Definitely worth visiting because of the architecture! When visiting in the evening times, you can expect not many people!", "publishedDate": "2020-03-07", "language": "en", "rating": 5}, {"id": 749031689, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d246171-r749031689-Basilica_de_Santa_Maria_del_Mar-Barcelona_Catalonia.html", "text": "The ancient architecture at its best. Its a must see in Barcelona.\nNestled in the city arena is this amazing church that was impressive. Makes one marvel at ancient ways of working.", "publishedDate": "2020-03-04", "language": "en", "rating": 4}, {"id": 749004844, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d246171-r749004844-Basilica_de_Santa_Maria_del_Mar-Barcelona_Catalonia.html", "text": "We only visited this building from the outside, but it was still very impressive. Beautiful pictures can be taken here, and a definite must to visit.", "publishedDate": "2020-03-03", "language": "en", "rating": 4}, {"id": 748687955, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d246171-r748687955-Basilica_de_Santa_Maria_del_Mar-Barcelona_Catalonia.html", "text": "This was very close to our hotel in the gothic quarter and we enjoyed walking up every morning and seeing the sun come up over the Cathedral. Really nice area and plaza. At night there is a lot of bands and dancers that perform in the square.", "publishedDate": "2020-03-02", "language": "en", "rating": 4}, {"id": 748344424, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d246171-r748344424-Basilica_de_Santa_Maria_del_Mar-Barcelona_Catalonia.html", "text": "All the carvings were amazing, they looked so fragile but had been there for hundreds of years. Loved the time we spent there", "publishedDate": "2020-02-29", "language": "en", "rating": 4}, {"id": 748197813, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d246171-r748197813-Basilica_de_Santa_Maria_del_Mar-Barcelona_Catalonia.html", "text": "We really liked the Basilica and visited it twice on a recent visit to the city.  It is a beautiful old building that stands well against the other traditional \"super\" Basilica's throughout Europe.  We really liked the surround neighborhood too.  Nice shops, clean, nice people.  This one is easy to find from most of the center hotels--don't miss it.", "publishedDate": "2020-02-28", "language": "en", "rating": 4}, {"id": 748135884, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d246171-r748135884-Basilica_de_Santa_Maria_del_Mar-Barcelona_Catalonia.html", "text": "We found the Basilica on Google maps. It's in the Gothic area. We wanted to see the Roman wall and buildings beside it as well. They were amazing. The church was impressive in the front, but in typical Catholic fashion, you have to pay to get in. Wonder what Jesus has to say about that?", "publishedDate": "2020-02-28", "language": "en", "rating": 3}, {"id": 747960387, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d246171-r747960387-Basilica_de_Santa_Maria_del_Mar-Barcelona_Catalonia.html", "text": "Barcelona had incredible churches, and after missing our window to enter the Basilica Sagrada, we stumbled into this one. We were blown away by the beauty in every detail of this church and would highly recommend to anyone in the area! ", "publishedDate": "2020-02-27", "language": "en", "rating": 5}, {"id": 747896542, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d246171-r747896542-Basilica_de_Santa_Maria_del_Mar-Barcelona_Catalonia.html", "text": "We had a tour booked with Paul, who was very knowledgeable and friendly. The whole experience was superb, thank you.", "publishedDate": "2020-02-27", "language": "en", "rating": 5}, {"id": 747798280, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d246171-r747798280-Basilica_de_Santa_Maria_del_Mar-Barcelona_Catalonia.html", "text": "Good to call in and feel at one with yourself, thinking how lucky you have been and how you are ready to help others have the same good journey.", "publishedDate": "2020-02-26", "language": "en", "rating": 5}, {"id": 747451068, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d246171-r747451068-Basilica_de_Santa_Maria_del_Mar-Barcelona_Catalonia.html", "text": "This is a beautiful church, but try to go when it is free.  It's worth the cost when it's free, but when you have to pay....", "publishedDate": "2020-02-24", "language": "en", "rating": 4}, {"id": 747348333, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d246171-r747348333-Basilica_de_Santa_Maria_del_Mar-Barcelona_Catalonia.html", "text": "The guided tour to the rooftops was excellent. Our guide explained just enough history: not so much it was overwhelming or boring, but enough that we could really appreciate the architecture and history of the church. The guide also had excellent visual aids to help discuss the construction of the church and how it compared to others of that time period. The views from the rooftops were wonderful and it was so cool to get to see the church from a different perspective. \n\nThe church is beautiful, we enjoyed wandering around after the tours and seeing all the different saints.", "publishedDate": "2020-02-24", "language": "en", "rating": 5}, {"id": 747079636, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d246171-r747079636-Basilica_de_Santa_Maria_del_Mar-Barcelona_Catalonia.html", "text": "Lovely church to visit as we wandered around the Gothic quarter.  Not busy at all. Wandered to see the different saints around the church and sat down to look up at the architecture! ", "publishedDate": "2020-02-23", "language": "en", "rating": 3}, {"id": 746639198, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d246171-r746639198-Basilica_de_Santa_Maria_del_Mar-Barcelona_Catalonia.html", "text": "Skip the line booking was an excellent service we gained access to the building quite quickly and we were not disappointed what an absolute magnificent building in the centre of Barcelona. The exterior was impressive and the interior was so beautiful. A small gift shop inside closes at 6pm.", "publishedDate": "2020-02-21", "language": "en", "rating": 5}, {"id": 746441432, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d246171-r746441432-Basilica_de_Santa_Maria_del_Mar-Barcelona_Catalonia.html", "text": "We met the tour guide, Jenny, at the designated spot at the designated time.  She was highly informative and just a pleasure to spend time with. It gave a great understanding of the history and layout of the city.  She pointed out architectural design that would certainly have missed culminating at Sagrada Familia,  which is magnificent!", "publishedDate": "2020-02-20", "language": "en", "rating": 5}, {"id": 746332468, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d246171-r746332468-Basilica_de_Santa_Maria_del_Mar-Barcelona_Catalonia.html", "text": "Grand church in scale & design. Parts are being restored but the true essence remains in its beauty. One gains a sense of reverence when entering; its beautiful stained glass, arches, high ceilings gives one (at least me) time for quiet contemplation & moments of being truly present. Worth a visit!", "publishedDate": "2020-02-20", "language": "en", "rating": 5}, {"id": 745190761, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d246171-r745190761-Basilica_de_Santa_Maria_del_Mar-Barcelona_Catalonia.html", "text": "Just talking a looking and enjoying this beautiful temple in Barcelona. The city is full of amazing buildings like churches, temples and many other monuments. It’s a must to visit!!!!!", "publishedDate": "2020-02-15", "language": "en", "rating": 4}, {"id": 744635921, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d246171-r744635921-Basilica_de_Santa_Maria_del_Mar-Barcelona_Catalonia.html", "text": "This tour was magnificent. The history and neighborhood of Santa Maria Basilica were worth the small fee to pay. Once we were on the roof, the views of Barcelona are breathtaking. ", "publishedDate": "2020-02-12", "language": "en", "rating": 5}, {"id": 744274424, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d246171-r744274424-Basilica_de_Santa_Maria_del_Mar-Barcelona_Catalonia.html", "text": "Amazing place with miracle atmosphere\nWe had visited this cathedral in the evening, so the experience of it was very nice. Of cource we wanted to see the choir also, but the timing of it was not suitable for us. But if you visit this place, you should try it.\nThe entrance is free. \nOn the street where this cathedral islocated there is also red color memorial for those who died  defending the rights of Catalunya.", "publishedDate": "2020-02-10", "language": "en", "rating": 5}, {"id": 743678533, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d246171-r743678533-Basilica_de_Santa_Maria_del_Mar-Barcelona_Catalonia.html", "text": "We just went in and looked around ourselves as opposed to a guided tour, and we were happy with that but I’m sure a tour here would be terrific. We visited a lot of basilicas/cathedrals/etc. in Spain and after Sagrada Família this was probably my favorite. The interior construction is beautiful, especially the columns. Don’t miss this one. ", "publishedDate": "2020-02-08", "language": "en", "rating": 4}, {"id": 743084591, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d246171-r743084591-Basilica_de_Santa_Maria_del_Mar-Barcelona_Catalonia.html", "text": "Loved seeing this historic Basilica.The stained glass, the reverence - I would definitely go back on my next trip.", "publishedDate": "2020-02-04", "language": "en", "rating": 5}, {"id": 743055397, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d246171-r743055397-Basilica_de_Santa_Maria_del_Mar-Barcelona_Catalonia.html", "text": "You have to buy admission to get into the Basilica which was a bit sad, in my opinion. It was pretty from the outside but we opted not to go in.", "publishedDate": "2020-02-04", "language": "en", "rating": 3}, {"id": 742273486, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d246171-r742273486-Basilica_de_Santa_Maria_del_Mar-Barcelona_Catalonia.html", "text": "I took the one hour guided tour of this church . It was very interesting and has lots of history . The best part was the view of the city from the roof .", "publishedDate": "2020-01-31", "language": "en", "rating": 5}, {"id": 741613671, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d246171-r741613671-Basilica_de_Santa_Maria_del_Mar-Barcelona_Catalonia.html", "text": "We stayed right next to this beautiful building and didn't visit until our last day!  We were chatting with some locals and they were telling us how underrated it is, and how locals considered it their main basilica for regular services.  We stopped in and are so glad we did.  It was absolutely stunning.", "publishedDate": "2020-01-27", "language": "en", "rating": 5}, {"id": 741395549, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d246171-r741395549-Basilica_de_Santa_Maria_del_Mar-Barcelona_Catalonia.html", "text": "The huge spacious interior of the gothic Basilica and soaring interior columns creates a grand but peaceful environment. Just wandering around and resting and contemplating is so worthwhile. The tower climb is worth it for the view: narrow surrounding streets and lanes with 4.6 storey buildings, some draped with clothes drying, plants and Catalunya flags. Worth the climb.", "publishedDate": "2020-01-26", "language": "en", "rating": 5}, {"id": 741264224, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d246171-r741264224-Basilica_de_Santa_Maria_del_Mar-Barcelona_Catalonia.html", "text": "I've been living in Barcelona for almost 10 years, yet I have never been to the Santa María del Mar rooftop before this tour. Very interesting facts about the architecture, nice guide, wonderful views. Highly recommended!", "publishedDate": "2020-01-25", "language": "en", "rating": 5}, {"id": 739734998, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d246171-r739734998-Basilica_de_Santa_Maria_del_Mar-Barcelona_Catalonia.html", "text": "Elegant Church in Gotic Quarter. Stark proportions in catalan\ngotique style with spacious naves supported on large column. Small charmed shop closer to the church.", "publishedDate": "2020-01-17", "language": "en", "rating": 4}, {"id": 739669750, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d246171-r739669750-Basilica_de_Santa_Maria_del_Mar-Barcelona_Catalonia.html", "text": "This historic church appeared in my walk through the old Barcelona and I learned more about the Catalan history!", "publishedDate": "2020-01-17", "language": "en", "rating": 5}, {"id": 739466324, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d246171-r739466324-Basilica_de_Santa_Maria_del_Mar-Barcelona_Catalonia.html", "text": "We were walking by and stopped in.  It is a beautiful old church, and the architecture is simple and quite different from many of the other European churches and cathedrals we have seen.  It is worth going inside.", "publishedDate": "2020-01-16", "language": "en", "rating": 4}, {"id": 739335021, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d246171-r739335021-Basilica_de_Santa_Maria_del_Mar-Barcelona_Catalonia.html", "text": "Gothic basilica in old gothic centre of BCN. Narrow streets ending on small square. You feel history! Impressive high sober interior with mystic light falling from the stained glass windows. ", "publishedDate": "2020-01-15", "language": "en", "rating": 5}, {"id": 739122930, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d246171-r739122930-Basilica_de_Santa_Maria_del_Mar-Barcelona_Catalonia.html", "text": "Very beautiful from the exterior; in June 2019 it was not open to visitors due to renovation work so we just walked around the exterior, basically for the exercise!  Photos don't due it justice - there's so much to see.", "publishedDate": "2020-01-14", "language": "en", "rating": 4}, {"id": 738662331, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d246171-r738662331-Basilica_de_Santa_Maria_del_Mar-Barcelona_Catalonia.html", "text": "Entrance to the Basilica is free and well worth a visit. It is however worth paying 3 euros extra and taking the lift up to the roof where the views over the city are superb", "publishedDate": "2020-01-12", "language": "en", "rating": 5}, {"id": 738026480, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d246171-r738026480-Basilica_de_Santa_Maria_del_Mar-Barcelona_Catalonia.html", "text": "If you are in Barcelona I cannot believe that you will not pass outside this church. You do not need to enter. You can just see it from the outside while walking by. It deserves a glance.", "publishedDate": "2020-01-09", "language": "en", "rating": 5}, {"id": 737826999, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d246171-r737826999-Basilica_de_Santa_Maria_del_Mar-Barcelona_Catalonia.html", "text": "A fantastically stunning place.  Beautiful columns and stained glass windows. You'll have a creak in your neck looking at the fantastic architecture of this building.", "publishedDate": "2020-01-08", "language": "en", "rating": 5}, {"id": 737258380, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d246171-r737258380-Basilica_de_Santa_Maria_del_Mar-Barcelona_Catalonia.html", "text": "The Basilica is very beautiful with really nice architecture. I was there for the international Christmas mass on the 25th and personally the mass was very beautiful even though it wasn't unfortunately in English. The mass was held majorly in Catalan with a little bit of French and English. ", "publishedDate": "2020-01-06", "language": "en", "rating": 4}, {"id": 736368420, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d246171-r736368420-Basilica_de_Santa_Maria_del_Mar-Barcelona_Catalonia.html", "text": "The stain glass windows are beautiful and the gothic architecture fabulous.  The best part is that when we visited there were only a handful of other visitors.", "publishedDate": "2020-01-02", "language": "en", "rating": 5}, {"id": 736301753, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d246171-r736301753-Basilica_de_Santa_Maria_del_Mar-Barcelona_Catalonia.html", "text": "It's free to enter the church. The outside of the Basilica is misleading as inside one discovers a marvel of gothic architecture , with high ceilings and beautiful stained glass windows.\nLocated in the Jewish Quarter area, it's free to enter the church. To do the Towers + rooftop visit you need guided tours which start at 2 PM.\nThe outside of the Basilica is misleading as inside one discovers a marvel of gothic architecture, with high ceilings and beautiful stained glass windows. The ceilings tower above you once inside and the stained-glass windows are incredible.\nOpening Hours: Monday to Saturday: 9:00am to 1:00pm and 5:00pm to 8:30pm; Sunday: 10:00am to 2:00pm and 5:00pm to 8:00pm.\nMetro Underground: L3 Jaume I or L4 Barceloneta.\nA gothic church and not as lavish as Barcelona Cathedral but still worth doing if you have time, but will not prioritize it over Barcelona Cathedral which is simply splendid. \nFor a more detailed itinerary and reviews feel free to visit my page mentioned on my profile.", "publishedDate": "2020-01-02", "language": "en", "rating": 3}, {"id": 735719174, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d246171-r735719174-Basilica_de_Santa_Maria_del_Mar-Barcelona_Catalonia.html", "text": "A private surprise classical  concert  just offered to the cruise passengers to complete what was the very best cruise we've  ever been on.. excellent staff, food, beverages  cabin and ALL facilities were A1+ -\nThe day trips they organized were excellent and we didn't  open our wallets once.. would certainly use scenic again ", "publishedDate": "2019-12-30", "language": "en", "rating": 5}, {"id": 735662541, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d246171-r735662541-Basilica_de_Santa_Maria_del_Mar-Barcelona_Catalonia.html", "text": "100% Recommended for ppl, who are interesting of some good not just commertial or because a lot of ppl saw this", "publishedDate": "2019-12-30", "language": "en", "rating": 5}, {"id": 735557569, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d246171-r735557569-Basilica_de_Santa_Maria_del_Mar-Barcelona_Catalonia.html", "text": "This is a fantabulous basilica. I love the huge rose window. Inside will make you stunned. All I can  say is WOW.", "publishedDate": "2019-12-30", "language": "en", "rating": 5}, {"id": 735521494, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d246171-r735521494-Basilica_de_Santa_Maria_del_Mar-Barcelona_Catalonia.html", "text": "I lived near this church in April 2019. I was inside multiple times, I can totally recommend it. I just visited it, didn't buy any tickets.", "publishedDate": "2019-12-29", "language": "en", "rating": 5}, {"id": 735352702, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d246171-r735352702-Basilica_de_Santa_Maria_del_Mar-Barcelona_Catalonia.html", "text": "It was pleasant to see the site of the Netflix series. It was everything we expected to be. The facilities are in modest shape inside and much better in the exterior. We visited during mass and experienced the hymn and the organ playing in the background. The stones reflected the hard work that it took to put them in place. The locals gave us a bit of i site of TV hype and exaggeration when compared with the series. But it didn’t take anything away. ", "publishedDate": "2019-12-29", "language": "en", "rating": 4}, {"id": 735166267, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d246171-r735166267-Basilica_de_Santa_Maria_del_Mar-Barcelona_Catalonia.html", "text": "Forget the other tourist traps in Barcelona and visit this beautiful church. The area is amazing to wander around. Stop in and admire the light and the stain glass windows. It is free to enter and say a prayer.", "publishedDate": "2019-12-28", "language": "en", "rating": 5}, {"id": 734776176, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d246171-r734776176-Basilica_de_Santa_Maria_del_Mar-Barcelona_Catalonia.html", "text": "We went on Christmas Eve and we attended the Song of Sibyl.la. and afterwards the Christmas mass. It was magical! A trip to  Middle Ages! The church is in gothic style, pretty spaceous! I highly recommend it!", "publishedDate": "2019-12-26", "language": "en", "rating": 5}, {"id": 734714978, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d246171-r734714978-Basilica_de_Santa_Maria_del_Mar-Barcelona_Catalonia.html", "text": "You don’t get the height scale from outside. Inside it’s great columns and good stained glass and height, and space.\n\nNice simple side chapel niches.\n\nA few candles.\n\nA few statues.\n\nSimplicity.\n\nGood ramped wheelchair access from the side entrance only. Both east ad west entrances have steps. ", "publishedDate": "2019-12-26", "language": "en", "rating": 5}, {"id": 733944815, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d246171-r733944815-Basilica_de_Santa_Maria_del_Mar-Barcelona_Catalonia.html", "text": "Wonderfully imposing cathedral in the centre of the El Born district , large rose window and buttresses look over the quaint plaza in front and the fully gothic interior is a nice way to pass an hour , the towers can be seen from many of the alleys in the area", "publishedDate": "2019-12-21", "language": "en", "rating": 4}, {"id": 733780534, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d246171-r733780534-Basilica_de_Santa_Maria_del_Mar-Barcelona_Catalonia.html", "text": "Exquisitely beautiful, it is called the basilica of the workers and traders of medieval times. Best way is to visit by walking..", "publishedDate": "2019-12-20", "language": "en", "rating": 4}, {"id": 733427447, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d246171-r733427447-Basilica_de_Santa_Maria_del_Mar-Barcelona_Catalonia.html", "text": "You must walk around this area and discover hidden treasures. Barcelona's history in medieval times. ", "publishedDate": "2019-12-18", "language": "en", "rating": 5}, {"id": 732901811, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d246171-r732901811-Basilica_de_Santa_Maria_del_Mar-Barcelona_Catalonia.html", "text": "This church has that very old rustic medieval feel. No a huge church but still put it on your list of “to see” while in Barcelona. It’s free to get in so how can you say no? ", "publishedDate": "2019-12-15", "language": "en", "rating": 4}, {"id": 731825800, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d246171-r731825800-Basilica_de_Santa_Maria_del_Mar-Barcelona_Catalonia.html", "text": "We did that between 9 and noon, and it was free, it was really nice to see the basilica, a magnificent structure, but would plan it better next time: with a tour, or an audio guide at least, since it makes such a difference when visiting a place, to know its history. It was, of course, beautiful, and would recommend.", "publishedDate": "2019-12-10", "language": "en", "rating": 5}, {"id": 731777975, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d246171-r731777975-Basilica_de_Santa_Maria_del_Mar-Barcelona_Catalonia.html", "text": "Make sure you visit this Basilica. This is the true basilica of the old city and worth taking time to visit.", "publishedDate": "2019-12-10", "language": "en", "rating": 5}, {"id": 730649258, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d246171-r730649258-Basilica_de_Santa_Maria_del_Mar-Barcelona_Catalonia.html", "text": "Traveling with students you can´t visit all the churches but if you want to show one more besides Basilica La Sagrada Familia and the Cathedral it should be this church - my students were so surprised that this churxh was build in the 14th century - how could they do it?  The church also is an outstanding example of Catalan Gothic, with a purity and unity of style that is very unusual in large medieval buildings - so go there and enjoy it !", "publishedDate": "2019-12-04", "language": "en", "rating": 5}, {"id": 730641950, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d246171-r730641950-Basilica_de_Santa_Maria_del_Mar-Barcelona_Catalonia.html", "text": "Beautiful building. \n\nHidden jem in amongst the hustle and bustle.\n\nPerfect gothic architecture & for only 8€ a full tour including a trip up the town and a view from the church roof. \n\nHighly recommend ", "publishedDate": "2019-12-04", "language": "en", "rating": 5}, {"id": 730496588, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d246171-r730496588-Basilica_de_Santa_Maria_del_Mar-Barcelona_Catalonia.html", "text": "This only requires a quick visit, but worth the time. The guide was amazingly nice and knowledgeable. ", "publishedDate": "2019-12-03", "language": "en", "rating": 5}, {"id": 730306065, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d246171-r730306065-Basilica_de_Santa_Maria_del_Mar-Barcelona_Catalonia.html", "text": "We decided to go purchase the Anima Medieval pass which allows us entry to Cathedral of Barcelona, Santa Maria del Mar and Sant Pau. Santa Maria del Mar is a beautiful traditional Basilica that is both breath taking and give you a feeling of serenity. A definite must see when visiting Barcelona. Tip: If you visit the Basilica of Santa Maria del Mar before 1pm, you should be able to get free entry however you will not be able to go upstairs. The basilica closes at 12:50 pm and reopen at 1 pm for a fee. ", "publishedDate": "2019-12-02", "language": "en", "rating": 5}, {"id": 730111109, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d246171-r730111109-Basilica_de_Santa_Maria_del_Mar-Barcelona_Catalonia.html", "text": "I went in to see this after 5 pm in November, which is not the best time to see it. It was dark out by this time, so I missed the effect of the daylight on the windows. But it was a pretty church right in the center of the town. ", "publishedDate": "2019-12-01", "language": "en", "rating": 4}, {"id": 729723706, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d246171-r729723706-Basilica_de_Santa_Maria_del_Mar-Barcelona_Catalonia.html", "text": "My husband really enjoyed the climb to the roof, with an excellent guide Pol. first time ive seen modern stained glass windows with the old, fantastic sculpture of saint as a chair inside. Lovely history and amazing tomb markers. ", "publishedDate": "2019-11-29", "language": "en", "rating": 4}, {"id": 729652715, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d246171-r729652715-Basilica_de_Santa_Maria_del_Mar-Barcelona_Catalonia.html", "text": "We ended our Runner Bean tour near this church, and our guide did suggest (kindly) that you do not have to pay to go inside if you go in the morning.   Good of him to mention that.  We  really were impressed,  and  perhaps next time we will pay for 2 admissions to  do the tour up to the top of the Basilica.  It has an interesting history and there is a novel about how it was built by the poor people in the area.  Mainly, the fishermen.", "publishedDate": "2019-11-29", "language": "en", "rating": 4}, {"id": 728884873, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d246171-r728884873-Basilica_de_Santa_Maria_del_Mar-Barcelona_Catalonia.html", "text": "Basilica de Santa Maria del Mar is a church known for its fabulous acoustics and indeed concerts are held here.  Surprisingly it was built in a mere 55 years which resulted in its style being totally Catalan Gothic.  Free to enter from 9 am - 1 pm and again from 5 pm to 8 pm.  Otherwise, it is 5 euro to enter.", "publishedDate": "2019-11-25", "language": "en", "rating": 4}, {"id": 728800480, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d246171-r728800480-Basilica_de_Santa_Maria_del_Mar-Barcelona_Catalonia.html", "text": "The Gothic Quarter should already be on your list of places to visit while in Barcelona, this is right in the center of it and it's beautiful. The doors are open to the public and although some people are there to worship, guests are still able to walk around and take photos.", "publishedDate": "2019-11-25", "language": "en", "rating": 3}, {"id": 728615714, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d246171-r728615714-Basilica_de_Santa_Maria_del_Mar-Barcelona_Catalonia.html", "text": "Located at the Gothic area, it is a typical Gothic cathedral. I very much enjoyed it, it has a beautifyl garden too.", "publishedDate": "2019-11-24", "language": "en", "rating": 4}, {"id": 728466621, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d246171-r728466621-Basilica_de_Santa_Maria_del_Mar-Barcelona_Catalonia.html", "text": "Very interesting, very old church in Barcelona with an interesting story.  this church has survived earthquakes, fires through the years and yet remains a symbol of Catalan Gothic style.  it is free certain times of the day.", "publishedDate": "2019-11-23", "language": "en", "rating": 5}, {"id": 728408732, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d246171-r728408732-Basilica_de_Santa_Maria_del_Mar-Barcelona_Catalonia.html", "text": "After reading the Cathedral of the Sea, I had to visit.  What a lovely basilica and what a wonderful story behind its construction.", "publishedDate": "2019-11-23", "language": "en", "rating": 5}, {"id": 728224472, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d246171-r728224472-Basilica_de_Santa_Maria_del_Mar-Barcelona_Catalonia.html", "text": "While exploring the area, we came upon the Basilica and spent some time enjoying the architecture. Unfortunately, because it was late and raining, we did not go inside.  We'll save that for the next time we are in Barcelona.", "publishedDate": "2019-11-22", "language": "en", "rating": 4}, {"id": 727582891, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d246171-r727582891-Basilica_de_Santa_Maria_del_Mar-Barcelona_Catalonia.html", "text": "Worth a visit if you're in the area. It's peaceful inside the cathedral, and the led glass windows are really beautiful when the sun shines on them.", "publishedDate": "2019-11-19", "language": "en", "rating": 4}, {"id": 727420030, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d246171-r727420030-Basilica_de_Santa_Maria_del_Mar-Barcelona_Catalonia.html", "text": "Friends recommended that I visit this place i never heard of before. I did. I loved it. It's a stunning place. If you're a spiritual person, you'll feel the holiness of this place. If you're not, then you'll marvel at the architecture. I do recommend it.", "publishedDate": "2019-11-18", "language": "en", "rating": 5}, {"id": 727065401, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d246171-r727065401-Basilica_de_Santa_Maria_del_Mar-Barcelona_Catalonia.html", "text": "We visited the Basilica on a Tapas and Wine Walking Tour. Our guide, David, shared that this was a church built by and for the people. It was completed in 1384. \n\nThe Basilica’s construction is the focus of “The Cathedral of the Sea” that is now a Netflix series.", "publishedDate": "2019-11-17", "language": "en", "rating": 4}, {"id": 726721865, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d246171-r726721865-Basilica_de_Santa_Maria_del_Mar-Barcelona_Catalonia.html", "text": "It was the second time over a year that I visited the city and this church. Most impressive. Interesting vitreau. A place to think the past and relax if needed. ", "publishedDate": "2019-11-15", "language": "en", "rating": 5}, {"id": 726445875, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d246171-r726445875-Basilica_de_Santa_Maria_del_Mar-Barcelona_Catalonia.html", "text": "I did both del Mar and del Pi's rooftop tours.  Both guides were spectacular, two of the best guides in three weeks in Spain.  I did them both, back-to-back, two hours apart (wear knee compression sleeves, if you are old. like me).  I will say that del Pi has the better overall view, but del Mar is the easier climb.  HOWEVER!  Visit both churches, if you want to get a more rounded view of the variety of the Gothic Quarter.", "publishedDate": "2019-11-14", "language": "en", "rating": 5}, {"id": 726406312, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d246171-r726406312-Basilica_de_Santa_Maria_del_Mar-Barcelona_Catalonia.html", "text": "Was there a few years ago and didn't want to pay 7 Euros for 'another church.' This year, before noon, it was free and although dark inside, beautiful and unlike other churches I've seen. Very happy to have gone inside.Check out ceilings!", "publishedDate": "2019-11-14", "language": "en", "rating": 5}, {"id": 726316359, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d246171-r726316359-Basilica_de_Santa_Maria_del_Mar-Barcelona_Catalonia.html", "text": "Must see if you visit Barcelona. Right at Gothic quarter this cathedral is superb. Easily accessible with stawler. ", "publishedDate": "2019-11-13", "language": "en", "rating": 5}, {"id": 726289172, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d246171-r726289172-Basilica_de_Santa_Maria_del_Mar-Barcelona_Catalonia.html", "text": "This was the first place I visited in Barcelona. Very interesting history. I took the tour up to the rooftop of Santa Maria Del Mar. Definitely fun climbing all those steps. Gorgeous views of the city and very knowledgeable tour guide!", "publishedDate": "2019-11-13", "language": "en", "rating": 5}, {"id": 726239622, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d246171-r726239622-Basilica_de_Santa_Maria_del_Mar-Barcelona_Catalonia.html", "text": "Passed through this beautiful church (for free!) on a local tapas tour, and were told about the rooftop tours; came right back the next day to experience them, and so glad we did. Stunning church, and wonderful, interesting tour that led us to its very roof! Amazing views, coupled with interesting history of the church and the area, all for about $8 a person. Could not possibly get more value for the dollar. (Or euro!) It's not a super hard climb, but you do have to be in semi-decent shape and not afraid of heights or have claustrophobia - the stairs are narrow and windy, though well-lit.", "publishedDate": "2019-11-13", "language": "en", "rating": 5}, {"id": 725936879, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d246171-r725936879-Basilica_de_Santa_Maria_del_Mar-Barcelona_Catalonia.html", "text": "Much better than the other place, now this is a place of worship. Not to crowded and just stunning to look around inside. ", "publishedDate": "2019-11-12", "language": "en", "rating": 5}, {"id": 725932210, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d246171-r725932210-Basilica_de_Santa_Maria_del_Mar-Barcelona_Catalonia.html", "text": "This place should be visit during the week.It is the only church of pure Catalan Gothic style. From the roofs of the basilica you can enjoy Barcelona from a 360º perspective.", "publishedDate": "2019-11-12", "language": "en", "rating": 4}, {"id": 725559628, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d246171-r725559628-Basilica_de_Santa_Maria_del_Mar-Barcelona_Catalonia.html", "text": "Such a lovely and history-filled place of worship. If you have read Ildefonso Falcones novels, you will feel like you are in them. ", "publishedDate": "2019-11-10", "language": "en", "rating": 5}, {"id": 725456534, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d246171-r725456534-Basilica_de_Santa_Maria_del_Mar-Barcelona_Catalonia.html", "text": "We ended our trip to Spain by visiting this lovely Catalan Gothic basilica that was built in the 1300s.  The spaciousness of these churches amaze me.  A novel was written about the building of this basilica called \"Cathedral of the Sea\" which I look forward to reading.", "publishedDate": "2019-11-10", "language": "en", "rating": 5}, {"id": 725435678, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d246171-r725435678-Basilica_de_Santa_Maria_del_Mar-Barcelona_Catalonia.html", "text": "Basilica de Santa Maria del Mar is a brilliant example of exquisite  Gothic architecture I have gone there for Christmas Midnight Mass and it is chilling and beautiful. >..And I am not even Christian.  A must visit, both during mass or not. ", "publishedDate": "2019-11-10", "language": "en", "rating": 5}, {"id": 724999845, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d246171-r724999845-Basilica_de_Santa_Maria_del_Mar-Barcelona_Catalonia.html", "text": "It was one of our stops while I and my family were in Barcelona. We didn`t want to pay for Sagrada Familia, so we have decided to visit this church instead! It was astonishing inside! Very peaceful, few people only, you can feel the atmosphere of a Spanish catolic church, very good choice! And it is free to enter!", "publishedDate": "2019-11-08", "language": "en", "rating": 5}, {"id": 724953265, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d246171-r724953265-Basilica_de_Santa_Maria_del_Mar-Barcelona_Catalonia.html", "text": "Splendid example of gothic architecture, sadly the queues were too long on a hot day so we didn't visit the interior.", "publishedDate": "2019-11-08", "language": "en", "rating": 4}, {"id": 724935488, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d246171-r724935488-Basilica_de_Santa_Maria_del_Mar-Barcelona_Catalonia.html", "text": "Although this church is known as \"The Cathedral of the Sea\" it is not actually the Cathedral ( that is in another part of the Gothic Quarter and it is there and here where you will find the courtyard with geese as mentioned in other reviews below)\nThere are times when you can enter the church for free but as this did not fit in with our schedule we were pleased to pay €7 each.\nHappily we arrived just before the English tour was about to start. Our guide, Pol, told us about the history of the church before a tour of the rooftop. \nWorth every cent of the €7", "publishedDate": "2019-11-08", "language": "en", "rating": 5}, {"id": 724800390, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d246171-r724800390-Basilica_de_Santa_Maria_del_Mar-Barcelona_Catalonia.html", "text": "Our first visit to this wonderful church. I believe serenity best describes the atmosphere inside although the garden area is just as peaceful, when the bells are not ringing. The interior of the church is quite amazing but unadorned unlike many other churches. A visit to the crypt is a must and very informative.", "publishedDate": "2019-11-07", "language": "en", "rating": 4}, {"id": 724436645, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d246171-r724436645-Basilica_de_Santa_Maria_del_Mar-Barcelona_Catalonia.html", "text": "A fantastic history of the Catalan and also one of the main reasons \nwhy FC barcelona is the only football club followed here religiously. The story should be heard form the local your guides or people and it's one you will not forget.", "publishedDate": "2019-11-06", "language": "en", "rating": 4}, {"id": 724394850, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d246171-r724394850-Basilica_de_Santa_Maria_del_Mar-Barcelona_Catalonia.html", "text": "Although I am not a believer, in religious terms the incredible inner experience of peace overwhelmed me from the moment I stepped inside. Not all churches and temples could evoke such a feeling. ", "publishedDate": "2019-11-06", "language": "en", "rating": 5}, {"id": 724296539, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d246171-r724296539-Basilica_de_Santa_Maria_del_Mar-Barcelona_Catalonia.html", "text": "It is one of the essential places that must be visited if you come to Barcelona, it is a work of art in an unbeatable environment.", "publishedDate": "2019-11-05", "language": "en", "rating": 5}, {"id": 724199848, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d246171-r724199848-Basilica_de_Santa_Maria_del_Mar-Barcelona_Catalonia.html", "text": "Loved it! Worth the money to go inside... beautiful architecture, history, wonderful experience. There are restaurants nearby that are ok, but a little too pricey... although the ice cream places are definitely worth it!", "publishedDate": "2019-11-05", "language": "en", "rating": 5}, {"id": 724075743, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d246171-r724075743-Basilica_de_Santa_Maria_del_Mar-Barcelona_Catalonia.html", "text": "I visited just to see the outside and inside. We did not purchase any tickets to view anything beyond the main sanctuary, but I'd imagine it would have been worth it.\n\nThe cathedral was absolutely gorgeous and worth a quick stop.", "publishedDate": "2019-11-05", "language": "en", "rating": 5}, {"id": 723880928, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d246171-r723880928-Basilica_de_Santa_Maria_del_Mar-Barcelona_Catalonia.html", "text": "Wonderful experience . mesmerized with the detailing . beautiful and I enjoyed it very much . There is plenty of cafe around .", "publishedDate": "2019-11-04", "language": "en", "rating": 5}, {"id": 723795381, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d246171-r723795381-Basilica_de_Santa_Maria_del_Mar-Barcelona_Catalonia.html", "text": "Beautiful Basilica both inside and out. Situated in the Gothic Quarter. We paid 7 euros to enter the church, this also included the ability to go onto the roof for fabulous views of Barcelona. The Basilica also has a court yard with geese that live there. ", "publishedDate": "2019-11-04", "language": "en", "rating": 5}, {"id": 723573508, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d246171-r723573508-Basilica_de_Santa_Maria_del_Mar-Barcelona_Catalonia.html", "text": "So beautiful . Grand. Architecture is so striking yet peaceful and welcoming . This was my personal favorite. It is close to the marina and the beach. There’s a wonderful street right of the church that has great shops and restaurants and more wonderful little streets off of that one. \n", "publishedDate": "2019-11-03", "language": "en", "rating": 5}, {"id": 723482037, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d246171-r723482037-Basilica_de_Santa_Maria_del_Mar-Barcelona_Catalonia.html", "text": "We saw this during a Historic Tour with a guide.  It is truly an amazing piece of art, as well as a rich religious building built by people who would not stop until they had it done.  \n", "publishedDate": "2019-11-03", "language": "en", "rating": 5}, {"id": 723363668, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d246171-r723363668-Basilica_de_Santa_Maria_del_Mar-Barcelona_Catalonia.html", "text": "This church, named after the sea, is near both the Gothic Quarter and the beach area/Barceloneta. We walked through it during a morning stroll around the Gothic Quarter and other neary points. The church is interesting in that its front facade is fairly crowded without a huge courtyard in front. The interior is mostly undecorated stone, with very pretty stained glass. Admission was free, and we enjoyed spending a few minutes inside admiring the interior.", "publishedDate": "2019-11-02", "language": "en", "rating": 4}, {"id": 723067286, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d246171-r723067286-Basilica_de_Santa_Maria_del_Mar-Barcelona_Catalonia.html", "text": "\n\nWe enjoyed seeing the Basilica as it was so different from the others we did on this trip. Loved walking the Gothic Quarter and was sorry we had so little time. The city was experiencing some trouble and there was pressure to get back to our side of the city.\n\n", "publishedDate": "2019-11-01", "language": "en", "rating": 5}, {"id": 723031470, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d246171-r723031470-Basilica_de_Santa_Maria_del_Mar-Barcelona_Catalonia.html", "text": "This is a very beautiful church especially the stained glass windows on the inside.  It is located in the Gothic Quarter amid narrow streets.  Unfortunately we were not able to climb to the rooftop to see the views since it was closed when we arrived.", "publishedDate": "2019-11-01", "language": "en", "rating": 4}, {"id": 722724287, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d246171-r722724287-Basilica_de_Santa_Maria_del_Mar-Barcelona_Catalonia.html", "text": "Many historical buildings are close together in the old town. With a walk through the small alleys you can reach everything easily and take many beautiful pictures.", "publishedDate": "2019-10-30", "language": "en", "rating": 5}, {"id": 722421960, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d246171-r722421960-Basilica_de_Santa_Maria_del_Mar-Barcelona_Catalonia.html", "text": "This church was constructed with the donations of the laborers who lived in the neighborhood, and it was done with all speed. Many beautiful statues, including a modern one of St. Ignatius Loyola, founder of the Jesuit order, who lived awhile in Barcelona and begged for alms outside the church. Good Italian restaurant and ice cream shop were nearby.", "publishedDate": "2019-10-29", "language": "en", "rating": 5}, {"id": 722300847, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d246171-r722300847-Basilica_de_Santa_Maria_del_Mar-Barcelona_Catalonia.html", "text": "A fabulous Cathedral in the older gothic area of Barcelona. Splendid inside and out. I also learned that the word Basilica is roman and these are churches above normal catherdrals as they have been granted special privileges by the Pope.", "publishedDate": "2019-10-29", "language": "en", "rating": 5}, {"id": 722267799, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d246171-r722267799-Basilica_de_Santa_Maria_del_Mar-Barcelona_Catalonia.html", "text": "This is a must to see if you are in Barcelona. It is huge! And it has a very nice gift shop. Be sure to go out into the court yard and see the swans.", "publishedDate": "2019-10-29", "language": "en", "rating": 5}, {"id": 721603454, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d246171-r721603454-Basilica_de_Santa_Maria_del_Mar-Barcelona_Catalonia.html", "text": "The beauty and details of this Basilica is just incredible. To go back in time and think of how this gorgeous places were build is just \nso interesting.", "publishedDate": "2019-10-26", "language": "en", "rating": 5}, {"id": 721392079, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d246171-r721392079-Basilica_de_Santa_Maria_del_Mar-Barcelona_Catalonia.html", "text": "We were on a day tour with our HA cruise and this was one of our stops, extremely busy and you have to have your knees and shoulders covered to enter however there were people at the entrance handing out scarves and wraps. Well worth a visit especially as part of a tour as you get all the background information.", "publishedDate": "2019-10-25", "language": "en", "rating": 4}, {"id": 721067689, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d246171-r721067689-Basilica_de_Santa_Maria_del_Mar-Barcelona_Catalonia.html", "text": "The place was gutted and burned during the Spanish Civil War and has been rebuilt, but isn't the gorgeous setting the the Sagrada Familia and the cathedral are.", "publishedDate": "2019-10-24", "language": "en", "rating": 3}, {"id": 720982688, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d246171-r720982688-Basilica_de_Santa_Maria_del_Mar-Barcelona_Catalonia.html", "text": "Take time to visit. It is a good example of a very old gothic church. Enjoy Tapas and drinks in the courtyard near the church. ", "publishedDate": "2019-10-24", "language": "en", "rating": 5}, {"id": 720883091, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d246171-r720883091-Basilica_de_Santa_Maria_del_Mar-Barcelona_Catalonia.html", "text": "An elegant and solemn church in honor of Santa Maria, protector of seamen and voyagers.   Take a brief stop here to appreciate its architecture and atmosphere.  One point worth mentioning is her columns, long and elegant, reminding one of the design in Sagrada Familia.", "publishedDate": "2019-10-23", "language": "en", "rating": 5}, {"id": 720262110, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d246171-r720262110-Basilica_de_Santa_Maria_del_Mar-Barcelona_Catalonia.html", "text": "This church is well worth a visit. \nA surprisingly beautiful interior giving a sense of serenity and peace. ", "publishedDate": "2019-10-21", "language": "en", "rating": 5}, {"id": 720172283, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d246171-r720172283-Basilica_de_Santa_Maria_del_Mar-Barcelona_Catalonia.html", "text": "In a town full of beautiful cathedrals, after awhile they can start to blur together, but this one stands out and shouldn't be missed.  Inside it is so soaring and so very gothic.  You dont need to stay too long, but slow down for a bit, sit in a pew and take it all in.  It was good for my soul.\nSuprisingly not crowded.", "publishedDate": "2019-10-21", "language": "en", "rating": 5}, {"id": 719869702, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d246171-r719869702-Basilica_de_Santa_Maria_del_Mar-Barcelona_Catalonia.html", "text": "Great tour not one we would have chosen but had been taken while on a private wine and tapas tour, we really enjoyed the history", "publishedDate": "2019-10-20", "language": "en", "rating": 5}, {"id": 718893340, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d246171-r718893340-Basilica_de_Santa_Maria_del_Mar-Barcelona_Catalonia.html", "text": "beautiful Basilica. polite.  helpful staff, answer all questions. I came before the service. they could not let me in, but the girl took me to the Basilica and even told me everything", "publishedDate": "2019-10-16", "language": "en", "rating": 5}, {"id": 718523629, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d246171-r718523629-Basilica_de_Santa_Maria_del_Mar-Barcelona_Catalonia.html", "text": "Another great place to stop by and visit.  Its size is deceiving from the outside.  Its bigger than you think.  The stained glass is amazing, the visit to the roof was a nice touch.  Some interesting and elaborate works dedicated to the saints here.", "publishedDate": "2019-10-15", "language": "en", "rating": 4}, {"id": 718362345, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d246171-r718362345-Basilica_de_Santa_Maria_del_Mar-Barcelona_Catalonia.html", "text": "While not quite the scale of Duomo di Milano, this church gives you pause and makes you drink in the history of a part of the world I only suspected existed. Truly worht the stop and cheap ticket prices for just an hour of your day.", "publishedDate": "2019-10-14", "language": "en", "rating": 5}, {"id": 718305325, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d246171-r718305325-Basilica_de_Santa_Maria_del_Mar-Barcelona_Catalonia.html", "text": "One of my favorite churches in Barcelona. It is in the Gothic area. The stained glass in the church and chapel is so beautiful and peaceful. You can see the walking passage and narrow street around the church that makes you feel you are walking in history.", "publishedDate": "2019-10-14", "language": "en", "rating": 5}, {"id": 718195933, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d246171-r718195933-Basilica_de_Santa_Maria_del_Mar-Barcelona_Catalonia.html", "text": "It was a bit crowded on a Sunday but worth the visit. Beautiful windows, beautiful architecture. Definitely go and see if you have time, it's free.", "publishedDate": "2019-10-14", "language": "en", "rating": 5}, {"id": 718052480, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d246171-r718052480-Basilica_de_Santa_Maria_del_Mar-Barcelona_Catalonia.html", "text": "we were not able to go inside in the morning they were having a service and we could not wait had to get to our ship", "publishedDate": "2019-10-13", "language": "en", "rating": 3}, {"id": 718031493, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d246171-r718031493-Basilica_de_Santa_Maria_del_Mar-Barcelona_Catalonia.html", "text": "We visited the Cathedral in the afternoon having been at La Sagrada Familia in the morning. Talk about chalk and cheese! The Cathedral is a stunning building and the view from the rooftop has to be seen (there's a lift!) \n\nThere was a lovely atmosphere inside the building and in the Cloister area on the way out. The white geese are fascinating.", "publishedDate": "2019-10-13", "language": "en", "rating": 4}, {"id": 717645880, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d246171-r717645880-Basilica_de_Santa_Maria_del_Mar-Barcelona_Catalonia.html", "text": "OUr last night in Barcelona, we were lucky enough to stop in after dinner. It was late and getting dark --Magical inside with all the real candles lit. I lit a candle for safe journey home A very simple but spritual place.", "publishedDate": "2019-10-12", "language": "en", "rating": 5}, {"id": 717365748, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d246171-r717365748-Basilica_de_Santa_Maria_del_Mar-Barcelona_Catalonia.html", "text": "Gothic inspired  architecture, colossal ceiling height, the place has something special about it \nthe guided tour is really worth it as the guide gives interesting insight. ", "publishedDate": "2019-10-11", "language": "en", "rating": 5}, {"id": 717298726, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d246171-r717298726-Basilica_de_Santa_Maria_del_Mar-Barcelona_Catalonia.html", "text": "Getting to the basilica takes you down narrow gothic alleys but they are quite safe, these are roads in the old gothic section. Pay a fee to go inside as it is beautiful and worth seeing.", "publishedDate": "2019-10-11", "language": "en", "rating": 5}, {"id": 716838028, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d246171-r716838028-Basilica_de_Santa_Maria_del_Mar-Barcelona_Catalonia.html", "text": "This basilica was started in 1329.  It was built by the fishermen and the workers in the area to celebrate Mary by the sea. The local people helped carry the stones from the shore to build it. Inside it has a very open floor plan with a famous rose stained glass window. ", "publishedDate": "2019-10-09", "language": "en", "rating": 4}, {"id": 716763569, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d246171-r716763569-Basilica_de_Santa_Maria_del_Mar-Barcelona_Catalonia.html", "text": "This Church is truly amazing. It's located in the heart of the old city of Barcelona which adds charm to the area. The church is truly Gothic. The Church itself is dark and but the beautiful stained glass windows offers just the right amount of light.\n\nThere is a second level accessible by stairs in which you can get a bird eye view of the interior of the church. \n\nI know that the church offers a wider variety of ticket options but if your in a rush the general ticket is enough for you to truly appreciate this beautiful work of art.", "publishedDate": "2019-10-09", "language": "en", "rating": 5}, {"id": 716709565, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d246171-r716709565-Basilica_de_Santa_Maria_del_Mar-Barcelona_Catalonia.html", "text": "I remembered this church from my first visit 8 years before. So pretty inside. No need to pay entrance fee. Just wonder around. Of course you can make a donation.", "publishedDate": "2019-10-09", "language": "en", "rating": 4}, {"id": 716401105, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d246171-r716401105-Basilica_de_Santa_Maria_del_Mar-Barcelona_Catalonia.html", "text": "Very pretty church in the heart of Old Barcelona.  Small fee to get in.  There are times that are free for those who complain about the nominal fee, which seems to be used to keep up restoration efforts which are ongoing.  Check with your hotel or whatever guide book you are using.\nWe did not go up in the spires due to physical limitations of some of the people in our group.  That would be worthwhile if you can handle it.  Tough to see details of the chapels because of the heavy gates in front of all of them.. Nice Gothic Architecture and interesting history.  Pales however in comparison to La Sagrada Familia cathedral.", "publishedDate": "2019-10-08", "language": "en", "rating": 3}, {"id": 716239247, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d246171-r716239247-Basilica_de_Santa_Maria_del_Mar-Barcelona_Catalonia.html", "text": "We enjoyed this tour of the beautiful basilica and tower. There was just enough interesting history at the beginning and the view from the rooftop is spectacular. It’s a lot of steps, so would not be a good fit for elderly visitors or anyone with mobility issues.", "publishedDate": "2019-10-08", "language": "en", "rating": 5}, {"id": 715853586, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d246171-r715853586-Basilica_de_Santa_Maria_del_Mar-Barcelona_Catalonia.html", "text": "This Sunday evening we saw this beautiful Gothic church prior to 7:00 mass. The organ recital prior to mass was moving. What a way to end our stay in Barcelona. ", "publishedDate": "2019-10-06", "language": "en", "rating": 5}, {"id": 715813802, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d246171-r715813802-Basilica_de_Santa_Maria_del_Mar-Barcelona_Catalonia.html", "text": "This church is free in the morning and evenings.  It is easy to find in the Gothic Quarter/ El Born area.  Beautiful structure. ", "publishedDate": "2019-10-06", "language": "en", "rating": 5}, {"id": 715788302, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d246171-r715788302-Basilica_de_Santa_Maria_del_Mar-Barcelona_Catalonia.html", "text": "This was my favorite cathedral. It isn’t over run with tourist, so you can take in all the details in quiet. The nearby cathedral lets you on the roof, this cathedral has a tall tower to climb. ", "publishedDate": "2019-10-06", "language": "en", "rating": 5}, {"id": 715787752, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d246171-r715787752-Basilica_de_Santa_Maria_del_Mar-Barcelona_Catalonia.html", "text": "Wonderful place to get acquainted with ancient architecture. The cathedral inspires calm and confidence.", "publishedDate": "2019-10-06", "language": "en", "rating": 5}, {"id": 715767463, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d246171-r715767463-Basilica_de_Santa_Maria_del_Mar-Barcelona_Catalonia.html", "text": "Worth searching the streets to find this Basilica.  Although smaller, it is beautiful, and well worth a visit.", "publishedDate": "2019-10-06", "language": "en", "rating": 5}, {"id": 714794362, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d246171-r714794362-Basilica_de_Santa_Maria_del_Mar-Barcelona_Catalonia.html", "text": "The beautiful colors of the Windows are inflamed by the sunset light.  Look around you and feel the light warm your soul", "publishedDate": "2019-10-02", "language": "en", "rating": 5}, {"id": 714751777, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d246171-r714751777-Basilica_de_Santa_Maria_del_Mar-Barcelona_Catalonia.html", "text": "Beautiful Gothic Church in the heart of downtown Barcelona built during the 14th century when Barcelona was a trading town.  Nice to walk around inside and admire the stained glassed windows.  I went up to the rooftop by elevator and was able to look at the whole city.  There was a courtyard with a lot of obnoxious geese.", "publishedDate": "2019-10-02", "language": "en", "rating": 5}, {"id": 714697823, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d246171-r714697823-Basilica_de_Santa_Maria_del_Mar-Barcelona_Catalonia.html", "text": "The basilica of Santa Maria del Mar is good example of this type of Catalan Gothic architecture from 14th century .Great building with amazing stained glass windows running around the whole church. Stained windows are really perfect for its gray walls. The inside is stunning with high ceilings.  You really feel the centuries of history contained within the very stones of this building.I like this basilica a lot, when you step inside it feels as if you have stepped back in time.  Not noisy from tourists.", "publishedDate": "2019-10-02", "language": "en", "rating": 5}, {"id": 714544617, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d246171-r714544617-Basilica_de_Santa_Maria_del_Mar-Barcelona_Catalonia.html", "text": "Open to the public and its worth the trip inside. Painting are astonishing and the detail was incredible. easy in easy out.  ", "publishedDate": "2019-10-01", "language": "en", "rating": 5}, {"id": 714227716, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d246171-r714227716-Basilica_de_Santa_Maria_del_Mar-Barcelona_Catalonia.html", "text": "There was no sign of any guided tour the day we visited and entrance was free, so we passed a quiet few minutes admiring the breath-taking architecture and especially the rose stained glass window.", "publishedDate": "2019-09-30", "language": "en", "rating": 4}, {"id": 714217331, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d246171-r714217331-Basilica_de_Santa_Maria_del_Mar-Barcelona_Catalonia.html", "text": "Basilica de Santa Maria del Mar is located about a 6 minute walk from the bottom of La Ramblas. Carrer de Josep Anselm Clavé provides a scenic walk to the Placa and the church. We were there during La Mercè a celebration of patron saint of Barcelona so the church was glorious and standing room only.   ", "publishedDate": "2019-09-30", "language": "en", "rating": 5}, {"id": 714100311, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d246171-r714100311-Basilica_de_Santa_Maria_del_Mar-Barcelona_Catalonia.html", "text": "This is a must visit while in Barcelona - be aware that shoulders and knees must be covered when visiting - the interior is as impressive as the exterior- it is stunning - would highly recommend ", "publishedDate": "2019-09-29", "language": "en", "rating": 5}, {"id": 714020278, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d246171-r714020278-Basilica_de_Santa_Maria_del_Mar-Barcelona_Catalonia.html", "text": "According to the guidebook I brought this building is the best example of complete gothic architecture in the city. Compared to the Cathedral, which cost us €7 to enter and €4 more for audioguide, I found this building just as interesting to look inside. The best part is that entry was free and we were actually able to witness a wedding happening inside. It's one single massive room indoor, so you only need 5-10mins to take a quick look - totally worth it", "publishedDate": "2019-09-29", "language": "en", "rating": 5}, {"id": 713701367, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d246171-r713701367-Basilica_de_Santa_Maria_del_Mar-Barcelona_Catalonia.html", "text": "An impressive church on a mountain with many levels that is situated in a pretty village giving stunning views of Barcelona . What more could  you ask for? How about easy access? Wish granted since you can get all the way to the church using a zone 1 metro ticket. What a bargain and pleasurable experience!", "publishedDate": "2019-09-28", "language": "en", "rating": 5}, {"id": 713699621, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d246171-r713699621-Basilica_de_Santa_Maria_del_Mar-Barcelona_Catalonia.html", "text": "Beautiful church in a very walkable part of the city, with lots of places to eat and drink.  Maybe because we visited this on the final evening of our 8-days in Barcelona, we thought the church was glorious, but sounds like to get full beauty of the place you need to visit rooftop and/or at sunset, which we did not do.", "publishedDate": "2019-09-28", "language": "en", "rating": 4}, {"id": 713162544, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d246171-r713162544-Basilica_de_Santa_Maria_del_Mar-Barcelona_Catalonia.html", "text": "Peaceful Gothic Church made and supported by the people of Barcelona.  Beautiful Rose Window the size as big as the famous ones in Notre Dame in Paris, France.  Not crowded and the views from the roof were great! Small fee to do that. Ever looked down a chimney into a church below? Quite an experience.", "publishedDate": "2019-09-26", "language": "en", "rating": 4}, {"id": 713156495, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d246171-r713156495-Basilica_de_Santa_Maria_del_Mar-Barcelona_Catalonia.html", "text": "Barcelona is Gaudi the rest comes second place..the architectural aspects are always facinating but most Basilicas are nearabout the same.", "publishedDate": "2019-09-26", "language": "en", "rating": 4}, {"id": 713078610, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d246171-r713078610-Basilica_de_Santa_Maria_del_Mar-Barcelona_Catalonia.html", "text": "We only stumbled upon this fine church by accident when looking for the cathedral. \nIt would easily pass as a cathedral in any other place.  It is a vast church but does not attract the  large visitor numbers of the cathedral. Very high roof and quite light and airy.", "publishedDate": "2019-09-26", "language": "en", "rating": 5}, {"id": 712647778, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d246171-r712647778-Basilica_de_Santa_Maria_del_Mar-Barcelona_Catalonia.html", "text": "Beautiful from inside and outside\nGothic architecture surrounded by shops and cafe\nA must visit\n100 chars", "publishedDate": "2019-09-24", "language": "en", "rating": 4}, {"id": 712639382, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d246171-r712639382-Basilica_de_Santa_Maria_del_Mar-Barcelona_Catalonia.html", "text": "Readers will get confused. The \"Cathedral\" is the one you have to go through bag check, etc, can climb stairs to the roof, have to deal with lines, has the geese. The Basilica - Santa Maria del Mar - isn't as impressive but is easier to see. No lines, can roam freely. It suffered damage from the anti-church hordes in the Spanish Civil War. More romantic, in my opinion.", "publishedDate": "2019-09-24", "language": "en", "rating": 4}, {"id": 712435108, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d246171-r712435108-Basilica_de_Santa_Maria_del_Mar-Barcelona_Catalonia.html", "text": "A very impressive church.  The Basilica is more ornate but definitely worth visiting.  The nearby shops are a bit more upscale in this Born district.", "publishedDate": "2019-09-23", "language": "en", "rating": 3}, {"id": 712218933, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d246171-r712218933-Basilica_de_Santa_Maria_del_Mar-Barcelona_Catalonia.html", "text": "The cathedral is totally stunning. \nWe were over awed. It is the most extraordinary place. The stained glass windows alone have such a magic and are so beautiful.\nAll the little statues all around too.\nThe architecture, oh my goodness it was all just extraordinarily stunning and ornate beyond beleif. We could have spent hours in there but were only allowed a limited time as there was such a long queue.Loved the geese who are the guardians of the cathedral too.\n\nAnd then on exit there were two buskers playing the most incredible spanish guitar music.\nIt just wrapped it up beautifully", "publishedDate": "2019-09-23", "language": "en", "rating": 5}, {"id": 712025834, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d246171-r712025834-Basilica_de_Santa_Maria_del_Mar-Barcelona_Catalonia.html", "text": "Great experience, lovely place! We went there with a group of friends and we loved it!  Such an interesting history place.", "publishedDate": "2019-09-22", "language": "en", "rating": 5}, {"id": 711973985, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d246171-r711973985-Basilica_de_Santa_Maria_del_Mar-Barcelona_Catalonia.html", "text": "We really wanted to visit the “Basilica de Santa Maria del Mar” after watching the Netflix series “La Catedral del Mar”. We were fortunate to have the opportunity to attend mass after the beautiful procession of “La Virgen de la Merced” entering the church!", "publishedDate": "2019-09-22", "language": "en", "rating": 5}, {"id": 711817886, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d246171-r711817886-Basilica_de_Santa_Maria_del_Mar-Barcelona_Catalonia.html", "text": "This cathedral doesn't get the press that the Barcelona Cathedral or La Sagrada Familia do, but it's worth a visit. There aren't as many tourists and getting in isn't such a hassle (no bag checks), so it has a more laid-back atmosphere with plenty of gorgeous sights. The chapels on the sides are, for the most part, not trapped behind bars. Perhaps it's best to visit this before larger cathedrals so it won't seem as anti-climactic.", "publishedDate": "2019-09-21", "language": "en", "rating": 5}, {"id": 711692430, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d246171-r711692430-Basilica_de_Santa_Maria_del_Mar-Barcelona_Catalonia.html", "text": "Smaller and more intimate than the Cathedral or the Sagrada, this lovely medieval church is well worth a visit.", "publishedDate": "2019-09-21", "language": "en", "rating": 5}, {"id": 711193570, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d246171-r711193570-Basilica_de_Santa_Maria_del_Mar-Barcelona_Catalonia.html", "text": "Didn't have anything that took my breath away. Usual Catholic fare which I can take or leave...quite interesting, you have to pay to enter, book online to avoid the queue.", "publishedDate": "2019-09-19", "language": "en", "rating": 4}, {"id": 711046076, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d246171-r711046076-Basilica_de_Santa_Maria_del_Mar-Barcelona_Catalonia.html", "text": "Having visited the Sagrada before we wanted to see something different and avoid the mad queues!\n\nThe Basilica is a beautiful building and if you have read Cathedral by the Sea you may have preconceptions about its history.\n\nWe took a tour of the towers and the guide was very knowledgeable. There are quite a few steps up to the top of the church but the view is well worth it. The history behind the construction is amazing, what a great feat of engineering for its time! The detail of it's almost destruction and how our visiting charges are going to restore this great church was very informative. \n\nInside the church is amazing and so open. You can feel the space and see all the beauty with so little internal columns and walls. The large Rose window is stunning!\n\nDefinitely worth a visit if you are in Barcelona.", "publishedDate": "2019-09-18", "language": "en", "rating": 5}, {"id": 710928976, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d246171-r710928976-Basilica_de_Santa_Maria_del_Mar-Barcelona_Catalonia.html", "text": "This was a beautiful Cathedral. We also got the lift up to the roof, not a lot to see here but a good view and photo opportunity.", "publishedDate": "2019-09-18", "language": "en", "rating": 5}, {"id": 710730953, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d246171-r710730953-Basilica_de_Santa_Maria_del_Mar-Barcelona_Catalonia.html", "text": "I simply love this church. After reading the history it makes you appreciate the craftsmanship. For me it is a must see!!!", "publishedDate": "2019-09-17", "language": "en", "rating": 5}, {"id": 710334458, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d246171-r710334458-Basilica_de_Santa_Maria_del_Mar-Barcelona_Catalonia.html", "text": "Another amazing huge church on a postage stamp parcel of land.  In the gothic quarter, easy to find quick in and out ", "publishedDate": "2019-09-16", "language": "en", "rating": 4}, {"id": 709970799, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d246171-r709970799-Basilica_de_Santa_Maria_del_Mar-Barcelona_Catalonia.html", "text": "I love Gothic churches, and the thought of attending Mass at a Catalan Gothic church was too tempting a prospect to pass up.\n\nWe went for \"international\" Mass at 12:00 noon. While most of the Mass was in Catalan, the priest made an effort to speak a few phrases in other languages (English, French, German, Italian and Spanish). Some of the readings and prayers were also recited in other languages, and the celebrant made the effort to give greetings of peace to at least half the congregation. Mass was done in a little over an hour.\n\nThe church was beautifully austere.", "publishedDate": "2019-09-15", "language": "en", "rating": 5}, {"id": 709955139, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d246171-r709955139-Basilica_de_Santa_Maria_del_Mar-Barcelona_Catalonia.html", "text": "Started our first day at the La Sagrada Familia. Wow, what a masterpiece of architecture. Breathtaking as words make this place hard to describe.  You must see this Basilica.  ", "publishedDate": "2019-09-15", "language": "en", "rating": 5}, {"id": 709599832, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d246171-r709599832-Basilica_de_Santa_Maria_del_Mar-Barcelona_Catalonia.html", "text": "I am not a religious person, but having read the book, and watched the TV series (La Catedral del Mar), I had to visit this place. \nTo begin with, it's not easy to get there. Everybody says \"just ahead\" but it seems endless. \nThe place itself is not the best kept jewel of the crown, but the history behind it is marvelous. I spent almost an hour sitting there and admiring each stone and glass that conforms it. \nFor those of you who don't k ow anything about it, this place was built by the People, not by any rich man's order. Fishermen, loaders/unloaded and all types of tradesmen built this for free. From the first to the last stone. Amazing!!  \nIf I come back to Barcelona, I will visit again. ", "publishedDate": "2019-09-14", "language": "en", "rating": 5}, {"id": 709594560, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d246171-r709594560-Basilica_de_Santa_Maria_del_Mar-Barcelona_Catalonia.html", "text": "I love this basilica because the local people made it, also I read the book (la catedral Del Mar) so it’s exciting to be here.", "publishedDate": "2019-09-14", "language": "en", "rating": 5}, {"id": 709542887, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d246171-r709542887-Basilica_de_Santa_Maria_del_Mar-Barcelona_Catalonia.html", "text": "Absolutely stunning. Breathtaking and emotional feelings whilst inside. Well worth paying entry fee to view. ", "publishedDate": "2019-09-13", "language": "en", "rating": 5}, {"id": 709338794, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d246171-r709338794-Basilica_de_Santa_Maria_del_Mar-Barcelona_Catalonia.html", "text": "Somber Gothic style. The devotion and piety of people in medieval times, to contribute and raise such a structure amazes me. The Church is beautiful and serene with a personality of its own though it is shadowed in location and renown by the Catedral de Barcelona. But to me it made a great walking tour of Gothic Quarters starting from one and ending on the second.\n\nMake time to sit for a few minutes. Take in the ceiling art and stained glasses", "publishedDate": "2019-09-13", "language": "en", "rating": 5}, {"id": 708697974, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d246171-r708697974-Basilica_de_Santa_Maria_del_Mar-Barcelona_Catalonia.html", "text": "We stopped by to see this beautiful Basilica on our way to the zoo and we loved it, it is quite big and very impressive, I loved the big columns and also the stained glass, very impressive work. \nThe entry is free so definitely one of Barcelona's attractions that should not be missed. ", "publishedDate": "2019-09-10", "language": "en", "rating": 5}, {"id": 708170584, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d246171-r708170584-Basilica_de_Santa_Maria_del_Mar-Barcelona_Catalonia.html", "text": "This church is definitely worth a visit. It is beautiful and awe inspiring. It is free to the public, of course and in a great location.", "publishedDate": "2019-09-09", "language": "en", "rating": 5}, {"id": 708133082, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d246171-r708133082-Basilica_de_Santa_Maria_del_Mar-Barcelona_Catalonia.html", "text": "Although this a parish church it has the size and feel of a cathedral. The style is Gothic and because much of the interior was burned in 1936 the original gothic constructions more visible and experiential. The height of the roof inside is quite amazing and the wide spacing of the pillars emphasises the space of the structure. You can go on a tour of the upper level up and across the roof, book this just inside the main entrance, there are multilingual options. ", "publishedDate": "2019-09-09", "language": "en", "rating": 5}, {"id": 708083494, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d246171-r708083494-Basilica_de_Santa_Maria_del_Mar-Barcelona_Catalonia.html", "text": "its roof tops  and is  impressive in its simplicity.  We learnt a lot about its construction and how the workmen, who carried out the stones from afar, were given tribute in various paintings depicting them carrying bags of stones on their backs. \nChristine V", "publishedDate": "2019-09-09", "language": "en", "rating": 5}, {"id": 708076021, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d246171-r708076021-Basilica_de_Santa_Maria_del_Mar-Barcelona_Catalonia.html", "text": "The church is impressive. The architecture is amazing. Gothic style. Quiet inside. Good to stop for quiet prayer. ", "publishedDate": "2019-09-09", "language": "en", "rating": 5}, {"id": 707444088, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d246171-r707444088-Basilica_de_Santa_Maria_del_Mar-Barcelona_Catalonia.html", "text": "A place that shows gothic architecture. Full of different catholic saints inside the basilica.  As a catholic I was in awe of the church and as  tourist I could appreciate the history the building has. \n\nEveryone was respectful inside and it was fully accessible also. \n\n", "publishedDate": "2019-09-07", "language": "en", "rating": 5}, {"id": 707294078, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d246171-r707294078-Basilica_de_Santa_Maria_del_Mar-Barcelona_Catalonia.html", "text": "A lovely church without the massive queues - very impressive walk around and very touching - reasonably priced too", "publishedDate": "2019-09-06", "language": "en", "rating": 4}, {"id": 707216984, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d246171-r707216984-Basilica_de_Santa_Maria_del_Mar-Barcelona_Catalonia.html", "text": "It was a great privilege to be able to celebrate mass here. The architecture is amazing and the singing lovely.\n\nIt is quite distracting the numbers of visitors wandering about and taking photos during the service.\n\n", "publishedDate": "2019-09-06", "language": "en", "rating": 5}, {"id": 707026263, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d246171-r707026263-Basilica_de_Santa_Maria_del_Mar-Barcelona_Catalonia.html", "text": "Beautiful church with a great story. No admission to pay. Easy to find if you are on the Hop on Hop off bus tour. Just ask one of the staff on the bus. The bus stops is just a short distance from the El Born district. On the way to the church you can also see the old market, that was so long buried and was once a park.   ", "publishedDate": "2019-09-05", "language": "en", "rating": 5}, {"id": 707008947, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d246171-r707008947-Basilica_de_Santa_Maria_del_Mar-Barcelona_Catalonia.html", "text": "This is a lovely classic cathedral that felt like a piece of history and a place of worship.  Just beautiful.  Recommended to us by a local person.  No charge to enter after 5pm. Go in, sit down, and relax. ", "publishedDate": "2019-09-05", "language": "en", "rating": 5}, {"id": 706873577, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d246171-r706873577-Basilica_de_Santa_Maria_del_Mar-Barcelona_Catalonia.html", "text": "Beautiful old church, hope to see some decency, you will love the architecture in this place, worth visit", "publishedDate": "2019-09-05", "language": "en", "rating": 3}, {"id": 706870812, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d246171-r706870812-Basilica_de_Santa_Maria_del_Mar-Barcelona_Catalonia.html", "text": "Only visited the outside of the Cathederal as tickets need to be booked on line.  Architecture was wonderful.", "publishedDate": "2019-09-05", "language": "en", "rating": 5}, {"id": 706566079, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d246171-r706566079-Basilica_de_Santa_Maria_del_Mar-Barcelona_Catalonia.html", "text": "Excellent sacred building. Worth visit, in my opinion on Sunday morning. It not because you do not pay at all, but because you will feel more easily the.... \"Grace of Santa Maria (Panagia in Greek)", "publishedDate": "2019-09-04", "language": "en", "rating": 5}, {"id": 706349783, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d246171-r706349783-Basilica_de_Santa_Maria_del_Mar-Barcelona_Catalonia.html", "text": "Living in Barcelona and have to say that for me, this is the most beautiful church in the city. Smaller than the cathedral but most particular. The book La catedral del Mar and the tv show is based on this beatiful church, build by the fishermans on the 14th century.", "publishedDate": "2019-09-04", "language": "en", "rating": 5}, {"id": 706348928, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d246171-r706348928-Basilica_de_Santa_Maria_del_Mar-Barcelona_Catalonia.html", "text": "We havent been inside but from the outside it looks huge and great. The history about it, is the most interesting thing for me", "publishedDate": "2019-09-04", "language": "en", "rating": 4}, {"id": 705928626, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d246171-r705928626-Basilica_de_Santa_Maria_del_Mar-Barcelona_Catalonia.html", "text": "We found the Basilica de Santa Maria del Mar to be just as interesting, if not more so, than the cathedral of Barcelona. The gothic architecture is spectacular, the history of how funds were raised to build the structure so quickly interesting, and the views from the top of the cathedral roof panoramic and beautiful. The guide Paul was super passionate about the site and extremely knowledgeable and engaging.", "publishedDate": "2019-09-03", "language": "en", "rating": 5}, {"id": 705411997, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d246171-r705411997-Basilica_de_Santa_Maria_del_Mar-Barcelona_Catalonia.html", "text": "We liked this smaller cathedral more than the large Barcelona cathedral.  Very impressive and more authentic than the large cathedral that has been re-made in many areas.  Free on Sunday before 2.", "publishedDate": "2019-09-01", "language": "en", "rating": 4}, {"id": 704031220, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d246171-r704031220-Basilica_de_Santa_Maria_del_Mar-Barcelona_Catalonia.html", "text": "Stunning, well worth the wait to get in. History of site is very, very interesting. Can’t help but think about what you saw and heard for days afterwards.", "publishedDate": "2019-08-28", "language": "en", "rating": 5}, {"id": 702585095, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d246171-r702585095-Basilica_de_Santa_Maria_del_Mar-Barcelona_Catalonia.html", "text": "Grand old church with opera buskers very fitting indeed, The church has a wonderful history and very beautiful piece of architecture dating back to 1700;s", "publishedDate": "2019-08-24", "language": "en", "rating": 5}, {"id": 702258552, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d246171-r702258552-Basilica_de_Santa_Maria_del_Mar-Barcelona_Catalonia.html", "text": "The main steeple is free to see. You can see the rest for about $10. Small gift shop sells candles, literature and postcards.", "publishedDate": "2019-08-23", "language": "en", "rating": 5}, {"id": 701904445, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d246171-r701904445-Basilica_de_Santa_Maria_del_Mar-Barcelona_Catalonia.html", "text": "Highly recommend.  Worth $10 to see Barcelona from the center of the city.  Definitely worth the sweaty trek up the stairs in the summer.  Quick and informational tour, as well.", "publishedDate": "2019-08-22", "language": "en", "rating": 5}, {"id": 701215413, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d246171-r701215413-Basilica_de_Santa_Maria_del_Mar-Barcelona_Catalonia.html", "text": "Should visit place. Something special & peaceful. Entrance fees is reasonable €7/per person.\nParticular About dressing. Sleeves & short shots are not allowed, hence they provide a  wrap ", "publishedDate": "2019-08-20", "language": "en", "rating": 4}, {"id": 700800717, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d246171-r700800717-Basilica_de_Santa_Maria_del_Mar-Barcelona_Catalonia.html", "text": "Free to get in (donation optional) but don't be fooled by the old guy sitting at the entrance asking for money. Donation box inside. Well worth a visit!", "publishedDate": "2019-08-19", "language": "en", "rating": 4}, {"id": 700606033, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d246171-r700606033-Basilica_de_Santa_Maria_del_Mar-Barcelona_Catalonia.html", "text": "Our family of 6 enjoyed this visit-especially climbing to the top of the church-the views of the city were great. Don't miss this. The guide was really knowledgeable and easy-going.", "publishedDate": "2019-08-19", "language": "en", "rating": 5}, {"id": 699713523, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d246171-r699713523-Basilica_de_Santa_Maria_del_Mar-Barcelona_Catalonia.html", "text": "Very nice architecture in this church, especially the stained glass windows when the sun is right.  Not a lot of details inside because it was burned during the civil war.  Still there is some interesting art around the church.  ", "publishedDate": "2019-08-16", "language": "en", "rating": 4}, {"id": 698696661, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d246171-r698696661-Basilica_de_Santa_Maria_del_Mar-Barcelona_Catalonia.html", "text": "Quiet, prayer inspiring. An\nMiller than cathedral of Barcelona but none the less a magnificent example of  structure, beauty and peace. ", "publishedDate": "2019-08-13", "language": "en", "rating": 5}, {"id": 698041612, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d246171-r698041612-Basilica_de_Santa_Maria_del_Mar-Barcelona_Catalonia.html", "text": "I am not an extremely Catholic person, but this church is my favorite.\nI don't know how to describe it but I feel good looking at the ceiling here. An inner peace.\nIt's worth visiting. And try to discover the symbol of Barcelona FCB", "publishedDate": "2019-08-12", "language": "en", "rating": 4}]}}]