[{"locationId": 8471899, "name": "Somorrostro", "placeType": "ATTRACTION", "reviewListPage": {"reviews": [{"id": 752508606, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d8471899-r752508606-Somorrostro-Barcelona_Catalonia.html", "text": "During our exploration of the Barcelona waterfront, my wife and I enjoyed spending part of an afternoon strolling along Somorrostro Beach. While all of the beaches were full of activity, it appeared that Somorrostro was a bit less crowded and was very clean. Even in September, it was a perfect day at the beach for all of the visitors whether in the water or just have fun in the sand.", "publishedDate": "2020-04-11", "language": "en", "rating": 4}, {"id": 748285743, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d8471899-r748285743-Somorrostro-Barcelona_Catalonia.html", "text": "First of all the food was really nice and delucious. However if you are hungry and you appreciate your money I recommend you to go somewhere else or you will starve.", "publishedDate": "2020-02-29", "language": "en", "rating": 3}, {"id": 727419093, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d8471899-r727419093-Somorrostro-Barcelona_Catalonia.html", "text": "We had a nice beach day at Somorrostro. It’s pretty close to Barceloneta, and a half mile or so from a metro stop. Cute beach with some good restaurants (especially Carpe Diemfor drinks). ", "publishedDate": "2019-11-18", "language": "en", "rating": 4}, {"id": 722552911, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d8471899-r722552911-Somorrostro-Barcelona_Catalonia.html", "text": "A lovely quiet morning at the beach. This area near the Olympic port was a great spot for the kids. An area was marked out in the sea for safe swimming.\n\nThere were lots of pensioners doing morning except uses beside us. As with the other major beaches, showers and so on were on the promenade.", "publishedDate": "2019-10-30", "language": "en", "rating": 5}, {"id": 690680260, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d8471899-r690680260-Somorrostro-Barcelona_Catalonia.html", "text": "This is a great beach in the Ciutat Vella district of east Barcelona. A very popular beach, so not for anyone looking for a quite spot to enjoy the sun. There's lots of facilities around the beach.", "publishedDate": "2019-07-18", "language": "en", "rating": 5}, {"id": 689030757, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d8471899-r689030757-Somorrostro-Barcelona_Catalonia.html", "text": "Possibly the best food I've ever tasted - and good service and atmosphere too. Waiter really helpful", "publishedDate": "2019-07-12", "language": "en", "rating": 5}, {"id": 683429141, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d8471899-r683429141-Somorrostro-Barcelona_Catalonia.html", "text": "It is a long beautiful beach.\nGood for relaxing and sun bathing.\nWe went there at early June 2019, the water still too cold to swim. My son enjoyed playing with the sand there", "publishedDate": "2019-06-22", "language": "en", "rating": 4}, {"id": 677051252, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d8471899-r677051252-Somorrostro-Barcelona_Catalonia.html", "text": "The Beach is excellent, good access via subway and taxi, even you can walk down to arrive there. There are several proper restaurants near the beach in addition to water sport facilities. Please remember for renting jet sky and so on you need leave a deposit. \nIt is possible to rent Sunshade or buy simple fabric ground cloths. \nYou can buy soft drinks and beer from locals, quite cold and enjoyable. \nAbout the cleanness of the beach, people should be care a little bit more, since there were some rubbishes in the water but not annoying. \n\nIt's a good option, highly recommended!", "publishedDate": "2019-05-28", "language": "en", "rating": 4}, {"id": 656749054, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d8471899-r656749054-Somorrostro-Barcelona_Catalonia.html", "text": "One of the many beach areas along the coast, half way along you come to \"muscle beach\" were the young male/femael are showing off their fitness skills.", "publishedDate": "2019-03-06", "language": "en", "rating": 4}, {"id": 643565683, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d8471899-r643565683-Somorrostro-Barcelona_Catalonia.html", "text": "\nVery good food! Perfect place if you want seafood, but we had also good vegetarian dish too. And bit different but good cava. And the amosphere is maybe the best part of the place: nice, chilly jazz playing in the background and the staff is helpful and friendly.", "publishedDate": "2019-01-04", "language": "en", "rating": 5}, {"id": 634243125, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d8471899-r634243125-Somorrostro-Barcelona_Catalonia.html", "text": "I can highly recommend this restaurant a couple of blocks away from the tourist street. While staying at Hotel W it was walking distance to this restaurant. I found it on yelp, it was one of the better food experiences in Barcelona. Very good food, great service that gave very good recommendations for both drink and food. \n\nI can live without electric oysters, it was fun and different but the tuna was amazing!!! ", "publishedDate": "2018-11-18", "language": "en", "rating": 5}, {"id": 624078113, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d8471899-r624078113-Somorrostro-Barcelona_Catalonia.html", "text": "We chose Somorrostro as they are part of a slow food collective that promotes use of local, organic and sustainable food. The food was delicious! I had the catch of the day and my husband had buttifarra and octopus rice. Desserts were lovely too, great selection of wine (though in the end I just had sangria) and the service was friendly and attentive. The meal was very reasonably priced. It's a cute little restaurant, I'm so glad we found it.", "publishedDate": "2018-10-11", "language": "en", "rating": 5}, {"id": 622895571, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d8471899-r622895571-Somorrostro-Barcelona_Catalonia.html", "text": "This place is magic from the decoration to the food. The signature dishes represent the Spanish gastronomy with a touch of fantasy. Incredible what they can do in that little kitchen, just watching them cooking is fancy!! Recommendations: get the crab, the bonito canape and the oven cooked rice!!! ENJOY!", "publishedDate": "2018-10-07", "language": "en", "rating": 5}, {"id": 607721982, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d8471899-r607721982-Somorrostro-Barcelona_Catalonia.html", "text": "Not being a person accustomed to lying on the beach for the day, I was rather horrified to be expected to pay out €90 to keep in the shade from the scorching hot sun/sand.  We were only going for a quick swim before lunch and not intending to stay there for the day, so we joined the unconscious drunk under the shade of a palm tree instead.", "publishedDate": "2018-08-18", "language": "en", "rating": 2}, {"id": 602122801, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d8471899-r602122801-Somorrostro-Barcelona_Catalonia.html", "text": "Sandy beach with some pebbles at the shoreline.  Lifeguards, public toilets, easy distance from the metro and much calmer than those closest to the port.   If you want to hire a brolly and recliner they are €10 each so a brolly and two recliners are €30 for the whole day, but worth considering if you burn easily and didn’t pack a sun brolly.  ", "publishedDate": "2018-08-02", "language": "en", "rating": 4}, {"id": 601591887, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d8471899-r601591887-Somorrostro-Barcelona_Catalonia.html", "text": "Location of the beach was good, just 200m from bus stop.  \n\nThe bottom of the beach was rocky.  Announcement kept issued in the beach to remind children not jumping into water as the rocks would do permanent damage to children. Water was not so clean. \n\nIt charged 15€ each for beach couch and parasol (compared with 10€ in Bogatell). \n\nI’d prefer Platja del Bogatell more in terms of quality of sand, water and the rental cost.", "publishedDate": "2018-07-31", "language": "en", "rating": 3}, {"id": 594947691, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d8471899-r594947691-Somorrostro-Barcelona_Catalonia.html", "text": "We stopped here during our hop on hop off tour of Barcelona. We spent a few hours at the beach and then had lunch at restaurant near by.  The scenery was great and the beach very clean.  Great place to stop by for a few hours.", "publishedDate": "2018-07-10", "language": "en", "rating": 4}, {"id": 579319748, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d8471899-r579319748-Somorrostro-Barcelona_Catalonia.html", "text": "The beach sand castle builders, bubble blowers, and entertainers are charming. The beach itself is very developed, with multiple shops and tents with all kinds of things for sale. Ignore the mojito and blanket sellers, and if you do want either, haggle like crazy! The views are beautiful. The beach is not like North America beaches, steeper bank into the ocean and a bit more rocky. Walking around was pleasant.", "publishedDate": "2018-05-10", "language": "en", "rating": 4}, {"id": 568532581, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d8471899-r568532581-Somorrostro-Barcelona_Catalonia.html", "text": "This beach is one of many lovely beaches all connected up along the Barcelona coastline.  \n\nThere are lots of interesting things to see and do for kids and adults.  There's the climbing tree for kids (see pic), the huge outdoor gym on the boardwalk is very popular with fitness lovers using every piece of equipment.  If you like looking at attractive muscle men, this is the place to do it!  There also happens to be good views of the open sea from here too.\n\nThe casino is just at the end of Somorrostro Beach and there is a goldfish sculpture which looks wonderful reflecting the sun light from Somorrostro Beach (see pics).", "publishedDate": "2018-03-24", "language": "en", "rating": 4}, {"id": 420424104, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d8471899-r420424104-Somorrostro-Barcelona_Catalonia.html", "text": "wide beach with nice sand and calm sea and a lot of restaurants and bars ...umbrella and chair are for 10 e per each may be not suitable for kids because of lot of topless", "publishedDate": "2016-09-20", "language": "en", "rating": 4}]}}]