[{"locationId": 244199, "name": "Frederic Mares Museum (Museu Frederic Mares)", "placeType": "ATTRACTION", "reviewListPage": {"reviews": [{"id": 750730514, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d244199-r750730514-Frederic_Mares_Museum_Museu_Frederic_Mares-Barcelona_Catalonia.html", "text": "The religious art collection is beautiful, extensive and presented thoughtfully. But there is so much more to see in the museum. I was blown away by the various collections in the upper floors.", "publishedDate": "2020-03-13", "language": "en", "rating": 4}, {"id": 749163071, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d244199-r749163071-Frederic_Mares_Museum_Museu_Frederic_Mares-Barcelona_Catalonia.html", "text": "Located in a lane way near the Cathedral de Catalunya this museum is worth a look.  Has a large number of items on display across multiple floors.  I suggest getting the audioguide for the additional one euro and allowing a couple of hours to work your way through.  ", "publishedDate": "2020-03-04", "language": "en", "rating": 5}, {"id": 740029515, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d244199-r740029515-Frederic_Mares_Museum_Museu_Frederic_Mares-Barcelona_Catalonia.html", "text": "It was a cool windy day and we came across this museum. We had never heard of this man but that did not deter us. The museum was a collection of many things. Frederic Mares himself was a famous Spanish sculptor but he was also a collector. There were 3 floors plus a basement jam full of artifacts but the 3rd floor was closed for some work. We spent over 4 hours looking at all the exhibits from religious to tobacco pipes to woman’s fans to name a few. \nWell worth the visit. ", "publishedDate": "2020-01-19", "language": "en", "rating": 5}, {"id": 727290341, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d244199-r727290341-Frederic_Mares_Museum_Museu_Frederic_Mares-Barcelona_Catalonia.html", "text": "Brilliant place, in the centre of the gothic quarter, next to the cathedral. A collection of collections! Hardly anybody there, fascinating place!", "publishedDate": "2019-11-18", "language": "en", "rating": 5}, {"id": 726677500, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d244199-r726677500-Frederic_Mares_Museum_Museu_Frederic_Mares-Barcelona_Catalonia.html", "text": "Located on the left side of the cathedral, this beautiful museum holds a collection of sculptures, ceramics, playing cards, door knockers, . . .  and many other interesting artifacts, spanning centuries. It is a museum worth visiting several times, so as not to overload the senses. We visited three times: an hour and a half each time, and an additional hour reading in the small library located next to the reception desk. Few people were there when we visited, which is wonderful when you can roam to your heart’s content. \n\nNot to be missed for the quantity of artifacts in each category, and the quality of the exhibited works, mostly of Spanish origin. In fact, the arrangement of pieces, is an art unto itself. If you have the time, don’t miss this unique experience. A memorable taste of Barcelona. ", "publishedDate": "2019-11-15", "language": "en", "rating": 5}, {"id": 714471098, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d244199-r714471098-Frederic_Mares_Museum_Museu_Frederic_Mares-Barcelona_Catalonia.html", "text": "Amazing collection - a serious collection of religious artefacts from the area and then an explosion of his private collection [ loved the fans] and then pieces of his work. We visited on a Sunday morning and decided to pay even though would have been free after 3pm. It was worth every penny and we spent about 4 hours there including a visit to the lovely outside cafe. We were virtually the only people there, it was cool and quiet and a welcome break from the hustle and bustle of outside. One of our favourite experiences in Barcelona. Go see !", "publishedDate": "2019-10-01", "language": "en", "rating": 5}, {"id": 712018736, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d244199-r712018736-Frederic_Mares_Museum_Museu_Frederic_Mares-Barcelona_Catalonia.html", "text": "We stumbled in on a Sunday. No admission, so it was just to go inside.\nWhat a gem, not to be missed. This guy was a hoarder of all things interesting.\nFrom crusifics to combs and a lot of everything.\nGreat experience, we absolutely loved it", "publishedDate": "2019-09-22", "language": "en", "rating": 5}, {"id": 708632441, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d244199-r708632441-Frederic_Mares_Museum_Museu_Frederic_Mares-Barcelona_Catalonia.html", "text": "This place is truly a find. It is very inexpensive compared to other Barcelona sights, uncrowded, and has one of the most interesting sculpture collections you could hope to find. It's pretty magical. My only regret isn't I couldn't stay longer or come back a second time (for free on the same ticket!) to visit the collection of everyday objects. The audioguide is top-notch, too. Highly recommended for all art lovers.", "publishedDate": "2019-09-10", "language": "en", "rating": 5}, {"id": 708558011, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d244199-r708558011-Frederic_Mares_Museum_Museu_Frederic_Mares-Barcelona_Catalonia.html", "text": "At first I thought this would just be some nut's junk collection- boy was I wrong! From serious and ancient arts and crafts incorporated right into the building, to whimsical stuff you;ve never seen before, It goes on and on and on.  Anything and everything you could imagine, and then some- and then some more!  You have to see it to believe it.  Honestly, don't plan for much else the day of your visit because this will wear you out.  If I have any critique of this collection, it's that there is too much wonderful stuff to see in one visit.  Also, there could be better descriptions of many sub-collections.  I'm worn out just thinking about ti.", "publishedDate": "2019-09-10", "language": "en", "rating": 4}, {"id": 706579917, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d244199-r706579917-Frederic_Mares_Museum_Museu_Frederic_Mares-Barcelona_Catalonia.html", "text": "This is a corker of a museum. Frederick Mares was a sculptor and collector of just about everything you can think of....almost to the point of hoarding. The religious art on the lower floors was breathtaking. We spent a wonderful morning mooching through the museum. Even the building is beautiful. Well worth a visit.", "publishedDate": "2019-09-04", "language": "en", "rating": 4}, {"id": 700997316, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d244199-r700997316-Frederic_Mares_Museum_Museu_Frederic_Mares-Barcelona_Catalonia.html", "text": "When I visited, I think I was the only visitor in the museum, which is a crying shame, because it is a little gem.\n\nThe museum isn't going to be for everyone - I deliberately ditched my young kids with their mother(the took a trip to the football stadium)  as they would have certainly been bored, especially by the parts I wanted to see.\n\nMy main reason for visiting was the mediaeval religious art collection, which is one of the most extensive I have visited. It was fascinating to see Romanesque statuary and the development into high mediaeval sculpture. A lot of church rood crucifixes and Madonna and child statues. The Limoges enamel exhibit has some beautiful pieces in it.\n\nThe next part of the museum is a cabinet of curiosities - items Frederic Mares collected in his lifetime. This is presented in themed rooms, for example photography (my favourite - with both equipment and daguerreotypes for example), fans, keys toys. A mad and wonderful mix of objects. It's also, in some ways a museum of what a museum was.\n\nThe final section is a room of sculpture, which had some nice pieces in.\n\nIt's worth researching the museum - I wouldn't recommend it for everyone but if some of the  collection coincidences with your interests it's hugely enjoyable.", "publishedDate": "2019-08-20", "language": "en", "rating": 5}, {"id": 683132269, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d244199-r683132269-Frederic_Mares_Museum_Museu_Frederic_Mares-Barcelona_Catalonia.html", "text": "We visited today, and while at first the collection was interesting, eventually you get very bored of very similar sculptures of the crucifixion. It didn't help that one of the security guards followed us relentlessly and not very subtly, which made us very uncomfortable and unwelcome.", "publishedDate": "2019-06-21", "language": "en", "rating": 3}, {"id": 680627454, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d244199-r680627454-Frederic_Mares_Museum_Museu_Frederic_Mares-Barcelona_Catalonia.html", "text": "We have spent many hours in this museum but (luckily) we realised in the beginning that it's impossible to truly see all on display, so we have made hundreds of photos to marvel this collection later on. \nMares not only donated his collection to the city of BCN but he included some of his own sculptures is well, these were displayed in the \"Library-Study of Frederic Mares\" and they were beautiful.\nTo enter we have paid 2.40 euro pp for our (senior) tickets. Keep your tickets because within 6 months you can use them again to re-visit this beautiful place.\nWe noticed (sadly) that many tourists and tour groups walked past this well organised and presented museum, surely in this plethora of collections (not to mention the Mares sculptures) we all can find some items that interests us. \n\n", "publishedDate": "2019-06-10", "language": "en", "rating": 5}, {"id": 673329035, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d244199-r673329035-Frederic_Mares_Museum_Museu_Frederic_Mares-Barcelona_Catalonia.html", "text": "The building housing the museum is interesting and if you have an interest in any of the Mares collections then you will like this museum but there was not much for us. ", "publishedDate": "2019-05-11", "language": "en", "rating": 3}, {"id": 668725914, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d244199-r668725914-Frederic_Mares_Museum_Museu_Frederic_Mares-Barcelona_Catalonia.html", "text": "Do you like strange collections ?\nThis guy has them \nFans - swords - pipes - keys - paper items - soldiers- an array of the most fun stuff\nLots of religious statues also but I am so tired of \nJesús on the cross - saint who gives a hoot - etc.  \nBut the too 2 floors are most fun !!!!\nDefinitely catch IT - next to cathedral \nThis and Sant Pau and cada Vicens- were my favorite things \nNot crowded - no hype - ", "publishedDate": "2019-04-23", "language": "en", "rating": 5}, {"id": 664836862, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d244199-r664836862-Frederic_Mares_Museum_Museu_Frederic_Mares-Barcelona_Catalonia.html", "text": "This museum is truly a treasure! A fantastic collection of art! Highly recommend the audio guide to further immerse yourself in this time capsule. A very affordable way to spend a quiet afternoon!", "publishedDate": "2019-04-08", "language": "en", "rating": 5}, {"id": 660568726, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d244199-r660568726-Frederic_Mares_Museum_Museu_Frederic_Mares-Barcelona_Catalonia.html", "text": "Only visited after seeing this on a TV programme. My partner and I had Barcelona Cards so got in for free.\n\nNotably, we visited this museum in the afternoon after visiting the Picasso museum in the morning and both thought this museum was far better to visit. The collections are well grouped and, at the start, very similar with a lot of religious works which have been preserved when otherwise they would have been lost. The audio guide is very helpful in  pointing out which works to pay attention to.\n\nThere is a second part of the museum which is the Collectors Cabinet where Frederic Mares had collected lots of things - some ordinary such as cigarette cards, some less so such as pipes. This gave a varied insight into Catalonian life.\n\nVery much recommended - go here rather than the Picasso Museum!", "publishedDate": "2019-03-23", "language": "en", "rating": 5}, {"id": 654014261, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d244199-r654014261-Frederic_Mares_Museum_Museu_Frederic_Mares-Barcelona_Catalonia.html", "text": "This quiet and attractively laid out museum must be visited for its huge and beautiful collection of Spanish sculptures from the 12th to 19th Centuries as well as a few interesting paintings and altar- pieces. Also, for its unbelievably large collection of thousands of \"everyday\" objects representing mainly 19th and early 20th Century bourgeois life.. absolutely stunning in its variety and number... from canes and umbrellas to watches and clocks, pipes and other smoking paraphenalia of the time, toys, cameras and daguerrotypes, fans, glassware... and much more. The staff were helpful and the entrance fee, with audio, was less than 5€. A fascinating couple of hours away from the crowds.", "publishedDate": "2019-02-21", "language": "en", "rating": 5}, {"id": 649404886, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d244199-r649404886-Frederic_Mares_Museum_Museu_Frederic_Mares-Barcelona_Catalonia.html", "text": "This is one of those small, somewhat obscure museums that don't get the attention of most tourists and it's particularly understandable in Barcelona, with so many marquee sites and the fact that most people only stay a few days. This is our second trip and we are getting out a little later. So after we saw the cathedral (for the 2nd time) because it was close to our hotel, we decided to go here because it is next door, we didn't have much energy (my wife was just recovering from 3 and 1/2 days of staying in the hotel because she was sick) and we thought we wouldn't need much time. We were wrong about how long it would take. The collection is much larger than we suspected. And it was good and diverse. It's almost impossible to describe the range of objects. Go to the website for an idea. We actually pooped out after we spent a short  amount of time on the third floor. We had spent maybe two hours and to finish up, we might have had to spend two more. It's a lot.\n\nThis was supposed to be a kind of throw away, doing it simply because it was convenient. It turned out to be much more, worthy of consideration for all tourists. For a new visitor to Barcelona with just a few days, would I come here? No. There are other places that are far more essential that can easily fill up 4-5 days. The Gaudi sites alone can take up 2-3 days. On the other hand, if you are a veteran Barcelona visitor and you like museums, particularly the ones that have diverse, eclectic collections, and it's raining outside, there are worse choices.", "publishedDate": "2019-01-31", "language": "en", "rating": 4}, {"id": 644143382, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d244199-r644143382-Frederic_Mares_Museum_Museu_Frederic_Mares-Barcelona_Catalonia.html", "text": "I was walking around Barcelona by myself and discovered that a lot of museums are free on the first Sunday of the month, yay me! I went to three. The last museum was this one, and well it was so quirky and unique, I instantly liked it. The bottom floors are sculptures and religious artifacts - not my cup of tea. But the top floors had toys, glasses, knives, jewelry and even cigars. This guy really liked to collect and cool vintage quality items as well. Be advised, I probably liked it more because it was free and I love vintage items, however it lost a point bc the religious artifacts in the bottom plants are too much. ", "publishedDate": "2019-01-06", "language": "en", "rating": 4}, {"id": 637067316, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d244199-r637067316-Frederic_Mares_Museum_Museu_Frederic_Mares-Barcelona_Catalonia.html", "text": "The collection of Frederic Mares is mind boggling. He must have been one of those collectors that have the magpie instinct, collecting everything from keys and cards to religious masterpieces. So the first floor exhibits early Christian art, from the 12th and 13th century, and it is superb. It can really lift you up: the simple, somewhat primitive sculptures of Mother and Child, Jesus on the cross and Calvary groups is truly outstanding, so much that you get ready to forgive the catholic church for its crimes against humanity, their destruction of cultures and their inquisition. Wow. But then you go to the second floor, where the Christian art becomes overbearing, pathetic and exaggerated, and your mood can sower. A saving grace are a few superb paintings that are very enjoyable. Then, last, if you go to the third and fourth floors, the magpie instinct of the collector becomes ridiculous. So in summary, the first floor is amazing, and is worth the visit without reserve. All the rest is at your own risk.", "publishedDate": "2018-12-02", "language": "en", "rating": 4}, {"id": 633563445, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d244199-r633563445-Frederic_Mares_Museum_Museu_Frederic_Mares-Barcelona_Catalonia.html", "text": "This would have been an enjoyable experience if not for the staff members following myself and my friends extremely closely. Practically breathing down our necks. Very rude when asking questions about the museum pieces too. Don't bother.", "publishedDate": "2018-11-15", "language": "en", "rating": 1}, {"id": 632426372, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d244199-r632426372-Frederic_Mares_Museum_Museu_Frederic_Mares-Barcelona_Catalonia.html", "text": "Beautiful well appointed new building housing the lifetime collections  of Frederic Marès. Wall cabinets and showcases of both the great and mundane beautifully displayed.\nImpossible to take all of it in during one visit and you can return again on the same tickets.\nFabulous collection of sculpture.\n", "publishedDate": "2018-11-10", "language": "en", "rating": 5}, {"id": 632291194, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d244199-r632291194-Frederic_Mares_Museum_Museu_Frederic_Mares-Barcelona_Catalonia.html", "text": "We happened to stumble upon this museum and were pleasantly surprised it was free on Sunday afternoon.   LOTS to see.  Mostly religious but still intrigued to see how one man could amass so many items.", "publishedDate": "2018-11-09", "language": "en", "rating": 4}, {"id": 613788071, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d244199-r613788071-Frederic_Mares_Museum_Museu_Frederic_Mares-Barcelona_Catalonia.html", "text": "An extraordinary array of Hispanic sculpture by Frederic Mares, an obsessive collector. FM obviously believed you can never have too many wooden sculptures of the crucifixion so he bought up hundreds of them. Many of the other sculptures are religious too. I liked the stone sculptures the best, and there is a nice collection of small ornate boxes. Sometimes you hurry from one room to the next because it's all so repetitious. It's a curiosity museum, hard to unreservedly recommend, but you'll like some of it. Perhaps take the audio guide, because there is very little explanation of individual pieces.", "publishedDate": "2018-09-04", "language": "en", "rating": 3}, {"id": 610626978, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d244199-r610626978-Frederic_Mares_Museum_Museu_Frederic_Mares-Barcelona_Catalonia.html", "text": "A great place to visit if you enjoy Hispanic sculpture. The museum wasn't crowed when I went and you can get very close to all the pieces.\n\nThe museum is small enough that you can spend a few hours there and see most of the collections.", "publishedDate": "2018-08-26", "language": "en", "rating": 4}, {"id": 605360615, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d244199-r605360615-Frederic_Mares_Museum_Museu_Frederic_Mares-Barcelona_Catalonia.html", "text": "I've been visiting the museum cafe for about 15 years, but this year may well be my last visit. Things look the same, the staff are still lovely, but the menu has changed and the food is really not very good. It used to be one of our favourite places for lunch, but not now. What has happened? Has the chef changed or something? Hugely disappointing.", "publishedDate": "2018-08-11", "language": "en", "rating": 1}, {"id": 592872045, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d244199-r592872045-Frederic_Mares_Museum_Museu_Frederic_Mares-Barcelona_Catalonia.html", "text": "Stopped by this museum on a friend’s recommendation.  The admission is incredibly reasonable (less than € 10 for two people) and worth it to get to walk through the building housing the collection alone.  The collections are an extensive array of everything from stamps to combs to pipes to early cameras to door knockers and other iron work.  It’s almost as if an eccentric border had a curator go through their possessions and arrange them into an exhibition.  For the price, it is absolutely worth seeing as there was virtually no one else at the museum when we went and the exhibits are an interesting throwback in time.\n\nI would skip the audio guide, not necessary and they *really* over describe the exhibits.", "publishedDate": "2018-07-03", "language": "en", "rating": 4}, {"id": 592559621, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d244199-r592559621-Frederic_Mares_Museum_Museu_Frederic_Mares-Barcelona_Catalonia.html", "text": "If you love Medieval Madonnas and crucifixes, this is the place for you because there are lots of them.\nOtherwise, I would consider spending time elsewhere.\n", "publishedDate": "2018-07-02", "language": "en", "rating": 3}, {"id": 587744608, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d244199-r587744608-Frederic_Mares_Museum_Museu_Frederic_Mares-Barcelona_Catalonia.html", "text": "Frederic Mares Museum is located near to Barcelona Cathedral.  Entry fee of 4 Euro is required under normal situation.  There are lots of items for display including pipes scissors and other artifacts.  Make sure you have time to run through every corner of the museum and the use of 1 Euro for the audio aid is recommended.", "publishedDate": "2018-06-15", "language": "en", "rating": 4}, {"id": 582486924, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d244199-r582486924-Frederic_Mares_Museum_Museu_Frederic_Mares-Barcelona_Catalonia.html", "text": "I've never seen such an extensive collections of pipes, ladies fans, scissors... you name it! Wasn't impressed much with the two \"sculpture\" floors, wish I would go straight up to \"Collectors\". A lot of interesting unusual objects, if you ever enjoyed going through someone's collection or have your own - this is a museum for you!", "publishedDate": "2018-05-24", "language": "en", "rating": 5}, {"id": 573312352, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d244199-r573312352-Frederic_Mares_Museum_Museu_Frederic_Mares-Barcelona_Catalonia.html", "text": "This was just a place we walked by and saw that it was a free entrance and thought why not check it out. So I had no expectations and I didn't know what the museum was about and I still know very little cause there weren't a lot of signs explaining anything really and I would have liked that. Although still a very impressive visit cause I have never seen so much stuff in my life there was everything from a huge collections of pipes to old fashioned armour, tiaras, plates, keys, dolls, glasses, statues. Literally everything! My brain was so tired when we got out of there, but it was totally worth it. I think you would really like this if you are a collector yourself, if you're interested in history and stuff like that.", "publishedDate": "2018-04-14", "language": "en", "rating": 4}, {"id": 563314384, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d244199-r563314384-Frederic_Mares_Museum_Museu_Frederic_Mares-Barcelona_Catalonia.html", "text": "We both really enjoyed our visit to the Frederic Mares Museum. I would certainly recommend a visit with the advice of making sure you leave yourself enough time to see all the artifacts and wonderful collections over the 3 floors. Also, for one Euro the audio is a must, it really enhances the tour and guides you through room by room with interesting facts regarding the items you will be viewing. We did not leave enough time on our first visit, so we completed the next day. I would suggest 3 hours for your visit.", "publishedDate": "2018-02-28", "language": "en", "rating": 5}, {"id": 561446934, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d244199-r561446934-Frederic_Mares_Museum_Museu_Frederic_Mares-Barcelona_Catalonia.html", "text": "I liked the visit, it is a good experience for me.\nI recommend that you find out more information to confirm if you would really like to see the pieces there.\nThe collections is very interesting, and they are located in the last floors.", "publishedDate": "2018-02-19", "language": "en", "rating": 4}, {"id": 557977529, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d244199-r557977529-Frederic_Mares_Museum_Museu_Frederic_Mares-Barcelona_Catalonia.html", "text": "After the Travel Man programme made this sound fascinating, we visited on our last afternoon in Barcelona.  The museum has an extensive collection on two floors of religious sculpture, then on the top two floors a real ephemera cornucopia.  Yet it was all so dry and unengaging, really... by now the UK has found imaginative ways of presenting such collections that Spain, in my experience, has yet to learn.  Also, we were apparently the only visitors (!) and on each floor were pursued intrusively by security staff, which I found uncomfortable and over-zealous.  Why???", "publishedDate": "2018-02-02", "language": "en", "rating": 2}, {"id": 553330399, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d244199-r553330399-Frederic_Mares_Museum_Museu_Frederic_Mares-Barcelona_Catalonia.html", "text": "First of all ensure that you have some time to spend. This visit would require about 1 to 2 hours as its spread in about 3 floors. Really worth visiting. It have got some unique collections which you can see only here and its worth it. The average entry price would be 4 Euro. But on Sundays I think on first Sunday (Because accidentally my visit was on Sunday and I got in free) thats what they told its free entry. And children under 16 I hope its free. You can also take Underground Metro L4 to reach here. They also have a beautiful courtyard with Mandarin trees. They also have audio tours so just go for it. Its only 1 Euro and its worth. They also have a policy where you can use the ticket to gain entry once again if your couldn't finish your visit in one go. If you are in Wheel chair no worries there is lift. I had a baby who enjoyed his cart a lot and I had a tough time.", "publishedDate": "2018-01-12", "language": "en", "rating": 5}, {"id": 545534226, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d244199-r545534226-Frederic_Mares_Museum_Museu_Frederic_Mares-Barcelona_Catalonia.html", "text": "Inaugurated in 1946, The Museu Frederic Marès is rather curious, is extensive with numerous collections.", "publishedDate": "2017-12-06", "language": "en", "rating": 3}, {"id": 543786206, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d244199-r543786206-Frederic_Mares_Museum_Museu_Frederic_Mares-Barcelona_Catalonia.html", "text": "You have got to think... who collects all of this and so many of the same type of thing? Glasses, pipes, jesuses hanging from the cross, nude sculptures, pictures, ... don't come rushed.", "publishedDate": "2017-11-28", "language": "en", "rating": 4}, {"id": 539761078, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d244199-r539761078-Frederic_Mares_Museum_Museu_Frederic_Mares-Barcelona_Catalonia.html", "text": "The guide book indicated this museum has the largest collection of religious art but it has more than that and a lot of it. It is a nice window into the rich religiosity of the early days of the Spanish Empire.", "publishedDate": "2017-11-09", "language": "en", "rating": 5}, {"id": 539190734, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d244199-r539190734-Frederic_Mares_Museum_Museu_Frederic_Mares-Barcelona_Catalonia.html", "text": "Saw this on the BBC before our visit...hence the trip\nWhat a gem (in gothic quarter near Cathedral)\nCost us Euro4 and spent 2 hours inside looking at the collection of history...could have spent more time\nWould definitely go back...the study/library alone is amazing", "publishedDate": "2017-11-07", "language": "en", "rating": 5}, {"id": 539170056, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d244199-r539170056-Frederic_Mares_Museum_Museu_Frederic_Mares-Barcelona_Catalonia.html", "text": "Worth the cost (€4 + €1 for audio device) . Huge collection of old stuff.  Starts with sculptures and religious pieces, lots and lots. Then the collection turns to a very wide assortment of things from 19th century life - like a room full of collected keys, eyeglasses, smoking items and my favorite, the weaponry, to name a few.  After a while it feels too overwhelming but that’s the beauty of these self-guided tours, you can fast-forward or skip parts you’re not interested in.  Recommend seeing.", "publishedDate": "2017-11-07", "language": "en", "rating": 5}, {"id": 525825179, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d244199-r525825179-Frederic_Mares_Museum_Museu_Frederic_Mares-Barcelona_Catalonia.html", "text": "A Seriously big collection. The start of the museum is totally religious, the more you go up the more there is to see. But sometimes it's to much at once. ", "publishedDate": "2017-09-19", "language": "en", "rating": 3}, {"id": 522681754, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d244199-r522681754-Frederic_Mares_Museum_Museu_Frederic_Mares-Barcelona_Catalonia.html", "text": "The museum is divided into two sections. One section is sculpture. The other is collections. We did not see the sculpture. This man was a consummate collector. There were all kinds of items where he accumulated hundreds of items. There was everything from early studio cameras to cigar bands, to match boxes, to blessing fonts, to religious items and much more. It was impressive and have never seen anything like it. The entry fee was negligible and it was one euro each to  use an excellent audio tour  device. We did not have enough time there to see everything!", "publishedDate": "2017-09-08", "language": "en", "rating": 5}, {"id": 522676939, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d244199-r522676939-Frederic_Mares_Museum_Museu_Frederic_Mares-Barcelona_Catalonia.html", "text": "During a  recent trip to Barcelona, after visiting the larger museums and sights, I stopped in to the Frederic Mares Museum.  It is a wonderful collection near the main Cathedral.  Frederic Mares was a well known local sculptor who amassed an amazing collection of an astonishing number of things.  The museum is not overwhelming in size and is centrally located.  It is delightful and unique. I highly recommend it.  There is also a wonderful secluded little tree-filled café in the courtyard of the museum (you do not have to pay the museum entrance to go to the café).  We stopped there for tea, coffee, sandwich or snack several times after we discovered it.  It is a quiet little oasis in an otherwise busy touristic area.  Both the museum and the café were great finds and I have fond memories of both.  I would visit them again if in Barcelona.", "publishedDate": "2017-09-08", "language": "en", "rating": 5}, {"id": 522481927, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d244199-r522481927-Frederic_Mares_Museum_Museu_Frederic_Mares-Barcelona_Catalonia.html", "text": "Maybe we were lucky, not sure, but we have managed to pop in when there was no entry fee, which is always a nice surprise. I have never see such an huge art collection. I enjoyed the feminine items a lot.", "publishedDate": "2017-09-07", "language": "en", "rating": 4}, {"id": 519947114, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d244199-r519947114-Frederic_Mares_Museum_Museu_Frederic_Mares-Barcelona_Catalonia.html", "text": "We had the luck of being able to go on the first Sunday in the month which means that certain museums are free of charge. But I would have quite happily paid 4.20 euros as this was a very interesting museum. The collection is varied. There is a lift as the museum has four floors. I had seen a programme so I knew where the museum was. It is hidden away by the side of the Cathedral and has a charming courtyard. The cafe there is reasonably priced and the food is good.", "publishedDate": "2017-08-31", "language": "en", "rating": 4}, {"id": 519859556, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d244199-r519859556-Frederic_Mares_Museum_Museu_Frederic_Mares-Barcelona_Catalonia.html", "text": "We visited in peak season and had the first three floors all to ourselves while roving hordes of tour groups filled the streets (and got drenched in a downpour).\n\nThis museum is life's work of a mind bogglingly obsessive collector (and talented sculptor). It is interesting to see the progression over centuries of the same religious themes. It's hard to imagine a more comprehensive collection of crucfiction sculptures for example. \n\nThe top two floors are dedicated to extensive collections of things as diverse as fans, time pieces, tin soldiers, etc.\n\nA real bargin at 2.15 Euro each for seniors. The ticket is good for a second admission which is a good thing since it's hard to take it all in at once.", "publishedDate": "2017-08-31", "language": "en", "rating": 4}, {"id": 506281395, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d244199-r506281395-Frederic_Mares_Museum_Museu_Frederic_Mares-Barcelona_Catalonia.html", "text": "Top floor is truly amazing! Toys and theater. Second floor is interesting collection of cards -- tarot cards and playing cards - and objects from the every day. The sculptures on the bottom two floors are beautiful. Tip: Free on Sunday afternoons and NOT crowded during the free time -- almost empty!! Restaurant in the summer in the courtyard -- almost hidden away, but friendly and with delightful food and drink. Sit at the table and be surrounded by medieval buildings! Be aware that the entrance is rather hidden. you might think it's closed. Don't be fooled. Keep going until you see steps going down into a courtyard -- for some reason, the entrance is there.", "publishedDate": "2017-07-27", "language": "en", "rating": 5}, {"id": 502632228, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d244199-r502632228-Frederic_Mares_Museum_Museu_Frederic_Mares-Barcelona_Catalonia.html", "text": "I have never seen such sheer volume of art objects of one type lined up row after row for comparison and contrast. I am of two minds about this.\n\nAs a lover of Medieval and Renaissance art, the museum offered a chance for me to view scores of Madonna and Child wood polychrome sculptures side by side, an opportunity never afforded by the great museums of the world. From seeing many, the unique and precious objects emerge in a new light.\n\nAt the same time, having read that at the turn of the century art traffickers were plundering small country churches for their art objects, I fear that the collections in this museum represent the market that made those thefts profitable. So perhaps here the art lover and the art collector part ways.\n\nRather like a zoo functions for the animal lover, this museum gives us a chance to view what we love and to fear how it was acquired.  Some reassurances about provenance in written materials would help.", "publishedDate": "2017-07-16", "language": "en", "rating": 5}, {"id": 501366088, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d244199-r501366088-Frederic_Mares_Museum_Museu_Frederic_Mares-Barcelona_Catalonia.html", "text": "As other reviewers have said, this museum is a quiet little gem. Filled with statuary from Roman and medieval times, loads of religious icons and then, on the second floor, more collections than I have ever seen in my life. Old photographs, old stamps, eyeglasses, hair combs. The man who set up this museum was an inveterate observer of life!! The building itself is beautiful and the staff are very welcoming.\nI was enchanted by all of the old monastic statues and paintings but my husband started going through it more quickly. And he didn't go up to the Collections floor, feeling that he had seen enough. I don't think children would find it that interesting after awhile--there is just so much there!!", "publishedDate": "2017-07-12", "language": "en", "rating": 4}, {"id": 497258153, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d244199-r497258153-Frederic_Mares_Museum_Museu_Frederic_Mares-Barcelona_Catalonia.html", "text": "I first visited many years before it was publicised on the BBC and hope it is not just visited as a trendy place to go.  The collections are superb and to be lingered over and relished.  Mares was a superb collector - although you might question the number of religious statues and carvings and quite how he acquired them, they are phenomenal.  Later collections of ephemera, fans, cameras, miniature portraits are awe inspiring.  Each time you visit this museum surprises and enchants - it is one of my favourites ever.", "publishedDate": "2017-06-29", "language": "en", "rating": 5}, {"id": 495883629, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d244199-r495883629-Frederic_Mares_Museum_Museu_Frederic_Mares-Barcelona_Catalonia.html", "text": "Is a huge collection of anything you can think about, that's not only a good thing but also a problem. It gets boring after a while, although the last rooms are the better one. ", "publishedDate": "2017-06-25", "language": "en", "rating": 3}, {"id": 495213906, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d244199-r495213906-Frederic_Mares_Museum_Museu_Frederic_Mares-Barcelona_Catalonia.html", "text": "We enjoyed the walk their with different collections as for Sunday afternoon it's free entry. All the collections blew out mind off and we enjoyed no crash, no rush and not many people. Worth a visit.", "publishedDate": "2017-06-22", "language": "en", "rating": 4}, {"id": 489002652, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d244199-r489002652-Frederic_Mares_Museum_Museu_Frederic_Mares-Barcelona_Catalonia.html", "text": "Like a few Brits, I only knew about this place from a recent programme on BBC about Barcelona's hidden treasures. I was still one of the only tourists there; the staff were in the majority. \n\nIt is 4 Euro to get in and trust me this is money well spent for what you get to see.\n\nBasically Snr Mares was a wealthy collector who paid poor local churches throughout Europe to take their carved statues of religious art etc. Many of these are 1000s of years old, but are still in fantastic condition. This alone is worth seeing, as it helps you to picture life in rural Spain and Italy and the influence of the Church.\n\nSnr Mares also collected lots of stuff from his own era; toys, fans, photos, guns... This helps to picture life in Barcelona around the turn of the 20th Century...i.e. the Modernista / Gaudi's era. The photos are great; seeing Barcelona as it was then.\n\nYou are able to take as many pictures as you like, as long as you don't use a flash. You will take lots.\n\nVery conveniently located in Barri Gotic for the La Catedral etc, or before / after having a drink / meal in the area before you head off to the beach or shops.", "publishedDate": "2017-05-30", "language": "en", "rating": 5}, {"id": 488654809, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d244199-r488654809-Frederic_Mares_Museum_Museu_Frederic_Mares-Barcelona_Catalonia.html", "text": "Couple, 50+. Considering all these items, statues, reliefs, paintings etc were all collected by one man, there are a staggering number of exhibits. A quieter than usual museum it's worth a visit if you have done the other major attractions. However, there are a lot of very similar exhibits so it's more about quantity than variety.Unlike many museums, the majority of exhibits here are not protected by glass casings, so it does feel more intimate. Audio guides are essential.", "publishedDate": "2017-05-29", "language": "en", "rating": 3}, {"id": 482149840, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d244199-r482149840-Frederic_Mares_Museum_Museu_Frederic_Mares-Barcelona_Catalonia.html", "text": "What a delight this museum is! Tucked away beside the old cathedral, it's very easy to miss. As you enter, it's a bit 'museum-y' with a series of Roman artefacts followed by medaeival  stuff as you venture ever upward. Your real treat however is yet to come. As you ascend, you are bombarded (and I use the term advisedly) by a collection of antiquities and curios on a quite honestly industrial and baffling scale. This man collected anything/everything! Coins? Medals? Firearms? Edged weapons? Tinplate toys? Old Dinky toys? Victorian cardboard theatres for kids? Mid 1900's cigarette cards? And SO much more! During the latter stages of your visit, you will constantly be calling your significant other over to say, perhaps boringly to them ' I had one of those!' A place of joy! Refreshments available in a lovely little courtyard café. Enjoy!", "publishedDate": "2017-05-06", "language": "en", "rating": 5}, {"id": 481343049, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d244199-r481343049-Frederic_Mares_Museum_Museu_Frederic_Mares-Barcelona_Catalonia.html", "text": "This museum is a must-see if you are interested in medieval art - it is located in an old Royal Palace, next to the cathedral. There are beautiful sculptures and also a collector's cabinet.      ", "publishedDate": "2017-05-03", "language": "en", "rating": 5}, {"id": 481058791, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d244199-r481058791-Frederic_Mares_Museum_Museu_Frederic_Mares-Barcelona_Catalonia.html", "text": "We stumbled on this museum, and probably would not have dropped in but for the late afternoon with a couple of hours to kill before wine and tapas -- and that it was free with the Barcelona pass (normally 12 euros apiece).  What a find!  It is one of the best museums that we have enjoyed in the dozen European countries and multiple other countries that we have visited throughout the world.  We rate it 19.0 out of a possible 20.0 points on the ErinFADS scale, as follows:\nFOOD: 5.0/5.0.  This item is irrelevant, and we do not penalize accordingly.\nATMOSPHERE: 4.5/5.0.  Perhaps it was just the surprise of finding such a gem so unexpectedly.  But, this eclectic collection of sculpture, paintings and wrought iron tools dating back from 400 B.C. to the 19th century, and of Baroque and 19th century era  fans, pipes, bicycles and phonographs, is rich at so many levels.  There are over 300 women's fans on display, complete with interesting stories of intrigue and fame.  There are another 300+ smoking pipes from all over the world, some for opium, many of which are intricately crafted sculptures in their own right.  There are numerous early Christian sculptures that Frederic Mares was able to preserve including statuary, crucifixes, sarcophagi, etc.  Get  the audio guide and plan on two to three hours to do justice to the place.  If time is tight, skip through the ground floor and head to the second floor (the third level) for the best part of this museum.  That being said, the basement floor is worth the brief diversion.\nDRINKS: 5.0/5.0.  Again, we do not penalize for irrelevant categories.  There is no drinking here.\nSERVICE: 4.5/5.0.  The staff is great!  They all were extremely attentive and helpful.  Indeed, since there were only a handful of patrons in the museum when we were there, we received a lot of personal attention -- but never intrusively so.  Further, although our Spanish was limited, communication was not a problem; the audio guides were available in English, the exhibits for the most part included English descriptives, and many of the staff spoke fluent English.\n\nThe bottom line is that this museum is a pleasant diversion from all of the Gaudi that understandably permeates this beautiful city.", "publishedDate": "2017-05-02", "language": "en", "rating": 5}, {"id": 479706829, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d244199-r479706829-Frederic_Mares_Museum_Museu_Frederic_Mares-Barcelona_Catalonia.html", "text": "Located to the left of the front of Barcelona Cathedral this is a stunning museum. Mares was a sculptor and collector, a magpie like Soanes in London. \nThe top two floors contain his collections of toys, dolls, cameras, fans, tiaras, guns, swords, etc, etc. Fascinating stuff and something for everyone. My favourites here were the pipes. \nThe lower two floors contain some beautiful medieval sculptures, mainly religious in nature. \n", "publishedDate": "2017-04-28", "language": "en", "rating": 5}, {"id": 479452918, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d244199-r479452918-Frederic_Mares_Museum_Museu_Frederic_Mares-Barcelona_Catalonia.html", "text": "If you buy a Barcelona Card entry to this is free. We bought one on arrival in the city and used it extensively for travel & attraction entry.\nThe museum is right next to Barcelona Cathedral (which is NOT the Sagrada Familia!) in the Gothic Quarter. The building itself is worth a visit, as it is a lovely old palace. The audio guide (1 euro) is very worthwhiile, and talks you round the numerous collections. The big stuff (from churches and other monuments) is downstairs and is amazing, and then the collections get more quirky on higher floors, so make sure you head on upstairs. We loved the place and stayed much longer than we planned. There is a nice little cafe in the courtyard as well.", "publishedDate": "2017-04-27", "language": "en", "rating": 5}, {"id": 475886995, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d244199-r475886995-Frederic_Mares_Museum_Museu_Frederic_Mares-Barcelona_Catalonia.html", "text": "Brilliant! It's such a shame that there were hardly any visitors in this museum when we went there on one of the busiest days of the year. Frédéric Mares is an embodiment of an obsessive collector who had been collecting absolutely everything. We totally enjoyed our visit. ", "publishedDate": "2017-04-15", "language": "en", "rating": 5}, {"id": 472914116, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d244199-r472914116-Frederic_Mares_Museum_Museu_Frederic_Mares-Barcelona_Catalonia.html", "text": "The first two floors are packed with religious sculpture. Check out the ones the audio guide describes. There are literally hundreds of pieces of sculpture, many of the same subject. Most of the others you can take a glance at and move on. For me the highlight was the last floor where many pieces of Frederic Mares sculpture are displayed. There are also extensive collections of all kinds - women's fans, pipes, shell sculptures. ", "publishedDate": "2017-04-05", "language": "en", "rating": 4}, {"id": 468466546, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d244199-r468466546-Frederic_Mares_Museum_Museu_Frederic_Mares-Barcelona_Catalonia.html", "text": "After seeing nearly 20 countries, and visiting museums in all those countries, this is probably the most terrible museum I have ever, ever been to. We went on the day it was free, and I feel bad that I will never be able to get this time back. This man clearly had more taste than money. This museum has morbid paintings, ugly sculptures, a billion crucifixes, and so much more. If you want to see the over-the-top side of Christianity and Catholicism, then go. But going through this museum was painful. Do not even bother going. There are so many better things to see in Barcelona.", "publishedDate": "2017-03-19", "language": "en", "rating": 1}, {"id": 468342396, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d244199-r468342396-Frederic_Mares_Museum_Museu_Frederic_Mares-Barcelona_Catalonia.html", "text": "We had never seen so many things in so many cases anywhere before.  This man was an avid collector of many things, but definitely had a thing for religion too.  We spent many hours there peering into glass cases. There is a fascinating collection of crucifixes on the ground floor.  It was very quiet when we were there with more staff than visitors.  The court yard with a little cafe is a calm, cool and peaceful place to take a break from the masses gathered round the cathedral. A hidden gem.", "publishedDate": "2017-03-18", "language": "en", "rating": 5}, {"id": 463674097, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d244199-r463674097-Frederic_Mares_Museum_Museu_Frederic_Mares-Barcelona_Catalonia.html", "text": "A totally bonkers (in a good way) collection of religious carvings, sculptures, fob watches, religious symbols, paintings, lace fans, cigarette cases & cards, snuff boxes, church masonry, furniture, toys, keys, ironmongery, weapons, armour.........\nA fantastic museum chock full of stuff housed in many rooms.\nTo be honest it can be quite overwhelming but this museum is a must see when in Barcelona. It reminded me of the Pitt-Rivers museum (Oxford UK) and the Russell-Cotes Museum (Bournemouth UK) but on a larger scale.\nBe prepared to spend a good few hours marvelling in wonder at the collection, you can always take a break in the shady courtyard if needed.\nAn intimate and wonderful place.", "publishedDate": "2017-03-01", "language": "en", "rating": 5}, {"id": 461503432, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d244199-r461503432-Frederic_Mares_Museum_Museu_Frederic_Mares-Barcelona_Catalonia.html", "text": "Like many Barcelona museums this one is free on the First Sunday of the month and on Sundays after 3pm.  The museum is located in the heart of the Gothic quarter, the gardens and buildings are beautiful and you should always look out windows.  There is a small room of Roman sculpture, then many, many rooms of religious sculpture.  Make sure to visit the basement section, which has a complete stone church entrance.  On the upper floors is a diverse collection of everyday objects such as smoking pipes, cigar bands, and hand held fans.  Don't miss the visit to the Library with an extensive display of more modern sculpture and art.  The official itinerary has you visit the many rooms of religious art before getting to the library and everyday objects.  It might make sense to do the religious sculpture last.", "publishedDate": "2017-02-20", "language": "en", "rating": 4}, {"id": 461257106, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d244199-r461257106-Frederic_Mares_Museum_Museu_Frederic_Mares-Barcelona_Catalonia.html", "text": "In this musuem, the are interesting collection of everything from furniture to small objects like fans and toys and it is more like a mansion rather than a museum, really intriguing. Central location at the Gothic Quarter near Cathedral and you can spend a day there if you look at each of them carefully.\nHighly recommended for those who love to collect whatever kind of objects.", "publishedDate": "2017-02-19", "language": "en", "rating": 5}, {"id": 458240081, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d244199-r458240081-Frederic_Mares_Museum_Museu_Frederic_Mares-Barcelona_Catalonia.html", "text": "No doubt one of the greatest museums I have seen. The lack of sterile, typical museum atmosphere is what makes this place so special. You almost feel that you are in a grandma's attic. And it has a beautiful yard in front, great way to escape Barcelona's tourist crowd.", "publishedDate": "2017-02-09", "language": "en", "rating": 5}, {"id": 453822695, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d244199-r453822695-Frederic_Mares_Museum_Museu_Frederic_Mares-Barcelona_Catalonia.html", "text": "The Mares Museum, located next to the Cathedral and part of the Royal Palace complex, includes three distinct collections.  The basement and first two floors feature mostly religious sculpture from the 5th century B.C.E. through the 19th century.  The “Collector’s Cabinet” on the second (and a small part of the third) floor is densely packed with tens of thousands of daily objects.  The second floor also contains a “library-study” dedicated to the sculptures of Frederic Mares himself.  According to the wall text, the building has a checkered past – it was, for a time, the seat of the Inquisition in Barcelona.\n\nIf you are into the history of sculptural depictions of the Virgin and Child, Christ on the Cross, and Calvary, the first two floors of this museum are for you.  The floors include row after row of similar Virgins with similar Children, and countless walls filled with larger than life crucified Christs – in a variety of styles.  If you are an aficionado and can distinguish among the often very subtle differences, you will love this part of the museum. If not, you will be awed by the volume and moved by some of the images, but ultimately, may glaze over.  But even for the glassy-eyed, there are numerous noteworthy pieces that stand out and make a visit worthwhile – the relief by the Master of Cabestany of Christ standing on the sea before two disciples in a boat, with roiling water and stylized fish below; the arresting painting of Jesus on the Road to Calvary by 15th century Catalan master Jaume Hugeut; a tiny collection of hundreds of miniature bronze figures; and more.   In addition, the basement is focused on stone sculpture and includes, among other things, an intact portal/façade of a 13th century church.\n\nThe second floor, the so-called “Collector’s Cabinet” is extraordinary, with rooms dedicated to various activities, each containing hundreds, if not thousands, of objects reflecting daily life, often from the 1800s and early 1900s, but in places, earlier.  For example, the room focused on women’s fashion, includes hundreds of fans in addition to other objects.  The “Weapons Hall” includes centuries-old armor, swords, guns and cross-bows.  The “Smoker’s Hall” includes thousands of 19th century artifacts related to all forms of tobacco use, including racy matchbook covers and elaborately carved pipes.  The collection of wrought iron is also remarkable, as is the collection of tin soldiers.\n\nThe Mares study includes numerous fine examples of sculpture by Mares himself, and is worth the price of admission.  Finally, don’t miss a small room on the second floor called the “Scenic Overlook,” which includes a high window into the Salo de Tinell, the monumental gothic hall, which is part of the Museum of the History of Barcelona.  The view from above is worth seeing.\n\nOn balance, the Mares Museum may not crack my top-10 list of sites in Barcelona, but it is a unique and fascinating place that deserves a visit if you can find the time.  My suggestion would be to start on with the Collector’s Cabinet and Mares Study, and work down.  The entry fee is very reasonable (4.20 Euros for a regular admission that allows you to return), plus a 1 Euro charge for the informative, and arguably essential, audioguide.", "publishedDate": "2017-01-21", "language": "en", "rating": 5}, {"id": 440770708, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d244199-r440770708-Frederic_Mares_Museum_Museu_Frederic_Mares-Barcelona_Catalonia.html", "text": "This wonderful museum has it all-religious statuary-a knight's tomb, Roman relics Frederic Mares' personal sculptures, fans, walking sticks, postcards, sewing machines etc. What a fabulous eclectic mix spread over 3 floors of this former Royal palace. It is easy to find-take the small alley/street at the left of the cathedral and it is right there alongside the cathedral, For a very modest entry fee you will spend a very happy couple of hours.", "publishedDate": "2016-11-28", "language": "en", "rating": 5}, {"id": 430341118, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d244199-r430341118-Frederic_Mares_Museum_Museu_Frederic_Mares-Barcelona_Catalonia.html", "text": "We didn't take an audio guide and there were no other english explanations.. Except of that its a big museum with tons of stuff and you can easily spend there like hour and a half", "publishedDate": "2016-10-21", "language": "en", "rating": 3}, {"id": 428307426, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d244199-r428307426-Frederic_Mares_Museum_Museu_Frederic_Mares-Barcelona_Catalonia.html", "text": "In the shadow of the Cathedral, in a medieval building, there is an astonishing collection of statues, full pieces of churches, marble columns from ancient ages till 20th century.. and every possibile collection of objects.. more than a museum.. an experience to try!", "publishedDate": "2016-10-15", "language": "en", "rating": 5}, {"id": 423870674, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d244199-r423870674-Frederic_Mares_Museum_Museu_Frederic_Mares-Barcelona_Catalonia.html", "text": "Housed in a section of the former Royal palace this is the personal collection of a sculptor.  Unsurprisingly most of the objects are statues.  It starts off with some pre-Roman Iberian objects. \n\nThere are a number of good quality Roman stone sculptures and smaller bronze objects.\n\nThe bulk of the collection are Romanesque and Gothic sculptures with some architectural elements.  As these are generally religious artefacts a number of tyes are repeated, such as Madonna and Child or crucifixions. \n\nIn the basement are a number of architectural elements such as doors, carvings and tombs some of them of very good quality.  The best objects in the collection are on the ground and lower ground floors.  \n\nThe next floors up have sculptures and some paintings from later centuries.  Some of these are good but as Barcelona was not a major artistic centre for the Baroque, etc. they are not of the highest quality that can be seen elsewhere.  The very top floors contain a mish mash of various other objects that he collected such as pipes and walking sticks.  This does give the museum the air of a junk shop.  The lower floors give a better impression of the collection.\n\nEntrance is included with the cost of a Barcelona card.", "publishedDate": "2016-09-30", "language": "en", "rating": 3}, {"id": 420594434, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d244199-r420594434-Frederic_Mares_Museum_Museu_Frederic_Mares-Barcelona_Catalonia.html", "text": "...okay I've not done all of them but this rates very highly. Just as labyrinthine and fascinating as the streets of Barri Gotic outside. The contents of this cabinet if curiosites (which is what the top two floors comprise) are like the imaginings of Borges or Eco. Automata and model theatres, playing cards, reliquary boxes, ladies fans, 18th century collages (so Picasso didn't invent them), icons, romanesque capitals, wax dioramas, keys and locks and lots of other things I have forgotten about. This was my third visit and I keep making discoveries. Very good display and curation, these kind of collections are often fusty with shrivelled labels but not in this case. The works are presented with great care and genuine pride in the collection. I quite like starting at the top and working down, but this does confuse the invigilators who are well trained in welcoming and beckoning you around.", "publishedDate": "2016-09-20", "language": "en", "rating": 5}, {"id": 419171009, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d244199-r419171009-Frederic_Mares_Museum_Museu_Frederic_Mares-Barcelona_Catalonia.html", "text": "This little gem of a museum can easily get lost in the plethora of other \"major\" places to visit in Barcelona, but it is worth some time - if only to view the Roman sculptures and the small collection of paintings. Yes, the main theme is religious and it can seem a bit overwhelming, but the one euro cost of the audio guide is money well spent. The guide briefly and carefully explains the importance of the items that are highlighted. The rest can be seen casually during the walk through the museum. The \"collection\" itself I found to be the least interesting. How many fans and scissors and items of everyday use can one person truly appreciate? But it was quite an undertaking by Mares and his contribution to the culture of Barcelona is unique. (Be sure to take a coffee or glass of cava at the small cafe in the museum's courtyard.)", "publishedDate": "2016-09-16", "language": "en", "rating": 4}, {"id": 412894317, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d244199-r412894317-Frederic_Mares_Museum_Museu_Frederic_Mares-Barcelona_Catalonia.html", "text": "Although I didn't have a problem with the religious statuary in Milan, for some reason the statues in this museum terrified me a little bit. Maybe it was the closeness of the museums, maybe with was the number of Jesus(es) on a crucifix, maybe it was that the paint had chipped out of most of their eyes and they looked at me with hollow, wooden stares. Anyway, the point is, when people say to \"surround yourself with Jesus,\" I don't think this is what they meant.", "publishedDate": "2016-08-30", "language": "en", "rating": 2}, {"id": 372903105, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d244199-r372903105-Frederic_Mares_Museum_Museu_Frederic_Mares-Barcelona_Catalonia.html", "text": "Then my goodness this is the place for you.  If not, best avoid!  I have never seen so many crucifixes in one place...and I've toured the heck out of Rome.  The ground floor is approx 17 rooms where every wall is lined with crucifixes and then there are seated statues of Christ and his family in varying sizes.  Asmy friend and I were the only 2 visitors in the place, I did start to worry if the statues were previous visitors, it had that sort of teenage horror movie vibe to it.  Staff hovered in an annoying way - probably due to the scarcity of visitors although it was thanks to one that we made it to the basement where there was some stone arches, statues and sarcophogi that we admired.  First floor also very heavy on christian religion, we didn't make it up to the 2nd and made our escape.  Cafe in the courtyard is ok - surroundings pleasant but service very slow.  Not a highlight of the trip - enjoyed the historical museum with Roman ruins next door far more.", "publishedDate": "2016-05-14", "language": "en", "rating": 2}, {"id": 369493410, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d244199-r369493410-Frederic_Mares_Museum_Museu_Frederic_Mares-Barcelona_Catalonia.html", "text": "The most amazing collection of Catalan history from across the ages! From metalwork, to sculpture, to clothing...it was all Terrific!! ", "publishedDate": "2016-05-02", "language": "en", "rating": 5}, {"id": 366979138, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d244199-r366979138-Frederic_Mares_Museum_Museu_Frederic_Mares-Barcelona_Catalonia.html", "text": "It's hard to meet tourist there, that's for sure - during our 4 hours long exploring, we've met 5 people.\nPart of the museum where are placed exemples of catalonia's sacral art is interesting to see - looking at the amount of artifacts, and how valuable they were for Spanish people is interesting.\nIn the same building you can find \"collection of collections\". It's not language mistake like I thought. Mares spend fortune collecting EVERYTHING - fans, matchboxes, pictures, pipes, spoons, walking sticks and other. \nI think that museum's keeper don't even try to describe all of this - they just put simillar objects next to each other and let people think what they want :)", "publishedDate": "2016-04-24", "language": "en", "rating": 5}, {"id": 364157367, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d244199-r364157367-Frederic_Mares_Museum_Museu_Frederic_Mares-Barcelona_Catalonia.html", "text": "This is a fascinating museum for sure. No one could argue that it doesn't have a plethora of items of importance displayed. But the way they are organized may feel a bit overwhelming. In the audio guide they rightfully claim 2 museums in one but with so much content shared between the two it's hard to muster the energy the 2nd part deserves.\n\nThe first two floors are great for historically relevant religious iconography. It's a little dull for children and the ones like myself looking for odd collections from the last two centuries. I would advise the visitor to not feel guilty skipping either museums. I wish I had skipped the first one to spend more time in the wacky and beautifully displayed curios on the top two floors (3 and 4). The price is right at 5.5 euros and that's with the audio guide, a must...,especially for the curio collection.", "publishedDate": "2016-04-14", "language": "en", "rating": 4}, {"id": 358474634, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d244199-r358474634-Frederic_Mares_Museum_Museu_Frederic_Mares-Barcelona_Catalonia.html", "text": "We spent hours touring the three floors and were amazed at the extent of the collection, including 5th C Coptic altar cloth fragments.", "publishedDate": "2016-03-25", "language": "en", "rating": 5}, {"id": 354787677, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d244199-r354787677-Frederic_Mares_Museum_Museu_Frederic_Mares-Barcelona_Catalonia.html", "text": "If you happen to collect something that Frederic Mares hoarded/collected, then I'm sure you will find the most interesting example of ....whatever....in this museum.  I don't know how one human has enough time in a single life to acquire all the items in this museum.  \n\nA room of keys, a room of toy soldiers, a case of women's purses......\n\nAs previously mentioned in numerous reviews - lots of religious art-especially crucifixes.  Like A LOT.  \n\nBut - easy to find, not expensive , possibly not for everyone.", "publishedDate": "2016-03-12", "language": "en", "rating": 4}, {"id": 354621806, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d244199-r354621806-Frederic_Mares_Museum_Museu_Frederic_Mares-Barcelona_Catalonia.html", "text": "From Roman friezes to a room full of keys this museum is a stern reminder of why we shouldn't hoard!   And yet it is quite engrossing the sheer beauty and skill of the craftsmanship on display.  For lovers of art and aesthetics this was a library of delights.  We were fascinated.", "publishedDate": "2016-03-11", "language": "en", "rating": 5}, {"id": 346746754, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d244199-r346746754-Frederic_Mares_Museum_Museu_Frederic_Mares-Barcelona_Catalonia.html", "text": "If you like fans,dolls,cards,old collections of almost anything you can think of this is the place for you.A historical wealth of what people haved loved over centuries all under one roof on three floors.Some areas dimly lit to protect the items.", "publishedDate": "2016-02-10", "language": "en", "rating": 5}, {"id": 344761107, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d244199-r344761107-Frederic_Mares_Museum_Museu_Frederic_Mares-Barcelona_Catalonia.html", "text": "I've been to Barcelona maybe 6 times and seen all the big tourist things and this is by far my favourite thing to do there. Beautiful building bang in the centre of Gothic quarter with a delightful serene courtyard outside to sit in dappled sun under orange trees. Think its about €6 or 8 entry but pretty sure you can use this ticket twice which is really handy considering the sheer volume of fascinating stuff in here. Ground and lower floor are filled with religious artefacts, mainly crucifixes, not really my cup of tea but interesting to see the variety. Higher floors truly amazing. Pretty much anything you can think of that is collectible (and quite a lot you wouldn't think of) this guy has absolutely loads of them. Some of my favourites are the pipes, walking sticks and keys, yes an entire room just full of keys, sounds rubbish but its ace. Some of the more unusual things include pictures made out of hair, shell sculptures in bell jars, bed warmers etc etc etc. Set aside a good few hours. Absolutely cracking museum.", "publishedDate": "2016-02-03", "language": "en", "rating": 5}, {"id": 337812484, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d244199-r337812484-Frederic_Mares_Museum_Museu_Frederic_Mares-Barcelona_Catalonia.html", "text": "The amount of different artifacts collected by this one man was simply astounding!  I really enjoyed touring this museum and for Barcelona, the cost was relatively cheap.  Only 4.5 euro's and takes about 2 hours to go through.  His mix of historical artifacts will astound you.  I was so impressed with this collection that l purchased his book which cost me 20 euro's.  Amazing collection.  Worth the cost of the entrance fee, by far.  Also, the Basilica is right next door (cost 7.5 euro's) and that was truly amazing as well.  Lots of restaurants surround these 2 attractions which are in the heart of the Gothic area.  Both, truly fascinating.", "publishedDate": "2016-01-06", "language": "en", "rating": 5}, {"id": 337277413, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d244199-r337277413-Frederic_Mares_Museum_Museu_Frederic_Mares-Barcelona_Catalonia.html", "text": "Mares started collecting medieval artifacts from Spanish churches to save them from illegal art collectors. This was a fascinating place and I only wish I had more time to look at everything. I loved the iconic church sculptures from 10 - 16 century and earlier. They are stunning. The Roman sculptures, again, are amazing. He collected a lot of stuff. It's amazing to see all the artifacts from the 19 century upstairs. Very cool displays on everyday household items and apparel. I want to spend more time here.  Free the first Sunday of the month.", "publishedDate": "2016-01-04", "language": "en", "rating": 5}, {"id": 337031069, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d244199-r337031069-Frederic_Mares_Museum_Museu_Frederic_Mares-Barcelona_Catalonia.html", "text": "This museum will unwind your imagination and fantasies. Medival collections are presented by original way. Different from other standard boring museums.", "publishedDate": "2016-01-03", "language": "en", "rating": 5}, {"id": 332300689, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d244199-r332300689-Frederic_Mares_Museum_Museu_Frederic_Mares-Barcelona_Catalonia.html", "text": "I have visited hundreds of museums around the world.  I have mixed emotions about this one.  It really depends on what you like.  If you are into Baroque, Medieval, Renaissance or ancient sculpture, this is he place for you.  I have never seen so many crucifix sculptures anywhere.  I found the bottom -1 floor especially interesting.  Many stone treasures from ancient Roman times saved.  However, the Collector's Cabinet collections on floor 2 made me want to go screaming out of the building.  100+ pocket watches, 75+ canes, 50+ women's fans, 100+ tintype photograph portraits, etc, etc.  And not one thing labeled.  Of course, labels would just add to the chaos.  Definitely a time for \"less is more\"!  So, if you want to expand your knowledge, maybe on things you might not have previously had an interest in, give this museum a try.  But if you are looking for paintings and like Modern, Impressionist, etc art, best to look elsewhere.  Regardless, you have to wonder what possessed this man to collect all this stuff.", "publishedDate": "2015-12-12", "language": "en", "rating": 4}, {"id": 329616473, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d244199-r329616473-Frederic_Mares_Museum_Museu_Frederic_Mares-Barcelona_Catalonia.html", "text": "As you go through the museum, you'll find yourself wondering about the collector as much as about the items in the collection. Mares didn't believe in half-hearted collecting, getting one representative object for the collection, or in having just one or two specialties.This museum holds not just one of the biggest collections in the world of polychrome wooden religious sculptures from the Gothic period, a fine collection of religious art from other periods, and a fair number of antiquities. There aren't any famous artists represented here, and some of the works are rather crude, suggesting that Mares was interested in quantity as much as in quality.\n\nIt also holds an utterly fascinating collection of ephemera from the 18th through early 20th century, with an emphasis on the 19th century. Was Mares obsessive? Or was he astute? Or both?\n\nImagine collecting about 300 pipes, several hundred early photographs, dozens of apothecary jars, hundreds of ladies' fans, thousands of cigarette cards, erotic match boxes, thousands of decorative designs, hundreds of holy water fonts, and hundreds of iron keys. Most of these belonged to middle-class families or churches, rather than wealthy ones, and some items, like cigarette cards, were available even to poor families. Mares knew that these kinds of items are full of valuable insights into a culture and I'm sure that design and cultural scholars everywhere bless him for collecting and preserving the kinds of things that usually got thrown away when no longer in use.\n\nIf I were a set or costume designer for 19th century period dramas, I'd probably just move in.  \n\nEntrance is relatively cheap compared to other Barcelona museums, 4.20 euros in November, 2015.", "publishedDate": "2015-11-28", "language": "en", "rating": 5}, {"id": 324359488, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d244199-r324359488-Frederic_Mares_Museum_Museu_Frederic_Mares-Barcelona_Catalonia.html", "text": "A museum filled with an array of different objects, located a 5 min walk from Jaume I metro station. \n\nThe ground floor is mainly religious (christian) sculptures, and in particular crucifixes dating from the 13th / 14th century. The basement has stonework, including a huge doorway on display, and the upper floors house various collections of stamps, cigarette cards, old money, walking sticks, opera glasses, toys, camera's, sculpture - it is almost overwhelming, but incredibly fun. \n\nOutside there is a nice courtyard, with a cafe which is free to wander around without going into the museum. \n\nThere was a small lift (suitable for a standard size wheelchair) which allowed access to most (if not all of the museum)\n\nWe visited on the first sunday of the month, and so got free entry", "publishedDate": "2015-11-04", "language": "en", "rating": 4}, {"id": 323631954, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d244199-r323631954-Frederic_Mares_Museum_Museu_Frederic_Mares-Barcelona_Catalonia.html", "text": "I have bn to hundreds of museums around the world....and there was something about this one that was very special.  Special in part, because the was so surprising.  Mr Marès was a sculptor in the 20th century.  He said that he was a sculptor so he could earn money and buy other sculptures.  Well, not only did his vast collection include sculptures, but hundreds of keys, cameras, crucifixes, madonnas, fans, cigar labels, matchboxes and other items with no connection to one another.  You never knew what the next room would hold, but once you entered, the words \"WOW\" or \"OMG\" sprang from your lips.  We moved around the museum almost in a daze, marveling at the vast numbers of items and the variety of his collections.  Thank you Mr. Marès, you have brought smiles, wonder and joy to us as we lingered in the rooms of the museum with your name..  I'll confess that we went on. Sunday afternoon, after 3 pm when it was free, but next time I will go gladly and pay the entry fee....it is sooooo worth it.", "publishedDate": "2015-11-01", "language": "en", "rating": 5}, {"id": 323207219, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d244199-r323207219-Frederic_Mares_Museum_Museu_Frederic_Mares-Barcelona_Catalonia.html", "text": "Very, very interesting museums that tracks humanity's fascination with knick-nacks and trinkets. Nice collection of religious objects and few interesting antiques. The real fun part is the collectors room at the top of the museum, tho entire museum is giving away awesome photo opportunities at every step. Frederic was quite a hoarder in his time. I enjoyed it a lot. Do not expect Mones, Manes and Picassos - this  is all about every day items Catalans used throughout history - which is extremely cute in its un-pretentiousness. Admission is reasonable. Museums courtyard is a must see gem.", "publishedDate": "2015-10-30", "language": "en", "rating": 4}, {"id": 320760163, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d244199-r320760163-Frederic_Mares_Museum_Museu_Frederic_Mares-Barcelona_Catalonia.html", "text": "We loved it. It has everything from sculptures,paintings, kicknacks,armory,scissors,cameras,lighters,pottery,dolls i mean every thing. The man himself lived alsmost 100years,so he collected most impressive collection i have ever seen", "publishedDate": "2015-10-21", "language": "en", "rating": 5}, {"id": 320304340, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d244199-r320304340-Frederic_Mares_Museum_Museu_Frederic_Mares-Barcelona_Catalonia.html", "text": "Located by the cathedral, open on Sundays, and worth strolling around this quiet museum for a couple of hours. Eclectic mix of the owners collection, in a lovely home.", "publishedDate": "2015-10-20", "language": "en", "rating": 5}, {"id": 317367120, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d244199-r317367120-Frederic_Mares_Museum_Museu_Frederic_Mares-Barcelona_Catalonia.html", "text": "He was a sculptor and he started collecting religious statutes from the early days of Christianity in the northern part of Spain. The Romanesque period and the Gothic period is the time frame of most of the religious statutes he collected. The collection is overwhelming but then you move in to other things he collected and you are truly blown away buy the objects and curiosities he collected. It is hard to describe because there is so much there to see. The ticket gives you the opportunity to visit again within 30 days and it is great tat they do that because if you do it in one visit you have sensory overload. What a treasure this place is.", "publishedDate": "2015-10-09", "language": "en", "rating": 5}, {"id": 316116719, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d244199-r316116719-Frederic_Mares_Museum_Museu_Frederic_Mares-Barcelona_Catalonia.html", "text": "If only a fraction of the folks who stream through Gaudi;s cathedral would stop here, they would be richly rewarded.  This is a lovely small-scale museum that is \"do-able\" in an hour or two, depending on your interests.  On the one hand, you have sculptor Mares' various collections on display--fans, scissors,  pipes, sea shells, toys. It's a giant curio cabinet. On the other hand,  there are two floors of his own sculpture and older works of art that he collected. .So, really, two museums in one.  Bypassed by most tourists, the museum is yours for the browsing and includes a restful courtyard, too.", "publishedDate": "2015-10-04", "language": "en", "rating": 5}, {"id": 315248778, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d244199-r315248778-Frederic_Mares_Museum_Museu_Frederic_Mares-Barcelona_Catalonia.html", "text": "The entrance is a bit tucked away, but when you find it, you'll enter an attractive courtyard that has an outdoor café where the prices are quite reasonable, €2.50 for a draft beer. This is one of the best places for refreshment in the Barrio Gotico. It's a little oasis of calm in the middle of the crowds. Sit down at a table and they'll come get your order. They don't take credit cards. I'd highly recommend it. I live in the city and stop in here frequently.\n\nThe museum houses the collections of Frederic Marès, who was basically a hoarder of all kinds of things. It's certainly an unusual museum, and I think it's kind of interesting. The building it's in is beautiful. If you have lots of time in Barcelona you might visit, but it isn't a must-see.", "publishedDate": "2015-09-30", "language": "en", "rating": 5}, {"id": 315088146, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d244199-r315088146-Frederic_Mares_Museum_Museu_Frederic_Mares-Barcelona_Catalonia.html", "text": "This is a beautiful museum in an old former renovated palace.  I read on one web site this building also had a role in the Inquisition.  The collection is vast.  The higher the floor, the more elaborate and quickly the collection.  Just because the things are different they are worthwhile to see.", "publishedDate": "2015-09-30", "language": "en", "rating": 5}, {"id": 313427882, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d244199-r313427882-Frederic_Mares_Museum_Museu_Frederic_Mares-Barcelona_Catalonia.html", "text": "Federico Mares collected art and artifacts that reveal a part of Spains history not seen in every museum. The museum was not very crowded and it was really fun to explore not only the art but his collections of odd objects such as colbs, fans, scissors, tin boxes, hand mirrors, door knobs, keys, and many more interesting objects. ", "publishedDate": "2015-09-24", "language": "en", "rating": 5}]}}]