[{"locationId": 8820333, "name": "Primavera Sound Barcelona", "placeType": "ATTRACTION", "reviewListPage": {"reviews": [{"id": 676494660, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d8820333-r676494660-Primavera_Sound_Barcelona-Barcelona_Catalonia.html", "text": "Is it possible, in any way, to hear music for free outside concert area on Port Forum?\nTo just sit somewhere and chill and hear some band??\nAnyone tried? Thanks!! :)", "publishedDate": "2019-05-26", "language": "en", "rating": 4}, {"id": 663068544, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d8820333-r663068544-Primavera_Sound_Barcelona-Barcelona_Catalonia.html", "text": "The lineup is always well-curated, logistics are usually just fine and the location is incredible. Happy to be a Primavera Sound regular.", "publishedDate": "2019-04-02", "language": "en", "rating": 5}, {"id": 584406494, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d8820333-r584406494-Primavera_Sound_Barcelona-Barcelona_Catalonia.html", "text": "Very nice food,great  services , nice people, only disappointed by many beer stands and only two wine ones!!!", "publishedDate": "2018-06-01", "language": "en", "rating": 4}, {"id": 584294642, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d8820333-r584294642-Primavera_Sound_Barcelona-Barcelona_Catalonia.html", "text": "The Best music festival in Europe by far. Since you visit one time this festival, it's almost certain that you'll be Back. The most impressive things is that although it's huge, everything is excellent organised and on time. Good variety of food, good and fast service at the bars and good amount of toilets. Plus the fact that you also get To visit the magnificent city of Barcelona. ", "publishedDate": "2018-06-01", "language": "en", "rating": 5}, {"id": 584285185, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d8820333-r584285185-Primavera_Sound_Barcelona-Barcelona_Catalonia.html", "text": "Nice music, but the organization is not good. Not enough instructions at the entrance, so had to go around 2 times to get a bracelet wasting my time; didn’t have water near the toilets- it was finished; several awkward problems with sound on main stages kind of shame; the stages located too far from each other, so you walk a lot wasting your time to find what you want; well disgusting beer, but it’s ok - I don’t drink a lot. \n\nSo I don’t think I would visit this again", "publishedDate": "2018-06-01", "language": "en", "rating": 2}, {"id": 584165193, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d8820333-r584165193-Primavera_Sound_Barcelona-Barcelona_Catalonia.html", "text": "Kelela delayed the scheduled by 2min. Also, the sound system was not really what I was expecting coming from a famous festival like PRIMAVERA SOUND. Could you please call a sound engineer to check it out PLEASE?? \n\nOne more thing, a lot of commercials in your festival. I have seat in my pocket, I drunk Heineken, Mango showed me the road to see Flamenco, Anyway a lot of COMMERCIALS GUYS.\n\nAnd last thing, the food was really expensive because I’m not rich.\n\nPEACE. <3", "publishedDate": "2018-05-31", "language": "en", "rating": 1}, {"id": 497769180, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d8820333-r497769180-Primavera_Sound_Barcelona-Barcelona_Catalonia.html", "text": "I really enjoyed this festival, the acts were great, the location was great - although it took us a while longer to get there from central Barcelona then i'd have liked. The only down-side was trying to get home on wednesday-friday. That was chao - no buses or taxis were coming so we ended up walking for over an hour  back to our hostel. Apart from that it was a great time!", "publishedDate": "2017-07-01", "language": "en", "rating": 4}, {"id": 492746971, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d8820333-r492746971-Primavera_Sound_Barcelona-Barcelona_Catalonia.html", "text": "Me and my boyfriend bought tickets to go and see The Magnetic Fields at Primavera on Friday the 2nd of June. When we got there we were ready to have nice relaxing time and really excited to see our favourite band as well as discover new ones. \nWe quickly discovered that Magnetic Fields were playing inside the Auditori Rockdelux which was a massive black building outside of the gates of the festival. We asked a steward to make sure we would be able to get in. They didn't know so they sent us to an info point far away from where we were and the Auditori was. \nOnce we got there the girl behind the desk advised us to go quickly to the ticket office to buy (!!!) an additional ticket for this performance because she wasn't sure if there were many left. \nThankfully when we got there we were in time to get 2 tickets for 2 euros each. Although this was a small price, we had already spent 80 euros just for that day and were not happy about having to pay extra on the day without warning. \nAfter going outside of the gates to get into what we thought was the entrance we found that we had to walk all the way back into the site and go through the horrendous ordeal of the 3 point security check.\nThe gig was spectacular and I highly recommend going to see The Magnetic Fields anywhere they play. However, we then discovered that they would be playing a second set the next night for the next half of their show, another surprise to us that wasn't communicated at any point.\nAfter this we went outside to get a much needed drink, only to find that we were charged an extra 2 euros simply for getting them from a man with a cart instead of at the bar, why?\nThe whole thing with Primavera is just horrible in itself- large companies plastering their logos everywhere and stages being named after them in the hope they'll snare a few more consumers. \nThe plastic card you're given on the door is completely unnecessary and a waste of plastic too, and the bar uses tons of plastic cups right by the water which will inevitably blow out and pollute the Balearic sea.\nNeedless to say I won't be going back.", "publishedDate": "2017-06-13", "language": "en", "rating": 2}, {"id": 490739997, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d8820333-r490739997-Primavera_Sound_Barcelona-Barcelona_Catalonia.html", "text": "My second trip to Primavera Sound and a pleasure to be there again. \n\nEverything is good about the experience, although they could do with more wine bars and grass areas for people to chill. \n\nWell behaved crowds make this a really enjoyable experience and I will definitely return as will my fellow travellers.", "publishedDate": "2017-06-05", "language": "en", "rating": 5}, {"id": 490490680, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d8820333-r490490680-Primavera_Sound_Barcelona-Barcelona_Catalonia.html", "text": "Great festival, really well set up and organised. Would definitely return but would hope for better headliners next time. ", "publishedDate": "2017-06-04", "language": "en", "rating": 4}, {"id": 426526871, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d8820333-r426526871-Primavera_Sound_Barcelona-Barcelona_Catalonia.html", "text": "If you're looking for the extra curricular frolics of many major festivals this ain't for you. If however you appreciate a wide range of eclectic music, which leans heavily towards the alternative (definitely not Kasabian/Noel Gallagher/Twin Atlantic et al) this will  possibly be the best festival you will ever attend. We've been the last five years and plan to return, always guaranteed the lineup will fit our music tastes perfectly. One for the more credible music fan. Who needs a cider bus when you're too busy discovering new music! ", "publishedDate": "2016-10-09", "language": "en", "rating": 5}, {"id": 404661218, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d8820333-r404661218-Primavera_Sound_Barcelona-Barcelona_Catalonia.html", "text": "The harbour area is great for a festival! You never realise just how many people is gathered there at the same time. \nThe festival has a good number of stages and lots of acts,  but the scenes and music is planned and timed quite good so it is almost possible to to see all your favorites without missing any. There is also a very good food court and a beach area to kill time while waiting for your next concert.", "publishedDate": "2016-08-12", "language": "en", "rating": 5}, {"id": 386153720, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d8820333-r386153720-Primavera_Sound_Barcelona-Barcelona_Catalonia.html", "text": "Fantastic festival. Great mixture of festival and city break. Well organised and managed. Great range of food and number of bars. Fantastic setting and transportation is easy to navigate. Fantastic line ups and friendly atmosphere. Will be back! ", "publishedDate": "2016-06-26", "language": "en", "rating": 5}, {"id": 382265844, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d8820333-r382265844-Primavera_Sound_Barcelona-Barcelona_Catalonia.html", "text": "I'm an experienced festival goer and attended Primavera Sound for the first time this year (2016). It blew my mind in every way. The location is great- at first it seemed too concrete and industrial for my taste (I've been spoiled by the palm trees and green grass at Coachella for too long!), but as the weekend went on I fell in love with the location. The festival organizers do a great job with it. There are so many stages in separate areas that all have their own atmosphere and charm.  And at sunrise when the sky becomes light over the water it really is spectacular. As was every other aspect of the festival. The sound is hands down the best sound I have heard anywhere. The festival is sponsored by a speaker company and between the massive bass and the clarity of the high end, they create a perfect sound experience.  We opted for VIP tickets and they were worth every extra Euro.  The two main stages have VIP only section that are dead front center. We were ridiculously close for all of the headliner acts without having to camp out for hours.  The people at Primavera were amazing too- so chill and friendly.  I would go again in a heartbeat.", "publishedDate": "2016-06-13", "language": "en", "rating": 5}, {"id": 380138055, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d8820333-r380138055-Primavera_Sound_Barcelona-Barcelona_Catalonia.html", "text": "I love festivals cause normaly there is a lot of activities beside the concerts and you can have a good time inside, having fun with your friends. Here in Primavera Sound there is nothing to do, just so litlle stand to see, the beer is too expencive, the choice of food is poor, half of the ground is with small rock and when people walk, is impossible to bread cause of the dust, hudge lines to go the the WC. Well, they are not prepared to recieve so many people. We payed 88 euros for one day.. and it was the last time, no matter wich bands are going to go there, i am not going back.", "publishedDate": "2016-06-05", "language": "en", "rating": 2}, {"id": 380130663, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d8820333-r380130663-Primavera_Sound_Barcelona-Barcelona_Catalonia.html", "text": "Saw Saturday's Primavera, which was excellent. The event was really well organised and the layout good - with many stages and attractions. Just watch the food prices - 7€ for a hotdog is a bit steep!", "publishedDate": "2016-06-05", "language": "en", "rating": 4}]}}]