[{"locationId": 591343, "name": "Plaça d'Espanya", "placeType": "ATTRACTION", "reviewListPage": {"reviews": [{"id": 752437184, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d591343-r752437184-Placa_d_Espanya-Barcelona_Catalonia.html", "text": "During my time in Barcelona, I found Plaza de Espana to be the major hub of activity in a city bustling with activity day and night. During my time in Barcelona, I learned that this square was originally built in 1929 as part of the International Exposition. \n\nToday, the plaza is a hub of activity that includes a bullring that has been converted to a shopping & entertainment center, a fountain, a massive avenue as well as the Museu Nacional d'Art de Catalunya (MNAC). The plaza is also relatively close to the Olympic Complex.\n\nThis is not a place to slow down! This is a place where visitors will be a part of the crowds of tourists, local visitors and business people walking and driving around the plaza.", "publishedDate": "2020-04-09", "language": "en", "rating": 4}, {"id": 751901502, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d591343-r751901502-Placa_d_Espanya-Barcelona_Catalonia.html", "text": "Not really a destination but somewhere you are bound to pass by going elsewhere.  \n\nNot a lot to say other than the two pillars leading into the statue in the middle of the roundabout are quite impressive and dominate the area long with the shopping centre nearby.  A good area to see at night.\n\nDon't go out of your way to go here but theres plenty nearby that you will probably go and see anyway.", "publishedDate": "2020-03-27", "language": "en", "rating": 4}, {"id": 744665336, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d591343-r744665336-Placa_d_Espanya-Barcelona_Catalonia.html", "text": "Impressive square in the heart of Barcelona. A true landmark. Also, the Aerobus stops at here to and from the airport.", "publishedDate": "2020-02-12", "language": "en", "rating": 5}, {"id": 744446044, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d591343-r744446044-Placa_d_Espanya-Barcelona_Catalonia.html", "text": "This is a very attractive plaza or roundabout in the city of Barcelona. With the statue in the middle and the arena and towers nearby making this an interesting place not only for sightseeing but also for shopping.", "publishedDate": "2020-02-11", "language": "en", "rating": 4}, {"id": 738863361, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d591343-r738863361-Placa_d_Espanya-Barcelona_Catalonia.html", "text": "I went many times in Placa d'Espanya since I live here however was my first New Years Eve fireworks witness here. There are 2 shows : one starting at 21.30 and one at midnight. Both shows are worth watching if you are closer not far away as I was. I've seen many people coming in early since 20,00 with warm clothes, blankets and bags of food to catch a place next to the fountains (its there were the magic happens). The show at 21.30 is sort of a warm up for the big show at midnight. This year, the show was a mix of water, fire and fireworks, really impressive (not as in size but more as an artistic display). There was a huge crowd, so after the main show at midnight was over, you had to be patient if you wanna leave. There was Police everywhere, however they were very polite. There were people in the crowd selling  small bags of 12 grapes for you to mark the tradition and even six-packs of beer/ juice/ champagne. The amazing thing was that in the morning, I passed the Plaza again and I could see lots of \"sanitation engineers\" power washing the plaza in the morning so you couldn't even tell that at midnight there were broken gasses/champagne left over from the celebration (big thumbs up for the administration)", "publishedDate": "2020-01-13", "language": "en", "rating": 4}, {"id": 737602520, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d591343-r737602520-Placa_d_Espanya-Barcelona_Catalonia.html", "text": "This is a must see in Barcelona, but once you are there you do not need to spend much time here as the heavy traffic takes away from the beauty of the place. It is a good stopping point on the way to or coming from the National Museum of Art.", "publishedDate": "2020-01-07", "language": "en", "rating": 4}, {"id": 737325237, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d591343-r737325237-Placa_d_Espanya-Barcelona_Catalonia.html", "text": "What a show... U can't miss this for anything.. 31st December show of fireworks at the place is something extraordinary. We really liked the music, fountain show and then themed fireworks, with social message of sea life... Plastic problem. ", "publishedDate": "2020-01-06", "language": "en", "rating": 5}, {"id": 737295253, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d591343-r737295253-Placa_d_Espanya-Barcelona_Catalonia.html", "text": "Undoubtedly this is one of the (if not most) busiest squares of Barcelona. Twin towers on either side of the road with a huge monument in the round about and the magical water fountain are the highlights of this area. Can get crowded during the fountain shows.", "publishedDate": "2020-01-06", "language": "en", "rating": 4}, {"id": 735350627, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d591343-r735350627-Placa_d_Espanya-Barcelona_Catalonia.html", "text": "Absolutely stunning. It's highly recommended to all. The 2 towers lead too the magic fountain. Next to it there is a bullring.", "publishedDate": "2019-12-29", "language": "en", "rating": 5}, {"id": 734937793, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d591343-r734937793-Placa_d_Espanya-Barcelona_Catalonia.html", "text": "The Placa dEspanya is a main intersection where the main road from the airport meets a major subway hub which means this place is always busy but its surrounded by shops (Los Arenas) , interesting places to see (MNAC , Olympic Park , Montjuic) and lots of places to eat and drink . When we were there it was in the middle of the catalan student demonstrations and the roundabout was closed due to the sitin protest which was a bit surreal but added to the buzz.", "publishedDate": "2019-12-27", "language": "en", "rating": 5}, {"id": 734481348, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d591343-r734481348-Placa_d_Espanya-Barcelona_Catalonia.html", "text": "One of the two main squares in Barcelona , looks very monumental , nice architecture surround it  and lead to the sea via Parallel st.", "publishedDate": "2019-12-24", "language": "en", "rating": 4}, {"id": 732785291, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d591343-r732785291-Placa_d_Espanya-Barcelona_Catalonia.html", "text": "For a mix of traditional and modern you should head out to this impressive square. It connects busy main roads, so there's lots of traffic, but still lots of room to walk.\n\nThe Gran Via and the Paral-lel meet here, both very nice avenues to have a good walk on (to the port or to La Rambla). It makes a nice roundtrip, walk the Paral-lel until you hit La Rambla, head north until Gran Via and follow it back here. \n\nThe Arenas de Barcelona stands out here at this square. The former bullfighting arena turned shopping mall. Still and impressive sight. Then there are the two Torres Venecianes on the other side. Also the architecture of Fundació Fòrum Ambiental is quite nice.\n\nIt's not a place where you spend hours, but a sight you shouldn't miss.", "publishedDate": "2019-12-15", "language": "en", "rating": 4}, {"id": 731815606, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d591343-r731815606-Placa_d_Espanya-Barcelona_Catalonia.html", "text": "Placa de espanya captures the beauty of Barcelona. It is a tourist attraction and worth visiting if you are down there for a few days.", "publishedDate": "2019-12-10", "language": "en", "rating": 5}, {"id": 730875722, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d591343-r730875722-Placa_d_Espanya-Barcelona_Catalonia.html", "text": "This beautiful area is at the bottom of the hill from the Montjuic area. It is a good place for photo ops as well as to get orientated. The views do not get much better than this.", "publishedDate": "2019-12-05", "language": "en", "rating": 5}, {"id": 730259128, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d591343-r730259128-Placa_d_Espanya-Barcelona_Catalonia.html", "text": "I went there for an expo, but we fell upon the protesting and the Metro didn't have an elevator. That was bad in a central point like that, in a city like Barcelona...", "publishedDate": "2019-12-02", "language": "en", "rating": 2}, {"id": 729658034, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d591343-r729658034-Placa_d_Espanya-Barcelona_Catalonia.html", "text": "Great monument, very busy placa and a hub for activity.  You can catch the 150 bus up to the Castell Montjuic from here, see the stadium and up the street one block is the parliament and government buildings. ", "publishedDate": "2019-11-29", "language": "en", "rating": 4}, {"id": 729486984, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d591343-r729486984-Placa_d_Espanya-Barcelona_Catalonia.html", "text": "While in Barcelona earlier this year, we spent a few days visiting some of the famous sites in the city. Placa d'Espanya was one of the sites we visited. Built for the 1929 International Exhibit, it remains one of the many impressive focal points in the city.  If you are traveling in Barcelona, a visit to the Placa d'Espanya is a must.     ", "publishedDate": "2019-11-28", "language": "en", "rating": 5}, {"id": 728909030, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d591343-r728909030-Placa_d_Espanya-Barcelona_Catalonia.html", "text": "Home of the splendid fountain and the big park leading to the huge Catalan cultural museum, this is one of the city's major crossroads, full of people.", "publishedDate": "2019-11-25", "language": "en", "rating": 4}, {"id": 727369830, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d591343-r727369830-Placa_d_Espanya-Barcelona_Catalonia.html", "text": "This is a very nice square. If you go to the top of the shopping centre you'll get a good view of it. I think the view from the top is way better than from the ground because of the traffic.", "publishedDate": "2019-11-18", "language": "en", "rating": 4}, {"id": 726483581, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d591343-r726483581-Placa_d_Espanya-Barcelona_Catalonia.html", "text": "When you are visiting Placa d' Espanya, just get across the round-about and take the pictures on Torres Venicianes. However, it worth to walk up hill to get the penoramic view of the City Of Barcelona. For people with some walking difficulty, don't worry there are escalators taking visitors to different level. From the top level area, you will see the water features in the front in addition to the beautiful city view.", "publishedDate": "2019-11-14", "language": "en", "rating": 5}, {"id": 722301787, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d591343-r722301787-Placa_d_Espanya-Barcelona_Catalonia.html", "text": "This place is very close to the metro.  It has nice photo opportunities.  It is a nice place to walk around.", "publishedDate": "2019-10-29", "language": "en", "rating": 3}, {"id": 722022308, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d591343-r722022308-Placa_d_Espanya-Barcelona_Catalonia.html", "text": "A very large plaza well served by public transport. The views along the cascades to the Museum and the Font Magica de Montjuic. A nice place for a stroll and a photo/selfie opp. Watch out for street hawkers and pick pockets.", "publishedDate": "2019-10-28", "language": "en", "rating": 4}, {"id": 721780349, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d591343-r721780349-Placa_d_Espanya-Barcelona_Catalonia.html", "text": "There are amazing views in multiple directions.  The statue and fountain in the centre was one.  Then looking at the national museum is also impressive.  ", "publishedDate": "2019-10-27", "language": "en", "rating": 4}, {"id": 720276829, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d591343-r720276829-Placa_d_Espanya-Barcelona_Catalonia.html", "text": "Great for people watching.  a monumental plaza.  great location, betwwen la rambla and passieg de gracia", "publishedDate": "2019-10-21", "language": "en", "rating": 5}, {"id": 718675141, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d591343-r718675141-Placa_d_Espanya-Barcelona_Catalonia.html", "text": "Very unusual but marvellous square in Barcelona with plenty of photo opportunities. You don't need to spend a lot of time there but it is worth a visit for some photos.", "publishedDate": "2019-10-15", "language": "en", "rating": 5}, {"id": 718155140, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d591343-r718155140-Placa_d_Espanya-Barcelona_Catalonia.html", "text": "Saw this on the hopper bus , and got off for a look and I loved the area ,was well worth seeing , lovely views xx", "publishedDate": "2019-10-13", "language": "en", "rating": 5}, {"id": 716613222, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d591343-r716613222-Placa_d_Espanya-Barcelona_Catalonia.html", "text": "A former bullring left to oblivion, Arenas de Barcelona was turned into a modern shopping center, retaining the original facade on the outside. Besides the large array of shops and restaurants, the terrace on the rooftop overlooking Spanish square.is an interesting spot. There is a small fee to access an elevator from which you can take an awesome look of Barcelona City. \n\nAntigua plaza de toros abandonada, Arenas de Barcelona se convirtió en un moderno centro comercial, conservando la fachada exterior original. Hay gran variedad de tiendas y restaurantes, la terraza en la azotea con vistas a la plaza es un lugar interesante. Hay una pequeña tarifa para acceder a un elevador desde el que puede echar un vistazo a la ciudad de Barcelona.", "publishedDate": "2019-10-09", "language": "en", "rating": 4}, {"id": 715840749, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d591343-r715840749-Placa_d_Espanya-Barcelona_Catalonia.html", "text": "You can live the history in barcelona by visiting this area; it is very close to espanya metro station and the arena de barcelona mall.\n", "publishedDate": "2019-10-06", "language": "en", "rating": 5}, {"id": 715242341, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d591343-r715242341-Placa_d_Espanya-Barcelona_Catalonia.html", "text": "once a bull fighting arena now a small mall but the roof is an observation deck with many restauraunts 360 degree views", "publishedDate": "2019-10-04", "language": "en", "rating": 5}, {"id": 714833106, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d591343-r714833106-Placa_d_Espanya-Barcelona_Catalonia.html", "text": "There are so many things you can do around here. Firstly the trek up to have the views of the waterfall was stunning. There are soo many pretty parrots and parakeets flying around and singing away. It’s really soothing to be around nature within the city. \nThere are other sights too around but you would need a good pair of trainers to walk around. But overall this place is really soothing.", "publishedDate": "2019-10-02", "language": "en", "rating": 5}, {"id": 711714093, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d591343-r711714093-Placa_d_Espanya-Barcelona_Catalonia.html", "text": "The fountains are beautiful.  When asking the locals, they tell you the higher vantage the better.  We began watching by the museum only to move closer.  The views are absolutely much better closer to the fountain.  You can’t hear the music further away.  The show is about an hour long.  Well worth it.", "publishedDate": "2019-09-21", "language": "en", "rating": 4}, {"id": 709422671, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d591343-r709422671-Placa_d_Espanya-Barcelona_Catalonia.html", "text": "Beautiful please, good for commuting as well. A must see when you visit Barcelona. It’s close to many museums. ", "publishedDate": "2019-09-13", "language": "en", "rating": 5}, {"id": 709408937, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d591343-r709408937-Placa_d_Espanya-Barcelona_Catalonia.html", "text": "This is a massive transport intersection in the middle of Barcelona. Some impressive and interesting buildings surround it, so worth a visit, but it’s noisy and busy and not a great place to hang out for long. ", "publishedDate": "2019-09-13", "language": "en", "rating": 3}, {"id": 707158020, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d591343-r707158020-Placa_d_Espanya-Barcelona_Catalonia.html", "text": "A must visit in Barcelona as it offers amazing views and a first look into what barcelona is as a city. Simply cool ", "publishedDate": "2019-09-06", "language": "en", "rating": 5}, {"id": 706553543, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d591343-r706553543-Placa_d_Espanya-Barcelona_Catalonia.html", "text": "Loved this plaza.  Beautiful architecture and art.  Close to restaurants, shopping and a historic avenue to explore", "publishedDate": "2019-09-04", "language": "en", "rating": 5}, {"id": 706536200, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d591343-r706536200-Placa_d_Espanya-Barcelona_Catalonia.html", "text": "When in Barcelona you can't miss Placa d'Espanya I walked around and saw the Venetian Towers, the monument and garden in the center of the Plaza (Square).   If you like to walk you easily go to Las Ramblas in 30 minutes.", "publishedDate": "2019-09-04", "language": "en", "rating": 5}, {"id": 704213332, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d591343-r704213332-Placa_d_Espanya-Barcelona_Catalonia.html", "text": "Do not miss this wonderous free show. The illuminated fountains dance every evening and are always a highlight of my trips to Barcelona.", "publishedDate": "2019-08-29", "language": "en", "rating": 5}, {"id": 701515255, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d591343-r701515255-Placa_d_Espanya-Barcelona_Catalonia.html", "text": "If you visit during the day, make you return at night to capture your night photo of Paca d'Espanya. Depending upon which side of the street of you are on when you visit, you can capture fantastic photos or a time lapse with the cars zipping by. ", "publishedDate": "2019-08-21", "language": "en", "rating": 4}, {"id": 698608465, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d591343-r698608465-Placa_d_Espanya-Barcelona_Catalonia.html", "text": "You can get some wonderful pictures from this Placa but there aren't a lot of activities in the surrounding area.  I would suggest visiting enroute to the palace just up the hill from here or when connecting through the subway station here.", "publishedDate": "2019-08-13", "language": "en", "rating": 4}, {"id": 698183015, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d591343-r698183015-Placa_d_Espanya-Barcelona_Catalonia.html", "text": "Great space and view leading to the fountain and the museum. Easy to access on the hop on hop off buses.", "publishedDate": "2019-08-12", "language": "en", "rating": 5}, {"id": 697862005, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d591343-r697862005-Placa_d_Espanya-Barcelona_Catalonia.html", "text": "It has a good view for the magical fountain of mounjec and you can enjoy the mall that’s next to it, it has a panoramic view with a 2€ entrance ", "publishedDate": "2019-08-11", "language": "en", "rating": 4}, {"id": 697457691, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d591343-r697457691-Placa_d_Espanya-Barcelona_Catalonia.html", "text": "It's an amazing place, lots of different building around, and the gate-like where the fountain dance happen every night. \nIt's very lively in the time of fountain dance. The fine arts museum is nearby.", "publishedDate": "2019-08-10", "language": "en", "rating": 4}, {"id": 690860725, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d591343-r690860725-Placa_d_Espanya-Barcelona_Catalonia.html", "text": "A huge place that one comes back to again and again as it is a major central area for the starting point for tours, Las Ramblas, etc.  There is a lot going on here and there are lots of major stores for shopping and the usual tourist brands for shops and restaurants, if one is into that sort of thing.  I found it way too crowded and touristy for my taste but we ended up here many times since it is a central area of tours, bus to the airport, etc.  It is a convenient place in that way.  The Placa itself in the center of the busy intersection can be a nice place to sit and people watch.  ", "publishedDate": "2019-07-19", "language": "en", "rating": 3}, {"id": 690341058, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d591343-r690341058-Placa_d_Espanya-Barcelona_Catalonia.html", "text": "The Placa d'Espanya is the plaza just to the south of the Magic Fountain and the National Museum of Art in Barcelona. It's a busy intersection for both traffic and people with lots of cafes and restaurants in the area, although sadly few give views of the vast avenue leading up to the magic fountain. It's an amazing place for the proximity to the nearby attractions and an excellent place to stop and eat.", "publishedDate": "2019-07-17", "language": "en", "rating": 5}, {"id": 688251308, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d591343-r688251308-Placa_d_Espanya-Barcelona_Catalonia.html", "text": "Amazing views and great shopping centre that was origianlly an old bullring. but really not much to see", "publishedDate": "2019-07-09", "language": "en", "rating": 2}, {"id": 688171634, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d591343-r688171634-Placa_d_Espanya-Barcelona_Catalonia.html", "text": "Beautiful as everything in Barcelona. Really big circle with a lot of shopping in the area and great view ", "publishedDate": "2019-07-09", "language": "en", "rating": 5}, {"id": 688162047, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d591343-r688162047-Placa_d_Espanya-Barcelona_Catalonia.html", "text": "The old bullring is a lovely place to shop, eat, cinema, people watch, the restaurants are on like a promanade around the top where you can walk around and see the sites all the way up to the palace and majic fountains. or have a meal in one of the many restaurants up on the top.", "publishedDate": "2019-07-09", "language": "en", "rating": 5}, {"id": 685761245, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d591343-r685761245-Placa_d_Espanya-Barcelona_Catalonia.html", "text": "The area from the museum, down the mountain to the waterfalls, to the magic fountain and the to Placa d’Espanya is a must to do in Barcelona. If you time you visit right you can see the magic fountain shiw as well.", "publishedDate": "2019-07-01", "language": "en", "rating": 4}, {"id": 685195533, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d591343-r685195533-Placa_d_Espanya-Barcelona_Catalonia.html", "text": "This is a huge square leading to the magic fountains and the museum. Great to take in the atmosphere and soak in the views. Easily accessible via metro.", "publishedDate": "2019-06-29", "language": "en", "rating": 4}, {"id": 684999776, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d591343-r684999776-Placa_d_Espanya-Barcelona_Catalonia.html", "text": "We first saw the square on arrival by bus from the airport.  You descend off the bus into the hustle and bustle of Barcelona!   What an amazingly large plaza it is!   Statues, shopping areas, metro, fountains, monuments, plus thousands of people swarming through and by!   What excitement.\nWe came back here in the evening - and it was quite beautiful.  Loved the old bullring turned into a Shopping Plaza.   Easy to get around and through the plaza, as the underground walkways make it safe to get across the very busy traffic.\nDon't miss walking up to the Fountains and Mont Juic/Catalunya Museum!", "publishedDate": "2019-06-28", "language": "en", "rating": 5}, {"id": 684769054, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d591343-r684769054-Placa_d_Espanya-Barcelona_Catalonia.html", "text": "Visit the Arenas shopping centre built into a bullfighting ring.  From the roof you can see Joan Miro's sculpture in the nearby park.", "publishedDate": "2019-06-27", "language": "en", "rating": 5}, {"id": 684184964, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d591343-r684184964-Placa_d_Espanya-Barcelona_Catalonia.html", "text": "My wife and I recently traveled to Barcelona, Spain for the first time. This is an amazing city with so much to see and do...You really need weeks not days to see it all.\n\nWe headed over to Placa d' Espanya and enjoyed walking around sightseeing and just taking in all the history and grandeur that Placa d'Espanya offers. We even visited the Arena that has since been turned into a multi-level shopping mall...You take an elevator  to the upper walkway that circles the entire building. The views of the square and government buildings from there is impressive...\n\nAny visit to Barcelona has to include a day visit to Placa d'Espanya....", "publishedDate": "2019-06-25", "language": "en", "rating": 5}, {"id": 684085143, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d591343-r684085143-Placa_d_Espanya-Barcelona_Catalonia.html", "text": "The square makes a grand statement, rising on one side up to the Magic Fountain and the castle.  Try visiting the castle and walking down the hill, visiting the park and museums as you go.  ", "publishedDate": "2019-06-24", "language": "en", "rating": 3}, {"id": 683633914, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d591343-r683633914-Placa_d_Espanya-Barcelona_Catalonia.html", "text": "I almost forgot about this place! This was one of our stops in the hop on hop off. It was very beautiful to see it all together from here. There's a shopping center right in front that if you go on the very top you can see the whole square!", "publishedDate": "2019-06-23", "language": "en", "rating": 5}, {"id": 683191654, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d591343-r683191654-Placa_d_Espanya-Barcelona_Catalonia.html", "text": "One of the many large squares in Barcelona this one is particularly impressive as the views in all directions are great, with the roads and buildings well aligned. Easy for pedestrians to negotiate, in spite of the heavy traffic flowing through it. ", "publishedDate": "2019-06-21", "language": "en", "rating": 5}, {"id": 682470282, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d591343-r682470282-Placa_d_Espanya-Barcelona_Catalonia.html", "text": "The Placa is more of a transport hub with metro and buses stopping here taking you a bit of everywhere. The nice towers offer a passage towards Monjuic area taking you up near the castle through bus 150. ", "publishedDate": "2019-06-18", "language": "en", "rating": 4}, {"id": 682439513, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d591343-r682439513-Placa_d_Espanya-Barcelona_Catalonia.html", "text": "Go up the arena building for a lovely view of barcelona and the square. The lift up costs 1 euro per person. If u go into the shopping complex there are elevators leading u up for free..", "publishedDate": "2019-06-18", "language": "en", "rating": 5}, {"id": 681823531, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d591343-r681823531-Placa_d_Espanya-Barcelona_Catalonia.html", "text": "When you like the beauty of buildings and other attactions you must vist this place. You can take great pictures and can travel there with metro, bus or taxi.", "publishedDate": "2019-06-16", "language": "en", "rating": 4}, {"id": 681749851, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d591343-r681749851-Placa_d_Espanya-Barcelona_Catalonia.html", "text": "Go to bull ring for the views.. Just a regular mall inside now but restaurants and bars at top for 360 degree views", "publishedDate": "2019-06-15", "language": "en", "rating": 4}, {"id": 681371726, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d591343-r681371726-Placa_d_Espanya-Barcelona_Catalonia.html", "text": "The view fron the Gallery of Catalunia down the waterfalls is fantastic and has a great panoramic view over the west of the city. ", "publishedDate": "2019-06-13", "language": "en", "rating": 5}, {"id": 681343815, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d591343-r681343815-Placa_d_Espanya-Barcelona_Catalonia.html", "text": "This place looks amazing at night.....We briefly stopped by right before going to our hotel and the view is amazing at night.", "publishedDate": "2019-06-13", "language": "en", "rating": 5}, {"id": 680836924, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d591343-r680836924-Placa_d_Espanya-Barcelona_Catalonia.html", "text": "Nice place to walk, enjoy the city and be happy. It is in front of the Las Arenas de Barcelona, which is a good choice to buy and eat.", "publishedDate": "2019-06-11", "language": "en", "rating": 5}, {"id": 680643301, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d591343-r680643301-Placa_d_Espanya-Barcelona_Catalonia.html", "text": "It's a big busy square and a must visit in Barcelona. The Venetian towers, the four white columns and the magic fountain is really charming. If you go around the Art museum then you can see the sunset and also quite a nice bird's eye view of the city below. The magic fountain is a winner.", "publishedDate": "2019-06-10", "language": "en", "rating": 4}, {"id": 679788053, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d591343-r679788053-Placa_d_Espanya-Barcelona_Catalonia.html", "text": "Awesome place to visit, lots to see, always something happening here.. a must see...busy area, better walk", "publishedDate": "2019-06-07", "language": "en", "rating": 4}, {"id": 677556267, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d591343-r677556267-Placa_d_Espanya-Barcelona_Catalonia.html", "text": "great square to enjoy, walk around and soak up the atmosphere\n\nenjoy the people watching and admire the architecture", "publishedDate": "2019-05-30", "language": "en", "rating": 3}, {"id": 677418965, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d591343-r677418965-Placa_d_Espanya-Barcelona_Catalonia.html", "text": "An large area to cover from the bullring and the fountain, facing the Venetian towers, leading to the magic fountain and the four columns. A nice stroll", "publishedDate": "2019-05-29", "language": "en", "rating": 4}, {"id": 676667722, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d591343-r676667722-Placa_d_Espanya-Barcelona_Catalonia.html", "text": "Another bustling plaza worth a stop on the Hop On Hop Off Bus!  Try out one of the restaurants on the rooftop of the bullring shopping mall for superb food and views!", "publishedDate": "2019-05-26", "language": "en", "rating": 5}, {"id": 676623210, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d591343-r676623210-Placa_d_Espanya-Barcelona_Catalonia.html", "text": "This is where the magic fountain show is. Busy area with traffic. If you want to see an airial view of this area, there is a shopping mall (Las Arenas) close by & go up to the open rooftop for a great view.", "publishedDate": "2019-05-26", "language": "en", "rating": 4}, {"id": 675990855, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d591343-r675990855-Placa_d_Espanya-Barcelona_Catalonia.html", "text": "Nice big square facing an old bull-fighting arena, with the magic fountain and the Art museum on the backside.\n\nBusy, and not suitable to sit in but rather visit the things around.\n\n", "publishedDate": "2019-05-23", "language": "en", "rating": 4}, {"id": 675668921, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d591343-r675668921-Placa_d_Espanya-Barcelona_Catalonia.html", "text": "We were staying fairly close to here and seemed to be forever passing through either on foot or by bus. It takes a while to cross the roads around the square and while it is beautiful, practically you can get pretty wet while walking round if the weather is bad. The area at the foot of the hill was occupied by a car show when we were there and getting round that either by foot of bus took a fair diversion, so I think that we did not see the area at its best. The old bullring, now a shopping centre looks amazing.", "publishedDate": "2019-05-22", "language": "en", "rating": 3}, {"id": 675592659, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d591343-r675592659-Placa_d_Espanya-Barcelona_Catalonia.html", "text": "This is one of the main squares of Barcelona.  So much to see and do in this area. Go to the old bullring opposite for the view from the roof. ", "publishedDate": "2019-05-21", "language": "en", "rating": 5}, {"id": 674105333, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d591343-r674105333-Placa_d_Espanya-Barcelona_Catalonia.html", "text": "it was very near to our apartment. was very beautiful view and easy to be oriented to other touristic points. ", "publishedDate": "2019-05-15", "language": "en", "rating": 5}, {"id": 674028642, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d591343-r674028642-Placa_d_Espanya-Barcelona_Catalonia.html", "text": "Plaza España is one of the main squares to visit in Barcelona. Nearby, you have the Montjuic Park, you have the subway that goes to Monserrat, there's also a mall \"Las Arenas\" that used to be a place where bullfights were developed, a plaza de toros until 1977.", "publishedDate": "2019-05-14", "language": "en", "rating": 4}, {"id": 673643351, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d591343-r673643351-Placa_d_Espanya-Barcelona_Catalonia.html", "text": "Visiting the area for a meal before watching the Magic Fountain display, we walked by the Place d'Espanya. \n\nIt's a bit of a dilemma as we went during dusk because we wanted to see the Magic Fountain display but can't help feeling we missed out on seeing what this place looks like by day. \n\nIt seems potentially striking, but sadly as we were at the end of our holiday we didn't have the opportunity to return. \n\nIn retrospect, two visits are recommended, one by day to see it 'for real', the other by night to catch the Magic Fountain display.", "publishedDate": "2019-05-13", "language": "en", "rating": 5}, {"id": 671667609, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d591343-r671667609-Placa_d_Espanya-Barcelona_Catalonia.html", "text": "A place to go to while visiting Barcelona. You have to see a place to fight bulls, though in Catalonia you can not organize them anymore.", "publishedDate": "2019-05-05", "language": "en", "rating": 4}, {"id": 671570023, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d591343-r671570023-Placa_d_Espanya-Barcelona_Catalonia.html", "text": "Placa d'Espanya must be one of the loveliest public spaces anywhere in Spain, and in Europe. It is so beautiful. From a distance you can probably appreciate its beauty even more. We walked by this place several times and loved it. It is quite huge and is a very important intersection, connecting a number of great roads and important districts.  There is a beautiful fountain in its centre and if you keep going up the hill through the huge columns, along Avinguda de la Reina Maria Cristina,  towards the MNAC Museum, you will come across the Magic Fountain, one of the most spectacular fountains. Placa d'Espanya was built about a hundred years ago, on the site of what once used to be a place of public executions!", "publishedDate": "2019-05-05", "language": "en", "rating": 5}, {"id": 668724505, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d591343-r668724505-Placa_d_Espanya-Barcelona_Catalonia.html", "text": "It's a nice place, brimming with people. The arquitecture is very nice, plus it's near a lot of cool places.", "publishedDate": "2019-04-23", "language": "en", "rating": 3}, {"id": 668656278, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d591343-r668656278-Placa_d_Espanya-Barcelona_Catalonia.html", "text": "This was a really nice plaza, with access to many other great sites, like the Museum of Catalunya and the Poble Espanol, which are also worth visiting.", "publishedDate": "2019-04-23", "language": "en", "rating": 5}, {"id": 667979072, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d591343-r667979072-Placa_d_Espanya-Barcelona_Catalonia.html", "text": "Although it’s an extremely busy transport hub with main roads etc it still is quite a beautiful square, the buildings all around it and attractions are a beautiful site. I really enjoyed this square to look at although it is very busy and noisy.", "publishedDate": "2019-04-20", "language": "en", "rating": 4}, {"id": 667096948, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d591343-r667096948-Placa_d_Espanya-Barcelona_Catalonia.html", "text": "Go there on a Saturday evening. There will be a bunch of street performers and you will also get to enjoy the architecture.", "publishedDate": "2019-04-16", "language": "en", "rating": 4}, {"id": 666541261, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d591343-r666541261-Placa_d_Espanya-Barcelona_Catalonia.html", "text": "Free\nVisit Duration: 2 Hours (Including the Magic Fountain and attractions on the nearby)\n\nThis is a main stop for the Aerobus (Airport shuttle)\n\nPlaza España features Many attractions and places of interest:\n \n1- the Magic Fountain is a free beautiful display of water, lights and music.\n\n2-The Towers - Two square, red brick towers frame the southern end of the plaza at the avenue to the Palau Nacional. Once through the towers, a grand avenue lined with fountains and terraces leads to the stately Palau National. \n\n3-Parc de Joan Miró - A lovely park.", "publishedDate": "2019-04-14", "language": "en", "rating": 4}, {"id": 665456637, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d591343-r665456637-Placa_d_Espanya-Barcelona_Catalonia.html", "text": "Really impressive the scenario from the 2 towers to the stairs to reach the Museum of Art. Everything inside the traffic of the city center, composing architecture and every day life and history.", "publishedDate": "2019-04-11", "language": "en", "rating": 5}, {"id": 664979270, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d591343-r664979270-Placa_d_Espanya-Barcelona_Catalonia.html", "text": "After long walks, a great visit to the museum at the top of the hill... this vista and walk down into the city with huge water features and interesting architecture and history was the perfect end to the day. We had seen this from the bus the first day we arrived and were very happy to have included it within are itinerary.", "publishedDate": "2019-04-09", "language": "en", "rating": 5}, {"id": 664057449, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d591343-r664057449-Placa_d_Espanya-Barcelona_Catalonia.html", "text": "Absolutely stunning place with so much aesthetics. \n\nFelt a bit like Po from Kung Fu Panda climbing all those stairs!\n\nWorth it for the sights tho!", "publishedDate": "2019-04-05", "language": "en", "rating": 4}, {"id": 662311678, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d591343-r662311678-Placa_d_Espanya-Barcelona_Catalonia.html", "text": "We got off the Metro here to catch a bus to Montjuic Castle, we were amazed to find such a big open square and roundabout (very busy with traffic) with big monument in the middle which I've since found out has a fountain but we didn't see this working when there. It's a big transport system hub with main roads, Metro, train, buses; we noticed that this is where the bus stop is for the airport. Facing the roundabout is arena de barcelona; we could see people walking around on top but didn't have time to explore it, I looked it up afterwards and found out that this was previously a bullfight area, but is now a shopping mall and has restaurants. Some great views, worth at least a walk through but I'm guessing that there's probably more to see/explore than we noticed passing through.", "publishedDate": "2019-03-30", "language": "en", "rating": 4}, {"id": 659619454, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d591343-r659619454-Placa_d_Espanya-Barcelona_Catalonia.html", "text": "Very Nice square.... And the magic fountain it's fantastic.....\nThe View is superb..... \nAll You need it'w just go to see it....!", "publishedDate": "2019-03-19", "language": "en", "rating": 5}, {"id": 659534425, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d591343-r659534425-Placa_d_Espanya-Barcelona_Catalonia.html", "text": "Any time I can get an elevated view of an area I am happy. A tower, a platform, anything, and this area was a surprise from whence we could ascend the Arena for views of the area. Lovely. There are quite a few attractions in this area to keep you busy as well as being a gateway to Parc Montjuic. Would definitely return.", "publishedDate": "2019-03-19", "language": "en", "rating": 5}, {"id": 658492622, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d591343-r658492622-Placa_d_Espanya-Barcelona_Catalonia.html", "text": "Beautiful square at a few steps from our hotel. many important roads crossing here, but especially I loved the show of the fountains with music and lights. Amazing", "publishedDate": "2019-03-14", "language": "en", "rating": 5}, {"id": 658043664, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d591343-r658043664-Placa_d_Espanya-Barcelona_Catalonia.html", "text": "Great transport hub with a wonderful view down to the fountain and Montjuic. Nice street with so much to see and do along the way", "publishedDate": "2019-03-12", "language": "en", "rating": 5}, {"id": 657891328, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d591343-r657891328-Placa_d_Espanya-Barcelona_Catalonia.html", "text": "Wow... The view of the site is spectacular from the steps of the MNAC museum, definitely a must see. you can not go wrong in the area", "publishedDate": "2019-03-11", "language": "en", "rating": 5}, {"id": 653699391, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d591343-r653699391-Placa_d_Espanya-Barcelona_Catalonia.html", "text": "Nice place to walk around in , great area for taking a picture of the muceo nacional, too bad many street vendros hawking their wares ", "publishedDate": "2019-02-20", "language": "en", "rating": 4}, {"id": 652722679, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d591343-r652722679-Placa_d_Espanya-Barcelona_Catalonia.html", "text": "We attended a big festival in this park -  the Merce festival 2018 and the place was really jammed pack, music, fountain show and fireworks were really awesome..The following day we came back and explore the Plaza...LOVELY...you sit on top and look at the skyline, the busy Spanish district and the magical sunset.  ", "publishedDate": "2019-02-16", "language": "en", "rating": 5}, {"id": 650934565, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d591343-r650934565-Placa_d_Espanya-Barcelona_Catalonia.html", "text": "My husband and I was trying out the best route to get to the airport without a hitch. Google map indicated that we needed to get off at plaza espanya and catch the A1 bus to El prat. We were happy to come upon this place because the rotunda and the scenery was quite picturesque around this place. There were so many camera worthy sights there!", "publishedDate": "2019-02-08", "language": "en", "rating": 5}, {"id": 650166510, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d591343-r650166510-Placa_d_Espanya-Barcelona_Catalonia.html", "text": "not a far walk from the port area. the large columns from the world fair were very nice it is worth the walk to the top of the hill for the art museum as well\n ", "publishedDate": "2019-02-04", "language": "en", "rating": 4}, {"id": 650007530, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d591343-r650007530-Placa_d_Espanya-Barcelona_Catalonia.html", "text": "The first place I land myself in when I came to the city from the airport on airport bus. There's a museum nearby where you can oversee the city view when you go up the steps. It is also near the Olympic park and stadium. ", "publishedDate": "2019-02-03", "language": "en", "rating": 5}, {"id": 649772321, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d591343-r649772321-Placa_d_Espanya-Barcelona_Catalonia.html", "text": "This square is a good meeting place. There are buses from the airport and taxi rides to the square. There are also a couple of metro stops. There are tall buildings on the square, the El Corte Inglés shopping center and in January there were just no traffic jams. The fountain was beautifully lit. From the street next to La Rambla (Avinguda del Portal de l'Àngel) you will find good shops.", "publishedDate": "2019-02-02", "language": "en", "rating": 3}, {"id": 647457043, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d591343-r647457043-Placa_d_Espanya-Barcelona_Catalonia.html", "text": "This is a great place to stay near. The train and metro is right there for your trip to Monserrat. Also go into the old bull ring which is now a shopping mall with restaurants on top and a nice view. We were at xmas and they had this very cool interactive floor in the middle that was fantastic for kids. Good food at the top.", "publishedDate": "2019-01-21", "language": "en", "rating": 5}, {"id": 646078242, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d591343-r646078242-Placa_d_Espanya-Barcelona_Catalonia.html", "text": "Very cool spot. Fountains were beautiful. We caught a show with large puppets they had there for Christmas that was incredible.", "publishedDate": "2019-01-15", "language": "en", "rating": 5}, {"id": 645427674, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d591343-r645427674-Placa_d_Espanya-Barcelona_Catalonia.html", "text": "Spent New Year's Eve with the crowds in Placa Espanya. Saw the fireworks, music, and fountain show. A lot of happy people but relatively well behaved crowd with kids, families, couples, etc. Make sure you have 12 grapes handy to celebrate the new year.", "publishedDate": "2019-01-12", "language": "en", "rating": 5}, {"id": 645419617, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d591343-r645419617-Placa_d_Espanya-Barcelona_Catalonia.html", "text": "An absolutely amazing place to celebrate the New Year coming in. The place is packed with people and I wish I'd set off to the celebrations a little earlier but I still managed to squeeze into a central place for the countdown & fireworks! It was magical with the ball drop, light projections, fireworks & lots of people taking part in the traditional eating of a grape per chime at midnight - lovely community feel. \n\nAlcohol was allowed on the night, although for safety reasons people were having glass bottles taken away/ decanted into plastic cups.\n\nTop Tip: Plan ahead, if you want to take part in a midnight toast or traditional grape eating, take your things with you. Many people sell refreshments at the event but at extortionate rates and for the most part are not official vendors.", "publishedDate": "2019-01-12", "language": "en", "rating": 5}]}}]