[{"locationId": 8734190, "name": "Jardins de La Tamarita", "placeType": "ATTRACTION", "reviewListPage": {"reviews": [{"id": 617405300, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d8734190-r617405300-Jardins_de_La_Tamarita-Barcelona_Catalonia.html", "text": "Happened to stop by this park whilst on the tourist bus, and was pleasantly surprised by what we found. We were lucky that the gardens were almost empty and we had them to ourselves. They're incredibly romantic to walk around and take in the sculptures and the gardens. Such a pleasant stroll, thinking about it makes me wish I was there now.", "publishedDate": "2018-09-17", "language": "en", "rating": 5}, {"id": 570092824, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d8734190-r570092824-Jardins_de_La_Tamarita-Barcelona_Catalonia.html", "text": "This public park (free access) is a lovely garden to amble through admiring nature, tall oak trees and even a green house with exotic plants. Built around a mansion of a rich noble in the early 20th century it was abandoned and only in 1993-94 was it converted into a lovely public space like a green oasis in the city of Barcelona. Divided into two areas the mansion gardens and the forest hollow it has a nice children play area. Not to miss the recreational garden designed by Rubio with fountains, hedges, sculptures. In front of the manor house are four unique statues named Asia, Africa, America and a Roman Genera in lieu of the statue of Europe, supposedly missing ! Varieties of trees and quiet walking paths make it ideal for a romantic walk while the play area offers families with children a hidden nest to reconnect with nature !", "publishedDate": "2018-04-01", "language": "en", "rating": 4}, {"id": 502540321, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d8734190-r502540321-Jardins_de_La_Tamarita-Barcelona_Catalonia.html", "text": "A nice walk apart from the noise, at a garden populated by sculptures and small water still ponds. It used to belong to a rich family from Barcelona and now it belongs to the city and Blanquerna University. \nif you happen to come nearby, don't miss this time-space walk in the \"woods\".", "publishedDate": "2017-07-16", "language": "en", "rating": 3}, {"id": 351285772, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d8734190-r351285772-Jardins_de_La_Tamarita-Barcelona_Catalonia.html", "text": "Access is free.  It is located near the metro station on the way to the science museum.  The gardens are small with a few sculptures and fountains.  ", "publishedDate": "2016-02-27", "language": "en", "rating": 4}, {"id": 341145363, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d8734190-r341145363-Jardins_de_La_Tamarita-Barcelona_Catalonia.html", "text": "Tamarita gardens are an exceptional place to visit. With lot of decorative elements, nice statues, ponds and fountains, figures and vases it is a peaceful and remarkable park for quiet strolls or a leisured rest on one of the benches. A perfect place for a pause between visits of all the wonders of the city.", "publishedDate": "2016-01-19", "language": "en", "rating": 5}]}}]