[{"locationId": 9566855, "name": "Jardines de Joan Maragall", "placeType": "ATTRACTION", "reviewListPage": {"reviews": [{"id": 690353908, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d9566855-r690353908-Jardines_de_Joan_Maragall-Barcelona_Catalonia.html", "text": "One of the quieter, huge and most impressive set of Gardens in Barcelona. The waterfall fountain that flows down towards Avenue Montanyans is simply stunning. The Palace Albéniz is the official residence of the Spanish Royal Family during their stay in Catalonia. Sadly it's not open to the general public except on I think one day a year.\n\nBeautiful gardens and definitely worth visiting if around the Montjuic area.", "publishedDate": "2019-07-17", "language": "en", "rating": 4}, {"id": 674588480, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d9566855-r674588480-Jardines_de_Joan_Maragall-Barcelona_Catalonia.html", "text": "Jardines de Joan Maragall were created at the beginning of the twentieth century for the Spanish King! The palace which is on the grounds is actually a royal residence! The gardens are really beautiful with many features including water fountains, statues, various other sculptures, numerous plants and flowers, and lots of greenery.", "publishedDate": "2019-05-17", "language": "en", "rating": 5}, {"id": 576214794, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d9566855-r576214794-Jardines_de_Joan_Maragall-Barcelona_Catalonia.html", "text": "We went to the Castell beforehand (which I recommend). After, we kept looking around for a nice place to sit, relax and eat some. Took us quite some time, also because of wanting to go to the botanical gardens at first. Following long walking, we found this place which absolutely beautiful and quiet. Great spots to sit (benches or grass) and lots to see (old ornaments,trees etc). Go here when you need a break from the roaring and restless city.", "publishedDate": "2018-04-28", "language": "en", "rating": 5}, {"id": 546252890, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d9566855-r546252890-Jardines_de_Joan_Maragall-Barcelona_Catalonia.html", "text": "These gardens are a real wonder to visit them in any season. I decided to show it to some Galician friends who were visiting Barcelona for the first time and all of them have been amazed.\nIt is not a well-known place in the city but it is highly recommended to visit it.", "publishedDate": "2017-12-09", "language": "en", "rating": 5}, {"id": 476171970, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d9566855-r476171970-Jardines_de_Joan_Maragall-Barcelona_Catalonia.html", "text": "We have lived in Barcelona for several years, but just discovered the gardens today. What a hidden gem! We had never been before because they are only open Saturdays and Sundays, from 11:00 - 15:00. Definitely worth a visit!!!\nNote you can only exit and enter through one of the entrances. ", "publishedDate": "2017-04-16", "language": "en", "rating": 5}, {"id": 435965916, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d9566855-r435965916-Jardines_de_Joan_Maragall-Barcelona_Catalonia.html", "text": "Not crowded, for visitors opened just on exact hours(sat and sun 10am to 3 pm). Just be sure not to miss it if you are in Montjuic! Fountains, stairs, gardens and views! A small gem in Bcn! Absolutely lovely small park and for free!", "publishedDate": "2016-11-09", "language": "en", "rating": 5}, {"id": 429307344, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d9566855-r429307344-Jardines_de_Joan_Maragall-Barcelona_Catalonia.html", "text": "The Palauet is an amazing architectural jewel comparable to a very small scale Versailles which is still unknown to most tourists as it is not a site that the city promotes at all yet( wonder why).  The gardens are romantic and quiet, as somebody else said it is in fact, deserted by tourists an all you can hear are the birds singing and the leaves falling off the trees ( in autumnh . The place is an authentic little hidden paradise inside Barcelona, definitely a must in the Catalan capital!\n\nNote: The Palauet itself, meaning the interior or the palace, can only be visited once a year as it is a privet building -should I say monument!- but you definitely won't be disappointed visiting the site and the gardens any time of the year!", "publishedDate": "2016-10-18", "language": "en", "rating": 5}, {"id": 378344332, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d9566855-r378344332-Jardines_de_Joan_Maragall-Barcelona_Catalonia.html", "text": "Located just between the MNAC and the Olympic stadium, this garden is a gem as it is not only beautiful, but deserted by tourists.\nThe garden's entrance is located just a bit east of the Juan Samaranch museum and it's free. \nThe hours of operation are only Saturdays and Sundays, from 10:00 to 15:00", "publishedDate": "2016-05-31", "language": "en", "rating": 4}, {"id": 332880885, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d9566855-r332880885-Jardines_de_Joan_Maragall-Barcelona_Catalonia.html", "text": "This park is very quiet and peaceful. You can only go on weekends in specific hours. it's perfect to take a lot of pictures, In the Palacete Albéniz you can not go inside. From the park you have a nice sightseeing of the city.", "publishedDate": "2015-12-15", "language": "en", "rating": 5}]}}]