[{"locationId": 190634, "name": "Mercat dels Encants de Barcelona", "placeType": "ATTRACTION", "reviewListPage": {"reviews": [{"id": 731959904, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d190634-r731959904-Mercat_dels_Encants_de_Barcelona-Barcelona_Catalonia.html", "text": "This is the most unique flea market I have seen.  It mirror ceiling must be the only one in the world. The whole structure is very unique. All kinds of used items, antiques and new stuff.  The restaurants on the upper floor are very good and economical. A most visit place in Barcelona. Easy access via public transportation. Make sure to check the days they are open.", "publishedDate": "2019-12-10", "language": "en", "rating": 5}, {"id": 724975350, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d190634-r724975350-Mercat_dels_Encants_de_Barcelona-Barcelona_Catalonia.html", "text": "If you are into looking at piles and piles of flea market type stuff, this is for you. Wasn’t for me.", "publishedDate": "2019-11-08", "language": "en", "rating": 2}, {"id": 724315669, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d190634-r724315669-Mercat_dels_Encants_de_Barcelona-Barcelona_Catalonia.html", "text": "many many things but a few very interesting a lot of items are in the ground e are dirty the area is very big ", "publishedDate": "2019-11-05", "language": "en", "rating": 1}, {"id": 722756619, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d190634-r722756619-Mercat_dels_Encants_de_Barcelona-Barcelona_Catalonia.html", "text": "More housewares than fleamarket, lots of fabric stands and cheap clothing. The „antiquy“ stands are in Arab hands, and every bid started with €20, way overpriced and not worth it", "publishedDate": "2019-10-31", "language": "en", "rating": 2}, {"id": 717547406, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d190634-r717547406-Mercat_dels_Encants_de_Barcelona-Barcelona_Catalonia.html", "text": "But what do you expect? It’s a flea market, it all depends what interests you!! I collect lapel pins so thats great for me! There’s collections of lots of stuff and about people watching! Yeah some market traders try and rip you off we wanted a modern jesus figure and he said 50€ but were tight tbh so told him a straight no! The building is nice and modern, lots of soaps sweets toys etc! I personally think its worth the visit", "publishedDate": "2019-10-12", "language": "en", "rating": 4}, {"id": 713916938, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d190634-r713916938-Mercat_dels_Encants_de_Barcelona-Barcelona_Catalonia.html", "text": "Very poor, not worth the trip. looks like house clearance stuff and the stall holders are looking for top money for not so good stuff.", "publishedDate": "2019-09-29", "language": "en", "rating": 2}, {"id": 713378182, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d190634-r713378182-Mercat_dels_Encants_de_Barcelona-Barcelona_Catalonia.html", "text": "A long walk from the metro, and was stalls on two levels selling cheap clothes, new or second hand, a few junk stalls (won't rate them antique stalls), unless I was there on the wrong day, but don't think so - none of the guidebooks said to go on a particular day. Not open every day. Worth visiting only for amazing reflective roof, which photographers might like.", "publishedDate": "2019-09-27", "language": "en", "rating": 1}, {"id": 709423570, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d190634-r709423570-Mercat_dels_Encants_de_Barcelona-Barcelona_Catalonia.html", "text": "So many stalls, not all flea market stalls, there is something for everyone. I picked up a great extra carry on bag new for 2Euro.\nIt gets very hot but its worth looking around.", "publishedDate": "2019-09-13", "language": "en", "rating": 5}, {"id": 695132974, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d190634-r695132974-Mercat_dels_Encants_de_Barcelona-Barcelona_Catalonia.html", "text": "This place is pretty amazing. The roof which shelters the market is worth seeing even if you don´t like flea markets. But the flea market is amazing. So much stuff!", "publishedDate": "2019-08-03", "language": "en", "rating": 5}, {"id": 684927843, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d190634-r684927843-Mercat_dels_Encants_de_Barcelona-Barcelona_Catalonia.html", "text": "First, you can reach the market by using the metro. The stop is called Glories, on the L1 RED line and the metro stop is just a few feet across the intersection from Encants. \n\nAs others have noted, this is a three floor market covered up by an immense mirrored ceiling. The market is spread out. As you enter from the intersection, you’ll see a lot of home items such as cloth, small appliances, cosmetics, and other similar items. Look over the railing downstairs and you will see the fleamarket portion.\n\nThere are some bargains to be had such as cheap blouses for one Euro or pants, shorts, underwear, ladies intimates, tools, and some children’s items. And, yes, there are a couple of stalls that have sex toys and DVDs.\n\nThe whole thing takes place out of doors and it’s pretty hot here now. We bought relatively little for the two hours we spent at Encants.\n\nIf you find this review helpful or if you like the photos, could you please give me a thumbs up? You may also wish to check my reviews of other sites in Barcelona and other Spanish cities, Lisbon, Sintra, Porto, as well as cities in South America, southeast Asia, Australia and New Zealand.", "publishedDate": "2019-06-28", "language": "en", "rating": 3}, {"id": 677920481, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d190634-r677920481-Mercat_dels_Encants_de_Barcelona-Barcelona_Catalonia.html", "text": "If you like browseing or rummaging through bric a brac then this is the place for you.  There's a real vibe of a marketplace here, and its all housed under a reflective mirror roof.  There wasn't much wiggle room on the bargaining probably because its not a tourist place but a market for locals.  Cheap materials, shoes, clothes, books etc and a number of very over priced curio shops.  Three levels with spotlessly clean toilets on top floor by the food stalls and the units selling mattresses of all things.  Some very nice ironware.  My friend bought a bulls head with bell.  Ideal for the back door to summon the dogs.", "publishedDate": "2019-05-31", "language": "en", "rating": 3}, {"id": 673078590, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d190634-r673078590-Mercat_dels_Encants_de_Barcelona-Barcelona_Catalonia.html", "text": "This is one of the most original markets and contains the essence of buying and selling all kinds of low cost products. \nIts architectural structure shines through the reflections from its mirrors located under the immense roof that encloses it.\nOne of the tourist places that are a must visit in Barcelona.", "publishedDate": "2019-05-10", "language": "en", "rating": 5}, {"id": 666300695, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d190634-r666300695-Mercat_dels_Encants_de_Barcelona-Barcelona_Catalonia.html", "text": "It's a nice place. You can do your budget shopping. It's near to Gloria shopping centre so you will feel the price difference. The building is renovated which looks quite beautiful and tempting to visit this place. On the upper floor, you have restaurants which office delicious and cheap food. The food shop \"Stop & Mos\" was so wonderful and the owners they are so friendly and warm people.", "publishedDate": "2019-04-14", "language": "en", "rating": 5}, {"id": 657922723, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d190634-r657922723-Mercat_dels_Encants_de_Barcelona-Barcelona_Catalonia.html", "text": "OK, I was curious to go to a Spanish flea market.  I had high hopes it would contain lots of interesting sellers selling lots interesting, unique stuff.  But it's pretty much the same junk you'd find anywhere in the western world.  If you like that kind of thing, go.  But keep your expectations reasonable. \n\nOne plus--it's housed in an interesting structure and is close to a few other attractions.", "publishedDate": "2019-03-11", "language": "en", "rating": 3}, {"id": 657657387, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d190634-r657657387-Mercat_dels_Encants_de_Barcelona-Barcelona_Catalonia.html", "text": "Can stop by this market and then grab a snack at the nearby Design Museum cafeteria. Not worth making a special trip to this part of town just for this market, but fine if you are in the neighborhood.  \n", "publishedDate": "2019-03-10", "language": "en", "rating": 3}, {"id": 636960086, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d190634-r636960086-Mercat_dels_Encants_de_Barcelona-Barcelona_Catalonia.html", "text": "Just a flea market with lots of junk and cheap materials and fake goods (dulce kabana, versachi etc)  :p  was not worth the long walk but for those who like this kind of flea markets it could be ok.", "publishedDate": "2018-12-01", "language": "en", "rating": 2}, {"id": 631483435, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d190634-r631483435-Mercat_dels_Encants_de_Barcelona-Barcelona_Catalonia.html", "text": "I didn't have enough time to really see all the cool things at this flea market. You probably need a few hours at the least if you like to dig through old books and old dishes and such. The market has a little bit of everything - old and new, junk and true treasures, clothes and food. You name it, it's probably there. There are three levels that are accessible from ramps and a huge mirror is on the ceiling providing a unique view. ", "publishedDate": "2018-11-06", "language": "en", "rating": 4}, {"id": 630324196, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d190634-r630324196-Mercat_dels_Encants_de_Barcelona-Barcelona_Catalonia.html", "text": "Also called the Old Flea Market ( don't think there is a new one). What there is new about this bustling and somewhat chaotic place is the fantastic mirrored canopy outside.  The old flea market dates back to the Middle Ages and has been at this location since 1928.  Great to wander round.  Filled with junk and treasure often at the same place.  Watch your pocketbook and wallet please.  Excellent food ( try the octopus)", "publishedDate": "2018-11-02", "language": "en", "rating": 4}, {"id": 629109657, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d190634-r629109657-Mercat_dels_Encants_de_Barcelona-Barcelona_Catalonia.html", "text": "We stumbled across this market by chance and what a find , a real mixture of bootfair stalls to high end antiques . We discovered an incredible vintage light shop here the best we've  ever seen . It’s got a wonderful atmosphere and some lovely food outlets too . Can’t wait to revisit . ", "publishedDate": "2018-10-28", "language": "en", "rating": 5}, {"id": 626966719, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d190634-r626966719-Mercat_dels_Encants_de_Barcelona-Barcelona_Catalonia.html", "text": "A large flea market selling junk and rare finds, old and new.  Housed under a beautiful reflective roof.", "publishedDate": "2018-10-21", "language": "en", "rating": 4}, {"id": 624814132, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d190634-r624814132-Mercat_dels_Encants_de_Barcelona-Barcelona_Catalonia.html", "text": "We stay in a hotel nearby and was captivaed by the Architecture with the mirrored roof. We explored the site and was filled with bustling traders and was exciting to see the antiques. There's also food at the top where there was fired anchovies, calamari and octopus that I recommend ", "publishedDate": "2018-10-14", "language": "en", "rating": 3}, {"id": 607307238, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d190634-r607307238-Mercat_dels_Encants_de_Barcelona-Barcelona_Catalonia.html", "text": "This market is definitely for the bargain hunters. Held in a train station it has 3 levels worth of wares. Mostly junk but if you dont mind sifting through piles of second hand clothes and costume jewelry you might find a treasure. If you like antiques its a fun start to your morning :)", "publishedDate": "2018-08-17", "language": "en", "rating": 4}, {"id": 596118406, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d190634-r596118406-Mercat_dels_Encants_de_Barcelona-Barcelona_Catalonia.html", "text": "I love a good yard sale and searching for treasuress.  This was a great place to do that.  That large open area in the center of the market consists of vendors selling a variety of smaller antique items.  Some of the tables are more organized than others, but frankly, I prefer a messy table as the prices are usually more negotiable.  I love vintage desk clocks and there were so many to choose from.  I saw old books, cameras, silver, coins--small items perfect to stash in my suitcase.  The vendors are mostly Moroccan but they all speak English and are open to bargaining.  The first price the throw out is never the real price so feel free to haggle.  For example, a vendor wanted 20 euros for a clock. I immediately said no.  He kept asking, \"How much? How much?\" I said, \"I'll give you 5.\"  He took it with no hesitation.  I found the items here to be much cheaper than I could ever buy in the States.  I spent a few hours here on a Wednesday afternoon and it wasn't very crowded. Upstairs an on the periphery you'll find new goods but I wasn't interested in that kind of shopping. There are bathrooms on site and it is right next to the Glories metro station.  I actually walked here after visiting La Sagrada and the Bullfighting Museum.  It was relatively close.  I am a woman travelling alone, but felt safe in the market.  I just made sure to clench my bag in front of me at all times and never set anything down.  But this is the rule travelling anywhere.", "publishedDate": "2018-07-14", "language": "en", "rating": 5}, {"id": 575947290, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d190634-r575947290-Mercat_dels_Encants_de_Barcelona-Barcelona_Catalonia.html", "text": "The location is fine , opposite to the hotel is Gloria Mall, for shoppers &  good eatery options .Its nice to walk around & explore rich heritage ,older artistic constructions. its near to the museum walkaway distance to Sagrada Familia Cathedral church ", "publishedDate": "2018-04-26", "language": "en", "rating": 5}, {"id": 569496244, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d190634-r569496244-Mercat_dels_Encants_de_Barcelona-Barcelona_Catalonia.html", "text": "And what it ISN'T is Portobello Road or some other flea market where you can reliably find vintage treasures. Most stuff here is new. A lot is, as noted, Chinese--but that's because this is a flea market for day-to-day practical needs--it's rather like a gigantic Dollar Store.Vendors come in 3 varieties: those whose merchandise is dumped on a blanket, those who have actual stalls and those who have enclosed stores on the periphery of the market. The 'stores' are the ones that had the most interesting collectible/vintage/antique stuff.", "publishedDate": "2018-03-29", "language": "en", "rating": 5}, {"id": 566694951, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d190634-r566694951-Mercat_dels_Encants_de_Barcelona-Barcelona_Catalonia.html", "text": "This is a great place for those who like a bargain.  It is both a flee market as well as an ordinary market.  If you don't mind a good rummage among a mountain of clothes, you can pick up some well known lables for just 3E or 2 for 5E!  The socks and underwear on the market stalls are both cheap and as good quality as you will find in mid range stores.", "publishedDate": "2018-03-15", "language": "en", "rating": 5}, {"id": 560337978, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d190634-r560337978-Mercat_dels_Encants_de_Barcelona-Barcelona_Catalonia.html", "text": "Went here on the suggestion of a local we met at our neighborhood bar the night before. I'm always down for a good flea market. It was a Saturday, late afternoon and still bustling with activity. The ground level was largely made up of bric-a-brac and all kinds of random second-hand items. It was a mix of vendors who had neatly organized their goods on tables and those who looked to have dumped everything on the ground with no rhyme or reason. There were some decent finds, but be prepared to dig. The upper levels seemed to have mostly cheap imported goods.", "publishedDate": "2018-02-13", "language": "en", "rating": 3}, {"id": 552142527, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d190634-r552142527-Mercat_dels_Encants_de_Barcelona-Barcelona_Catalonia.html", "text": "This is a giant flea market. You will find new and second hand clothes, shoes, antiquities, and things of the sort. Everything is super cheap. For example: shoes for 20 euros, second hand winter coats for 5 euros, etc. ", "publishedDate": "2018-01-06", "language": "en", "rating": 4}, {"id": 545499695, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d190634-r545499695-Mercat_dels_Encants_de_Barcelona-Barcelona_Catalonia.html", "text": "Is very large building lots of stalls old and new things make up clothes. Antique stalls if you like carboots it’s the place to go upstairs places to eat .if you don’t like a rummage it’s not a place to go .i enjoyed it and would go back.", "publishedDate": "2017-12-06", "language": "en", "rating": 4}, {"id": 537089324, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d190634-r537089324-Mercat_dels_Encants_de_Barcelona-Barcelona_Catalonia.html", "text": "The flea market offers wide range of products and the building itself is worthy of being visited! I came across coin sellers and vintage postcards!", "publishedDate": "2017-10-30", "language": "en", "rating": 4}, {"id": 529914196, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d190634-r529914196-Mercat_dels_Encants_de_Barcelona-Barcelona_Catalonia.html", "text": "Don't come hear expecting designer shops or air conditioning, but if you need some cheap clothes to cover for lost luggage then it's perfect.  I found several reasonably nice shirts for 6 euros each. Not a lot of English around but the prices are clearly marked (no need for haggling) and card machines are available. ", "publishedDate": "2017-10-04", "language": "en", "rating": 5}, {"id": 528103816, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d190634-r528103816-Mercat_dels_Encants_de_Barcelona-Barcelona_Catalonia.html", "text": "While the treasures were there for those that like to rummage, I was taken aback by how filthy the market was: garbage everywhere, grimy. With such a stunning roof (worth a look), the dirt and trashy junk for sale were a turnoff. ", "publishedDate": "2017-09-28", "language": "en", "rating": 2}, {"id": 528102598, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d190634-r528102598-Mercat_dels_Encants_de_Barcelona-Barcelona_Catalonia.html", "text": "I love an outdoor, authentic market where I can connect with locals and rummage for treasures as much as the next person, but this market was surprisingly filthy. Not just well-warn, but really dirty: garbage everywhere, junky and dark. The building itself is worth is a 'drive-by' peek but keep on moving; nothing to see there. So many other more worthwhile things to see in Barcelona.", "publishedDate": "2017-09-28", "language": "en", "rating": 2}, {"id": 522379243, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d190634-r522379243-Mercat_dels_Encants_de_Barcelona-Barcelona_Catalonia.html", "text": "Wouldn't bother going, was a complete waste of time. All we saw was items that looked like they should have been thrown away. There are a few shops on the top floor that sell antiques and food but we didn't bother to look in them ", "publishedDate": "2017-09-07", "language": "en", "rating": 1}, {"id": 521069977, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d190634-r521069977-Mercat_dels_Encants_de_Barcelona-Barcelona_Catalonia.html", "text": "The setting of this flea market is pretty amazing under a modern mirrored ceiling . Our teens enjoyed the rummage in the clothes stalls at 1 euro a piece and my husband liked all the stalls with tools . ", "publishedDate": "2017-09-04", "language": "en", "rating": 4}, {"id": 516356245, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d190634-r516356245-Mercat_dels_Encants_de_Barcelona-Barcelona_Catalonia.html", "text": "I am so glad I visited Mercat dels Encants, such an interesting market. You can find very cool things and not so cool things. Good bargains and expensive things. Very interesing ceiling also.", "publishedDate": "2017-08-22", "language": "en", "rating": 5}, {"id": 509024188, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d190634-r509024188-Mercat_dels_Encants_de_Barcelona-Barcelona_Catalonia.html", "text": "What a great market! It is a combination of flea market with a number of stalls selling second hand goods and collectables and other stalls selling new items like electronics, material, clothing and household items, it also has a small section of around five food outlets on the upper floor and a Resturant on the bottom in the corner, this market is huge and all undercover so is not affected by the heat of the day, it is open 9-8 a number of days a week and is a great place to grab a bargain or a collectable!  Only downsides are it gets very busy, it's difficult to get to via public transport and also considering it's a market some stall holders (antiques and collectables) prices were very high and they seemed reluctant to barter! Would recommend coming though and was worth the trip!", "publishedDate": "2017-08-05", "language": "en", "rating": 5}, {"id": 504326658, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d190634-r504326658-Mercat_dels_Encants_de_Barcelona-Barcelona_Catalonia.html", "text": "I visited on my last day in Barcelona as I was looking for something interesting to do, and to pick up some gifts. \nIt is near a large shopping mall at a metro stop, near a famous building called the bullet (I think). \nIt is covered by a large metal roof which has a creative design. But it is an outdoor market space. On the top level there is a regular market with stalls and kiosks selling clothes, shoes, fabrics, bags, trinkets etc. \nBut on the main ground floor, which is the largest, there is a flea market with lots of haggling and noise and great atmosphere. One stall has shampoo and toiletries, the next has old books and records, the next has vintage ornaments...if I was a local I would probably come here a lot!", "publishedDate": "2017-07-21", "language": "en", "rating": 5}, {"id": 502349847, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d190634-r502349847-Mercat_dels_Encants_de_Barcelona-Barcelona_Catalonia.html", "text": "Like all flea markets, you can find interesting things depending on time, dates or your interest. It's in a nice architectonic building with mirrors rooftop. We found many vinyl records and even bought few vinyl singles. Not far from it is the design museum and the glories mall so you can spend a nice alternative day in Barcelona.\n\n", "publishedDate": "2017-07-15", "language": "en", "rating": 5}, {"id": 502272986, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d190634-r502272986-Mercat_dels_Encants_de_Barcelona-Barcelona_Catalonia.html", "text": "The Merchat dels Encants is a flea market mostly frequented by locals. There are some antiquities as well as a number of merchants selling second-hand / vintage clothes, shoes, etc... Overall it is worth a quick visit mostly to look at the interesting structure (with roof mirrors reflecting the market), immerse yourself and the ambience and maybe find a couple of bargains. Personally I was interested to find some vintage cameras, there were a few but overall not in a very good state and the price was not compelling (I can probably find better deals on eBay) - of course my Spanish is not good enough to bargain so a native speaker may have a better chance.", "publishedDate": "2017-07-15", "language": "en", "rating": 3}, {"id": 501499572, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d190634-r501499572-Mercat_dels_Encants_de_Barcelona-Barcelona_Catalonia.html", "text": "If you visit Barcelona you can not forget this place, live life at ground level (a very interesting market) and look at it to the sky (a glass roof with reflections very suitable to take several photos, as these I attach here). It is definitely a worthwhile destination", "publishedDate": "2017-07-12", "language": "en", "rating": 4}, {"id": 500404840, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d190634-r500404840-Mercat_dels_Encants_de_Barcelona-Barcelona_Catalonia.html", "text": "We were staying in a hotel that was walking distance from here, so we visited the market on our last day before our late afternoon train. \nThere were many people and so many cheap antiques and goods. If you know what you are doing, I guess you can score some good stuff here. If you don't like shopping from messy sales section.... don't even go here. You will only get stressed out. \nWe ended up buying two really cheap carry-on suitcases for 10euro each. Well, they weren't meant to last, but we just needed something to stuff our stuff we got during the trip. Those bags safely made it home in one piece, so I guess 10 euro was really good. I also got a really cute real fur jacket there. I bargained heavily (you should definitely bargain there for anything you buy unless you think the price is reasonable to begin with) for it, and both the seller and me were happy at the end. \nI don't think this place is really worth a visit unless you are in the neighborhood. Spend more time in Barri Gothic and El Born instead of coming all the way here unless you are an international antique collector or you have ample time to spend in Barcelona.", "publishedDate": "2017-07-10", "language": "en", "rating": 4}, {"id": 499277296, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d190634-r499277296-Mercat_dels_Encants_de_Barcelona-Barcelona_Catalonia.html", "text": "Nearby the Agbar Tower in Plaça de las Glorias is a unique modern shiny roof structure housing one of Europe's oldest markets.  Closed Tuesdays & Sundays, the multi-level market has the chaos and intrigue of a giant flea market full of antiques, treasures, art, second hand junk, textiles, tools, toys, hardware, clothing, home furniture and decorations and just about anything else you can imagine.  There are food counters for a snack or refreshing drink. Not for everyone, but  we enjoyed our time here.", "publishedDate": "2017-07-06", "language": "en", "rating": 4}, {"id": 495243620, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d190634-r495243620-Mercat_dels_Encants_de_Barcelona-Barcelona_Catalonia.html", "text": "LOTS to see and potentially buy.  Most of the stuff is junky and weird.  Most of the prices are negotiable.  I didn't see anything worth buying.  Tapas and food was average upstairs.", "publishedDate": "2017-06-22", "language": "en", "rating": 4}, {"id": 491651492, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d190634-r491651492-Mercat_dels_Encants_de_Barcelona-Barcelona_Catalonia.html", "text": "I don't have any planning for encants Market, due to I am a free style traveller, when I passing encants I really attracted by their architecture a huge and shining roof top, when I drop of by bus and get inside this architecture, Oh surprise !! That is a market, you can find everything economically over there, home decoration, clothes, antique, Vinyl Records etc........ it's really a place you can use half day for explore. And there are several food counter over there, quality just so so but better than nothing to eat. But in encants just enjoy on Treasure hunt.", "publishedDate": "2017-06-08", "language": "en", "rating": 5}, {"id": 490775862, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d190634-r490775862-Mercat_dels_Encants_de_Barcelona-Barcelona_Catalonia.html", "text": "I enjoyed the time at the Encants Barcelona flea market.  But I did not buy anything, so I guess there weren't any bargains that I could not pass up.  The standard items where there, clothes, tooks, lots of gadgets, along with some nicer antiques and other items, anyone need a folding bike with a motor?  Overall it was a fun day digging through the booths and to see what types of items are for sale at one of the oldest flea markets.", "publishedDate": "2017-06-05", "language": "en", "rating": 4}, {"id": 490431127, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d190634-r490431127-Mercat_dels_Encants_de_Barcelona-Barcelona_Catalonia.html", "text": "This market is the oldest in Europe. The new facility is fabulous, with ramps leading you around to each new level. Stalls are grouped together, making it easy to locate what you are looking for. There is everything from sheets on the ground with odd used items to new clothing and accessories. Also look for small items of architecture interest and all sorts of electrical devices and parts. No food here, but plenty of other opportunities for that across Barcelona. Closest Metro is Glories. You may end up with a an odd route ot arrive by Metro, but the closest access to the market. Allow 2-3 hours, depending on your interest in a rummage.", "publishedDate": "2017-06-04", "language": "en", "rating": 5}, {"id": 485270870, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d190634-r485270870-Mercat_dels_Encants_de_Barcelona-Barcelona_Catalonia.html", "text": "Was looking to find a flea market. Went to a few other places, but this is the best place to find a wide range of antiques, clothes, junk, etc.  Found a couple great pieces that I was very happy about.   There is so much stuff you need to stay at least a couple hours.", "publishedDate": "2017-05-18", "language": "en", "rating": 5}, {"id": 482107612, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d190634-r482107612-Mercat_dels_Encants_de_Barcelona-Barcelona_Catalonia.html", "text": "If you're a local, then you would definitely be able to navigate the place better and maybe find some hidden gems. ", "publishedDate": "2017-05-06", "language": "en", "rating": 2}, {"id": 480143651, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d190634-r480143651-Mercat_dels_Encants_de_Barcelona-Barcelona_Catalonia.html", "text": "This is a good activity if you have a lot of time and will give you an interesting perspective of a flea market in Europe.  We actually purchased a toaster for our Air BNB for 12 Euros and a deck of cards.  This place has everything including the kitchen sink!!!", "publishedDate": "2017-04-30", "language": "en", "rating": 4}, {"id": 478019328, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d190634-r478019328-Mercat_dels_Encants_de_Barcelona-Barcelona_Catalonia.html", "text": "Do you like antiques? fabrics? clothes? This vintage market is open to all visitors from 09:00-20:00 mon, wed, fri, sat. And you can find anything from hardware to kitchen utensils. The shop selling geeky trivia was a personal favourite.\n\nExcellent for shopping for souvenirs, if you are tired of souvenirshops.", "publishedDate": "2017-04-22", "language": "en", "rating": 5}, {"id": 469474088, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d190634-r469474088-Mercat_dels_Encants_de_Barcelona-Barcelona_Catalonia.html", "text": "The Encants is a flea market with a strong local flavour, but to tell the truth, I was a bit disappointed. One of the things I liked most was the place itself which has a beautifully designed contemporary architecture, with tall pillars and an audacious glass canopy covering the market. As far as the contents are concerned, there are many stalls selling the usual things: low cost textiles, sneakers and so on... nothing special. More interesting are the stalls dedicated to old ítems, but you can only see something interesting every now and then, most of it is just old stuff, sometimes curious items, but don´t expect handcraft or valuable antiquities. I guess the interest of this might vary much depending on the day you go. The surroundings have some places of interest like the Torre Agbar and the Catalan National Theatre or the Auditori , but most of them are areas that are being developed now, so there is a lot of works going on, slopes and cranes. The main appeal of the Encants are the chance to get some local flavour and the atmosphere that these places have, but I wouldn´t recommend to go there in an excursion on purpose -is a bit away from most points of interest in the city- especially if you´re a bit short of time on your visit to Barcelona.", "publishedDate": "2017-03-22", "language": "en", "rating": 3}, {"id": 464883147, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d190634-r464883147-Mercat_dels_Encants_de_Barcelona-Barcelona_Catalonia.html", "text": "A LOT of things. be patient and take time to look around l : ) antiques, jeweleries, old books, no foods though ", "publishedDate": "2017-03-05", "language": "en", "rating": 5}, {"id": 462880214, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d190634-r462880214-Mercat_dels_Encants_de_Barcelona-Barcelona_Catalonia.html", "text": "This covered market is a great place to browse the antiques and look for bargains on a number of everyday items. Great place to spend a few hours. ", "publishedDate": "2017-02-26", "language": "en", "rating": 5}, {"id": 457187663, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d190634-r457187663-Mercat_dels_Encants_de_Barcelona-Barcelona_Catalonia.html", "text": "after reading many reviews on this flea market we went with an open mind, but we were not in any way disappointed, for us it was vibrant and interesting, we mixed with the locals and bought many things from the haberdashery stalls, which we found to be of fantastic value, we live in France where things like a thread can be very expensive. as we meandered our way up the slopes we were rewarded at the top with a lovely green tea from the Healthfood snack bar, this market is a must for anyone who just loves to rummage and haggle and is clearly a place for the locals with very few tourists.", "publishedDate": "2017-02-04", "language": "en", "rating": 5}, {"id": 457146701, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d190634-r457146701-Mercat_dels_Encants_de_Barcelona-Barcelona_Catalonia.html", "text": "Lots of cheap items for sale. Good prices on fabric... I would visit as a local for some deals on everyday items, but not a tourist stop. We happened upon the market exiting the Metro for Glories shopping center, not an intentional visit but it looked interesting so we stopped. We did get my daughter a Mardis Grad mask we had been searching for, so ended up being a value visit. ", "publishedDate": "2017-02-04", "language": "en", "rating": 2}, {"id": 454771448, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d190634-r454771448-Mercat_dels_Encants_de_Barcelona-Barcelona_Catalonia.html", "text": "I was expecting a little more of a handcraft market, so it was very disappointing to me.\nIf you enjoy antique stuff you will like it. There is a mixture of these vintage products and made in China stuff.\nBut to whom is interested in these specific products it may be a nice thing.", "publishedDate": "2017-01-25", "language": "en", "rating": 2}, {"id": 442262859, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d190634-r442262859-Mercat_dels_Encants_de_Barcelona-Barcelona_Catalonia.html", "text": "Upstairs you find stalls full of e.v.e.r.y.t.h.i.n.g you can dream of and downstairs on the center floor you will find antiques, knic knacs and everything else.\n", "publishedDate": "2016-12-05", "language": "en", "rating": 4}, {"id": 438167124, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d190634-r438167124-Mercat_dels_Encants_de_Barcelona-Barcelona_Catalonia.html", "text": "Wow!  First of all, the structure is worth the trip in and of itself.  Encants is one of the oldest flea markets in Europe, and it is outfitted with an aluminum-zinc angular mirrored roof!  Look up, and you will be mesmerized!  There are hawkers galore, and something like 100,000 visitors a week, mostly locals.  There are mountains of shoes.  If you like one, you have to attempt to find the other.  School supplies galore.  Vintage clothing and jewelry if you have the patience to peruse.  There was an enormous collection of empty dusty wine bottles.It's a great place to people watch, and you just might find something to buy.", "publishedDate": "2016-11-17", "language": "en", "rating": 5}, {"id": 429708992, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d190634-r429708992-Mercat_dels_Encants_de_Barcelona-Barcelona_Catalonia.html", "text": "The market is housed under a huge mirrored roof that has to be 3/4 storeys high. Around the outside the stalls are set out which allows you to walk around stalls gaining high as you go. The ground floor central area is full of junk and 'antique' sellers. On the first and upper floors there are clothes, bags, electrical, tools etc etc. There is also food stalls on the top floor all in one area with seating. Whether you like markets or not the building is well worth a look.", "publishedDate": "2016-10-19", "language": "en", "rating": 5}, {"id": 423829077, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d190634-r423829077-Mercat_dels_Encants_de_Barcelona-Barcelona_Catalonia.html", "text": "This is a big flea market (I guess \"antiques\" might be included) plus lots of stalls selling new (cheap) stuff.  Packed full of locals, not so many tourists.  We cycled there, its not far past the Arc de Triomf (I think Monumental is nearest metro).  THe best thing about this was the stunning building - the roof is about 100ft above the market, and is mirrored, with mirrors at all sorts of different angles.  Could have spent a good couple of hours browsing around (there are places to get food and toilets downstairs).", "publishedDate": "2016-09-30", "language": "en", "rating": 5}, {"id": 420170998, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d190634-r420170998-Mercat_dels_Encants_de_Barcelona-Barcelona_Catalonia.html", "text": "This place is the largest flea market in Barcelona and has a ton of vendors selling organic soaps, jewelry, furniture, clothing, adult movies, toys and junk! Yes, junk. The inner part of this shopping area seems to be where the \"junk\" is and the better products are on the outer edges of the venue.  Of course, you can definitely find some cool stuff mixed in with the \"junk,\" but I saw a lot of old books with yellow pages and missing covers; they should've just been recycled, and dolls with no clothes and missing limbs.  I initially thought this place was a waste of time, but I ended up finding some nice organic soaps made in France and some nice jewelry (two necklaces and one ring).  There are several floors and you can get to them by walking or using an escalator.  The top floor has a food court with various types of food.  I didn't eat here, but many of the food options looked good, and had reasonable prices.  There are also bathrooms on-site that are clean.  This place is only open on Monday, Wednesday, Friday and Saturday from 9am to 8pm on all days.  I'd suggest this place if you find yourself with some extra time while visiting Barcelona.  My husband and I went here after being in Barcelona for about a week.  We had already seen all of the main attractions, so this was just a bonus place to see.  We spent about 2 hours walking through this place.  You could spend more or less time here depending on what catches your eye.", "publishedDate": "2016-09-19", "language": "en", "rating": 3}, {"id": 419663210, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d190634-r419663210-Mercat_dels_Encants_de_Barcelona-Barcelona_Catalonia.html", "text": "Be prepared this place is heaving whith people and stalls. Its massive and a lot of the stalls are on the floor and you have to rummage, the goods on offer are old and new a lot of stall holders do not want to haggle all in all an experience not to pass up.", "publishedDate": "2016-09-17", "language": "en", "rating": 5}, {"id": 418995695, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d190634-r418995695-Mercat_dels_Encants_de_Barcelona-Barcelona_Catalonia.html", "text": "One of best open markets I ever visited just a great city design and architecture, not the best shopping but very unique and great view of the Torre Agbar building ", "publishedDate": "2016-09-15", "language": "en", "rating": 5}, {"id": 418132453, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d190634-r418132453-Mercat_dels_Encants_de_Barcelona-Barcelona_Catalonia.html", "text": "Spectacular mirrored roof on a spiral building.\nThe ground floor stalls are mostly 'car boot' type sellers, lots of bric a brac, toys and clothing. \nAs the building spirals, traders are more professional, with lock up storage units. Lots of great bargains, I bought lots of fabrics,€2-€3 per metre, and buttons.\nWorth going right to the top for the cafes and photos of the roof and views.", "publishedDate": "2016-09-13", "language": "en", "rating": 4}, {"id": 416744311, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d190634-r416744311-Mercat_dels_Encants_de_Barcelona-Barcelona_Catalonia.html", "text": "Must go especially at the time when the flea markets are on! Crazy selection of antiques and odd bits and pieces. Definitely worth going just for the experience. Beautiful building too!", "publishedDate": "2016-09-10", "language": "en", "rating": 5}, {"id": 406705728, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d190634-r406705728-Mercat_dels_Encants_de_Barcelona-Barcelona_Catalonia.html", "text": "Nice market. Go here if you have seen the highlights of Barcelona and you have some time left. Nice to just walk around and to see the local salesmen do their work.", "publishedDate": "2016-08-17", "language": "en", "rating": 4}, {"id": 405310180, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d190634-r405310180-Mercat_dels_Encants_de_Barcelona-Barcelona_Catalonia.html", "text": "I love vintage & cheap items with value... The first time I discover this place is when the traders are still in a open air like field or vacant lot 4 years ago then I'm surprise when I came back to live in Spain for good 2 years ago the Mercat is very iconic now super high ceiling mirror signature ... A lot of people taking picture of them throw the mirror reflection ceilings, I love this place I got a lot of items here... Most of the vendors know me already.. They open every Monday, Wednesday , Friday & Saturday... It's very accessible place....here I found most of my good finds..wish for more...BBV", "publishedDate": "2016-08-14", "language": "en", "rating": 5}, {"id": 401889646, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d190634-r401889646-Mercat_dels_Encants_de_Barcelona-Barcelona_Catalonia.html", "text": "I don't know what's more mesmerizing; staring at the mirrored angular ceiling, or the sea of typical flea market vendors below.  Complete mix of products; new, used, some antiques, lots of junk. Saw a lot of stuff similar to the 'antique' stalls that are at the main cathedral in the gothic quarter, but at 1/3  to a 1/4 of the price. Wife and I ended up buying some pretty cool souvenirs at really fair prices. Mainly locals shopping here, and I did not see even one stall selling the regular tourist kitsch.  Two vendors that stick out: a toy store with every single action and cartoon figure imaginable in all sizes, and a stall selling all kinds of old brass and iron bells and door knockers. Eat before or after somewhere else, the food court was terrible. ", "publishedDate": "2016-08-05", "language": "en", "rating": 4}, {"id": 399462140, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d190634-r399462140-Mercat_dels_Encants_de_Barcelona-Barcelona_Catalonia.html", "text": "When I hear flea market, I expect people who have junk and knick  knacks for sale, maybe a few similar items but usually old white elephant type of stuff.\n\nThis is Definately more of new merchandise market, with fixed prices and very little treasure to find.\n\nNot really worth the trip", "publishedDate": "2016-07-31", "language": "en", "rating": 3}, {"id": 396467250, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d190634-r396467250-Mercat_dels_Encants_de_Barcelona-Barcelona_Catalonia.html", "text": "Barcelona's flea market find nearby Glorias Square shopping center with a huge number of options for entertainment: shopping, various stalls and cafes.\nWorth a visit.", "publishedDate": "2016-07-24", "language": "en", "rating": 5}, {"id": 394320980, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d190634-r394320980-Mercat_dels_Encants_de_Barcelona-Barcelona_Catalonia.html", "text": "This was good shopping for us. We found great values among other stuff that probably nobody needs. Haggling is required which is uncomfortable for me. Fantastic fun walking the aisles and trying to figure out how much I could fit in the suitcase. then go to the bar upstairs and have a very cold beer and great tuna. Wonderful memory.", "publishedDate": "2016-07-19", "language": "en", "rating": 5}, {"id": 371415885, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d190634-r371415885-Mercat_dels_Encants_de_Barcelona-Barcelona_Catalonia.html", "text": "I think a lot of people would be disappointed by Encants.  It does have some antiques and old items and you can barter.  The problem is most of the market isn't a flea market.  It's small professional booths selling various housewares, tools, fabric, electronics, helmets, lighting, and anything else a person needs.  So it's not a traditional flea market.  Still it's a beautiful space, it's outdoors, and if you have a keen eye you can find some good antiques. ", "publishedDate": "2016-05-09", "language": "en", "rating": 4}, {"id": 370466481, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d190634-r370466481-Mercat_dels_Encants_de_Barcelona-Barcelona_Catalonia.html", "text": "When in Barcelona, a visit to the Mercat dels Encants is a must. The large market is split over two levels and features all sorts of goods. New things and used things, and just about anything you can think off. The market is a busy beehive of people doing their shopping and site seeing. The market is next to the Metro station Glòries. The Metro line to use is the Línia L1 running from Hospital de Bellvitge to Fondo.\n\nEnjoy!", "publishedDate": "2016-05-05", "language": "en", "rating": 4}, {"id": 369747963, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d190634-r369747963-Mercat_dels_Encants_de_Barcelona-Barcelona_Catalonia.html", "text": "This market sells 2nd hand junk, clothes, electronics, toys and some strange items. In the main square, you'll have to sift through a huge number of junk to spot some interesting 2nd hand items. Junk to treasure ratio is about 80:20, and there's something for everyone. Interested in dolls with no heads ? YES they have. Looking for a broken camera ? YES. Hunting for mismatched cutlery? YES!\n\nThe design of the market building should be worth a visit on its own. The shops on the slope goes all the way up to the 2/3 level and hugs the main square which sells the junk. There's some food stalls on the far end at the top level.", "publishedDate": "2016-05-03", "language": "en", "rating": 5}, {"id": 366993505, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d190634-r366993505-Mercat_dels_Encants_de_Barcelona-Barcelona_Catalonia.html", "text": "I see that Simone G has preceded me in this. But she is absolutely right. I also have no idea what they sell here--well, a little idea; I did notice some clothes and some food--but the mirrored ceilings.... Wow. If you love abstract art, and who doesn't now and again, then you will love what these distorting mirrors do to what they're mirroring. It's a whole different world and wildly gorgeous. Well, I've given you three of the shots I took on one afternoon (out of over 200--it's easy; go there; you'll see) to give you a taste of what's waiting for you there.\n\nPlus there's a market going on there, too. Tons of cool stuff. Simone and I ignored it, it's true. But it's there. And I'm guessing some of it's cool. Tons.", "publishedDate": "2016-04-24", "language": "en", "rating": 5}, {"id": 366783223, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d190634-r366783223-Mercat_dels_Encants_de_Barcelona-Barcelona_Catalonia.html", "text": "Although the building is very nice and the stall market is very large I was quite dissapointed by the quality of the merchandise especially that offered in the open ground floor. as you climb the ramp to the upper floors there are four or five antique shops with much better stuff. the surroundings are not attractive at all and the cafes and food offered below average.", "publishedDate": "2016-04-24", "language": "en", "rating": 3}, {"id": 361216078, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d190634-r361216078-Mercat_dels_Encants_de_Barcelona-Barcelona_Catalonia.html", "text": "I have no idea what they sell there but for doing photos it is a great spot, go there at sunset with a tripod and you will have fun for sure", "publishedDate": "2016-04-03", "language": "en", "rating": 5}, {"id": 355120293, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d190634-r355120293-Mercat_dels_Encants_de_Barcelona-Barcelona_Catalonia.html", "text": "Came across this amazing place by accident. It's situated next to the National Theatre, and it features literally hundreds of private and public traders of everything you'd expect on a flea market. Books, comic books, furniture, an endless amount of frills and kitsch, pictures and so on. There is also a large number of surplus goods traders from clothes to tools to household goods. The place is very busy and definitely worth a visit. The closest station is \"Glories\", the closest metro station is \"Marina\" or \"Monumental\".", "publishedDate": "2016-03-13", "language": "en", "rating": 4}, {"id": 349054812, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d190634-r349054812-Mercat_dels_Encants_de_Barcelona-Barcelona_Catalonia.html", "text": "The Mercat dels Encants is located quite off the regular tourist areas. This is a real down-to-earth market with most of the sellers ( directly on the floor or with small stalls ) offering an amazing choice of bric-a-brac; old toys, books, poster, items from demolished builidings, old tiles...thousands of pieces ranging from real junk to some \"treasures\". There are also stalls ( mini shops ) for regular household items, clothes and more ordinary stuff that you may find in a department store. This is obviously a place where the locals come and buy. English is not spoken but well understood. In comparison to similar markets in other southern European cities, the sellers are not aggressive at all, they almost ignore you ( which they probably in fact do, given that this is a place for locals ) and it is quite relaxing to walk around and look without being bothered all the time. But buying is easy if you show the normal courtesy of greeting ( the greeting language probably does not matter, body language is enough, but of course you have to negotiate prices. at most of the sellers, there are no price tags on the items). Payment is mostly in cash, effectively only the minishops or the sellers with more vaulable antiques accept credit cards.There are 2-3 small foodstalls and several modern and clean WC facilities, but overall the place is not for eating/drinking.\n\nUnless you absolutely hate flea markets, do not hesitate to go here, even if it is really \"roustique\". With a keen eye, you can definately find treasures at reasonable prices.", "publishedDate": "2016-02-18", "language": "en", "rating": 4}, {"id": 332620331, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d190634-r332620331-Mercat_dels_Encants_de_Barcelona-Barcelona_Catalonia.html", "text": "I found everything in place!\nfrom used clothing from thrift store .. and new clothes and good quality. Otimo cost benefit.\nMany trinkets, gifts and souvenirs. not there are many eating options. Reserve a whole day to visit this site. is really great information and fun things to see", "publishedDate": "2015-12-14", "language": "en", "rating": 5}, {"id": 331239921, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d190634-r331239921-Mercat_dels_Encants_de_Barcelona-Barcelona_Catalonia.html", "text": "The flea market is held in an interesting building but I left disappointed. I'm a huge fan of bargain hunting at antique markets but here the prices are a complete ripoff. One guy tried to charge me €10 for a dirty, tacky teacup. Also, many sellers aren't willing to negotiate the price. Amongst antique stalls, the place is full of general bric-a-brac & only worth a visit if you have time.", "publishedDate": "2015-12-07", "language": "en", "rating": 2}, {"id": 330636259, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d190634-r330636259-Mercat_dels_Encants_de_Barcelona-Barcelona_Catalonia.html", "text": "Was dissapointed I could not understand the live auction that took place in the early morning as it was in Spanish (I think).\nOtherwise a brilliant experience for your eyes and if you are really set on buying something specific from the flea market you will probably find it!", "publishedDate": "2015-12-03", "language": "en", "rating": 4}, {"id": 328759057, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d190634-r328759057-Mercat_dels_Encants_de_Barcelona-Barcelona_Catalonia.html", "text": "Place is pretty big and full of stuff with lots of junk. The building itself is pretty interesting. We wondered around for about an hour and only bought one thing. I can see how people either love or hate this place. It´s not too far from the beach and center (a little walk) so an interesting spot to check out if you have some free time in Barcelona!", "publishedDate": "2015-11-24", "language": "en", "rating": 3}, {"id": 323939088, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d190634-r323939088-Mercat_dels_Encants_de_Barcelona-Barcelona_Catalonia.html", "text": "This is a massive car boot sale but the architecture is so good that it's worth seeing. It's beautiful to look at. \nIt's full of all sorts of stuff; old, new, chinese made, etc. We didn't see much vintage that was worth buying although there is a shop by the number 1 entrance that's worth a look.\nThe sellers are not the politest of people. ", "publishedDate": "2015-11-02", "language": "en", "rating": 4}, {"id": 323514906, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d190634-r323514906-Mercat_dels_Encants_de_Barcelona-Barcelona_Catalonia.html", "text": "There are tons of sellers, and a huge variety of merchandise. Crowded, but not claustrophobic. There are multiple levels, but it is covered so you are not exposed to the sun. \n\nIt did seem that some of the sellers weren't interested in bargaining! But don't let that stop you!", "publishedDate": "2015-10-31", "language": "en", "rating": 4}, {"id": 320733771, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d190634-r320733771-Mercat_dels_Encants_de_Barcelona-Barcelona_Catalonia.html", "text": "Although the architecture of this market place is stunning, the goods sold were all but. Lots of non-branded clothing, Chinese rubbish and attic junk. Not the place to go if you're looking for nice vintage stuff. Best part was taking pictures of ourselves being reflected multiple times in the great roof.", "publishedDate": "2015-10-21", "language": "en", "rating": 2}, {"id": 319626370, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d190634-r319626370-Mercat_dels_Encants_de_Barcelona-Barcelona_Catalonia.html", "text": "This market was absolutely huge! Located right next to glories station. The market is a a great place to grab cheap souvenirs and you can browse for hours for antiques and collectables . I went on Tuesday at first and it was closed and so came back on the Wednesday where it was open. Only recommendation would be to check opening times before you go.", "publishedDate": "2015-10-17", "language": "en", "rating": 5}, {"id": 315519323, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d190634-r315519323-Mercat_dels_Encants_de_Barcelona-Barcelona_Catalonia.html", "text": "Our hotel, Teatre Auditori, was located near Glories metro. A visit to Glories puts you near to the Mercat, a huge flea market, Glories shopping centre (with restaurants and a cinema) and The Design Museum, which is an interesting building with interesting exhibits. The Mercat is undercover and Stop andMos, a food outlet in area C, is excellent!", "publishedDate": "2015-10-02", "language": "en", "rating": 3}, {"id": 308023485, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d190634-r308023485-Mercat_dels_Encants_de_Barcelona-Barcelona_Catalonia.html", "text": "Everything from antiques, modern kiosks selling art things and okay history (some reviewers call it junk). The old things, books, pictures, furniture, lamps, photos of those long gone etc etc etc , belongings that were all part of people's lives. Sad to see so much of it on the ground almost disregarded but this market is life. It is huge - my wife and I were there for two hours in this living, breathing, local market with its amazing roof. We love history and this was a living history of life, we laughed, smiled, felt sad...", "publishedDate": "2015-09-08", "language": "en", "rating": 5}, {"id": 307162645, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d190634-r307162645-Mercat_dels_Encants_de_Barcelona-Barcelona_Catalonia.html", "text": "Great finds among the crowds. There are a few small permanent booths that are set for charities, more like boutiques which I prefer. There are a few restaurants and and areas to sit outside of the hustle and bustle of the flea market.", "publishedDate": "2015-09-05", "language": "en", "rating": 4}, {"id": 305830879, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d190634-r305830879-Mercat_dels_Encants_de_Barcelona-Barcelona_Catalonia.html", "text": "More like a swap meet or yard sale than a market.  Left my hotel early to get here for the \"good sales\" and it was pens, old shoes, faded notepads, zippers.  This is not for tourists and is not a \"market\" selling anything memorable.", "publishedDate": "2015-09-01", "language": "en", "rating": 2}, {"id": 302860612, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d190634-r302860612-Mercat_dels_Encants_de_Barcelona-Barcelona_Catalonia.html", "text": "Barcelona's flea market.\nHuge new place, there is a huge selection of anything you want to buy.\nHave much tolerance for searches but otherwise everything is fine.", "publishedDate": "2015-08-24", "language": "en", "rating": 4}, {"id": 300315247, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d190634-r300315247-Mercat_dels_Encants_de_Barcelona-Barcelona_Catalonia.html", "text": "Visited this market based on previous reviews and it was worth the trip. The entrance is free of charge on all days and opens in specific days of the week.  Bought Xmas decorations for €2 and an oil painting for €20 (asking price was €30)", "publishedDate": "2015-08-17", "language": "en", "rating": 5}, {"id": 299329802, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d190634-r299329802-Mercat_dels_Encants_de_Barcelona-Barcelona_Catalonia.html", "text": "I am a global traveler and have been to many flea markets in the world. Encants is in a league of its own. Under one roof and three sides open to the weather, Encants is a treasure unto itself. You can buy anything from a pair of new tighty whities for 1 Euro to an original object d'art from the 18th or 19th century. Some vendors know the value of what they sell and others do not have a clue. Perhaps it is a dish from their great grandmother or an object d'art of museum quality. True story: A woman bought a painting there for 17 euros and took it to a gallery. It was confirmed that it was an original Renoir valued at over 100,000 euros. The fun of Encants is people watching and rummaging through piles of \"trash\" to discover that one treasure. If you have the treasure hunter gene in you, you must visit Encants while in Barcelona. Metro stops across the street from the Market. Food court for hot/cold food and beverages. Free admission - Wednesday through Saturday - 8am til closing (around 5pm) The early bird catches the worm...", "publishedDate": "2015-08-14", "language": "en", "rating": 5}, {"id": 298172479, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d190634-r298172479-Mercat_dels_Encants_de_Barcelona-Barcelona_Catalonia.html", "text": "There appear to be two parts to this market, near Placa de les Glories Catalanes. Firstly, there are the \"permanent\" stalls, which sell clothing, plumbing, antiques, materials, leather, pieces of chandeliers etc etc. Then there is the \"temporary\" section, on the ground floor level, which is a flea market, on the day we were there selling, books, old wine bottles (with contents), bric a brac, and supposedly 16th-century wall tiles (which I purchased). The sides are open to the weather; the ceiling is a giant mirror. It is open Mon, Wed, Fri and Sat from 8 - 8. The Glories tube is nearby, as well as a tram route. It is the biggest (and best?) market of its kind in Barcelona, and worth checking out.", "publishedDate": "2015-08-11", "language": "en", "rating": 5}, {"id": 297866883, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d190634-r297866883-Mercat_dels_Encants_de_Barcelona-Barcelona_Catalonia.html", "text": "This market place is situated near the Torre Agbar and you must feel the atmosphere of it and maybe try to find some antiquities.", "publishedDate": "2015-08-11", "language": "en", "rating": 5}, {"id": 297698498, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d190634-r297698498-Mercat_dels_Encants_de_Barcelona-Barcelona_Catalonia.html", "text": "Something for everyone, from antiques to down right second hand great stuff, books, housewares, cloth for sewing, sewing shops, hardware shops anything and everything.  Great place for souvenirs and jewlery!!  There are guys that want to charge too much if they see you are a tourist - bargain with them or walk away they come into their senses and give you a good price. . . or just walk to next station and find something better!!  I found a silver necklace with flowers, silver earrings and a beautiful silver pendant all for 15 euros.  And I found a pretty top for 3 euros.  Go here to find souvenirs.  I love this place!", "publishedDate": "2015-08-10", "language": "en", "rating": 5}, {"id": 289708796, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d190634-r289708796-Mercat_dels_Encants_de_Barcelona-Barcelona_Catalonia.html", "text": "This huge market has a wide variety of cheap and lovely things, and beautiful antiques. It is very crowded, and beware of pickpockets. If you are wearing a backpack move it to your side. Recommended! ", "publishedDate": "2015-07-16", "language": "en", "rating": 4}, {"id": 289535439, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d190634-r289535439-Mercat_dels_Encants_de_Barcelona-Barcelona_Catalonia.html", "text": "We only spent about 20 minutes looking around and didn't even need that long to be honest. There was very little worth looking at and it all appeared to be junk. There was a piece of jewellery I was interested in buying from one stall but the woman who ran it wasn't there - I walked around for a while and when I came back she still wasn't there so I just left it. The building it quite cool with it's mirrored ceiling, and some of the buildings/architecture in the surrounding area are attractive, but I wouldn't bother going again and would advise people to go and do something more worthwhile.", "publishedDate": "2015-07-16", "language": "en", "rating": 2}]}}]