[{"locationId": 8692632, "name": "La Casa de la Seda Barcelona", "placeType": "ATTRACTION", "reviewListPage": {"reviews": [{"id": 744718201, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d8692632-r744718201-La_Casa_de_la_Seda_Barcelona-Barcelona_Catalonia.html", "text": "This is one of the must-see spots in Barcelona. It was well worth the cost to see more of the beautiful work that Gaudí contributed to Spain. The audio tour was excellent!", "publishedDate": "2020-02-12", "language": "en", "rating": 5}, {"id": 718042370, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d8692632-r718042370-La_Casa_de_la_Seda_Barcelona-Barcelona_Catalonia.html", "text": "Enjoyed this tour of Sagrada Família. Meeting point easy to find. Guide spoke pretty good English. Very enjoyable!", "publishedDate": "2019-10-13", "language": "en", "rating": 5}, {"id": 640775978, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d8692632-r640775978-La_Casa_de_la_Seda_Barcelona-Barcelona_Catalonia.html", "text": "Excellent place to visit while travelling to Barcelona. Never miss this place. We enjoyed a lot while holidaying in Spain specifically in Barcelona.", "publishedDate": "2018-12-20", "language": "en", "rating": 5}, {"id": 481227765, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d8692632-r481227765-La_Casa_de_la_Seda_Barcelona-Barcelona_Catalonia.html", "text": "As a fair well gathering, seventy-two fellow travelers had a wonderful dinner at La Casa de la Seda Barcelona. The setting is in the main dining room where members of the Silk Guild hold their meetings. The surrounding rooms contain many examples and literature concerning the history of the silk trade in Europe and the world.\n", "publishedDate": "2017-05-03", "language": "en", "rating": 4}, {"id": 421678695, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d8692632-r421678695-La_Casa_de_la_Seda_Barcelona-Barcelona_Catalonia.html", "text": "Here you can learn something about the history and the craftsmanship of the silk industry of Barcelona. It is a privilege that the guild opened their house to the public. This guided tour is like a time travel. There are just a few rooms to view but each with interesting objects to discover. I highly recommend this tour to the sophisticated traveler who want to discover Barcelona outside of the mainstream. And the best of all is the very simpatico tour guide, if you are lucky you gonna meet Laura and she will infect you with her passion. The 10 EUR fee are absolutely justified.", "publishedDate": "2016-09-24", "language": "en", "rating": 5}, {"id": 421510087, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d8692632-r421510087-La_Casa_de_la_Seda_Barcelona-Barcelona_Catalonia.html", "text": "New open house to visit in Barcelona only available on 2016 for tourists. Good location in the city center, few people because it´s not well known from the public. the guide was nice! the visit took 50 minuts and it´s a beautiful house. Happy to see everything with no rush. The only negative thing it´s too expensive for the offer (small house). I recomende the visit!", "publishedDate": "2016-09-23", "language": "en", "rating": 4}, {"id": 402306970, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d8692632-r402306970-La_Casa_de_la_Seda_Barcelona-Barcelona_Catalonia.html", "text": "Barcelona is known worldwide for many well-known things. La Casa de la Seda remains yet as a hidden cultural treasure to discover. Not to miss.", "publishedDate": "2016-08-07", "language": "en", "rating": 5}, {"id": 402231117, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d8692632-r402231117-La_Casa_de_la_Seda_Barcelona-Barcelona_Catalonia.html", "text": "This was a very special museum experience, as it is a private residence, now open for public tours. This is very close to the Museo de la Musica, just around the corner. The guide was extremely knowledgable. It helped to learn about the history of the guilds, to understand commerce and how Barcelona came to be such a powerful port in it's time. We were shown beautiful examples from the silk makers of tapestry and wallpaper design. This was a fascinating experience! It is the only guildhouse open to the public in Barcelona. For more info in English - http://www.casadelaseda.com/en/home/", "publishedDate": "2016-08-06", "language": "en", "rating": 5}, {"id": 401534547, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d8692632-r401534547-La_Casa_de_la_Seda_Barcelona-Barcelona_Catalonia.html", "text": "This is not highly visible on the Barcelona tourist trail but is definately worth a visit if you are interested in fabric and the part played by the Guild in Spanish society of the day. And it is a cool, calm, tranquil and fascinating respite from the bustle of Las Ramblas.", "publishedDate": "2016-08-04", "language": "en", "rating": 5}, {"id": 401285319, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d8692632-r401285319-La_Casa_de_la_Seda_Barcelona-Barcelona_Catalonia.html", "text": "Happened upon this not well advertised gem and were delighted by both the knowledgeable guide, Laura and the preservation of the history of the silk workers guild in Barcelona. The information and artifacts explained by the guide were fascinating and gave great I sites to the history of the inportance of the guilds in establishing and monitoring the fibre trades. It was refreshing to realize the importance of this in the development of society both then and now. The guide was delightful and very well informed.", "publishedDate": "2016-08-04", "language": "en", "rating": 5}, {"id": 382864892, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d8692632-r382864892-La_Casa_de_la_Seda_Barcelona-Barcelona_Catalonia.html", "text": "Just the day before I found the house. It took my attention with the colofull facade. Ik looks like silk and it is silk. I red the plate and the next day at 10 sharp I stood there fir the first tour of the day. Eh in Spain you do not have to be that sharp on time...\nBut a little later a had a private tour during one hour. Interesting stories and a beautifull house! A must see in Barcelona!", "publishedDate": "2016-06-15", "language": "en", "rating": 5}]}}]