[{"locationId": 10060363, "name": "Monumento a Mahatama Gandi", "placeType": "ATTRACTION", "reviewListPage": {"reviews": [{"id": 689038012, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d10060363-r689038012-Monumento_a_Mahatama_Gandi-Barcelona_Catalonia.html", "text": "Located in the Jardins de Gandhi in the El Poblenou district of Barcelona is this odd, slightly out of place statue of the great man, Mahatma Gandhi. The statue depicts Gandhi wearing simple dhoti and shawl, and circular glass for which he is usually remembered. I think the statue is smaller than real life as the statue is less than 1.5 metres tall.\n\nI’m a admirer of the great man and was delighted to see this statue when I least expected it.", "publishedDate": "2019-07-12", "language": "en", "rating": 4}, {"id": 677103200, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d10060363-r677103200-Monumento_a_Mahatama_Gandi-Barcelona_Catalonia.html", "text": "I quite liked the fact that the lovely memorial statue of Gandhi was next to a park where I saw a lot of teenagers congregated. It is a lovely park and the statue I think highlights and gives the children the opportunity to ask questions and be curious about the iconic figure that was Gandhi and it’s presence in the area is lovely. ", "publishedDate": "2019-05-28", "language": "en", "rating": 5}, {"id": 628945892, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d10060363-r628945892-Monumento_a_Mahatama_Gandi-Barcelona_Catalonia.html", "text": "This sculpture seems like it needs more protagonism, since it’s located on a corner of the park and doesn’t seem to be very known amongst the locals. However it’s well done and it’s mysterious how it got here. ", "publishedDate": "2018-10-27", "language": "en", "rating": 3}, {"id": 390539741, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d10060363-r390539741-Monumento_a_Mahatama_Gandi-Barcelona_Catalonia.html", "text": "While staying in Barcelona I saw this monument to Mahatama Gandi was close to where we were staying. We walked to see it. It was less than impressive. The statue was nice but not presented very well, in my opinion. Not something I would recommend. ", "publishedDate": "2016-07-08", "language": "en", "rating": 1}]}}]