[{"locationId": 8857417, "name": "Santuari de la Mare de Deu Del Carme Barcelona", "placeType": "ATTRACTION", "reviewListPage": {"reviews": [{"id": 676071662, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d8857417-r676071662-Santuari_de_la_Mare_de_Deu_Del_Carme_Barcelona-Barcelona_Catalonia.html", "text": "Santuari de la Mare de Deu Del Carme Barcelona is an unusual building for a church in Barcelona, or even in Spain. But it's a large building and a nice one too. It looks rather nice from the outside, but it's even lovelier inside. The area is quite a busy one with traffic, as it's a very  large intersection. There is a number of shops in the vicinity.", "publishedDate": "2019-05-24", "language": "en", "rating": 4}, {"id": 638779362, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d8857417-r638779362-Santuari_de_la_Mare_de_Deu_Del_Carme_Barcelona-Barcelona_Catalonia.html", "text": "many places of interest here, very beautiful but don't forget to be careful, too many people, but very pleasant", "publishedDate": "2018-12-11", "language": "en", "rating": 4}, {"id": 623666790, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d8857417-r623666790-Santuari_de_la_Mare_de_Deu_Del_Carme_Barcelona-Barcelona_Catalonia.html", "text": "We found this church as we were wandering around this part of town and what a great find. \nA beautiful church, all brick with a very imposing look to it,we couldn't gain access but we were suitably impressed with facade ,it's quite a large church and easily dominates the immediate area, I took a few photos of this church before we moved on .\nVery easy to locate on Vinguda Diagonal in the wonderful L'Eixample District of Barcelona and most definitely well worth seeking out. ", "publishedDate": "2018-10-10", "language": "en", "rating": 5}, {"id": 460062372, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d8857417-r460062372-Santuari_de_la_Mare_de_Deu_Del_Carme_Barcelona-Barcelona_Catalonia.html", "text": "I passed by this church while walking from Passeig de Gracia to La Sagrada Familia.  From the outside, it doesn't fit a typical church appearance at all but is visually appealing in it's own way.  Step inside, and a beautiful church awaits.  It is worth a quick stop or brief detour if you happen to be in the area.", "publishedDate": "2017-02-15", "language": "en", "rating": 4}, {"id": 444233872, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d8857417-r444233872-Santuari_de_la_Mare_de_Deu_Del_Carme_Barcelona-Barcelona_Catalonia.html", "text": "It’s a rather interesting edifice built at the beginning of the twentieth century as the church of the discalced Carmelites. At the very beginning of the Spanish Civil War in 1936 it was heavily damaged as a consequence of a fire started by the people opposed to the fascist troops which, headed by General Franco, led the uprising against the Spanish Second Republic. Some factious militia under the commandment of General Lacasa took refuge at the temple and, once this had been besieged by the patriots loyal to the democratically elected authorities, they started shooting against the besiegers. Rumours were going on about the involvement of the friars themselves in such an attack. This caused the said besiegers to kill four of them and kindle a fire inside the church as a consequence of which some benches and other objects burnt out. Those events made it necessary to refurbish the church and place inside some new furniture, all of which was done once the war had already finished.\nIn the church a diversity of styles can be observed: especially neoromanesque, byzantine and art nouveau. The church façade is rather nice. It’s possible to accede inside through three doors. The main portal is topped by a semicircular arch containing several archivolts, some of which are flat and others have some carvings. The said arch is encircled by a bigger one supported by cylindrical columns having composite capitals supported in turn by pilasters. The stated main portal is framed by a truncated pediment whose inner side is aesthetically carved.\nOn the upper part of the façade there are three windows open onto the triforium ornamented with polychromatic stained-grass. Those are arch shaped openings supported by columns whose capitals and bases are flat. The decoration on the side façade is rather like that of the main façade but simpler. The side aisles are lower than the central nave and they are covered with two slope-tile roofs in the same way as the central nave. Above the crossing of the latter and the transept there is the dome.\nThe inner part of the church is really beautiful. The nave, longer than the side aisles, is crowned by a large apse covered with a casket like section whose shape reminds of a quarter of a sphere. Over the side aisles there are some galleries. The friar community choir is above the atrium, which finds itself on the ground floor by the church entrance. The dome style could be deemed as byzantine and it’s a magnificent one. Its shape is like that of half an orange. Its structure, whose base is formed by sixteen semi-cylindrical pieces, is supported by four pillars. These pillars alternate on the ground floor with whitish marble columns there being semicircular arches betwixt each one, the style of that arcade being thus neoromanesque. Those arches support the triforium and they separate the central nave from the side aisles, and the just mentioned columns are topped with byzantine shields. All the stated elements provide the whole with an abundance of harmony, taste and grandiosity.\nFinally, at least two other elements deserve being carefully and attentively observed and studied. These are the baldachin over the high altar table and the mosaics adorning that baldachin, the apse and the dome, as well as some arches. Those mosaics are some of them in a byzantine style and the others are art nouveau and they are all really marvelous. The motifs depicted in the said mosaics are of diverse nature: the Virgin, saints and beatified people, cedars of Lebanon, the heaven portal, archangels and cherubs and many others. The sculptural images of Our Lady of Carmen and St. Joseph in the church concerned are also worth being contemplated.\nIn general it’s a very nice temple whose architecture is quite original as it can be gathered from the foregoing. Once inside one feels transported to a world of marvels provided he has a minimum of sensitiveness. It’s not far from the building called \"Pedrera\" by Gaudy. The church stands on a corner betwixt the Diagonal and carrer Roger de Llúria. It’s worth visiting it and being inside constitutes an interesting and unforgettable experience. It shouldn’t therefore be missed once in Barcelona.", "publishedDate": "2016-12-14", "language": "en", "rating": 5}, {"id": 329724617, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d8857417-r329724617-Santuari_de_la_Mare_de_Deu_Del_Carme_Barcelona-Barcelona_Catalonia.html", "text": "We found this church walking from the Sagra da Familia to Golden Square with it's wealth of modernist and gaudi buildings.  The church is on the northwest corner of the Avinguda Diagonal and the Carrer de Roger de Lluria.\n\nThe church has an art deco feel to us though it was built before that style became popular.  Things of note are decorative mosaics on the pillars and ceilings the inlaid marble floors.  Definitely worth a stop or short detour.", "publishedDate": "2015-11-29", "language": "en", "rating": 4}]}}]