[{"locationId": 11930439, "name": "Dona Pescadora", "placeType": "ATTRACTION", "reviewListPage": {"reviews": [{"id": 689874617, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d11930439-r689874617-Dona_Pescadora-Barcelona_Catalonia.html", "text": "The Dona Pescadora is a sculpture adorning the entranceway on the western side of the Placa de Catalunya. The sculpture depicts a woman protecting her modesty while averting her gaze. A scene reminiscent of the biblical story of Susanna falsely accused by lecherous voyeurs and in particular the painting \"La Casta Susana” by Juan Manuel Blanes. The sculpture has many elements of Baroque attention to detail, especially around the legs, the folds of her towel and the pained expression of embarrassment on her face.\n\nIn my opinion, this is one of the better statues in the Plaza.", "publishedDate": "2019-07-15", "language": "en", "rating": 4}, {"id": 677322395, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d11930439-r677322395-Dona_Pescadora-Barcelona_Catalonia.html", "text": "Dona Pescadora is the beautiful sculpture of a woman, or \"fisher woman\". She is facing sidewards, so we only see one side of her face. She seems to have been caught unawares, as her breasts are exposed and she is making an attempt to shield herself. This pose is reminiscent of ancient classical, Greek sculptures, and specifically that of Aphrodite, who is depicted naked and attempts unsuccessfully to cover herself. This statue, however, is a bit different in that it is not a naked one. It is at the entrance to Plaza de Catalunya. It is a must visit sight.", "publishedDate": "2019-05-29", "language": "en", "rating": 5}, {"id": 584035627, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d11930439-r584035627-Dona_Pescadora-Barcelona_Catalonia.html", "text": "This statue stands on a pedestal and is recessed in the structure behind. It depicts a lady with gown falling from under her breasts, she is looking at her right shoulder as if embarrassed. Her right arm is across her breasts possibly in an attempt of modesty. Her left arm is stretched along her left side. \nThe name of the sculpture translates to 'Lady'", "publishedDate": "2018-05-31", "language": "en", "rating": 3}, {"id": 453131645, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d11930439-r453131645-Dona_Pescadora-Barcelona_Catalonia.html", "text": "On the western side of Plaza de Caluna there are an entrance surrounded by two columns.\nOn the rigth column there are two sculptures:\n\"Emporion\" and \"Pescador\".\n.\"Emporion\" is a woman (Dona) from Empuries/Ampurias.\nThis sculpture was made by Frederic Mares.\n\"Pescador\" means fisherman, and the scuplture shows a fisherman.\nThis sculpture was made by Josep Tenas i 1928.\nTake a rest on Plaza de Caluna among all the sculptures.", "publishedDate": "2017-01-18", "language": "en", "rating": 3}]}}]