[{"locationId": 195113, "name": "Parc d’Atraccions Tibidabo", "placeType": "ATTRACTION", "reviewListPage": {"reviews": [{"id": 749640029, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d195113-r749640029-Parc_d_Atraccions_Tibidabo-Barcelona_Catalonia.html", "text": "Visited the top earlier this week from getting off the underground at placa catyluna. Lovely but tiring walk up and down, nice day out if you like a good walk. At the top the basilica is beautiful, the amusement park takes away from is grandeur though. Worth a trip if in Barcelona.", "publishedDate": "2020-03-06", "language": "en", "rating": 4}, {"id": 749328239, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d195113-r749328239-Parc_d_Atraccions_Tibidabo-Barcelona_Catalonia.html", "text": "Great view and the church is quite a sight. If you have kids they will have fun on the rides. The metro and buses make it easy to get to.", "publishedDate": "2020-03-05", "language": "en", "rating": 5}, {"id": 749297891, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d195113-r749297891-Parc_d_Atraccions_Tibidabo-Barcelona_Catalonia.html", "text": "We arrived in the evening. It was cold and windy in November. Attractions were just a few and looked quite uninteresting for adults like us. The view is not bad but it’s hard to see anything when it’s dark. Photos are useless with regular phone camera. My recommendation is to visit it during the day when there is light and good visibility and action. ", "publishedDate": "2020-03-05", "language": "en", "rating": 3}, {"id": 743021980, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d195113-r743021980-Parc_d_Atraccions_Tibidabo-Barcelona_Catalonia.html", "text": "Very nice place to spend a day with our without kids. If you wanna visit the adventure park you can also visit the Cathedral which is next to the adventure park. The view over Barcelona is amazing. The adventure park is not big, but it's fun.", "publishedDate": "2020-02-04", "language": "en", "rating": 4}, {"id": 740185261, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d195113-r740185261-Parc_d_Atraccions_Tibidabo-Barcelona_Catalonia.html", "text": "I just wanted to go to TIBIDABO to see how it was, as it can be seen from all over BCN. It's a nice walk for the family, by bike or just to spend a couple of hours in this nice place. Also, you have the churches which have some interesting history. A must visit if in BCN.", "publishedDate": "2020-01-20", "language": "en", "rating": 4}, {"id": 740034438, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d195113-r740034438-Parc_d_Atraccions_Tibidabo-Barcelona_Catalonia.html", "text": "Nice activity with children when visiting Barcelona. Not excessively expensive entry tickets and a variety of attractions that will keep children and adults busy for a few hours. Jus be aware that attractions are not of the level of Port Aventura and food prices are super expensive!! ", "publishedDate": "2020-01-19", "language": "en", "rating": 4}, {"id": 739818771, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d195113-r739818771-Parc_d_Atraccions_Tibidabo-Barcelona_Catalonia.html", "text": "Really nice view from the top, can see the the horizon and the whole city view, would highly recommend people to try once", "publishedDate": "2020-01-18", "language": "en", "rating": 5}, {"id": 739261412, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d195113-r739261412-Parc_d_Atraccions_Tibidabo-Barcelona_Catalonia.html", "text": "This hill north from Barcelona offers great view of city below. Ther is amusment park for kids and church", "publishedDate": "2020-01-15", "language": "en", "rating": 5}, {"id": 737710579, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d195113-r737710579-Parc_d_Atraccions_Tibidabo-Barcelona_Catalonia.html", "text": "We came here in our rented car, easy to get here. Very high! Great to see the city and the church is so beautiful. The park looks so much fun too! We came for the views. Worth coming!", "publishedDate": "2020-01-07", "language": "en", "rating": 5}, {"id": 736648081, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d195113-r736648081-Parc_d_Atraccions_Tibidabo-Barcelona_Catalonia.html", "text": "This was on our list to do early into our trip and I’m so glad we did. Chosen mainly for the view - we didn’t go on any rides. It’s just fun to walk around and see everything: the church and the attraction. We were lucky enough to go just before sunset and we were not disappointed. Simply breathtaking! Take care to find out in advance how you’ll leave though - and do not attempt to walk down the mountain at night. Trust me, we learned the hard way. \nWhat makes it even more cool is that wherever you go in Barcelona, you’ll still be able to see Tibidabo. It’s the perfect reference point, being the highest point of the city. ", "publishedDate": "2020-01-03", "language": "en", "rating": 5}, {"id": 736366810, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d195113-r736366810-Parc_d_Atraccions_Tibidabo-Barcelona_Catalonia.html", "text": "We had a horrible experience with the shuttle to the park as the first one we got on broke down and it took us nearly one hour to actually get to the park, so we wasted a lot of time to start with.\n\nIn terms of size of the park, although it is on 6 levels, it is relatively small. And most attractions are actually for children, except for the Aviator (airplane) for which we had to wait 45 minutes and the rollercoaster, which was great but a very short ride! \n\nThe best thing about this park is the actual panoramic view over Barcelona. But not sure if overall it is worth the money...", "publishedDate": "2020-01-02", "language": "en", "rating": 3}, {"id": 736127691, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d195113-r736127691-Parc_d_Atraccions_Tibidabo-Barcelona_Catalonia.html", "text": "One of the best tourist destinations, certainly a worthwhile try, also astonished by the fact that this height is well exploited in means of tourism, intelligent thinking, really nice experience.", "publishedDate": "2020-01-01", "language": "en", "rating": 5}, {"id": 734677131, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d195113-r734677131-Parc_d_Atraccions_Tibidabo-Barcelona_Catalonia.html", "text": "Nice place to visit, with big panorama view on Barcelona. Keep in mind to check the weather before your trip, because there is sometimes freaking windy and some fog, we was lucky and the weather was good. ", "publishedDate": "2019-12-25", "language": "en", "rating": 5}, {"id": 732904232, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d195113-r732904232-Parc_d_Atraccions_Tibidabo-Barcelona_Catalonia.html", "text": "This a fun little park. Mostly for the little kids but we had quite a bit of fun our selves. There is also good snack foods as well. Sit at a table and just enjoy the views.! ", "publishedDate": "2019-12-15", "language": "en", "rating": 4}, {"id": 732387100, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d195113-r732387100-Parc_d_Atraccions_Tibidabo-Barcelona_Catalonia.html", "text": "You must to go if you go to Barcelona! Amazing view and the bus driver was very kind! At lest you should to go one’s!", "publishedDate": "2019-12-13", "language": "en", "rating": 5}, {"id": 732010389, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d195113-r732010389-Parc_d_Atraccions_Tibidabo-Barcelona_Catalonia.html", "text": "When asking people about things to do in Barcelona no one mentioned this so I am so so glad I found it here as it really was worth the trip! We went around sunset and had beautiful views over the city all the way to the sea. It’s really vintage and cute and I really recommend it as a cute date night. Only thing was the bus stopped quite early to go back down so had to walk down quite a steep hill back to the tram. Worth a visit though! ", "publishedDate": "2019-12-11", "language": "en", "rating": 5}, {"id": 731691367, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d195113-r731691367-Parc_d_Atraccions_Tibidabo-Barcelona_Catalonia.html", "text": "I went with my daughter; we both enjoy it. I think it worth if you are in Barcelona to spend a day there. Fantastic view and great attractions. Bus from downtown take us there for 2.5 euro something - it is not attractions that scare \"the hell-out-of-you\" like in the newest parks (and we like this), but they are good enough to have fun. Krüeger Hotel has a good show - for my nine years old was really \"enjoyably-spooky.\"  \nThe church is beautiful - we don't have time to visit, but the adult probably can be fill up the rest of the day from the visit instead of going to the attractions :).", "publishedDate": "2019-12-09", "language": "en", "rating": 5}, {"id": 731139093, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d195113-r731139093-Parc_d_Atraccions_Tibidabo-Barcelona_Catalonia.html", "text": "I have taken a ride in the 1928 Red Aeroplane - I can die a happy man! €2.00 per person. Visited on a quiet October Monday, so no queues.", "publishedDate": "2019-12-07", "language": "en", "rating": 4}, {"id": 728295293, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d195113-r728295293-Parc_d_Atraccions_Tibidabo-Barcelona_Catalonia.html", "text": "It is truly a cool experience for theme park lovers to be on the highest and oldest theme park in Spain. Other than the attractions and rides, you can literally see the entire Barcelona and coast from here! ", "publishedDate": "2019-11-22", "language": "en", "rating": 5}, {"id": 725955426, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d195113-r725955426-Parc_d_Atraccions_Tibidabo-Barcelona_Catalonia.html", "text": "Nice park, with heartbreaking views to Barcelona. Nice attractinos and facilities. High price. Overall, good.", "publishedDate": "2019-11-12", "language": "en", "rating": 4}, {"id": 725462770, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d195113-r725462770-Parc_d_Atraccions_Tibidabo-Barcelona_Catalonia.html", "text": "We got the bus T2A from plaza Catalunya to Tibidabo (costs 3 euros pp one way, takes 50min), the view from the bus was awesome. The panoramic view of Barcelona from Tibidabo was amazing too. You can visit the church at the top. We went on some of the rides in the panoramic area for 2 euros each - tickets from the ticket office (note this was not advertised on the board). Really recommend the carousel. There were vans selling churros to snack on.", "publishedDate": "2019-11-10", "language": "en", "rating": 5}, {"id": 722311616, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d195113-r722311616-Parc_d_Atraccions_Tibidabo-Barcelona_Catalonia.html", "text": "This was recommended to me by a local.  I was not aware of the rides at the top.  The funicular was not working, so had to get the bus.  The bus does not take cash, so make sure you have a payment card with you.  The views were great, well worth it.  There are some places to eat at the top.  Something for everyone.  The church was beautiful, and we were lucky enough to witness a wedding party coming out of the church for photos.", "publishedDate": "2019-10-29", "language": "en", "rating": 3}, {"id": 719507017, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d195113-r719507017-Parc_d_Atraccions_Tibidabo-Barcelona_Catalonia.html", "text": "The park , the church and the wonderful vew to Barcelona from Tibidabo make you feel wonderful. It is a good opportinity to spend a day ...", "publishedDate": "2019-10-18", "language": "en", "rating": 5}, {"id": 718157162, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d195113-r718157162-Parc_d_Atraccions_Tibidabo-Barcelona_Catalonia.html", "text": "Worth it to see the views , worth the trip , the lift wasn’t working so we caught the bus up. Great service . The views are stunning but I thought it was ruined with a fun park for little kids .. they should of put up some nice restaurants and outdoor seating area to sit and enjoy the view with a nice wine . Xx", "publishedDate": "2019-10-13", "language": "en", "rating": 3}, {"id": 716941073, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d195113-r716941073-Parc_d_Atraccions_Tibidabo-Barcelona_Catalonia.html", "text": "This was probably the disappointing factor of my whole trip. I must admit though, that I wasn't aware of the amusement park situated at the top. I would definitely recommend going there with children. On the other hand, the view was absolutely breathtaking. The church was beautiful. I can not point out exactly where the disappointment comes from, but I left with a sense of something missing. \nIf you have children, plan a long day there.", "publishedDate": "2019-10-10", "language": "en", "rating": 3}, {"id": 716630240, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d195113-r716630240-Parc_d_Atraccions_Tibidabo-Barcelona_Catalonia.html", "text": "The funicular was not working so it was a bit of a challenge to get to the top but we ended up taking a taxi up and the bus back down.  The view was spectacular, seeing all of the city.  The church was small, quaint but beautiful in its own way.  If you have the time, it was a good place to see Barcelona from above.", "publishedDate": "2019-10-09", "language": "en", "rating": 5}, {"id": 715529440, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d195113-r715529440-Parc_d_Atraccions_Tibidabo-Barcelona_Catalonia.html", "text": "Absolutely amazing views but apart from the views nothing really. The church is cool but you pay to go to the top and the attractions? Not really worth it.", "publishedDate": "2019-10-05", "language": "en", "rating": 4}, {"id": 713459416, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d195113-r713459416-Parc_d_Atraccions_Tibidabo-Barcelona_Catalonia.html", "text": "To much people, loud noise and not very many tvinga to do or see.\nAs a couple do not spendera time here. ", "publishedDate": "2019-09-27", "language": "en", "rating": 2}, {"id": 712635744, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d195113-r712635744-Parc_d_Atraccions_Tibidabo-Barcelona_Catalonia.html", "text": "Get off the hop on off bus and get a local bus for a few €.\nThen the funicular up the hill. Great church and Panoramic rides for views of the city. Better than those from parc guell", "publishedDate": "2019-09-24", "language": "en", "rating": 5}, {"id": 709388632, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d195113-r709388632-Parc_d_Atraccions_Tibidabo-Barcelona_Catalonia.html", "text": "We got the Panoramic Area ticket with the funicular, and had a great time on the ferris wheel, carrousel, and plane. Possibly a little less to do than expected (could have paid for the rides individually to save a couple of euro), and had hoped we could walk around the rest of the park without going on the other rides, but this wasn't the case. This did restrict some access to food options, but we still had a good time enjoying the magnificent views and ate at the Adventurers Club.", "publishedDate": "2019-09-13", "language": "en", "rating": 4}, {"id": 709379973, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d195113-r709379973-Parc_d_Atraccions_Tibidabo-Barcelona_Catalonia.html", "text": "No indication was given that the place would be closed, so we made the hour’s treck across town to check it out, only to find it was closed. We still went up to the top on the fernicular railway which afforded some great views across Barcelona, but why close the park and not provide any indication that it is closed? Disappointing.", "publishedDate": "2019-09-13", "language": "en", "rating": 2}, {"id": 707296372, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d195113-r707296372-Parc_d_Atraccions_Tibidabo-Barcelona_Catalonia.html", "text": "Another great place near Barcelona! We had gone with a car that we had rented. However, make sure you have reserved a parking spot for 10€ at the parking there beforehand! We found quite a bit of traffic going and saw that most cars were being turned back by the police. The reason was that the parking was full ( not for us since we reserved our spot!)\nAnyways, once there we walked around, saw the amusement park (didn't do rides, too expensive if you have 3 kids!!), took photos of the great views and of course went to the church! Definitely a must!", "publishedDate": "2019-09-06", "language": "en", "rating": 4}, {"id": 705733868, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d195113-r705733868-Parc_d_Atraccions_Tibidabo-Barcelona_Catalonia.html", "text": "Well worth a visit if you have young kids. Great setting with it being at the top of a mountain. The queues for the rides aren’t too long so you can get around quite quickly. Though not a theme park equipped with white knuckle rides there is the odd surprisingly good attraction.\n\nFor horror buffs, Hotel Kruger is an absolute must. It’s immensely entertaining. If you walk out with your heart still in check you’ve done well. London Dungeon please take note. This is how you do a well crafted, actor lead horror attraction. \n\nRoller coaster is also not bad. \n\nI did however find the poor food quality and options a pain. It’s pricey on that front too. Charging full fare for a 6 year old was also poor form.", "publishedDate": "2019-09-02", "language": "en", "rating": 4}, {"id": 704809079, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d195113-r704809079-Parc_d_Atraccions_Tibidabo-Barcelona_Catalonia.html", "text": "The park is nice for young kids, we arrives at 11am when the park opens and were lucky to play few before the crowd. Later during the day, it get crowded with queues but bearable and the waiting time is acceptable. We almost tried everything except the rides for older kids. There are many restaurants, check all before you decide where to eat. We ate at the restaurant just next to the entrance and the sandwiches are overpriced and not good at all. Maybe a small pizza or hotdog sandwich would have need better for us. The water is overpriced also as one would expect. The view is amazing from the park and the trees all around give the atmosphere a very fresh taste. There is a majestic church also, the Sacred Heart of Jesus. We reached the park by bus from Cataluyna Plaza costs 3€ per person and the ride towards the mountain was nice. All in all it was a pleasurable experience. Recommended.", "publishedDate": "2019-08-30", "language": "en", "rating": 4}, {"id": 704643904, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d195113-r704643904-Parc_d_Atraccions_Tibidabo-Barcelona_Catalonia.html", "text": "Whether you have a family or not, Tibidabo is worth visiting.  Simply walking around and having the views of Barcelona is worth the trip.  You can take the funicular or the bus or both (one way for each).  The amusement park is for younger children and maybe teenagers, but adults will probably also have fun.  There is no admission fee other than the ticket up the hill using the funicular or a transit pass for the bus.  It is probably quite scenic and fun after sunset.", "publishedDate": "2019-08-30", "language": "en", "rating": 5}, {"id": 703099579, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d195113-r703099579-Parc_d_Atraccions_Tibidabo-Barcelona_Catalonia.html", "text": "I didn't do any rides but it's still worth going ti for the views alone,  the church there is lovely too. It can be a bit of a hassle getting there the cheapest is by the train bus and funicular from plaza Catalonia but the fun way is on the blue tram and funicular. The houses in the area are amazing to see too.  If you have time do it. ", "publishedDate": "2019-08-26", "language": "en", "rating": 5}, {"id": 702523993, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d195113-r702523993-Parc_d_Atraccions_Tibidabo-Barcelona_Catalonia.html", "text": "We went there expecting strong and extreme games! We tried 2 games that were supposed to be the strongest but wasnt as expected! Its a good place for families who would like to enjoy their time with their kids! \nNot to forget the wonderful view that this place has", "publishedDate": "2019-08-24", "language": "en", "rating": 3}, {"id": 698827340, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d195113-r698827340-Parc_d_Atraccions_Tibidabo-Barcelona_Catalonia.html", "text": "The parc is alot of fun and not to expensive for a full day of fun. The views you get from some of the attractions are amazing. My biggest issue is the lack of a good restaurant nearby, you must bring your own food to eat something decent. ", "publishedDate": "2019-08-14", "language": "en", "rating": 5}, {"id": 696934787, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d195113-r696934787-Parc_d_Atraccions_Tibidabo-Barcelona_Catalonia.html", "text": "Location, views and gardens and rides are great.\nTo improve:\n1. Based on the web site, we parked at Vall d'Hebron parking at 10.00am. There is a free bus to the park but only 2 buses were running (20-25 min ride). I guess most of people want to go at opening time. We had to wait for 3 buses (more than 1 hour waiting). The cue was in a sunny area with no shade. Can you imagine waiting to go to an attraction park with 2 kids in the sun?\n2. A couple of attractions were very slow due to the personal. Specially, I need to mention the driving experience for kids. With a bit of energy from the team, the cues could be reduced easily.\n3. We left the Kruger Hotel for the afternoon as top site. We went there before 5pm being aware of a potential long cue. Surprinsigly, we were told that the attraction was closed until 9pm. There were people cuing which would enter until 6.30. But then, actors had to stop for a couple of hours. The only option was to wait until 9pm (and start cueing at 7.30pm). Would you be waiting from 5 to 9pm with 2 little kids? I agree that actors need to take breaks, but what about having 2 teams of actors in pick days? It is diffcult to understand that a top attraction is closed from 7 to 9pm. We left the park with a frustating feeling.\n4. Food stations. The park allows to bring food from home (very good!). At lunch we approached one station for sandwiches and drinks. No sandwiches available, and only beer or water. They were not prepared to cope with the demand. ", "publishedDate": "2019-08-08", "language": "en", "rating": 3}, {"id": 694284828, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d195113-r694284828-Parc_d_Atraccions_Tibidabo-Barcelona_Catalonia.html", "text": "As many reviews say the views were incredible as you could see the whole city. However, if you’re looking for an amusement park experience, avoid this. Lots of rides were closed and the place was very soulless. We only went on two (of the four open) rides and they were very underwhelming. Probably good if you have young children but if you’re a bit older, stick to the main city.", "publishedDate": "2019-07-30", "language": "en", "rating": 2}, {"id": 691462990, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d195113-r691462990-Parc_d_Atraccions_Tibidabo-Barcelona_Catalonia.html", "text": "When you out of ideas and you are in the area, visiting Tibidabo is always a good option for your afternoon. You have restaurant, attractions and , of course the monastery, for the ones in search of other type of relaxation-in fact I find the monastery the most important site in the complex.\nAdvice-street food a bit doggie tbh and most attractions expensive-but my kid enjoys them so - who am I to judge!?\nGreat views over the hills and plenty to do.\nI recommend it.", "publishedDate": "2019-07-21", "language": "en", "rating": 3}, {"id": 690704888, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d195113-r690704888-Parc_d_Atraccions_Tibidabo-Barcelona_Catalonia.html", "text": "If you’re looking for the best panoramic views of Barcelona’s shoreline on the one side, and the mountains on the other, then look no further. Spectacular.", "publishedDate": "2019-07-18", "language": "en", "rating": 5}, {"id": 688248441, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d195113-r688248441-Parc_d_Atraccions_Tibidabo-Barcelona_Catalonia.html", "text": "We visited this venue in the hopes of taking some pictures and seeing picturesque views, which did not disappoint.  The amusement park was very nicely done and incorporated rides that were built into the side of the mountain for a reasonable price.  Restaurant and adult beverages can also be found for reasonable prices with good service.  Wish we would have more time for the kids to spend on the rides.  Try to visit at sunset, it was absolutely breathtaking. Very positive experience!", "publishedDate": "2019-07-09", "language": "en", "rating": 5}, {"id": 686175473, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d195113-r686175473-Parc_d_Atraccions_Tibidabo-Barcelona_Catalonia.html", "text": "Fantastic view of the city of Barcelona, one of my favorite places there... Funicolar it's cool and what you see on the top of the mountain will be so good. ", "publishedDate": "2019-07-02", "language": "en", "rating": 5}, {"id": 686124853, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d195113-r686124853-Parc_d_Atraccions_Tibidabo-Barcelona_Catalonia.html", "text": "Super view, good relax on the top of the hill. the chuch is amazing, 3 floors stage. Recomendation to visit", "publishedDate": "2019-07-02", "language": "en", "rating": 5}, {"id": 685723389, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d195113-r685723389-Parc_d_Atraccions_Tibidabo-Barcelona_Catalonia.html", "text": "Park was open but not open (rides only available wed- sun). No shuttle bus and no information that it wasn't available on Monday Tuesday. Rides looked disappointing when we finally got there so it wasn't a bad thing that then weren't available. ", "publishedDate": "2019-07-01", "language": "en", "rating": 1}, {"id": 685180141, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d195113-r685180141-Parc_d_Atraccions_Tibidabo-Barcelona_Catalonia.html", "text": "Very nice park with plenty of tres and shadows and 7 to 12 year old children  attractions. The top panoramic part of the park is great for everyone who wants to enjoy great views of Barcelona and is more economic than the general entry to the park.", "publishedDate": "2019-06-29", "language": "en", "rating": 5}, {"id": 683714509, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d195113-r683714509-Parc_d_Atraccions_Tibidabo-Barcelona_Catalonia.html", "text": "i was only planned to ride the Funicular with my sons who would be first time for them.  But it turned the destination - tibidabo was amazing and beyond my expectation.  I stoped at tram blau funicular del tibidabo bus stop and expected to continue with a tram to tibidabo via a funicular.  But the tram blau was out of order and a bus number 196 is easily be accessed.  The bus 196 stoped at funicular station and with 11 euro each we can get return ticket for funicular and attractions.  I was not sure what attractions, but after going up with funicular, the view was amazing and plus riding attraction on the giant wheel made the view is more spectacular.  i suggest to take all in ticket of euro 11 rather than only euro 7 for funicular 2 ways only.    Children will love it and you’ll have unforgettable experience and amazing pictures from the high of Barcelona  ", "publishedDate": "2019-06-23", "language": "en", "rating": 5}, {"id": 681925811, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d195113-r681925811-Parc_d_Atraccions_Tibidabo-Barcelona_Catalonia.html", "text": "A great theme park that makes the most of a spectacular location. Even on a busy bank holiday not much queuing (apart from the VR) and properly entertaining rides, from the vintage to modern. Food was fine too. Really well run.\n\nWe went early & did most things, the rollercoaster over and over. The bus from central Barca is easy, the funicular & train back was a bit more faffy.\n\nIf you're in Barcelona with a kid, just go. Take your own sweets because the shops are a bit pricey\n", "publishedDate": "2019-06-16", "language": "en", "rating": 5}, {"id": 681660558, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d195113-r681660558-Parc_d_Atraccions_Tibidabo-Barcelona_Catalonia.html", "text": "This amusement park is good for young children. Our 18month old was able to go on many rides. He really enjoyed the train rides and the red plane. However, we found buying the entrance tickets very confusing and we felt that the employee at the ticket office didnt want to explain the different types nor sell them to us. It did not feel tourist friendly. \n", "publishedDate": "2019-06-15", "language": "en", "rating": 4}, {"id": 681623640, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d195113-r681623640-Parc_d_Atraccions_Tibidabo-Barcelona_Catalonia.html", "text": "We caught the L7 train from Placa de Catalunya then the bus - across the road on the hill on the right -  up to the funicular station. We used out T10 tickets and it only registered as o e journey.\nFrom there it was a quick jaunt up the mountain on the funicular to the park and the church. \nThe views are quite magnificent from the park and if you trek to the top of the church spire they are breathtaking!\nThe rides in the park are vintage and if your nerves will take it give them a go especially the plane. \nI would say this was my favourite place in the whole of Barcelona and we were lucky that it wasn't too crowded like the rest of the city.", "publishedDate": "2019-06-15", "language": "en", "rating": 5}, {"id": 681343693, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d195113-r681343693-Parc_d_Atraccions_Tibidabo-Barcelona_Catalonia.html", "text": "This park is simply awesome for honeymooners and family with young kids! Absolutely stunning view and many things to do for the kids...", "publishedDate": "2019-06-13", "language": "en", "rating": 5}, {"id": 679241156, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d195113-r679241156-Parc_d_Atraccions_Tibidabo-Barcelona_Catalonia.html", "text": "You don't even have to ride any rides, but you can.  Just go there for the view of the city.  It's breathtaking!  Typical snack places.  Nice restaurant.  Beautiful cathedral.  Rode the funicular.", "publishedDate": "2019-06-05", "language": "en", "rating": 5}, {"id": 679023796, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d195113-r679023796-Parc_d_Atraccions_Tibidabo-Barcelona_Catalonia.html", "text": "You get to see the most amazing views of the city from here. Beautiful church that overlooks the city will steal your heart. Amusement park is a lot of fun if you have time to spend. \n\nHighly recommend visiting it. Also commuting to this place is not a problem. You can take a cab or bus to reach at the top. From the center of the city it usually take around 25-30 mins to reach at the top by taxi. ", "publishedDate": "2019-06-04", "language": "en", "rating": 5}, {"id": 678258939, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d195113-r678258939-Parc_d_Atraccions_Tibidabo-Barcelona_Catalonia.html", "text": "It's quite hard to get to and you have to take bus to the entrance. The cable car is old but does the job and is very open to see the views on the way up. The views from above are fantastic. You can see the whole of Barcelona and the mountains around. The fair rides are really cool as you can get even higher and take some amazing photos. The Church of the Sacred heart is awesome, and the inside is as amazing as the outside. Each ride was 2 euros each, and there are toilets and places to eat and relax. Well worth a visit especially if you have children, they will love it. ", "publishedDate": "2019-06-02", "language": "en", "rating": 5}, {"id": 675723514, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d195113-r675723514-Parc_d_Atraccions_Tibidabo-Barcelona_Catalonia.html", "text": "We and the children had a lot of fun here. Not everything was opened, in fact we saw much less people that what we expected but we really a great afternoon. It’s good for families at any time of the year", "publishedDate": "2019-05-22", "language": "en", "rating": 5}, {"id": 673443294, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d195113-r673443294-Parc_d_Atraccions_Tibidabo-Barcelona_Catalonia.html", "text": "This is another underrated attraction at BCN which also happens to be quite cheap compared to other attractions. Getting there can be quite a long way, with the need for funicular. Costs around 7.5 euros 2 ways, and with few more euros you can get access to the parc games. There are quite some snack shops on the top. The views are just spectacular! The church is also amazing.", "publishedDate": "2019-05-12", "language": "en", "rating": 5}, {"id": 673177937, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d195113-r673177937-Parc_d_Atraccions_Tibidabo-Barcelona_Catalonia.html", "text": "The views would have been awesome if we’d gone on a sunny day. The church was an unexpected bonus. It is pretty awesome in poorer weather really eerie ", "publishedDate": "2019-05-11", "language": "en", "rating": 3}, {"id": 673081899, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d195113-r673081899-Parc_d_Atraccions_Tibidabo-Barcelona_Catalonia.html", "text": "We decided to stop here as we were on the tourist bus. the funiclar wasn't working so we had to take another bus to get up here.\n\nThe weather that day was amazing, and one can see spetacular views. With the ticket we bought, we could use 3 attractions, that are the attractions from the upper part of the amusement park. for the other attraction, one has to buy other tickets.", "publishedDate": "2019-05-10", "language": "en", "rating": 4}, {"id": 672274206, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d195113-r672274206-Parc_d_Atraccions_Tibidabo-Barcelona_Catalonia.html", "text": "Outstanding views across the city, reliable and frequent transport to and from the venue with open access to a breathtaking cathedral (which seems totally out of place with the fairground attractions around it).\nThe only negative was the service in the restaurant and the quality of food on offer.", "publishedDate": "2019-05-07", "language": "en", "rating": 4}, {"id": 667069197, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d195113-r667069197-Parc_d_Atraccions_Tibidabo-Barcelona_Catalonia.html", "text": "i want to talk about Tibidabo heights ....not about the park which is convenient for the families \nsuch a beautiful place for the people who  love cycling and running ( outdoor )\non the mountain for about 15 K... around Barcelona...\nthe weather was cold ( even raining for some times )... However, you can see Barcelona from the top.... also during enjoy your ( jogging , running or cycling )... the place is unique ... and is not that far from ( down town)...was little bit hard to go there... but it's worth it .....", "publishedDate": "2019-04-16", "language": "en", "rating": 5}, {"id": 666392685, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d195113-r666392685-Parc_d_Atraccions_Tibidabo-Barcelona_Catalonia.html", "text": "Possibly there's more going on in the summer, but in March it was practically deserted and mostly closed. I'd still recommend the experience of getting there via weird transportation options and taking a few slow turns in this cantilevered airplane ride that pulls itself along with a loud propeller. Strangely, most of the conversation we overheard was in Russian.  Most of the food stands were closed, but there was one little kiosk serving surprisingly decent sandwiches and olives. \nNote that the transportation is a bit confusing. There are basically two routes, both involving something that calls itself a funicular, so if you hear that the funicular is closed, the one they mean is an expensive private line that takes you the last leg of the way up the mountain. The other funicular is actually part of the subway system (ie you transfer without paying additional fare) and lets you off about a mile from the park, which you can either reach by walking or by transferring to a little bus. ", "publishedDate": "2019-04-14", "language": "en", "rating": 3}, {"id": 665937397, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d195113-r665937397-Parc_d_Atraccions_Tibidabo-Barcelona_Catalonia.html", "text": "Pretty much had same experience as previous reviewer. \nThere is no notice/ warning that the funicular is not working. And the alternative wasn't good enough. 1 bus every half an hour is poor. It ended up being very packed and too hot. So in all it took about 2 hours to get there. But I thought, \"well, okay, I'm sure it will be worth it\". \nThen the next kicker came - 4 rides open. That's it. 4 rides! And I'd paid nearly 13 euros. Lots of the food concessions were also closed. \nNot sure if this is because it's April and so classed as 'off season'. But again, it isn't acceptable. \nSo basically the whole trip took up the best part of a day. \nI won't be going again. \nOverall bad organisation and communication.", "publishedDate": "2019-04-13", "language": "en", "rating": 2}, {"id": 665459776, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d195113-r665459776-Parc_d_Atraccions_Tibidabo-Barcelona_Catalonia.html", "text": "Let me preface this review by saying that the first two times I went to Barcelona, I had wanted to visit Tibidabo but for various reasons, I just couldn't get there.  I literally planned my third trip to BCN for the sole purpose of finally getting to Tibidabo.  On the day my friend and I decided to get to Tibidabo, we left our hotel at 8 am and easily took the metro and train to the stop and then hopped on a bus.  Unfortunately, the bus dropped us off at the funicular, which was out of service.  By the looks of things, it had been inactive for quite some time. We were assured by several nearby restaurant employees that taxis come here every five minutes to take us to the amusement park.  We waited over 30 minutes.  In that time, more and more buses were dropping off tourists who also had expected to take the funicular to Tibidabo.  I'm not sure why it's not more advertised that the funicular is defective.  Eventually a taxi arrived, so we hopped into it with 4 Ukrainian visitors and for 16 euros, we made it to the park and church area.  The park wasn't open until 11, and even though it was 10:58, we were told to wait. (Yes, you're reading things correctly - it took nearly 3 hours to get there.  Granted that included a 30 minute wait for a taxi, but still.) We parted ways with our new friends and decided to go to the church, which was spectacular.  I climbed all the way to the top for stunning views of Barcelona.  (Though, to be honest, you can go to numerous spots for similar pictures.) Before leaving the States, my friend had been adamant that we buy tickets for the park in advance.  She wanted to purchase the one that allowed us unlimited rides, which was roughly $30.  I begrudgingly agreed.  When we were at the amusement park, the lady at the counter told us that the rides weren't all functioning and told us we should buy a cheaper ticket and use the one we had purchased for a different day.  Well, I wasn't planning on coming back, so I overpaid for the park.  There were only 4 rides open.  We went on a Thursday in March, and it was pretty dead.  I think in total we were at the church and park for about 2 hours, which was significantly less time than it took to get to the actual park.  Maybe because I had glorified this part of Barcelona in my head for several years, but I left feeling disappointed.  Perhaps I missed something in my numerous Google searches, but the fact that the funicular wasn't working, that it took 30 minutes for a taxi, and that the majority of the rides weren't open didn't equal to a pleasant morning.  Yes, the views were stunning, but I wouldn't go back to Tibidabo if I make it to Barcelona a 4th time.", "publishedDate": "2019-04-11", "language": "en", "rating": 3}, {"id": 664471084, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d195113-r664471084-Parc_d_Atraccions_Tibidabo-Barcelona_Catalonia.html", "text": "I always meant to visit the ‘Magic Mountain’ but it always seemed like a real trek to get to. This time I was delighted to find there’s now a direct bus from Plaça de Catalunya for 3 Euros which takes you right to the gate. The theme park is in a superb location offering the best views over Barcelona and the sea on one side and out towards the Pyrenees in the other. The rides are a little tame (no white knuckle) but there’s enough variety for everyone. It reminded me of the kind of theme parks I loved as a child. The Hotel Kreuger haunted house walk through is brilliant. The iconic Red aeroplane is there but the queue is lengthy and only 10 people can get on at a time. The queues for the other rides were fast moving. All in all I thought it was an excellent way to spend 4 or 5 hours in Barcelona. The discount book from the Bus Touristic also gets you a decent discount.", "publishedDate": "2019-04-07", "language": "en", "rating": 5}, {"id": 662926702, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d195113-r662926702-Parc_d_Atraccions_Tibidabo-Barcelona_Catalonia.html", "text": "My last visit 6 years  ago was great. Maybe this time  i just picked a bad day. First disappointment was no Tram Blau to transport you from the Metro station to the funicular. A bus was in operation. Then when we got to the big square  with the scenic view cafes we found out that the funicular  was kaput too. These historic vehicles are a part of the fun of doing this trip. Another alternative bus was laid on but took about 5 times  as long to transport you to the church and parc d'attractions.  Not impressive. Also the funfare seemed changed and smaller.  Better to check on this areas status before embarking on a day trip. I still enjoyed the great views and the church is truly magnificent. Access  is by L7 metro from Placa de Catalunya  separate entrance as train is run by a different company.", "publishedDate": "2019-04-01", "language": "en", "rating": 3}, {"id": 662166127, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d195113-r662166127-Parc_d_Atraccions_Tibidabo-Barcelona_Catalonia.html", "text": "Visited the park on 23/3/19 with a friend, and we spent an excellent day here enjoying the park and it's facilities.\nFrom the top of the mountain you can take some breathtaking panoramic photos. Riding the Ferris Wheel was particularly enjoyable as you can relax and enjoy the views of both the city below and the incredible church, which, unfortunately we did not have time to visit.\nThe rides in the park are gentler than bigger theme parks, but all were enjoyable, and considering we visited on a hot busy Saturday, the queue times for the rides were very reasonable indeed. The park is family friendly with attractions for all age ranges to experience. \nThere were plenty of food outlets with lots of different options, which were reasonably priced. Taking into consideration the volume of guests in the park, we waited a reasonable amount of time to get our food, although for a large family outing it could be advisable to pack a picnic. \nHowever, if you are planning on having a treat, avoid the Danone Frozen Yogurt outlet at all costs - especially if you want a waffle. The outlet only had one waffle press, and we waited over 45 minutes from queuing to pay until receiving the product.\nI would definitely recommend to others, and would be pleased to make a return trip.", "publishedDate": "2019-03-30", "language": "en", "rating": 5}, {"id": 662084316, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d195113-r662084316-Parc_d_Atraccions_Tibidabo-Barcelona_Catalonia.html", "text": "Had to spent some time home to learn a way there, but it was worth it. The view was not so spectacular, but atmoshpere there was amazing, after spending a week in a noisy city. The church is very beautiful both inside and outside. And the amusement park was great.", "publishedDate": "2019-03-29", "language": "en", "rating": 5}, {"id": 661806739, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d195113-r661806739-Parc_d_Atraccions_Tibidabo-Barcelona_Catalonia.html", "text": "It’s a bit of a trek, but once you get there you are rewarded with the best view of Barcelona!\n\nWe took the tram up which was very scenic and enjoyable.\n\nI could imagine in the peak of the summer months it being very busy so would consider going early to beat the crowds. \n\nWe didn’t bother paying the entrance fee to the actual Parc d’Atraccions as the rides didn’t really appeal to us and is more suited to young families.\n\nThere is also a wonderful church which is also worth checking out when you get there.", "publishedDate": "2019-03-28", "language": "en", "rating": 5}, {"id": 661352843, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d195113-r661352843-Parc_d_Atraccions_Tibidabo-Barcelona_Catalonia.html", "text": "If you need to visit an attraction park then this one has the traditional rides and food. Ferris Wheel, Merry Go Round, popcorn etc. It was larger than expected but still small compared to many. \n\nViews are great and it will be a different perspective from other high points in Barcelona. \n\nParking a car is an issue. We had a ride so it was a really easy visit with a predetermined pick up time. Transit seemed frequent and efficient. (Not more than a bus load waiting for the next bus).\n\n", "publishedDate": "2019-03-26", "language": "en", "rating": 3}, {"id": 660818625, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d195113-r660818625-Parc_d_Atraccions_Tibidabo-Barcelona_Catalonia.html", "text": "The only good thing here is amazing view. Theme park is overcrowded and lots of hours waiting time Most of the attractions are for children. You will feel exhausted while you are on the queue. I only recommend to for the beautiful views and church. Park not worth to go.", "publishedDate": "2019-03-24", "language": "en", "rating": 3}, {"id": 660806731, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d195113-r660806731-Parc_d_Atraccions_Tibidabo-Barcelona_Catalonia.html", "text": "Bonus points for bicycling or trekking to the top. It makes the payoff that much more rewarding. Plus no parking hassles! \n\nExpect lots of visitors snapping selfies and families lined up for the gut wrenching roller coaster or for a tamer cruise on the train. Happy smiles abound. \n\nWe rented road bikes for the climb up and we’re glad for the gears. Finding the road from downtown can be a bit squirrelly but you can easily hug a wheel of another cyclist and they’ll help you out. The roads spiral through neighborhoods that are quintessential to Europe. \n\nBe adventurous and rent a road or e-bike.", "publishedDate": "2019-03-24", "language": "en", "rating": 5}, {"id": 658878385, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d195113-r658878385-Parc_d_Atraccions_Tibidabo-Barcelona_Catalonia.html", "text": "Me and my wife made our own way to the park. We got the metro to avenue tibiado then walked to the funicular (about 15 minutes) which was closed but they had put a bus on instead. You can also catch the local 111 to the park entrance.\n\nThe rides are basic but they have a certain charm, a theme park on a mountain is pretty cool plus they have a monestery and amazing views of Barcelona so please go on a clear day and you will be wowed.", "publishedDate": "2019-03-16", "language": "en", "rating": 5}, {"id": 658814527, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d195113-r658814527-Parc_d_Atraccions_Tibidabo-Barcelona_Catalonia.html", "text": "If you are there with the kids you have to go and take a plane ride :), also great for birdseyeview over Barcelona and some amazingly panoramic photos. It's quite easy to get there, metro - bus 196 - funicular if it works or they provide a special bus, if you have the tickets for the park you have special busses that take you up. And if you are there visit the Church.", "publishedDate": "2019-03-16", "language": "en", "rating": 5}, {"id": 658106434, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d195113-r658106434-Parc_d_Atraccions_Tibidabo-Barcelona_Catalonia.html", "text": "Special and romantic place, especially by night. A point from where you can see Barcelona and its structure.", "publishedDate": "2019-03-12", "language": "en", "rating": 5}, {"id": 655443295, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d195113-r655443295-Parc_d_Atraccions_Tibidabo-Barcelona_Catalonia.html", "text": "Can't imagine who thought it would be a good idea to install an amusement park at the base of a gorgeous Gaudi designed church on the top of a mountain, but it is a travesty that takes away from the beaty of the architecture and is a blight on the landscape.", "publishedDate": "2019-02-28", "language": "en", "rating": 2}, {"id": 654099436, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d195113-r654099436-Parc_d_Atraccions_Tibidabo-Barcelona_Catalonia.html", "text": "The Tibidabo Amusement Park is supposedly on the oldest amusement parks in Europe. To be honest, I am not a big amusement park fan but if you are, then definitely worth checking this place out. What was interesting for me were the bird's eye views of Barcelona from here. It was worth the hike!", "publishedDate": "2019-02-22", "language": "en", "rating": 4}, {"id": 653574066, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d195113-r653574066-Parc_d_Atraccions_Tibidabo-Barcelona_Catalonia.html", "text": "For a theme park on top of a mountain this has to be just incredible! The views alone are just too much! Decided to hike up the mountain which does take about an hour if you’re going to do it. Make sure to bring plenty of water with you! Majority of the park was closed but some rides were open such as the hanging plane, Farris wheel and a few others. \nOn top of the mountain there is also a cathedral which gives you incredible views overlooking Barcelona. I do believe that from the other side you can see mountain tops not sure if France or not but wouldn’t be surprised as it’s quite close to the border. \n\nWould recommend but would advise to go closer to summer. Entrance to the park is free it’s only if you wish to go on the rides you would need to pay. \n\nFor tourists: go on the hop-on hop-off bus as you will get a discount book that includes ticket discounts for this amusement park! ", "publishedDate": "2019-02-19", "language": "en", "rating": 4}, {"id": 652434739, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d195113-r652434739-Parc_d_Atraccions_Tibidabo-Barcelona_Catalonia.html", "text": "Funicular didn't work when we went and at that moment we weren't aware about the others way to go to Tibidabo so we started going up the hill in the old fashion way: walking. We didn't regret at all because the view is amazing, not only the one from the top. Go in the cathedral too. It's so peacefull", "publishedDate": "2019-02-14", "language": "en", "rating": 5}, {"id": 652003586, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d195113-r652003586-Parc_d_Atraccions_Tibidabo-Barcelona_Catalonia.html", "text": "We were in Barcelona with a kid of 6+. We took the underground train from Placa de Catalunya that whizzed us to the final stop up north in no time. We then climbed aboard Tramvia Blau (the Blue Train) and went up all the way to the funicular (for those on a budget, beware: both tickets are pretty costly - but it's fun with a kid). Once atop the hill, we had a bird's eye view of the city and the sea. We also went into a nice church which was nearly level with the clouds (it's nearly a kilometer up). We never tried the attractions park there as those looked a bit daredevilish for a kid of 6+. Overall it was a nice trip (and especially for a kid who loves all sorts of means of transportation).", "publishedDate": "2019-02-12", "language": "en", "rating": 4}, {"id": 651555726, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d195113-r651555726-Parc_d_Atraccions_Tibidabo-Barcelona_Catalonia.html", "text": "Got the hop on hop off to 14 stop green route \nThen €2.20 on bus 196 one way \nWhen you get off go to the white building. The air tram type thing was closed. But it looked like it seen better days. So waited for a bus to take us up. Was a little scary looking over the edge but views were amazing and romantic spot as me and my partner got engaged !!  \nThere is fair ground didn’t use or see prices. Church beautiful and then seeing from bottom at night is beautiful too. Steel so if not mobile probably not best. ", "publishedDate": "2019-02-11", "language": "en", "rating": 5}, {"id": 650179729, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d195113-r650179729-Parc_d_Atraccions_Tibidabo-Barcelona_Catalonia.html", "text": "Very easy to reach by public bus. Funicular ride is awesome. The panoramic views from Tibidabo panorama area are breathtaking. The best views of Mediterranean in Barcelona. The  Sacred Heart Church is also extremely beautiful. Must -see when in Barca.", "publishedDate": "2019-02-04", "language": "en", "rating": 5}, {"id": 649729961, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d195113-r649729961-Parc_d_Atraccions_Tibidabo-Barcelona_Catalonia.html", "text": "I visited in January/start of Feb when alot of maintenance seems to be happening in Barcelona.\n\nThere is meant to be the blue tram from outside of av tibidabo metro. However this was not open. So instead I got on a bus (paid for using my unlimited metro/train/bus travel card) upto the top of the hill - \"funicular de tibidabo\"\n\nThe Funicular was also not operating so we waited around for a replacement bus for this..\nIt was free to get up but it would cost 13 euros to get back down the hill. In the end I actually got a taxi that cost 19 euros to Barceló Sants Station, this saved me atleast half an hour and only cost a few euros more! If there are many of you, I really suggest looking into a taxi.\n\nOnce up into Tibidabo anyway the view is great. Very high and therefore you can see all of Barcelona. I didn't do any of the amusement park stuff but just took in the view and had a wonder around the Church before leaving. It took longer to figure out how to get there than I was there for. But worth it anyway... ", "publishedDate": "2019-02-02", "language": "en", "rating": 4}, {"id": 648089592, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d195113-r648089592-Parc_d_Atraccions_Tibidabo-Barcelona_Catalonia.html", "text": "Mount Tibidabo is one of the main attractions of Barcelona. It is the highest mountain and\ndefinitely worth visiting. The journey to the top requires many modes of transport. You can only\ntake the train to a certain point. Then you need to get a bus which will take you to the foot of the\nMountain. There is a funicular that takes you all the way up from there but unfortunately it was out\nof service when we visited so instead they provided a replacement bus service. \n\nThere are two types of tickets you can purchase, one that allows you entry to the park and a\nselection of the traditional rides. The other more expensive one allows you to go on all the rides\nincluding the roller coaster. Be aware that the rides have height restrictions as with any amusement\npark. The way that they have designed the rides around the mountain over 6 floors with a lift taking\nyou down and up is quite unique.\n\nThere are a few food outlets around the entrance and there is also a famous church which you can\nvisit. The way the church is lit up at night is also quite beautiful and you can see it from most\nparts of Barcelona.", "publishedDate": "2019-01-24", "language": "en", "rating": 5}, {"id": 644856259, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d195113-r644856259-Parc_d_Atraccions_Tibidabo-Barcelona_Catalonia.html", "text": "We did the walk around the amusement park, which was free and when you walked to the top it was incredible the views of the city, then on the way back down, stopped for a snack and a drink. We hopped off the tour bus and unfortunately the little blue trams weren’t working but a local bus goes to the top. Just beautiful on a sunny day ", "publishedDate": "2019-01-09", "language": "en", "rating": 5}, {"id": 644567007, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d195113-r644567007-Parc_d_Atraccions_Tibidabo-Barcelona_Catalonia.html", "text": "We spend there the whole afternoon, the views was breathtaking, at the time of sunset we've been sitting in a big circle ... unimaginably beautiful", "publishedDate": "2019-01-08", "language": "en", "rating": 5}, {"id": 643799794, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d195113-r643799794-Parc_d_Atraccions_Tibidabo-Barcelona_Catalonia.html", "text": "Not far from the city center and easy to access by bus metro or car, it is an interesting park to visit. Mostly for kids activities but there is a nice view over Barcelona", "publishedDate": "2019-01-05", "language": "en", "rating": 4}, {"id": 642791947, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d195113-r642791947-Parc_d_Atraccions_Tibidabo-Barcelona_Catalonia.html", "text": "We got there with a tube from plaza Catalonia and then we took the fenicular. You don't need to even exit the station to take the fenicular, you can use the same ticket. From the station you can take the bus or walk. Mind however that buses are very small and they take only 15-20 ppl. There are huge queues so it might be better to walk. \nThe view from the hill is spectacular. You can enter the church free of charge, think tickets are needed to enter the tower. In general it's a nice experience but it takes some time to reach the place.", "publishedDate": "2019-01-01", "language": "en", "rating": 5}, {"id": 641058473, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d195113-r641058473-Parc_d_Atraccions_Tibidabo-Barcelona_Catalonia.html", "text": "The hop on hop off bus drops you off at the base of a very steep and twisty road. After we hiked all the way up to the top to catch the lift to the top of the “mountain” to Tibidabo the found out the lift was closed! CLOSED!!! With. No. Signage. anywhere at the bottom to tell us our hike was for nothing. Extremely disappointed!", "publishedDate": "2018-12-22", "language": "en", "rating": 1}, {"id": 639975744, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d195113-r639975744-Parc_d_Atraccions_Tibidabo-Barcelona_Catalonia.html", "text": "The park has many levels of fun, most of the rides are designed to take full advantage of the view,Hotel Krueger is a must, don;t miss it. \nIs a great park for everyone.", "publishedDate": "2018-12-16", "language": "en", "rating": 4}, {"id": 639589416, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d195113-r639589416-Parc_d_Atraccions_Tibidabo-Barcelona_Catalonia.html", "text": "Didn’t manage to get on the funicular which was a great shame. We took the bus and strolled around for a few hours. \n\nThe view is spectacular and if you visit the church you can go even higher !\n\nWe entered the fairground although didn’t go on the rides, looks good though.\n\nBusy even for a cold day in December!\n\n", "publishedDate": "2018-12-14", "language": "en", "rating": 5}, {"id": 639089997, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d195113-r639089997-Parc_d_Atraccions_Tibidabo-Barcelona_Catalonia.html", "text": "great place for all the family, plenty to do and see, loads of places to eat, the only thing I didn't like was you couldn't buy single tickets for rides so a bit disappointing when you have young children, but worth a visit.", "publishedDate": "2018-12-11", "language": "en", "rating": 5}, {"id": 638887777, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d195113-r638887777-Parc_d_Atraccions_Tibidabo-Barcelona_Catalonia.html", "text": "it was the most beautiful experience in Barcelona. It's such a magical place you have to see when visiting Barcelona. This place is a trip for 1/2 day or all day.lot of atraction in park and amazing Basilica,you must see it! Place is interesting when weather is nice.", "publishedDate": "2018-12-11", "language": "en", "rating": 5}, {"id": 638492537, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d195113-r638492537-Parc_d_Atraccions_Tibidabo-Barcelona_Catalonia.html", "text": "This is the second oldest amusement park in Europe. The rides are'nt really special because is a par for young children not for adults or teenagers. The views of the city are great. You can access to the highest part of the park without the whole day ticket and enjoy some the rides buying a single ride ticket.", "publishedDate": "2018-12-09", "language": "en", "rating": 4}, {"id": 637966738, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d195113-r637966738-Parc_d_Atraccions_Tibidabo-Barcelona_Catalonia.html", "text": "This place worth the visit. Only thing I didn’t like, you can buy single tickets for rides but only for few attractions. Which I would say it’s shame. Don’t think it’s “a must” to buy ticket for whole park. Can enter without ticket and just walk around. Nice views there. ", "publishedDate": "2018-12-07", "language": "en", "rating": 4}, {"id": 636844902, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d195113-r636844902-Parc_d_Atraccions_Tibidabo-Barcelona_Catalonia.html", "text": "I kept seeing this from a distance when sightseeing other attractions and finally found out the name and decided to visit, we took the brown metro line to Av. Tibidabo, then walked across the road where you get a 196 bus to the ticket office, however the tram was closed so you paid for a bus, it was €25.40 for two and we only got the see the top layer of the park as the “blue”band only lets you see that. \nWe tried to go up the church but was €3.50 and we didn’t have any cash (would be using card) so wasn’t able to go up! \nHowever went on the high ride to see the views and we wasn’t disappointed. \nAll in all make sure you take cash to go up to church. ", "publishedDate": "2018-12-01", "language": "en", "rating": 4}, {"id": 636783083, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d195113-r636783083-Parc_d_Atraccions_Tibidabo-Barcelona_Catalonia.html", "text": "Being on the top of the city you will have a spectacular view on Barcelona. It worths to go there, do not miss it! :)", "publishedDate": "2018-11-30", "language": "en", "rating": 5}, {"id": 636736644, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d195113-r636736644-Parc_d_Atraccions_Tibidabo-Barcelona_Catalonia.html", "text": "We had an amazing time !!!! the view is breath taking , but that didn't take away from the great fun we had , we will come back soon", "publishedDate": "2018-11-30", "language": "en", "rating": 5}, {"id": 635547179, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d195113-r635547179-Parc_d_Atraccions_Tibidabo-Barcelona_Catalonia.html", "text": "My wife and I visited Barcelona in October and pre-booked tickets to Tibidabo as there was only the Sunday we could go.\n\nUnfortunately due to the weather  the Park was closed. However we only found this out after waiting for an hour at the bus stop  . No information on the web site, and had to make a Twitter enquiry to find this out.\n\nI have now sent 2 emails to Tibidabo requesting my money back as I could not attend through no fault of my own. I’ve had zero response so far. Entirely unacceptable.", "publishedDate": "2018-11-25", "language": "en", "rating": 1}, {"id": 634913566, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d195113-r634913566-Parc_d_Atraccions_Tibidabo-Barcelona_Catalonia.html", "text": "Despite being there while it was raining and cold, my family & I had an amazing time!!! Quite a few of the rides were still operating even while it was raining. I'm sure the view is breath taking, but that didn't take away from the great fun we had. We'll definitely be returning with hopes of better weather!", "publishedDate": "2018-11-21", "language": "en", "rating": 5}]}}]