[{"locationId": 244211, "name": "CosmoCaixa", "placeType": "ATTRACTION", "reviewListPage": {"reviews": [{"id": 751564615, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d244211-r751564615-CosmoCaixa-Barcelona_Catalonia.html", "text": "The wife and I made our way here via bus and spent 2-3 hours looking around, it was an enjoyale experience but nothing that blew us away or that was overly memorable.  \n\nThe building itself was laid out well and very modern and at only 8 euro per adult very reasonably priced.  After making our way through the exhibits we popped outside with a snack we bought from the cafe, which again was reasonably priced for somewhere like this.\n\nIf you are in Barcelona for a few days and have kids then yes this is a great place, as two adults it was good but a little out of town and in hindsight we probbly wouldn't have made the journey.", "publishedDate": "2020-03-21", "language": "en", "rating": 4}, {"id": 750294608, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d244211-r750294608-CosmoCaixa-Barcelona_Catalonia.html", "text": "CosmoCaixa Barcelona is a science museum.\nIt has permanent exhibitions, \"the Universe room\" where we can discover the cosmos and its evolution from the big-bang to the present. The \"Flooded Forest\" recreates an Amazonian ecosystem with piranhas, crocodiles and other animal and plant species, the \"geological wall\", the Planetarium, etc.\nInteractive museum, highly recommended for children and young people and not so young", "publishedDate": "2020-03-10", "language": "en", "rating": 5}, {"id": 749235521, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d244211-r749235521-CosmoCaixa-Barcelona_Catalonia.html", "text": "many people slow service they should have more boxes in service...I hope you can improve this \nfor all the neighbors", "publishedDate": "2020-03-05", "language": "en", "rating": 4}, {"id": 746989376, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d244211-r746989376-CosmoCaixa-Barcelona_Catalonia.html", "text": "We spent five hours in there at the request of our kids. They loved it. Many hands on experiences for them so fun and accesible for young kids. A bit far from the most touristic area of Barcelona. You can picnic in the garden ", "publishedDate": "2020-02-23", "language": "en", "rating": 5}, {"id": 746278547, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d244211-r746278547-CosmoCaixa-Barcelona_Catalonia.html", "text": "We visited in February 2020 after my son found it in a guide book and was intrigued by the rain forest exhibit - I thought we'd spend a couple of hours here and then move on to somewhere else - Having arrived at just after 10 am , we ended up spending the whole day here . The whole museum is brilliantly laid out with every exhibit being both interesting / fun and educational . Having been to some of the best museums in the world , I'd put this one right up there - from the rain forrest , to the clever physics exhibits teaching about waves and the forces of nature a great mix of live animals in there rain forrest to b reliant scientific exhibits, my 9 year old loved it and would happily go back for another full day there ( so would I ) - well worth a visit , particularly if you have kids - Bien hecho Barcelona !", "publishedDate": "2020-02-20", "language": "en", "rating": 5}, {"id": 745278286, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d244211-r745278286-CosmoCaixa-Barcelona_Catalonia.html", "text": "This is a wonderful museum for everyone (kids or adults) who wants to know about the world around as well as to try the laws of nature.\nPlenty of physics experiments to perform yourself! Experiments are accompanied with a short yet understandable explanation (in English and French, apart from Spanish and Catalan).\nActually we did not manage to see the whole museum in one day - the kids (5 and 8 years old) got tired, running from one experiment to another!\nIn addition to all the exciting installations to experiment with, this museum contains a restaurant with very reasonable prices.\nWe definitely recommend this museum and will come back next time we are in Barcelona!", "publishedDate": "2020-02-15", "language": "en", "rating": 5}, {"id": 744854283, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d244211-r744854283-CosmoCaixa-Barcelona_Catalonia.html", "text": "Spanish helpful but not required. Sweet spot age wise is mid primary, but my 12 year old loved it. We go with regularity as they have new exhibits and movies.", "publishedDate": "2020-02-13", "language": "en", "rating": 5}, {"id": 740421918, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d244211-r740421918-CosmoCaixa-Barcelona_Catalonia.html", "text": "We (couple in the fifties) spent an afternoon and not even make it through half the exhibition. I highly recommend this, if you are at least curious about science. Expect to spend at least 3-4 hours, if you want to get a glimpse of everything. A lot of phenomenons are illustrated, of course it’s not possible to provide a lot of background explanation.", "publishedDate": "2020-01-21", "language": "en", "rating": 5}, {"id": 738520003, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d244211-r738520003-CosmoCaixa-Barcelona_Catalonia.html", "text": "Wow!  As a retired middle school Science teacher, this place blew me away!  It was actually my husband's idea, and my expectations weren't that high.  CosmoCaixa is very new, huge, and well laid out.  It covers a great many Science topics in clear, concise terms, and has some very creative \"hands on\" displays I've never seen before in the US (OMSI in Oregon, Pacific Science Center in Seattle, The Exploratorium in SF).  When we arrived, it was early morning on a school day, so it was teeming with kids; however, due to the size of the place, we never felt cramped or crowded.  Also got to \"play\" with many of the displays with little or no competition with the students.  Because we spent several hours there, we also had lunch in one of their cafes onsight--the food was good, great selection, and reasonably priced.  We were the only two people there, so either we were dining early, or the kids were eating elsewhere.  We spent the entire day there, and it was really fun--I can only imagine how great it would be if you went there with your own children!  I would really recommend this not just for families, but also for us older adults.", "publishedDate": "2020-01-11", "language": "en", "rating": 5}, {"id": 738056555, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d244211-r738056555-CosmoCaixa-Barcelona_Catalonia.html", "text": "The best science museum i ever seen ... different areas with scientific experiments. Its different from the typical touristic places. Very very cool .. located near tibidabo .. loved this place", "publishedDate": "2020-01-09", "language": "en", "rating": 5}, {"id": 736304216, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d244211-r736304216-CosmoCaixa-Barcelona_Catalonia.html", "text": "The museum is located out of the city and his quite hard to find tbh, had to take a taxi to get there. The museum is big and good however it’s extremely crowded and quite overwhelming and the food options are crap Tbf ", "publishedDate": "2020-01-02", "language": "en", "rating": 4}, {"id": 734171160, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d244211-r734171160-CosmoCaixa-Barcelona_Catalonia.html", "text": "Yesterday I visited this museum, I would say better to spend 6 euro and time here then 20 euro in placa de musica ( I am telling because I spent today 🤪, though strictly personal). There are so many things to see, understand even for adults l, venturi effect rain forest how shape works for different purpose along with Gaudí example in sagrida familia, I spent almost 5 hours today and came out with forgetting 20 euro spending earlier though you can enjoy without inclination towards science but recommend to go if you have thirst to know", "publishedDate": "2019-12-22", "language": "en", "rating": 5}, {"id": 733128588, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d244211-r733128588-CosmoCaixa-Barcelona_Catalonia.html", "text": "My mum took me (21 yrs old) and my 13 year old brother to Barcelona for vacation! \nWe sadly only made it to the museum just under 2 hours before closing and the planetarium (which my brother was most looking forward to) was closed, but we anyway went in and I am SO GLAD we managed to fit this place in!!!! it was incredible!!!!!! so interesting and filled with many different categories! the rainforest was INSANE!!!! I’m a big fan of the show River Monsters and was so thrilled to see a real Arapaima !😱 \nmy family loves museums and this was really the best we’ve ever been to- we plan on coming back to Barcelona SPECIFICALLY for this museum!!!!!\nincredible!! thank you!!!", "publishedDate": "2019-12-16", "language": "en", "rating": 5}, {"id": 731977397, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d244211-r731977397-CosmoCaixa-Barcelona_Catalonia.html", "text": "Very interesting museum near the Barcelona Beach. Great exhibition, wonderful exhibits and presentations of the creation of cosmos and life on Earth. We really enjoyed it. The entrance ticket was fair priced too. Only 6 euros per person.", "publishedDate": "2019-12-10", "language": "en", "rating": 5}, {"id": 731359789, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d244211-r731359789-CosmoCaixa-Barcelona_Catalonia.html", "text": "This museum was really great! I am an adult and visited on my own, and I had a great time. A lot of the museum is interactive, which makes people think it's only for children, but interacting with physics is a great way for adults to learn too, and it's fun for all ages! The regular exhibits were nice, especially all of the interactive physics demos on the bottom floor. I also really liked both temporary exhibits, about mirrors and fossils found in caves near Barcelona. The price is very affordable, which is super nice!\nAll signs and explanations are written in Catalan, Spanish, and English. Some of the exhibits also had French.", "publishedDate": "2019-12-08", "language": "en", "rating": 5}, {"id": 728667327, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d244211-r728667327-CosmoCaixa-Barcelona_Catalonia.html", "text": "Could of probably spent half a day here and kids would love it very cheap entry think it was just over 6 euro each for adult such good value for money. It’s like a science museum with a rainforest inside of it was so much fun and loads of interesting things to see and interact with definitely recommend going especially if you have a day were the weather isn’t so good. ", "publishedDate": "2019-11-24", "language": "en", "rating": 5}, {"id": 724524615, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d244211-r724524615-CosmoCaixa-Barcelona_Catalonia.html", "text": "Everyone should visit CosmoCaixa - it's cool with it's astonishing piece of nature (imitation of a tropical river with fish and other animals, plants and birds) on the ground floor. Lots of scientific stuff and experiments which you can do yourself. The museum is really cheap for everyone. And free if you have a Caixa bank card. This museum will definitely entertain and educate both adults and children. Don't miss the chance to have a great time with your family and friends. ", "publishedDate": "2019-11-06", "language": "en", "rating": 5}, {"id": 723341199, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d244211-r723341199-CosmoCaixa-Barcelona_Catalonia.html", "text": "We took a taxi from our hotel costing 6 euros, as the museum is up hill...a really big hill as there was not a really close metro.  Saving our feet was important as around Barcelona we comfortably covered 18k steps each day.  The museum is huge, we spent 1/2 day, and could have been there longer.  There are many interactive models for young minds, and covers from the dawn of the universe, evolution, science, geology, planetarium, and extraordinarily jungle aquarium, to current day ecological issues.  For our child this was an entertaining break from the rest of the culture of Barcelona, she loved it.  The all you can eat restaurant was a good price and a lovely respite before moving back down to the city.  Highly recommended for all the family.  The planetarium show was lovely.", "publishedDate": "2019-11-02", "language": "en", "rating": 5}, {"id": 721564374, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d244211-r721564374-CosmoCaixa-Barcelona_Catalonia.html", "text": "Wow what an experience here!\n\nMyself, wife, teenage daughter, 10yr boy, 7yr boy & 3yr boy all VERY much enjoyed the whole experience! My teenaged daughter already had the mind set of i won’t like it & didn’t want to go but she was swayed and really impressed!\n\nMust say the entrance fee was €6 euros an adult & children under 16 was free! So €12 euros for us all. There was another experience or talk which was extra but we certainly didn’t need anything extra to do. \n\nSo we went here on a day with not so good weather. The intentions of only going for an hour ended up being over 3 & we only left then because we was hungry. \n\nThe first impression when you enter through the gates you think is this all, but then you just go down & around and it just all opens up!\n\nSo many buttons to push, twist etc. All rather hands on and lots to do and see. Mirrors of all different shapes & sizes. A rain forest. \n\nI would highly recommend this place. \n\nThe only slight set back was parking in the car park next to museum cost €8.50 which I felt was a little pricy but nevertheless €20.50 for a day out for the 6 of us was incredible. ", "publishedDate": "2019-10-26", "language": "en", "rating": 5}, {"id": 717885658, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d244211-r717885658-CosmoCaixa-Barcelona_Catalonia.html", "text": "In October we have been to Barcelona again. Since the weather was cloudy, we decided to visit Cosmo Caixa, an interactive science museum for the whole family.\nOur first positive surprise was the entry fee. The children had free admission and for the parents we paid a more than fair 6€ per Person.\nThe museum itself is absolutely outstanding in my opinion. Lots of expositions on different topics, many interactive experiments and showcases and all in a beautiful architecture setting. Our children, usually not museum fans, were totally engaged and we all loved the time spent there. Without being able to see or do everything we have spent about 3 hours. We definitely recommend visiting Cosmo Caixa.\nWe recommend going there by train. It is a 10 minute walk from Av. Tibidabo train station through a beautiful urban setting. The parking lot of Cosmo Caixa is big but also expensive and navigating Barcelona itself is also a lot easier with the train.", "publishedDate": "2019-10-13", "language": "en", "rating": 5}, {"id": 716218720, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d244211-r716218720-CosmoCaixa-Barcelona_Catalonia.html", "text": "Having read such effusive reviews of this science museum, I was very curious to see what all the hype was about - in a word - WOW!! \nUnfortunately, our day didn’t go to schedule, and we only arrived at the museum at 6:30 pm (it closes at 8). This museum deserves at least 5 hours, and we weren’t able to see the planetarium (last entry at 5:30). However, I’m soooo glad we went nonetheless. \nIt’s hard to describe the incredible rain forest they have growing in the museum - quite unlike anything I’ve ever seen. My 13 year old son and 21 year old daughter were as dumbfounded as I was - it’s breathtaking! \nThere are a number of floors, but we only really managed to explore the rain forest and the ground floor. \nThe ground floor has many interactive stations, and many fascinating exhibits. This isn’t just the best science museum I’ve visited - it’s the best museum, period!! \nIt’s also ridiculously cheap - 6 Euro per person, and under 16’s go free of charge. \nWe’ll definitely be back (for a full day visit) next time we’re in Barcelona. Can’t recommend it highly enough!", "publishedDate": "2019-10-07", "language": "en", "rating": 5}, {"id": 715411989, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d244211-r715411989-CosmoCaixa-Barcelona_Catalonia.html", "text": "Very poor. Exposition is exactly the same as in Nemo Museum (AMS). A lot of stuff, but nothing to do with it, even if you're high ", "publishedDate": "2019-10-04", "language": "en", "rating": 2}, {"id": 714265470, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d244211-r714265470-CosmoCaixa-Barcelona_Catalonia.html", "text": "If you have the time visit this museum it is very well organised and there are very intresesting stuff not only for tech nerds but for young adults and children as well as older people. It is very easy to get there by bus too. It has amazing view over the city and a nice cafeteria outside", "publishedDate": "2019-09-30", "language": "en", "rating": 5}, {"id": 713043842, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d244211-r713043842-CosmoCaixa-Barcelona_Catalonia.html", "text": "I enjoyed too much. Everything for children there.Amazing place to visit with family. This is the right place if you want to enjoy everything in one place.", "publishedDate": "2019-09-25", "language": "en", "rating": 5}, {"id": 710870336, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d244211-r710870336-CosmoCaixa-Barcelona_Catalonia.html", "text": "I went to the science museum with my kids ages 15, 13 and 8 years old.  We spent hours there.  My husband was surprised but all the hands on experiments definitely kept the kids interested.  Worth a stop if your kids need a break the sight seeing. ", "publishedDate": "2019-09-18", "language": "en", "rating": 5}, {"id": 710671020, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d244211-r710671020-CosmoCaixa-Barcelona_Catalonia.html", "text": "A little bit out of the way from the main city, but easy enough to reach by bus. \nVery interesting and well laid out museum with many different topics and displays. \nA nice place to wander around and take in information", "publishedDate": "2019-09-17", "language": "en", "rating": 5}, {"id": 710566433, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d244211-r710566433-CosmoCaixa-Barcelona_Catalonia.html", "text": "The place is a little far away, you have to come by bus, you can be there for a few hours there are many activities for children, sure they will enjoy it, you can snow the buffet at lunch just not tasty", "publishedDate": "2019-09-17", "language": "en", "rating": 5}, {"id": 706385432, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d244211-r706385432-CosmoCaixa-Barcelona_Catalonia.html", "text": "After visiting almost every science museum in the world, I ranked this one at the top.\nIt deserves with no doubt a visit when in Barcelona even if it is located out of the touristic part when most of the attractions are located.\nValuable for all ages", "publishedDate": "2019-09-04", "language": "en", "rating": 5}, {"id": 705722833, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d244211-r705722833-CosmoCaixa-Barcelona_Catalonia.html", "text": "We visited August 2019. There was so much to do, over 5 floors. Interactive, educational. We spent a few hours but didn’t see half of it. Good for all ages. Free entry for children. There were chargeable optional extras. EG we bought a 5 euro ticket where children got to experience touching frogs, sea anemone, snakes, lizards and more in an hour long session.", "publishedDate": "2019-09-02", "language": "en", "rating": 5}, {"id": 703248190, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d244211-r703248190-CosmoCaixa-Barcelona_Catalonia.html", "text": "Have been to Barcelona a few times and didn't think about this a place to visit. Amazing for kids. Ranks up there with some of the best in the world. It is a trek out of town but has stunning views. Just plan your way back in town with plenty of time.", "publishedDate": "2019-08-26", "language": "en", "rating": 5}, {"id": 703224520, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d244211-r703224520-CosmoCaixa-Barcelona_Catalonia.html", "text": "We spent an extremely enjoyable half-day (about six hours!) here. There are dozens of exhibits, many of them hands-on, and all of them worked - a first for all the technical museums we have visited. Beautiful setting, fascinating exhibits, explanatory texts of just the right length - and all that for a very low (for Barcelona) price. Well worth a visit, especially with kids.", "publishedDate": "2019-08-26", "language": "en", "rating": 5}, {"id": 702085233, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d244211-r702085233-CosmoCaixa-Barcelona_Catalonia.html", "text": "My friend and I arrived here, having originally intended to visit Parc Guell, around 3:00 in the afternoon.  We wanted to visit this museum, but what we could not have anticipated was how big this museum is! Furthermore, in my experience price is often correlated with the time you can expect to spend somewhere (not perfectly correlated, but this is often true to an extent).  In CosmoCaixa, this is not true at all! This place is really cheap compared to most attractions, with or without a Barcelona card, but we spent 4 hours there and didn't do everything! Expect to be here a while folks!\n\nI'll try and describe the layout of the place during our visit, though if there is a specific path you're supposed to take, we didn't! We started at the top next to the souvenir shop.  There is a very tall tree in the middle of a spiraling staircase, but before you start to descend, there are plenty of pieces around the staircase to view! After that we descended right to the bottom, past the planetarium, which we unfortunately didn't visit.  At the base, there is an aquarium right at the back, and a huge room of attractions and pieces to view.  There is a mirror exhibit, a geological exhibit (slightly elevated from the main room), and then in the middle you've got everything! We were in this section of the museum until closing.  \n\nIt's a definite visit and of course you can go through the museum at your own speed, and pick and choose what you want to look at while you're there.  Be wary of children running around and taking control of the thing you're using! It's a fantastic museum and we spent a whole afternoon there!", "publishedDate": "2019-08-23", "language": "en", "rating": 5}, {"id": 700862432, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d244211-r700862432-CosmoCaixa-Barcelona_Catalonia.html", "text": "We spent 6 hours in here with two teens and it wasn’t enough. \nSo much effort has been put into the many exhibitions and displays. \nThe translations are not dumbed down and are written better than some secondary level science school texts. \nIncredibly interactive and hands on. Beautiful courtyard where you can sit to eat your lunch. We spent the majority of our time on lower level 5 and still I missed stuff out. \nDidn’t get the chance to visit the planetarium!! \nWould definitely recommend ", "publishedDate": "2019-08-19", "language": "en", "rating": 5}, {"id": 697576115, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d244211-r697576115-CosmoCaixa-Barcelona_Catalonia.html", "text": "For sure the best museum in which we have ever been featuring all kinds of interesting and interactive stuff. We were there for about 4 hours. Loved everything about it! And all was for a reasonable price of 5 euros.", "publishedDate": "2019-08-10", "language": "en", "rating": 5}, {"id": 694883537, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d244211-r694883537-CosmoCaixa-Barcelona_Catalonia.html", "text": "Must be one of the best museums in Barcelona. Simply amazing with so many fun stuff to do apart from just view scientific discoveries.", "publishedDate": "2019-08-02", "language": "en", "rating": 5}, {"id": 694770271, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d244211-r694770271-CosmoCaixa-Barcelona_Catalonia.html", "text": "The museum is worth a visit, very fun, good price. Besides the regular exhibition, there’s also a possibility to visit planetarium and go on a guided excursion “touch” targeted for kids to touch plants, animals. Even they are for additional price (the planetarium movie is 5€), the events are happening at certain hours, which if knew in advance can be nicely matched as the time to spend in the museum is 2-4hrs. Additionally, the tickets have to be bought at the same ticket office where the entrance ticket. Meaning that after going inside and deciding on what show to attend, one would need to leave the exhibition, buy the additional tickets and to get back in, get another ticket for the main exhibition. \nSo check the schedule, buy all the tickets from the beginning. Worth it!  ", "publishedDate": "2019-08-01", "language": "en", "rating": 5}, {"id": 691884242, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d244211-r691884242-CosmoCaixa-Barcelona_Catalonia.html", "text": "This is the best science museum we have ever visited. My son had a blast exploring everything. We could have gone day after day and My son would have been happy. In will be honest, my husband and I had a lot of fun, too. Take the whole family. Giù solo non ne disappointed. ", "publishedDate": "2019-07-22", "language": "en", "rating": 5}, {"id": 691826428, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d244211-r691826428-CosmoCaixa-Barcelona_Catalonia.html", "text": "We paid two general entrance and the kids are free. We add the touch the animal activity that is a supplement to the general entrance. This activity is about a hour and kids enjoyed it. \nThe museum is very nice because it is interactive. You can touch, try some experiences, see some animals. \nMy only complain is the location are not very explained. It is hard to know where you are. But I highly recommend it if you want to spend a good day with your kids. ", "publishedDate": "2019-07-22", "language": "en", "rating": 5}, {"id": 691481238, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d244211-r691481238-CosmoCaixa-Barcelona_Catalonia.html", "text": "My son (15) and I spent almost half a day experiencing the new exhibition “Universe” and had a lot of fun and also new insights into the fascinating ways in which our world, our body and the universe are working. Great!", "publishedDate": "2019-07-21", "language": "en", "rating": 5}, {"id": 688296927, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d244211-r688296927-CosmoCaixa-Barcelona_Catalonia.html", "text": "Look at the science from the different perspective! Interactive exposition with a great deal of curios stuff, a mini zoo, and the observatory. Go and check it yourself! If you're a member of the CaixaBank, the entrance is free :)", "publishedDate": "2019-07-09", "language": "en", "rating": 5}, {"id": 688031932, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d244211-r688031932-CosmoCaixa-Barcelona_Catalonia.html", "text": "Having been disappointed by unreliable information elsewhere on the Barcelona tourist website we decided to give it a second chance and visit the Cosmocaixa. We were guided to a metro station literally miles away, and it took us so long to find the musuem (absolutely no directions until you're nearly there, and then the sign points the wrong way!) that it wasn't worth going in as we had timed tickets for something else.\nAs such, we used google maps to catch the V13 bus and return a different day (much better route). No longer trusting the visit Barcelona website we cross-referenced the CosmoCaixa's own site and google to ensure it would be open and had availability for all events.\nWhen we reached the ticket desk we were informed that floor -5 and the planetarium were out of bounds until 3pm (it was half eleven) but that we could enter and visit floors 0, -1 and -2 whilst we waited. We double checked online, this had nit been mentioned ANYWHERE!\nThinking it was a kind gesture, we went in. Floor -2 is EMPTY, except for the Creativity Lab, which was closed.\nFloor -1 is the Science Garden, which can be accessed for free anyway, and the pricey restaurant.\nAt this point, having been looking forward to visiting since we booked our holiday in February, I was in tears.\nWe left through the gift shop, which (when my partner looked at a little something to try and cheer me up) was nothing short of extortion!\nWe have been to science museums around the world, yes it is cheap, but no, it is NOT worth it!! Save your money and go to the park and play on the swings instead!", "publishedDate": "2019-07-09", "language": "en", "rating": 1}, {"id": 683402856, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d244211-r683402856-CosmoCaixa-Barcelona_Catalonia.html", "text": "This was a very unusual and interesting museum. Mostly we liked the part, connected with the universe.", "publishedDate": "2019-06-22", "language": "en", "rating": 5}, {"id": 682977350, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d244211-r682977350-CosmoCaixa-Barcelona_Catalonia.html", "text": "As others have said, about one third of the museum is closed for renovation. My expectations were quite high after the positive reviews here and I was indeed very pleased with the rainforest section. However, what was left of the museum that was not being renovated wasn't that impressive. And as mentioned before, some sections are at extra cost, so we skipped those. In the end all we did was play with mirrors and look at a great \"mixed\" animal exhibit. We spent about an hour and a half here whereas we counted on 3 hours.", "publishedDate": "2019-06-20", "language": "en", "rating": 4}, {"id": 680082662, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d244211-r680082662-CosmoCaixa-Barcelona_Catalonia.html", "text": "Having visited the Nemo and Technorama science museums in the past with my family, Cosmocaixa is very disappointing in comparison. \n\nThe pros for me are:\n- cheap entrance fee for the basic exhibits\n- nice rainforest section\n- not crowded when we're there on Saturday \n\nThe cons:\n- You have to pay extras for interactive exhibits and when we're there, only the Planetarium movie had English as an option. \n- very limited things to do. As others mentioned,  half the area is going through renovations. \n\nIf you haven't veen to a science museum, then Cosmocaixa is probably ok to spend a couple of hours. However, if you have visited good science museums,  I would skip this one. \n\n", "publishedDate": "2019-06-08", "language": "en", "rating": 2}, {"id": 679804707, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d244211-r679804707-CosmoCaixa-Barcelona_Catalonia.html", "text": "Fabulous place,  something for every age,  the interactive experiments were loved by my 6 year old, younger could enjoy them too, and older would get even more or if then because they would understand it more.   Even though the Planetarium was closed, which I would lived to have seen,  we still spent over 2 really enjoyable hours here and will definitely visit again to see the rest.   Loved the outside exhibitions too especially Archimedes Screw.  ", "publishedDate": "2019-06-07", "language": "en", "rating": 5}, {"id": 679099132, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d244211-r679099132-CosmoCaixa-Barcelona_Catalonia.html", "text": "We went to find that half the museum was closed for building new displays (not yet open) and that toca toca isn’t able to be done on weekdays with families as it is only open to school groups. Our kids really enjoyed the mirrors display and the rainforest but other than that there wasn’t much we could do. The planetarium didn’t open until 1pm so I would plan to get there after lunch. ", "publishedDate": "2019-06-05", "language": "en", "rating": 3}, {"id": 675421572, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d244211-r675421572-CosmoCaixa-Barcelona_Catalonia.html", "text": "We had a great time at the cosmocaixa. The kids didnt want to leave. I would recommend this place to anyone.", "publishedDate": "2019-05-21", "language": "en", "rating": 5}, {"id": 669817716, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d244211-r669817716-CosmoCaixa-Barcelona_Catalonia.html", "text": "Our family really enjoyed this fantastic museum. Due to renovations it was partially closed when we visited (and therefore the entry price was reduced) but still well worth the effort. Great displays, particularly the space exhibit, and a cool rainforest area with birds, fish etc. ", "publishedDate": "2019-04-28", "language": "en", "rating": 5}, {"id": 668985535, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d244211-r668985535-CosmoCaixa-Barcelona_Catalonia.html", "text": "We had a great day at the CosmoCaixa museum. Fun, interactive exhibits and loads for our 3 year old to see and do. The only downside was that we didn’t realize the Toca Toca exhibition had to be booked in advance so we missed out on that. It was a shame that a large part was under renovations but we still managed to spend the best part of a day there. Great cafe too.", "publishedDate": "2019-04-24", "language": "en", "rating": 5}, {"id": 668887939, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d244211-r668887939-CosmoCaixa-Barcelona_Catalonia.html", "text": "We’re concerned by their renovation schedule but we went there anyway. And we were delighted to be there as their half exhibitions were so good. Their approach to science was smart and creative. The nerdy functions were quite complete. My 4.5 years old son spent half a day there and wanted to stay longer. The grandparents were also enjoyed by their smart displays. \nWe loved it there and will definitely come back when they complete their renovations.", "publishedDate": "2019-04-24", "language": "en", "rating": 4}, {"id": 668312845, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d244211-r668312845-CosmoCaixa-Barcelona_Catalonia.html", "text": "Admission was half price because the bulk of it is closed for construction. The kids were bored quite easily (7 and 9 yrs old). I would skip it unless all areas are open.", "publishedDate": "2019-04-22", "language": "en", "rating": 1}, {"id": 667857046, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d244211-r667857046-CosmoCaixa-Barcelona_Catalonia.html", "text": "Loved visiting this place 5 euros for a family of four, so many interesting exhibits but the highlight by far is the small area of rainforest complete with giant river fish, crocs and capybara. Our kids loved spending an afternoon here.", "publishedDate": "2019-04-20", "language": "en", "rating": 5}, {"id": 663507234, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d244211-r663507234-CosmoCaixa-Barcelona_Catalonia.html", "text": "Great site, high above Barcelona, agood break before Tibidabo. The outdoor cafe is worth the visit on its own, for the views. The centre has an innovative rain forest with weird and wonderful fish, and birds.\nGreat exhibitions on every level. Staff are wonderful, and a cheap enjoyable family day out.", "publishedDate": "2019-04-03", "language": "en", "rating": 5}, {"id": 661511476, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d244211-r661511476-CosmoCaixa-Barcelona_Catalonia.html", "text": "Fun interactive exhibits related to nature, physics, and all other sciences, great for all ages!  There’s loads to see but the highlight for me was definitely the Amazon rainforest.  It’s also very affordable at 2.5 euros and if you take the train to CosmoCaixa there’s even an option to purchase your train pass with a museum pass at the kiosk at the train station.", "publishedDate": "2019-03-26", "language": "en", "rating": 5}, {"id": 658721769, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d244211-r658721769-CosmoCaixa-Barcelona_Catalonia.html", "text": "A wonderful architectural mix of old and new housing natural history and science exhibits. Exhibits change often although the tropical jungle and river exhibit is amazing. Fully handicapped accessible. Highly recommended. ", "publishedDate": "2019-03-15", "language": "en", "rating": 5}, {"id": 656629184, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d244211-r656629184-CosmoCaixa-Barcelona_Catalonia.html", "text": "We were there with the 3-year-old kid and he loved it so much so we come there twice. And we come more times there once we will be in Barcelona. Definitely, recommend", "publishedDate": "2019-03-05", "language": "en", "rating": 5}, {"id": 656491852, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d244211-r656491852-CosmoCaixa-Barcelona_Catalonia.html", "text": "Cosmocaixa is the best museum in Barcelona for kids by far. Only problem though, it's currently undergoing a major renovation (FEB 2019) . They have reduced prices to compensate but then it never was expensive to visit. \nWe managed to fill 90 minutes despite the ground floor being out of action, but in its current state, a visit is probably not worth while.", "publishedDate": "2019-03-05", "language": "en", "rating": 5}, {"id": 655432333, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d244211-r655432333-CosmoCaixa-Barcelona_Catalonia.html", "text": "I loved this place the most. It has so many different things inside. It was a really great way to spend our time. I was amazed by the giant fishes swimming in the tank. And the rainforest! Oh, I loved it.", "publishedDate": "2019-02-28", "language": "en", "rating": 4}, {"id": 654144374, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d244211-r654144374-CosmoCaixa-Barcelona_Catalonia.html", "text": "My 7 year old daughter and I visited the museum today.  What a disappointment!  The indoor rain forest is a large tank with fish, turtles and birds.  The Toc Toc area to pet live animals is by appointment.  Lastly the planetarium is a replica of an astronauts suit.  We spend an hour.  The place is clearly under a major renovation so maybe in 5 years it will be great but for now its a pass.  We visited other STEM museums - NEMO in Amsterdam & Teeknamuseet in Stockholm - both outstanding, interactive & educational.", "publishedDate": "2019-02-22", "language": "en", "rating": 1}, {"id": 652741640, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d244211-r652741640-CosmoCaixa-Barcelona_Catalonia.html", "text": "We rushed to arrive at 13.45 for a 14.00 planetarium show but there was only one poor person trying to manage a queue of 40+ people.  There were two people on the information desk which had no visitors at the time.  We missed the show and the main hall is being renovated so it felt like an avoidably wasted journey.", "publishedDate": "2019-02-16", "language": "en", "rating": 1}, {"id": 651280831, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d244211-r651280831-CosmoCaixa-Barcelona_Catalonia.html", "text": "This is probably my favorite museum in the WORLD! My daughter ( 3.5 y/o) also likes it 😉\nIt is well organized, interactive to the nth degree, interesting, engaging. We can spend hours there and come back the next day. Highly recommended for grown ups and children alike.", "publishedDate": "2019-02-10", "language": "en", "rating": 5}, {"id": 650407317, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d244211-r650407317-CosmoCaixa-Barcelona_Catalonia.html", "text": "The facility is really three destinations. The first is the science museum. The second is the rainforest exhibit. The third is the plaza that connects the two. I just went to the plaza so I can't comment on the first two. The plaza is up in the hills so the view is great. And there are a few science exhibits to look at, including an urban gardening display.", "publishedDate": "2019-02-05", "language": "en", "rating": 4}, {"id": 649967694, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d244211-r649967694-CosmoCaixa-Barcelona_Catalonia.html", "text": "Too many people, too little to see. But it was very cheap. Neither me nor my boy were impressed with this museum. The best part was the mangrove forest, but it is not very big. The rest of the exposition was not very exciting. ", "publishedDate": "2019-02-03", "language": "en", "rating": 3}, {"id": 649730010, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d244211-r649730010-CosmoCaixa-Barcelona_Catalonia.html", "text": "I was hoping to find an outstanding Science museum, like we have in London, or in Paris. It is not too conveniently located - you have to walk about 15 minutes from the nearest tube station, no signs at all. The museum itself is half baked, part - well, most of - exhibitions are closed. I cant say there were too many interactive displays, so children were flowing through without being much interested.\nThe worst part is the entrance queue - there is an only guy selling tickets on Sunday, another was sitting next to him with a sign \"Break for 15 minutes\". The queue was about 500+ people waiting patiently for an hour. Siesta, haha! \nYou may of course buy tickets online - but you have to make sure that you go on a certain day and that you will be able to find this place. Go elsewhere.", "publishedDate": "2019-02-02", "language": "en", "rating": 2}, {"id": 646288117, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d244211-r646288117-CosmoCaixa-Barcelona_Catalonia.html", "text": "I have been a couple of times with the kids ( 8 and 9 now ). \nIt is a fantastic space very interesting for any age. \nI reccomend to reserve in advance for some of the activities that have a reduced number of people allowed. \nThe \" toca, toca \" experience is perfect for young kids. \n", "publishedDate": "2019-01-16", "language": "en", "rating": 5}, {"id": 646157398, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d244211-r646157398-CosmoCaixa-Barcelona_Catalonia.html", "text": "Nice place for a father/son day out, no offense intended... we spent 4-5 hours there, lots of fun stuff to try out, touch and Explorer..remember to check out the outside area. Good fun for me and my 8 year old son.", "publishedDate": "2019-01-15", "language": "en", "rating": 5}, {"id": 646127548, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d244211-r646127548-CosmoCaixa-Barcelona_Catalonia.html", "text": "well-organized cultural center. when i visted there was  2 temporary exhibitions with toulouse lautrec and velasquez. Climb onto the terrace, where you can admire the architectural ingenuity. it is a must for art lovers", "publishedDate": "2019-01-15", "language": "en", "rating": 5}, {"id": 646098971, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d244211-r646098971-CosmoCaixa-Barcelona_Catalonia.html", "text": "Very interactive exhibiton. It is the best fo you if you are interested in science and nature. It can be an all day program. There are detailed descriptions also in english. Modern design, enough place for many people, not crowded. The main entry fee is cheap, and you can pay for other programs inside the museum. For example the planetarium is worth to see. There is a restaurant with daily menu and cafeteria too.", "publishedDate": "2019-01-15", "language": "en", "rating": 5}, {"id": 646084149, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d244211-r646084149-CosmoCaixa-Barcelona_Catalonia.html", "text": "This is by far one of the best museums in the world and also a life saving for families with kids on rare and rainy days in Barcelona. You easily spend few hours there at any time of the day and both your kids and parents will learn something exciting and new. If you are able to plan in advance book one of several 1.5h hand-on sessions available on their website, your kids will remember. ", "publishedDate": "2019-01-15", "language": "en", "rating": 5}, {"id": 644465805, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d244211-r644465805-CosmoCaixa-Barcelona_Catalonia.html", "text": "Interactive Science Museum very fun for all ages. The most beautiful exhibition is the Flooded Forest (who recreates an Amazonian ecosystem) and the planetarium.", "publishedDate": "2019-01-07", "language": "en", "rating": 5}, {"id": 643817996, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d244211-r643817996-CosmoCaixa-Barcelona_Catalonia.html", "text": "We went there with the kids and had a great time. \nOne of the best places in barcelona for children.\nYou can enjoy the various physics experiments, or take a walk in the Bosque, a sort of mangrove full of fish and birds. \nWe visited the tintin on the moon and the robots exhibition and they were both quite nice. \n", "publishedDate": "2019-01-05", "language": "en", "rating": 5}, {"id": 640059196, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d244211-r640059196-CosmoCaixa-Barcelona_Catalonia.html", "text": "Very interesting view and touch of technology and nuture, from sound workshops to animals, physics, optic devices, animal behaviour, environmenral work shops, .?, it worth a visit,  from 2 yo 4 h.", "publishedDate": "2018-12-17", "language": "en", "rating": 5}, {"id": 637509111, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d244211-r637509111-CosmoCaixa-Barcelona_Catalonia.html", "text": "The museum has an impressive collection about science and nature. They even a forest inside and a little zoo where you can find capybara and many more creatures of the flooded forest. The 2D/3D planetarium is also a nice experience where you can find out more the history of the universe. One suggestion, if you ever read this, the chair in the planetarium should incline more to the back. You have a wee pain in the neck after the movie because your neck is up all the time. ", "publishedDate": "2018-12-04", "language": "en", "rating": 4}, {"id": 635717267, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d244211-r635717267-CosmoCaixa-Barcelona_Catalonia.html", "text": "We visited here for an afternoon.  Both my tweens loved the exhibits and it was very interactive.  Kids were free and adults were 5 Euros each.  ", "publishedDate": "2018-11-25", "language": "en", "rating": 4}, {"id": 632797100, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d244211-r632797100-CosmoCaixa-Barcelona_Catalonia.html", "text": "This was a great surprise! From the incredibly good value entry fee (4 euros for an adult) to the huge number of fascinating and well-thought-out exhibits, this is an excellent day out. Much of it is very accessible to children (so if you don't like lots of them running around and playing with the interactive exhibits, don't go), but we went as a couple and thoroughly enjoyed it. The flooded forest was a highlight, with a huge range of animals and plants as well as lots of information about the habitats. After a bit of a wait, the restaurant was also a great find for lunch with a nice atmosphere and good value buffet. There was so much to see that we plan a return visit in the future.", "publishedDate": "2018-11-12", "language": "en", "rating": 5}, {"id": 631543533, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d244211-r631543533-CosmoCaixa-Barcelona_Catalonia.html", "text": "This museum is so much fun! I go there every now and then because I love it. I normally spend more than 3 hours.\n\nIt is a perfect museum for kids since there are many \"science\" games and a big outside area for having lunch. The museum has a permanent exhibition with games and a \"tropical centre\" and then a temporary exhibition area which changes every few monthts. \n\nThe \"tropical centre\" is called \"Bosc inundat\" and has piranhas and different animals.\n\nWhen you buy the ticket you can also buy a \"toca-toca\" pass, which is an activity where you can touch different animals (very cool for kids).\n\nYou can bring in your own food, although there is also a restaurant.\n\nThe best way to get to the museum is taking the L7 metro line stopping at Av. Tibidabo and walk from there to the museum. It is a steep walk but the houses in Avinguda Tibidabo are beautiful and make it a very enjoyable walk.", "publishedDate": "2018-11-06", "language": "en", "rating": 5}, {"id": 631235211, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d244211-r631235211-CosmoCaixa-Barcelona_Catalonia.html", "text": "This place simulated tropical forest in Brazil. Good design of display and presenttation.Many contents provide for your choice of interested.crowed of student in moring till noon.good place for family  one day trip out of town.", "publishedDate": "2018-11-06", "language": "en", "rating": 5}, {"id": 630733127, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d244211-r630733127-CosmoCaixa-Barcelona_Catalonia.html", "text": "We went here on impulse as the weather wasn't good. Obviously lots of others had the same idea so there was a bit of a queue to get in so it may be worth booking your tickets online if you're planning a visit. Very reasonable admission prices (4 Euros, under 16s free) so you don't feel you have to spend hours visiting every exhibit. The highlight for us was the flooded rainforest, but there are stacks of other exhibits, demonstrations and hands-on stuff spread over 5 floors with something for everyone. Don't queue in the café, head back down towards the metro and there are plenty of cafes and restaurants near there.", "publishedDate": "2018-11-04", "language": "en", "rating": 5}, {"id": 629803628, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d244211-r629803628-CosmoCaixa-Barcelona_Catalonia.html", "text": "Love this place arrived at lunch time thought a couple of hours would be enough 7.00pm we left there was so much to do our 8 year old loved it very hands on but enjoyable for all ages this was a couple of years ago but is top of our list on this return visit.", "publishedDate": "2018-10-31", "language": "en", "rating": 5}, {"id": 629539489, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d244211-r629539489-CosmoCaixa-Barcelona_Catalonia.html", "text": "This is easily one of the best museums I've visited in the last couple of years. it's a mandatory place to see while visiting Barcelona, no matter what age you are. It's perfect for families with teenagers or children. A great way to spend a rainy day indoors. \nMake sure you allow at least 3 hrs for your visit.", "publishedDate": "2018-10-29", "language": "en", "rating": 5}, {"id": 629298784, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d244211-r629298784-CosmoCaixa-Barcelona_Catalonia.html", "text": "What an amazing place!\nSo much to see and learn but everything is so fun and interactive. We were there for 5 hours but could easily have spent longer.\nThe planetarium is well worth paying a little extra as this place offers amazing value for money.", "publishedDate": "2018-10-29", "language": "en", "rating": 5}, {"id": 627797771, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d244211-r627797771-CosmoCaixa-Barcelona_Catalonia.html", "text": "After the full on masses of tourists at all the other venues around Barcelona, CosmoCaixa was a breath of fresh air. We spent a few hours there with the kids (8 and 11) and it was probably their best bit of the trip (possibly after the Barcelona v Seville game). There's loads for the kids to discover, play with and observe. The rainforest exhibit was the highlight, but plenty of other hands on science to play with. It's also very reasonable at only a few Euros for adults and free for kids under 12. Well worth the visit", "publishedDate": "2018-10-24", "language": "en", "rating": 4}, {"id": 626611037, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d244211-r626611037-CosmoCaixa-Barcelona_Catalonia.html", "text": "This science museum is one of my favorite among famous ones (as London and New York). Firstly you pay a few euros to experience from universe to microscopy world, or from nature to most developed robots. One special place is the entire forest inside the place. However, I can point it out many physics experiments. and robotic section as well. Worth my visit indeed. ", "publishedDate": "2018-10-19", "language": "en", "rating": 5}, {"id": 624420461, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d244211-r624420461-CosmoCaixa-Barcelona_Catalonia.html", "text": "Went with my girlfriend, and we had a great time! \nA lot of cool science stuff related to all fields.\nVery much recommended! \nYou can buy tickets in the entrance for 4 euros (adult tickets).", "publishedDate": "2018-10-13", "language": "en", "rating": 5}, {"id": 622464117, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d244211-r622464117-CosmoCaixa-Barcelona_Catalonia.html", "text": "I highly recommend visiting this museum. It's incredibly beautiful inside and outside, with some many playful ideas and well organized for families (cf changing stations etc). You can easily spend the whole day there!\nThe price is just crazy : 4€ for adults only, children go free! 👍", "publishedDate": "2018-10-05", "language": "en", "rating": 5}, {"id": 622097654, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d244211-r622097654-CosmoCaixa-Barcelona_Catalonia.html", "text": "If you are staying in Barcelona for a few days and need some nice things to do with kids I really recomend CosmoCaixa. Kids don't even realize they are in a museum. It's science and it's fun. There are picnic areas around it and several tables outside the restaurant. You can spend a few hours or the entire day. Plan ahead for the activities because the get full. There's the planetary and the Creactivity, great for kids 7 and above. Adults enjoy the visit, too. I am never tired of going there.", "publishedDate": "2018-10-04", "language": "en", "rating": 5}, {"id": 621703345, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d244211-r621703345-CosmoCaixa-Barcelona_Catalonia.html", "text": "This museum is a brilliant place for kids (and adults!) my 6 & 5 year old loved it and it was the highlight of their trip to Barcelona. It’s so cheap too, only €4 for adults and kids are free. The indoor rainforest is excellent and they really enjoyed touching and playing with all the interactive exhibits. Well worth a visit.", "publishedDate": "2018-10-03", "language": "en", "rating": 5}, {"id": 621491192, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d244211-r621491192-CosmoCaixa-Barcelona_Catalonia.html", "text": "We had a lovely day at the musuem and our 3yo enjoyed the interactive areas and the forest. Unfortunately quite a few of the activities were either closed or only happening later in the day (many seemed to happen at/after 4pm).", "publishedDate": "2018-10-02", "language": "en", "rating": 4}, {"id": 619081572, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d244211-r619081572-CosmoCaixa-Barcelona_Catalonia.html", "text": "Perfect day out when the weather is bad. The Amazon rainforest is the highlight. Try and catch a show at the planetarium too. ", "publishedDate": "2018-09-24", "language": "en", "rating": 5}, {"id": 618395041, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d244211-r618395041-CosmoCaixa-Barcelona_Catalonia.html", "text": "Spent a 1.5 hours or so with our toddler. Kids can, and should, touch and explore everything here which is why it's so great for them. ", "publishedDate": "2018-09-21", "language": "en", "rating": 5}, {"id": 616919878, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d244211-r616919878-CosmoCaixa-Barcelona_Catalonia.html", "text": "Entry is only €4 per person (adult) which is a bargain then you can pay extra for certain exhibits such as a planetarium. There is enough to see and do without these but if you have children it is worth considering as they seemed to be more aimed at kids. The main attraction is the flooded forest which was beautiful to see and the second main attraction was a large science room with a great many interactive activities which were entertaining and educational for children and adults alike. If you do have children you could easily spend a good few hours and make a day of it. As two adults we spent far longer here than at the aquarium and so this museum is very good value for money. Didn't have any issues as an english speaker as all information signs had full English translations. There's lots to do and learn for children and I imagine it would keep them well entertained. I would also recommend adults without children to visit, as there is much to reflect and learn about as an adult whether it is about protecting our rainforests, the increasing reliance on robot technology or even to just remember your childish curiosity and thirst for knowledge. Thoroughly enjoyed our visit. A bit out of the way of the main more touristy parts of the city but easy enough to get to on the metro then a short walk (but be warned that it is uphill). Has picnic and restaurant facilities.", "publishedDate": "2018-09-16", "language": "en", "rating": 5}, {"id": 616388840, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d244211-r616388840-CosmoCaixa-Barcelona_Catalonia.html", "text": "This was my second time visiting this museum, and it was as amazing as the first. The displays are very informative and the section where you get to do science experiments yourself is very fun and educational for both kids and adults. It also has a simulated rain forest where it actually rains!", "publishedDate": "2018-09-14", "language": "en", "rating": 5}, {"id": 612874188, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d244211-r612874188-CosmoCaixa-Barcelona_Catalonia.html", "text": "We had a spare 1/2 day with two boys (5 and 8). Amazing building with great views over the city. Easily can spend several hours here, with loads of science, robots and even an indoor rainforest. Tonnes of hands-on stuff and experiments. Highliy recommended with kids,.", "publishedDate": "2018-09-01", "language": "en", "rating": 5}, {"id": 612712898, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d244211-r612712898-CosmoCaixa-Barcelona_Catalonia.html", "text": "What a brilliant place for children! We spent 5 hours in the museum and it wasn't enough (the museum was closing) for my 9 year old son.", "publishedDate": "2018-08-31", "language": "en", "rating": 5}, {"id": 611919589, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d244211-r611919589-CosmoCaixa-Barcelona_Catalonia.html", "text": "There are a lot of interesting devices, which you can use and look how physics works. Recommend for children and parents. Be sure you will have enough time to observe everything. The most interesting was -5 floor with robots and natural park. It looks like a real tropical forest.", "publishedDate": "2018-08-29", "language": "en", "rating": 4}, {"id": 611646936, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d244211-r611646936-CosmoCaixa-Barcelona_Catalonia.html", "text": "We visited CosmoCaixa with our 5 and 9 yr old children and had a amazing day. Entry was free for our children and we paid 4 euros per adult. The activities are an additional 4 euros per person and an adult has to accompany a child so you pay an additional 8 euros per activity for one child which we did. The 3D planetarium shows and the animal touching experiences are worth the money. Even though the planetarium shows specify an age limit, we still managed to get our 5 year old into the show and she loved it. \nThe robot exhibition was excellent. The entire museum especially on level minus five was interactive and great fun for all of us. It was great to create whirlpools, relearn about a vortex, create waves, look at light passing through prisms, look at practical examples of laws of motion and see plankton under microscopes to name a few of what this place has to offer. We could have easily spent two whole days here. There is an explanation in English below the Catalan on everything. \n\nThe cafeteria and restaurant are decent enough and the freshly squeezed orange juice topped it off. There is an outdoor picnic area too. \nWe had to make sure we chose the activities in English as most were in Catalan but these start at 11 am and go on till six pm occurring every hour. \nIt’s worth going early when the museum opens.", "publishedDate": "2018-08-28", "language": "en", "rating": 5}, {"id": 610197728, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d244211-r610197728-CosmoCaixa-Barcelona_Catalonia.html", "text": "After 4 days around town our boys 5 and 8 had enough of city walking. This was a great diversion. Huge halls. Loads of stuff to do and learn about. Animals, robots, forces, weather systems... you name it. And only 4 euros for adults and free for kids!", "publishedDate": "2018-08-25", "language": "en", "rating": 5}, {"id": 608721106, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d244211-r608721106-CosmoCaixa-Barcelona_Catalonia.html", "text": "Beginning with the conclusion: the best science museum I've visited.\nFor a ridiculous price of 4 euros, you get to visit one of the most beautiful and interesting science museums. It is educational and fun for children and adults, scientists or not. Very interactive, explaining a lot of stuff from physics to biology in a simple and effective way and without ever being monotonous. All that on a beautiful exhibition where the cherry on top is the flooded forest exhibit (and what a big cherry it is). If you're in Barcelona, please, take some time to visit this place.", "publishedDate": "2018-08-21", "language": "en", "rating": 5}, {"id": 607753702, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d244211-r607753702-CosmoCaixa-Barcelona_Catalonia.html", "text": "We went here at the end of the day and entered at 6 PM. The building consists of 5 floors (your start at -5 and work your way to the ground flour). The floors contain all sorts of things, from animals to science experiments. These experiments are fun and educational for children, but not so much for adults.\nWhen we went at 6 PM (the building closes at 8 PM) much of the areas in the museum were closed (due to the fact that they have shows at scheduled hours). This is something to take into consideration when visiting the building, so don't come to late otherwise you will miss out a lot of the areas.\n\nFor me, the highlight was on the -5 floor. There there is a tropical area with a swamp, consisting of huge trees and fish. There are also some birds and other animals (snakes and capybaras) there. I saw a turtle sitting on the back of the crocodile there, which for me was the highlight of the day (see picture below).\nOverall I spent around 1,5 hours at the CosmoCaixa.", "publishedDate": "2018-08-18", "language": "en", "rating": 3}, {"id": 607170104, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d244211-r607170104-CosmoCaixa-Barcelona_Catalonia.html", "text": "We visited here as my daughter loved the sound of the recreation of a rainforest.It was a 15 minute walk uphill from Tibidabou metro.It was worth it as we all enjoyed it.It was really cheap as we used our tickets from the hop on hop off ticket we had bought the day before to get a discount.For a family of 4 it was only 9 euros.There was plenty to see for a few hours and it ws lovely and cool and quiet in there.It was really interesting.We didnt pay for the planetarium but that looked good too.", "publishedDate": "2018-08-16", "language": "en", "rating": 4}, {"id": 604353306, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d244211-r604353306-CosmoCaixa-Barcelona_Catalonia.html", "text": "A great place where you can easily spend the all day fro just few euro. Special activities have an extra fee (4€) and have to be purchase at the entrance. The 3D shows have limited seats and played once a day when I was there, and we miss them.... next time\n", "publishedDate": "2018-08-08", "language": "en", "rating": 4}, {"id": 603797747, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d244211-r603797747-CosmoCaixa-Barcelona_Catalonia.html", "text": "fantastic huge musem for free (if you are a Caixa customer) if not for few euro you can enjoy all day long with kids and not only. \nit is huge, with lot of interesting scientific and mother nature stuff to learn and investigate. it is interactive. you can touch and \"play\" with plenty of expositions presented thee. I have spend 5 hours there and didn't see even 50% of it. highly recommended ! ", "publishedDate": "2018-08-07", "language": "en", "rating": 5}, {"id": 603778802, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d244211-r603778802-CosmoCaixa-Barcelona_Catalonia.html", "text": "Very interesting place. One of the best tyrannosaurus rex skeletons in Europe and fantastic microclimates.", "publishedDate": "2018-08-07", "language": "en", "rating": 4}, {"id": 603004025, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d244211-r603004025-CosmoCaixa-Barcelona_Catalonia.html", "text": "Plenty to do, keep the kids occupied and learn a bit more about science yourself! Air con so perfect for hot Summer days. You can book workshops like Toca Toca and the planetarium etc in advance for a more organised trip!", "publishedDate": "2018-08-05", "language": "en", "rating": 5}, {"id": 602839026, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d244211-r602839026-CosmoCaixa-Barcelona_Catalonia.html", "text": "It would be far more interesting to see and experience if nearly half of presented things would even work. It seems that the most spoiled children are visiting it, maniacally pressing buttons etc., destroying the machines, experiments and hence ruining experience for others.\nAn Amazon river bed / aquarium is a nice touch.\nIf you have time and language skills visit can improve if you attend the presentations and lectures held in the different halls.", "publishedDate": "2018-08-04", "language": "en", "rating": 3}, {"id": 602750840, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d244211-r602750840-CosmoCaixa-Barcelona_Catalonia.html", "text": "We have lived in Spain for about 2 years and this is my now 5 year olds favorite museum. Her favorite thing is a huge tree that has a mechanism to drop leaves when you push a button. Tip, go at 10 when they open. You will notice the place filling around 11:30am. Price is just right with only the adults being charged. I loved the Amazon area with fish and animals. Bring a picnic to have in the gardens. There is a cafe but it is over priced and there are not that many restaurants nearby.", "publishedDate": "2018-08-04", "language": "en", "rating": 4}, {"id": 600038327, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d244211-r600038327-CosmoCaixa-Barcelona_Catalonia.html", "text": "One of the most interesting science centers I have visited. Well planned, interactive and educationally inspiring. Worth a visit if you happen to be in Barcelona.", "publishedDate": "2018-07-26", "language": "en", "rating": 5}, {"id": 598406277, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d244211-r598406277-CosmoCaixa-Barcelona_Catalonia.html", "text": "Museum:\nWonderful area with hands-on activities for all ages and capacities. The museum is decides into little groups of information including marine life, mechanical energy, scientific discoveries, early life, geography, children activities, etc. \nActivities:\nThe museum offers an array of various activities for all ages. Definately something for family education and fun! Plan well and purchase your activity tickets in advance. They are usually sold out day before. \nFood:\nThey have a sit down buffet style restaurant (with an option for a celiac menu), a cafeteria, and a picnic area so there are options for all budgets. \nI would definitely recommend this museum to everyone.", "publishedDate": "2018-07-22", "language": "en", "rating": 5}, {"id": 597949829, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d244211-r597949829-CosmoCaixa-Barcelona_Catalonia.html", "text": "I loved all of the things you had in the science museum (Lewis, aged 7). absolutely amazing, loads to do and a brilliant experience for the whole family (Harry, aged 11). The Antartica video had me in tears (Mum). The big swinging pendulum because of what it taught me (Dad).", "publishedDate": "2018-07-20", "language": "en", "rating": 5}, {"id": 597672856, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d244211-r597672856-CosmoCaixa-Barcelona_Catalonia.html", "text": "This museum is very useful, simple but interesting, entertaining leisure time. I have seen many well-known and some unknown things to me. It is very well edited, spectacular and understandable.", "publishedDate": "2018-07-19", "language": "en", "rating": 5}, {"id": 596680360, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d244211-r596680360-CosmoCaixa-Barcelona_Catalonia.html", "text": "CosmoCaixa Barcelona - Amazon Exhibition is a must when in Barcelona with kids as offer a wide range of exhibits to view.", "publishedDate": "2018-07-16", "language": "en", "rating": 5}, {"id": 594206327, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d244211-r594206327-CosmoCaixa-Barcelona_Catalonia.html", "text": "Myself and family went to get out of midday sun tour bus drops off a few minutes walk away .kids loved it lots of interaction ", "publishedDate": "2018-07-08", "language": "en", "rating": 5}, {"id": 594028125, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d244211-r594028125-CosmoCaixa-Barcelona_Catalonia.html", "text": "I’m glad they have something for the kids to play with but there were too many things closed off for the kids which was a bit disappointing.  The gift shop has rude employees so I wasn’t too pleased about that.  The only reason it got a decent rating was because my kids actually had fun for the two parts that were open.", "publishedDate": "2018-07-08", "language": "en", "rating": 3}, {"id": 582997987, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d244211-r582997987-CosmoCaixa-Barcelona_Catalonia.html", "text": "As the matter of fact there is one floor  fully open. But it is amazing. Rain forest death breaking. You can walk by side and under and up. Small but you can understand lit of things\nAll scienc emyseum is very multimedia, you can touch make and read.\nGreat for kids, but adults won,t lost tgeir time.\nWe were with small kid, but even he was still runing around.\n\nPlace is good for stroller\n", "publishedDate": "2018-05-27", "language": "en", "rating": 4}, {"id": 580773636, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d244211-r580773636-CosmoCaixa-Barcelona_Catalonia.html", "text": "I like this museum so much! There is a lot of exhibitions there. You need to decide what you want to see the most and go there. I was excited with physical experiments and aquarium. I have seen a lot of kids there. I think that it's a great place to visit with family.", "publishedDate": "2018-05-17", "language": "en", "rating": 4}, {"id": 579337725, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d244211-r579337725-CosmoCaixa-Barcelona_Catalonia.html", "text": "They had some fun exhibits for the kids but much of the museum featured displays of rocks, plants and various household objects. Unfortunately many of the fun exhibits required pay-to-play payments and they were all sold out by the time we arrived in the afternoon. Overall, helps pass the time with kids but it’s a mediocre children’s museum at best.", "publishedDate": "2018-05-10", "language": "en", "rating": 3}, {"id": 578955825, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d244211-r578955825-CosmoCaixa-Barcelona_Catalonia.html", "text": "I don't know where to start from, the knowledge that offers, the interaction with the exhebits that is allowed, the combination of different categories that are presented, the extremely low price? CosmoCaixa museum is a must-visit attraction if you are travelling with children, but also with adults :). It offers a wide variety of things to see including a small aquarium and zoo. It \"forces\" you to learn \"how\" and \"why\" particular objects function explaining the physics that govern them, using plain language.\nYou will certainly have a better view of the world as soon as you exit the musem.", "publishedDate": "2018-05-09", "language": "en", "rating": 5}, {"id": 578594568, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d244211-r578594568-CosmoCaixa-Barcelona_Catalonia.html", "text": "big and complete museum, interactive, perfect for learning having fun. the tropical are is great. Touch and enjoy.", "publishedDate": "2018-05-07", "language": "en", "rating": 5}, {"id": 577702759, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d244211-r577702759-CosmoCaixa-Barcelona_Catalonia.html", "text": "Really enjoyed this one, a lot of attractions and the best conserved T-Rex. Also there was a replica of the Amazon rain forest, with fauna, vegetation and everything.", "publishedDate": "2018-05-03", "language": "en", "rating": 5}, {"id": 577559777, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d244211-r577559777-CosmoCaixa-Barcelona_Catalonia.html", "text": "On arrival, you are welcomed by a magnificent Amazon tree hanging in the centre of a spiralling walkway that leads down 5 floors to the basement. You'll be awestruck to see the Amazon tree floating in mid-air. That alone created a dramatic first impression to captures our attention. Highly recommended if you have kids, as it is very much a hands-on venue, offering inspired space for the kids to explore. This place will entertain the kids for hours.", "publishedDate": "2018-05-02", "language": "en", "rating": 4}, {"id": 576533795, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d244211-r576533795-CosmoCaixa-Barcelona_Catalonia.html", "text": "If rainy day in Barcelona this activity is absolutelly fantastic for families with children. I can really high reccomended-house of full extremly intersting sience information and touch activities. Rainy forest very nice! Only restaurant is small and full.", "publishedDate": "2018-04-29", "language": "en", "rating": 5}, {"id": 576288524, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d244211-r576288524-CosmoCaixa-Barcelona_Catalonia.html", "text": "Very interesting place for children and not only. You can initiate different physical and chemical experiments and follow the explanations. You meed about 3-4 hours for all exhibitions. ", "publishedDate": "2018-04-28", "language": "en", "rating": 5}, {"id": 574557109, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d244211-r574557109-CosmoCaixa-Barcelona_Catalonia.html", "text": "The museum is very charming. Lots of information and things to see. The flooded forest is another dimension. Our daughter was very pleased we went there. The tickets are quite cheap we paid 4 euro per adult and free for our 8year old\n Highly recommend for families with children", "publishedDate": "2018-04-20", "language": "en", "rating": 4}, {"id": 573969019, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d244211-r573969019-CosmoCaixa-Barcelona_Catalonia.html", "text": "We loved this great Science Museum ! and it was such good value for money - children under 16 go free and adults pay 4 euro each. We were entertained for a good half a day and even us parents learnt a thing or two ! easy to find, easy to look around and even our non-loving science children found all of it interesting. Its a really good addition to your Barcelona with children itinerary!", "publishedDate": "2018-04-17", "language": "en", "rating": 5}, {"id": 573806060, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d244211-r573806060-CosmoCaixa-Barcelona_Catalonia.html", "text": "Had a lovely afternoon out here, lot of things to do, see and interact with! Particularly enjoyed the rain forest section,  seeing all the aquatic life and animals! Great for couple or families and  incredibly good value! Cafe on site also pleasant enough serving cakes and sandwiches etc. Made for a cute lunch outside in the sun! Well worth a visit!", "publishedDate": "2018-04-16", "language": "en", "rating": 5}, {"id": 573653915, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d244211-r573653915-CosmoCaixa-Barcelona_Catalonia.html", "text": "This is by far the best science museum in Barcelona. They offer some scheduled activities for children. I've been there with my children many times and we always discover something new. ", "publishedDate": "2018-04-16", "language": "en", "rating": 5}, {"id": 573523470, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d244211-r573523470-CosmoCaixa-Barcelona_Catalonia.html", "text": "I would definitely recommend visiting this museum especially if you have school children. They have many interesting models for better understanding weather, geology, physics... and T Rex sceleton.", "publishedDate": "2018-04-15", "language": "en", "rating": 5}, {"id": 573250631, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d244211-r573250631-CosmoCaixa-Barcelona_Catalonia.html", "text": "This was very cheap to get in, only a few euros as I recall, we also took in the 3D flight show at the planetarium which was good. The rainforest section was interesting as was the rest of the museum, Kids (and adults) of all ages will have a good time here.", "publishedDate": "2018-04-14", "language": "en", "rating": 5}, {"id": 572726132, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d244211-r572726132-CosmoCaixa-Barcelona_Catalonia.html", "text": "Just an amazing, interesting place. 4 year old extremely happy to be here with dinosaurs, giant fish in the amazon zone, and massive architecturally fascinating wide spaces for running around in! Beautiful place spotlessly clean, completely helpful and lovely staff. BE AWARE the Toca Toca touching zoo is only open to educational tour parties. Us parents really loved the place too. Brilliant. ", "publishedDate": "2018-04-11", "language": "en", "rating": 5}, {"id": 571964110, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d244211-r571964110-CosmoCaixa-Barcelona_Catalonia.html", "text": "In a pleasant area, inexpensive and with a good cafe.  Perhaps not as big as the London Science museum, but what it does, it does really well.  Easy to spend a day here.  Came for the Amazon Rain forest but loved the rest of it too.", "publishedDate": "2018-04-08", "language": "en", "rating": 5}, {"id": 571907959, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d244211-r571907959-CosmoCaixa-Barcelona_Catalonia.html", "text": "We were amazed at how inexpensive this great facility was.  Only knock was we went late in the day and there was a long line to buy tickets and all of the add-on experiences that are available were sold out.  However, it was still a great visit.  Many interactive exhibits and things to see.  Well worth the walk up the hill from the closest metro station to get there.\n\nIf you are debating a visit here or a visit to the aquarium, I highly recommend here instead (both for value and for quality).", "publishedDate": "2018-04-08", "language": "en", "rating": 5}, {"id": 571828965, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d244211-r571828965-CosmoCaixa-Barcelona_Catalonia.html", "text": "We went with our 4 boys age 1,6,8 and 12. €8 for all of us and it was a fantastic day for all of them plus adults - very hands on which is perfect for children - indoors too so good activity for when the weather isn’t great. The fish / flooded forest was like nothing we have ever seen before and great to be so close to the fish. Our 1 year old loved it, very accessible with pram too. ", "publishedDate": "2018-04-08", "language": "en", "rating": 5}, {"id": 568510619, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d244211-r568510619-CosmoCaixa-Barcelona_Catalonia.html", "text": "Before I was thinking that this place should be interesting only for kids. But now I understand that it’s great for everybody! Must see! ;) ", "publishedDate": "2018-03-24", "language": "en", "rating": 5}, {"id": 568407814, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d244211-r568407814-CosmoCaixa-Barcelona_Catalonia.html", "text": "Great day. I went alone to get away from the crowds. It was more than worth it, i felt like a little kid again, loved it from the first second. 'Don't touch it, be quiet and be careful' you will not hear in this place. Fun, educational, interesting. Loved the dinosaur section. It's hard to believe something so vast and amazing exists for such an affordable price while other attraction in bcn are so ridiculously overpriced (C.Battlo 5x as much!!!). While i can imagine having left out some of the Casas, i wouldn't have mised CosmoCaixa for the world. \n\nA small flaw: in the geological section, i would have appreciated the signs being in one level with the experimental glass boxes, so more poeple can read them. Also, please do make all the texts bigger so they are easier to read and one person doesn't cover the whole thing with their body!", "publishedDate": "2018-03-24", "language": "en", "rating": 5}, {"id": 568149494, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d244211-r568149494-CosmoCaixa-Barcelona_Catalonia.html", "text": "LacCaixa being one of the bigger Catalan Bank groups and patrons to many local projects and causes. Housed in a very contemporary building interesting in itself. Every one will have their favorite hall and very much worth a visit if there is a Barcelona off weather day.", "publishedDate": "2018-03-22", "language": "en", "rating": 4}, {"id": 566126898, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d244211-r566126898-CosmoCaixa-Barcelona_Catalonia.html", "text": "Nice experience for kids and grown ups. Lots of hands-on experiments. Lacks written info about the experiences/displays, which makes it less interesting and useful as it could be. The kids had been dreaming about the slime workshop for days, only to find out at the ticket counter that it had been sold out for weeks, big disappointment.\nThe place is very big so spare a good 4 hours for it, if you want to see and experience everything.", "publishedDate": "2018-03-12", "language": "en", "rating": 4}, {"id": 565238016, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d244211-r565238016-CosmoCaixa-Barcelona_Catalonia.html", "text": "We spend a day there and it was amazing. My 5 years old child didn't want to leave. Since then he keeps saying we have to go back and we will definitely do so.", "publishedDate": "2018-03-08", "language": "en", "rating": 5}, {"id": 564672091, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d244211-r564672091-CosmoCaixa-Barcelona_Catalonia.html", "text": "Took my granddaughter and two sons in Feb this year. Great morning out. Queues quite long but worth the wait. Takes a good couple of hours to get around. The variety of fish is great from sharks to penguins you get them all. The walk through is brilliant with fish each side and above.\nIf you are planning to go book in advance and look for discounts and special offers.", "publishedDate": "2018-03-05", "language": "en", "rating": 5}, {"id": 561853369, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d244211-r561853369-CosmoCaixa-Barcelona_Catalonia.html", "text": "Very good quiet museum. We did attend on a Monday when I assume most locals work, school etc. T-Rex was great, and the flooded forest was also a good experience. The museum itself is very hands on with lots to read and participate in. ", "publishedDate": "2018-02-20", "language": "en", "rating": 4}, {"id": 561530271, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d244211-r561530271-CosmoCaixa-Barcelona_Catalonia.html", "text": "We’d heard great reviews of the science museum but our visit today was a bit of a disappointment. \nFirstly the planetarium was closed and then secondly the hands on children’s area wasn’t accessible due to a school visit. \n\nThe t-rex exhibit was excellent, but sadly we were left scratching our heads as to what could occupy a full day, let alone several days. \n\nAnother positive was the very low entrance fee, but didn’t outweigh the out of season feel. ", "publishedDate": "2018-02-19", "language": "en", "rating": 3}, {"id": 561309716, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d244211-r561309716-CosmoCaixa-Barcelona_Catalonia.html", "text": "A perfect place to spend half a day with children of all ages. For school children is very useful to see different physics and chemistry experiments, but also little children can enjoy the flooded forest. The costruction itself is impressive, that huge tree in the middle of the stairs is an attraction itself. Also very inexpensive, although we have expected otherwise considering what the offer was. Very good games and books at the shop, related to science.", "publishedDate": "2018-02-18", "language": "en", "rating": 5}, {"id": 560404502, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d244211-r560404502-CosmoCaixa-Barcelona_Catalonia.html", "text": "One of the best science museums in Europe (after having been to several)! The rainforest eco-system is absolutely brilliant. The displays are a perfect example of science and art acting in harmony. ", "publishedDate": "2018-02-14", "language": "en", "rating": 5}, {"id": 559848090, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d244211-r559848090-CosmoCaixa-Barcelona_Catalonia.html", "text": "Interesting museum, especially for children. The simulation of a tropical environment was fantastic and a great experience!", "publishedDate": "2018-02-11", "language": "en", "rating": 5}, {"id": 558885726, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d244211-r558885726-CosmoCaixa-Barcelona_Catalonia.html", "text": "We visited with 2 X 2 year old children who were fully engage with every activity button and display they came across.  From putting hands & fingers in ice to watching the \"rain\" fall in the tropical forest/waters.  The cafe was reasonably priced and there were ample toilet facilities. A great day spent in the this living museum.  The only down side is its a 10/15 minute walk from the Metro at Penitents stop on green line.", "publishedDate": "2018-02-06", "language": "en", "rating": 5}, {"id": 558531637, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d244211-r558531637-CosmoCaixa-Barcelona_Catalonia.html", "text": "It’s an amazing and so fun museum that people don’t know about. You have to pay only € 4 to get in and have so much fun. It’s an interactive museum for all ages. You probably will spend more than 3 hours there. It’s perfect to go there during that rainy day. So I totally say you to go and visiting this amazing museum. They have a tyrannosaurus skeleton, a rainforest with big fishes and other alive animals, and there is an infinite number of interactive attractions.", "publishedDate": "2018-02-05", "language": "en", "rating": 5}, {"id": 557987501, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d244211-r557987501-CosmoCaixa-Barcelona_Catalonia.html", "text": "I can’t believe I’ve just seen a real fossil of a T-Rex dinosaur....    it’s huge, stunning, and only cost 4 euros to see it. EVERYONE (with or without kids) should see this. It’s only there for a short time though. \nThe rest of the collections are amazing too. Give yourself a good day out in this place! The tropical rainforest is amazing, what a place! \nWill be back!!!!", "publishedDate": "2018-02-02", "language": "en", "rating": 5}, {"id": 556148233, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d244211-r556148233-CosmoCaixa-Barcelona_Catalonia.html", "text": "If you are tired of architecture and Gaudy, it is worth visiting CosmoCaixa. Very attractive and impressive presented nature science and history. Little far from main touristic stream, but is easy to combine with visiting of Park Guell or Tibidabo. In case of bad weather you can spend a whole day, especially with children, for just a few euros :)", "publishedDate": "2018-01-24", "language": "en", "rating": 5}, {"id": 554559922, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d244211-r554559922-CosmoCaixa-Barcelona_Catalonia.html", "text": "I went there many years ago and during Christmas time we went back with friends and children. Many changes since my last time but we were all delighted. So many hours and so many interesting things to do and to learn. Only one concern : no enough parking space,  for those like us coming from outside Barcelona it was a huge problem, maybe something that the Museum coordinators should take under review.", "publishedDate": "2018-01-18", "language": "en", "rating": 5}, {"id": 554067346, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d244211-r554067346-CosmoCaixa-Barcelona_Catalonia.html", "text": "We were under the impression that there was a lot to see here but there is only the main floor downstairs. The whole building is open to walk around giving the impression that there was more to see but the rest of the floors were empty. Maybe it's because of planetarium or 3D-show auditorium, but we had no idea: there is a lack of informations. So we were wandering around lost and there was no staff to guide you.\nAbout staff. We visited the museum at 18h (2 hours before closing), on Thursday. There were not so many visitors, so the staff wasn't very busy. Probably they didn't think like this and just ignored us (as already said - no infos around).\nIt is ridiculous that the whole metro station points at Cosmocaixa, but you can't find a way to the museum or inside of it. And if - you will be disappointed. Good half of the exhibits was out of order! And the others were not really good to give this museum a name of the best science museum! (we'd visited a lot of science museums) This museum doesn't deserve it. There are a couple of interesting things, there is a potential. But thanks to unfriendly staff and the general indifference - the worst visit of a science museum...", "publishedDate": "2018-01-15", "language": "en", "rating": 2}, {"id": 553403727, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d244211-r553403727-CosmoCaixa-Barcelona_Catalonia.html", "text": "We came here with our 4 year old daughter and this amazing science museum held her attention with it fantastic hands on displays and needs to be seen to be believed rainforest. The T-Rex skeleton is jaw dropping and the accompanying displays are fantastic. My daughter had a ball using digital spray cans to paint a digital T-Rex and is still taking about being chased by a T-Rex and needing to escape on a bike in another fab experience.\nI could talk and talk about everything else here, just go and experience it yourself. \nAt €4 for adults it is a bargain", "publishedDate": "2018-01-12", "language": "en", "rating": 5}, {"id": 552877769, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d244211-r552877769-CosmoCaixa-Barcelona_Catalonia.html", "text": "A lot is written on CosmoCaixa here, I can only confirm that this museum is definitely worth a visit, the kids, if they are interested in science, environment, animals, dinosaurs, etc, will be delighted! I will limit myself to a few practical advices. 1. Activities - only in Catalan/Spanish/English, so we were unable to participate and cannot judge the content. Important to follow the timetables of activities and also to realize they are payable. 2. Do not miss the Archimedes garden and the meteo station outside. 3. Restaurant offers a very average food, so be prepared. We did not try cafeteria though. And the food is not cheap, especially for this quality. 4. Entrance is cheap (4 EUR for adult, which can be brought even lower with all sorts of coupons in booklets from Touristic Bus or Barcelona card), a nice bonus in otherwise expensive Barcelona. 5. If you decide to take the shortest route from the Av.Tibidabo metro station, be prepared for a steep uphill road! Enjoy the visit!", "publishedDate": "2018-01-10", "language": "en", "rating": 5}, {"id": 550950965, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d244211-r550950965-CosmoCaixa-Barcelona_Catalonia.html", "text": "For children of all ages...  Set in the Tibidabo neighbourhood, far away from the center (take the subway, line 7 stopping at \"ave. tibidabo\" then 5 mn by foot uphill)\nThe tropical forest is precious, with 90% humidity in the air and walkable ledges, birds as roseate spoonbills and amazing fish!  Lots and lots of scientific demonstrations in wave physics, optics, gravity, water, air flow; as well as biological and archeological exhibits. Everything is user-controlled and very interactive, with detailed explanations. Very inexpensive and well worth the time.\n", "publishedDate": "2018-01-02", "language": "en", "rating": 4}, {"id": 550703885, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d244211-r550703885-CosmoCaixa-Barcelona_Catalonia.html", "text": "A modern science museum attracts with new imaginations as a fantastic tree and his racine and a variety of animals; the museum has a nice garden; very intersting museum for children and schools.", "publishedDate": "2018-01-01", "language": "en", "rating": 5}, {"id": 550041885, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d244211-r550041885-CosmoCaixa-Barcelona_Catalonia.html", "text": "Sometimes it is difficult to find attractions for kids in big cities. This is a great exception. We went there with our kids and stayed for almost 4 hours. They loved it. Great choice during rainy or winter days.", "publishedDate": "2017-12-29", "language": "en", "rating": 5}, {"id": 550017406, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d244211-r550017406-CosmoCaixa-Barcelona_Catalonia.html", "text": "To be honest, this museum is totally child oriented. Nonenthless, the price worth the visit. For only 4 euros you can buy tjr general ticket, enjoying a 3 hours visit. \nIt say that has 5 levels, but actually 2 are services level with literally nothing inside, 1 is the planetarium (not included in the ticket) and 1 is the child activity to discover science. So only one level is actually avalaible for the general visit. The difference for example with the London's science museum is evident. The good thing is that there are a lot of interactive explaination to \"visualize\" the science. But to be honest I didn t understand the organization and separstion of thr vsropus sections, thst is confusing and no sense in a big space. The section dedicated to the Amazon forest is more coherent and I appreciated it very much.\nA note about the restaurant. I read in TA that the food there was good, so I decided to try it, unfortunately the queue was too long, so we decided to buy things in thr caffetteria. The prices were mid to high considering thr quality, that was not so good. ", "publishedDate": "2017-12-29", "language": "en", "rating": 3}, {"id": 548127346, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d244211-r548127346-CosmoCaixa-Barcelona_Catalonia.html", "text": "Went there with friend and her two children, daughter 11 and son 8. They weren't sure about a trip to a museum but from the moment they got there they were hooked. \nThey liked the grounds leading to the building and once inside the long spiral slope to the bottom around the tree was unusual and caught their imagination. They found so much to interest them and try out  the main part they would have stayed longer than the time we had.  Each had different highlights.  The older child was facinated by the brain section and the younger with the interactive physics and kinetic energy displays.  We all enjoyed the Amazonian forest display and seeing the variety of animals and fish. The day we went was busy but didn't feel crowded.  We took a picnic which eaten in the garden set aside for that purpose made a nice interlude.", "publishedDate": "2017-12-19", "language": "en", "rating": 5}, {"id": 545208394, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d244211-r545208394-CosmoCaixa-Barcelona_Catalonia.html", "text": "Really interesting science based museum. Lots of areas to explore, set out really well. Caters for all ages.", "publishedDate": "2017-12-05", "language": "en", "rating": 5}, {"id": 542835712, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d244211-r542835712-CosmoCaixa-Barcelona_Catalonia.html", "text": "It's really very interesting - lots of experiments to do and things to learn. I'm giving it 4 stars out of 5 because it's difficult to navigate in it - we had trouble finding the entrance, then there are lots of signs inside but all you really need to know that you don't need to waste your time on all other floors (there's 5 of them) because they mainly contain halls which, as far as I understand, are designed for research, seminars, etc. You just need to get down to the bottom floor (-5) where all the fun is.", "publishedDate": "2017-11-23", "language": "en", "rating": 4}, {"id": 542368201, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d244211-r542368201-CosmoCaixa-Barcelona_Catalonia.html", "text": "I was in awe at this place! They have artifacts and displays i have never seen in a science museum before. The giant tree at the start of the journey, and the triceratops skull I found to be amazing. The amazonian forest display with the animals was also a highlight- only a lucky few will have seen these animals in their natural habitat.\nThe virtual reality section about how the brain develops was also very interesting. There are lots of interactive displays that enable children/adults to understand the physics of kinetic energy, electricity amongst others.\nI really enjoyed it. The gift shop also sold very good quality gifts that tied in well with the Cosmocaixa brand. \nWe do not have anything like this in the UK, and we should!!", "publishedDate": "2017-11-20", "language": "en", "rating": 5}, {"id": 542060798, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d244211-r542060798-CosmoCaixa-Barcelona_Catalonia.html", "text": "We came here to escape the summer heat with our twin toddlers and weren´t disappointed. The large fish tank is definitely the highlight. Get in free when you have a Caixa card. ", "publishedDate": "2017-11-19", "language": "en", "rating": 4}, {"id": 540922348, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d244211-r540922348-CosmoCaixa-Barcelona_Catalonia.html", "text": "I highly recommend this museum to visit with children, although I'm sure that my husband could also spend the whole day here. The museum is full of interesting attarctions, there is an aquarium and a large botanical garden. Take into account that it takes quite a long time to get from the tourist center of Barcelona.", "publishedDate": "2017-11-14", "language": "en", "rating": 5}, {"id": 540509381, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d244211-r540509381-CosmoCaixa-Barcelona_Catalonia.html", "text": "We went here because it was included in the Barcelona Card and even though it was fun, I don't know if it was worth it. It's really more for little kids and it's so far out of the way of the other sites we wanted to see I feel like we wasted a lot of time getting to and from here. Great for families- wouldn't recommend if you're all over the age of 10.", "publishedDate": "2017-11-12", "language": "en", "rating": 3}, {"id": 540214371, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d244211-r540214371-CosmoCaixa-Barcelona_Catalonia.html", "text": "This museum is not the easiest to get to but it's quite a gem.\n\nIt has 27 displays of the evolution from the initial material of the milky way up until now. Also it has multiple interactions with experiences. Electricity, water, wind... And others. Also it has a live environment of the Amazon forest with live snakes, ants, fish. It's really interesting.\n\n3 hours well spent", "publishedDate": "2017-11-11", "language": "en", "rating": 4}, {"id": 539538247, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d244211-r539538247-CosmoCaixa-Barcelona_Catalonia.html", "text": "The children were fully entertained for 4 hours. All signs and exhibits are in English too! Very cheap €4 per adult and kids free. Nice cafe on site. Great day out - definitely recommend!", "publishedDate": "2017-11-08", "language": "en", "rating": 5}, {"id": 538707494, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d244211-r538707494-CosmoCaixa-Barcelona_Catalonia.html", "text": "If you have children, than this is worth visiting. Otherwise I think there are better places in Barcelona to spend your precious time. It is off city center, so you need a couple of metro rides to get there and in 2 hours you are trough the whole museum. I've seen better...", "publishedDate": "2017-11-06", "language": "en", "rating": 3}, {"id": 537405557, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d244211-r537405557-CosmoCaixa-Barcelona_Catalonia.html", "text": "We visited CosmoCaixa at lunch time planning to spend 2h there. Ended up with half a day visit with short breaks outside in the sun. Perfect for mixed ages since their exhibitions are interactive on different levels. Aesthetic experience for us parents! Good food for the money and a really good museum shop!!!", "publishedDate": "2017-10-31", "language": "en", "rating": 4}, {"id": 536643325, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d244211-r536643325-CosmoCaixa-Barcelona_Catalonia.html", "text": "This is the perfect conference venue! Wonderful architecture and fantastic use of space in the displays. Submerged Amazon forest possibly the highlight.", "publishedDate": "2017-10-28", "language": "en", "rating": 5}, {"id": 536441317, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d244211-r536441317-CosmoCaixa-Barcelona_Catalonia.html", "text": "We met some local friends there on arrival in Barcelona and didn't really know what to expect. This place is fantastic for kids and adults alike. If you like science then this is the place to be. A whirlwind tour of all different types of interactive physics, chemistry and biology, with some animals thrown in for good measure. It's very well laid out - you work your way up from the bottom (well we did anyway!) and there is a nice verandah-type area on the first floor for the kids to let off some energy. A really pleasant surprise - we enjoyed it as much as the kids did.", "publishedDate": "2017-10-27", "language": "en", "rating": 5}, {"id": 535184375, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d244211-r535184375-CosmoCaixa-Barcelona_Catalonia.html", "text": "I sepent all day in this museum. It is realy cool place for all eage groups of people. There are many things to see and try how it works. A lot of expositions, science experiments and one of my favourite - is tropic forest inside the building.\nTicket is 4 euro. It is one of the best museums I have ever seen before)\n*1 thing - museum does not use Russian.", "publishedDate": "2017-10-22", "language": "en", "rating": 5}, {"id": 533563535, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d244211-r533563535-CosmoCaixa-Barcelona_Catalonia.html", "text": "Totally accesible for strollers,very cool museum with a bunch of cool things for kids to try themselves. I highly recommend it.", "publishedDate": "2017-10-16", "language": "en", "rating": 5}, {"id": 532909128, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d244211-r532909128-CosmoCaixa-Barcelona_Catalonia.html", "text": "rain forest, lots of Science, space, human body, animals. Kids absolutely loved it. It may take 2-3 days to see it all.", "publishedDate": "2017-10-14", "language": "en", "rating": 5}, {"id": 532870548, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d244211-r532870548-CosmoCaixa-Barcelona_Catalonia.html", "text": "Although overall I enjoyed my visit, I found CosmoCaixa to be rather disappointing. I’m not a particularly stupid individual but I found the entrance extremely confusing.  We entered via the big plaça but couldn’t find a ticket office and the directions were extremely poor.  We ended up walking all the way round the block to the main entrance at the front of the old building when some simple signage could have directed us up to the first floor (maybe I am a bit thick and missed something obvious, but I don’t think so!).\n\nThe ramp that took you down to the basement level and the 30m tall Amazonian tree was lovely.  All the exhibits that were in the lower level were fascinating and well laid out.  I particularly enjoyed the Amazonian rainforest exhibit although the bit that you could actually walk through was a bit disappointing (Aquaterra in Vienna was much better).\n\nUnfortunately, there wasn’t much else that I found interesting.  It was more of a family excursion and, as I have no kids, I think would have felt cheated if I’d made a special visit.  However, it was an add-on to Bellesguard so I wasn’t too disappointed.  It only cost €3 using our Barcelona Busturistic discount vouchers so it was reasonable value for money.\n\nAs many other reviewers have said, if you have time to spare in Barcelona, it’s worth a visit but if you don’t have much time, spend it elsewhere.\n\nThe cafe was very good value - two delicious cakes and two drinks for €7.25 - and was certainly worth a visit, if you’re at CosmoCaixa.\n\nWe visited on Saturday 14/10/17 and had no difficulty whatsoever with queues.", "publishedDate": "2017-10-14", "language": "en", "rating": 4}, {"id": 531800482, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d244211-r531800482-CosmoCaixa-Barcelona_Catalonia.html", "text": "This museum is definitely worth paying a visit. It is not that popular because is a bit out of the city centre and all other main tourist attractions.\nAt the same time, for an entrance fee of 4 EUR you can enjoy something between a small zoo, science museum and an entire floor with interactive exhibitions. Recommend!", "publishedDate": "2017-10-10", "language": "en", "rating": 5}, {"id": 530192173, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d244211-r530192173-CosmoCaixa-Barcelona_Catalonia.html", "text": "I visited Cosmocaixa with 12 yrs old son, he enjoyed the -5 floor exhibition.\nDetails are also available in English, so you can enjoy the museum as foreigner.\nI got to understand myself why are planes flying :)", "publishedDate": "2017-10-05", "language": "en", "rating": 5}, {"id": 527279668, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d244211-r527279668-CosmoCaixa-Barcelona_Catalonia.html", "text": "Wow, where do I even start?! I'm not normally a massive fan of museums, but CosmoCaixa was just brilliant. There was just so much to see and do in this beautiful building. \n\nWe only went for a couple of hours but we could have stayed and explored for much longer if we hadn't had other plans. My favourite parts were the interactive experiments on floor -5 and the flooded forest. I also loved the small exhibition about the Arctic at the bottom of the spiral ramp, some of the photographs on display were just phenomenal. \n\nAlthough the museum is out of the way of the city centre, it is easy to get to on the Barcelona Bus Turistic's Blue route. Also, if you ride on the tourist bus your coupon booklet makes adult entry even more of a bargain at only €3.50, instead of the very reasonable normal entry price of €4.50.\n\nI would definitely recommend visiting CosmoCaixa if you want to see something a little different in Barcelona. The exhibits would easily keep both children and adults entertained for a morning/afternoon/the whole day!", "publishedDate": "2017-09-25", "language": "en", "rating": 5}, {"id": 527076789, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d244211-r527076789-CosmoCaixa-Barcelona_Catalonia.html", "text": "We decided to come here due to the reviews and wanted to do something a little different. The admission is so cheap for the amazing displays that are inside. It is very interactive and children would just love it here. Their amazon rainforest was beautifully done, and there is a huge spectrum of sciences that the science museum portrays. In hindsight we wish we had looked into what exhibits were there as you had to pay extra, and seeing how well the museum was presented I imagine these were wonderful especially the planetarium and would be well wroth the additional money. I learnt quite a lot from our short visit here - although I did find the souvenirs expensive (7 euros for a bouncy ball!). ", "publishedDate": "2017-09-24", "language": "en", "rating": 5}, {"id": 524974201, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d244211-r524974201-CosmoCaixa-Barcelona_Catalonia.html", "text": "Keep this one on the list in case it rains. If you and your kids love science then go ahead and put it on your regular to-do list.", "publishedDate": "2017-09-16", "language": "en", "rating": 5}, {"id": 524817868, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d244211-r524817868-CosmoCaixa-Barcelona_Catalonia.html", "text": "Very impressive science museum with many interactive experiences to have fun and discover at any age. Besides, expositions are being renewed often thanks to temporary events. Main languages on signs are Spanish, Catalan, English. French is being implemented for last pieces / temporary expositions.\nI am not a scientist, still I have been amazed to discover all the collection, their planetarium and as well their \"Amazonian forest\" which is really worth having a look :) The museum has made it to let anyone enjoy science its own way.\nI totally recommend to anyone, from science lovers to curious people.", "publishedDate": "2017-09-16", "language": "en", "rating": 5}, {"id": 523807638, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d244211-r523807638-CosmoCaixa-Barcelona_Catalonia.html", "text": "amazing, is a super original and fantastic museum wich my hotel recomended to us, you should not go in barcelona and not see it", "publishedDate": "2017-09-12", "language": "en", "rating": 5}, {"id": 523495099, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d244211-r523495099-CosmoCaixa-Barcelona_Catalonia.html", "text": "It has been amazing watching the best digital innovación, i could use videogames with my mind and there is a WOOD under water", "publishedDate": "2017-09-11", "language": "en", "rating": 4}, {"id": 521848036, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d244211-r521848036-CosmoCaixa-Barcelona_Catalonia.html", "text": "Most of the exhibits are interactive and are not presented in the usual common way. After having gone through a lot of science fairs and centres this experience was still interesting and kept my teenage son engaged.  We had the planetarium show but was a bit disappointed as the show is in Catalan and the sound volume is overwhelming while the audio on the headphones to listen in other languages was defective.\nThe seating of the planetarium is uncomfortable for the purpose of watching the sky.  The astronomical content of the planetarium show seems to need updating as well.  Despite this setback it is still a must see place in Barcelona especially with kids.\nMore friendly information about public transport to and from the Cosmocaxia would also help.", "publishedDate": "2017-09-06", "language": "en", "rating": 5}, {"id": 520787576, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d244211-r520787576-CosmoCaixa-Barcelona_Catalonia.html", "text": "This is a very good family trip to go there. But there is not enough information and attraction in English. Before going there better to learn everything on the internet. For teenage and other age children this is very good place to learn about Cosmo.", "publishedDate": "2017-09-03", "language": "en", "rating": 5}, {"id": 519847478, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d244211-r519847478-CosmoCaixa-Barcelona_Catalonia.html", "text": "I don't care how good your museum is. One hour to queue for tickets with two young children - only one person serving. Not good enough.", "publishedDate": "2017-08-31", "language": "en", "rating": 1}, {"id": 517462577, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d244211-r517462577-CosmoCaixa-Barcelona_Catalonia.html", "text": "The varieties, thoughtful details of exhibitions, so so many hands on activities for children and adults to learn about any particular topic.  I especially love their interactive area.  It is huge here.  There are so much to see and to learn here.  One day is not enough.  This place really put museum in U.S. to embarrassments.....well, at least NY and other states that I have been.  If you or your kids are into rocks and minerals, you will be in treat here.  The collection and how they explain the rock formations here are awesome.  They are the actual rocks and they are two stories tall to show you the formations.  There are many kids activities so you might want to check out their schedules of the day and plan things out.  If you bought the Barcelona card, entry for this place is free.  Food choices inside was decent and price was reasonable.  My kids (7/9 yrs old) and I loved this place and would come back again.", "publishedDate": "2017-08-25", "language": "en", "rating": 5}, {"id": 516981150, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d244211-r516981150-CosmoCaixa-Barcelona_Catalonia.html", "text": "We went with two children (6 & 8) and had a great afternoon, we didn't even manage to get around everywhere we wanted to.  At 4€ per adult and free for children it's a great place to go, there are loads of interactive exhibits and explanations are good.  The restaurant buffet is good value as well.", "publishedDate": "2017-08-24", "language": "en", "rating": 5}, {"id": 516730907, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d244211-r516730907-CosmoCaixa-Barcelona_Catalonia.html", "text": "I was traveling alone in Barcelona for a few days and most museums and cathedral were closed on Sunday.\n\nHence, I just went to this place to spend some time since most comments were positive and said that it was a fun place to stay.\n\nAnd to be honest, this place was so interesting. The design for each floor is well-planned to tell different part of science. The most extraordinary part must be the flooded forest with living fish species besides roots. It was so fun to stay at -5 floor with a lot of machines and technologies to tell attractive scientific facts.\n\nRecommend to scientific lovers and those who do not have any activities on Sunday!", "publishedDate": "2017-08-23", "language": "en", "rating": 5}, {"id": 514975360, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d244211-r514975360-CosmoCaixa-Barcelona_Catalonia.html", "text": "Amazing place for kids and adult. The tickets price was very reasonable( 4 € for adults and free for kids). They also have shows that cost 4€ per person and show. ( kids have to pay for these shows / activities). \nWe stayed for 4 hours and was not enough to cover all the areas! It is huge! \nThe restaurant there have buffet with a corner for kids food ( pasta, pizza, fries ..etc). It cost around 20€ for an adult and a child with drinks. \nThe only thing that I didn't like here is the audio translation device that you need to put it on during the shows to hear the English translation. It kept turning off and the voice wasn't clear most of the times. ", "publishedDate": "2017-08-18", "language": "en", "rating": 5}, {"id": 513370094, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d244211-r513370094-CosmoCaixa-Barcelona_Catalonia.html", "text": "Great place for exploring natural science, physics and history. Make sure you arrive early to book the 3d planetarium show. The tropical forest truly sends you to the Amazon. The rest of the place is just a great opportunity for kids and adults to experiment with science concepts.", "publishedDate": "2017-08-15", "language": "en", "rating": 5}, {"id": 513251857, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d244211-r513251857-CosmoCaixa-Barcelona_Catalonia.html", "text": "One of the best museum I did, very modern and entertaining with a lot of easy experiences you can try to explain science, great for children and adults! and their amazonian forest reconstitution is just amazing, you really feel immersed. Spend 2 hours here and did not do half of it, will surely go back. And it is very affordable. A must do to me in Barcelona, out of the usual tourist attractions. Kudos for this museum!", "publishedDate": "2017-08-15", "language": "en", "rating": 5}, {"id": 512209904, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d244211-r512209904-CosmoCaixa-Barcelona_Catalonia.html", "text": "Museum highly recommended\nEntrance is free\nThere are many things to see and a lot to learn\nAn enjoyable experience", "publishedDate": "2017-08-13", "language": "en", "rating": 5}, {"id": 511651610, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d244211-r511651610-CosmoCaixa-Barcelona_Catalonia.html", "text": "The best place to take the children of any age, even the teens!! It has so many things to watch . I also recommend  the planitarium.", "publishedDate": "2017-08-11", "language": "en", "rating": 5}, {"id": 511342230, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d244211-r511342230-CosmoCaixa-Barcelona_Catalonia.html", "text": "CosmoCaixa  is equally interesting and entertaining for kids and adults. You can spend entire day here. Cool place to visit and spend time with your kids.", "publishedDate": "2017-08-11", "language": "en", "rating": 5}, {"id": 511217926, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d244211-r511217926-CosmoCaixa-Barcelona_Catalonia.html", "text": "Entrance to the museum is cheap and there are not so many people there, but it is definitely worth visiting. It has beautiful photo installation, many showpieces you can actually play with, and gorgeous jungles imitation and aquarium.", "publishedDate": "2017-08-11", "language": "en", "rating": 5}, {"id": 510739540, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d244211-r510739540-CosmoCaixa-Barcelona_Catalonia.html", "text": "That is a great place where the sience, nature, and all the fields are put together and all age guests will love it. Travelling with a three years old kid makes it a perfect place to visit. We've paid 4,5 euro per adult and free for the kid. That is like for free, when all other attraction of Barcelona start with 20 euro and up.THe facilities are designed in a smart and comfort way, so the architecture of the building itselves is worth visiting. It is a bit outside of the city so that is a nice change from the loud and busy centre to a quiet and refreshing place. Although it is well connected with the La Rambla so it's not difficult to get there.", "publishedDate": "2017-08-09", "language": "en", "rating": 5}, {"id": 510667396, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d244211-r510667396-CosmoCaixa-Barcelona_Catalonia.html", "text": "We love this museum, including the kids (4 n 6 yo). We went there on August 2016 and recently on July 2017. It's a must visit! You can interact in most of the experiences, and the Amazonian forest is amazing! Cherry on the pie, it's not expensive at all!", "publishedDate": "2017-08-09", "language": "en", "rating": 5}, {"id": 509628726, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d244211-r509628726-CosmoCaixa-Barcelona_Catalonia.html", "text": "It's an interactive museum, the highlight is the amazon forest experience (they recreated the weather, rain, animals, trees).", "publishedDate": "2017-08-07", "language": "en", "rating": 4}, {"id": 507897544, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d244211-r507897544-CosmoCaixa-Barcelona_Catalonia.html", "text": "Just had a very good family day at CosmoCaixa Barcelona. Great value. This is state of the art stuff. I just can't understand the negativity in one or two other reviews. Yes I was a little confused on arrival as I have neither Spanish nor Catalan but when oriented after a while we spent 5 or 6 hours here today and found the staff great. Aside from the pretty amazing rainforest exhibit with live flora and fauna, the numerous 'experiments' illustrating some fundamentals about how the world works were wonderfully interactive and such fun for our kids. An amazing amount of money has been thrown at this and it really shows (must be a tax right-off for the Caixa Bank?). One nice touch is an outdoor picnic area for those who've brought their own food. We also used the cafeteria which is very good and found prices were reasonable - for Barcelona. Check this attraction out, especially if travelling with curious or intelligent children. A bus runs right by the museum, but afterwards we walked about 8 mins southwards downhill to catching to the Line 7 Metro at Tibidabo Station in Placa de John F Kennedy for a more direct route back to the Eixample.", "publishedDate": "2017-08-01", "language": "en", "rating": 5}, {"id": 507680368, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d244211-r507680368-CosmoCaixa-Barcelona_Catalonia.html", "text": "Incredibly cheap museum for what they offer! For only 4 eur/person (free with Barcelona Card) we just loved the few hours (3-4) we spent here. The only regret was that we didn't have enough time to visit it entirely (5th floors) There was so much to do (interactive play), to see and to read....The tropical forest is awesome :)  ", "publishedDate": "2017-08-01", "language": "en", "rating": 5}, {"id": 504764599, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d244211-r504764599-CosmoCaixa-Barcelona_Catalonia.html", "text": "Visited the museum to do something a little different and cheap during our visit in Barcelona. \n\nGetting the museum was easy, we got the metro and it's around a five minute walk away from the nearest station though slightly uphill so bear that in mind if you have a wheelchair or pram. \n\nThe entrance fee is 4 euros which is really cheap and there are optional activities you can choose for additional costs - these looked really good for the kids.  \n\nThe museum is spread out over five floors though the majority of the exhibits are on the bottom floor. We were really impressed with the amount of hands on exhibits on this floor, there was absolutely loads to do and we spent around 2 hours on this floor alone - it was definitely educational! \n\nThe rainforest is amazing - there's a glass wall between the main part of the bottom floor and the rainforest which means you can see the different animals swimming around - there's fish, stingrays, crocodile, turtles and capybara's! There's also a door which allows you to walk around and under the rainforest with various viewpoints. It was definitely the highlight of the visit! \n\nThe only reason we did not give it five stars was that the layout initially is very confusing and trying to find the ticket office was a nightmare with the security and ticket barrier staff being less then helpful (please note: the exhibit staff were brilliant). Also, a couple of the exhibits weren't working. \n\nTips\nFactor in more money than just the Four euros for the entry fee - there are loads of additional extras that you can purchase such as hands on experience for the kids with animals and a 3D galaxy exhibit. The the additional activities, they do the majority of the them in English but only at certain times. If you want to do any I would definitely recommend pre-planning as there seemed to be only 1-2 a day of the English activities. \n\nAlthough brilliant for kids, it's also fun for adults. We are a 24 and 25 year old and we had a great time! \n\nThere's a restaurant and picnic area for people planning on coming over lunch. \n\nWe went on a weekday afternoon and it was really quiet. Quite a few school trips were leaving as we were arriving, so I would probably recommend going either early morning or after the schools have finished as I imagine that it can get busy and loud when there are school trips there. \n\n", "publishedDate": "2017-07-23", "language": "en", "rating": 4}, {"id": 504324967, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d244211-r504324967-CosmoCaixa-Barcelona_Catalonia.html", "text": "I visited the museum in December. There was one other adult couple there and about 300 young school kids on a day trip! But they were mostly playing outside in the large garden area. \nI completely recommend this science museum for families or adults. Take a map so you can find  it, and its not that far from the metro.\nThe entry fee was such good value, it was something like €4.\nYou enter at the top level and wind your way down through the floors, each with a different theme, before emerging in the central 'rainforest' area (complete with animals, plants and rain!). \nIt was cool and really interesting. There were lots of interactive parts and exhibits. I was surprised there were not more people there, maybe it is aimed more at school trips. There is a restaurant in the outdoor area.", "publishedDate": "2017-07-21", "language": "en", "rating": 5}]}}]