[{"locationId": 8321570, "name": "Hibernian Books", "placeType": "ATTRACTION", "reviewListPage": {"reviews": [{"id": 741152265, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d8321570-r741152265-Hibernian_Books-Barcelona_Catalonia.html", "text": "I am absolutely in love with this bookshop. There's a great selection of books from all genres, I especially enjoy the literature/classics wide selection. Prices are affordable and there are some more recent books too. The French section is quite good as well (and probably the best of all foreign languages). And above all, an amazing setting and vibes! ", "publishedDate": "2020-01-25", "language": "en", "rating": 5}, {"id": 627566103, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d8321570-r627566103-Hibernian_Books-Barcelona_Catalonia.html", "text": "In Barcelona for 3 days & had finished my one book after a wakeful night. Did a Google search for a 2nd hand bookstore & there was the Hibernian, about 15 minutes walk from the hotel. Found 2 lightweight reads, cost €6.10, & feel very happy. Good little shop. Thanks.", "publishedDate": "2018-10-23", "language": "en", "rating": 5}, {"id": 609334916, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d8321570-r609334916-Hibernian_Books-Barcelona_Catalonia.html", "text": "Having hours to kill on the Thursday, waiting for my flight back to the UK, I decided to pop in here the evening before and pick up a paperback to while away the day.\n\nIt is absolutely delightful! It smells like a bookshop should. The young lady behind the counter did not jump in with a 'How can I help you?' which is how I like my bookshops. I like to enter and browse and browse and browse with no pressure. When I engaged the young lady in conversation whilst purchasing my - very, very reasonably priced - books, she was charming and friendly.", "publishedDate": "2018-08-22", "language": "en", "rating": 5}, {"id": 545337179, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d8321570-r545337179-Hibernian_Books-Barcelona_Catalonia.html", "text": "I like Black Books on TV, not so much in real life. The surly Irishman behind the counter is a poor imitation of Bernard Black, and made my visit a thoroughly unpleasant experience. The whole time I was there he was loudly rude and passive-agressive toward his co-worker, making everyone in the store quite uncomfortable.  When I went to pay I was greeted with a surly glance from the above mentioned gentlemen while he continued to file his nails and ignore me until his co-worker was ready to serve me. \nDon't bother attempting to sell books to them. They will either accuse you of trying to steal them, or offer you 1 Euro for a book in brand new condition (or in my case both).\n\nI guess one positive is that I'm now inclined to learn Spanish so I never have to go back there.", "publishedDate": "2017-12-05", "language": "en", "rating": 3}, {"id": 533123572, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d8321570-r533123572-Hibernian_Books-Barcelona_Catalonia.html", "text": "I came across this secondhand English bookshop by chance while I was attending a training course just down the road in Gracia. The name caught my eye as I'm Irish and know that Hibernia is the Latin word for Ireland! They have a large selection of fiction (my favourite genre) and, after playing a little game of bibliomancy, I picked one book I had tried to read in French but struggled with, so was happy to find the English translation here.\nThe owner is from Ireland and he reminded me a bit of the character from the TV series Black Books (less the cigarettes and booze)!!!", "publishedDate": "2017-10-15", "language": "en", "rating": 4}, {"id": 479170721, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d8321570-r479170721-Hibernian_Books-Barcelona_Catalonia.html", "text": "I can only concur with the majority of reviewers here. As a foreign resident of Barcelona I was happy to find this shop. There are a few nice finds here. However, after about half a dozen visits I have found the staff to be consistently haughty. It doesn't make for a great experience. And a good experience is much of what I seek in a second-hand book shop.", "publishedDate": "2017-04-26", "language": "en", "rating": 2}, {"id": 379194330, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d8321570-r379194330-Hibernian_Books-Barcelona_Catalonia.html", "text": "My husband and I were so excited to find a second hand English language bookshop in Barcelona.  We made a trip across the city one evening specifically to visit it.  The selection was good, but I'd hoped for a larger section of Spanish or Catalan history.  I imagine that their main clientele consists of expats, but they get enough tourists in the shop that they had a separate section for travel guides to Spain and Spanish language learning.  Perhaps history just isn't as popular. \n\nI'd also hoped for a little more friendliness from the staff.  The person behind the counter barely looked up when we came in, didn't say a word to us the whole time we were in the shop, and could hardly be bothered to tell me the total when I did end up purchasing a book.  Hibernian advertises itself as the only English language bookshop in Barcelona, so I guess maybe the lack of competition is why things are a bit lackluster.", "publishedDate": "2016-06-02", "language": "en", "rating": 3}, {"id": 371833021, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d8321570-r371833021-Hibernian_Books-Barcelona_Catalonia.html", "text": "On my trip I made it a point to by a different book in each city I visited, which is how I came about this store. You can stop by here if you walk from the city center to Park Güel, as it is somewhat removed from the city center, but still walkable.\n\nThe selection is decent, a good amount of old classics, a section of some beatniks and other American iconic books. The typical self help, children's, a small religious section, etc.. \n\nIt claims to be the only secondhand all English bookstore in all of Barcelona. \n\nI purchased a new copy of Dostoevsky's 'The Idiot' for 3.50€. \n\nWorth checking out if you are in the area. ", "publishedDate": "2016-05-10", "language": "en", "rating": 4}, {"id": 346118055, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d8321570-r346118055-Hibernian_Books-Barcelona_Catalonia.html", "text": "I love second hand books as well as new ones and when my friend took me to Hibernian I was so excited!\n\nI was looking for the second harry potter book and was looking under literature (if its the wrong section then 'my bad' i don't work in a book shop), well the only staff member in the shop asked what I was looking for.... I replied J.K Rowling. To my shock he smirked and said well you wont find it there , its a child's book! Way to really annoy a potential customer. \n\nThere was also a small display with a book my friend really wanted so he picked up the book and paid for it . All sounds fine...... Next thing.... the shop worker asks me to wait while he made several DO NOT TOUCH signs. He made me wait for sure, and then huffed and puffed towards us and placed the signs where my friend had picked up the book. \n\nSo if it wasn't for the fact that the shop is great, quirky and quaint I would not be returning. I found him unhelpful, condescending and down right rude.\n\nSuch a shame, because if that shop had the right person to run it , it a warm personality I think the shop could and would be busier. \n\nnote to management: he may be passionate about the shop and the books... but he needs to remember tat its his customers and possibly returning customers that makes that place stay open!", "publishedDate": "2016-02-09", "language": "en", "rating": 3}, {"id": 327226331, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d8321570-r327226331-Hibernian_Books-Barcelona_Catalonia.html", "text": "I don't really have anything to add to \"butterytoast's\" review except to say that I really want this store to be better than it is. To do that, the main people behind the counter would have to become more welcoming. To do that, the stock would have to become more varied. I don't see either of those things happening. Regardless, I still spend dozens of euros a month buying books there, even counting the quite generous amount of money you get for books you return.\n\nAnd I'm still going to say if you like English language books, there's no better place to find them than in this store. And it is basically the only place to find second hand books. I've bought a few new books from stores that are much more welcoming, but I will continue to shop at Hibernian in spite of its failings. I suppose that's giving the proprietors much incentive to change. Oh well, I doubt they'd do that in any case.", "publishedDate": "2015-11-16", "language": "en", "rating": 3}, {"id": 292557908, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d8321570-r292557908-Hibernian_Books-Barcelona_Catalonia.html", "text": "I live in Barcelona and regularly buy from Hibernian, at least once or twice a month and often more than one book at a time. It is a blessing for a big reader like me, and if you go in regularly you can find new stock although the display and general air is tired and stale. \n\nThe atmosphere in the shop though is something else. The owner gives off the impression that you are an inconvenience, including in some posts they put on facebook, speaks to you in Catalan (which I can speak and understand but I am English and we are in an English bookshop for goodness sakes) and grunts a hello at you only after you say hello to him. Sometimes feels like you can cut the atmosphere with a knife. No expected from any shop owner, less so when you are a regular customer. Lots to be improved.", "publishedDate": "2015-07-26", "language": "en", "rating": 2}, {"id": 286535436, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d8321570-r286535436-Hibernian_Books-Barcelona_Catalonia.html", "text": "Being from Leith, Edinburgh, I was very excited to find Hibernian books on my doorstep in Gracia. Turns out the staff don't really know why it's called that, have never heard of Easter Road, and I was denied my little bit of a touchstone to home. The stock is mostly a lot of old Jackie Collins, Sophie Kinsella, fluff thrillers, etc, so I can't say I was too impressed - & books obviously don't stand up well to the Spanish climate as they were often a bit mangy looking. Redeeming qualities were a good stack of Roald Dahl for the kids, and your usual stock of classics. Oh, and cash only. Would I come here again? Probably just bring a kindle instead (says she who doesn't own a kindle out of principle...)", "publishedDate": "2015-07-07", "language": "en", "rating": 2}, {"id": 280668230, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d8321570-r280668230-Hibernian_Books-Barcelona_Catalonia.html", "text": "Hibernian is a small used English bookstore.\n The closest metro stop is,La Fontana. L2 on the green line\n\nThey have a small but adequate sections of bookson , literature, bios, recent fiction, crime , and some good , junky paperbacks for train reading. Along with some classic pulp fiction novels from post WW2. No sports section thouugh.\n\nThe prices vary from 1.50 E to 4.50 E.   So compared to an US used bookstores ,it is on the expensive side. \n\nThe english speaking staff is helpful and patient.  Many are students at the local ESL schools\n\nNote when I traded in 3 paperbacks in good condition, I recieved a 1.75 E credit", "publishedDate": "2015-06-16", "language": "en", "rating": 4}]}}]