[{"locationId": 8807461, "name": "Font de Santa Anna", "placeType": "ATTRACTION", "reviewListPage": {"reviews": [{"id": 690242883, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d8807461-r690242883-Font_de_Santa_Anna-Barcelona_Catalonia.html", "text": "As you walk from Plaza Cataluña towards the Cathedral of Barcelona, you will find the Font de Santa Anna (Fuente de Santa Ana, in Spanish). It is located at the intersection of Carrer de Cucurulla y Avinguda del Portal de l’Àngel.\n\nThis fountain is located at the neighborhood known as Barri Gotic. It was built on 1356, and it was originally used as a drinking trough for the horses of the guests of nearby Hostal del Vallès. The fountain is attached to the Palau del Comtes de Pignatelli (the Palace of the Counts of Pignatelli), which is now the Reial Cercle Artístic de Barcelona (Real Círculo Artístico de Barcelona)\n\nThe walls of this lovely fountain are decorated with ceramic tiles in white, blue, green and yellow, as well as a coat of arms of the city carved in stone. While you are exploring this old neighborhood, you can rest for a while on the same place where those horses used to quench their thirst hundreds of years ago.", "publishedDate": "2019-07-16", "language": "en", "rating": 5}, {"id": 689848405, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d8807461-r689848405-Font_de_Santa_Anna-Barcelona_Catalonia.html", "text": "The Font de Santa Anna is a fountain in the Gothic Quarter of Barcelona. Built in 1356, it’s the oldest extant fountain in the city. I discovered that it was originally built together with the trough next to it, as a drinking well for horses and mules arrived at the nearby street of Portal de l’Angel. \n\nThe original design of the well is unknown, but it was given the the current polygonal shape in the 19th century, while the ceramic tiles and vases that crown the top o were added in 1917. I’m not sure why the fountain is dedicated to Saint Anna though, as there are no references that I can see to the saint. The images of the women on the tiles main show women carrying water, alluding to it’s originally purpose.\n\nIt’s okay, but don’t go out of the way to see it though.", "publishedDate": "2019-07-15", "language": "en", "rating": 3}, {"id": 677433191, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d8807461-r677433191-Font_de_Santa_Anna-Barcelona_Catalonia.html", "text": "You can rest for a while on this beautiful little fountain, while admiring its tile compilations, with the central depicting the City' s Coat of Arms.", "publishedDate": "2019-05-29", "language": "en", "rating": 5}, {"id": 615177865, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d8807461-r615177865-Font_de_Santa_Anna-Barcelona_Catalonia.html", "text": "We have been coming to Pals for the last ten years but this was our first visit to Font de as bruixa! It will not be our last. But, you must book. We saw so many Spanish arriving late but turned away. What a little treasure this is but you must keep following the signs rather like following Hanzel and Gretel's trail. You will not be disappointed. We had the calamari as starter followed by sea bass and the 300 gms sirloin both cooked on the BBQ and both excellent. The chef sitting in the BBQ area must be baking! But he cooks to order. Accept the delay! The tart tatin was too much but lovely and not to be missed. \n\nAn experience to be enjoyed and revisited, but you must book.", "publishedDate": "2018-09-09", "language": "en", "rating": 5}, {"id": 583783319, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d8807461-r583783319-Font_de_Santa_Anna-Barcelona_Catalonia.html", "text": "This fountain dates to 1356, it was originally believed to be octagonal shape but now only five sides are evident, the rear wall most likely replacing the other three. It was renovated in 1819 and again in 1918. Ceramic murals adorn each side with the foremost mural depicting the City's Coat of Arms. A link with the past.", "publishedDate": "2018-05-29", "language": "en", "rating": 5}, {"id": 549995996, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d8807461-r549995996-Font_de_Santa_Anna-Barcelona_Catalonia.html", "text": "This beautiful fountain was located right in front of our hotel Catalonia Catedral.\n\nThe fountain is from 1356. However, the ceramics works are much newer from 1918.", "publishedDate": "2017-12-29", "language": "en", "rating": 5}, {"id": 505249131, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d8807461-r505249131-Font_de_Santa_Anna-Barcelona_Catalonia.html", "text": "I kind of took up the challenge to find as many fountains as possible. Many were very plain but some like Canaletes and portaferrissa have character and great design. This is another fountain. Also it is just off Porta de l'Angel and the major shopping in the Gothic Quarter. Again it takes no time to visit and it is a great piece of cultural artwork for the city.", "publishedDate": "2017-07-24", "language": "en", "rating": 4}, {"id": 473413064, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d8807461-r473413064-Font_de_Santa_Anna-Barcelona_Catalonia.html", "text": "Passed this without really realising what it was - it's pretty, but there is nothing nearby to explain what it is, sadly.", "publishedDate": "2017-04-07", "language": "en", "rating": 3}, {"id": 419147441, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d8807461-r419147441-Font_de_Santa_Anna-Barcelona_Catalonia.html", "text": "This was our second visit and the service and food were great. The restaurant is busy and seems with a lot of locals, it was clean and the service was good and efficient. ", "publishedDate": "2016-09-16", "language": "en", "rating": 4}]}}]