[{"locationId": 658750, "name": "Parc del Forum", "placeType": "ATTRACTION", "reviewListPage": {"reviews": [{"id": 750211326, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d658750-r750211326-Parc_del_Forum-Barcelona_Catalonia.html", "text": "As a local, I think there are much better places to visit during your stance in Barcelona. It is OK if you are doing a long stance in Barcelona and you want to do some exercise like jogging or swimming in the sea, otherwise, invest your time in other places like going to Tibidabo to see the views of the city or one-day excursion to Sant Pol de Mar.", "publishedDate": "2020-03-10", "language": "en", "rating": 3}, {"id": 640648481, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d658750-r640648481-Parc_del_Forum-Barcelona_Catalonia.html", "text": "l visit the place for Primavera, there is not much to visit other than festival zone but it is cool to be near the sea, especially when u are in a festival. But not the best spot to visit in Barcelona ofc because it is a little bit away from the city center:)", "publishedDate": "2018-12-19", "language": "en", "rating": 3}, {"id": 617307688, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d658750-r617307688-Parc_del_Forum-Barcelona_Catalonia.html", "text": "Concrete jungle with a surreal feeling of space. I came at sunrise and it was outstanding to see the large architectural structures of concrete near the beach. It was completely empty and you could feel the sense of size.", "publishedDate": "2018-09-17", "language": "en", "rating": 4}, {"id": 592177049, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d658750-r592177049-Parc_del_Forum-Barcelona_Catalonia.html", "text": "This is at the far north end of the city and a good 12 $ can ride from La Rambla. A lot of reviews say it’s ugly and non functional, I disagree. There’s isn’t any sand, and there is a concrete break water to make a nice little inlet for swimming. No waves, like a natural little pool. There was also a mechanical wake boarding course you could do. There was a small snack shop and showers, etc. may look like a concrete jungle-which it is, but if I lived in Barcelona I would make that place a habit-it was so empty and quiet. ", "publishedDate": "2018-07-01", "language": "en", "rating": 4}, {"id": 591472191, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d658750-r591472191-Parc_del_Forum-Barcelona_Catalonia.html", "text": "You will like the space , if you are an architect or interested in architecture. There is a museum in the complex designed by celebrated architects Herzog de Meuron. The whole waterfront is developed for activities for the public.\n\nThe view of the sea is beautiful. There is calm and peace, you can look at the sea for long. Carry a book and relax. \n\nThere is theater and cafes as well.", "publishedDate": "2018-06-28", "language": "en", "rating": 4}, {"id": 566040310, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d658750-r566040310-Parc_del_Forum-Barcelona_Catalonia.html", "text": "Although it's name, it is not a park, just a place to walk or go around with the bike, besides watching the yachts and the sea, there is not too much to do here, maybe take some pictures if you like photography.\nI wouldn't tell you to come if you are not around, you will find yourself disappointed, the only attraction here is the \"bosc urbà\" (urban forest) for children, read the reviews of that place to know more.", "publishedDate": "2018-03-12", "language": "en", "rating": 2}, {"id": 543301939, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d658750-r543301939-Parc_del_Forum-Barcelona_Catalonia.html", "text": "Ugly, functional if viewed with much esteem, it is also too far away to offer leisure activity as such, despite having Metro and tramway nearby to arrive.", "publishedDate": "2017-11-26", "language": "en", "rating": 2}, {"id": 497317713, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d658750-r497317713-Parc_del_Forum-Barcelona_Catalonia.html", "text": "An excellent place to hang out on weekends and run, ride your skate or bicycle.Amazing space and perfect location for the music festivals.Big open space, swimming area that is enclosed by big rocks", "publishedDate": "2017-06-29", "language": "en", "rating": 5}, {"id": 478219984, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d658750-r478219984-Parc_del_Forum-Barcelona_Catalonia.html", "text": "It's not really a parc, it was built for and exposition years ago and nowadays is a lonely part of the city. The only relevant thing to visit is the zoological museum, the blue museum, which is a good place for children.", "publishedDate": "2017-04-23", "language": "en", "rating": 2}, {"id": 476957990, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d658750-r476957990-Parc_del_Forum-Barcelona_Catalonia.html", "text": "we went to this place near the sea, it has a big solar panel as a monument, i don't know if it works or only is visual style, it is near limit Barcelona with Badalona", "publishedDate": "2017-04-18", "language": "en", "rating": 4}, {"id": 456941203, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d658750-r456941203-Parc_del_Forum-Barcelona_Catalonia.html", "text": "This park is perhaps not a real sightseeing spot in Barcelona, but might be worth a visit when interested to explore more than just the popular places around the city. This place is well connected by public transport, including  metro line 4 tram line T4 and bus lines. If you like climbing, there are some opportunities to do so. Also its a good place for skate boarding.", "publishedDate": "2017-02-03", "language": "en", "rating": 4}, {"id": 375955615, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d658750-r375955615-Parc_del_Forum-Barcelona_Catalonia.html", "text": "I like finding things that are a bit further from the usual tourist circuit, and this is one of them. It can be a really tranquil place to soak in the scenery, watch the water, and relax for a while.", "publishedDate": "2016-05-23", "language": "en", "rating": 5}, {"id": 350286864, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d658750-r350286864-Parc_del_Forum-Barcelona_Catalonia.html", "text": "This is an excellent area of Barcelona for walking while contemplating a magnificent view of buildings and very energetic, like the shot I attached of the headquarters of the TELEFÓNICA company. \nThere are also many facilities to reach it by public transport. And if you want to take good pictures do not miss the spectacular cloudy days.", "publishedDate": "2016-02-23", "language": "en", "rating": 5}, {"id": 340012466, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d658750-r340012466-Parc_del_Forum-Barcelona_Catalonia.html", "text": "This whole area was designed for hosting the 2004 Universal Forum of Cultures. As I am often staying in the nearby hotel, it became one of my favorite activities to wander around some amazing architectural structures in the neighborhood and this park is certainly among them.", "publishedDate": "2016-01-14", "language": "en", "rating": 4}, {"id": 330498869, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d658750-r330498869-Parc_del_Forum-Barcelona_Catalonia.html", "text": "This is a photographer's dream. All the modern buildings are just so unique and the make for great framing and composition. You can get great photos without having to try very hard. Loved this building, the lines and shape gave me one of my favourite photos on our trip.", "publishedDate": "2015-12-03", "language": "en", "rating": 4}, {"id": 286899753, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d658750-r286899753-Parc_del_Forum-Barcelona_Catalonia.html", "text": "Easily reachable by metro to the stop \"El Maresme / Forum\", the festival area was just a short walk toward the beach. \nI haven't been to many festivals but thought this one was very well organized. Security wasn't very quick to react when a girl in the audience passed out though, and had no intention of pulling her out until people screamed at them to do so. \nThe whole area is so big they had a free shuttle bus running to the main stages and back so you wouldn't have to walk all the way.", "publishedDate": "2015-07-08", "language": "en", "rating": 5}, {"id": 208530390, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d658750-r208530390-Parc_del_Forum-Barcelona_Catalonia.html", "text": "I think my impression of this festival site is based more on the efficient organisation of the Primavera festival than the venue itself. It actually has a lot of wobbly paving stones which catch you out and spray you with muddy water (if it's been raining), but that aside the sea as a backdrop to a festival is perfect and the purpose built festival arena accommodates stages of varying sizes and shapes, and it's right next to a Metro station. There was torrential rain in May when we visited and the site is prone to large puddles, as it is very uneven, but the organisers of Primavera Sound coped so well with this that it didn't matter all. I was impressed and would definitely return in future. I can't really comment on how well the venue would work for other types of event.", "publishedDate": "2014-06-02", "language": "en", "rating": 4}, {"id": 175077481, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d658750-r175077481-Parc_del_Forum-Barcelona_Catalonia.html", "text": "Originally we came to visit Museu Blau, but just before we purchased tickets the staff at the museum told us that entrance is free after 15hrs, so we decided to wait 45 minutes that we spend at the playground near the museum. Our little kid enjoyed the playground very much and spend a very good time climbing and jumping and just running. We, the parents got a nice spot in the shadow and relaxed watching the extraordinary views of the surroundings.", "publishedDate": "2013-09-01", "language": "en", "rating": 4}]}}]