[{"locationId": 1192270, "name": "Los Pabellones de la Finca Guell", "placeType": "ATTRACTION", "reviewListPage": {"reviews": [{"id": 714171959, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d1192270-r714171959-Los_Pabellones_de_la_Finca_Guell-Barcelona_Catalonia.html", "text": "The  Pavilions Güell -  Los Pabellones de la Finca Güell , is a complex of buildings in the neighborhood of Pedralbes, Barcelona, by architect Antoni Gaudí, built between 1884 and 1887. Beautiful  gardens and stables. Gaudí was also partially responsible for the design this  gardens, where he built two fountains.  The “Fountain of Hercules” still stands. And the gate - this is it.  An iron gate  surmounted by a dragon.This creature with its mouth open showing his sharp teeth . Whenever you open the door the dragon will raise his leg and show his fearsome claws. Wonderful friendly and informative staff.", "publishedDate": "2019-09-30", "language": "en", "rating": 4}, {"id": 649999663, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d1192270-r649999663-Los_Pabellones_de_la_Finca_Guell-Barcelona_Catalonia.html", "text": "As with all Gaudi work, it is definitely worth a visit if you use the hop on/off bus tour that runs by it. Not really worth a special trip otherwise as there is not much to see as this is private property and what you can see is limited. Certainly the dragon is a work of art!", "publishedDate": "2019-02-03", "language": "en", "rating": 3}, {"id": 636196979, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d1192270-r636196979-Los_Pabellones_de_la_Finca_Guell-Barcelona_Catalonia.html", "text": "It is always interesting seeing works by great masters and this is just as good, perhaps not as magnificent as Gaudi's famous Sagrada Familia and other houses in Barcelona, but it's worth a look. You don't have to pay entry fees as long as you keep your distance and stay outside!", "publishedDate": "2018-11-27", "language": "en", "rating": 3}, {"id": 581196235, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d1192270-r581196235-Los_Pabellones_de_la_Finca_Guell-Barcelona_Catalonia.html", "text": "The Hop on Hop off bus has a stop here. You might want to by pass this place and see the other two Gaudi houses on their tour. By tickets online for the other Gaudi attractions to save time in long lines\nUnless you are a die hard Gaudi follower I would not spend more than 5 minutes here and I would not pay the expensive entree fee. This house is on private property which makes it more expensive to go in. The only real thing of interest I found was the dragon on the iron gate and you DO NOT Need to go in to see that you can see it from the street.\nIf you  do go inside you will find  a small  house with an adjoining barn. The grounds and garden are not well kept.", "publishedDate": "2018-05-19", "language": "en", "rating": 2}, {"id": 566206836, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d1192270-r566206836-Los_Pabellones_de_la_Finca_Guell-Barcelona_Catalonia.html", "text": "I note that many people who have gone there say there is not much to see except the dragon gate.  It is an early Gaudi work for the Guell estate (mainly a stable), therefore I do not except something spectacular. But as I am interested in checking out Gaudi's early works (Torre Bellesguard, Colonia Guell, Palau Guell, etc) this time, I decided to go. If you don't want to pay the entrance fee, you can still view the dragon gate and other features of the structure from the outside. \nThe staff at the ticket office was very enthusiastic in explaining the history and use of the place, some details of the design, and also showed me photos of some other Gaudi's works (including those not in Barcelona). I asked him a number of questions which he glady answered.\nI understand that the place is under the University of Barcelona and is open for public viewing as part of the modernista heritage of Barcelona. For the price of a cup of coffee (I paid €2.5 to enter), if I could contribute in a very small way to help maintain this piece of heritage, I would gladly do that.", "publishedDate": "2018-03-13", "language": "en", "rating": 4}, {"id": 561589417, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d1192270-r561589417-Los_Pabellones_de_la_Finca_Guell-Barcelona_Catalonia.html", "text": "This place is far off the beaten path, we ended up here to buy the Ruta del Modernismo guidebook.  The English version has beautiful photos, maps, and descriptions of modernist buildings in Barcelona and other places in Catalonia.  You get a book of discount coupons for visiting various places, you can make up the price of the book with a few visits.  As others have noted this particular Gaudi work is modest, with the highlights visible from outside the gate.  The admission charge is 4 euros, but if you buy the guidebook is only 2 euros.  The inside is OK but not as compelling as the exterior decoration, which you can enjoy without paying.", "publishedDate": "2018-02-19", "language": "en", "rating": 4}, {"id": 543304065, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d1192270-r543304065-Los_Pabellones_de_la_Finca_Guell-Barcelona_Catalonia.html", "text": "The acces door is magnificent, but if you're not an architecture student, you have to save the entry fee. There are a lot better thing to see from Gaudí", "publishedDate": "2017-11-26", "language": "en", "rating": 3}, {"id": 525008648, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d1192270-r525008648-Los_Pabellones_de_la_Finca_Guell-Barcelona_Catalonia.html", "text": "This parc is out of this world. Just thinking the hours of work invested on it, Gaudi's creativity and imagination makes my mind explode. So worth visiting and spending your time observing the view. It has an awesome overview of Barcelona.", "publishedDate": "2017-09-16", "language": "en", "rating": 5}, {"id": 517820587, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d1192270-r517820587-Los_Pabellones_de_la_Finca_Guell-Barcelona_Catalonia.html", "text": "We've been to Barcelona several times, so we decided to visit what we've never visited before, so we went to the Palau real (park with a small castle not open to the public, but free), and then we headed to the finca which is just next to it. \nThe guy at the entrance told us that half of the buildings were close (only the stables were open). He gave us an explanation, showed pictures, he did a great job. But the inside is just not worth it. Don't waste your money (I don't say time as you finish the visit in less than 5 minutes) and go to the monastery which is in the same street a few minutes away from it, it cost the same and it's worth it.", "publishedDate": "2017-08-26", "language": "en", "rating": 1}, {"id": 505300608, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d1192270-r505300608-Los_Pabellones_de_la_Finca_Guell-Barcelona_Catalonia.html", "text": "The current Royal Palace in Barcelona at one time was the country estate for Eustebi Guell. While Gaudi did not design the structure, Guell did hire him to design the entrance gate and horse stables. \n\nThis shows Gaudi at his beginning in a mudejar style design very similar to Casa Vicens. The site has a number of tile designs in exposed brick. Also you see several parabolic arches that Gaudi loved so much. However the highlight is the dragon gate which also shows a Gaudi feature with wrought iron designs. This one is perhaps his best and it was one of his first. I love it because he put such detail into a minor structure for the overall property. Once you see it, you understand why Guell latched on the architect from some of his greatest work. \n\nAlso notice the design in Guell's initials and the flower pot on top with a iron plant and flowers. Simply amazing. Great to see the beginning. \n\nFinally while I would have paid the fee to see the interior, I visited just after sunrise before opening and really got to see without paying. You can really visit at anytime to see it.", "publishedDate": "2017-07-24", "language": "en", "rating": 5}, {"id": 497318719, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d1192270-r497318719-Los_Pabellones_de_la_Finca_Guell-Barcelona_Catalonia.html", "text": "It's an ok place but not really worth the 4€. You can see a few tools and that's about it. The dragon outside is cool but you don't need to go in.It costs money to enter the garden and there is not too much to see inside. The draconic gate is spectacular though. Not necessarily a must hit place within Barcelona, but if you find you have time to spare or are on the hop on hop off bus it could be a nice stop.", "publishedDate": "2017-06-29", "language": "en", "rating": 3}, {"id": 495167239, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d1192270-r495167239-Los_Pabellones_de_la_Finca_Guell-Barcelona_Catalonia.html", "text": "Really not worth your time and certainly not the cost. It's really just a 5 euro stable and nothing more. The guy at the admission booth essentially told us that so we didn't go in.", "publishedDate": "2017-06-22", "language": "en", "rating": 1}, {"id": 491444256, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d1192270-r491444256-Los_Pabellones_de_la_Finca_Guell-Barcelona_Catalonia.html", "text": "It's not worth visiting.  Hardly people go.  The girl is great to explain . I would suggest u to go . Okay don't go ", "publishedDate": "2017-06-08", "language": "en", "rating": 1}, {"id": 488243494, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d1192270-r488243494-Los_Pabellones_de_la_Finca_Guell-Barcelona_Catalonia.html", "text": "I only viewed the Porter's Lodge, Stables and Gate from outside the gate.  No admission, open to view all the time.  Yet it offers valuable insights into Gaudi's later work, particularly for his major patron, Eusebi Güell i Bacigalupi, the count of Güell.  Built in 1884-1887, the ensemble demonstrates his whimsical designs and mastery of brick work.  It is Gaudi's first use of of Trencadis, using shards of tiles or other ceramics to decorate masonry surfaces. Here it was used to add sparkle to brick walls.\n\nA visit outside the gates takes only a few minutes, but it well worth the effort.", "publishedDate": "2017-05-27", "language": "en", "rating": 4}, {"id": 476036591, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d1192270-r476036591-Los_Pabellones_de_la_Finca_Guell-Barcelona_Catalonia.html", "text": "Finca Guell,\n\nFrom the outside it looks quite impressive with that large metal dragoon guarding the gate. Inside it it is a run down park with limited options. You will find a small museum with a display of concrete blender, minor tools and some explaining drawing hence Guells work. A small theatre with a video is accessible to all. Paying 5 EURO to enter is probably the most wasted money for years. That said in the next 5 year period there are plans that will improve \"things\" seen from a touristic angle and paying more respect and credit to Guell. \nBeen there done that, will not return. \n\nSendt fra min iPad", "publishedDate": "2017-04-16", "language": "en", "rating": 2}, {"id": 475808645, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d1192270-r475808645-Los_Pabellones_de_la_Finca_Guell-Barcelona_Catalonia.html", "text": "All there is to see is really the gate. 5€ isn't much but better spend it on a beer. As mentioned before, definitively a rip off\nThere is really nothing inside. Wouldn't even call it a park, landscaping is run down, small map from 100 years go shows a large park but only about 10% is left in the area accessible after paying so there anout 10 m x 30 m of wasteland to see. There is a larger park nearby totally free.\nSkip this one.", "publishedDate": "2017-04-15", "language": "en", "rating": 1}, {"id": 471436149, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d1192270-r471436149-Los_Pabellones_de_la_Finca_Guell-Barcelona_Catalonia.html", "text": "Fascinating gate house designed by Gaudi. It is being slowly restored, financed by the 5 euro entry which I personally think is well worth it to help maintain such an important site. The garden contains a lovely little nature reserve where you can see wildflowers and even little lizards scurrying about! The people that work there are enthusiastic and very helpful, keen to explain everything about the gatehouse. Well worth a visit!", "publishedDate": "2017-03-30", "language": "en", "rating": 5}, {"id": 461181871, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d1192270-r461181871-Los_Pabellones_de_la_Finca_Guell-Barcelona_Catalonia.html", "text": "Don't bother entering the garden; the price is 5 euros and it really is not worth it. The beautiful part of the place is the dragon gate and the rooftops of the pavillions, and that can be seen from the outside. Worth a visit, but only from the outside.", "publishedDate": "2017-02-19", "language": "en", "rating": 2}, {"id": 460036341, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d1192270-r460036341-Los_Pabellones_de_la_Finca_Guell-Barcelona_Catalonia.html", "text": "This was Gaudis first building in Barcelona it was a house with stables for count guell who he built a lot of buildings for! Anyway the house has gone but the gardens remain and stable block the most interesting thing here is the gate which Gaudi designed in wrought iron it is very impressive and worth a look to be hones save the 5 Euro entry fee and just look at the gate it's the best bit! ", "publishedDate": "2017-02-15", "language": "en", "rating": 4}, {"id": 451933323, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d1192270-r451933323-Los_Pabellones_de_la_Finca_Guell-Barcelona_Catalonia.html", "text": "As a Gaudi buff, I took note of other reviewers and so did not enter the park. Instead I went solely to view the gate. It's certainly a magnificent sight, and even better, there was not another tourist in sight!  The technical skills areas be commended. There's also a nice large free park virtually next door that made a restful break.\n", "publishedDate": "2017-01-14", "language": "en", "rating": 4}, {"id": 451556816, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d1192270-r451556816-Los_Pabellones_de_la_Finca_Guell-Barcelona_Catalonia.html", "text": "We paid 4 euro each to see ...... nothing.  A \"park\" that has never been maintained and two small farm buildings.  Look at the gate, but don't walk in.  Our only major disappointment in Barcelona.", "publishedDate": "2017-01-12", "language": "en", "rating": 1}, {"id": 447410630, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d1192270-r447410630-Los_Pabellones_de_la_Finca_Guell-Barcelona_Catalonia.html", "text": "That's it what you see outside with the dragon design and gate and the towers is good enough from the outside not worth to go in unless you want to WC...", "publishedDate": "2016-12-29", "language": "en", "rating": 2}, {"id": 440631826, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d1192270-r440631826-Los_Pabellones_de_la_Finca_Guell-Barcelona_Catalonia.html", "text": "This complex consists of two building that are linked by a mind blowing cast iron gate thawt is adorned with major Art Nouveau designs. The main thing to see here is the big iron dragon. A major WOW factor.", "publishedDate": "2016-11-28", "language": "en", "rating": 5}, {"id": 440508185, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d1192270-r440508185-Los_Pabellones_de_la_Finca_Guell-Barcelona_Catalonia.html", "text": "So the only reason we stopped by this 'gate' is because it was literally 500 ft from our hotel.  Fortunately we read the other reviews and didn't pay to go inside the park.  It looked to be under heavy construction.  The actual gate is interesting.  That's it. Just interesting.  Unless you're a die hard Gaudi fan I wouldn't make a special trip to see it.", "publishedDate": "2016-11-27", "language": "en", "rating": 3}, {"id": 423305844, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d1192270-r423305844-Los_Pabellones_de_la_Finca_Guell-Barcelona_Catalonia.html", "text": "Remains of Güell summer residence - tiny park, gatekeepers house and stables. Wonderful Gaudi's architecture and cool iron Dragon Gate. Entrance is just 4 €.", "publishedDate": "2016-09-28", "language": "en", "rating": 4}, {"id": 413585958, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d1192270-r413585958-Los_Pabellones_de_la_Finca_Guell-Barcelona_Catalonia.html", "text": "We were really disappointed. The only thing that´s nice is the door of this parc which you can see from the outside. But in the parc there is really NOTHING! And the entry is 4 euros. So disappointing!", "publishedDate": "2016-09-01", "language": "en", "rating": 1}, {"id": 408544353, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d1192270-r408544353-Los_Pabellones_de_la_Finca_Guell-Barcelona_Catalonia.html", "text": "The door is very nice. Not worthy to pay any eur inside.\nGarden not attended. Pavillion in ruins. If you pay to enter you feel 100% cheated.\nTake a picture to the door and don't give any eur to them", "publishedDate": "2016-08-21", "language": "en", "rating": 1}, {"id": 395471016, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d1192270-r395471016-Los_Pabellones_de_la_Finca_Guell-Barcelona_Catalonia.html", "text": "This is not worth paying €4 in...I know the maintenance of the site, etc should be taken into consideration but the reason you are there is in plain view before you walk through the gate.  In fairness the lovely gate staff attempted to explain this to us.  There is a short video to watch inside the old stables on the Modernistic period in Barcelona...It's a good way to rest your legs, although very warm inside the building and no fan, only a heater! There is a lovely & well kept green park (Palau de Pedralbes) around the corner from the Dragon gated place...We actually paid in because we thought we were at the other Park!  Take a photo and walk around the back to the other Park which backs on to Diagonal.", "publishedDate": "2016-07-22", "language": "en", "rating": 5}, {"id": 385924682, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d1192270-r385924682-Los_Pabellones_de_la_Finca_Guell-Barcelona_Catalonia.html", "text": "just stopped by to look at the artistic gate. very stunning to see. a lot of people stopped by to snap some photos. see if in area.", "publishedDate": "2016-06-25", "language": "en", "rating": 3}, {"id": 372466810, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d1192270-r372466810-Los_Pabellones_de_la_Finca_Guell-Barcelona_Catalonia.html", "text": "Before buying our tickets, the guy behind the counter explained to us what we were getting into.  He said that there was not much to see here, just two buildings.  It was only 2 euros to get in; so we thought, \"What the heck.\"  The guy was right!  The site is small, and the grounds were not kept--it was like a renter's backyard.  Save your 2 euros and just take a pciture of the gate from the outside.  It's not worth going in unfortunately.", "publishedDate": "2016-05-12", "language": "en", "rating": 1}, {"id": 370354394, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d1192270-r370354394-Los_Pabellones_de_la_Finca_Guell-Barcelona_Catalonia.html", "text": "The gate was nice, but the inside had much to be desired. 4 Euro to enter seemed exorbitant for what you are able to view on the inside. ", "publishedDate": "2016-05-05", "language": "en", "rating": 2}, {"id": 343737807, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d1192270-r343737807-Los_Pabellones_de_la_Finca_Guell-Barcelona_Catalonia.html", "text": "The only interesting thing to see here is the majestic dragon gate and the facade of the buildings on the outside. But I do not recommend going inside. The entrance fee is 4 euros but there's really nothing to see. There's a building that used to be a stable but nothing much has been left from it. And the garden is just plain ordinary.", "publishedDate": "2016-01-30", "language": "en", "rating": 2}, {"id": 342523922, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d1192270-r342523922-Los_Pabellones_de_la_Finca_Guell-Barcelona_Catalonia.html", "text": "The first work of Antoni Gaudi for his main patron, Eusebi Guell, was building of two gatehouses at the entrance of the garden which were intended to be used as the stables and the caretaker’s home. The artist’s innovative approach and symbolism is already visible, especially in the giant mythological iron dragon on the main gate.", "publishedDate": "2016-01-25", "language": "en", "rating": 4}, {"id": 339398443, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d1192270-r339398443-Los_Pabellones_de_la_Finca_Guell-Barcelona_Catalonia.html", "text": "We went to see the iron dragon in its façade but didn’t go inside. I don’t even know what it is exactly. It must be some kind of estate and there’s an admission to get in. We also stopped by la Porta de la Finca Miralles, which is close. Unless you’re staying really close to it or have a lot of time to spare or is a Gaudi aficionado, it is not worth going there. We were staying in the area (about 15 minutes away on foot) and had nine full days on our hands and that was not worth it. This detour was a bit unremarkable and a waste of time, honestly. You can survive without seeing either.", "publishedDate": "2016-01-12", "language": "en", "rating": 2}, {"id": 325571002, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d1192270-r325571002-Los_Pabellones_de_la_Finca_Guell-Barcelona_Catalonia.html", "text": "A big part of my first-ever trip to Barcelona 2 weeks ago, was to soak up as much Gaudi architecture and design as I could.  And being a big fan of wrought iron work, I'd had this remarkable gatehouse on my \"must see\" list.\n\nI can't comment on what is behind the gate -- there is a ticketed admission to go inside (a small park, I think?) -- but all I needed and wanted was some time with the dragon.\n\nThe gate is quite large -- this was the gate house of a large estate for Gaudi's main client, Sr. Guell.  Thankfully, the gate house (gatekeeper's lodge) and the gate itself survived.\n\nThe gate -- well, you can see it for yourself in the photos, features a massive, fantastical, ferocious dragon in wrought iron.  A huge gaping mouth with fangs and a tongue... a long skinny body, with massive claws and wings.  Absolutely astonishing art from the blacksmith's hammer and forge.  \n\nAs I said, I didn't buy a ticket to go beyond the gate (to see whatever there was there) -- but nothing inside could remotely compare to the free view outside ;)  And going just to view the gate is totally FREE!", "publishedDate": "2015-11-09", "language": "en", "rating": 4}, {"id": 308930525, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d1192270-r308930525-Los_Pabellones_de_la_Finca_Guell-Barcelona_Catalonia.html", "text": "I stopped by only because this was near my hotel. It is quite pleasant to sit on the benches and take in Gaudi's art. However, that is all there is to do here. ", "publishedDate": "2015-09-10", "language": "en", "rating": 3}, {"id": 306613513, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d1192270-r306613513-Los_Pabellones_de_la_Finca_Guell-Barcelona_Catalonia.html", "text": "The magic word of \"Gaudi\" made me buy entry ticket of 4€. Totally unacceptable price. I recommend you check your guide book what to expect to avoid possible big disappointment. ", "publishedDate": "2015-09-03", "language": "en", "rating": 1}, {"id": 302546637, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d1192270-r302546637-Los_Pabellones_de_la_Finca_Guell-Barcelona_Catalonia.html", "text": "We hop of here from the tourist bus here. It was close, but we admire the exterior. The gate is very interesting", "publishedDate": "2015-08-23", "language": "en", "rating": 4}, {"id": 295117837, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d1192270-r295117837-Los_Pabellones_de_la_Finca_Guell-Barcelona_Catalonia.html", "text": "This house has the most amazing gate, and that's all you can see really because the property is private, or at least that was what i understood. If it's worth walking there to see this amazing gate? Probably not, i wouldn't do it. But if you take a sightseeing bus (can't remember which line exactly) you can see it along with another monuments. The commentary mentions it and the gate is very impressive to be fair. A nice exemple of Gaudi's work.", "publishedDate": "2015-08-02", "language": "en", "rating": 4}, {"id": 268508416, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d1192270-r268508416-Los_Pabellones_de_la_Finca_Guell-Barcelona_Catalonia.html", "text": "After a long hunt for the peculiar work of Gaudi in the city of Barcelona, we would like to see another masterpiece of Gaudi, the DRAGON door. We have seen the picture from a review and hope to see it with our own eyes. So we start the search by Metro Metro to Diagonal station and track for the place from Google map. The place is on Pedrabels road but the Diagonal station is a bit far beyond the entrance of the road, so we entered the wrong road and wandered around hopelessly. Someone there knew the place, someone didn't! So we have to show everyone who was likely to know this place. It took us an hour to find it with exhaution. Finally we found the DRAGON! He opened his mouth very very wide with scary sharp teeth almost devoured us all. This Gaudi' s masterpiece could express the feeling of the DRAGON as alive! Have to see it yourself! It' s on the fence door of Finca Guell, a small house of Gaudi's friend, I think. On the way back, it took only 5 minutes to reach the Diagonal station when we crosses the highway Diagonal street, walk further to the west (direction to the big hospital) at see the M sign. So the next day we come back again with confidence, off the metro at Diagonal station, walked to east ( direction away from the big hospital) then found a five-star hotel (big tall building) and then cross the Diagonal street. Walk right into the Pedrables road, about 500 metres, the Finca Guell is on the left side of the road. And if you would like to shake hand with Gaudi, just turn right from Finca Guell and walked about 1 km, you could see him there, his statue! Good luck!", "publishedDate": "2015-04-28", "language": "en", "rating": 4}, {"id": 248247931, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d1192270-r248247931-Los_Pabellones_de_la_Finca_Guell-Barcelona_Catalonia.html", "text": "That s all you can see as it is a private property. However it is another extraordinary piece of work by Gaudi.", "publishedDate": "2015-01-08", "language": "en", "rating": 3}, {"id": 215387631, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d1192270-r215387631-Los_Pabellones_de_la_Finca_Guell-Barcelona_Catalonia.html", "text": "Long trip from our Hotel (Jazz) by Metro line L3 and then some walking and with the help of Google maps we finally found the site only to be told by 2 surly guides (?) that the english tour was suppose to start 3 min ago and since there were no people there they had locked the gate and if we wanted to see the site we could wait until 1230. This is in a residential area where it is apparent that people are not wanted by the other residents. If they want people to pay for access they need to do work on their presentation and they need to improve their information flow to the customer. From the outside it looks like a Gaudi   site and the gate is amazing, but based on the limited access and the amount of time and trouble finding and getting there most tourist will probably not bother. It does appear that they are doing some work as there are nets and tarps over parts of the structure. Not able to comment on anything except what can be seen from the road as 3 min late meant they did not have to bother giving a tour. Would only recommend id some one was a ardent Gaudi fan otherwise spend your time in Barcelona at many other worthwhile sites.", "publishedDate": "2014-07-14", "language": "en", "rating": 3}, {"id": 210627476, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d1192270-r210627476-Los_Pabellones_de_la_Finca_Guell-Barcelona_Catalonia.html", "text": "Unfortunately when I arrived the gates were closed, and I was not sure whether the site is closed for the day or at all.  Basically I was clueless and wished that I did my research in advance on this particular site.  Also, having read about the site made my experience more meaningful (unfortunately also after the experience itself).  However, I was able to enjoy what I could see and build my appreciation for the artist.", "publishedDate": "2014-06-16", "language": "en", "rating": 4}, {"id": 210081264, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d1192270-r210081264-Los_Pabellones_de_la_Finca_Guell-Barcelona_Catalonia.html", "text": "The walk to find the dragon is very nice - beautiful street with lots of families, joggers and the like. Not far from Maria Cristina metro station. It won't take you long (I went when the park was closed, so only saw the gate) but it will be a nice break from the hustle and bustle of the Old City.", "publishedDate": "2014-06-12", "language": "en", "rating": 4}, {"id": 167891626, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d1192270-r167891626-Los_Pabellones_de_la_Finca_Guell-Barcelona_Catalonia.html", "text": "Walking around Guell park is simply awesome. Is another piece of art from Gaudí, and captures most of his bigger dreams as an artist. Houses, plazas and sculptures are impressive, and the ambiance and atmosphere that surround you will south your sooth.", "publishedDate": "2013-07-17", "language": "en", "rating": 5}, {"id": 158168696, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d1192270-r158168696-Los_Pabellones_de_la_Finca_Guell-Barcelona_Catalonia.html", "text": "We passed by this \"Gaudi gate\" en route from Parc Guell to Eixample. The Bus Turistic we took didnt have a stop nearby. So couldnt check it out in detail.", "publishedDate": "2013-04-18", "language": "en", "rating": 3}, {"id": 156508274, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d1192270-r156508274-Los_Pabellones_de_la_Finca_Guell-Barcelona_Catalonia.html", "text": "Even more of Gaudi at his best in his use of all types of materials and application to reflect nature and its form and function. This is a monumental undertaking, revealing more of the complexities and genius of Gaudi.", "publishedDate": "2013-04-03", "language": "en", "rating": 5}, {"id": 144680662, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d1192270-r144680662-Los_Pabellones_de_la_Finca_Guell-Barcelona_Catalonia.html", "text": "It s a bit fgar away, not worth going justfor that, but if you have a car go and view the fantasic gates by Gaudi.", "publishedDate": "2012-11-05", "language": "en", "rating": 4}, {"id": 124212627, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d1192270-r124212627-Los_Pabellones_de_la_Finca_Guell-Barcelona_Catalonia.html", "text": "Most visitors to Barcelona see the major Gaudi sites:  Sagrada Famillia, Casa Botilo and Mila, Parc Guell.     If they have time catch the metro or a tram out to an early Gaudi.   Two small buildings seen from the outside. guided tours on weekends only, where you can see how the very young Gaudi started his career. \nThe highlight is of course the Dragon Gate.  A superb example of Art Nouveau design.  Just spend a few minutes tracing the ironwork, spot the little extras, marvel at the skill.\nThe visit only takes a few minutes...take a walk in the Pedrables park. and catch the tram/metro back to the centre.", "publishedDate": "2012-02-06", "language": "en", "rating": 4}, {"id": 73944622, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d1192270-r73944622-Los_Pabellones_de_la_Finca_Guell-Barcelona_Catalonia.html", "text": "This is a minor Gaudi attraction which most people miss, although the tourist bus does pass by.  We are glad that we made the effort to see this masterpiece of metal sculpture. We were able to spend as much as time as we wanted, inspecting the fabulous dragon (wings, teeth, claws, scales and all), the intricate metalwork and the beautiful wall and gate. I would have liked to see the medicine garden inside but alas, it was closed for Sant Joan.", "publishedDate": "2010-08-05", "language": "en", "rating": 4}, {"id": 71665329, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d1192270-r71665329-Los_Pabellones_de_la_Finca_Guell-Barcelona_Catalonia.html", "text": "Our son made a point of visiting every single Gaudi work available in Barcelona, so we went to see Finca Guell, also known as Pavellons Guell. You can only get inside the walls on scheduled times, for the guided tours. Otherwise it´s closed. The guide gave us some very interesting information about the site, but once you get past the (amazing) dragon gate, there´s nothing but an empty property inside. Even the fountain that used to be here is now located inside the grounds of Palacio Real, which you can easily reach by foot from Finca Guell.\n\nSo yes, the gate and walls are very nice, but you can enjoy them from outside. Don´t bother to get inside because there´s nothing else to see. The only buildings are the old guard houses on both sides of the gates, and a room with arches that is empty now. The guide told us the place is now waiting for restoration work to start. It´s university property, and they´re going to use this as gateway for special events on university campus.", "publishedDate": "2010-07-20", "language": "en", "rating": 3}]}}]