[{"locationId": 8422039, "name": "Real Santuario San Jose de la Montana", "placeType": "ATTRACTION", "reviewListPage": {"reviews": [{"id": 688570258, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d8422039-r688570258-Real_Santuario_San_Jose_de_la_Montana-Barcelona_Catalonia.html", "text": "One of the famous attraction in Barcelona is Park Guell (one of the famous architecture of Guadi) that you don't miss, and also don't miss this Real Santuario San Jose de la Montana because this place is near and good to see, great to know. ", "publishedDate": "2019-07-10", "language": "en", "rating": 4}, {"id": 626978737, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d8422039-r626978737-Real_Santuario_San_Jose_de_la_Montana-Barcelona_Catalonia.html", "text": "A large convent with small public area. So as a tourist attraction average but undoubted good works and a place to pray.", "publishedDate": "2018-10-21", "language": "en", "rating": 3}, {"id": 609121918, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d8422039-r609121918-Real_Santuario_San_Jose_de_la_Montana-Barcelona_Catalonia.html", "text": "I chanced upon this building as I was climbing up the steps to Park Guell. I loved its facade, stunning and elegant in architecture. I didn’t go inside this convent but stopped for a short while to enjoy its beauty and take some photos.", "publishedDate": "2018-08-22", "language": "en", "rating": 4}, {"id": 555694024, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d8422039-r555694024-Real_Santuario_San_Jose_de_la_Montana-Barcelona_Catalonia.html", "text": "Nice attraction on the way to prk guell. I was mesmerized with the fact that this building is constructed with stones from same mountain!! Wow!", "publishedDate": "2018-01-22", "language": "en", "rating": 5}, {"id": 540233656, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d8422039-r540233656-Real_Santuario_San_Jose_de_la_Montana-Barcelona_Catalonia.html", "text": "We passed by on our way to Park Guell and spotted this. We didn't fully go inside but walked around the grounds and took in the building. It's a nice unexpected 5 minute break on the way to and from Park Guell.", "publishedDate": "2017-11-11", "language": "en", "rating": 3}, {"id": 434153542, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d8422039-r434153542-Real_Santuario_San_Jose_de_la_Montana-Barcelona_Catalonia.html", "text": "As we were walking up to Park Guel I poked my head into this beautiful sanctuary I said to my family on the way down I want to go back in. Something was calling me to come into it. So after Park Guel we walk in and realize that this church was for saint Joseph and Jesus. At this particular part of my life this was very needed to have a church dedicated to Joseph and his son as my dad had cancer. There was a beautiful statue of Joseph holding Jesus. We walked into the chapel and I stopped and said a prayer for my dad. We walked into the gift shop and I was about to buy a small wearable prayer card. I asked the nun if she could say a prayer for my dad and bless it and she did. Then she gave it to me for free. It brought me to tears. My dad ended up wearing it every day and was cremated with it. It was a shinning light in a dark time and I personally think the nuns prayer helped carry him a little longer. God Bless This Place!", "publishedDate": "2016-11-02", "language": "en", "rating": 5}, {"id": 368778537, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d8422039-r368778537-Real_Santuario_San_Jose_de_la_Montana-Barcelona_Catalonia.html", "text": "We were coming down the steps from Park Guell on our way to the Metro station when we saw a number of the people ahead of us turning off the path into the courtyard in front of this impressive looking building. It really is something to see. As far as we could tell it was not open to the public because if it is as impressive on the inside as it is on the outside then it must be something to see. Given all the walking that we had just done in Park Guell it was nice to sit down and have a rest in such pleasant surroundings.", "publishedDate": "2016-04-29", "language": "en", "rating": 5}, {"id": 330500786, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d8422039-r330500786-Real_Santuario_San_Jose_de_la_Montana-Barcelona_Catalonia.html", "text": "On the way to Guell Park we stumbled upon this building. Unfortunately it was not open saw we didn't get to see the interior. The outside patterning of the stone is striking and gorgeous. It is like someone put animal print onto the stone. Clever design it is simple but so effective.", "publishedDate": "2015-12-03", "language": "en", "rating": 5}]}}]