[{"locationId": 4609101, "name": "Torre Bellesguard", "placeType": "ATTRACTION", "reviewListPage": {"reviews": [{"id": 732307683, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d4609101-r732307683-Torre_Bellesguard-Barcelona_Catalonia.html", "text": "Exceptional hidden gem of the modernism in Barcelona. Really worth a visit which is well explained with the audioguide. Incredible architecture by Gaudi and not really touristic place. Exceptional view from the top of it. Really worth a visit.", "publishedDate": "2019-12-12", "language": "en", "rating": 5}, {"id": 714159269, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d4609101-r714159269-Torre_Bellesguard-Barcelona_Catalonia.html", "text": "Bellesguard, also known as Casa Figueres, is a modernist manor house designed by Gaudí, which was constructed between 1900 and 1909.  It is located at the Sarrià-Sant Gervasi district of Barcelona. Gaudí's  inspired the medieval castle that once stood on the same site. This Gaudi house is much less busy with tourists than any of the others we visited probably due to it's location a bit further away .  It is easy to reach here by bus. The only way to visit the castle is to join the guided tour.  Tickets were cheap . If you are  Gaudi fan you should not miss this one.  Any fan of Gaudi will enjoy this place. The view from the roof is one of the best in Barcelona. Definitely recommended.", "publishedDate": "2019-09-30", "language": "en", "rating": 5}, {"id": 699832702, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d4609101-r699832702-Torre_Bellesguard-Barcelona_Catalonia.html", "text": "Visited Torre Bellesguard alongside the nearby Parc del Laberint d’Horta. Really interesting audio guide rich with information and beautiful and unique house with a rich history...very surprised to hear it was once used as a Obstetric and Gynaecology hospital so many residents of Barcelona were born there! Both the exterior and interior of the house were full of Catalan and religious symbolism and quirky archeological features to fit Gaudi’s vision...would highly recommend for any Gaudi enthusiast! ", "publishedDate": "2019-08-16", "language": "en", "rating": 5}, {"id": 688916923, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d4609101-r688916923-Torre_Bellesguard-Barcelona_Catalonia.html", "text": "We were travelling with the family and they are fans of Gaudi!\nThey wanted to see most of his masterpieces and Bellesguard was one of them!\nLocated in the very chill place and not so crowded.\nYou can buy tickets in advance or in place. You wont stay in queue.\n", "publishedDate": "2019-07-12", "language": "en", "rating": 5}, {"id": 686884434, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d4609101-r686884434-Torre_Bellesguard-Barcelona_Catalonia.html", "text": "We found out from the internet about this castle and decided to come and visit it. It is small but doesn't lack beauty or symbols. It's from Gaudi's islamic period. It is located in a very quiet and green area of Barcelona. From the towers you can have panoramic views. The top of the castel resembles a dragon with eyes and nostrils. The visit has audioguides which document a lot of its secrets and symbols. Worth paying a visit.", "publishedDate": "2019-07-04", "language": "en", "rating": 5}, {"id": 686532963, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d4609101-r686532963-Torre_Bellesguard-Barcelona_Catalonia.html", "text": "If oyu like  church and like catholic history, it is interesting.  Otherwise there are other churches to visit.", "publishedDate": "2019-07-03", "language": "en", "rating": 3}, {"id": 678323465, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d4609101-r678323465-Torre_Bellesguard-Barcelona_Catalonia.html", "text": "We unfortunately missed our guided tour, but the audioguide is quite comprehensive. This is a gorgeous property and has some different elements than some of Gaudi´s other works. I enjoyed seeing how he revived elements of a 1409 wall and tied the home into that style. The house is serious and dark on the exterior, but the interior is full of light and curves.", "publishedDate": "2019-06-02", "language": "en", "rating": 5}, {"id": 677557743, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d4609101-r677557743-Torre_Bellesguard-Barcelona_Catalonia.html", "text": "Barca is full of great Gaudi places to see and you should add this to your list if you're into him and his unique work\n\ngreat to see where it all started", "publishedDate": "2019-05-30", "language": "en", "rating": 4}, {"id": 674461864, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d4609101-r674461864-Torre_Bellesguard-Barcelona_Catalonia.html", "text": "As we were staying in the Tres Torres district this was recommended on Trip Advisor and we were so glad we made the effort to see this little gem.  Amazing architecture and the stonework was fantastic. Don’t miss this just because it’s not on the usual bus routes. ", "publishedDate": "2019-05-16", "language": "en", "rating": 5}, {"id": 673134259, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d4609101-r673134259-Torre_Bellesguard-Barcelona_Catalonia.html", "text": "This is not one of the sites that are being visited because it is a little far away, but in my opinion it is one of the most beautiful and important. We ordered a guided tour and received a rich dose of beauty, useful architecture at its best and a wonderful historical review of the region and the roots of the conflict between Catalonia and Spain.\nHighly recommended", "publishedDate": "2019-05-10", "language": "en", "rating": 5}, {"id": 672415565, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d4609101-r672415565-Torre_Bellesguard-Barcelona_Catalonia.html", "text": "Many times we've tried to access the property but it was unavailable due to not being restored. When this facility finally was restored and opened to public we didn't think of missing it. Of course, this is a medieval restoration made by the genious, which has some unfinished parts, as the Music room. This is also an advantage for understanding how Gaudi conceived and built some of his work, Our guide was very knowleadgeble of the property's history and knew a lot about Gaudi's life. A must for Gaudi's admirers.", "publishedDate": "2019-05-07", "language": "en", "rating": 5}, {"id": 661729560, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d4609101-r661729560-Torre_Bellesguard-Barcelona_Catalonia.html", "text": "We visited Bellesguard (Beautiful View) the day after Sagrada Familia so the contrast was amazing. From outside the place is typically Gaudi but with straight lines. The surroundings and the area in general justify the visit although quite a taxi ride (and a 10 minute walk down the hill to find a return ride). The tour inside was well organised and our tour guide was lovely but you only get to see a staircase and the music room! It is a very long, winding staircase, narrowing all the way through many floors and eventually arriving on a platform and it is an amazing music room showing off the brick arch and flying buttress construction perfectly. Because it only opened this year this attraction is not bringing in throngs of people so enjoy it while you can although I hope they have more to see inside!", "publishedDate": "2019-03-27", "language": "en", "rating": 4}, {"id": 661670201, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d4609101-r661670201-Torre_Bellesguard-Barcelona_Catalonia.html", "text": "This is a lovely little building with some really beautiful details. The unfinished room in the upper part of the tower is lovely and the view from the top is spectacular. It’s not crowded at all, and not that difficult to get to if you have a travel card. We did the audio guided tour and felt it was money well spent. ", "publishedDate": "2019-03-27", "language": "en", "rating": 5}, {"id": 650393702, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d4609101-r650393702-Torre_Bellesguard-Barcelona_Catalonia.html", "text": "The Torre is up near the hills overlooking Barcelona. It's not one of the more recognized Gaudi buildings which helps make the visit more intimate. Gaudi wanted to respect the history of the castle that occupied this spot so he tempered his normal non-linear designs. While the building is more regular in shape, it still has many of the recognizable Gaudi features. Even a dragon on the roof. The grounds are also nice. The price is great and includes a guided tour which I highly recommend.", "publishedDate": "2019-02-05", "language": "en", "rating": 5}, {"id": 642072850, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d4609101-r642072850-Torre_Bellesguard-Barcelona_Catalonia.html", "text": "I couldn't afford the entry fee so had to be content with getting some photos just from the outside. You can only see the roofline from the roadside as the area is surrounded by very high walls. However, if you go next door to the college you can get some decent photos from the car park as the rear does not have such high walls. Not worth the trip far out of town unless you're paying to go in.", "publishedDate": "2018-12-28", "language": "en", "rating": 3}, {"id": 632071569, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d4609101-r632071569-Torre_Bellesguard-Barcelona_Catalonia.html", "text": "So different from his other works due to the fact that this was basically a remodel job.  Such a creative was to revamp a long-held family castle.  The tour is via audioguide and you'd do fine skipping the audio.  The house is wonderful, esp the views from the roof.", "publishedDate": "2018-11-08", "language": "en", "rating": 4}, {"id": 630747717, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d4609101-r630747717-Torre_Bellesguard-Barcelona_Catalonia.html", "text": "This, still, private house is one of the less known Gaudi's work. \nBellesguard Tower is next to Caixa Forum and the guided tour is worthy!\nWe went with 5 kids from 1,5 to 14 years old and all of them enjoyed the experience. The gardens invited them to play, the mosaics and forms played with their imagination and the views from the tower took \"OUR\" breath away. \nThis visit,  though,  is not stroller and/or pets \"friendly\".\nThe tour took 1 hour approximately and we did made previous reservation for a group.", "publishedDate": "2018-11-04", "language": "en", "rating": 5}, {"id": 623797220, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d4609101-r623797220-Torre_Bellesguard-Barcelona_Catalonia.html", "text": "With some extra time during our visit in BCN, decided to take in some of the lesser visited Gaudi sights. This was very nice. Gaudi's genius on full display here without the crowds fo people. Loved the audio guide provided with admission price.\n CLOSES EARLY 3PM! Keep that in mind.\nWell worth the time and bus ride to get here. Beautiful area to explore after the visit.", "publishedDate": "2018-10-10", "language": "en", "rating": 5}, {"id": 623012972, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d4609101-r623012972-Torre_Bellesguard-Barcelona_Catalonia.html", "text": "After visiting the Gaudi museum next to the cathedral we added Bellesguard to our list of stops and we were so glad we did. It was well worth the visit. It wasn’t nearly as busy as some other Gaudi attractions but still allows you to experience his unique style. An audio guide is included in your admission as is your entrance to the house itself, making it a steal compared to Casa Batllo or Mila. ", "publishedDate": "2018-10-07", "language": "en", "rating": 5}, {"id": 622610263, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d4609101-r622610263-Torre_Bellesguard-Barcelona_Catalonia.html", "text": "Although not as well-known as other works by the Catalan architect Antoni Gaudí, Torre Bellesguard still deserves a visit as it is markedly different from mist of his other works: being inspired by a medieval castle, Bellesguard is characterised by straight lines rather than curves ... Yet it is unmistakably a building by Gaudí right down to numerous trencadís mosaics, the four-armed cross and the dragon ...", "publishedDate": "2018-10-06", "language": "en", "rating": 5}, {"id": 621697635, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d4609101-r621697635-Torre_Bellesguard-Barcelona_Catalonia.html", "text": "One of the great things about this tourist destination is that its slightly off the beaten track, being set in the leafy suburb that extends up the hill from Placa Bonanova.  That means you can enjoy it at your own pace and soak in the serenity and enjoy the views.  There are plenty of Gaudi features and details to enjoy. \n\nThe audio tour is worth taking as the access to the house is timed. Another feature that makes this a very intimate tour.  The tour lasts about 30 minutes. The little balcony in the hall was one of the many features that appealed to me and the ornate Venus window.  It is difficult to say top floor in a building that is conceived as a castle, but the room has a vaulted ceiling which is very pleasing.  One imagines it would be a fabulous venue for chamber music but fire regs. would preclude this! \n\nThere is refreshment/ a cafe on the premises; but I am not sure what hours this is operational.  \n\nWe were a party of 4 and I would suggest it is better suited to teens and above.  The upper reaches of the torre are also quite hard for the more elderly or the less agile.  \nOverall, well worth a visit and do check out the wrought iron maltese cross almost hidden in the trees and the viaduct on the otherside of the road.  \n\nYou should allow about 60 - 90 minutes.", "publishedDate": "2018-10-03", "language": "en", "rating": 4}, {"id": 614932178, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d4609101-r614932178-Torre_Bellesguard-Barcelona_Catalonia.html", "text": "Could be the boring audio guide fault or the rainy hour, but it was more or less boring.\nHe was still developing his style and ideas.. and from this stand point, it could be interesting.", "publishedDate": "2018-09-08", "language": "en", "rating": 3}, {"id": 610384904, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d4609101-r610384904-Torre_Bellesguard-Barcelona_Catalonia.html", "text": "We were quite surprised with how beautiful and quiet the Bellesguard was. The visit included great insights into the castle and good explanations of each key symbol. The castle provides spectacular views of Barcelona.\nThere aren’t many other visitors, so it’s easy to navigate the venue and enjoy the visit.", "publishedDate": "2018-08-25", "language": "en", "rating": 5}, {"id": 608356659, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d4609101-r608356659-Torre_Bellesguard-Barcelona_Catalonia.html", "text": "This house is not easy to get to - but the effort is well worth it!     You get a chance to see different facets of Gaudi's genius on a small and intimate scale.     The house is undeniably Gaudi - gravity defying structures,  craftsmanships,  sensitivity to context.\n\nWe were shown around by the extremely knowledgable and engaging Jordi.  The only off-putting thing is that I assumed that Jordi was a gardener - not a guide.  So maybe time to refresh the t-shirts???", "publishedDate": "2018-08-20", "language": "en", "rating": 5}, {"id": 595780170, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d4609101-r595780170-Torre_Bellesguard-Barcelona_Catalonia.html", "text": "Lovely castle by gaudi with nice views of the city.  Small fee but worth a visit.  Tour takes approximately 1 hour. ", "publishedDate": "2018-07-13", "language": "en", "rating": 4}, {"id": 590089760, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d4609101-r590089760-Torre_Bellesguard-Barcelona_Catalonia.html", "text": "If you are interested in Gaudi then this building is a must. A lot of it is so opposite from his more famous buildings as his brief was to recreate a medieval castle and Gaudi abhors straight lines. ", "publishedDate": "2018-06-23", "language": "en", "rating": 5}, {"id": 580693503, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d4609101-r580693503-Torre_Bellesguard-Barcelona_Catalonia.html", "text": "What a great spot. The house is beautiful. The woman who led us on our tour was pleasant and helpful. As other reviewers have said, you will pretty much have the place to yourselves. We toured the house with one other couple. Getting to the house is easy via metro. Go and enjoy.", "publishedDate": "2018-05-16", "language": "en", "rating": 4}, {"id": 578654702, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d4609101-r578654702-Torre_Bellesguard-Barcelona_Catalonia.html", "text": "Amazing place to experience art and culture in an interactive way. Beautiful design and art throughout with outdoor fun.", "publishedDate": "2018-05-07", "language": "en", "rating": 5}, {"id": 569984598, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d4609101-r569984598-Torre_Bellesguard-Barcelona_Catalonia.html", "text": "This is one of Gaudís more interesting pieces, well worth jumping on the bus to get to, and you won't be mobbed. Good audio and great guides", "publishedDate": "2018-03-31", "language": "en", "rating": 5}, {"id": 565693689, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d4609101-r565693689-Torre_Bellesguard-Barcelona_Catalonia.html", "text": "According to information, Torre Bellesguard Gaudi was not open to the public until 2013.  (In my past visits to Barcelona prior to 2013, I could read from guidebooks that it was there but not open to the public and also not easy to access).  So my visit this time to Barcelona included Bellesguard, among other Gaudi's earlier works.\nI went on a Friday morning (no guided tours on weekdays).  There was no one else but me visiting the place (there were only a few people coming at the end of my visit).  An audio guide was included in the ticket.  While you can wonder around freely in the garden, you can only enter the castle like building at a fixed time when a staff comes and opens the door. He will accompany you all the way (I think to ensure people do not run around at random, as the place is still in private hands, and do any damage to the building), and show you the places (including the roof) that you can enter.  He does not do the explanation (the audio guide does). You can see Gaudi had applied/experimented many of his ideas/techniques here (e.g. trencadi works, elaborate ironwork, a soaring Catalan cross).  The interior stairway was beautifully decorated with lovely tiles on the wall, and a beautiful lamp.  The brickworks on the top level are exquisite.  The roof can be accessed via narrow steps (having a group up there would definitely be very crowded) and the pathways on the roof are very narrow. There are good views of Barcelona from up there. Gaudi had designed the windows on the roof to make them look like the eyes of a dragon.  How ingenious! On the day of my visit, a cold front had passed through the day before so it was cloudy, very cold and windy.  But the visit was very worthwhile all the same.  A must for anyone who is  interested in Gaudi's whole body of work.", "publishedDate": "2018-03-10", "language": "en", "rating": 5}, {"id": 543791843, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d4609101-r543791843-Torre_Bellesguard-Barcelona_Catalonia.html", "text": "We were on our way to Tibidabo and were looking to visit somewhere we had not been before, this came up in a search and WOW was it worth the time to stop in.\nIt is a living castle designed by Gaudi, certainly off the tourist stops, we had the place to ourselves for most of our visit including a private tour inside and up to the roof, what an amazing view.\nThis is a new must visit, it has only been open 4 years, so I am sure the secret will get out how good it is and the crowds will come, so go soon.", "publishedDate": "2017-11-28", "language": "en", "rating": 5}, {"id": 533724950, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d4609101-r533724950-Torre_Bellesguard-Barcelona_Catalonia.html", "text": "After visiting Park Guell and before heading back downtown Barcelona, we recommend making a stop at Torre Bellasguard (we took the bus from Park Guell to this attraction).   You will be able to get an audio guide to tour the surrounding garden and a guide will accompany you for your visit inside of the Tower (but you will still have to use the audio guide…).   They offer “real guided tour” but they are only offered at specific times on certain days.\nGaudi was the architect for this structure and you will get to admire his work in a very beautiful setting.  The tour can be done in less than an hour and is quite interesting. Less crowded than the other Gaudi’s attractions and the view is beautiful from the top of the tower (unfortunately it was pouring rain for us once we were on the rooftop…)\nAgain, it is perfect to combine Torre Bellasguard with Park Guell to fill-up an entire morning of touring.", "publishedDate": "2017-10-17", "language": "en", "rating": 4}, {"id": 532877033, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d4609101-r532877033-Torre_Bellesguard-Barcelona_Catalonia.html", "text": "What can I say?  It’s definitely worth a visit.  I am a convert to Gaudí and it was very interesting to see something different. Our guide, Jordi, was very interesting and informative and when some (very apologetic) Americans arrived a bit late for the guided tour, he took the trouble to summarise what they had missed.\n\nAs usual, before I wrote my own review, I had a look at the negative reviews for this site and I cannot recognise anything I saw there in my own experience, Our tour was very comprehensive and took an hour so it was well worth the money over and above the audio-guided tour.  I was very glad I checked on the internet and arrived on a day when they were running a guided tour in English (11:00 Sat/Sun).\n\nYes, it is a private house so the areas you can visit are a bit limited but I would say this is reflected in the price you pay.  I was very keen to see something that was a bit different from the usual Gaudí extravaganza and I was not disappointed.\n\nThe only thing that disappointed me about Torre Bellesguard was that so few people were visiting.  It is simply amazing and the views of Barcelona from the roof terrace were to die for!  Also, I absolutely adored Gaudi’s dragon-roof. \n\nCome on Gaudi fans, visit this place in your droves or it will not continue to be opened to the public!", "publishedDate": "2017-10-14", "language": "en", "rating": 5}, {"id": 531847676, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d4609101-r531847676-Torre_Bellesguard-Barcelona_Catalonia.html", "text": "Short but interesting tour with audio guide. Appreciated the details and history. Nice little film presentation at the end...saw it a few times as we were waiting for the rain to subside.", "publishedDate": "2017-10-10", "language": "en", "rating": 4}, {"id": 521968851, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d4609101-r521968851-Torre_Bellesguard-Barcelona_Catalonia.html", "text": "This is a fascinating 'castle-style' house designed by Gaudi but with his style constrained by the owner's requests rather than given free rein as seen in his more famous buildings (reviewed to death elsewhere). As this one is a bit off the beaten track it was almost empty when I visited in the peak summer month of August. The tour I took was with an audio guide which was perfect for my needs (as I sometimes like to sit down during a tour and press pause for a few minutes). To end my review I should say that it is not very easy to find because of its location unless you keep reading....Take the Metro Line 7 (I think) to Av Tibidabo (which is the end of the line). With your back to the exit of the station and your nose pointing to the big road in front of you, head off left along the big road. After about 5 minutes you need to turn right and head up a hill (you'll need to look up the road names on a map but a child of 5 could manage this). It took me about 12 minutes from the station but I had to stop for directions as you can't really see the building until you're at the entrance. Alternatively you could get a bus...at the exit of the station you need to cross the big road and head towards where the tram departs for Mount Tibidabo. The bus stop you need is (approx) the third one up (depending on whether you count the Tram stop as one!) I can't remember the bus number you need but the younger sibling of the 5 year old mentioned above could find out from the Bellesguard website. Stop pursing your lips.....", "publishedDate": "2017-09-06", "language": "en", "rating": 5}, {"id": 497241775, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d4609101-r497241775-Torre_Bellesguard-Barcelona_Catalonia.html", "text": "This was our fourth visit to the City. The Gaudi highlights in the central area have become very expensive although one has to visit them. A few weeks prior to travelling to the city we watched a TV programme on BBC about the main cultural features of Barcelona and learnt about the fairly recently opened Torre Bellesguard. Located well away from the centre it was an absolute Gaudi gem which, apparently, is not visited very much. On a Saturday at 2pm we were the only two escorted on the House tour! Anyone who wants to see a Gaudi masterpiece and is prepared to travel via bus or Metro to this building will rate the experience as well worth while. We could not recommend a visit to a  building in stronger terms and the entry cost is about half of the far better known Gaudi works. Checking the website is recommended and our prediction is that you will be similarly impressed if you chose to visit. A true highlight for us!", "publishedDate": "2017-06-29", "language": "en", "rating": 5}, {"id": 496345696, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d4609101-r496345696-Torre_Bellesguard-Barcelona_Catalonia.html", "text": "We took this tour that included Sagrada Familia and Torre Bellesguard. We enjoy this castle. We also had brunch here as well. We never knew about it and we have been to Barcelona three other times so it was nice to see something that we hadn't before. I would recommend this tour.", "publishedDate": "2017-06-26", "language": "en", "rating": 5}, {"id": 482490200, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d4609101-r482490200-Torre_Bellesguard-Barcelona_Catalonia.html", "text": "Fairly few things get my teenage son to go wow, but this house and garden certainly had that impact. We took a tour in English which was well worth it, smaller crowds and better interactions with the well spoken and entertaining tour guide.  This hidden gem is hidden away in the mountains, but well worth the trip to see Gaudi at work, the style and contrast between the outside and inside the house. The views of both are equally spectacular.  We both really enjoyed our time during our visit.  ", "publishedDate": "2017-05-07", "language": "en", "rating": 5}, {"id": 471463042, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d4609101-r471463042-Torre_Bellesguard-Barcelona_Catalonia.html", "text": "Torre Belleguard is one of the lesser known Gaudi buidlings in Barcelona, but is well worth a visit if only to explore the St Gervasi area of the city.You can walk up from the centre in about 45 minutes at a reasonable pace, but there are buses and the city train, Line 9, wiil take you up to Tibibabi Avenue from where it is a short walk.\nWikipedia has a good backgound article. The audio guide included in the entry price - a bit steep at 9E - gives a historical summary going back to Roman and Medieval times. Not much of the inside is on view, but the brick room is quite something, and the views from the roof top panoramic over the city.\nThere are fixed times for visits which are accompanied, but the guide simply leads the way. all the info is given bythe audio guide.\nIf you don't fancy walking up, you can of course walk back down to Gracia- worth it just to appreciate how this part of the city was formerly the home of wealthy propertied classes. Many of the \"houses\" have been taken over by corporate bodies.\nJust along from the Torre is the Caixa Science Museum.Very popular with young people and school children. It has an excellent restaurant - 13.95 for an eat as much as you like lunch.", "publishedDate": "2017-03-30", "language": "en", "rating": 5}, {"id": 470601448, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d4609101-r470601448-Torre_Bellesguard-Barcelona_Catalonia.html", "text": "Fabulous, so interesting, lovely grounds and view from the top.\nWe learned so much about Gaudi and our guide was amazing.\nThis is a must see.", "publishedDate": "2017-03-27", "language": "en", "rating": 5}, {"id": 461184355, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d4609101-r461184355-Torre_Bellesguard-Barcelona_Catalonia.html", "text": "If you want to see a Gaudi house while avoiding all the crowds, this is the one for you! Price is a bit steep (9 euros) but it makes for a very interesting visit.", "publishedDate": "2017-02-19", "language": "en", "rating": 4}, {"id": 458860625, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d4609101-r458860625-Torre_Bellesguard-Barcelona_Catalonia.html", "text": "Recommended visit if you are in Barcelona, what a great place to enjoy Gaudi. At the time of this review with the audio guide you get the chance to visit the interior of the house right to the roof top. Also do not forget to test the acoustic of the benches placed right in front of the house. 100% recommended", "publishedDate": "2017-02-12", "language": "en", "rating": 5}, {"id": 438827507, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d4609101-r438827507-Torre_Bellesguard-Barcelona_Catalonia.html", "text": "We were booked in for the 11am English speaking tour. The guide was excellent. It was so fascinating we ended up asking so many questions that we over ran the hour by quite a bit so apologies for that! This site has so many stories and such a rich history it takes a while to take it all in! It is easy to see why this site was also a home to the Romans, King's and Iberian tribesmen before Gaudi stamped his mark on it! If you want to experience a quiet setting Gaudi style away from the crowds this is the one, if you don't, then try the cathedral in the city itself.", "publishedDate": "2016-11-20", "language": "en", "rating": 4}, {"id": 430605238, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d4609101-r430605238-Torre_Bellesguard-Barcelona_Catalonia.html", "text": "Make sure to book in advance and get a tour guide.  We did just this on our recent visit...and it was well worth it.  You get a great insight to the history of the grounds, and tremendous insight of the beautiful family that currently lives there and their history!!  We had the pleasure of meeting the family, and it was completely worth it.  The grounds are gorgeous and the house is stunning...I loved every second of this visit...", "publishedDate": "2016-10-22", "language": "en", "rating": 5}, {"id": 421864538, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d4609101-r421864538-Torre_Bellesguard-Barcelona_Catalonia.html", "text": "I got a train north then walked uphill on a Tuesday to take advantage of the 11am English language guided tour ... thought at first I'd be a singleton but at the last minute a fellow Gaudi lover arrived to make it a threesome! Well informed and highly interesting guided visit on a beautiful day with access gained to many parts of this private residence. Highly recommended if you are at all interested in Gaudi or Art Nouveau architecture in general. Top tip ... afterwards walk east to the Caixa technology centre ... based in another Modernista masterpiece.", "publishedDate": "2016-09-24", "language": "en", "rating": 5}, {"id": 420970466, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d4609101-r420970466-Torre_Bellesguard-Barcelona_Catalonia.html", "text": "Went there this month and it was horrible. This is not cultural attraction as such but house where people live in. When we got in we were told that we won't be able to see most of the yard in front because the owners were throwing a party later. then we had to wait for 30 minutes for our guide to come so we can enter the house and see 1 room, staircase and the roof, the whole thing lasted for 10 mins max, we weren't allowed to separate from our \"guide\" and had to leave. Horrible experience and it wasn't worth the money.", "publishedDate": "2016-09-21", "language": "en", "rating": 1}, {"id": 420622244, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d4609101-r420622244-Torre_Bellesguard-Barcelona_Catalonia.html", "text": "Booked  a guided tour in English which gave a great insight into the history and background of this beautiful Gaudi building. Had dinner afterwards at the Science Museum Restaurant - fab.", "publishedDate": "2016-09-20", "language": "en", "rating": 4}, {"id": 415710729, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d4609101-r415710729-Torre_Bellesguard-Barcelona_Catalonia.html", "text": "Torre Bellesguard is not one of the Gaudi buildings grouped together that form the UNESCO WHS listing so people don't have the same motivation to visit or possibly aren't aware of it.\nIt sits up in the affluent residential area of Sant Gervasi and you can't get a metro directly there. I went to Vallcarca and walked (about 20 minutes but it's a nice walk).\nIf you are interested in Gaudi then this building is a must. A lot of it is so opposite from his more famous buildings as his brief was to recreate a medieval castle and Gaudi abhors straight lines. \nHe still manages to squeeze in lots of great architectural features including the famous \"dragon\" on the roof of the tower.\nThe entrance fee in August 2016 was 9 euros and you get a free headset guide that is essential in understanding the house.", "publishedDate": "2016-09-07", "language": "en", "rating": 5}, {"id": 412879745, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d4609101-r412879745-Torre_Bellesguard-Barcelona_Catalonia.html", "text": "Recently opened to the general public, hardly any visitors (we stayed for one hour, and counted 10 visitors...)\n\nThe +/- 30 minute audio tour is interesting, and the panoramic view on the roof top is very nice if you don't mind the steep stairs, but the building is not as big nor as impressive as Casa Battlo or Casa Mila. Still worth the trip if you are a real Gaudi fan.", "publishedDate": "2016-08-30", "language": "en", "rating": 3}, {"id": 396136560, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d4609101-r396136560-Torre_Bellesguard-Barcelona_Catalonia.html", "text": "If you want to see Gaudi in a nutshell - and without the crowds, visit this wonderful private house.  It takes some planning as it is slightly out of town, - we found a bus that went fairly near - or direct train from the centre and a 10 minute walk.  Lovely quirky house and garden - the in-house guide was charming. Audio guide provided for the garden.", "publishedDate": "2016-07-24", "language": "en", "rating": 5}, {"id": 393266070, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d4609101-r393266070-Torre_Bellesguard-Barcelona_Catalonia.html", "text": "This is a great sight to see if you want to see a \"Gaudi\" designed castle (home) that is very unique....Gaudi even used straight lines which is unusual.  It is a bit farther out than the typical tourist areas, but I think that is what makes it worth it.  Very good audioguide with a tour through the castle and the grounds.  \n\nAs a few suggestions, you could plan a portion of a day, here and at Tibidabo as they are fairly close.  I would also suggest using google maps transit to be able to utilize the metro and buses system vs. just the metro, less walking uphill if you wish. ", "publishedDate": "2016-07-16", "language": "en", "rating": 5}, {"id": 383531241, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d4609101-r383531241-Torre_Bellesguard-Barcelona_Catalonia.html", "text": "Bit hard to get to if you're without google maps. We took the metro then the bus (1 euro for the trip if you've got a t-10!). Currently no student discount but normal rate is 9 euros and you get an audio guide so it's reasonable.\nThe audio guide is excellent. The information is actually interesting, the English translation is clearly professional and without error, and none of the clips drag on too long.\nAs for the building and gardens themselves, there are lovely little details and design decisions that make it sparkle. Also interesting to see Gaudi being forced to restrict himself and include historical tributes in his work.\nAt the end there is a stables which have been converted into a screening room where they show you a narrationless video of the building from YouTube. Why? There was no point to this. I'm guessing they'll find something better to show there at some point, perhaps about the stables themselves, which only get a brief mention on the audio tour.\nAll in all I'd say this is a must. Really enjoyable visit and it will only get better with time.", "publishedDate": "2016-06-17", "language": "en", "rating": 5}, {"id": 381669166, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d4609101-r381669166-Torre_Bellesguard-Barcelona_Catalonia.html", "text": "I went to Barcelona for a week to see 9 Gaudi sites.  This one was the gem of the trip (of course, the Sagrada Familia was the prize).  Everything you hope and expect from a Gaudi was here WITH NO CROWD.  No one at the hotel knew about it, the cab driver dropped us off 5 blocks away (thank God for Google Maps).  Aside from blending perfectly with the an ancient tower on the site, it was Nature, Catalan and Catholic.", "publishedDate": "2016-06-11", "language": "en", "rating": 5}, {"id": 343789610, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d4609101-r343789610-Torre_Bellesguard-Barcelona_Catalonia.html", "text": "We went there after checking on the website the timetable because the place is a little far from the centre of Barcelona. After 1h we arrived there and the tower was closed!! I called the specified number but they couldn't provide any explanations. Call before you go!!!", "publishedDate": "2016-01-30", "language": "en", "rating": 1}, {"id": 341145545, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d4609101-r341145545-Torre_Bellesguard-Barcelona_Catalonia.html", "text": "Relatively new addition to the Gaudi’s collection of houses and works that are open to public. This one was built between 1900 and 1909 ant it is still inhabited by the owners. With usual allusions to the past and typical symbolism, Gaudi created this building in a combination of Gothic/Art Nouveau style. Anyway, it is worth the effort of going a bit out of usual paths just to see another masterpiece of the great artist.", "publishedDate": "2016-01-19", "language": "en", "rating": 5}, {"id": 340650399, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d4609101-r340650399-Torre_Bellesguard-Barcelona_Catalonia.html", "text": "Good for the picture and keep going because there are so many more interesting places and structures nearby.", "publishedDate": "2016-01-17", "language": "en", "rating": 3}, {"id": 339453260, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d4609101-r339453260-Torre_Bellesguard-Barcelona_Catalonia.html", "text": "It was a nice silent experience, since here were not lots of tourist like in the other points. I loved the panorama from the tower and I was amazed by the bench from the yard. Just stay in one corner and whisper to the bench. Your partner at the other end will hear clearly.\n\nWe were a group of four persons, a guide who had the key and took us to the top. He just told us which number we should listen, perhaps more personal information will be a better experience.\n\nYour visit here should be on a sunny day, after I check the other comments for this point it will be wise to check if is open before your trip here.\n\nYou will have access only in one room(as I remember), up to the roof by stairs where is a music hall and  after that up to the tower with the panorama. There are a lot of stairs up to the top\n\nI payed 9euro to access with a guide inside\n\nA little bit far from the center, you have to walk (a little climb) 10-20 minutes from Tibidabo metro station (L7), there is also a bus line, check the maps for it.", "publishedDate": "2016-01-12", "language": "en", "rating": 4}, {"id": 326365601, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d4609101-r326365601-Torre_Bellesguard-Barcelona_Catalonia.html", "text": "Recently open for the public, this still is a private house, so the open to the public space is reduced. You will enjoy beautiful views of the city and the Tibidabo and the guides are friendly and well informed. \nWhen passing through the gates it seems like stepping in a fairy tale...", "publishedDate": "2015-11-12", "language": "en", "rating": 5}, {"id": 321447569, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d4609101-r321447569-Torre_Bellesguard-Barcelona_Catalonia.html", "text": "It is quite the trek to get here and a terrible disappointment to learn upon arrival that it was closed for a children's party.  Of course, nothing was on the website about the closure.  Call before you come.", "publishedDate": "2015-10-24", "language": "en", "rating": 1}, {"id": 320620515, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d4609101-r320620515-Torre_Bellesguard-Barcelona_Catalonia.html", "text": "The people on this venue are basically thieves. They stand there as if they're working , but the reality is they're literally stealing people's money. They owe me and a buch of other customers the amount of 100€ , but they're now avoiding our calls, not getting back to our emails and basically having a laugh.\nI strongly recomment NOT to go to this place, is horrible and disrespectful with their customers.", "publishedDate": "2015-10-21", "language": "en", "rating": 1}, {"id": 320280856, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d4609101-r320280856-Torre_Bellesguard-Barcelona_Catalonia.html", "text": "The staff of this beautiful place has no decency or respect for the customer.\nWe have been waiting for a 100 euro refund for over 2 months.\nEvery time we try contacting them for answers (if we get through, as nobody ever seems to want to step forward) we get a defying attitude. ", "publishedDate": "2015-10-19", "language": "en", "rating": 1}, {"id": 313502803, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d4609101-r313502803-Torre_Bellesguard-Barcelona_Catalonia.html", "text": "It is a little out of the way, so very quiet.  There were 3 other people there when we arrived.  We bought our tickets and were given the audio guide to wander around the gardens ourselves for half an hour, and then meet at the front door of the house at 12.00pm for a tour inside.  The audio is interesting and tells us about the garden and the house.  By 12.00 our group had grown to only about 6 or 7, and we were taken inside.  The guide told us which numbers related to which areas in the house, and answered any questions we had.  We had to pass the private part of the house and go up to the attic and then the roof, for some great views.  I think that after all the crush at Gaudi's other buildings, it is such a pleasure to be somewhere quiet and restful where you can take it all in.  Do go if you have the chance.", "publishedDate": "2015-09-25", "language": "en", "rating": 5}, {"id": 309225576, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d4609101-r309225576-Torre_Bellesguard-Barcelona_Catalonia.html", "text": "I have been in Torre Bellesguard in August, when I was visiting Barcelona for a weekend with a friend. We got to attend the wonderful concerts that they organize since this year called \"Nits Gaudí 2015\". We got to listen to authentic Spanish musicians under the magic and lights of Torre Bellesguard and the beautiful view of Barcelona beneath us. I really-really enjoyed the concert, the drinks, the excursion and also the after-concert jam session with light music and drinks. It was one of the most memorable moments of summer 2015 and Barcelona ever. I would definitely recommend you attend one of the concerts or just go and visit Torre Bellesguard when in Barcelona. The spirit of Barcelona lives there! ", "publishedDate": "2015-09-11", "language": "en", "rating": 5}, {"id": 309058198, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d4609101-r309058198-Torre_Bellesguard-Barcelona_Catalonia.html", "text": "Evening concert in the grounds of this beautiful Gaudi building. While there are straight lines in this building, the Gaudi influence of nature and flowing lines can be seen inside. The setting for the music and wine will be remembered as one of our trip highlights.", "publishedDate": "2015-09-10", "language": "en", "rating": 5}, {"id": 305730531, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d4609101-r305730531-Torre_Bellesguard-Barcelona_Catalonia.html", "text": "Bit of a trek to get here, we got the bus from town (Carrer Aribau) and then walked up the hill for about 10 minutes. Well worth the effort! The place was near deserted and we had the guide almost to ourselves. You start by exploring the external parts of the house (designed like an old castle and dedicated to Martin the Humane). Gaudi's religious and patriotic (Catalan) touches are everywhere - in the measurements of the building, the triple balcony representing the Holy Trinity and the Catalan flag draped on the spiral cross/crown, The inside of the building has a few of Gaudi's original pieces left (umbrella stand, coat rack and lantern). \n\nIn the summer they host music nights at the Torre Bellesguard which had a pretty decent line-up. \n\nIf you've seen everything there is to see in town then it's really worth making time for this. The building closes at 3pm so there is little time to wander around afterwards if you take the last tour of the day.", "publishedDate": "2015-09-01", "language": "en", "rating": 5}, {"id": 303188272, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d4609101-r303188272-Torre_Bellesguard-Barcelona_Catalonia.html", "text": "I went to visit the Torre Bellesguard for their summer music sessions called Nits Gaudi. The Bellesguard property is absolutely magical and the flamenco concert really was the icing on the cake for a perfect summer evening. The Bellesguard Tower is truly a hidden gem in Barcelona's Tibidabo hills.", "publishedDate": "2015-08-25", "language": "en", "rating": 5}, {"id": 300376500, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d4609101-r300376500-Torre_Bellesguard-Barcelona_Catalonia.html", "text": "I went visiting this piece of architectural jewelry close to Tibidado and was delighted by a very-well organised tour as a concert held in the garden at the entrance.", "publishedDate": "2015-08-17", "language": "en", "rating": 5}, {"id": 291836741, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d4609101-r291836741-Torre_Bellesguard-Barcelona_Catalonia.html", "text": "To mix with the numerous concerts organized there.\nif feeling the energy, in an hour of walking through trails & roads, you can get to Tibidabo", "publishedDate": "2015-07-23", "language": "en", "rating": 4}, {"id": 286285532, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d4609101-r286285532-Torre_Bellesguard-Barcelona_Catalonia.html", "text": "What an absolute treat and privilege it was to visit Torre Bellesguard, everything about this building is simply stunning.  Also known as Casa Figueres, is was built by Antoni Gaudi between 1900-1909 in a mixture of Art Nouveau and Gothic architecture.  \n\nOn the day we traveled on metro line 7 to Av.Tibidabo and walked our way through the streets and up the hill to arrive at the gates of Torre Bellesguard in about fifteen minutes.  Bellesguard is located well out of the city centre and because of this has very small crowds, a true bonus in a busy city.\n\nWe include a tour into our entry ticket, an audio guide is complimentary.  It is not essentially a guided tour but a tour of the house with an audio guide accompanied with an escort at all times.  The escort will advise what number to press on the audio guide as well as answer any questions.  Only specific rooms are open to the visitor: foyer, stairs, attic and the rooftop which has fabulous views.  The garden is self-guided.  Suggest allowing around one hour for a visit at Torres Bellesguard.", "publishedDate": "2015-07-07", "language": "en", "rating": 5}, {"id": 281378675, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d4609101-r281378675-Torre_Bellesguard-Barcelona_Catalonia.html", "text": "Wonderful building. You have to see the interior, climb up to the roof and tower, enjoy the view over the city. Take into account the time to reach the building and other tourists queuing to get in on a busy day", "publishedDate": "2015-06-19", "language": "en", "rating": 5}, {"id": 278163902, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d4609101-r278163902-Torre_Bellesguard-Barcelona_Catalonia.html", "text": "We took the train to Av. Tibidabo, takes around 30 mins then a short taxi ride to the top of the hill.\n\nWe had pre-booked our full guided tour with the lovely Jordi, and we are so glad that we did, his knowledge and story telling really brought the history to life.  A great credit to the team of Bellesguard.\n\nThe grounds, the house and the gardens are wonderful and the views from the roof literally took my breath away!  \n\nThe house itself is beautiful, from the stained glass windows to the shapes of the ceilings, the benches at the front of the house have a story to tell.  The mosaic benches in the Garden with their hidden secret, all will be revealed when you take a seat!  But you will need to fly high to 'see' their other secret :)\n\nThe roof space is amazing and actually quite cute!  Take plenty of photographs the views are amazing and the architecture of the roof is wonderfully childlike.  \n\nWe had time to view the videos of a recent concert that was held in the attic and the acoustics are perfect.  The 3D photographs are really good.  \n\nThe entrance hall lamp is absolutely stunning, and the wrought iron hat stand on the wall with the dragon is so fitting for the property.\n\nThere are 3 balconies to the front of the property but make time to go around the back of the house to view the balcony at the rear of the house, wonderful shapes.\n\nThis has to be my favourite Gaudi, such a stunning property and thankfully not a selfie stick in sight :)\n\nTake time to wander around after your tour and marvel at the architecture of this fabulous property.  We walked back down through the Sarrià-Sant Gervasi district and there are some really nice properties in the area, it's a lovely area.", "publishedDate": "2015-06-05", "language": "en", "rating": 5}, {"id": 277781137, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d4609101-r277781137-Torre_Bellesguard-Barcelona_Catalonia.html", "text": "Torre Bellesguard (Beatiful view) was built upon the ruins of the 15th-century residence of Martí l'Humà, the last king of the House of Barcelona (1356-1410), by Antoni Gaudí between 1900-1909. You will see there the magic of Gaudí. Seat at the garden bench and you'll experience a \"surprise\". That bench, for instance, is an eye it can only be seen from the air. But, wait, there are more \"surprises\" in that ceramic bench. Make yourself a favor, take the guided tour. If you do not do so, you are going to lose a lot of amazing things. Take into account that there a lot of things there that are yet to be deciphered! Which were the intentions of Antoni Gaudí?", "publishedDate": "2015-06-04", "language": "en", "rating": 5}, {"id": 275933487, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d4609101-r275933487-Torre_Bellesguard-Barcelona_Catalonia.html", "text": "I walked up the hill to this from Park Guell (took about half an hour) but there are probably public transport options. \n\nThere is an audio guide and also a human guide to show you round the house as it is still a private residence.  It is a proper medieval castle that has been art nouveau-ified.  Beautiful mosaics outside and tiling inside.  And the roof is shaped to look like a dragon's head!\n\nI was the ONLY person on the tour and I think that is a great shame as it is well worth a look, and if you like art nouveau you shouldn't miss it!", "publishedDate": "2015-05-31", "language": "en", "rating": 5}, {"id": 250925123, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d4609101-r250925123-Torre_Bellesguard-Barcelona_Catalonia.html", "text": "It took us ages to eventually get there. Best option I think is bus 196 from Avenue Tibidabo. Stay on the bus after the stop for the funicular and the driver will keep you right. The audio guide was very good and then you get a personal guide. Ours was a lovely guy called Jordi who told us everything we needed to know and gave us the full tour of the property including the roof. The building was amazing and the view from the roof was stunning. Definitely worth a visit even if slightly off the tourist trail.", "publishedDate": "2015-01-25", "language": "en", "rating": 5}, {"id": 243310700, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d4609101-r243310700-Torre_Bellesguard-Barcelona_Catalonia.html", "text": "This mansion on the hills overlooking Barcelona is less known than other Gaudi building, but well worth a visit if you are a Gaudi fan. To get here, you have to take the subway + a bus, so plan on at least 30 minutes from Plaza Catalunya. You can also take a cab. This private mansion was built on the site of a former medieval castle defending the city. When it was build 1900 - 1909, the area was just country side outside of town. it is now a fancy suburb for rich people. Bellesguard means \"beautiful view\" which you will verify when you get up into the building. The construction was never quite finished, since the project was so expensive that it ruined the very wealthy owner... The most original feature is the roof (I will not tell you more to keep the surprise).", "publishedDate": "2014-12-07", "language": "en", "rating": 4}, {"id": 242819363, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d4609101-r242819363-Torre_Bellesguard-Barcelona_Catalonia.html", "text": "Well it was the first time that I saw it exiting the Cosmo Caixa. It is very beautiful. Open only from 10 am to 3 PM. It is a private property and some parts cannot be visited.", "publishedDate": "2014-12-03", "language": "en", "rating": 4}, {"id": 241578076, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d4609101-r241578076-Torre_Bellesguard-Barcelona_Catalonia.html", "text": "Catch a 22 bus from Pg de Gracia just beyond Placa Catalunya and it will take you close to Torre Bellesguard. Get off on Av Bonanova and walk up the hill to the right-don't expect signposts, take a map with you. If you don't fancy the 10 minute walk up the hill you can get bus no 123 to take you up there! It's well worth the effort and you get to see some of Barcelona's suburbs on the way. The house is a little oasis of peace, surrounded by gardens. Your very reasonable entrance fee includes the audio guide plus the guide who shows you around the house. It's small scale but fascinating. Having only opened to the public in 2013, it has yet to be included in many tourist guides-go and see it soon before the hoards discover it! A real gem in a city full of gems!  ", "publishedDate": "2014-11-26", "language": "en", "rating": 5}, {"id": 235062794, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d4609101-r235062794-Torre_Bellesguard-Barcelona_Catalonia.html", "text": "Bellesguard, , is a modernist manor house designed by   the very Catalan  Gaudí,  as one of his first works.  It is located at the Sarrià-Sant Gervasi district and it will cost you around 15 Euros to get there by a taxi from the city center . But it worth every sent. the  English guide Fernando, was excellent ( the guidance is included in the cost of the visit) and we have found the visit extremely interesting.\nthe caixa science museum is a short distance from the building.", "publishedDate": "2014-10-18", "language": "en", "rating": 5}, {"id": 234919962, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d4609101-r234919962-Torre_Bellesguard-Barcelona_Catalonia.html", "text": "It is quite a hike up to Bellesguard but well worth the effort when you enter the gates. It is an oasis of tranquility in the city.  A family still lives in part of the house but a guide will show you the parts available to explore.  On the roof, the guide offered a puzzle to solve. I will not reveal the answer but it is mythical. In the summer, concerts and other events take place on the lawn.", "publishedDate": "2014-10-17", "language": "en", "rating": 4}, {"id": 230780303, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d4609101-r230780303-Torre_Bellesguard-Barcelona_Catalonia.html", "text": "We went here at night. The place is beautifully lit and you can enjoy great sights from around. There was a lovely event going on in the grounds.", "publishedDate": "2014-09-24", "language": "en", "rating": 4}, {"id": 229152044, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d4609101-r229152044-Torre_Bellesguard-Barcelona_Catalonia.html", "text": "Have been here for the Nights of Gaudi with the family. The castle is amazingly beautiful with nice garden around. At the entrance we were offered water and cava gratis that was very kind of them. Firstly was an excursion (brief, but meaty). I really loved the idea of flamenco concert in the open air. It was so nice to sit in the garden in front of the castle listening spanish guitar, strong voices of singers and feeling the scents of flowers, flooded in the night air. It was so cozy, beautiful and mistical. \nWe were very happy! Wonderfully organized event!", "publishedDate": "2014-09-16", "language": "en", "rating": 5}, {"id": 229134153, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d4609101-r229134153-Torre_Bellesguard-Barcelona_Catalonia.html", "text": "The ground on which Bellesguard stands on was previously the site of a country residence belonging to Martin I, known as El Humano. He was the King of Aragon and Count of Barcelona. He acquired the land in 1408 and built a castle which he called Bellesguard because it had beautiful views of Barcelona. It is located at the Sarrià-Sant Gervasi district of Barcelona, and halfway up the Collserola mountain. \n\nIn 1893 the Bishop of Astorga Joan Baptista Grau died. He was an intimate friend of Gaudi and Gaudi had built for him the Archbishop’s Palace in Astorga. The Bishop in his will asked that all his properties be sold and the profits put for charitable purposes. Gaudi learned of this and told his close friend Maria Sagues, who was the widow of Jaume Figueres (a flour merchant). She was a longtime admirer of Gaudi and she had wanted him to build a house for her. The property had an area of 12 hectares and contained the ruins of the former castle. In 1900 Maria Sagues bought the land, and asked Gaudi to build her house. The house was finished in 1917 and is also called Casa Figueres. She lived there until the Civil War. The house passed through other owners and was declared a National Monument in 1969.   \n\nGaudi designed a castle that looked like medieval castle of the 15th century. He used the Neogothic style to pay homage to the ancient king. The castle has very symmetrical windows and the shape of the castle is like a cube. The façade is faced with local stones in tones of grey and green. On one side is a tower that is topped with the cross with four arms that is a signature design of Gaudi. Beside the entrance to the castle are two benches with mosaic designs, designed by Domenech Sugranyes. Inside the castle as one goes up the stairs, there is a beautiful stained glass window that shows a star. The attic is a very large room that has not been finished in the interior and it has windows on every side. One can see the exposed bricks that support the roof and the way Gaudi planned it. \n\nThe building was opened to the public in September, 2013. The entrance fees help with the maintenance costs. The guided tour is very good because everything is explained.", "publishedDate": "2014-09-15", "language": "en", "rating": 5}, {"id": 225580522, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d4609101-r225580522-Torre_Bellesguard-Barcelona_Catalonia.html", "text": "Bellesguard \"Beautiful View\" ,also known as Casa Figueres, is a modernist manor house designed by Catalan architect Antoni Gaudí, which was constructed between 1900 and 1909.\nHow to get there: Bus: 60, 123 and 196.\nOpening time:   \n1st April to 31st October: Monday to Saturday, 10am to 7pm. \nClosed Sunday.\n1st November to 31st March: Monday to Saturday, 10am to 3pm. \nSunday and public holidays, closed.\nClosed: 1/1, 6/1, 25/12 and 26/12", "publishedDate": "2014-08-30", "language": "en", "rating": 4}, {"id": 222340738, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d4609101-r222340738-Torre_Bellesguard-Barcelona_Catalonia.html", "text": "Bellesguard is an amazing building built by Gaudí in Barcelona, it's a new must-see of the city and we're pretty sure that will have a huge succes. It's also important to say that Bellesguard is the best place in Barcelona to celebrate private events. Don't miss it!", "publishedDate": "2014-08-17", "language": "en", "rating": 5}, {"id": 222020427, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d4609101-r222020427-Torre_Bellesguard-Barcelona_Catalonia.html", "text": "In summer in Barcelona they run a series of evening jazz concerts here. You're up high enough to get the cooler evening breeze and it was a lovely atmosphere with the building lit up, a great jazz sound and some cheese and wine to go with it. Wonderful evening!", "publishedDate": "2014-08-15", "language": "en", "rating": 4}, {"id": 209005957, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d4609101-r209005957-Torre_Bellesguard-Barcelona_Catalonia.html", "text": "If you're expecting another one of those mind altering kaleidoscopic hallucinogenic architectural Gaudi experiences that leave you feeling like you're not sure what the heck was in whatever the heck the last thing you swallowed was - don't. \nWhat you'll find here is more of a real-life castle out of a Lord Of The Rings movie...\nSo it's a come-down from Mars to Middle Earth for Gaudi here. ", "publishedDate": "2014-06-05", "language": "en", "rating": 3}, {"id": 206740552, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d4609101-r206740552-Torre_Bellesguard-Barcelona_Catalonia.html", "text": "Picturesque and quite place with a long and interesting history near the CosmoCaixa Museum. Far from crowded touristic routs.This place shows a real versatility of Gaudi's tallent", "publishedDate": "2014-05-23", "language": "en", "rating": 5}, {"id": 198921607, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d4609101-r198921607-Torre_Bellesguard-Barcelona_Catalonia.html", "text": "Bellesguard is built on historically significant land and has interesting symbolism that reflects Gaudi's Catalan pride and love of religion and admiration for nature. \nThe house has been recently opened to the public by the family which currently occupies part of the property. Considering that it has yet to develop into a popular tourist attraction as other Gaudi properties, it does allow for a pleasant visit. With the regular admission (7 euro) you get the audio guide and access only to the grounds. However with the live guided tour (16 euro) you have the chance to get inside the house as well as up to the roof where a SURPRISE awaits (I will not spoil it and let you discover this one during your visit).  One interesting fact that the guide told me ( I was the only one there for the tour) that was not on the audio was that the house functioned as an orphanage during the Spanish Civil War and that the nuns burned the original Gaudi designed furniture to stay warm... a great sacrifice which was worth it at the time. Allows you to put this in perspective of what's important depending on the situation and circumstances. \nCHECK OPENING HOURS AND TOUR AVAILABILITY BEFORE YOU VISIT.", "publishedDate": "2014-03-27", "language": "en", "rating": 5}, {"id": 195653993, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d4609101-r195653993-Torre_Bellesguard-Barcelona_Catalonia.html", "text": "I was alone on the Tues morning English tour; arrived early to see viaduct and grounds. Start taking photos because as soon as the light hits the slate on the walls, the colors change. Go early to try and catch the morning rays on the madonna in the water shed/chapel. My guide answered all of my questions. She really feels the spirit and history of the place. The symbolism abounds at this \"castle\", which is in many ways a different Gaudí. It demonstrates his attachment to Catalan history.\nIn the boutique try the 3D glasses to view the photographs. Panoramic views from rooftop; look for the dragon in the architecture.\nGetting to Bellesguard can be tricky if you do not have correct address: Carrer de Bellesguard 16-20. Google maps and TimeOut currently use incorrect addresses and website URL. Correct URL: http://www.bellesguardgaudi.com/ \nGetting there: Travel on L7 from Plaça de Catalunya takes less than 10 minutes to the last stop Tibidabo. An alternative to the train is bus 17 from downtown.\nOnce at Pl. John F. Kennedy, head straight out, to the right and up the hill for bus 196 in the direction of Tibidabo. Stay on the bus until the Ronda de Dalt Bellesguard stop (Universitat Abat Oliba CEU/Campus Bellesguard). Bellesguard Gaudí is behind the university.", "publishedDate": "2014-02-28", "language": "en", "rating": 5}, {"id": 188053289, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d4609101-r188053289-Torre_Bellesguard-Barcelona_Catalonia.html", "text": "One of the primary attractions of Barcelona includes the Torre Bellesguard Castle which was designed by the Catalan architect, Antoni Gaudi. The castle was recently opened to the public and I thoroughly enjoyed my tour. Built over the ruins of Marti I l’Huma’s summer palace, the castle is now partially occupied. The castle is inspired largely by Gothic architecture and you can find a bell arch, towers, gargoyles and crenellated battlements of an exemplary nature. The interiors of the castle are colourful and ornate, but are rarely viewed by tourists. My tour lasted a full two hours and I soaked in as much history as I possibly could, hanging onto every syllable uttered by my dear guide! The Torre Bellesguard adds to the cultural and historical heritage of the elusive Barcelona.", "publishedDate": "2013-12-19", "language": "en", "rating": 4}, {"id": 186847577, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d4609101-r186847577-Torre_Bellesguard-Barcelona_Catalonia.html", "text": "Not overcrowded place, still a private home - carefully preserved and restored, definitely worth a certain ride wjich was not so complicated in reality. We shared a tour with a couple from the UK - so, I was able to provide some translations for our non-English speaking Russian majority (there were 5 of us). A unique combination of medieaval original style with Gaudi fantastic approach brought a rare fruit... And - you can feel yourself inside it, like a guest. Thanks for the privilege!", "publishedDate": "2013-12-05", "language": "en", "rating": 5}, {"id": 182980355, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d4609101-r182980355-Torre_Bellesguard-Barcelona_Catalonia.html", "text": "As a big fan of Barcelona I always enjoy discovering new things whenever I visit. I knew Torre Bellesguard had only been open to the public for a month but I expected it to be crowded with tourists like the more well known Gaudí creations. So I was pleasantly surprised to find I was the only person on the English speaking tour. The young lady who conducted the tour (I'm sorry, I didn't ask your name!) was exceptionally well researched and I was educated on Gaudí, Torre Bellesguard and the history of the area too. Both the building and gardens are beautiful in the way that everything Gaudí created is. The house is partially occupied, how fortunate to reside in a work of art! I feel honoured to have visited Torre Bellesguard in the early days of it's opening to the public and sincerely wish all involved the best of luck with this venture. ", "publishedDate": "2013-10-30", "language": "en", "rating": 5}, {"id": 181122933, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d4609101-r181122933-Torre_Bellesguard-Barcelona_Catalonia.html", "text": "It's been amazing discovering this unknown gaudinian treasure, probably the most recommended attraction in Barcelona. It's worth a visit!", "publishedDate": "2013-10-15", "language": "en", "rating": 5}]}}]