[{"locationId": 10538407, "name": "Fanals", "placeType": "ATTRACTION", "reviewListPage": {"reviews": [{"id": 727198957, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d10538407-r727198957-Fanals-Barcelona_Catalonia.html", "text": "The Barcelona City Council commissioned Antoni Gaudí to design a lamppost. It was one of the first works of the young Antoni Gaudí.In that time after graduating as an architect he collaborated  as a draftsman with Josep Fontserè i Mestre in the entrance gate of the Ciutadella Park. He made the design of two different models of  gas lamps. In the Plaza Reial are located two of them with six arms. Starting from the stone base, we can see a large iron medallion, with floral motifs.   Halfway up we see the Barcelona shield with the four bars and the cross of St. George  and above some small floral ornaments of red color. The arms are placed on different levels, as if they were the branches of a tree, each holding a glass lantern covered with a wrought iron crown. The  crown represents the winged helmet of the Roman god Mercury, with two snakes coiled in the central arm. All the symbology represents the commercial power of the city of Barcelona. They were inaugurated in September 1879. Absolutely beautiful.", "publishedDate": "2019-11-17", "language": "en", "rating": 5}, {"id": 690179483, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d10538407-r690179483-Fanals-Barcelona_Catalonia.html", "text": "The Fanals are lampposts in Placa Reial and not lanterns as the name suggests. The lampposts are designed by Antoni Gaudi, but you wouldn’t know it as it’s not obviously Modernista.\n\nI wouldn’t go out of the way to see these, but okay if you’re in the square.", "publishedDate": "2019-07-16", "language": "en", "rating": 3}, {"id": 676331631, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d10538407-r676331631-Fanals-Barcelona_Catalonia.html", "text": "These fanals are absolutely stunning, functional artworks! They are by that great genius, Gaudi, and they are found not only in Plaza Real , but elsewhere as well. There also different types. They are masterpieces and give added character to the places where they are installed, plus they are wonderful photo opportunities.", "publishedDate": "2019-05-25", "language": "en", "rating": 5}, {"id": 623026012, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d10538407-r623026012-Fanals-Barcelona_Catalonia.html", "text": "Fanals are the amazing lamps dotted around Placa Reial, designed by the Catalan architect Antoni Gaudi in 1879 ,they look amazing and without a shadow of a doubt add to the allure of visiting the wonderful vibrant and exciting placa Reial. \nThese lamp posts look amazing and you will see many more amazing examples of the lamp posts spread throughout this beautiful city.\nWell worth checking out and easy to locate on Placa Reial. ", "publishedDate": "2018-10-07", "language": "en", "rating": 5}, {"id": 551712402, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d10538407-r551712402-Fanals-Barcelona_Catalonia.html", "text": "these Gaudi lamposts are great, one of the small parts that give this area just increased character. ", "publishedDate": "2018-01-05", "language": "en", "rating": 4}, {"id": 395980825, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d10538407-r395980825-Fanals-Barcelona_Catalonia.html", "text": "Don't forget Gaudi's Lamp Posts on the beautiful and idyllic Plaza Reial.\nThe Lamp Posts have 6 arms and look a little like the Palm Trees on the Plaza.\nThe Lamp Posts was made i 1879, when Gaudi was 27 years old.", "publishedDate": "2016-07-23", "language": "en", "rating": 4}]}}]