[{"locationId": 244195, "name": "Casa Lleo i Morera", "placeType": "ATTRACTION", "reviewListPage": {"reviews": [{"id": 752113093, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d244195-r752113093-Casa_Lleo_i_Morera-Barcelona_Catalonia.html", "text": "We walked past this gorgeous building many times as we stayed nearby.  It's a fancy hotel with a special bar/restaurant on the roof with splendid views.  But down on the street level it's just beautiful.", "publishedDate": "2020-03-31", "language": "en", "rating": 5}, {"id": 728484748, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d244195-r728484748-Casa_Lleo_i_Morera-Barcelona_Catalonia.html", "text": "We could see this gorgeous building from our bedroom window.  Go into the hotel and go the the roof for a drink and the splendid views of the city.  A special treat.", "publishedDate": "2019-11-23", "language": "en", "rating": 5}, {"id": 693098340, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d244195-r693098340-Casa_Lleo_i_Morera-Barcelona_Catalonia.html", "text": "I actually dont know why this architect doesnt recieve the same recognition as Gaudi. All of his work that we saw in Barcelona was amazing.", "publishedDate": "2019-07-27", "language": "en", "rating": 5}, {"id": 690440433, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d244195-r690440433-Casa_Lleo_i_Morera-Barcelona_Catalonia.html", "text": "Casa Lleo i Morera is located on the Passeig de Gràcia in the Eixample district. It forms part of a row of houses known as the Illa de la Discòrdia (the \"Block of Discord\"), which consists of four buildings by noted Modernista architects (Antoni Gaudi, Josep Puig i Cadafalch, Lluís Domènech i Montaner & Jaume Brossa) of Barcelona. Casa Lleó Morera is a building designed by noted modernism architect Lluís Domènech i Montaner. In 1902 Francesca Morera assigned Lluís to the remodel ancient \"casa Rocamora\", built in 1864. She died in 1904, and the building was named after her son, Albert Lleó i Morera. Casa Lleó Morera\nCasa Lleó Morera\nCasaLleoMorera-Full.jpg\nWikimedia | © OpenStreetMap\nGeneral information\nArchitectural style\tModernisme\nLocation\tBarcelona, Catalonia \n41°23′28.3″N 2°9′55.8″E\nAddress\tPasseig de Gràcia, Barcelona, 35\nConstruction started\tc. 1902\nDesign and construction\nArchitect\tLluís Domènech i Montaner\nThe Casa Lleó Morera (Catalan pronunciation: [ˈkazə ʎəˈo muˈɾeɾə]) is a building designed by noted modernisme architect Lluís Domènech i Montaner, located at Passeig de Gràcia 35 in the Eixample district of Barcelona. In 1902 Francesca Morera assigned Lluís Domènech i Montaner to remodel ancient \"casa Rocamora\", built in 1864. She died in 1904, and the building was named after her son, Albert Lleó i Morera. The building is located on the corner of Carrer del Consell de Cent, and is one of the three important buildings of Barcelona's Illa de la Discòrdia (\"Block of Discord\"), and it is the only building of the block awarded Barcelona's town council's Arts Building Annual Award (Concurso anual de edificios artísticos), obtained in 1906.[1] The building lost some of its most representative elements, such as the tempietto on its top (now restored) and the ground floor and mezzanine's architectural sculpture.[2] The building is also known as the residence of Cuban-Catalan photographer Pau Audouard.[3]\n\nContents\n1\tThe building\n2\tGallery\n3\tSee also\n4\tReferences\n5\tExternal links\nThe building[edit]\nThe building was not only the result of an architectural project, but —common practice in Catalan modernism architecture—, several artists collaborated with Domènech i Montaner so as to make a complete artwork, inspired in natural and organic motifs: Lluís Bru and Mario Maragliano were responsible of the mosaic work, Eusebi Arnau made the sculptures, Antoni Serra i Fiter elaborated the ceramics, and Gaspar Homar designed the decoration and the furniture.[4]\n\nIt has been considered that Morera's family wanted to leave trace of their lineage with the continuous references to their family name (Morera, which means mulberry tree in English) in the decoration. Some examples are the mulberry tree found in the patio, the mulberry motifs of the door handles or the portraits made by Antoni Serra in the second floor. The façade and ground floor of the building are decorated with big and varied modernist ornaments, with some outstanding sculptures by Eusebi Arnau surrounding the entrance, which represent two couples of feminine figures holding vases. Those sculptures are installed on double pairs of columns made of pink marble, and under the gallery of the first floor, other feminine heads can be found. The building has been considered one of the best examples of modernism architecture and definitely should be seen.", "publishedDate": "2019-07-17", "language": "en", "rating": 4}, {"id": 690237101, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d244195-r690237101-Casa_Lleo_i_Morera-Barcelona_Catalonia.html", "text": "Casa Lleo I Morera is one of the many stunning buildings located at Passeig de Gracia. \n\nCasa Lleó Morera is the work of Lluís Domènech I Montaner, and it has a long and interesting history. Lluís remodeled Casa Rocamora, an older structure, following the instructions of Francesca Morera. Francesca belonged to a rich family of merchants, and she had inherited Casa Rocamora from her uncle. Unfortunately, she died before the works were completed, and her son, Albert Lleó I Morera became the owner of the building.\n\nThe building is spectacular inside and outside. The facade is amazing, and you can easily recognize Casa Lleo I Morera when you see the tempietto on top of the roof, or the profusely ornamented balcony with its round shape. The building is decorated with many mulberry flowers (Morera means mulberry tree). \n\nLoewe, a Spanish luxury fashion store, is currently located in the ground level of the building. Although years ago the appearance of this ground floor had been altered, recent efforts have vastly restored the original characteristics of the building, and it now looks amazing.", "publishedDate": "2019-07-16", "language": "en", "rating": 5}, {"id": 689585801, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d244195-r689585801-Casa_Lleo_i_Morera-Barcelona_Catalonia.html", "text": "Casa Lleo i Morera is one of three buildings in Illa de la Discòrdia of Passeig de Gracia built in the style of Catalan Modernism. Less colourful than Casa Batllo and Casa Amatller, but no less opulent with it’s richly decorated balconies and facade. The most striking elements of the building are the rounded bay window on the corner of the building, the mulberry motifs  throughout the facade as seen on the supporting columns of the Corinthian order and balconies of the second floor.\n\nThe giant stained glass for animals is probably highlight of the tour for me. \n\nCasa Lleo i Morera isn’t quite as awesome as either Casa Batllo or Casa Amatller, but I’d already seen the other two on previous trips, seeing this building is a nice way to complete the set.", "publishedDate": "2019-07-14", "language": "en", "rating": 5}, {"id": 681533765, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d244195-r681533765-Casa_Lleo_i_Morera-Barcelona_Catalonia.html", "text": "A great place to visit, you can come there and then go to visit some other nice places in the neighborhood. A very lively area, and place to do a lot, such as going to restaurants, cafes or shops.", "publishedDate": "2019-06-14", "language": "en", "rating": 5}, {"id": 677561694, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d244195-r677561694-Casa_Lleo_i_Morera-Barcelona_Catalonia.html", "text": "one of many historic and architectural houses to see in Barca\n\nif you don't have time prioritise others first", "publishedDate": "2019-05-30", "language": "en", "rating": 3}, {"id": 675885613, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d244195-r675885613-Casa_Lleo_i_Morera-Barcelona_Catalonia.html", "text": "If you do not love old architecture, you can just ignore the place. The first-floor dining room of this house is one of Barcelona’s most stunning interiors. The stained-glass windows are by Lluís Rigalt and the eight ceramic mosaic wall panels, depict ing idyllic country scenes, are by Gaspar Homar.", "publishedDate": "2019-05-23", "language": "en", "rating": 3}, {"id": 672065515, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d244195-r672065515-Casa_Lleo_i_Morera-Barcelona_Catalonia.html", "text": "Casa Lleo i Morera is very beautiful. We were walking down the street and this building just commanded our attention. It was so striking that we had to stop for quite some time and just take a good look at it. Bearing in mind that there are so many beautiful buildings in the city, and some are extremely busy with controlling the masses passing through their entry doors, such as Casa Batllo, it is interesting that Casa Lleo i Morera is not just as busy with visitors. It should be, because it is an amazing modernist building.", "publishedDate": "2019-05-07", "language": "en", "rating": 5}, {"id": 660083189, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d244195-r660083189-Casa_Lleo_i_Morera-Barcelona_Catalonia.html", "text": "This is a wonderful piece of architecture in the heart of Barcelona and it is worth viewing when in the area.  Beautiful! Must-See!", "publishedDate": "2019-03-21", "language": "en", "rating": 5}, {"id": 646730687, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d244195-r646730687-Casa_Lleo_i_Morera-Barcelona_Catalonia.html", "text": "One of the most beautiful Modernist houses of bcn. Next to casa Batllo and built by the same arquitect than Palau de la Musica and Hospital de Sant Pau. Lluis Domènech i Montaner.\nA joy.", "publishedDate": "2019-01-17", "language": "en", "rating": 5}, {"id": 641803570, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d244195-r641803570-Casa_Lleo_i_Morera-Barcelona_Catalonia.html", "text": "This building is situated just a stones throw from the Casas Batllo and Amatller and is worth seeing when you visit the others as it does have it's own charm. However, it doesn't draw the crowds like the others and there's a reason for this as it's not as nice or photogenic as them.", "publishedDate": "2018-12-27", "language": "en", "rating": 3}, {"id": 635425024, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d244195-r635425024-Casa_Lleo_i_Morera-Barcelona_Catalonia.html", "text": "The Casa Lleo Morera is located at Passeig de Gracia 35 in the Eixample district.  \nThe building is another great example of architecture.", "publishedDate": "2018-11-24", "language": "en", "rating": 4}, {"id": 626727438, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d244195-r626727438-Casa_Lleo_i_Morera-Barcelona_Catalonia.html", "text": "Another of the big 3 architects that are must sees. This one is on the same block as the other two and an easy stroll to check it out. ", "publishedDate": "2018-10-20", "language": "en", "rating": 4}, {"id": 612023173, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d244195-r612023173-Casa_Lleo_i_Morera-Barcelona_Catalonia.html", "text": "Another one of Gaudi's beautiful buildings. We ended up walking past the building as we didn't realise Lowes store occupies the ground floor.  A very pretty building with many intricate details to look at from the outside. ", "publishedDate": "2018-08-29", "language": "en", "rating": 4}, {"id": 589972395, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d244195-r589972395-Casa_Lleo_i_Morera-Barcelona_Catalonia.html", "text": "Barcelona is spectacular, the architecture of the this place is exceptional\n \nis not too expensive to visit", "publishedDate": "2018-06-23", "language": "en", "rating": 5}, {"id": 585403869, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d244195-r585403869-Casa_Lleo_i_Morera-Barcelona_Catalonia.html", "text": "The Big Three on Passeig de Gracia all has its unique features. Case Lleo Morera is the most stately in our opinion. Its facade is perhaps more conventional, but also easier to remember in many ways. Nice photo stop.", "publishedDate": "2018-06-05", "language": "en", "rating": 4}, {"id": 584769308, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d244195-r584769308-Casa_Lleo_i_Morera-Barcelona_Catalonia.html", "text": "We wanted to do a duel tour of Casa Lleo i Morera, and Casa Amatller. Rick Steves advised you could buy a duel ticket. \nWe walked to Casa Amatller's ticket office as we could not find the duel ticket on line. They advised that Casa Lleo i Morera is now permently closed which is why you can't buy the duel ticket on line. \n\nDo not pass up Casa Amatller though,, it is really worth your time!", "publishedDate": "2018-06-03", "language": "en", "rating": 1}, {"id": 582039543, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d244195-r582039543-Casa_Lleo_i_Morera-Barcelona_Catalonia.html", "text": "We were in Barcelona in early April 2018 and we found that Casa Lleo i Morera is closed to anyone who does not reside in the building. We followed a resident who was just going inside and asked the guard if we could see the interior and were told that it was not possible. The luxury retailer, Lowes, has a store that shares the same address and is a part of the same building.  One of the sales people directed us to an area towards the back of the store in which we could see original ceiling from the Casa.", "publishedDate": "2018-05-22", "language": "en", "rating": 3}, {"id": 580459497, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d244195-r580459497-Casa_Lleo_i_Morera-Barcelona_Catalonia.html", "text": "Unfortunately you can't visit it. Beautiful example of Catalan modernism, less famous than Gaudi's creations but equally impressive. ", "publishedDate": "2018-05-15", "language": "en", "rating": 5}, {"id": 563348341, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d244195-r563348341-Casa_Lleo_i_Morera-Barcelona_Catalonia.html", "text": "On Passeig de Gracia , there are three buidings that are real jewels of the Modernista style of architecture in Barcelona and the Casa Lleo i Morera , designed by Montener is one of them . This architect was one of the teachers of Antonio Gaudi and was considered as his equal or more , Unfortunatly , contrary to the 2 other buildings of the trio close by , this one cannont be visited .", "publishedDate": "2018-02-28", "language": "en", "rating": 5}, {"id": 559219702, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d244195-r559219702-Casa_Lleo_i_Morera-Barcelona_Catalonia.html", "text": "Casa Lleó Morera is a building in Barcelona redesigned by modernism architect Lluís Domènech i Montaner. It is located in the middle of Passeig de Gracia on the corner of Carrer del Consell de Cent. The building, originally known as Casa Rocamora, was built by master builder Joaquim Sitjas in 1864. Francesca Morera i Ortiz commissioned the remodeling work in 1902. Domènech i Montaner collaborated with several artists to redesign the building between 1902 and 1906 using a variety of materials. Casa Lleó Morera is notable for its intricate ornamentation and its tempietto. Casa Lleó Morera was awarded the Arts Building Annual Award in 1906 by the Barcelona’s town council, an honour neither Casa Amatller nor Casa Batlló have yet to receive. Francesca Morera i Ortiz died in 1904 before seeing the finished work. The building is named after her son, Albert Lleó i Morera. Loewe, a Luxury fashion store, currently operates out of Casa Lleó Morera’s main floor.", "publishedDate": "2018-02-08", "language": "en", "rating": 4}, {"id": 558936086, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d244195-r558936086-Casa_Lleo_i_Morera-Barcelona_Catalonia.html", "text": "L'Eixample has great architecture along just about every street, especially near Passeig de Gracia. Casa Lleo is just one of many examples.", "publishedDate": "2018-02-06", "language": "en", "rating": 4}, {"id": 553369062, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d244195-r553369062-Casa_Lleo_i_Morera-Barcelona_Catalonia.html", "text": "Casa Leo Morera is one of Gaudi's beautiful architectoral masterpieces. Easy to find if you stroll down the budy Passeic Graca and even if you do not enter do not miss seeing it. Barcelona for free.", "publishedDate": "2018-01-12", "language": "en", "rating": 4}, {"id": 550806807, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d244195-r550806807-Casa_Lleo_i_Morera-Barcelona_Catalonia.html", "text": "Wonderful architecture, Casa Lleo i. Morera, a real romantic style, this casa is a gem of Gaudi's works, one of the best of the city of Barcelona.", "publishedDate": "2018-01-01", "language": "en", "rating": 5}, {"id": 547909617, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d244195-r547909617-Casa_Lleo_i_Morera-Barcelona_Catalonia.html", "text": "The only house not open for visitors in the apple of discord, the popular name given to the block with houses of Gaudi, Puig and Domenech. Stunning from the outside. A Spanish luxury fashion house is located on the ground floor. ", "publishedDate": "2017-12-18", "language": "en", "rating": 4}, {"id": 546402180, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d244195-r546402180-Casa_Lleo_i_Morera-Barcelona_Catalonia.html", "text": "Located on one of the most exclusive street in Barcelona. This building is simply an architectural jewel. Stand in one corner of the street and you will see all the unique buildings in this area.", "publishedDate": "2017-12-10", "language": "en", "rating": 4}, {"id": 544635843, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d244195-r544635843-Casa_Lleo_i_Morera-Barcelona_Catalonia.html", "text": "It's on the Modernista tour, so lots of tourists here.  You need to see this building as a perfect representation of the style of BCN.  Just lovely.", "publishedDate": "2017-12-02", "language": "en", "rating": 5}, {"id": 542211492, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d244195-r542211492-Casa_Lleo_i_Morera-Barcelona_Catalonia.html", "text": ". . . with tourists strolling and shopping, school children coming from school, adult children taking their elderly parents and dogs for a walk, street sellers hawking counterfeit bags and t shirts.  But one of the lovliest things to see along this avenue is Casa Lleo Morera. As other reviewers have stated, an astonishing tribute to the inimitable Gaudi.", "publishedDate": "2017-11-20", "language": "en", "rating": 5}, {"id": 542194425, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d244195-r542194425-Casa_Lleo_i_Morera-Barcelona_Catalonia.html", "text": "By this impressive city landmark with creative architecture and inspiring street views, visitors will have an unforgettable touch of classical Barcelona.", "publishedDate": "2017-11-20", "language": "en", "rating": 4}, {"id": 538694489, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d244195-r538694489-Casa_Lleo_i_Morera-Barcelona_Catalonia.html", "text": "I totally love Barcelona city center; here shops can occupy luxury old buildings with exquisite architectural styles, giving a whole different context to the businesses. The impression is even stronger if we are talking about some world known elegant brands.", "publishedDate": "2017-11-06", "language": "en", "rating": 5}, {"id": 534316452, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d244195-r534316452-Casa_Lleo_i_Morera-Barcelona_Catalonia.html", "text": "We got in and spoke to a resident who told us that you can no longer tour this building. Instead we went a few doors up to Casa Amatller which is beautiful.", "publishedDate": "2017-10-19", "language": "en", "rating": 1}, {"id": 534105252, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d244195-r534105252-Casa_Lleo_i_Morera-Barcelona_Catalonia.html", "text": "Appeared to be permanently closed when we arrived despite all literature showing it as open. Not a wasted journey as we visited the nearby Gaudi houses.", "publishedDate": "2017-10-18", "language": "en", "rating": 1}, {"id": 529040684, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d244195-r529040684-Casa_Lleo_i_Morera-Barcelona_Catalonia.html", "text": "It's sometimes lost in the conversation about Gaudi's house.\nIn reality I think I prefer this one because of the lower flash if I had to choose to live in one.", "publishedDate": "2017-10-02", "language": "en", "rating": 5}, {"id": 493305719, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d244195-r493305719-Casa_Lleo_i_Morera-Barcelona_Catalonia.html", "text": "The last pearl of the trilogy, one of the three famous modernist houses in Passeig the gracia. oleo I Morera was fully restored in the early XX by the Catalan architect Lluis Domenech I Montaner. It offers a selection of drawings and sculptures of the time inside its rooms. Good views form the inside and great details of modernism on the floors, side walls and ceilings, even the staircase is different from the common buildings we r used to see around Europe. The façade is also worth a look, amazing design and architecture.", "publishedDate": "2017-06-15", "language": "en", "rating": 4}, {"id": 492246297, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d244195-r492246297-Casa_Lleo_i_Morera-Barcelona_Catalonia.html", "text": "There is a catch to my title of this review. I have not seen all the buildings in Barcelona, But if the ones I have seen, this is my favorite. If you intend to visit this building, I recommend you find a hotel on Passeig de Gràcia and this is where Gaudi's buildings are located also. Find a hotel near the intersection of this street and Avinguda Diagonal and there is a Metro Station there.", "publishedDate": "2017-06-11", "language": "en", "rating": 5}, {"id": 492127367, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d244195-r492127367-Casa_Lleo_i_Morera-Barcelona_Catalonia.html", "text": "Very striking architecture, as expected, but also very atmospheric. In the attic is an interesting display about Gaudi including a demonstration of his inspiration from hanging chains. The rooftop with its chimneys provided views across the city, and of note was the view of the Sagrada Familia. ", "publishedDate": "2017-06-11", "language": "en", "rating": 5}, {"id": 488696741, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d244195-r488696741-Casa_Lleo_i_Morera-Barcelona_Catalonia.html", "text": "can't go in but note the extraordinary exterior as you walk along the Passage de Gracia  another beautiful building worth noting. ", "publishedDate": "2017-05-29", "language": "en", "rating": 5}, {"id": 487249538, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d244195-r487249538-Casa_Lleo_i_Morera-Barcelona_Catalonia.html", "text": "Number 35 was designed by the man who created Catalunyan Modernisme. He is overlooked by tourists on the way to Casa Batllo. See his work and his influence all through the city, then view Sagrada Familia from Hospital Saint Pau, where all patient rooms face the Gaudi epic in construction.", "publishedDate": "2017-05-24", "language": "en", "rating": 5}, {"id": 485771930, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d244195-r485771930-Casa_Lleo_i_Morera-Barcelona_Catalonia.html", "text": "Take your time to enjoy the house designed by the famous Gaudi. The whole house is amazing, but the roof is what impressed me. Gaudi designed chimneys that were functional and beautiful. No black pipes here like other roofs.", "publishedDate": "2017-05-19", "language": "en", "rating": 5}, {"id": 481876535, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d244195-r481876535-Casa_Lleo_i_Morera-Barcelona_Catalonia.html", "text": "I did not go inside, but outside the house looks impressive. It is located near Casa Batllo, where many of the houses are built by modernists.", "publishedDate": "2017-05-05", "language": "en", "rating": 4}, {"id": 479922842, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d244195-r479922842-Casa_Lleo_i_Morera-Barcelona_Catalonia.html", "text": "People say that is very like the Palau. Is a modernist architecture by Domenech. Is close to Casa Batllo by Gaudí. Two outstanding buildings", "publishedDate": "2017-04-29", "language": "en", "rating": 4}, {"id": 476627934, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d244195-r476627934-Casa_Lleo_i_Morera-Barcelona_Catalonia.html", "text": "Touring this house was a wonderful experience, I just wish that we could have had a more in depth tour and that we could have toured more of the building.\n\nThe architect who designed this house mentored Gaudi and you will not regret seeing his other buildings in Barcelona (the Palau de Musica and the hospital system are absolutely incredible).", "publishedDate": "2017-04-17", "language": "en", "rating": 5}, {"id": 474500932, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d244195-r474500932-Casa_Lleo_i_Morera-Barcelona_Catalonia.html", "text": "Beautiful house, built and decorated in a Modernista style, which is the Spanish answer to the German and Austria Jugendstil and French Art Nouveau from 120 years ago. An island of serenity in the Middle of a busy Barcelona that preserves the greatness and beauty of the style at that time. \nCasa Lleo i Morera\nPasseig de Gracia, 35, Barcelona, Spain \nPhone Number: +34 936 76 27 33\nMon - Sat 10:00 am - 7:00 pm", "publishedDate": "2017-04-11", "language": "en", "rating": 5}, {"id": 468689161, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d244195-r468689161-Casa_Lleo_i_Morera-Barcelona_Catalonia.html", "text": "This is another of the buildings with the Gaudi influence, not quite as spectacular as some of the others, but worth a look as it is not far from Casa Battlo.", "publishedDate": "2017-03-19", "language": "en", "rating": 5}, {"id": 462846517, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d244195-r462846517-Casa_Lleo_i_Morera-Barcelona_Catalonia.html", "text": "This is only 50 metres away from Casa Batllo. Photo opportunities only as it's permanently closed. Corner position.", "publishedDate": "2017-02-25", "language": "en", "rating": 4}, {"id": 453705157, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d244195-r453705157-Casa_Lleo_i_Morera-Barcelona_Catalonia.html", "text": "We had downloaded the mobile app City Walks for Barcelona, and this was one of the buildings it directed us to. Very different to surrounding buildings. Have look if you get the chance.", "publishedDate": "2017-01-20", "language": "en", "rating": 4}, {"id": 446341134, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d244195-r446341134-Casa_Lleo_i_Morera-Barcelona_Catalonia.html", "text": "It is located near Casa Batllo on Passeig de Gracia, although not as impressive but still an interesting building and well worth taking some pictures.", "publishedDate": "2016-12-23", "language": "en", "rating": 3}, {"id": 440671959, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d244195-r440671959-Casa_Lleo_i_Morera-Barcelona_Catalonia.html", "text": "this is just beside CAsa batllo, worth clicking couple of pics from outside. nothing more. (you can add a location in your checklist, without an effort)", "publishedDate": "2016-11-28", "language": "en", "rating": 3}, {"id": 438592104, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d244195-r438592104-Casa_Lleo_i_Morera-Barcelona_Catalonia.html", "text": "this is a very beautiful building with lovely interesting architecture, lovely night lighting too, there appears to be a cupola on that corner. the shutters and balconies are very elegant", "publishedDate": "2016-11-19", "language": "en", "rating": 5}, {"id": 437735559, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d244195-r437735559-Casa_Lleo_i_Morera-Barcelona_Catalonia.html", "text": "If you're walking througt the Passeig de Gracia you have to see it. t's very good option to see a lot by walking", "publishedDate": "2016-11-16", "language": "en", "rating": 4}, {"id": 434954036, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d244195-r434954036-Casa_Lleo_i_Morera-Barcelona_Catalonia.html", "text": "Located just a few metres down the road from Casa Batllo, Lleo Morera reminds you of the uniqueness of the architecture of Barcelona!", "publishedDate": "2016-11-05", "language": "en", "rating": 4}, {"id": 392183130, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d244195-r392183130-Casa_Lleo_i_Morera-Barcelona_Catalonia.html", "text": "We have visited several of the art nouveau buildings in Barcelona over several visits, but we finally visited Casa Lleo i Morera and found it to be one of the most beautiful. Gaudi gets a lot of attention, but this one-floor apartment by Lluis Domenech i Montaner has sculptures above doorways, elaborate floors and spectacular stained glass. You must take the 30 minute guided tour, but can then spend more time photographing and enjoying. Also pleasant was the fact it was not crowded.", "publishedDate": "2016-07-13", "language": "en", "rating": 5}, {"id": 390547484, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d244195-r390547484-Casa_Lleo_i_Morera-Barcelona_Catalonia.html", "text": "I did the express tour which is a 1/2 hour tour of the building. Only the first floor is open to the public. The guide is very informed the and interior is beautiful. I really enjoyed this tour...I actually enjoyed it much more than I enjoyed Casa Batllo.", "publishedDate": "2016-07-08", "language": "en", "rating": 5}, {"id": 389266156, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d244195-r389266156-Casa_Lleo_i_Morera-Barcelona_Catalonia.html", "text": "When you are tired of Gaudi and audio tours, visit one of the Casas Singulares (also Casa Amantller two houses down and Palau Baro de Quadras on Diagonal. Alex at the desk helpfully informed me of the discount dual admission with Amantller (note: at both, English tours are offered at 11 am only) and the fact that Baro de Quadras was open Wednesdays only. The tour provides a thorough look at a Neo-Gothic / Modernist house by Puig I Calafalch, a contemporary of Gaudi's. Alex was an excellent and informative guide, providing detailed explanation of the extensive decoration of the home. ", "publishedDate": "2016-07-04", "language": "en", "rating": 5}, {"id": 387811731, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d244195-r387811731-Casa_Lleo_i_Morera-Barcelona_Catalonia.html", "text": "We saw the stained glass window from Casa Batillo, and it looked so beautiful from the outside, that we decided to go in. Big mistake. The tour guide, was absolutely terrible, her english was terrible, and it was all a waste of money because besides that beautiful window there is nothing at all to see.. and you do not even get to see the glass windows on all the floors.. just one! If it would be for free, I would say have a look.. but to pay for it? No way.", "publishedDate": "2016-06-30", "language": "en", "rating": 2}, {"id": 386093658, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d244195-r386093658-Casa_Lleo_i_Morera-Barcelona_Catalonia.html", "text": "Decided to complete our third style of architecture by including this building. The art work is beautiful well worth the visit.", "publishedDate": "2016-06-26", "language": "en", "rating": 4}, {"id": 385636804, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d244195-r385636804-Casa_Lleo_i_Morera-Barcelona_Catalonia.html", "text": "Casa Lleo i Morera is a beautiful building, designed by Lluis Domenech i Montaner.\nIt is located in \"Block of Discord\" together with Casa Amatller and Casa Batllo. All example of the Catalan Modernism Architecture.\nCasa Lleo i Morera was build in 1864 for Francesca Morera", "publishedDate": "2016-06-24", "language": "en", "rating": 4}, {"id": 384923697, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d244195-r384923697-Casa_Lleo_i_Morera-Barcelona_Catalonia.html", "text": "The buildings restoration is an example of Catalan modernist architecture. All of the designs were a collaboration by numerous designers and architects. The house has beautiful mosaics, sculptures, ceramics as well as very ornate wrought iron examples and very intricate wood work. The names of the owners mean lion and mulberry. There are plenty references to both throughout the house. Only the first floor was on the tour. We were told that the other floors are rented out to various businesses. That was a bit of a disappointment but we did enjoy the first floor. ", "publishedDate": "2016-06-22", "language": "en", "rating": 4}, {"id": 382824181, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d244195-r382824181-Casa_Lleo_i_Morera-Barcelona_Catalonia.html", "text": "Next door to Casa Amatller and definitely worth seeing. No furniture but beautiful stained glass, tiles, mosaics. Helpful guide. ", "publishedDate": "2016-06-15", "language": "en", "rating": 4}, {"id": 381714806, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d244195-r381714806-Casa_Lleo_i_Morera-Barcelona_Catalonia.html", "text": "It's embarrassing but my bf and I went there only because we thought this was casa battlo lol. Anyway the ticket for 30 mins is 12 euros, 1 hour 15 euros. It includes a tour by a well informed guide. You cannot go in individually,  only guided tour. 30 mins tour in English every 30 mins I think. It's only 1 floor and I don't think you can stay for 1 hour there. I mean It's very small area of exhibition.  ", "publishedDate": "2016-06-11", "language": "en", "rating": 3}, {"id": 381159432, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d244195-r381159432-Casa_Lleo_i_Morera-Barcelona_Catalonia.html", "text": "You wont find furniture in this home.  But the walls, windows, ceilings and floors are still in fantastic condition to showcase the design and care of craftsmanship that it took to create this show piece.  If you are looking for \"gaudy\" go see another of the homes on the block.  This is art meant for the less crazy mind.", "publishedDate": "2016-06-09", "language": "en", "rating": 5}, {"id": 379373398, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d244195-r379373398-Casa_Lleo_i_Morera-Barcelona_Catalonia.html", "text": "An ornate corner townhouse located on the Passeig de Gracia. The architecture of the building is Catalan Modernista style which is somewhat common on this major thoroughfare. This eclectic house has pleasant looks but it fails to make the kind of impression that the architecture of Gaudi does make. There are a number of different, paid,  guided tours available if you're interested.", "publishedDate": "2016-06-03", "language": "en", "rating": 4}, {"id": 379296169, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d244195-r379296169-Casa_Lleo_i_Morera-Barcelona_Catalonia.html", "text": "You definetely have to stop and admire this building. It's near to Casa Batllo at La Rampla, but I don't know if it's worth it to pay to see the inside.", "publishedDate": "2016-06-03", "language": "en", "rating": 4}, {"id": 377773792, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d244195-r377773792-Casa_Lleo_i_Morera-Barcelona_Catalonia.html", "text": "Is a piece of art that you can see from the street. No need to entrance. But worth to comtemplate of the details.", "publishedDate": "2016-05-29", "language": "en", "rating": 5}, {"id": 377268964, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d244195-r377268964-Casa_Lleo_i_Morera-Barcelona_Catalonia.html", "text": "We loved visiting this house and it was well worth the time we spent there.  Lovely glass and lovely tour!", "publishedDate": "2016-05-28", "language": "en", "rating": 5}, {"id": 374144432, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d244195-r374144432-Casa_Lleo_i_Morera-Barcelona_Catalonia.html", "text": "This building an example of modernism was designed by noted  architect Lluis Dome each I Montainer in 1902.   Absolutely awe inspiring.  Located at thr corner of two streets, one just to stop to take photographs of this imposing structure.", "publishedDate": "2016-05-18", "language": "en", "rating": 5}, {"id": 373602905, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d244195-r373602905-Casa_Lleo_i_Morera-Barcelona_Catalonia.html", "text": "Casa Lleo I Morera is a beautiful home worth visiting. The details throughout the house including woodwork and statues are all gorgeous.  Visiting this home, along with the other modernisme home, shows the variety and different visions of Barcelona's many great architects.", "publishedDate": "2016-05-17", "language": "en", "rating": 5}, {"id": 373064471, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d244195-r373064471-Casa_Lleo_i_Morera-Barcelona_Catalonia.html", "text": "This house is a must visit - some of the best stained glass works and mosaics are inside, and there's a lot of things to see. Like many other modernist works, casa Lleo i Morera is full of details and thought, and indeed is a very exciting place, that should by no way get overshadowed by Gaudi's works.\n\nAt 15 euros per entrance, of course, it's a rip off. But this could be said about nearly any other place in Barcelona, so nothing exceptional here.", "publishedDate": "2016-05-15", "language": "en", "rating": 5}, {"id": 369952802, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d244195-r369952802-Casa_Lleo_i_Morera-Barcelona_Catalonia.html", "text": "We saw this place from the back of Casa Batlló and were really pleased to see it open to the public albeit for limited periods. Not as busy as its famous neighbour and the guided tours seem so personal as a result.\nThe building is really exceptional and the back story great. \n\nFans of dragons and mulberry bushes this one is defiantly for you.\nEqually for those looking for incredible surface texture and architecture then this is not one to miss.", "publishedDate": "2016-05-03", "language": "en", "rating": 5}, {"id": 369335874, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d244195-r369335874-Casa_Lleo_i_Morera-Barcelona_Catalonia.html", "text": "This recently opened house allows the visitors to compare the styles of the three modernist architects: Gaudi, Puig i Cadafalch and, respectively, Domenech i Muntaner (the author of this one). It has a great stained glass balcony so it is a nice place to visit but not a priority in Barcelona.", "publishedDate": "2016-05-01", "language": "en", "rating": 4}, {"id": 368384459, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d244195-r368384459-Casa_Lleo_i_Morera-Barcelona_Catalonia.html", "text": "Beautyful balcon!great location and a cheap all you can eat restaurant near called la vaca paca!worth to eat there!", "publishedDate": "2016-04-28", "language": "en", "rating": 5}, {"id": 368180070, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d244195-r368180070-Casa_Lleo_i_Morera-Barcelona_Catalonia.html", "text": "Having enjoyed many of the Gaudi masterpieces, we decided to branch out a littlle, and bought tickets for the express tour (half an hour) at Casa Lleo i Morera. It is a beautiful building and the interior is fascinating to see. Our English language tour guide was well informed, friendly, willing and able to answer questions, and made the whole tour very enjoyable. We saw the public reception rooms and some of the private quarters as well. Original decor is intact in most parts, though the original furniture has been removed. Tickets can be bought online, but we bought ours more or less on the spur of the moment (there's a ticket office on La Rambla) and had no trouble getting a tour at the time we wanted. It's a very easy walk from Plaça Catalunya.", "publishedDate": "2016-04-27", "language": "en", "rating": 5}, {"id": 365854439, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d244195-r365854439-Casa_Lleo_i_Morera-Barcelona_Catalonia.html", "text": "We had gone to visit one of the nearby Gaudi hoses, but it was so full and with such queues we didn't go in.  And what a lucky break that was, as just 150 meters away was this pearl which was almost empty of tourists and stunningly beautiful inside.  Words cannot do it justice so look at a few of the photos I took to get a real impression.  Very highly recommended! ", "publishedDate": "2016-04-20", "language": "en", "rating": 5}, {"id": 365158903, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d244195-r365158903-Casa_Lleo_i_Morera-Barcelona_Catalonia.html", "text": "This was the house of a wealthy Barcelonan family that hired Gaudi to remodel it, but the house contains no furniture, and was interesting but not anything like Casa Ballot or Casa Mila.", "publishedDate": "2016-04-18", "language": "en", "rating": 4}, {"id": 354714707, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d244195-r354714707-Casa_Lleo_i_Morera-Barcelona_Catalonia.html", "text": "A beautiful building worth a visit and a few photos. Go there and you will be happy not to miss another special building in barcelona.\nYona s.", "publishedDate": "2016-03-11", "language": "en", "rating": 5}, {"id": 348780938, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d244195-r348780938-Casa_Lleo_i_Morera-Barcelona_Catalonia.html", "text": "There is not so much to see as in some of the Gaudi houses but this one by the modernist architect Domenech is well worth a visit. There are beautifully decorated rooms and the pièce de résistance is the wonderful stained glass window in the main room.", "publishedDate": "2016-02-18", "language": "en", "rating": 5}, {"id": 342951059, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d244195-r342951059-Casa_Lleo_i_Morera-Barcelona_Catalonia.html", "text": "This beautiful house was built by the outstanding architect Lluís Domenech i Montaner, one of the champions of Catalan modernism. You can see how a rich family lived and spent their money in the Barcelona of a century ago. We had a guided tour, conducted by a very professional guide. Try to book in advance by Internet. Prices aren't cheap, but the visit deserves to pay.", "publishedDate": "2016-01-26", "language": "en", "rating": 4}, {"id": 342068468, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d244195-r342068468-Casa_Lleo_i_Morera-Barcelona_Catalonia.html", "text": "The third part of this memorable Block of Discord, with works of the most important modernist architects, was designed by Lluis Domenech i Montaner, another brilliant Catalan architect. It was refurbished in 1905 and reflects the author’s floral style which was supplemented with amazing works of several other artists. The stained glasses, mosaics, sculptures, ornate windows and balconies and other examples of modernism style are simply breathtaking.", "publishedDate": "2016-01-23", "language": "en", "rating": 5}, {"id": 340177184, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d244195-r340177184-Casa_Lleo_i_Morera-Barcelona_Catalonia.html", "text": "The building is situated in the direct neighborhood of Casa Batllo -- so if you're interested in architecture you will be around anyhow. It’s a very good example of the Modernisme architecture and it’s nice to see a different interpretation of this architectural style. However, it’s not as “spectacular” as the Gaudi buildings in my eyes. But it’s definitely worth to take a closer look at the details…", "publishedDate": "2016-01-15", "language": "en", "rating": 3}, {"id": 340117668, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d244195-r340117668-Casa_Lleo_i_Morera-Barcelona_Catalonia.html", "text": "As the other reviews have pointed out, just one floor is available for viewing but it is a real beauty. Although the furniture is in a museum, there are large photos in several rooms showing the apartment with its furnishings. The guide was helpful and instructive and there was a good, short video at the start of the tour. It's in a great location on the Passeig de Gracia and a quieter experience than Gaudi's nearby Casa Batlio. Very worthwhile!.", "publishedDate": "2016-01-14", "language": "en", "rating": 4}, {"id": 336917624, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d244195-r336917624-Casa_Lleo_i_Morera-Barcelona_Catalonia.html", "text": "Having an enthusiastic guide always makes visiting somewhere much better for me. Did the morning tour of this great house which lasts about an hour and was really good. Amazing decor and stained glass windows.", "publishedDate": "2016-01-03", "language": "en", "rating": 5}, {"id": 332080927, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d244195-r332080927-Casa_Lleo_i_Morera-Barcelona_Catalonia.html", "text": "This house is part of the Island of Discord alongside the Amatler House- by Puig i Cadafalch and Casa Batllo by Gaudi i Cornet.\nCheck the official site for the hours. There's two types of visits:\nExpress ones of roughly 30 minutes and \nGuided ones for approximately 60 minutes.\n10:00 Visit Express\n10:30 Visit Express\n11:30 Visit Express\n12:00 Language: Catalan\n12:30 Visit Express\n13:00 Visit Express\n15:30 Visit Express\n16:00 Visit Express\n16:30 Visit Express\n17:00 Language: Spanish\n17:30 Visit Express\n18:00 Visit Express\n18:30 Visit Express\nIf there's a guided tour in a specific language you can't take an express tour.\nPersonaly if you want to save some money visit both the Amatler House and the Lleo i Morrera because the combined ticket costs 21,6 euros including the 20% discount for the Express visits.\nYou can buy the combined ticket ONLY using a Card a This place and with both cash and card at the Amatler House.\nThe Amatler House has the same schedule more or less.", "publishedDate": "2015-12-11", "language": "en", "rating": 5}, {"id": 330194816, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d244195-r330194816-Casa_Lleo_i_Morera-Barcelona_Catalonia.html", "text": "Not as famous as the just up the street Casa Batllo, but still a great example of the Catalan Modernist design.  The stained glass enclosed dining area(s) are really a highlight.  You can only visit one floor - the other 3 are still occupied.  Buy your ticket on-line.  It was nice to see someone's work other than Gaudi, and the guy who did this house also did the Palau de la Musica, which some say is the most beautiful building in Barcelona.", "publishedDate": "2015-12-01", "language": "en", "rating": 5}, {"id": 329436689, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d244195-r329436689-Casa_Lleo_i_Morera-Barcelona_Catalonia.html", "text": "This house is only able to be visited on a guided tour.  These run at set times in different languages.  I booked my ticket online, which I would recommend doing.\n\nThe highlight is definitely the bay window - its really beautiful.  The tour takes about 1 hour.", "publishedDate": "2015-11-27", "language": "en", "rating": 4}, {"id": 327653830, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d244195-r327653830-Casa_Lleo_i_Morera-Barcelona_Catalonia.html", "text": "This great house, remodelled completely by the renowned architect Montaner, who was also responsible for the Palau de la Musica de Catalunya (which is also a stunner), is well worth a visit. You can get a combined ticket with the Casa Amatller in the same block for 21 euros which is great value. It is worthwhile when exploring Gaudi's buildings nearby (Casa Batllo & La Pedrera) to get a sense of the context within which he was working by visiting buildings by his Modernista architect contemporaries. \nThis building had no expense spared, pink marble extensively used in the front rooms & the stained glass in the dining room overlooking the rear terrace is wonderful. Attention to decorative detail is everywhere you look. Lots of light filled room too. I could handle living in one of these apartments....", "publishedDate": "2015-11-18", "language": "en", "rating": 5}, {"id": 327589212, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d244195-r327589212-Casa_Lleo_i_Morera-Barcelona_Catalonia.html", "text": "Not as known as the Batló House or La Pedrera but also incredible beautiful by the outside!!\nAnother place to enjoy in Passeig de Gracia.", "publishedDate": "2015-11-18", "language": "en", "rating": 4}, {"id": 326879824, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d244195-r326879824-Casa_Lleo_i_Morera-Barcelona_Catalonia.html", "text": "This is our favourite on the Mansada de la Discòrdia, it is mindblowing in its gorgeous design and craftsmanship. Be sure to check out the furniture now in the Museu Nacional MNAC. Our guide was an art historian who was passionate and knew his stuff.  Great tour. The story behind the building renovation  is interesting too, mulberries everywhere, only 4 lions!", "publishedDate": "2015-11-15", "language": "en", "rating": 5}, {"id": 325070086, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d244195-r325070086-Casa_Lleo_i_Morera-Barcelona_Catalonia.html", "text": "Don’t miss this amazing construction by Lluís Domènech i Montaner. While most visitors know of the Antoni Gaudí buildings in Barcelona, they often overlook this Catalan modernist wonder. While not as fantastical as the Gaudí designs, this home shows amazing workmanship with marvelous tilework and mosaics. It feels more coherent, and brings an eye-popping scheme of color and sculpture to a home that actually feels livable. We purchased tickets in advance for the guided tour in English, which started on time and lasted almost an hour. We learned the history of the home and the other buildings on the Block of Discord. Be sure you have Casa Lleó i Morera on your must-see list in Barcelona.", "publishedDate": "2015-11-07", "language": "en", "rating": 4}, {"id": 323095506, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d244195-r323095506-Casa_Lleo_i_Morera-Barcelona_Catalonia.html", "text": "Very impressive building. Inside the first story is open to the public. It is a very impressive huge flat.", "publishedDate": "2015-10-29", "language": "en", "rating": 4}, {"id": 322983555, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d244195-r322983555-Casa_Lleo_i_Morera-Barcelona_Catalonia.html", "text": "We took the 11 o 'clock English tour and were not disappointed.  It's an excellent tour and an absolutely stunning home.  So much better than fighting the crowds at Casa Batllo. Do put it high on your list of must-sees.", "publishedDate": "2015-10-29", "language": "en", "rating": 5}, {"id": 322627627, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d244195-r322627627-Casa_Lleo_i_Morera-Barcelona_Catalonia.html", "text": "Just opposite Casa Balto, this stunning building is worth admiring even if just from outside, another reason to have a big smile just soaking the atmosphere around it", "publishedDate": "2015-10-28", "language": "en", "rating": 5}, {"id": 321580297, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d244195-r321580297-Casa_Lleo_i_Morera-Barcelona_Catalonia.html", "text": "The English tour at Casa Lleo was well done. A good guide with lots of information on the  architect who taught Gaudi. The home is early Modernista and beautiful. Well worth your time.", "publishedDate": "2015-10-25", "language": "en", "rating": 5}, {"id": 321368684, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d244195-r321368684-Casa_Lleo_i_Morera-Barcelona_Catalonia.html", "text": "Very nice visit to this beautiful monument.\nHad a good guide that told us a lot of information in an interesting way.", "publishedDate": "2015-10-24", "language": "en", "rating": 5}, {"id": 320968593, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d244195-r320968593-Casa_Lleo_i_Morera-Barcelona_Catalonia.html", "text": "Very impressive to visit. Beautiful and unique architecture.A real treasure of modernism. A great experience!", "publishedDate": "2015-10-22", "language": "en", "rating": 5}, {"id": 320612320, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d244195-r320612320-Casa_Lleo_i_Morera-Barcelona_Catalonia.html", "text": "Unfortunately only one floor is open to the public and so the tour is quite short (otherwise I would definitely have given this a 5 star review). It is spectacular though, and the knowledgeable guide seemed to really enjoy showing us around and explaining the history to us.", "publishedDate": "2015-10-21", "language": "en", "rating": 4}, {"id": 320395521, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d244195-r320395521-Casa_Lleo_i_Morera-Barcelona_Catalonia.html", "text": "If you are interested in modernists architecture, see this is conjunction with Casa Batilo. They are are opposite ends of the same block. The house does not have the same \"fantasy\" feel as Casa  Batilo, but provides an excellent view of another important modernists architect. The house is recently opened to the public. It is by tour only. The reason I give this 4 stars is that only one floor and a terrace are open to the public. However, if you appreciate craftsmanship, fine wood work, stained glass, go.", "publishedDate": "2015-10-20", "language": "en", "rating": 4}, {"id": 320153880, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d244195-r320153880-Casa_Lleo_i_Morera-Barcelona_Catalonia.html", "text": "The tour guide made our visit. She was incredibly enthousiastic about what she was explaining! The windows in the back are beautiful. ", "publishedDate": "2015-10-19", "language": "en", "rating": 4}, {"id": 319292878, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d244195-r319292878-Casa_Lleo_i_Morera-Barcelona_Catalonia.html", "text": "Located at the most fashionable street in town it has the best of two worlds, the most prestigious shops are along the street and shows of the local architecture, its a different way to meet the local and international beauty.", "publishedDate": "2015-10-16", "language": "en", "rating": 3}]}}]