[{"locationId": 8782951, "name": "Teatre Victoria", "placeType": "ATTRACTION", "reviewListPage": {"reviews": [{"id": 734979028, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d8782951-r734979028-Teatre_Victoria-Barcelona_Catalonia.html", "text": "We went to see a great show lead by “mago pop”. He ‘s a great showman and the tricks he performs are incredible (some more than others). The show lasts for a little bit more than an hour, but it is very entertaining and timeflies when you’re watching it. A great show with lots of fun", "publishedDate": "2019-12-27", "language": "en", "rating": 4}, {"id": 555021812, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d8782951-r555021812-Teatre_Victoria-Barcelona_Catalonia.html", "text": "We saw the show Cabaret and it was kind of ok! The worst part was that in the intermission the smell of tabaco from the people smoking at the entrance that flooded the whole theater!! They shouldn't allow that!! My recommendation to the direction of the theater is to allow people to smoke in the street not in the actual entrance!! Disgusting!!!", "publishedDate": "2018-01-20", "language": "en", "rating": 3}, {"id": 535211171, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d8782951-r535211171-Teatre_Victoria-Barcelona_Catalonia.html", "text": "Odd at best.   Show started with a mix of men and women dressed in strange costumes and drag like make-up groping each other.   Then the show went into a man coming from out of town to \"Berlin\" to write a book.  Then the show took a turn into a Nazi theme.  Very hard to follow what they are saying (we are from the US but we know some Spanish).  We left at intermission.  Waste of time and money.  Many other things to do and see in Barcelona.   I guess this type show may be entertaining for locals.", "publishedDate": "2017-10-22", "language": "en", "rating": 1}, {"id": 338630062, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d8782951-r338630062-Teatre_Victoria-Barcelona_Catalonia.html", "text": "Musical in Catalan. Not easy to follow when you don't speak the language, but you get a whole way if you read the story online in advance. The impressive decor and great voices are absolutely worth the uncomfortable feeling of not understanding the lyrics.", "publishedDate": "2016-01-09", "language": "en", "rating": 5}]}}]