[{"locationId": 2485623, "name": "Casa de les Punxes", "placeType": "ATTRACTION", "reviewListPage": {"reviews": [{"id": 750150997, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d2485623-r750150997-Casa_de_les_Punxes-Barcelona_Catalonia.html", "text": "A good audiovisual display explaining the story of St. George and the Dragon, but there's really very little to see in the house itself. I was disappointed as I got to the exit still thinking 'where's the interesting bit?'", "publishedDate": "2020-03-09", "language": "en", "rating": 2}, {"id": 745758703, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d2485623-r745758703-Casa_de_les_Punxes-Barcelona_Catalonia.html", "text": "I paid a little extra for the guided visit (with a human) and it was SO worth it.  The guide was extremely knowledgeable and the content was nearly magical.  The symbolism, beauty and passion of its architect, the history which some involved Barcelona’s fútbol, the legends, as well as the fact that it was the first house patterned after Castle Neuschwanstein (the same castle that was used to pattern Cinderella’s castle at Disney World) made this one of the most exciting guided visits of Barcelona. ", "publishedDate": "2020-02-17", "language": "en", "rating": 5}, {"id": 738069520, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d2485623-r738069520-Casa_de_les_Punxes-Barcelona_Catalonia.html", "text": "Fascinating building and worth going in but be aware that there is a rather lame St George presentation and no original furniture or decor inside.  The roof terrace is pretty cool - we were there for sunset.  Only go in if you have already been to Casa Batlló, Casa Amatller, La Pedrera, Casa Vicens, Sant Pau Hospital, Palau Guell and La Sagrada Família.", "publishedDate": "2020-01-09", "language": "en", "rating": 4}, {"id": 737210736, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d2485623-r737210736-Casa_de_les_Punxes-Barcelona_Catalonia.html", "text": "I was strolling through Barcelona and this building hit my eye. It looks like a medieval castle but it is 100% modernismo. I stepped in and found out, that it is possible to visit. The entrance fee is 13,50 €. You will experience a well made interactive journey through a couple of rooms. They will tell you the legend of the holy George and how he killed the dragon. This story is related to the building. You also will get some informations of the house, architect and people who owned it. That will also happen on the roof terrace within the towers, which is nice.\nIt is a bit sad, that you cant see some of the original rooms. Like with tapestry and furniture, cause the only rooms you enter are those with the exhibition installations.\nBut it is worth the visit and you will see that Barcelona has more to offer than Gaudi", "publishedDate": "2020-01-05", "language": "en", "rating": 4}, {"id": 734460716, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d2485623-r734460716-Casa_de_les_Punxes-Barcelona_Catalonia.html", "text": "A wonderfully eccentric modernist building that stands out on the Diagonal, great shots to be taken from street level , we didnt take the tour but had a wander through the gift shop and small cafe.", "publishedDate": "2019-12-24", "language": "en", "rating": 4}, {"id": 727054414, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d2485623-r727054414-Casa_de_les_Punxes-Barcelona_Catalonia.html", "text": "This building is shown off to its best advantage as it is located on the wide Avenida and you can step back and get a good look or good photo.  I think it's a work of art.", "publishedDate": "2019-11-17", "language": "en", "rating": 4}, {"id": 725179236, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d2485623-r725179236-Casa_de_les_Punxes-Barcelona_Catalonia.html", "text": "The Casa de les Punxes or Casa Terradas is a building designed by the Modernista architect Josep Puig i Cadafalch. The house, which consists of 3 interconnected buildings, is definitely worth a visit.  The house has a beautiful facade and a nice terrace where you can get to all the turrets. You will receive an audio route guide that activates when you enter a specific room. Only one building is available, the rest are apartments, the terrace is open to the public. First exposition tells you about the dragon legend with exiting movie shown on the walls of the museum along your way. The rest of the rooms are dedicated to the history of the of the house and the architect, used decorative elements, unique technology for the production of tiles used in the home, etc. The story audio and visual tracks are well done. I found this tour overall worthy of spending time and money.", "publishedDate": "2019-11-09", "language": "en", "rating": 4}, {"id": 713633950, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d2485623-r713633950-Casa_de_les_Punxes-Barcelona_Catalonia.html", "text": "The building is very nice from outside but inside there is not much to see.\nOn the first floor, you’ve got few videos about San Jordi. \nThen on the terrace you visit the towers, they are empty. The view over Diagonal is nice.\nThe visit  is clearly not worth it. There are many other modernist monuments in Barcelona that are much better!", "publishedDate": "2019-09-28", "language": "en", "rating": 1}, {"id": 710760871, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d2485623-r710760871-Casa_de_les_Punxes-Barcelona_Catalonia.html", "text": "The videos were fine, to learn about a local beloved saint, but after the first 3 it's lame. Then the rest of the tour is super lame. Rooftop and turrets were a waste of time. There's better museums out there. ", "publishedDate": "2019-09-17", "language": "en", "rating": 2}, {"id": 692823791, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d2485623-r692823791-Casa_de_les_Punxes-Barcelona_Catalonia.html", "text": "Barcelona is not only Gaudy but it’s also la casa de les punxes. A beautiful building with a interactive visit. ", "publishedDate": "2019-07-26", "language": "en", "rating": 5}, {"id": 690449164, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d2485623-r690449164-Casa_de_les_Punxes-Barcelona_Catalonia.html", "text": "The Casa de les Punxes or Casa Terradas was designed by the modernist architect Josep Puig i Cadafalch. It is located at the intersection between the streets of Rosselló, Bruc and the Avinguda Diagonal in the Eixample area. In 1905, Bartomeu Terradas Brutau commissioned Josep to design a house for each of his three sisters, Angela, Josefa and Rosa. The result was a building reminiscent of old medieval castles, with elements of different architectural trends and various technical innovations, with six pointed towers (crowned by conical spikes). This spectacular building is one of the most emblematic of the city, representative of the Catalan Modernism movement. Another interesting example of great architecture.", "publishedDate": "2019-07-17", "language": "en", "rating": 4}, {"id": 689537923, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d2485623-r689537923-Casa_de_les_Punxes-Barcelona_Catalonia.html", "text": "Having been to several Antoni Gaudi designed buildings such as Casa Mila, Batllo, Vicens etc as well as house museums built in Catalan Modernism such as Casa Lleó Morera, I was looking forward to Casa de les Punxes and expecting a similar experience.\n\nI wish I’d read the reviews before paying for the ticket to visit Casa de les Punxes. In my opinion, the tour is over-engineered and with unnecessarily technology driven video tour history lesson which isn't really about the house. Don’t get me wrong, the house is beautiful and looks like a fairytale castle from the outside and the inside is familiar to anyone who has seen Casa Mila or Casa Batllo or any elaborate examples of Catalan Modernism in Barcelona. The difference is that in the other places, you got to explore and admire the rooms with an audio guide that provides better information.\n\nThe tour of the roof was magnificent though as was the views. I still think the museum is worth visiting though as the imagination that went into this building is comparable to any of the monumental work of Catalan Modernism.", "publishedDate": "2019-07-14", "language": "en", "rating": 4}, {"id": 688640207, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d2485623-r688640207-Casa_de_les_Punxes-Barcelona_Catalonia.html", "text": "Unless you are brainless creature living on the North Pole, don't go. It is a rip-off. You cannot visit without audioguide. You cannot set the pace of your visit. You are being herded through automatically opening and closing door, literally fu..ing freezing in there. Although it was very hot outside, this A/C was unhealthily too much. The first 20 minutes of the visit are dedicated to the legend of st. George. All cartoon- and fairy tale-like. Next part is dedicated to the history of the house, which was why we came in the first place. Couple of panels, no furniture...When we said we are not paying 13 euros, they immediately offered discount. Even for 9.45 is was not worth is.", "publishedDate": "2019-07-11", "language": "en", "rating": 1}, {"id": 688426805, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d2485623-r688426805-Casa_de_les_Punxes-Barcelona_Catalonia.html", "text": "I visited with young teens on a personal recommendation and cannot believe that this “House of Spikes” is not higher in the list of “must sees” in Barcelona, especially for people with children. The interactive “fish floor” is fabulous, the immersive story of St George / Jordi is so well done and the opportunity to walk through the rooms, walk across the roof and climb spiral staircases into the roofs of the towers and learn about the architecture is lovely. It is all beautifully done. \n\nThe audio guide is free and you do need it. It works automatically, depending on which room you are in and I would recommend it. \n\nThe only request I would have would be for some information about the three sisters - we learn their names and it would be good to know whether they had any input in the design of these extraordinary buildings and if they ever lived and raised families here.", "publishedDate": "2019-07-10", "language": "en", "rating": 5}, {"id": 687049634, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d2485623-r687049634-Casa_de_les_Punxes-Barcelona_Catalonia.html", "text": "The building is impressive on the outside but the audioguided tour is not what I have expected.\nInstead of seing the interior design, vintage furniture, the interior is more appropiate for a child as it is a immersive experience relating to the story of Saint George and the dragon. Lesser information is presented about the house and the 3 sisters that lived there.\nI don't recommend the tour for adults unless accompanied by kids for which I think this experience would be more suited.", "publishedDate": "2019-07-05", "language": "en", "rating": 2}, {"id": 681270211, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d2485623-r681270211-Casa_de_les_Punxes-Barcelona_Catalonia.html", "text": "St Jordi is a big thing in Catalonia. He represents the Catalan bid for recognition and independence from Spain. The metaphor is of course, pitching your strength and will against a larger more powerful adversary and the dragon in the amazing audiovisual presentation is exactly that!\n\nQuite apart from the fact that the house itself is just delicious - all fairytale turrets and tricky places, the audio visual presentation takes up a whole floor and covers multiple rooms. Princesses, Dragons and Shining Knights. What more could you ask for? \n\nIt is a pity, however, that inside the house itself takes second place to this overwhelming and clever presentation. I did enjoy it - it is quite sensational but I wish it had been housed elsewhere so that the true glory and quirkiness of the house could be explored.\n\nYou need the audioguide. It's free. I just walked in off the street; no skip the line required.", "publishedDate": "2019-06-13", "language": "en", "rating": 5}, {"id": 677566570, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d2485623-r677566570-Casa_de_les_Punxes-Barcelona_Catalonia.html", "text": "Casa de les Punxes is quite an architecturally impressive building. We did not get to visit the interior of this building but only managed to have a look from the outside. Those pointed towers are really something; they give the building its unique character. Worth a stop if you are in the vicinity. There plenty of shops in the area.", "publishedDate": "2019-05-30", "language": "en", "rating": 4}, {"id": 672810872, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d2485623-r672810872-Casa_de_les_Punxes-Barcelona_Catalonia.html", "text": "We really enjoyed Casa de les Punxes. The history was fascinating as was the story of St Jorge and the dragon.  ", "publishedDate": "2019-05-09", "language": "en", "rating": 4}, {"id": 672444971, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d2485623-r672444971-Casa_de_les_Punxes-Barcelona_Catalonia.html", "text": "We fitted in Casa de Les Punxes in between Casa Batlo and Casa mia La Pedrera.I enjoyed the experience but was never going to surpass some of Gaudi's finest work in the other 2 buildings.I had a discounted tickets bought beforehand from an online retailer so this attraction cost me just £14 for 2 tickets.For this price it is well worth the entry fee.\nBasically,this tourist attraction is half interactive movie and half museum.In the first half you follow the audio guide,which takes you from room to room with full video in each room.When we went we were the only ones there so it was a bit like having our own private cinema.With the St George and the Dragon movie playing in the background.The roof Terrace is particularly good with 5 Towers to scale each one with something different inside.You get some nice views from the Roof Terrace and it provides you with some good photo opportunities.\nYou need to be quick on your feet though while going through the interactive movie bit.We nearly missed moving through the next room on this guided tour as the doors nearly closed on us before we had proceeded to the next room.\nWe enjoyed our visit to this tourist attraction.", "publishedDate": "2019-05-08", "language": "en", "rating": 4}, {"id": 660892777, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d2485623-r660892777-Casa_de_les_Punxes-Barcelona_Catalonia.html", "text": "We felt a bit cheated having paid £13.50 each for an audio guide which did little to explain anything other than the well known myth of George and the dragon. Both of our audio guides stopped working part way through so we couldn’t even listen to all of it. \n\nThere’s very little to see inside the house. Even the roof had little to offer - a few interactive things which might have been ok for children but not very accessible given the spiral staircases. \n\nDisappointing. Just have a look at the architecture from the outside and save your money. ", "publishedDate": "2019-03-24", "language": "en", "rating": 2}, {"id": 660343440, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d2485623-r660343440-Casa_de_les_Punxes-Barcelona_Catalonia.html", "text": "Visited here today. Of all the places that I visited, this would not be the top choice. I felt like half of the visit was about dragons and for 6 days I have already heard the myths and legends, so another was not on the top of my list. They spent most of the tour talking about it. You reallocate get to see soooooooo little of the house and thou the roof is interesting and has views and information it is not worth a visit, way to little info on the house or architecture and not enough of the house to see. I was bored from the beginning and I love house tours and architecture . They need to spend less money on dragons an open up more of the house or reduce the costs.", "publishedDate": "2019-03-22", "language": "en", "rating": 3}, {"id": 657146821, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d2485623-r657146821-Casa_de_les_Punxes-Barcelona_Catalonia.html", "text": "Good overview of a non Gaudí Barcelona building. Good value for money and views from the rooftop. Audio/visual experience was fun and good for kids, but don’t expect a historic designed interior like Casa Batlló! ", "publishedDate": "2019-03-08", "language": "en", "rating": 3}, {"id": 650127688, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d2485623-r650127688-Casa_de_les_Punxes-Barcelona_Catalonia.html", "text": "This is a imaginatively and richly decorated building that looks unlike any other from the outside, particularly with its several striking towers.  We fully expected the interiors to live up to the high expectations given by the outside.  Save your money!  There is very little to see inside the building and we regretted paying the admission fee.  The entire first floor featured a \"sound-and-light\"- type show about St George (the patron saint of Barcelona), more suited for children than adults.  We were told to next go up to the roof, where you can enter the 5 towers, which are basically empty shells.  And then the visit was over -- there were no original rooms to visit, no interior decoration, no furnishings.  We felt totally cheated, compared to our experiences visiting other modernist buildings like Palau Guell, Casa Battlo, La Pedrera, etc.  Enjoy Cadafalch´s vivid imagination from the street but don´t pay to see the interiors.", "publishedDate": "2019-02-04", "language": "en", "rating": 2}, {"id": 647233251, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d2485623-r647233251-Casa_de_les_Punxes-Barcelona_Catalonia.html", "text": "This is absolutely a beautiful and artistic building---very interesting history, but if your time is limited this would not be my first recommendation to spend your time on. We had a couple of weeks and ended going in, and enjoyed our visit, but I think overall it was a bit underwhelming.", "publishedDate": "2019-01-20", "language": "en", "rating": 3}, {"id": 645722752, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d2485623-r645722752-Casa_de_les_Punxes-Barcelona_Catalonia.html", "text": "This building opened in the past 18 month and is the work architect contemporary of Gaudi. Unfortunately, although the shape, ceilings and floors of the rooms you travel through are original the space is little more an exhibition space then a house tour. That said, it provides a nice history of Saint George and the dragon in a well-done series of rooms and displays. The highlight was the roof Area where you could see some of the original work. It was fun looking at other places from the roof. While this would not be the house to go to on your first visit to Barcelona if you visited some of the more famous ones this is a nice spot to visit.", "publishedDate": "2019-01-14", "language": "en", "rating": 4}, {"id": 643523719, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d2485623-r643523719-Casa_de_les_Punxes-Barcelona_Catalonia.html", "text": "This is yet another wonderful building to look at from the outside as it now houses companies within it so there is nothing to see inside. It is worth viewing as you can get some lovely external photos but it's architecture is somewhat undermined by shops beneath it.", "publishedDate": "2019-01-04", "language": "en", "rating": 4}, {"id": 635629398, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d2485623-r635629398-Casa_de_les_Punxes-Barcelona_Catalonia.html", "text": "We did this because we were low on time and it was near the hotel. We didn't expect it to be so much fun! Informative about the building, the architect and Barcelona, the interactive audio tour and videos were brilliant and very impressive.", "publishedDate": "2018-11-25", "language": "en", "rating": 4}, {"id": 635432502, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d2485623-r635432502-Casa_de_les_Punxes-Barcelona_Catalonia.html", "text": "A \"large Gothic castle\" standing in the middle of Barcelona's Avinguda Diagonal catches the eye of any visitor to the city. The \"Casa de les Punxes\" (House of Spikes) is really a residential block built in the shape of medieval castle which is one of the most recognisable modernista landmarks on the Barcelona skyline. The exterior delights anyone who goes to take a closer look. The brickwork on the façade blends with the wrought-iron on the balconies", "publishedDate": "2018-11-24", "language": "en", "rating": 5}, {"id": 634657237, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d2485623-r634657237-Casa_de_les_Punxes-Barcelona_Catalonia.html", "text": "I live in the city and was excited to see the inside of this residence.  \nBoy..what a disappointment.  \n\nI thought I was going on a house tour, but instead was shuffled to a few different rooms to watch a 'movie' about the legend of Saint Jordi.   \nAfter the movie, you get to go up to the rooftop which is now nothing but a party reception area.   The views are not anything great:  you are up 4 stories and are surrounded by residential apartments.  \n\nI cannot believe we spent 12.50 each.   At least I know not to recommend it to any friends/family visiting the city.  \n\nSave your money, enjoy the beauty from the outside and see one of the other famous houses in the city...where you actually get to see the house, and not a movie aimed for 10 year olds and a rooftop terrace.  \nSo disappointing....\nThe photos in the website show a grand staircase - I don't know where that was as we never got to see it.", "publishedDate": "2018-11-20", "language": "en", "rating": 1}, {"id": 633655824, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d2485623-r633655824-Casa_de_les_Punxes-Barcelona_Catalonia.html", "text": "Very beautiful experience, a little spooky but worth it. The terrace has a beautiful view of the city.", "publishedDate": "2018-11-15", "language": "en", "rating": 4}, {"id": 632420484, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d2485623-r632420484-Casa_de_les_Punxes-Barcelona_Catalonia.html", "text": "Don't spend money on this!\n\nThere is hardly anything to see there. The house is really interesting, but you see pretty much all that's interesting about it from the outside, for free. Inside, the parts of the casa that are open to tourists are extremely boring, it's just a regular flat with white walls and literally not a single interesting architectural feature. The view from the roof is ok, the roof itself and the towers are a bit meh.\n\nThe exhibition features a lot of information about the architects, but fails to inspire. There is too much detail and none of it is very interesting.\n\nThe Saint George exhibition is particularly dull - they spent a lot of money on high tech interactive stuff, but all it does is tell a really boring and generic version of the legend, with a knight in shiny armour saving a princess from a dragon. Wow, never heard that one before. The whole thing seems like it's put in there just to fill the otherwise empty space.\n\nI really wish I could get my money back - the only part that was interesting, the outside, is free to see anyway.", "publishedDate": "2018-11-10", "language": "en", "rating": 2}, {"id": 630084348, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d2485623-r630084348-Casa_de_les_Punxes-Barcelona_Catalonia.html", "text": "One of my favorite experiences in Barcelona.  Completely unexpected interactive tour and amazing rooftop architecture and views.  I never saw another person during my 45 minute tour.  If you are looking for something different and away from the crowds, I highly recommend Casa de les Punxes.", "publishedDate": "2018-11-01", "language": "en", "rating": 5}, {"id": 626524251, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d2485623-r626524251-Casa_de_les_Punxes-Barcelona_Catalonia.html", "text": "You learn quite a bit about the history of the former inhabitants of the house, also a bit about the former style of the house. A lot of time is spent watching movie sections about the legend of Sant Jordi (St George), the national saint of Catalonia. You have to follow the tour step by step. The doors only open after each little movie section is finished, so it could become a bit tiresome after a while. There is though not that much to see in the house itself concerning the architecture. The roof terrace is nice, but that's it.", "publishedDate": "2018-10-19", "language": "en", "rating": 3}, {"id": 623549257, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d2485623-r623549257-Casa_de_les_Punxes-Barcelona_Catalonia.html", "text": "Casa De Les Punxes was an absolutely amazing and unique looking building that we chanced upon as we were wandering around the eclectic and vibrant Barrio De Gracia neighbourhood. \nI never ventured in,didn't know if you could but I thought the building looked amazing ,the towers look fantastic, look like castle towers ,I stopped and took some photos of this beautiful building,it impressed me that much.\nCasa De Les Punxes is a building that I am so glad we chanced upon, it's easy to locate on Avenida Diagonal. \nWell worth seeking out.", "publishedDate": "2018-10-09", "language": "en", "rating": 5}, {"id": 615753453, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d2485623-r615753453-Casa_de_les_Punxes-Barcelona_Catalonia.html", "text": "Casa de les Punxes is an impressive building.\nIt is made by Jose Puig i Cadafalch in 1905.\nHe was a famous modernist architect, who made many buildings in Barcelona, among them the well-known Casa Amatller.\nCasa de les Punxes is located in the triangle between Avinguda Diagonal, Carrer del Rosselló and Carrer del Bruc, 250 meter east of Metro-station Diagonal.\nCasa de les Punxes is open every day from 10 am to 07 pm.", "publishedDate": "2018-09-11", "language": "en", "rating": 4}, {"id": 609841314, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d2485623-r609841314-Casa_de_les_Punxes-Barcelona_Catalonia.html", "text": "One of the members of our party spotted this attraction and thought we should visit. I would not have visited this unassuming place if it wasn't for them and am so happy to have done so. The video AMD audio presentations are very well done, with great story telling and historical references. You can explore the rooftop on your own at the end of the tour. There are also weekly nighttime events during the summer to enjoy.", "publishedDate": "2018-08-24", "language": "en", "rating": 5}, {"id": 604049906, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d2485623-r604049906-Casa_de_les_Punxes-Barcelona_Catalonia.html", "text": "Casa de les Punxes is a beautiful modernistic building created by the catalan architect Josep Puig i Cadafalch. The house (la casa) isn’t fully decorated but it is equiped with fantastic audiovisuals. The audioguide, which is included in the price, is available in ten lenguages. The best part of the audioguide is that it starts automatically depending on your location in the house. My favorite part of the house is the interactive multimedia tour on the first floor, depicting the legend of Saint George. I absolutely loved it. Furthermore you can discover a lot about the architect Josep Puig i Cadafalch through exhibitions and introductions inside the rooftop towers. On the groundfloor you find a nice shop. I really loved my visit of Casa de les Punxes.", "publishedDate": "2018-08-07", "language": "en", "rating": 4}, {"id": 603605287, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d2485623-r603605287-Casa_de_les_Punxes-Barcelona_Catalonia.html", "text": "Take the audio tour and walk from room to room. Very cool and interesting history. Then enjoy a complimentary drink on the rooftop.", "publishedDate": "2018-08-06", "language": "en", "rating": 4}, {"id": 603383043, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d2485623-r603383043-Casa_de_les_Punxes-Barcelona_Catalonia.html", "text": "I came across this by walking by. Casa de les Punxes has only opened for visits a couple of years ago, so it's not quite as well known yet. The exterior of the house is magnificent. Inside you have an installation on the 1st floor that tells the visitor the tale of Sant Jordi. I think it is very well made and I was happy to experience the story in a very interesting way. You then move to a stunning rooftop terrace with an amazing view and have some more information about the house, its design and architecture in the towers.\n\nDo not expect a history and architecture lesson. While it comprises general information, it doesn't go into too much detail, but it warrants for an entertaining, light-weight vist of 1 to 2 hours and was one of the hidden gems I came across.\nI thoroughly enjoyed the experience and would like to thank the friendly staff.", "publishedDate": "2018-08-06", "language": "en", "rating": 5}, {"id": 596351056, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d2485623-r596351056-Casa_de_les_Punxes-Barcelona_Catalonia.html", "text": "This is genuinely one of my favourite attractions in Barcelona and it is hidden in plain sight on Av. Diagonal.\n\nInside and out, this is an immaculately presented building by a lesser-known modernism architect with an amazing audio-visual tour. \n\nThe tour starts off with some brilliant projections explaining the tale of Saint George, Catalunya's patron saint and one whose influence is felt throughout the house. You move from room to room and watch a fantastically presented (and seemingly high-budget) dramatisation of the story before the tour then explains how this influences the design and architecture of the house.\n\nI was worried at first that it might be a bit too 'theme-parky', but once the story is told, you can enjoy the house at your own pace and take in the details. Whether you look up or down, there are so many details from the beautiful tiles to the ornate ceilings.\n\nThe audio tour automatically plays when you enter each room, but it never overwhelms and you can also read the info boards and play interactive exhibits while enjoying the house.\n\nYou then get a lift up to one of my favourite rooftops in Barcelona. It might not have Gaudi's witch-scarers, but it has wonderful views of a (surprisingly green) Diagonal and you can go into all the different turrets, inside each is an interactive exhibit. Whether it's laying down on a sofa watching projections on the ceiling or just sitting down and watching the world go by through the floor-to-ceiling windows, it's just wonderful. You also get an appreciation for the architectural details and can see the supporting structures of the roofs and suspended floors.\n\nThis is genuinely one of the best presented, most beautiful examples of modernism in Barcelona. It's also great value costing half as much as Casa Batllo which - as much as I love - is really overpriced.", "publishedDate": "2018-07-15", "language": "en", "rating": 5}, {"id": 591713215, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d2485623-r591713215-Casa_de_les_Punxes-Barcelona_Catalonia.html", "text": "I was totally taken by surprise by the magnificence of Casa de les Punxes. If you are in Barcelona, you must give it a visit. It was designed by Josep Puig i Cadafalch (yep, Gaudi wasn't the only architect in Barcelona). \nI suggest you reach early in the morning to check it out, the first 15-20 mins of the storytelling on projected screens will take your breath away. You also get access to the rooftop, where you can climb up inside those spires and even touch the material used to build this Casa. Superb. ", "publishedDate": "2018-06-29", "language": "en", "rating": 5}, {"id": 586617711, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d2485623-r586617711-Casa_de_les_Punxes-Barcelona_Catalonia.html", "text": "This is one of Barcelona's lovliest architectural gems. It was whimsically designed around the uniquely Catalonian theme of heroic St. George, the Dragonslayer. We were roaming around the modernista area when we spotted the building and we're delighted to find it open to the public. But not JUST open to the public in the usual museum like fashion. Visitors find themselves in a sophisticated, Disneyesque entertainment venue that tells the tale of St George along with details about the building and the family that lived there.\n\nThis site DEFINITELY belongs on the  itinerary of anyone interested in Barcelona history and architecture.\n", "publishedDate": "2018-06-11", "language": "en", "rating": 5}, {"id": 586474722, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d2485623-r586474722-Casa_de_les_Punxes-Barcelona_Catalonia.html", "text": "Absolutely one of the most refreshing experiences ive had in any museum or gallery in a a very long time.\nThe use of technology to tell a story and divide the crowds made the tour perfect and would recommend it to all.", "publishedDate": "2018-06-10", "language": "en", "rating": 5}, {"id": 585389879, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d2485623-r585389879-Casa_de_les_Punxes-Barcelona_Catalonia.html", "text": "This castle-like building is off the beaten path. Not on Passeig de Gracia, this lovely place does not have the tourist crowd. Not sure if it is open to the public.", "publishedDate": "2018-06-05", "language": "en", "rating": 5}, {"id": 584597384, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d2485623-r584597384-Casa_de_les_Punxes-Barcelona_Catalonia.html", "text": "Beautiful architecture and interesting history. The interactive audio guide is great. My kids, 3, 6, & 9 years were very entertained and love the history of Sant Jordi and the interactive videos. The interior is beautifully restored and looks to be all original work--the floor tiles and stained glass are amazing and in great condition. No signs of age to the 100+ year old building.  The roof is like a maze and has many different sections within each tower. I will definitely bring family and guests here again for a visit.", "publishedDate": "2018-06-02", "language": "en", "rating": 5}, {"id": 582918891, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d2485623-r582918891-Casa_de_les_Punxes-Barcelona_Catalonia.html", "text": "What a gem, lovely house, building with very interesting history, brilliant interactive exhibits for all ages, wonderful roof top views, enough to see that I could easily visit again", "publishedDate": "2018-05-26", "language": "en", "rating": 5}, {"id": 581184903, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d2485623-r581184903-Casa_de_les_Punxes-Barcelona_Catalonia.html", "text": "What started as a walk through the neighbourhood ended with a visit to this stunning building. We loved this history, the ode to St George, the romance and whimsy of the design, and the technology of the tour. I would recommend this to anyone. I'm so happy that on my 5th visit to Barcelona I have found this. It will be one of my greatest Barcelona memories.", "publishedDate": "2018-05-19", "language": "en", "rating": 5}, {"id": 580470748, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d2485623-r580470748-Casa_de_les_Punxes-Barcelona_Catalonia.html", "text": "Beyond happy!!! that I accidentally walked into this beautiful place. I’d expect such a creative spot to be more popularized.... So.. I’m walking down the street, waiting for my guide to arrive to see Gaudi’s Sagrada Familia... \nThis place took my breath away by the taste, the quintessence of history & modern art & technology! \nSimple story of Saint Gorgeous is told in such a cool, mysterious way! You walk in the dark room, the doors are closed automatically & there’s only you & the mystery of the legend, shown to you on super advanced LED screens. \nI was pretty much psyched! Strongly recommend! After all - you can relax on the roof top that kept its incident look, walk into cute, private terrace of the main tower that opens a view to the city. \nLove, love, love! \n\nP.s. I’m not a “review kinda person”, but this definitely is the spot! Just the right amount of history, modern art & exclusivity ! ", "publishedDate": "2018-05-15", "language": "en", "rating": 5}, {"id": 572806480, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d2485623-r572806480-Casa_de_les_Punxes-Barcelona_Catalonia.html", "text": "The staff were incredibly helpful and the technology used in the tour was brilliant.  There is an entire floor linked to St George, which, while being well done and interesting, only linked really tenuously to the actual building itself.  We learned very little of the history of the house in the first half of the tour.  \n\nAfter the CGI start, we then got the chance to look around the empty house with its decorative features.  A lovely house and a very well put together museum that deserves to have more visitors. The rooftop has 5 towers, each with some information about the architect, the style etc and some curious visual presentations.", "publishedDate": "2018-04-12", "language": "en", "rating": 3}, {"id": 572214254, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d2485623-r572214254-Casa_de_les_Punxes-Barcelona_Catalonia.html", "text": "So this is a weird one to comment. The building is a pearl within the city of Barcelona, clearly not as popular as Casa Batlo or La Pedrera. Outside you see a clear exemple of the same architecture as what Gaudi made but Cadalfach got his inspiration with the Legend of St George and the Dragon. And this is where Smaug comes to visit the review. When you enter the building you get a audioguide and are led to a room with a video explaining this forementioned legend. (Even the music reminds of the Hobbit movie) once you’ve sat throught that movie you can finally start enjoying the building (tiles, interactive screens...) and then there’s the rooftop! The building is worth a visit but you have to go through the video first (a tip for this: put more benches during the video)\n", "publishedDate": "2018-04-09", "language": "en", "rating": 3}, {"id": 568402530, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d2485623-r568402530-Casa_de_les_Punxes-Barcelona_Catalonia.html", "text": "great audio visual about ST George but disappointed that you see little of the internals of the original building.", "publishedDate": "2018-03-24", "language": "en", "rating": 4}, {"id": 566209037, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d2485623-r566209037-Casa_de_les_Punxes-Barcelona_Catalonia.html", "text": "Puig i Cadafalch is another important architect and designer of the Catalan modernista movement. I am impressed by his works (buildings and furniture). I did not have enough time to visit this place last year while in Barcelona, so decided to go this time.\nI got a 10% off from another source for the entrance ticket (audio guide included). The museum uses the dragon theme to highlight the importance of Saint George and the dragon in the Catalan modernista movement. The exterior and facade of the building is full of intricate design details, tile works and wrought iron works. The audioguide takes you from room to room. There are panels to do the explanations of the design details and videos to show old photos of the building and the neighborhood. The exhibition rooms on the roof give details of Puig i Cadafalch and his architecture/design style.\nRecommended if you are interested in getting to know works of the masters of the Catalan modernista movement, other than those of Gaudi's.", "publishedDate": "2018-03-13", "language": "en", "rating": 5}, {"id": 565717733, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d2485623-r565717733-Casa_de_les_Punxes-Barcelona_Catalonia.html", "text": "Completed in 1905, Casa de les Punxes (House of Spikes) is a modernist building on a triangular site in Barcelona noted for resembling a medieval castle. It is located at the intersection of Avinguda Diagonal, Carrer Rosselló, and Carrer Bruc. Àngela Brutau, widow of Bartolomeu Terradas i Mont (a well-known textile and farming businessman), commissioned Puig i Cadafalch to design the house for her deceased husband’s three daughters (Àngela, Josefa, and Rosa). Originally three separate buildings, the medieval-inspired Casa de les Punxes features six towers topped by conical needles. The former apartment block (now an office building) was declared a national monument in 1976. The house has been open to the public since 2016. Visits take in its stained-glass windows, iron staircase, and rooftop. Guided tours take one hour and depart at 4:00 in the afternoon. Tickets cost €20 for adults and €17 for children.", "publishedDate": "2018-03-10", "language": "en", "rating": 3}, {"id": 565103957, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d2485623-r565103957-Casa_de_les_Punxes-Barcelona_Catalonia.html", "text": "The title speaks for itself, however it was a little disappointing for the fact that you don’t have pictures or visit on what would be inside the house at the time the sisters lived there.", "publishedDate": "2018-03-07", "language": "en", "rating": 4}, {"id": 559168966, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d2485623-r559168966-Casa_de_les_Punxes-Barcelona_Catalonia.html", "text": "We stopped off here on a rainy Monday. We weren't to sure what to expect.\nThe St George part of the tour was done really well, and i can image that children would really enjoy this. The second part of the tour about the house was interesting, as someone that doesn't know that much about architecture.\nThe staff were really helpful. The downside was that the top tower wasn't open, lucky the roof was, even though it was rainy, as other sites were closed.", "publishedDate": "2018-02-08", "language": "en", "rating": 5}, {"id": 543581202, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d2485623-r543581202-Casa_de_les_Punxes-Barcelona_Catalonia.html", "text": "I have visited all of Gaudi's houses and creations so I wanted to find another historical home to visit. Discovered the Casa de les Punxes just a bit further along from the main strip of houses in passeig de gracia. There were no queues and in fact I think I was the only person there. Bought a ticket for 12,50 euros which included headphones and a guided tour. Not much of the original interior to see but it was an interesting tour although a bit claustrophic as doors close behind you automatically on entering rooms and whilst watching the videos and you are in darkness! Not much to see on the rooftop either but there was a bar and some nice seating areas which are probably used during summer months.", "publishedDate": "2017-11-27", "language": "en", "rating": 5}, {"id": 543041427, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d2485623-r543041427-Casa_de_les_Punxes-Barcelona_Catalonia.html", "text": "The architect Josep Puig was commissioned to design a building for 3 sisters of a very well to do family.  The architect created a very unique project with a medieval feel, seamlessly blending the three buildings to look like one house that occupied an entire block.  Since the three owners of the house died childless, the building was taken over by his brother.  In 1975 the building was declared a national Historic Monument and in 1976 a cultural asset of National Interest.  Currently, the house is privately owned. The self guided tour we took was only in a few of the rooms but there was both audio and video presentations of the story of St. George and the dragon he slayed.  \n  \nPuig's design broke with the building tradition that had dominated so far. He did not use the traditional load-bearing walls but instead replaced them by cast iron pillars and metal beams on the ground floor, which provided an airy feel to the space.  The rooftop was probably the most interesting area, at least to me.  On the roof of the house there are six towers that grant the popular name of Casa de les Punxes.  The roof is an open space plan. The largest tower, occupying the corner of Avinguda Diagonal with Carrer Rosselló, contains three levels and offers a privileged view of the city.  On the roof there are 6 towers each with a unique a beautiful mural.  \n\nMy only disappointment was that we were not able to tour the entire house.", "publishedDate": "2017-11-24", "language": "en", "rating": 4}, {"id": 539401960, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d2485623-r539401960-Casa_de_les_Punxes-Barcelona_Catalonia.html", "text": "I wouldn't recommend this tour if you're interested in the building, is more for learning about catalán traditions and history. As an architect I would say is too expensive for the exhibition  and not interesting compared to other buildings. ", "publishedDate": "2017-11-08", "language": "en", "rating": 2}, {"id": 539001883, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d2485623-r539001883-Casa_de_les_Punxes-Barcelona_Catalonia.html", "text": "I was there for a corporate event with drinks, canapes and live music.  The rooftop is stunning as are the views and the architecture can be stared at for hours.\n\nService provided by the waiting team was great.", "publishedDate": "2017-11-06", "language": "en", "rating": 5}, {"id": 530361707, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d2485623-r530361707-Casa_de_les_Punxes-Barcelona_Catalonia.html", "text": "The architect was a follower of Gaudi and designed the building as 3 townhouses for 3 sisters.  But the \"tour\" is a cheesy film that moves you from unfurnished, renovated room to the next as if it's high art to have a slide show about the legend/myth of St. George.  And the roof is not much.  Glad we we're nearby and this was a \"filler\" for us at the end of a 5 day visit but I would have been very disappointed if we had sacrificed time to see this site!  Plus, it's not cheap.", "publishedDate": "2017-10-05", "language": "en", "rating": 3}, {"id": 525015338, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d2485623-r525015338-Casa_de_les_Punxes-Barcelona_Catalonia.html", "text": "Beautiful example of Modernista architecture well-displayed on the broad Diagonal avenue with a park in the middle.  So good for taking photos.  Stroll around this neighborhood which is full of surprises.", "publishedDate": "2017-09-16", "language": "en", "rating": 4}, {"id": 523033234, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d2485623-r523033234-Casa_de_les_Punxes-Barcelona_Catalonia.html", "text": "This lovely house is worth a visit. A tour through the house reveals the history of St George and the evolution of the building. As you move from room to room the video and audio are brilliant I'm not going to say much about this as I wouldn't want to spoil it \nAfter going through the house you can move up to the roof terrace and visit each of the towers. \nWorth spending an hour or so at this place", "publishedDate": "2017-09-10", "language": "en", "rating": 5}, {"id": 517559469, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d2485623-r517559469-Casa_de_les_Punxes-Barcelona_Catalonia.html", "text": "House of Spikes designed by architect Cadafalch, a modernest architect with a medieval Gothic feel in the diagonal area HOWEVER! on the first Friday [at least during the summer] a dance group Swingcats performs on the roof top...adult beverages/a few munchies are available during the dance performances of the lindy hop, charleston, jazz etc dancing...great time spent prior going out for dinner...massive surprise for this unusual activity...the house, exterior design is a must see\n", "publishedDate": "2017-08-25", "language": "en", "rating": 4}, {"id": 515326328, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d2485623-r515326328-Casa_de_les_Punxes-Barcelona_Catalonia.html", "text": "This house hasn't been open to the public for very long.  It is an audio guided tour but it is timed.  The first 20 minutes or so are spent learning about Saint George through various videos that are a bit cheesy and drawn out.  Then a bit of time is spent on the history of the house.  You go the roof and look around but the info up there is a repeat of everything you heard down stairs.\n\nI'm glad I went but it was a bit boring and not worth the 12.50 euros.  Less about St. George and more about the house please!", "publishedDate": "2017-08-19", "language": "en", "rating": 3}, {"id": 507567368, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d2485623-r507567368-Casa_de_les_Punxes-Barcelona_Catalonia.html", "text": "Part of Casa de Les Punxes has been renovated in recent years and is only accessible to the public for the past year so I have been very eager to visit.  The building stands on its own on Avinguda Diagonal and is reminiscent of romantic germanic revival architecture.  Most of the building is inhabited by law firms so you can only visit a portion of the property, but I would encourage you to walk around the outside of the building too as you can take peeks at the other ornate entrances with their old world lifts and beautiful decorated tiles.\n\nThe museum itself contains an audiovisual display explaining the legend of Saint George, who is also patron of Catalonia and called Sant Jordi.  The audiovisuals are cleverly done and it's interesting to hear the tale of Saint George recounted.  There are further explanations regarding the Terrades family who once lived in the house and the architect Josep Puig i Cadafalch whose 150th anniversary is this year.  The roof terrace is also accessible but in general the museum could have included more interior elements to reflect the golden age of modernism.\n\nThis is certainly worth a look for any architecture enthusiasts and the outside of the building has many photo moments.", "publishedDate": "2017-07-31", "language": "en", "rating": 4}, {"id": 505985464, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d2485623-r505985464-Casa_de_les_Punxes-Barcelona_Catalonia.html", "text": "We learned about Casa de les Punxes in the last minute before this summer trip and decided to give it a try especially since this year is the anniversary of its architect, Josep Puig i Cadafalch. We found no lines, an interesting sant Jordi presentation and interactive explorations… inside the house and especially in the conical towers on the roof… these were a lot of fun and learning for kids!", "publishedDate": "2017-07-26", "language": "en", "rating": 5}, {"id": 505190271, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d2485623-r505190271-Casa_de_les_Punxes-Barcelona_Catalonia.html", "text": "The Casa Terrades \"Les Punxes\" was advised to us by our receptionist, we were pleasantly suprised by it. The visit is guided by a headphone which works automically, meaning that you don't have to do anything yourself except walking. The way in which the story at the start is shown is very original in a good way, and afterwards the rooftop has great views.", "publishedDate": "2017-07-24", "language": "en", "rating": 4}, {"id": 504684169, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d2485623-r504684169-Casa_de_les_Punxes-Barcelona_Catalonia.html", "text": "La Casa de les Punxes is a very beautiful modernist building located in Diagonal Avenue, near Passeig de Gracia, in the center of Barcelona. It has been opened to the públic only some months ago. The name is due to towers of the building. If you like the modernisme, it is a very nice exemple of it. You can enter to some rooms (other rooms are private) and see how rich people lived in the early 20th century. Pitifully there are not furniture, only empty rooms. For me, the best place of the guided visit (only it is possible to visit the house with a guided vidit) is the upper terrace, from where you can see very beautiful views of Barcelona and learn about modernisme, the architect and the history of the house in some little expositions. Also you can see a beautiful exposition about the legend of Holy George inside the building. Fantastic for modernisme lovers.", "publishedDate": "2017-07-23", "language": "en", "rating": 4}, {"id": 499197242, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d2485623-r499197242-Casa_de_les_Punxes-Barcelona_Catalonia.html", "text": "It is not worth paying the ticket for listening to fairy tales and playing children interactive plays.", "publishedDate": "2017-07-06", "language": "en", "rating": 1}, {"id": 479821346, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d2485623-r479821346-Casa_de_les_Punxes-Barcelona_Catalonia.html", "text": "Not far from a couple of the Gaudi houses is this mansion topped with beautiful spires. A triumph of Barcelona's Modernisme, this recently opened building houses an interactive tour of the ground and first floors along with the terrace with lovely views and inside the spires (or \"peaks\" = Punxes). There's an elevator, too! A special bonus is to learn how the legend of St. George is woven into the fabric of this wonderful experience. You can get tickets online or right there. Enjoy!!", "publishedDate": "2017-04-28", "language": "en", "rating": 5}, {"id": 479372368, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d2485623-r479372368-Casa_de_les_Punxes-Barcelona_Catalonia.html", "text": "It`s OK, don't try to go inside unless you want to go to see the roof's views. They open to the public less than a year ago.", "publishedDate": "2017-04-26", "language": "en", "rating": 4}, {"id": 475364104, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d2485623-r475364104-Casa_de_les_Punxes-Barcelona_Catalonia.html", "text": "This building looks wonderful and really jumps out from the surrounding architecture. Didn't plan to see it, but it is on route from Sagrada Familia to La Pedrera.", "publishedDate": "2017-04-13", "language": "en", "rating": 4}, {"id": 473622816, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d2485623-r473622816-Casa_de_les_Punxes-Barcelona_Catalonia.html", "text": "Also known as Casa Terrades, the building was made by Puig i Cadafalch, and it is located in Avinguda Diagonal. \n\"Casa de les punxes\" in Catalan means \"House of spikes\", so it comes from the six towers crowned with spikes.\nIf you appreciate architecture, and especially Modernism, it is worth you pay a visit. In the end, you will have the opportunity to go up to the roof terrace where you'll have some views.\nYou have audio guides, so you can go at your own pace. \nReally recommendable.", "publishedDate": "2017-04-08", "language": "en", "rating": 4}, {"id": 473230834, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d2485623-r473230834-Casa_de_les_Punxes-Barcelona_Catalonia.html", "text": "This building is in an area filled with beautiful arcitecture, yet it still holds its own for its striking facade and pure attention to detail. Intricate cross on the side of the building really stands out. ", "publishedDate": "2017-04-06", "language": "en", "rating": 4}, {"id": 468690164, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d2485623-r468690164-Casa_de_les_Punxes-Barcelona_Catalonia.html", "text": "We came across this building on our tour, another influence of Gaudi but not as ornate as some others we saw.\n", "publishedDate": "2017-03-19", "language": "en", "rating": 4}, {"id": 468115162, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d2485623-r468115162-Casa_de_les_Punxes-Barcelona_Catalonia.html", "text": "I noticed the Casa de les Punxes while walking to other sites along the Avinguda di Diagonal, and after looking it up online decided to visit.\n\nI was greeted by very friendly staff who explained the fact that building is not furnished and that it was mostly an audio tour - this probably helped set my expectations. I also thought that €12.5 seems pretty reasonable compared to the prices for the Casa Batllo and Casa Mila.\n\nI can see that some reviewers didn't enjoy the video storytelling of St George. I, however, thought it was fun, if a little youthful. I wasn't aware that St George was Barcelona's patron saint before my visit, and enjoyed learning the history.\n\nThe other tour provided a wealth of information about the house and its architect, Puig i Cadafalch - whom I had never heard of previously. I also found the display boards interesting and informative.\n\nI should also mention the roof - wonderful to see the towers up close, and great to get so many views across the city. Also a nice sunny place to rest your legs!\n\nOverall, I really enjoyed my experience. I liked that it was fairly quiet, and that I could explore at my own pace. I thought the interior was beautiful, even unfurnished. I also thought that given the museum has been open less than a year, it's clear they are trying very hard to make the house interesting and worthwhile.\n\nThis will probably not be everyone's cup of tea, but I thoroughly enjoyed it and would recommend it as peaceful alternative to some of the Gaudi attractions.", "publishedDate": "2017-03-17", "language": "en", "rating": 4}, {"id": 467597867, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d2485623-r467597867-Casa_de_les_Punxes-Barcelona_Catalonia.html", "text": "If you want the same old typical architecture tour then by all means visit one of the dozen other sites in Barcelona. If you want a surprising, digital, interactive and fun walk through a quiet beautiful building with a great roof (views and relaxation etc) then go. Dont expect normal. Try something new...or dont.", "publishedDate": "2017-03-15", "language": "en", "rating": 5}, {"id": 462493146, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d2485623-r462493146-Casa_de_les_Punxes-Barcelona_Catalonia.html", "text": "Very clever audio visual presentation that you follow as you walk through various rooms. Interesting of the history of how the place was built and St George.  \nYou do get some great views from the roof top with more interesting information in each of the turrets.\nYou only see two levels - av floor and the roof. \nWhat was missing was any furniture, decorations, paintings etc. It would be greatly enhanced if you could have a scene/s on how people used the building to live in. They could learn from the National Trust on how to present historical buildings. \nAfter we walked around the exterior and found the entrances to the individual houses and they are stunning. Cute with each have a security person on duty thought this didn't stop us taking some great photos. \nOverall we did enjoy the experience and left us with a burning question. \nHow did St George get to be the patron saint for England?", "publishedDate": "2017-02-24", "language": "en", "rating": 4}, {"id": 457562115, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d2485623-r457562115-Casa_de_les_Punxes-Barcelona_Catalonia.html", "text": "Had low expectations of this, anticipating another sluggish traipse around poorly furnished rooms with uninspiring signage. \n\nThis was therefore a terrific surprise. A really fun adventure, with moments of jeopardy and surprise. Use of digital technology and drama was highly original and the journey through the urban castle highly entertaining. \n\nFantastic to explore the work of an architect who isn't Gaudi, in Barcelona (!), in such a winning fashion. ", "publishedDate": "2017-02-06", "language": "en", "rating": 5}, {"id": 452126711, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d2485623-r452126711-Casa_de_les_Punxes-Barcelona_Catalonia.html", "text": "€12 to see a childish film and the roof ....  Unfortunately I found out at the end that none of the original interiors are on view.  What you get for more than a Hollywood movie's worth of entrance fee is a 20 minute montage of dragons and kings and princesses shown in a series of very modern rooms on the ground floor.  You wait patiently to get access to the building and your reward is a small lift .... to the roof\n\nOn the roof there is a nice view, and access to the again very modern interiors of the towers and then ... its time to take the lift down to the shop on the ground floor to commemorate your visit with a nice souvenir.\n\nThe cynicism of the marketing is breath-taking.  There is nothing to see here for history or architecture buffs. It all adds up to a slide show documentary.\n\nSpend your money on a meal in one of the cafes that gives you a view.  Much more rewarding", "publishedDate": "2017-01-15", "language": "en", "rating": 1}, {"id": 446705835, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d2485623-r446705835-Casa_de_les_Punxes-Barcelona_Catalonia.html", "text": "This is a magnificent historic building and you should certainly walk past it to look and admire the outside.  If you pay for admission to the inside, you will not see anything of interest that you could not see outside for free, except that you will get a closer view of the turrets and will be able to look out from the roof.  There is not a single period room or furnishing inside.  None, nada.  Yes, folks, this is a tourist trap.\n\nWhat you will get is a lengthy \"multimedia experience\" about Saint George and the dragon.  I am not making this up.  If you are a 7-year old, you might enjoy this in all its cheesiness.  As an adult, I felt trapped in an irrelevant waste of time and money.\n\nI have difficulty believing that any of the 5 star reviews of this place are real.", "publishedDate": "2016-12-26", "language": "en", "rating": 1}, {"id": 446313016, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d2485623-r446313016-Casa_de_les_Punxes-Barcelona_Catalonia.html", "text": "Puig’s Casa de les Punxes stands as a distinctive monument at the intersection of Diagonal, Bruc and Rossello in the Eixample, with its five ceramic covered conical towers with spikes (punxes).   It is impressive on the outside and it opened in August for visits to the interior (12.50 Euros).  There isn’t much inside, but the visit is interesting all the same.  The visit starts with an entertaining audiovisual telling of the legend of St. George and the dragon.  You then enter other rooms for an informative audiovisual presentation of the house and its history.  There is not much remaining architectural detail inside the house, but the floor tiles appear to be original or made in the original style.  The visit continues on the roof, which provides good views and an opportunity to examine the architecture of the towers up close.  Each of the towers is open and has information (often audiovisual) about a particular subject or subjects (Puig and his major works, the materials used in the house, the development of paving in Barcelona, etc.).  This is not a must-see, but it is a very pleasant hour or so if you have time and are interested in modernist architecture or the legend of St. George.", "publishedDate": "2016-12-23", "language": "en", "rating": 4}, {"id": 445414984, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d2485623-r445414984-Casa_de_les_Punxes-Barcelona_Catalonia.html", "text": "We've visited la Casa de les Punxes after our tour in La Pedrera and obviously La Pedrera is the best. PUnxes's House is only a multimedia tour and all about Saint Georges Legend.  Expensive. Empty. The best place is the roof with a great views...", "publishedDate": "2016-12-19", "language": "en", "rating": 1}, {"id": 438404950, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d2485623-r438404950-Casa_de_les_Punxes-Barcelona_Catalonia.html", "text": "I enjoyed the visit, the audio tour was well worth it. With this option one has the possibility of visiting the top of the towers and enjoying the wonderful architecture and 360 degree view of Barcelona in each tower, of the 3 apartment house.\nIt seems to me very correct that at last the initiative has been taken to pay homage to the figure of Puig I Cadafalch.\nThe videos that are projected are from the architect Puig i Cadafalch and help to understand this great figure of modernism. I found them very illustrative.\nThe visit is very complete and has alternatives for all audiences.", "publishedDate": "2016-11-18", "language": "en", "rating": 5}, {"id": 436145431, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d2485623-r436145431-Casa_de_les_Punxes-Barcelona_Catalonia.html", "text": "We were passing this remarkable building and noticed it was possible visit.\nBoy was it worth it.\nIt is interactive and you move from room to room telling the story of George and the dragon.\nYou also visit the turrets for wonderful views", "publishedDate": "2016-11-10", "language": "en", "rating": 5}, {"id": 435005678, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d2485623-r435005678-Casa_de_les_Punxes-Barcelona_Catalonia.html", "text": "We thoroughly enjoyed the interactive tour of la Casa de les Punxes. Learned about the legend of San Jordi (St. George), as well as finding out about the great architect Puig I Cadafalch. Rooftop was great! Highly recommended! ", "publishedDate": "2016-11-06", "language": "en", "rating": 5}, {"id": 432994864, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d2485623-r432994864-Casa_de_les_Punxes-Barcelona_Catalonia.html", "text": "The beginning of the tour all about the legend of St George was fantastic and I think young children would be fascinated by it. The house was very quiet when I visited and it was lovely to wander around quietly. Sure, it's not as detailed inside as the Gaudi houses but the floors and ceilings are original with lots of information available about how the house was built. \nIt was explained to me before I entered that there was no furniture in the house and I appreciated knowing that before I went in. However I found it fascinating and absolutely loved going on to the roof and exploring in each of the turret. A wonderful experience! ", "publishedDate": "2016-10-30", "language": "en", "rating": 4}, {"id": 432977875, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d2485623-r432977875-Casa_de_les_Punxes-Barcelona_Catalonia.html", "text": "I expected to see the interior of some of the flats. Instead, there is the exhibition of Sant Jordi.\nI find it to a little expensive in comparison to other art nouveau facilities in the city.", "publishedDate": "2016-10-30", "language": "en", "rating": 3}, {"id": 427728298, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d2485623-r427728298-Casa_de_les_Punxes-Barcelona_Catalonia.html", "text": "We visited this home converted to a small museum with Barcelona friends who had not had an opportunity to go as it had recently opened. Children will love this spot as it tells the story of St George and the Dragon dramatically with inventive technology. The house is very pretty and the story of one of Barcelona's great architects is very well explained.", "publishedDate": "2016-10-13", "language": "en", "rating": 3}, {"id": 427235352, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d2485623-r427235352-Casa_de_les_Punxes-Barcelona_Catalonia.html", "text": "The Casa de les Punxes, wonderful on the outside, promises an even more spectacular interior and we expected that our tour would provide this. The reality is that there is no original interior that you will see in this building either via the guided tour or the audio. We chose the audio tour and the commentary talks you through the legend of St. George and the Dragon as you proceed through several rooms all with bland, modern interiors. Following this you proceed to the terrace and can enter each of the turreted towers which again have lost their original interiors. The history of the Casa de les Punxes is on display throughout the tour and we found this very interesting. As as we descended from the terrace expecting to see much more of the building we were told that our tour was over and to return our audio headsets. We were amazed: nothing original remains other than the exterior and the tour only covered a small proportion of the building. From the outside we could see that a Bank owns a great deal of it and it appears that a good proportion has been turned over to private apartments. This is not the Gaudi experience of Casa Mila or Casa Batllo where the interiors are intact and you leave with the feeling of having seen something unique. Casa de les Punxes has been a wonderful building and still is from the outside where you can experience the imagination of the architect, Josep Cadafalch and his use of a diverse range of building materials. One should never leave a building such as this disappointed but I'm afraid that a good many people other than ourselves will.", "publishedDate": "2016-10-12", "language": "en", "rating": 1}, {"id": 427074169, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d2485623-r427074169-Casa_de_les_Punxes-Barcelona_Catalonia.html", "text": "My wife wandered across this building while looking for Gaudi structures. Not knowing, we thought that this was one of his works. Once inside, we learned that the building was designed and constructed by Josep Puig i Cadafalch. We very much enjoyed the tour - particularly the roof. An audio guide is included with the admission price. The building is now privately owned and the owners have spent an extraordinary amount of money to refurbish this site. We highly recommend a visit here.", "publishedDate": "2016-10-11", "language": "en", "rating": 4}, {"id": 421602083, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d2485623-r421602083-Casa_de_les_Punxes-Barcelona_Catalonia.html", "text": "I saw this strange house years ago, while they were refurbishing it. \nNow it's simply \"magic\"! A wise and very uptodate restoration to make us feel child again, in stairs and towers, light and wagnerian musics, looking for the Drake and waving at the Knight. \nSo comfortable shoes and give at least one hour of time... the breath of the Drake will open doors for you, while the beauty of the Princess will conquer your heart with the sound of Wagner. \nBut ... might there be a Real drake downunder??? Go and look yourselves!", "publishedDate": "2016-09-23", "language": "en", "rating": 5}, {"id": 420621148, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d2485623-r420621148-Casa_de_les_Punxes-Barcelona_Catalonia.html", "text": "This building has been beautifully restored  and is now open to the public. The wealth of detail in the stone, tiling, wood, iron, brick etc is fantastic. We booked  a guided tour and had the first tour in English, given by Ruth, who was extremely knowlegeable (we helped her out with the word 'rivet'!)\nThe majority of the tour was around the exterior of the building, and then on the roof level. We then continued on our own for the audio visual presentation of St George. \nThe shop has a good selection of stock, and the cafe-bar has an amazing array of tapas!!", "publishedDate": "2016-09-20", "language": "en", "rating": 5}, {"id": 415571742, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d2485623-r415571742-Casa_de_les_Punxes-Barcelona_Catalonia.html", "text": "Ok most of the reviews of the house are from people who have never been inside as it only opened to the public in August 2016. The exterior of the house from the street is beautiful amazing example of Catalan gothic architecture. The spikes look like the turrets on a fairy tale castle. You can choose the self guided tour or a guided tour at set times. We chose the self guided tour and had our 8 year old daughter with us. The tour begins on the first floor which is a series of rooms telling the story of San Jordi st George patron saint of Barcelona. The film resells the romantic legend as you walk through different rooms which close behind you as you watch the next section of film. Our daughter really enjoyed the film but for the adults it was just ok, interesting to hear the story and inspiration but the film was too long and drawn out (some questionable acting). Probably 20 minutes in total as you move through the rooms). It felt like an attempt to offer something completely different to the tours in Barcelona and it was a good start, you then go to the rooftop and can look inside some of the towers the audio guide will tell you about the history of the architect and his role in Barcelona. The mini guides and projections are interesting, for kids (and adults) there is a touch and feel display with different objects from the buildings exterior. Staff were really friendly and keen to get feedback they said a lot of adults who visited in the first few weeks had made similar comments that they felt they hadn't seen the house and displays of the original interior even photos would be good. The views from outside are very good, children would enjoy the film but as an adult unless they make some changes I wouldn't recommend this tour. The website shows a beautiful staircase entrance this is private on the side of the street and not part of your visit. The museum doesn't attempt to give you an idea of what the inside of the house would have been like and that feels like a missed opportunity which could really enhance the visit. There was a feeling of having seen it but not really having seen it. In time with changes hopefully this will develop into a great attraction but for now there are other sites to visit in Barcelona. ", "publishedDate": "2016-09-06", "language": "en", "rating": 2}, {"id": 409889010, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d2485623-r409889010-Casa_de_les_Punxes-Barcelona_Catalonia.html", "text": "The place is excepcional and the architect who designed it also. Josep Puig i Cadafalch was a politician, historian and architect. He was the president of Mancomunitat de Catalunya, the institution that based on the volunteers in Catalunya helped to grow the catalan sentiment and many infrastructures that still survive, like the library network of the country. A pity that a dictatorship (Primo de Rivera) destryed the institution. \n\nJosep Puig i Cadafalch based all the design of the house on the knowledge he had about the history of Catalunya and it has a lot of links with the history of Catalunya. \n\nIn addition, Casa de les Punxes is worth the visit because the guides (very nice people by the way) explain the details in very simple to understand concepts.", "publishedDate": "2016-08-24", "language": "en", "rating": 5}, {"id": 407802605, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d2485623-r407802605-Casa_de_les_Punxes-Barcelona_Catalonia.html", "text": "Casa de les Punxes is a beautiful casteI-like \nprivate building recently opened to visitors (access is only allowed to the first floor and to the roof) that belongs to the Catalan modernism architecture trend. I chose the self-guided tour.\nIt's a pleasent visit. The first floor focuses on the legend of Saint George and, in my opinion, is a too long tour. However, the visit to the roof, with its towers is well-worthy.", "publishedDate": "2016-08-20", "language": "en", "rating": 2}, {"id": 406618164, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d2485623-r406618164-Casa_de_les_Punxes-Barcelona_Catalonia.html", "text": "I really liked the guided tour, I learned a lot about modernism and about the architect. The Sant Jordi movie was also nice and entertaining. I recommend to go and visit Casa de las Punxes!", "publishedDate": "2016-08-17", "language": "en", "rating": 5}, {"id": 406245526, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d2485623-r406245526-Casa_de_les_Punxes-Barcelona_Catalonia.html", "text": "This is a most welcome addition to Barcelona's route of visitable Moderniste mansions. La Casa de les Punxes (House of Spikes) - so-called for its six pointy towers - has always been one of Barcelona's most eye-catching sights - a veritable fairytale castle just five minutes' walk from Passeig de Gracia - and now you can go up on the roof and up inside the main Spike.\nYou can also opt for an entertaining audio-visual depiction of the St. George and the dragon legend (this legend of Catalonia's patron saint is a recurring theme throughout the house).\nThis is not a museum as such, so don't expect to see rooms full of period furniture - but for anyone with an interest in Catalan Modernisme, the visit is a fascinating and highly informative experience.", "publishedDate": "2016-08-16", "language": "en", "rating": 5}, {"id": 405576011, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d2485623-r405576011-Casa_de_les_Punxes-Barcelona_Catalonia.html", "text": "Nice guides take you around the house in the street explaining the history and decoration of the building. \nSelf-guided tour with audio-guide to the towers and final video sequences about St Jordi legend completes a pleasant visit up to 2:30h if you stop by all infos and interactive contents.", "publishedDate": "2016-08-15", "language": "en", "rating": 5}, {"id": 358233478, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d2485623-r358233478-Casa_de_les_Punxes-Barcelona_Catalonia.html", "text": "Casa de les Punxes is a beautiful private building at Avenida Diagonal with splendid towers and architecture. It is a pity we couldn't visit the building inside.", "publishedDate": "2016-03-24", "language": "en", "rating": 4}]}}]