[{"locationId": 10713504, "name": "L'Estel Ferit", "placeType": "ATTRACTION", "reviewListPage": {"reviews": [{"id": 663921162, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d10713504-r663921162-L_Estel_Ferit-Barcelona_Catalonia.html", "text": "A rusty short tower leaning to one side and seemingly meaningless. Not worth seeing at all. If you are at that particular beach then you cannot avoid it. Do not take any extra time to see it.", "publishedDate": "2019-04-05", "language": "en", "rating": 1}, {"id": 570053165, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d10713504-r570053165-L_Estel_Ferit-Barcelona_Catalonia.html", "text": "Somehow, we were never able to see the sculpture during our first visit years ago but we were aware of it. It is what it is and from what I understand, is evocative of a bygone era...it was cool to see, even if I'm not from Barcelona.", "publishedDate": "2018-04-01", "language": "en", "rating": 3}, {"id": 564413710, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d10713504-r564413710-L_Estel_Ferit-Barcelona_Catalonia.html", "text": "Firstly it's important that you know this area is prominent for thieves and gangs in Barcelona, which the Police are well aware of (they warned us about it).  There is a pickpocket gang that hangs around this monument and in the summer they are there in the day and evening, while the winter it's late afternoon onwards.  They target beachgoers on the sand but particularly tourists walking by on the path that goes along the entire waterfront, so keep your valuables really tight and be aware when you're approached by anyone, even if they appear to just be handing out brochures for a club or restaurant.  If they move into your personal space and don't walk away after telling them you're not interested, they are DEFINITELY targetting you and you'll need to physically push them away - the Police gave us this advice.\n\nNow, as for the monument itself, it really looks like an abandoned building that sits strangely on the beach.  It is supposed to represent the small spaced living conditions that migrants to Barcelona struggled with but I believe it loses the message entirely.  Anyone living in a European city will have experienced a small flat with limited space as standard living conditions for everyone.  \n\nThe area opposite the monument is nice with cafes, restaurants and often there are musicians playing too.  Even one of the buildings has a beach scene on the side of the building (see pic).", "publishedDate": "2018-03-04", "language": "en", "rating": 2}, {"id": 472473815, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d10713504-r472473815-L_Estel_Ferit-Barcelona_Catalonia.html", "text": "It's kinda interesting, bigger than I imagined, if you make it to the beach you can't really miss it. Personally I thought it looked like it could do with a clean!", "publishedDate": "2017-04-03", "language": "en", "rating": 3}, {"id": 427904524, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d10713504-r427904524-L_Estel_Ferit-Barcelona_Catalonia.html", "text": "A strange structure placed on Barceloneta beach.It looks like a building hit by an earthquake...I don't think it worth a visit.", "publishedDate": "2016-10-14", "language": "en", "rating": 2}]}}]