[{"locationId": 246511, "name": "Parc de la Ciutadella", "placeType": "ATTRACTION", "reviewListPage": {"reviews": [{"id": 752212711, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d246511-r752212711-Parc_de_la_Ciutadella-Barcelona_Catalonia.html", "text": "Another stop on our bike tour of Barcelona bought us from the Arc de Triomf to this park and in particular the excellent water feature which is impressive in both size and appearence and I'm surprised more isn't made of it.\n\nThe bike tour stopped here for a few minutes and even in this little area on top of the fountain there was a large representation of a mammoth where there was recently found some bones and fossils, as well as a band stand with music where people were happily dancing, all this on a mid february day.  \n\nI would imagine during the summer it would be a great place to kick back and relax, but with plenty to do if that took your fancy.  \n\nDefinitely take a stroll here if you fancy a little bit of time away from the city side of Barcelona.", "publishedDate": "2020-04-03", "language": "en", "rating": 5}, {"id": 752167595, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d246511-r752167595-Parc_de_la_Ciutadella-Barcelona_Catalonia.html", "text": "This park is lovely for a stroll - it's not particularly big but it is picturesque. I love the parakeets throughout and the central fountain. On a sunny day its a nice place to while away an hour or two.", "publishedDate": "2020-04-02", "language": "en", "rating": 5}, {"id": 751625848, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d246511-r751625848-Parc_de_la_Ciutadella-Barcelona_Catalonia.html", "text": "We love this park it’s really big and as it’s a bit out of the main part of the city it seem to be more used by local Spanish than tourists. You could spend a whole day there there’s a couple of lakes one of them you can rent boats another one with beautiful Fountains you can ride your bikes around there there’s lots of grassy Park areas as well it just has a really nice vibe to the place. We actually walked through this to cut down to the Marina area. I was so nice we came back and spent some time there. If you have some time during your trip to Barcelona I 100% recommend this park it’s really nice. ", "publishedDate": "2020-03-22", "language": "en", "rating": 5}, {"id": 750745029, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d246511-r750745029-Parc_de_la_Ciutadella-Barcelona_Catalonia.html", "text": "We came across this park purely by chance having visited Arc De Triomf. It is a beautiful park full of hidden surprises. \n\nA peaceful park to walk around. The best, surprising part was the Cascada, a beautiful waterfall with golden statues. \n\nWell worth a visit especially for families as there’s places for children to play. And don’t forget to look out for the mammoth!!", "publishedDate": "2020-03-13", "language": "en", "rating": 5}, {"id": 750739952, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d246511-r750739952-Parc_de_la_Ciutadella-Barcelona_Catalonia.html", "text": "This is a very large park which includes Barcelona Zoo. Perfect for sitting and gently wandering around. There is a nice boating lake and a short walk up is an attractive arch. ", "publishedDate": "2020-03-13", "language": "en", "rating": 4}, {"id": 749668068, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d246511-r749668068-Parc_de_la_Ciutadella-Barcelona_Catalonia.html", "text": "Beautiful park close to the sea and there’s a ZOO just inside! On your way from the city center to Barceloneta beach, make sure to pop in!", "publishedDate": "2020-03-07", "language": "en", "rating": 5}, {"id": 749241916, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d246511-r749241916-Parc_de_la_Ciutadella-Barcelona_Catalonia.html", "text": "The park is crowded but it is a nice place to walk around. \nDeserves some pictures especially on a good weather.", "publishedDate": "2020-03-05", "language": "en", "rating": 4}, {"id": 747430772, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d246511-r747430772-Parc_de_la_Ciutadella-Barcelona_Catalonia.html", "text": "Took a walk with my family to the park and amazed at the gorgeous fountain. It is quite a long walk from Las Ramblas where we stayed , and the fountain is even further in the entrance where we thought it would be. \n\nDont even think of not taking a picture of the fountain. It's a bit of a high climb to the top of the fountain but the outcome is beautiful, Do not miss the sunset view from the top of the fountain and immerse yourself in the detailed architecture of the facade while you're up there.\n. \nI wasnt aware of the existence of pickpockets there, but luckily there were no sour experience. \n\nThe environment while we were there was so homely, with kids and dogs chasing bubbles, and there was a newly wed couple having  a photoshoot just by the fountain. It felt like we were in a spanish movie LOL.", "publishedDate": "2020-02-24", "language": "en", "rating": 4}, {"id": 746174615, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d246511-r746174615-Parc_de_la_Ciutadella-Barcelona_Catalonia.html", "text": "Me and my partner enjoyed a walk around the park and stopped at a food place just outside the Zoo, nice pannini and a cold beer.\nI noticed a guy laying on the grass, it was obvious this man had no fixed abode and had a mental health issue (torrents) he appeared harmless enough but when he decided to lay on the grass pull down his trousers and pants exposing his bottom and projectile faeces that was very different and totally unacceptable, the park was full of children on school outings and adults enjoying the park and sunshine.\nI hope the man gets the help he needs and is removed so no-one else sees this.\n", "publishedDate": "2020-02-19", "language": "en", "rating": 5}, {"id": 744798395, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d246511-r744798395-Parc_de_la_Ciutadella-Barcelona_Catalonia.html", "text": "A very nice vast park, perfect for strolling around, run, bike through it, if you like that kind of things. The fountain is pretty beautiful.The zoo is right next to it, did not have a change to visit it (maybe next time!)", "publishedDate": "2020-02-13", "language": "en", "rating": 4}, {"id": 743742376, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d246511-r743742376-Parc_de_la_Ciutadella-Barcelona_Catalonia.html", "text": "Nice park near the beach. You can spend time here driving bike, walking or just sitting on the grass and enjoy in the Sun. Zoo is also here, amazing lake where you can rent a boat. Amazing architecture anf fountain.", "publishedDate": "2020-02-08", "language": "en", "rating": 4}, {"id": 743584809, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d246511-r743584809-Parc_de_la_Ciutadella-Barcelona_Catalonia.html", "text": "Worst park in the city. Has trash, litter, dried grass, and DOZENS of pickpockets. The only thing worth seeing is the fountain, which is off half the day. \n\nGroups of pickpockets hang around and ask tourists to sign a “petition”. After you sign, they demand to see your ID to “verify the signature.” They then proceed to take money from your wallet when you’re distracted. \n\nGo to Park Güell or Park Montjuic. Avoid this dumpy place.\n\n", "publishedDate": "2020-02-07", "language": "en", "rating": 1}, {"id": 743113789, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d246511-r743113789-Parc_de_la_Ciutadella-Barcelona_Catalonia.html", "text": "We went here a couple of times as walking distance (kind of) from our AirBnB. It was a bit rainy and thus a bit mussy here and there. Would love to come in sunny wather. A lot to see and explore in the large park and the acro de trionfo is always worth a picture", "publishedDate": "2020-02-04", "language": "en", "rating": 4}, {"id": 742678837, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d246511-r742678837-Parc_de_la_Ciutadella-Barcelona_Catalonia.html", "text": "This wasn’t a must see on our list and honestly we only went there because we were in the area and at that point couldn’t even remember what it was but we really enjoyed it. It is a massive, towering monument/water fountain with life-size sculptures of horses and people. Beautiful and epic. Not too crowded and the space is pretty and wide open. I still wouldn’t call this an absolute must see but there are so many things in the area (arc de triomf, etc.) that it would be crazy to skip it. Honestly, to compare it to something more famous like the Trevi Fountain in Rome, this is much grander, much less packed, and much more worth your time. So maybe it should be a must see. ", "publishedDate": "2020-02-02", "language": "en", "rating": 4}, {"id": 742118886, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d246511-r742118886-Parc_de_la_Ciutadella-Barcelona_Catalonia.html", "text": "really nice park if you don’t like busy tourist areas. absolutely stunning water feature. it does smell very strongly of weed in some parts so probably wouldn’t take my family here ", "publishedDate": "2020-01-30", "language": "en", "rating": 4}, {"id": 738741244, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d246511-r738741244-Parc_de_la_Ciutadella-Barcelona_Catalonia.html", "text": "Nice to get a bit of tranquillity in this perfect area, great architecture, Zoo and street performers. ", "publishedDate": "2020-01-12", "language": "en", "rating": 4}, {"id": 738053458, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d246511-r738053458-Parc_de_la_Ciutadella-Barcelona_Catalonia.html", "text": "Clean,  spacious,  grass to have a pic nic,  a lake where you can rent a boat,   a huge mammoth statue great attraction for the children.  The fountain,  the parliament,  all well reserved.  A place to relax,  to walk,  run,  bike...", "publishedDate": "2020-01-09", "language": "en", "rating": 5}, {"id": 735950253, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d246511-r735950253-Parc_de_la_Ciutadella-Barcelona_Catalonia.html", "text": "We took Metro Line 2 from our hotel to the Tutuan stop and walked to the Arc de Triomf, built as the main access gate for the 1888 Barcelona World’s Fair, and on to Ciutadella Park, where we passed by the Castle of the Three Dragons, an example of early Modernism designed by architect Lluis Domènech i Montaner and home to the Barcelona Zoological Museum.  The highlight of the park was the beautiful Font de la Cascada, a double waterfall and small lake with four dragon sculptures and a sculpture of Diana on a clamshell that is part of a monument topped with a golden chariot drawn by four horses. It was designed by Josep Fontsére with the help of a young architecture student, Antoni Gaudí.Walking through the park was pleasant and relaxing.", "publishedDate": "2019-12-31", "language": "en", "rating": 4}, {"id": 734985675, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d246511-r734985675-Parc_de_la_Ciutadella-Barcelona_Catalonia.html", "text": "Very relaxing park to get away from the hordes of tourists. Gorgeous fountain in the middle. Close to the sea and beach area.", "publishedDate": "2019-12-27", "language": "en", "rating": 5}, {"id": 733616333, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d246511-r733616333-Parc_de_la_Ciutadella-Barcelona_Catalonia.html", "text": "From the inside of the park you can see Arch de triumph. Also, the zoo and the catalonian parliament are located inside Ciutadella. Excellent green spot for break before going through gothic part of the city and port vell.", "publishedDate": "2019-12-19", "language": "en", "rating": 5}, {"id": 732057380, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d246511-r732057380-Parc_de_la_Ciutadella-Barcelona_Catalonia.html", "text": "This is definitely one of the most beautiful parts of the city. It's so quiet and full of greenery, amazing fountains, sculptures... If you want to relax and enjoy go to this park.", "publishedDate": "2019-12-11", "language": "en", "rating": 5}, {"id": 731424677, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d246511-r731424677-Parc_de_la_Ciutadella-Barcelona_Catalonia.html", "text": "A lovely park with a grand water feature that is in the heart of Barcelona. It is definitely worth a visit, even if you walk from one side to the other to the other to get across the city. Near the fountain there are some interesting sculptures ", "publishedDate": "2019-12-08", "language": "en", "rating": 5}, {"id": 730976703, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d246511-r730976703-Parc_de_la_Ciutadella-Barcelona_Catalonia.html", "text": "Beautiful park to spend sometimes walking around. Watch out for the guy with the coconuts near the fountain. He is trying to scam you JUST SAY NO A IGNORE HIM. \nOtherwise this is a beautiful must see", "publishedDate": "2019-12-06", "language": "en", "rating": 5}, {"id": 730865562, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d246511-r730865562-Parc_de_la_Ciutadella-Barcelona_Catalonia.html", "text": "This is an awesome Barcelona treasure. The Parc has everything from a small lake that rents boats, cool architecture, gardens, fountains and even a zoo. On the outside of the Parc you can find quite a few good dining choices as well. The better part of a day could be spent wandering around the area.", "publishedDate": "2019-12-05", "language": "en", "rating": 5}, {"id": 730389675, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d246511-r730389675-Parc_de_la_Ciutadella-Barcelona_Catalonia.html", "text": "A great place to unwind from the busy central areas of Barcelona. Plenty of seating, a couple of places to buy a snack and a small boating lake if you fancy it.", "publishedDate": "2019-12-03", "language": "en", "rating": 4}, {"id": 730008502, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d246511-r730008502-Parc_de_la_Ciutadella-Barcelona_Catalonia.html", "text": "...not too crowded (good), too many people smoking joints (not so good). The center of the place with the huge waterfalls and sculptures is worth inspecting a little closer.", "publishedDate": "2019-12-01", "language": "en", "rating": 3}, {"id": 729226257, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d246511-r729226257-Parc_de_la_Ciutadella-Barcelona_Catalonia.html", "text": "In Barceloneta, you can enter this wonderful park, with people that do all different things, like yoga, joggling, bubbling, walking and picnicking. Beautiful fountains, waters and ducks.", "publishedDate": "2019-11-27", "language": "en", "rating": 5}, {"id": 728998086, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d246511-r728998086-Parc_de_la_Ciutadella-Barcelona_Catalonia.html", "text": "Beautiful park, but seems very neglected. Tourists get hassled by beggars, junkies and vendors. Has potential to be a great park, but needs lots of work. ", "publishedDate": "2019-11-26", "language": "en", "rating": 2}, {"id": 728462990, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d246511-r728462990-Parc_de_la_Ciutadella-Barcelona_Catalonia.html", "text": "I have been to Barcelona several times but this was the first time I had visited the park.  I took a rakeshaw ride which included going through this lovely park. highly recommend.", "publishedDate": "2019-11-23", "language": "en", "rating": 4}, {"id": 728226536, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d246511-r728226536-Parc_de_la_Ciutadella-Barcelona_Catalonia.html", "text": "A gentle stroll through these gardens. The place is truly impressive with a lovely lake, beautiful garden areas with monuments and statues. As we walked there were loads of street vendors in a row selling a variety of goods. It does help when it was lovely sunny weather. really relaxing place to be.", "publishedDate": "2019-11-22", "language": "en", "rating": 4}, {"id": 727420916, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d246511-r727420916-Parc_de_la_Ciutadella-Barcelona_Catalonia.html", "text": "We spent quite some time walking this park after the Arc and Las Ramblas. It’s very pretty and has a lot of green space for boating, sitting by the water, feeding ducks, etc. ", "publishedDate": "2019-11-18", "language": "en", "rating": 5}, {"id": 726484804, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d246511-r726484804-Parc_de_la_Ciutadella-Barcelona_Catalonia.html", "text": "This site can easily be reached by metro.The name of the station stop is Arc de Triomf. Right outside the station is the Arch which is gorgeous with the park in the front. At the end of the park, just cross the street and go left, people will enter the Parc de la Ciutadella where the beautiful cascade is just in front of you. I visited the park about seven years ago. The cascade was under renovation. Now, it is completed and demonstrating the splendid design.\n ", "publishedDate": "2019-11-14", "language": "en", "rating": 5}, {"id": 726028405, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d246511-r726028405-Parc_de_la_Ciutadella-Barcelona_Catalonia.html", "text": "We came across the beautiful fountain in this park by accident, as we were just walking around the area, and thought we'd take a detour.  It was so lovely, lots of locals just enjoying the outdoors, ducks, turtles etc in the ponds and fresh air,  One thing we didn't know was that Gaudi actually designed the hydraulics for this fountain.  If you want to get away from the hustle and bustle of Barcelona, take a detour to this park.", "publishedDate": "2019-11-12", "language": "en", "rating": 4}, {"id": 725694305, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d246511-r725694305-Parc_de_la_Ciutadella-Barcelona_Catalonia.html", "text": "Many shops are closed on Sunday so the park is a nice place to take a stroll through the greenery or chillout and be amused by street performers. Last Sunday amusements included a salsa performance and a guy making huge bubbles for kids and adults to play amongst and photograph. A very talented puppeteer with his artist painting a snail caught my attention. Also an amazing statute that appeared to be covered in bird poop waved to a small boy after being totally still for a long time. A beautiful way to spend couple hours.", "publishedDate": "2019-11-11", "language": "en", "rating": 4}, {"id": 725676728, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d246511-r725676728-Parc_de_la_Ciutadella-Barcelona_Catalonia.html", "text": "wonderful green space with an absolutely beautiful fountain. Plenty of shade for relaxing and people watching, escape the  tourist hoards and just relax for a couple of hours.", "publishedDate": "2019-11-11", "language": "en", "rating": 5}, {"id": 725004834, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d246511-r725004834-Parc_de_la_Ciutadella-Barcelona_Catalonia.html", "text": "We visited it as part of our time to relax and entertain the kids. The fountain is beautiful, the lake is greenish and a bit dump. The toilets are chemicals only, so don`t expect luxury. It's green, there are a lot of benches and seller of all kind of stuff", "publishedDate": "2019-11-08", "language": "en", "rating": 4}, {"id": 723868074, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d246511-r723868074-Parc_de_la_Ciutadella-Barcelona_Catalonia.html", "text": "I believe this park comes from an international expo.  There are very grand 19th Century building all around and some lovely landscaping, especially palms.  But some of it is dusty and needs care and there are not many flowers.  Lots of folks hanging around without much to do.", "publishedDate": "2019-11-04", "language": "en", "rating": 4}, {"id": 723771966, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d246511-r723771966-Parc_de_la_Ciutadella-Barcelona_Catalonia.html", "text": "the park is beautiful, the fountain is like nothing i've seen before. my friend and i must've spent 30 minutes just walking around the fountain taking everything in. a great place to unwind from the hustle and bustle of the city, a must see!", "publishedDate": "2019-11-04", "language": "en", "rating": 5}, {"id": 722930725, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d246511-r722930725-Parc_de_la_Ciutadella-Barcelona_Catalonia.html", "text": "We stopped at this park as part of a bike tour, but it looked like a nice destination to visit for its own sake. The highlight for us was the beautiful Gaudi-designed fountain, but we also enjoyed the many shade trees (it was a hot afternoon!) and the mammoth statue. Strolling through the park seems like a relaxing way to spend some time and get away from crowds (there were plenty of people, but it was large enough that we could spread out a little). Definitely worth a visit.", "publishedDate": "2019-10-31", "language": "en", "rating": 4}, {"id": 722344246, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d246511-r722344246-Parc_de_la_Ciutadella-Barcelona_Catalonia.html", "text": "A great visit to the park this morning, strolling through and exploring. The lakes, the fountains, the mammoth!! And lots of other lovely things. I think my favourite thing was the green parakeets!!\n\nI think the children liked the play areas, although they were intended for younger ones, they were still play areas!", "publishedDate": "2019-10-29", "language": "en", "rating": 5}, {"id": 721486877, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d246511-r721486877-Parc_de_la_Ciutadella-Barcelona_Catalonia.html", "text": "Very nice park with a beautiful fountain. \nThe castle it’s close for restauración. \nPlease be aware of your surroundings , I witness a couple getting robbed right before my eyes. \n", "publishedDate": "2019-10-26", "language": "en", "rating": 4}, {"id": 720694594, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d246511-r720694594-Parc_de_la_Ciutadella-Barcelona_Catalonia.html", "text": "This park is on the East side of the City and we used it to get away from all the people and shops and just enjoy some greenery, sounds of the birds and a few park benches to rest on.  The park is not far from the zoo.  A couple of the signs in the park were too faded to read where things were so we missed the fountain that people are talking about but still enjoyed the green space as Barcelona is a huge big city with lots of tourists - a great downtime visit", "publishedDate": "2019-10-23", "language": "en", "rating": 4}, {"id": 720541524, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d246511-r720541524-Parc_de_la_Ciutadella-Barcelona_Catalonia.html", "text": "Parc de la Ciutadella located on the east side of Barcelona near (La Barceloneta Beach), getting to this area by Metro will be quite ok. There are few exits that i have listed below depending on where will you stay and which Line will you take.\n\nArc De Triomf Station\nBarceloneta Station\nBogatell Station\nCiutadella Vila Olimpica Station\nMarina Station\n\nbut just to remind you first that the park is quite big cause its quite connected to Arc De Triomf and also Zoo Barcelona. If you are planning to go to all 3 places in a day then its better to start off from Zoo Barcelona, booking online might be much cheaper then buying tickets on the booth. when you are finish with the Zoo. You can find one of a shops to rent bicycle or scooter or even tricycle around the streets of (Passeig De Lluis Companys) or (Passeig De Picasso).Ride around both parks and grabs some photos of the Arc and Also the Extremely Beautiful structure of (Cascada Del Parc De La Ciutadella), The park is huge and it's totally worth a visit, We had amazing experienced! Must visit while visiting Barcelona. Highly recommended 👍🏻", "publishedDate": "2019-10-22", "language": "en", "rating": 5}, {"id": 719969158, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d246511-r719969158-Parc_de_la_Ciutadella-Barcelona_Catalonia.html", "text": "Suitable for a stroll around, picnic, or relaxing. Close to the zoo. Also has a stunning fountain in the park. You can rent boats to paddle around on the pond as well.", "publishedDate": "2019-10-20", "language": "en", "rating": 5}, {"id": 719831128, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d246511-r719831128-Parc_de_la_Ciutadella-Barcelona_Catalonia.html", "text": "Long journey to find that the park is closed and there are barricades up, havent heard anything mention it was closed. Long journey to find this, very disappointed. ", "publishedDate": "2019-10-20", "language": "en", "rating": 1}, {"id": 719270531, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d246511-r719270531-Parc_de_la_Ciutadella-Barcelona_Catalonia.html", "text": "Great place to walk through. Lush green and well kept. Between Poblenou and the city, not far from beach\n\nFull of things to do and monuments to look at", "publishedDate": "2019-10-17", "language": "en", "rating": 5}, {"id": 719147892, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d246511-r719147892-Parc_de_la_Ciutadella-Barcelona_Catalonia.html", "text": "Parc de la Ciutadella is a large and centrally located park within the city that boasts grassy lawns and plenty of picnic areas. This is one of the most beautiful gardens in Barcelona, pretty close to the centre and right next to Arc de Triunfo. Perfect for a nice walk on a sunny day. On the grounds of the Parc de la Ciutadella, there are several attractions: the zoo, the Catalan Parliament. The Museu d'Art Modern is situated in the building of the parliament. The Zoological Museum and the Museu de Geologia are placed in the area of the park .You will find here a marvellous fountain, a lake and  also a large statue of a mammoth. This place is perfect for long walks or just sitting in grass enjoying the garden. This park is emblematic of Barcelona. Very picturesque. Beware of pick pocketers though, as well as scamming locals who will force unwanted merchandise and services into your hands and demand money for it.", "publishedDate": "2019-10-17", "language": "en", "rating": 5}, {"id": 719124214, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d246511-r719124214-Parc_de_la_Ciutadella-Barcelona_Catalonia.html", "text": "I came across the Park by accident, but did not regret a drop, such a beautiful place, bright energy and extraordinary beauty)", "publishedDate": "2019-10-17", "language": "en", "rating": 5}, {"id": 718531535, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d246511-r718531535-Parc_de_la_Ciutadella-Barcelona_Catalonia.html", "text": "It'a a very nice park, lot's of flowers, trees and very quiet.\nNice fountain and lake inside.\nWorth's see it.", "publishedDate": "2019-10-15", "language": "en", "rating": 4}, {"id": 716540905, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d246511-r716540905-Parc_de_la_Ciutadella-Barcelona_Catalonia.html", "text": "This was definitely one of our highlights in Barcelona. Everybody know about La Sagrada Familia and Park Guell, but this park is not so known. Wonderful place with the lake and amazing fountain again designed by Gaudi. ", "publishedDate": "2019-10-08", "language": "en", "rating": 5}, {"id": 716333291, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d246511-r716333291-Parc_de_la_Ciutadella-Barcelona_Catalonia.html", "text": "Great views, nature and more.  GREAT spot for pics and to people watch.  Wish I had a chance to go back at night and see the sunset over the park.", "publishedDate": "2019-10-08", "language": "en", "rating": 5}, {"id": 716035930, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d246511-r716035930-Parc_de_la_Ciutadella-Barcelona_Catalonia.html", "text": "I would have really liked it if the fountain was on and not sooo green. Other than that it was nice to see it.  They had some stage thing set up ,probably for the festival that was going on that week", "publishedDate": "2019-10-07", "language": "en", "rating": 3}, {"id": 715858188, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d246511-r715858188-Parc_de_la_Ciutadella-Barcelona_Catalonia.html", "text": "When we were in Barcelona the temperature was 31 degrees. We had spent the morning on the MRT getting from our accommodation to places of interest, and after a late lunch decided to find some shade where we could relax. Parc de la Ciutadella is a green oasis in the city of Barcelona. This park was designed under the command of a Josep Fontsère, the young and then unknown architect Antoni Gaudí supported him with the design of the waterfall \"Cascada\".\nWe found bench seats under trees where we spent a while just enjoying the shade and the gentle breeze that was wafting through the trees. Feeling cooler and more relaxed we strolled around what I realise now was only a small area of the total park size. The waterfall with the lake in front of it is just amazing - it takes a while to take in the various aspects; so we bought an ice cream and just sat looking at it as well as taking numerous photos.  We saw the mammoth statue and a pond with rental boats. \nThe park also includes a zoo which we did not bother to visit - but if you have little ones it would be worth a look.", "publishedDate": "2019-10-06", "language": "en", "rating": 4}, {"id": 715205550, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d246511-r715205550-Parc_de_la_Ciutadella-Barcelona_Catalonia.html", "text": "A few minutes walk from Museu Picasso, this beautiful park offers lots of shady places to rest. There is also a small artificial lake (not pictured) where you can rent a little rowboat for as long as you like for only 6€.", "publishedDate": "2019-10-04", "language": "en", "rating": 5}, {"id": 713485628, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d246511-r713485628-Parc_de_la_Ciutadella-Barcelona_Catalonia.html", "text": "A nice change to be included in the family agenda. We loved the little rowing boat even thought wasn't too cheap. We also enjoyed the quite stroll in the park and we found the fountain to be amazing.", "publishedDate": "2019-09-27", "language": "en", "rating": 5}, {"id": 713181920, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d246511-r713181920-Parc_de_la_Ciutadella-Barcelona_Catalonia.html", "text": "Being in the park is relaxing and a great place to enjoy nature along its winding paths.  There is an elaborate, beautiful fountain and waterfall by Fontsère and his student Gaudí, statues like the mammoth statue, and pond with rental boats.  It is near the Arc de Triomf.", "publishedDate": "2019-09-26", "language": "en", "rating": 4}, {"id": 712716765, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d246511-r712716765-Parc_de_la_Ciutadella-Barcelona_Catalonia.html", "text": "An excellent park with a boating lake and a Zoo. Not far just a short walk 15 min to the Pacasso museum, well worth a visit, All this would make a day trip, a good mix of things. A large park, a Zoo and the excellent Pacasso museum.", "publishedDate": "2019-09-24", "language": "en", "rating": 5}, {"id": 711049576, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d246511-r711049576-Parc_de_la_Ciutadella-Barcelona_Catalonia.html", "text": "Although we've visited Barcelona before we hadn't been to this park and were glad we made the visit this time.\n\nIts similar to a mini Central Park, New York.  There's a zoo to one corner and then lots of paths taking you through to the old Parliament building, a boating lake, picnic areas, a beautiful gold fountain, museum and various statues - old and new.\n\nThere does seem to be some renovation work going on which is good as some areas do need a little TLC. The Castle of the 3 Dragons is located on one corner which when completed will I'm sure be a great attraction again.\n\nA great place to spend a couple of hours relaxing in the city.", "publishedDate": "2019-09-18", "language": "en", "rating": 5}, {"id": 710882438, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d246511-r710882438-Parc_de_la_Ciutadella-Barcelona_Catalonia.html", "text": "Lovely place to walk round or just sit and relax, it was nice to get away from all the crowd's of people, well worth going,", "publishedDate": "2019-09-18", "language": "en", "rating": 5}, {"id": 710662580, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d246511-r710662580-Parc_de_la_Ciutadella-Barcelona_Catalonia.html", "text": "Lovely park, lots of features and areas to explore.  Plenty of Barcelona natives seem to visit, which must be a good sign", "publishedDate": "2019-09-17", "language": "en", "rating": 5}, {"id": 709679778, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d246511-r709679778-Parc_de_la_Ciutadella-Barcelona_Catalonia.html", "text": "Cool park, love it, its nice and relaxing and the golden palace is really cool and with nice water and everything.", "publishedDate": "2019-09-14", "language": "en", "rating": 5}, {"id": 709357503, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d246511-r709357503-Parc_de_la_Ciutadella-Barcelona_Catalonia.html", "text": "I got the feeling we could have spent most of the day here if it hadn't been so hot and we hadn't had afternoon plans. Still, it was a pleasant 2+ hours with lots to admire. The umbracle was a particular joy. We passed on the boats due to the heat. It would have been nice to have a few more plaques explaining the significance of statues and fountains - we relied heavily on guide books and the internet for additional information.", "publishedDate": "2019-09-13", "language": "en", "rating": 5}, {"id": 708949112, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d246511-r708949112-Parc_de_la_Ciutadella-Barcelona_Catalonia.html", "text": "We stumbled upon this beautiful park on our way to the zoo. It is quite large and very nice place for kids to play. It has a beautiful water fountains and lots of other attractions like the Parliament, Castel of three dragons and also a very lovely Zoo, I think the best Zoo we ever visited before. Also the Arc de Triomp is Close by. Definitely worth a stop if you are in the area. ", "publishedDate": "2019-09-11", "language": "en", "rating": 4}, {"id": 707288520, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d246511-r707288520-Parc_de_la_Ciutadella-Barcelona_Catalonia.html", "text": "Huge park! There is a big fountain with an arc, trees grass, nature! Simply beautiful! There was also an elephant statue ! Yay!", "publishedDate": "2019-09-06", "language": "en", "rating": 5}, {"id": 707261427, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d246511-r707261427-Parc_de_la_Ciutadella-Barcelona_Catalonia.html", "text": "This was a nice park to wander through. Plenty of trails, open spaces to sit and relax, a lake where you can row a boat and play areas for kids. But the standout is the fountain, it is really fantastic! We sat and enjoyed looking at it for at least half an hour. There is also the zoo to go to.", "publishedDate": "2019-09-06", "language": "en", "rating": 5}, {"id": 706552827, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d246511-r706552827-Parc_de_la_Ciutadella-Barcelona_Catalonia.html", "text": "A nice sanctuary to relax and enjoy the beautiful surroundings.  Nice landscaping in addition to fantastic architecture", "publishedDate": "2019-09-04", "language": "en", "rating": 5}, {"id": 706357671, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d246511-r706357671-Parc_de_la_Ciutadella-Barcelona_Catalonia.html", "text": "It is a nice parc to chill out in the city center. The main fountain is big and nice to see. Good place to sit", "publishedDate": "2019-09-04", "language": "en", "rating": 4}, {"id": 706322599, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d246511-r706322599-Parc_de_la_Ciutadella-Barcelona_Catalonia.html", "text": "Nice big park with a lot of people walking ,sitting,playing musik.We stayed just opposite .Big park that is closed at night.Inside there is a zoo, but we didnt visit it.", "publishedDate": "2019-09-04", "language": "en", "rating": 4}, {"id": 703580035, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d246511-r703580035-Parc_de_la_Ciutadella-Barcelona_Catalonia.html", "text": "Thankfully we didn’t have to travel far for our visit as we were very disappointed.  There is a magnificent fountain and a small boating lake, other than that it is pretty run down, with a lot of arrears fenced off.", "publishedDate": "2019-08-27", "language": "en", "rating": 2}, {"id": 702543631, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d246511-r702543631-Parc_de_la_Ciutadella-Barcelona_Catalonia.html", "text": "Several ways to enter this very charming park, one if which is via the Arc de Triomf. Beautiful green spaces and magnificent fountain. ", "publishedDate": "2019-08-24", "language": "en", "rating": 5}, {"id": 701222671, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d246511-r701222671-Parc_de_la_Ciutadella-Barcelona_Catalonia.html", "text": "Very nice park at the heart of the city. There is a magnificent fountain, see the picture. Has a little pond, where you can rent boat to row yourself.", "publishedDate": "2019-08-20", "language": "en", "rating": 5}, {"id": 701197026, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d246511-r701197026-Parc_de_la_Ciutadella-Barcelona_Catalonia.html", "text": "This park is lovey to walk around and the fountain is lovely! The boating lake looks small but fun. The only downsides are that there really weren’t very many shady places to sit, which is needed in the Barcelona sun, and a lot of vendors around, although they are not intimidating or unpleasant.", "publishedDate": "2019-08-20", "language": "en", "rating": 4}, {"id": 699353727, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d246511-r699353727-Parc_de_la_Ciutadella-Barcelona_Catalonia.html", "text": "We went for a nice walk here. There is a great area to take some nice photos. Be careful with some of the aggressive vendors. They try to give your kids or yourself something or take a photo and demand money right away. Not unsafe. Enjoy your time here!", "publishedDate": "2019-08-15", "language": "en", "rating": 4}, {"id": 698795790, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d246511-r698795790-Parc_de_la_Ciutadella-Barcelona_Catalonia.html", "text": "a nice fresh corner in the heat !\nkids had fun in the 30 mins boat ride ! the fountain looks spectacular !\nit was a nice stop over before tackling the zoo at the other end of the park !", "publishedDate": "2019-08-14", "language": "en", "rating": 4}, {"id": 698417360, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d246511-r698417360-Parc_de_la_Ciutadella-Barcelona_Catalonia.html", "text": "Very nice park with a little pond where you can row around in the boats. Lots of people playing music and doing acrobatics between the trees. Felt like a student hangout too.", "publishedDate": "2019-08-13", "language": "en", "rating": 5}, {"id": 696332242, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d246511-r696332242-Parc_de_la_Ciutadella-Barcelona_Catalonia.html", "text": "Was not a good time for our visit as the fountain was under renovation.  The park was huge so can take a leisurely stroll and it was even right in front of the Arc de Triomf which is a nice structure to see", "publishedDate": "2019-08-06", "language": "en", "rating": 3}, {"id": 696174364, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d246511-r696174364-Parc_de_la_Ciutadella-Barcelona_Catalonia.html", "text": "This park is definitely a pleasant visit if you get a chance. Although there was some maintenance happening around the time that I went there was still a lot of greenery to walk around and an area to see ducks and even ride on a boat. This park is also in the same area as the zoo. you will see a lot of locals laying in the grass as well or playing with dogs.", "publishedDate": "2019-08-06", "language": "en", "rating": 3}, {"id": 694099230, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d246511-r694099230-Parc_de_la_Ciutadella-Barcelona_Catalonia.html", "text": "Lush park and a great escape from busy Barcelona. Sit on benches by the magnificent fountain for awhile and people watch or rent a rowboat on the little lake. Walking along the wide pathway to the Triumphal Arch brings you back into the city. A relaxing respite from the bustle.", "publishedDate": "2019-07-30", "language": "en", "rating": 4}, {"id": 693222422, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d246511-r693222422-Parc_de_la_Ciutadella-Barcelona_Catalonia.html", "text": "The park is clean, well maintained and a perfect place for a picnic and escape from the busy city, theres a little cafe/stand selling food and drinks which aren’t too expensive ", "publishedDate": "2019-07-27", "language": "en", "rating": 5}, {"id": 693097708, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d246511-r693097708-Parc_de_la_Ciutadella-Barcelona_Catalonia.html", "text": "A very nice place to take a picnic and just hang out. There are a lot people playing music and doing acrobatics. Ping pong tables too.", "publishedDate": "2019-07-27", "language": "en", "rating": 5}, {"id": 692432436, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d246511-r692432436-Parc_de_la_Ciutadella-Barcelona_Catalonia.html", "text": "This was a normal park with grass and gravel walk ways. There was one cool part which I have posted a photo off but that’s it. Not worth the trip at all. ", "publishedDate": "2019-07-24", "language": "en", "rating": 1}, {"id": 692247735, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d246511-r692247735-Parc_de_la_Ciutadella-Barcelona_Catalonia.html", "text": "It is such a picturesque park, we went onto the little lake and rented out a boat for half hour was really fun and relaxing 6-10euro depending on boat size was really reasonable, the parks centre piece statue is just incredible, looks like something from the gods, we didn’t go to the zoo, but having it adjoin, is a nice extra for anyone interested ", "publishedDate": "2019-07-24", "language": "en", "rating": 5}, {"id": 691482949, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d246511-r691482949-Parc_de_la_Ciutadella-Barcelona_Catalonia.html", "text": "Quite a small park, but extremely clean and well kept. For walking or running there is a signposted route, there’s a playground and table tennis facilities. The only thing that put me off a little is that most of the owners let their dogs run about off-leash.", "publishedDate": "2019-07-21", "language": "en", "rating": 4}, {"id": 690643515, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d246511-r690643515-Parc_de_la_Ciutadella-Barcelona_Catalonia.html", "text": "Worth including as part of your tour of Barcelona. A lovely park with several features and statues that will be of interest to adults and children.", "publishedDate": "2019-07-18", "language": "en", "rating": 5}, {"id": 690461890, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d246511-r690461890-Parc_de_la_Ciutadella-Barcelona_Catalonia.html", "text": "Parc de la Ciutadella is a large public park east of central Barcelona. The parliament of Catalonia is located in the park as well as several landmarks of the city such as Cascada Monumental, Castle of the Three Dragons and the Desconsol sculpture. There's also a small boating lake.\n\nIt's an amazing green space.", "publishedDate": "2019-07-17", "language": "en", "rating": 5}, {"id": 690116532, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d246511-r690116532-Parc_de_la_Ciutadella-Barcelona_Catalonia.html", "text": "Great little park in the heart of El Born neighborhood. There's also a work by Antoni Gaudi in the park (Cascada Monumental) that is worth seeing. Definitely check it out!", "publishedDate": "2019-07-16", "language": "en", "rating": 4}, {"id": 689998384, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d246511-r689998384-Parc_de_la_Ciutadella-Barcelona_Catalonia.html", "text": "The park in barcelona is a great alternative to the beach for a nice place to relax and soak up the rays. There are usually people there playing music which adds to the atmosphere.", "publishedDate": "2019-07-16", "language": "en", "rating": 5}, {"id": 689552131, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d246511-r689552131-Parc_de_la_Ciutadella-Barcelona_Catalonia.html", "text": "Very impressed by this area.  Another example of how photos do not do a place its due justice. The main attaction of the park is the main fountain which is stunningly beautiful but the rest of the grounds are also nice if you want to take a small stroll or have a picnic lunch.", "publishedDate": "2019-07-14", "language": "en", "rating": 5}, {"id": 687616462, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d246511-r687616462-Parc_de_la_Ciutadella-Barcelona_Catalonia.html", "text": "On our first visit to Barcelona we were both amazed at how much there is to see and do...We spent a total of 6 days in this beautiful city and really did not even make a dent into what it has to offer.\n\nOn the first Sunday on our two week trip we visited the Sagrada Familia and then headed over to the Arc de Triomf. The main walkway was filled with hundreds of visitors enjoying a sunny Sunday in the Park. There were street vendors selling their wares, people sunbathing, children playing...Just a great atmosphere.\n\nAs we walked further we wound up in the Parc de la Ciutadella. It is a large park with open spaces, shade trees, a lake (which we did not even know about ), statues,  and food vendors.....This Park was a great find and we would both recommend it to anyone who is planning on visiting and sightseeing the beautiful city of Barcelona....", "publishedDate": "2019-07-07", "language": "en", "rating": 5}, {"id": 687425029, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d246511-r687425029-Parc_de_la_Ciutadella-Barcelona_Catalonia.html", "text": "We took a walk around this park on a day trip to Barcelona so only stayed a short time but its very beautiful with lots to see so you could spend a lot more time here.\n\nThere are grassy areas to sit and chill with lots of sculptures to see, there is a café by the biggest sculpture so you can get refreshments whilst enjoying the view.", "publishedDate": "2019-07-07", "language": "en", "rating": 5}, {"id": 687276156, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d246511-r687276156-Parc_de_la_Ciutadella-Barcelona_Catalonia.html", "text": "A lovely park, lots to explore! A beautiful pond where you can spot a few birds! Can make your way round to the arc de triomf- a truly stunning walkway and view!", "publishedDate": "2019-07-06", "language": "en", "rating": 4}, {"id": 686834664, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d246511-r686834664-Parc_de_la_Ciutadella-Barcelona_Catalonia.html", "text": "This is a nice park with some very nice sculptures, and the biggest of them all in the heart of the park.", "publishedDate": "2019-07-04", "language": "en", "rating": 5}, {"id": 686233981, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d246511-r686233981-Parc_de_la_Ciutadella-Barcelona_Catalonia.html", "text": "We stumbled upon this park as we walked back from the marina/beach area on the way back to our hotel.  What a wonderful surprise.  On top of the structure shown here is a life-size gold figure of a woman in a chariot with horses!  Walk a few yards further and there's an enormous kinetic sculpture by Miro.  There were ponds and waterfalls that we didn't even have time to explore.  Maybe next time ...   ", "publishedDate": "2019-07-02", "language": "en", "rating": 5}, {"id": 686086070, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d246511-r686086070-Parc_de_la_Ciutadella-Barcelona_Catalonia.html", "text": "Beautiful park to walk around! There are many places to lounge around and read a book or catch up with friends. ", "publishedDate": "2019-07-02", "language": "en", "rating": 5}, {"id": 685194964, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d246511-r685194964-Parc_de_la_Ciutadella-Barcelona_Catalonia.html", "text": "Situated just in front of Arc of Triumph. The park has lots of greenery and shade. They have a lake where you can do some boating or watch the ducks. Very nice play area for kids to keep them occupied.", "publishedDate": "2019-06-29", "language": "en", "rating": 4}, {"id": 685035990, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d246511-r685035990-Parc_de_la_Ciutadella-Barcelona_Catalonia.html", "text": "This is a beautiful and fun park to walk through and relax in, with artists, balloons and unique items for sale. It's also close to the zoo, which we hope to see the next time we're there.", "publishedDate": "2019-06-28", "language": "en", "rating": 5}, {"id": 685035640, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d246511-r685035640-Parc_de_la_Ciutadella-Barcelona_Catalonia.html", "text": "Fountain will absolutely take your breath away. Quite cheaply you can rent a boat and enjoy peace on the little lake. Or just go for a relaxing stroll surrounded by all the nature friendly people. Plus you can have amazing photo with huge wooden elephant! ", "publishedDate": "2019-06-28", "language": "en", "rating": 5}, {"id": 685034258, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d246511-r685034258-Parc_de_la_Ciutadella-Barcelona_Catalonia.html", "text": "I loved bringing my teenaged students to this park for beautiful photos with the Venus fountain!  They enjoyed climbing the stone stairs for some cool selfies.  Later we biked back through the park for a group photo.  I also recommend walking from the park down the palm tree lined boulevard to the Arc de Triomf for more photo worthy views!", "publishedDate": "2019-06-28", "language": "en", "rating": 5}, {"id": 684829151, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d246511-r684829151-Parc_de_la_Ciutadella-Barcelona_Catalonia.html", "text": "A walk through here is really lovely or grab a seat and enjoy people watching. There was dancing in the bandstand, the gorgeous water features, the sounds from the zoo...you could easily forget you were in a city", "publishedDate": "2019-06-27", "language": "en", "rating": 4}, {"id": 684800967, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d246511-r684800967-Parc_de_la_Ciutadella-Barcelona_Catalonia.html", "text": "Great place to have a walk around and enjoy the greenery. The zoo is there too. And a little cafe to stop off at", "publishedDate": "2019-06-27", "language": "en", "rating": 4}, {"id": 684399244, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d246511-r684399244-Parc_de_la_Ciutadella-Barcelona_Catalonia.html", "text": "Awesome green space anyone can visit for free for a quick jog, to walk your pets or to simply have some quiet time away but not far from the hustle and bustle of the city.\n\nLots of notable attractions in the area but the fountain is the highlight for me.\n\nI find it best to explore early in the morning while the sun is rising near the coast right before I get my morning coffee & pastry.", "publishedDate": "2019-06-25", "language": "en", "rating": 4}, {"id": 683734491, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d246511-r683734491-Parc_de_la_Ciutadella-Barcelona_Catalonia.html", "text": "Originally the site of the military fort which was used to house troops from Madrid to stop any Catalan revolution. Given to the city as a green space by General Prim, military prime minister of all Spain, but from Reus in Catalonia. \n\nIt is free, lovely walks and duck pond. Houses Barcelona zoo and some stunning buildings, including the ex governors house, three dragons, and some great fountains.\n\nBest fountain is that overlooked by an arch surmounted by Aurora in a golden horse drawn chariot. Aurora is goddess of the dawn, sister of the sun and moon.", "publishedDate": "2019-06-23", "language": "en", "rating": 5}, {"id": 683285503, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d246511-r683285503-Parc_de_la_Ciutadella-Barcelona_Catalonia.html", "text": "Beautiful park with a lot of trees and romantic places. There is a pond in the middle with boats. Small but probably quite romantic. The main fountain with horses is spectacular. Close by is Barcelona's ZOO- also worth seeing. It's close to the city center and nice place for a walk. I would for sure recommend it as a must on a Barcelona list.", "publishedDate": "2019-06-21", "language": "en", "rating": 5}, {"id": 682713733, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d246511-r682713733-Parc_de_la_Ciutadella-Barcelona_Catalonia.html", "text": "This is the best parc in Barcelona, it has a fantastic fountain and a boating lake which cost just 6 euros, theres a small cafe for ice creams and the parc also contains Barcelona zoo.", "publishedDate": "2019-06-19", "language": "en", "rating": 5}, {"id": 682389638, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d246511-r682389638-Parc_de_la_Ciutadella-Barcelona_Catalonia.html", "text": " Wasn’t running when we were there but it is spectacular in a lovely park with lots of people enjoying the day", "publishedDate": "2019-06-18", "language": "en", "rating": 5}, {"id": 681834598, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d246511-r681834598-Parc_de_la_Ciutadella-Barcelona_Catalonia.html", "text": "Family place, where you can find Zoo, also few attractions such as The Cascada, monument of the Mamont, lake. Romantic place to spend for couples.", "publishedDate": "2019-06-16", "language": "en", "rating": 4}, {"id": 680799751, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d246511-r680799751-Parc_de_la_Ciutadella-Barcelona_Catalonia.html", "text": "A great urban park with many things to see both natural and cultural. Also getting off the metro at Arc de Triomf and walking through the park is a more relaxed way to enter the old city than getting off the metro at Placa de Catalunya like everybody else does.", "publishedDate": "2019-06-11", "language": "en", "rating": 4}, {"id": 680409861, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d246511-r680409861-Parc_de_la_Ciutadella-Barcelona_Catalonia.html", "text": "We walked round the park fairly early in the day and it was wonderfully peaceful. The fountain it amazingly beautiful. ", "publishedDate": "2019-06-10", "language": "en", "rating": 5}, {"id": 679848780, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d246511-r679848780-Parc_de_la_Ciutadella-Barcelona_Catalonia.html", "text": "busy park - big large one, lots to do, arch of triumph is there as well..it is nice busy crowded place, lots of tourists, pickpockets as well...", "publishedDate": "2019-06-07", "language": "en", "rating": 4}, {"id": 679732487, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d246511-r679732487-Parc_de_la_Ciutadella-Barcelona_Catalonia.html", "text": "Loved this park beautiful architecture. The arc de triumph is directly across he street a quality camera will make the memories last a lifetime. Bubbles in the park balloons lots a family friendly-ness. Zoo to the opposite end of the park. The science museum is on sight was being renovated during my visit. Born area within 10 minutes. ", "publishedDate": "2019-06-07", "language": "en", "rating": 5}, {"id": 679571559, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d246511-r679571559-Parc_de_la_Ciutadella-Barcelona_Catalonia.html", "text": "Perfect locationn of a park if you’re tourist! It’s right in the center, so it’s so easy to get access to it! Been there every morning, because it’s always more quiet and you can have some more time to walk alone.", "publishedDate": "2019-06-06", "language": "en", "rating": 5}, {"id": 679130911, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d246511-r679130911-Parc_de_la_Ciutadella-Barcelona_Catalonia.html", "text": "You will find a peaceful evening here for walking and enjoy the most beautiful artworks here. Just be reminded to avoid the drug dealers!", "publishedDate": "2019-06-05", "language": "en", "rating": 5}, {"id": 677897758, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d246511-r677897758-Parc_de_la_Ciutadella-Barcelona_Catalonia.html", "text": "One of the larger parks in central Barcelona, Parc de la Ciutadella has alot to offer, being near the Zoo (which requires a ticket purchase), as well as some other historic landmarks like the Castle of the Three Dragons. \n\nHowever, even if you arent the photo-taking type, this park has alot of sitting areas (benches or grass patches) where you can escape the crowds in other parts of Barcelona. There are also many locals who use the space for exercise or practising their hobbies so you almost feel like you are immersing with everyday life here.\n\nSpent a good few hours here just wandering around and lazing with friends in a very people-friendly green space!", "publishedDate": "2019-05-31", "language": "en", "rating": 5}, {"id": 677864735, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d246511-r677864735-Parc_de_la_Ciutadella-Barcelona_Catalonia.html", "text": "This park can get crowded in the morning and early afternoon. A peak time to enjoy a wonderful relaxing vibe is in the evening, after 5. It’s calm and enchanting whether you’re solo, with your partner or with friends/relatives. Really worth visiting to get time out from the chaotic city streets.", "publishedDate": "2019-05-31", "language": "en", "rating": 4}, {"id": 677637116, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d246511-r677637116-Parc_de_la_Ciutadella-Barcelona_Catalonia.html", "text": "We roamed this park one evening after the Picasso museum. It was a nice, relaxing way to spend a few hours. The main fountain area is under construction so we didn’t get the full effect. The lake was very pretty. If we hadn’t grown hungry, we probably would have lingered longer. There were a bunch of  people selling blankets right at the entrance, which I could of done without, but otherwise, a very nice city park.", "publishedDate": "2019-05-30", "language": "en", "rating": 4}, {"id": 677561833, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d246511-r677561833-Parc_de_la_Ciutadella-Barcelona_Catalonia.html", "text": "this is a great park to walk around and enjoy the sites and people and monuments\n\nput on your walking boots/shoes and enjoy", "publishedDate": "2019-05-30", "language": "en", "rating": 4}, {"id": 676971797, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d246511-r676971797-Parc_de_la_Ciutadella-Barcelona_Catalonia.html", "text": "We walked to the Arc of Triumph and right past it we saw this park and of course we had to go explore it. We liked everything we saw. We were even more surprised to see boat rides in here. Too bad we didn't have time to go on it but it looked wonderful! :)", "publishedDate": "2019-05-27", "language": "en", "rating": 5}, {"id": 675993693, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d246511-r675993693-Parc_de_la_Ciutadella-Barcelona_Catalonia.html", "text": "lovely place, beautiful trees, nice atmosphere.\nthere is a zoo too but we didn't have time to go.\nnot too many robbers...a plague in Barcelona", "publishedDate": "2019-05-23", "language": "en", "rating": 4}, {"id": 675888997, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d246511-r675888997-Parc_de_la_Ciutadella-Barcelona_Catalonia.html", "text": "This place has layed between the Old Town and the Vila Olímpica, has something for everyone. The gardens, full of statuary, offer relaxation, the boating lake is fun, and the Castell dels Tres Dragons is a Modernista masterpiece. So just go there and take photos are enough.", "publishedDate": "2019-05-23", "language": "en", "rating": 3}, {"id": 675755812, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d246511-r675755812-Parc_de_la_Ciutadella-Barcelona_Catalonia.html", "text": "I went to Ciutadella Park last weekend. It is a beautiful and amazing park. It was crowded because it is famous in Barcelona. I guess that every person should visit it. You should visit during the week because I think it will be emptier than in the weekend. You should enjoy with its incredible twilight and its lovely landscapes and people.", "publishedDate": "2019-05-22", "language": "en", "rating": 5}, {"id": 675592166, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d246511-r675592166-Parc_de_la_Ciutadella-Barcelona_Catalonia.html", "text": "Very nice park near the beach.  Lots to see  with one of the most amazing monument I have ever seen. Lovely green space. ", "publishedDate": "2019-05-21", "language": "en", "rating": 4}, {"id": 675589197, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d246511-r675589197-Parc_de_la_Ciutadella-Barcelona_Catalonia.html", "text": "This was part of our tour, the grounds are lovely and you can cycle through and really enjoy the peace.The fountain area is beautiful.", "publishedDate": "2019-05-21", "language": "en", "rating": 5}, {"id": 675561570, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d246511-r675561570-Parc_de_la_Ciutadella-Barcelona_Catalonia.html", "text": "I liked it.\n\nBig in size, green, has ponds hosting beautiful ducks etc...\n\nYou will find all sort of people: those going for a jog, couples making out on the grass, people walking their dogs, doing sports, playing games and music.\n\nA very relaxing and versatile experience. Switches your mind off the city, while being right in the middle of it.\n\nThe park is close to Le Born quarter, and ends with the Arc of Triumph.\n\nIf you feel like a relaxing stroll in nature, this is a very good option!", "publishedDate": "2019-05-21", "language": "en", "rating": 5}, {"id": 675473628, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d246511-r675473628-Parc_de_la_Ciutadella-Barcelona_Catalonia.html", "text": "We went mid May and is was pretty scruffy. Went to the main Cascada fountain and it looked nothing like in the DK Top 10 of Barcelona.  There was a small pool of stagnant green water, not a fountain working anywhere but the chariot and horses at the top were very golden.  Best bit was seeing the green parrots!", "publishedDate": "2019-05-21", "language": "en", "rating": 3}, {"id": 675331358, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d246511-r675331358-Parc_de_la_Ciutadella-Barcelona_Catalonia.html", "text": "The Parc de la Ciutadella offers a unique opportunity to see and meet the people of Barcelona. It is very popular. It is very close to the Arc de Triumph and the zoo. Don't miss the large fountain designed by Gaudi that he must have designed in his early years because it is much more reminiscent of a fountain at Versailles or Peterhof than it is of Parc Guell.", "publishedDate": "2019-05-20", "language": "en", "rating": 5}, {"id": 674752253, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d246511-r674752253-Parc_de_la_Ciutadella-Barcelona_Catalonia.html", "text": "Unlike London, Barcelona does not have many green parks at its centre.  It is a much more urban city, with grand tree-lined avenues and squares.\n\nOne exception is the Parc de la Ciutadella, though it is slightly away from the main city centre and suffers from being cut off from the ocean promenade by railway lines and busy roads.\n\nIt is a park that is worth visiting, ideally walking down to it from the Arc de Triomf.  At its south end, it is home to the zoo and you can hear the trumpeting of elephants as you walk past.\n\nThe location was previously that of the Bourbon citadel of Barcelona, much hated by the local people and eventually demolished (apart from the chapel and some other buildings), with the new park laid out in 1872 to designs of the architect Josep Fonsere.  It was the location of the 1888 Barcelona World Exhibition.  \n\nAt the centre is the lake, popular for boating, and around it are buildings including the Catalan Parliament and the Castle of the Four Dragons.  The park has sculptures throughout it and a major feature is the immense Cascade, currently undergoing refurbishment, on top of which is the golden statue of Aurora and her horses which can be seen from vantage points across the city, rising above the trees. ", "publishedDate": "2019-05-18", "language": "en", "rating": 5}, {"id": 674336843, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d246511-r674336843-Parc_de_la_Ciutadella-Barcelona_Catalonia.html", "text": "The weather wasn't always sunny during our holiday, so we took the cloudier days as an opportunity to venture around the city. \n\nWe were staying in one of the outer districts so decided to take the long walk into the city centre. On the way we found Parc de la Ciutadella.\n\nIt is a very large and busy park but that doesn't mean you're falling over other people. \n\nWe enjoyed the plants, wide paths and the surprise of finding Cascada Monumental in the middle of it - a must-see if visiting Barcelona. \n\nRelaxing, recommended and would return.", "publishedDate": "2019-05-16", "language": "en", "rating": 5}, {"id": 674082574, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d246511-r674082574-Parc_de_la_Ciutadella-Barcelona_Catalonia.html", "text": "Located not far from Arc de Triomphe and a metro station you can find this beautiful place of nature. Trees with lots of birds, a small lake and of course the magnificent fountain with the golden statue decorate this parc. Unfortunately 2 times a year, one of them is now, the fountain is closed due to maintenance. There are lord of places to relax between the trees and on the grass. Thre are also some stands to buy drinks and food. ", "publishedDate": "2019-05-14", "language": "en", "rating": 5}, {"id": 673881244, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d246511-r673881244-Parc_de_la_Ciutadella-Barcelona_Catalonia.html", "text": "this is an excellent open space in Barcelona, with lots to see (grounds, fountains, sculptures, zoo etc.) - very popular with both tourists and locals - worth a visit!", "publishedDate": "2019-05-14", "language": "en", "rating": 4}, {"id": 672882787, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d246511-r672882787-Parc_de_la_Ciutadella-Barcelona_Catalonia.html", "text": "we really like it! beautiful place and not too  busy.. for us it was our numer one place that we saw in Barcelona. Just take the time to walk in the park.", "publishedDate": "2019-05-09", "language": "en", "rating": 5}, {"id": 670994573, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d246511-r670994573-Parc_de_la_Ciutadella-Barcelona_Catalonia.html", "text": "Absolutely stunning park. The boat ride was amazing and the monument was beautiful. We walked from Park Güell and this was with a 10 and 4 year old. Such an amazing day with lots to see. So many patisseries which are so cheap and taste amazing!", "publishedDate": "2019-05-02", "language": "en", "rating": 5}, {"id": 669565336, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d246511-r669565336-Parc_de_la_Ciutadella-Barcelona_Catalonia.html", "text": "The parc is fantastic to just hang out with or without family, relax after or before a visit to the old town. A real gem.", "publishedDate": "2019-04-26", "language": "en", "rating": 5}, {"id": 669408832, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d246511-r669408832-Parc_de_la_Ciutadella-Barcelona_Catalonia.html", "text": "We visited the park the week before Easter on a lovely sunny day.\nWe approached from the Arc de Triomf, walking down the central avenue watching people setting off on their Segway tours.\nYou need to cross the busy main road at the bottom of the walk way and into the Park de la Ciutadella.\nOur eldest granddaughter asked  us to look out for a toilet. There were several green metal signs showing arrows for toilet directions.\nWe followed each one but all these areas appeared to be locked and derelict.\nWe arrived at the bottom of the park, with the entrance to the Zoo in front of us, having still not found a toilet.\nMy husband went over to the left hand  side to a kiosk selling drinks and snacks and asked for directions to the facilities.\nHe was told that there was one behind.\nWe went behind the ‘cafe’ and found a brown wooden door on which a toilet sign had been painted.\nThere was just the one toilet with various signs inside, even one for ice cream.\nSurely a busy park should have at least one proper toilet block if only temporary whilst the others were being refurbished.", "publishedDate": "2019-04-26", "language": "en", "rating": 4}, {"id": 669167908, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d246511-r669167908-Parc_de_la_Ciutadella-Barcelona_Catalonia.html", "text": "The park provides a good place to take rest after wandering around Gothic Quarter and the area nearby. It's a wonderful place to feel peaceful and watch people enjoying their free time there. There's a big fountain inside the park and a pond where you can rent a boat and paddle around. Time to submerge into the nature.", "publishedDate": "2019-04-25", "language": "en", "rating": 4}, {"id": 667564593, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d246511-r667564593-Parc_de_la_Ciutadella-Barcelona_Catalonia.html", "text": "Located near the Arc d Triomf is the beautiful Parc de la Ciutadella.It is a spacious park with interesting monuments and wide green spaces to sit on.We were there on a Sunday afternoon and it was filled with locals and tourists who enjoyed the warm weather.One big issue while we were at the park was looking for bathroom facilities.We followed signs but we found the building undergoing renovations.", "publishedDate": "2019-04-19", "language": "en", "rating": 5}, {"id": 667339548, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d246511-r667339548-Parc_de_la_Ciutadella-Barcelona_Catalonia.html", "text": "Nice open green spaces, easy walking paths, boats to hire, interesting fountain, statues. Lovely to see so many people out enjoying the Parc, picnicking,", "publishedDate": "2019-04-18", "language": "en", "rating": 4}, {"id": 666960076, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d246511-r666960076-Parc_de_la_Ciutadella-Barcelona_Catalonia.html", "text": "This is a must see. It is big and the fountain is exceptional. It is stunning.\nThe park is green and a nice change from the street.", "publishedDate": "2019-04-16", "language": "en", "rating": 5}, {"id": 665890723, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d246511-r665890723-Parc_de_la_Ciutadella-Barcelona_Catalonia.html", "text": "This is a big park with paths, lawns and flowers. There are a few buildings and a waterfall within the park, you can get tours with someone who will tell you the history. \n\nI overheard (as we didn't take the tour) at some stage in history there was a king, who was so inbred he couldn't reproduce. When he died his nearest to the throne (someone french and a family from another part of the world) started arguing over who would take over, the french won, came over, took over the park and built a Citadel in it - hence Citadella park. He had cannons from the top of this pointed out to the city, to show Barcelona who was boss (they did not want him there). Eventually he was overthrown and in celebration Barcelonians  knocked down Citadel, so there isn't one there anymore. ", "publishedDate": "2019-04-13", "language": "en", "rating": 5}, {"id": 665485851, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d246511-r665485851-Parc_de_la_Ciutadella-Barcelona_Catalonia.html", "text": "Free, unless you want to rent a boat.\nVisit Duration: from 1 Hour to half day.\n\nPreviously a hated fortress, then converted into a prison, Parc de la Ciutadella is the greenest area in Barcelona. The park has a small lake, a giant mammoth, a fountain and wide grass areas where you can relax.\n\nThe 20€ entrance fees for the zoo isn't worth it. AVOID it at all costs.\n\nHire of the boats (prices respectively for 30 minutes):\n2 persons: €6\n3 persons: €9\n4/5 persons: €10\nGroups from 20 persons: €2", "publishedDate": "2019-04-11", "language": "en", "rating": 5}, {"id": 664969640, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d246511-r664969640-Parc_de_la_Ciutadella-Barcelona_Catalonia.html", "text": "We started at the Arc de Trimpf and walked down through the Park. It’s a beautiful place with lots of history dating back to the worlds fair in the late 1800’s. Unfortunately the fountain was under construction but there are plenty of places to stop and relax and take pictures. ", "publishedDate": "2019-04-09", "language": "en", "rating": 5}, {"id": 664856817, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d246511-r664856817-Parc_de_la_Ciutadella-Barcelona_Catalonia.html", "text": "It was so pretty and huge and so much to see and do. We went on a boat ride. The fountain feature is beautiful. As we were taking a picture there a bike rider stole our rucksack from our pram and rode of. Spoiled the day. Beware of thieves. But the actual park is worth looking to visit.", "publishedDate": "2019-04-08", "language": "en", "rating": 3}, {"id": 664803161, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d246511-r664803161-Parc_de_la_Ciutadella-Barcelona_Catalonia.html", "text": "Sunday visit to the park for a stroll and relax was very enjoyable. Nice to see the locals out too! Great atmosphere.", "publishedDate": "2019-04-08", "language": "en", "rating": 4}, {"id": 664762364, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d246511-r664762364-Parc_de_la_Ciutadella-Barcelona_Catalonia.html", "text": "I've heard about this park from my friends, but when we came here, we saw nothing special. Also, it's a bit dirty. ", "publishedDate": "2019-04-08", "language": "en", "rating": 4}, {"id": 664754792, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d246511-r664754792-Parc_de_la_Ciutadella-Barcelona_Catalonia.html", "text": "Just love that the entire family contingent of Barcelona is spread across the lawns of this lovely place over the weekends.  its such a joyous happy and busy place to be.", "publishedDate": "2019-04-08", "language": "en", "rating": 5}, {"id": 664750395, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d246511-r664750395-Parc_de_la_Ciutadella-Barcelona_Catalonia.html", "text": "It is worth to pay a visit especially during a hot day. Easy excess from the Arc of Triumph.Locals like this place and it was recommended to me.", "publishedDate": "2019-04-08", "language": "en", "rating": 5}, {"id": 663490063, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d246511-r663490063-Parc_de_la_Ciutadella-Barcelona_Catalonia.html", "text": "beautiful, clean and well used. loved the locals of all ages, people with dogs, loved the pond and water fowl, and huge fountain with the ornate gold sculpture atop. nice views, nice big city escape. really loved the chattering beautiful parrots throughout and their amazing nests! loved the zoo, the old atrium/arboretum and garden building. really nice park!", "publishedDate": "2019-04-03", "language": "en", "rating": 5}, {"id": 662852444, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d246511-r662852444-Parc_de_la_Ciutadella-Barcelona_Catalonia.html", "text": "We wandered out of the Borne neighborhood and came across Parc de la Ciutadella.  It wasn't on our list of things to do for some reason but we're glad we found it.  It was nice sunny Sunday afternoon so we walked it from one end to the other to the Arco de Triunfo de Barcelona.\n\nI have to say this park is really really clean.  looks like there is lots to see but we just made the walk through from one end to the other. This will add a lot of steps to your day though.", "publishedDate": "2019-04-01", "language": "en", "rating": 4}, {"id": 662849627, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d246511-r662849627-Parc_de_la_Ciutadella-Barcelona_Catalonia.html", "text": "I loved this park. Only sad it's a little run down in places. Such a nice break from all the siteseeing", "publishedDate": "2019-04-01", "language": "en", "rating": 4}, {"id": 662638057, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d246511-r662638057-Parc_de_la_Ciutadella-Barcelona_Catalonia.html", "text": "This park is something worth spending some time with. There is an iconic fountain and a lake where you can hire a boat. Different paths within the park surrounded by trees and plants really makes your walk pleasant. There is a bar with a terrace inside to get some refreshment and next door there is the city zoo.", "publishedDate": "2019-04-01", "language": "en", "rating": 5}, {"id": 662217483, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d246511-r662217483-Parc_de_la_Ciutadella-Barcelona_Catalonia.html", "text": "Beautiful park but too busy. Not suitable for a  relaxing walk. Little bit dirty. Too many children playing after school, felt more like a playground.", "publishedDate": "2019-03-30", "language": "en", "rating": 4}, {"id": 662193190, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d246511-r662193190-Parc_de_la_Ciutadella-Barcelona_Catalonia.html", "text": "Gorgeous park and water feature, honestly stunning and a must visit. We wandered down the other side where the school and parliament buildings are, in the center of this is a circular seating area lined with trees. Thieves hide in the trees waiting for you to sit down on a bench and relax, maybe you put your bag to one side or by your feet - the moment you do it's gone.a couple opposite us warned us before this happened but as soon as we got up we saw a guy emerge from the bushes behind us. So enjoy the park and its beauty but be careful!!!", "publishedDate": "2019-03-30", "language": "en", "rating": 5}, {"id": 661701460, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d246511-r661701460-Parc_de_la_Ciutadella-Barcelona_Catalonia.html", "text": "We saw this on TripAdvisor before we came to Barcelona as one of things to do. It is a beautiful green area in the middle of a busy City. It has a grand fountain in the middle topped with gold statues. It has different areas to walk around, and, includes a Library. But, the toilets are closed so you need to go to the Cafe at the start.", "publishedDate": "2019-03-27", "language": "en", "rating": 4}, {"id": 661188320, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d246511-r661188320-Parc_de_la_Ciutadella-Barcelona_Catalonia.html", "text": "It's a really nice park to walk in, almost all the buildings are being refurbished.\nI was happy that we were allowed to step on the grass and enjoy the sunny weather of march :)", "publishedDate": "2019-03-25", "language": "en", "rating": 4}, {"id": 660895711, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d246511-r660895711-Parc_de_la_Ciutadella-Barcelona_Catalonia.html", "text": "This is a fine example of what a city park should be. It’s well maintained, lots of green areas, a lovely water feature and lots of other things to explore. \n\nA lot of buildings are being refurbished but it’s still a great place to wander round. There are some interesting features which make for good photographs. ", "publishedDate": "2019-03-24", "language": "en", "rating": 4}, {"id": 660341669, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d246511-r660341669-Parc_de_la_Ciutadella-Barcelona_Catalonia.html", "text": "I love this place to ramble. It is among my favourite in Barcelona. All of the parks have their charm. There are a great legacy of our fore fathers who had the hindsight unlike our modern day leaders to keep space for what is beautiful, parks with walks and beautiful trees and flowers.\n\nThe architecture, the layout, it is just splendid, lots of people but on weekdays mainly locals and kids, lots of them on school trips.", "publishedDate": "2019-03-22", "language": "en", "rating": 5}, {"id": 660337747, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d246511-r660337747-Parc_de_la_Ciutadella-Barcelona_Catalonia.html", "text": "This was a nice city park but nothing spectacular.  It was a nice change from the busy city and right next to the El Born neighborhood.  ", "publishedDate": "2019-03-22", "language": "en", "rating": 3}, {"id": 659949844, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d246511-r659949844-Parc_de_la_Ciutadella-Barcelona_Catalonia.html", "text": "There is so much to see in the park with the gorgeous fountain being the highlight. We went in March and had a beautiful sunny day where the park was full of people relaxing and just enjoying themselves. There was a lovely atmosphere and many quiet areas where you could just sit and watch the world go by. It seems to be one of those places where you can spend as much time or as little time as you want; just stroll around and enjoy the peace and lovely surroundings.", "publishedDate": "2019-03-20", "language": "en", "rating": 5}, {"id": 659945607, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d246511-r659945607-Parc_de_la_Ciutadella-Barcelona_Catalonia.html", "text": "Nice spot for relax in Born Quarter (barcelona's old town). One of my favourites green areas in town. ", "publishedDate": "2019-03-20", "language": "en", "rating": 5}, {"id": 659102473, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d246511-r659102473-Parc_de_la_Ciutadella-Barcelona_Catalonia.html", "text": "Parc de la Ciutadella is an absolute \"top ten site\" in Barcelona.  My daughter and I came across this park while visiting the Arc del Triomf and it turned out to be one of the highlights of our trip. It was a nice sunny day, and the atmosphere was very relaxing.  The park was full of people jogging, walking dogs, and just enjoying a day in the park.  The fountain is absolutely beautiful and very ornate.  l loved everything about this park.......could have stayed all day.", "publishedDate": "2019-03-17", "language": "en", "rating": 5}, {"id": 658647097, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d246511-r658647097-Parc_de_la_Ciutadella-Barcelona_Catalonia.html", "text": "If you make it out of the South end of Las Ramblas, definately take the short walk across to Parc de la Cuitadella, where there is also the Barcelona Zoo.  A formal park where there is plenty of open space and formal walks, and a beautiful and huge fountain.  Free to enter and definately somewhere to relax if you want to escape the crowds.", "publishedDate": "2019-03-15", "language": "en", "rating": 5}, {"id": 658312825, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d246511-r658312825-Parc_de_la_Ciutadella-Barcelona_Catalonia.html", "text": "Fantastic place to visit and spend an afternoon walking around and chilling out. Do not hesitate and go", "publishedDate": "2019-03-13", "language": "en", "rating": 5}, {"id": 658296907, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d246511-r658296907-Parc_de_la_Ciutadella-Barcelona_Catalonia.html", "text": "We go here normally at Sundays, there is many people, some of them doing music, some acrobatic moves between the trees.. Generally good vibe", "publishedDate": "2019-03-13", "language": "en", "rating": 5}, {"id": 658043206, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d246511-r658043206-Parc_de_la_Ciutadella-Barcelona_Catalonia.html", "text": "I can't give it 5stars as the lake was under construction so we didn't see the true beauty but it was a wonderful place to relax", "publishedDate": "2019-03-12", "language": "en", "rating": 4}, {"id": 657956637, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d246511-r657956637-Parc_de_la_Ciutadella-Barcelona_Catalonia.html", "text": "Its one of the best places in Barcelona - very beautiful, peaceful, sunny, place to enjoy the moment in any weather, you can take a boat there and enjoy on the lake, or sit on the grass or bench, visit zoo at the end of the park.", "publishedDate": "2019-03-11", "language": "en", "rating": 5}, {"id": 657892358, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d246511-r657892358-Parc_de_la_Ciutadella-Barcelona_Catalonia.html", "text": "Directly across from the Hostile that we stayed in for the night. Wonderful area park like in itself. Family's and joggers were all around.  very nice easy setting with a lot to see. ", "publishedDate": "2019-03-11", "language": "en", "rating": 5}, {"id": 657678570, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d246511-r657678570-Parc_de_la_Ciutadella-Barcelona_Catalonia.html", "text": "This park is worth visiting especially as part of a stroll from the Arc de Triomf down to the Parliament building.  The greenery was not quite in full bloom in early March but looked to be less than a month away.  This is a fairly small park and can be combined with the two above attractions and then a meal and shopping in the adjacent El Born neighborhood (or a visit to the Picasso Museum and other attractions).", "publishedDate": "2019-03-10", "language": "en", "rating": 4}, {"id": 657530639, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d246511-r657530639-Parc_de_la_Ciutadella-Barcelona_Catalonia.html", "text": "Beautiful! Amazing, free, green, not crowded! Excellent to spend some quality time! I would love to go there again!", "publishedDate": "2019-03-10", "language": "en", "rating": 5}, {"id": 657500162, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d246511-r657500162-Parc_de_la_Ciutadella-Barcelona_Catalonia.html", "text": "We came across the park when we were walking into the centre. What a find. It wasn’t really mentioned in our guide book bur it is well worth a visit. A true oasis.with amazing buildings and beautiful gardens.", "publishedDate": "2019-03-10", "language": "en", "rating": 5}, {"id": 657194549, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d246511-r657194549-Parc_de_la_Ciutadella-Barcelona_Catalonia.html", "text": "Very nice park, you can take a small rowing boat in the centre. Lovely fountain and some very nice buildings in the parc, like the small church. ", "publishedDate": "2019-03-08", "language": "en", "rating": 5}, {"id": 656784031, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d246511-r656784031-Parc_de_la_Ciutadella-Barcelona_Catalonia.html", "text": "Prepare to be awed in a city full of beautiful awes, by the Cascada Monumental in Parc de la Ciutadella.  The dragons, the horses, the  gods, the gilt.....incredible!  Of the many beautiful sculptures in the park, including the fantastic woolly mammouth, the fountain is the jewel.  Don't miss it.  It is truly a fantastic spectacle!", "publishedDate": "2019-03-06", "language": "en", "rating": 5}, {"id": 656704446, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d246511-r656704446-Parc_de_la_Ciutadella-Barcelona_Catalonia.html", "text": "Not looking its best at this time of year but a pleasing park to walk through, enjoyable to see the local residents (parrots)", "publishedDate": "2019-03-05", "language": "en", "rating": 4}, {"id": 656685766, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d246511-r656685766-Parc_de_la_Ciutadella-Barcelona_Catalonia.html", "text": "Stopped here on a tour of the city. The park is fabulous! Obviously the weather makes a massive difference, however, the park is well thought out with lots of space to sit/lay/ or just relax in. \n\nThe park looks very popular with the locals, which is always a great sign. Lots running and doing all sorts of exercise.\n\nSome ponds/small lakes in the park which have lots of different birds if you are interested in that. \n\nThe citadel is amazing. An incredible and beautiful water feature which looks stunning. \n\nAbsolutely worth a visit for an afternoon/morning on your trip around Barcelona. ", "publishedDate": "2019-03-05", "language": "en", "rating": 5}, {"id": 656390658, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d246511-r656390658-Parc_de_la_Ciutadella-Barcelona_Catalonia.html", "text": "A great park in the central Barcelon for a walk, sit in the shade with a picnic, watch people go by and relax in the sun. Don’t miss to see the beautiful fountain.", "publishedDate": "2019-03-04", "language": "en", "rating": 5}, {"id": 656305156, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d246511-r656305156-Parc_de_la_Ciutadella-Barcelona_Catalonia.html", "text": "The park features a beautiful fountain (Cascada) and pond which is ideal for pictures, especially approaching sunset. \n\nUnfortunately, a horrible man with a basket of coconuts was going around trying to scam English speaking tourists- mainly women from what I saw. He would approach you offering you 'some local delicacies' and as a 'gift to you' before practically placing it in your hands regardless of what you said, before then demanding 5 euros (an insane price) off you. We told him to get lost, however, we soon saw him pestering him some American group of women who got very uneasy and flustered by him and looked like they were about to pay him before we stepped in and told them he was a scammer and to not pay him and just give the coconut back and if he doesn't leave them alone seek out a local security guard. The other scammers lurking around this area offer to take your photo before demanding money so be cautious of them too. \n\nOther than that unpleasantness the park was gorgeous, especially the catalunya parliament building and Cascada monument (fountain).", "publishedDate": "2019-03-04", "language": "en", "rating": 5}, {"id": 655459970, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d246511-r655459970-Parc_de_la_Ciutadella-Barcelona_Catalonia.html", "text": "One of the places I liked the most in Barcelona. Especially because of the relaxed happy people who were having a dance in a gazebo close to the fountain on a sunday. ", "publishedDate": "2019-02-28", "language": "en", "rating": 5}, {"id": 654724967, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d246511-r654724967-Parc_de_la_Ciutadella-Barcelona_Catalonia.html", "text": "This is a must see in Barcelona, the park is gorgeous and full of wildlife (e.g. parakeets). The only downside was there is some scaffolding on the fountain atm.", "publishedDate": "2019-02-25", "language": "en", "rating": 5}, {"id": 654617342, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d246511-r654617342-Parc_de_la_Ciutadella-Barcelona_Catalonia.html", "text": "Ciutadella's Park is one of my favourite places in town. Free entrance, big surface and great atmosphere. I really like it to go to do some sport or taking a walk. ", "publishedDate": "2019-02-24", "language": "en", "rating": 5}, {"id": 653409091, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d246511-r653409091-Parc_de_la_Ciutadella-Barcelona_Catalonia.html", "text": "What a lovely park in a centre of a town ! \nEverything was stunning \nOld building , zoo at the end \nWell worth the walk ", "publishedDate": "2019-02-18", "language": "en", "rating": 5}, {"id": 652112985, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d246511-r652112985-Parc_de_la_Ciutadella-Barcelona_Catalonia.html", "text": "We stumbled across this park randomly and were so glad we did. Really pretty, when we went on a Sunday it was buzzy with music performers. Really beautiful at golden hour when the sun is starting to set looking down over the park from the fountain.", "publishedDate": "2019-02-13", "language": "en", "rating": 5}, {"id": 651841031, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d246511-r651841031-Parc_de_la_Ciutadella-Barcelona_Catalonia.html", "text": "This place is not far from La Ramblas near to the port and is worth a visit if you are out and about for sightseeing.  It is easy to miss so check the map for location.  I would not advise doing this at night since we spotted a number of homeless people milling about in the forage nearby.", "publishedDate": "2019-02-12", "language": "en", "rating": 5}, {"id": 651353906, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d246511-r651353906-Parc_de_la_Ciutadella-Barcelona_Catalonia.html", "text": "Take plenty of time to visit this park. It has some amazing building, structures, fountains and lots of trees. Seeing it at night it is beautiful too!", "publishedDate": "2019-02-10", "language": "en", "rating": 5}, {"id": 651325651, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d246511-r651325651-Parc_de_la_Ciutadella-Barcelona_Catalonia.html", "text": "Beautiful area of Barcelona - lots of things to see in the park, close to everywhere. DO not miss when in the city.", "publishedDate": "2019-02-10", "language": "en", "rating": 5}, {"id": 651104482, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d246511-r651104482-Parc_de_la_Ciutadella-Barcelona_Catalonia.html", "text": "Spent some good hours in this park after a visit to Barcelona Zoo. Very well maintained, good for walking and the fountain is spectacular. It's not one of the main tourist attractions but for me it was much better than parc Guell .", "publishedDate": "2019-02-09", "language": "en", "rating": 5}, {"id": 650794389, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d246511-r650794389-Parc_de_la_Ciutadella-Barcelona_Catalonia.html", "text": "We happened upon this park by chance while walking around Barcelona on the way to the touristy market.  It has some really beautiful things in it.  A couple of statues and a very picturesque fountain.  It is a great place to sit and have a picnic lunch of a baugette (typically 2 for a euro) and some meats or cheeses.  You can also people watch.  There is a public restroom (no charge) and a small stand selling food items.", "publishedDate": "2019-02-07", "language": "en", "rating": 4}, {"id": 650690504, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d246511-r650690504-Parc_de_la_Ciutadella-Barcelona_Catalonia.html", "text": "On our recent visit to Barcelona, wespent a great deal of time relaxing in this park.  Beautiful water feature (Gaudi I think), and a delightful walk round the park.  The place is much quieter after 4,30pm but is well worth a visit for a peaceful experience.  There is a nice little mobile cafe serving food and drink too.  Well worth a visit.", "publishedDate": "2019-02-07", "language": "en", "rating": 5}, {"id": 650393270, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d246511-r650393270-Parc_de_la_Ciutadella-Barcelona_Catalonia.html", "text": "The park is a nice refuge near the water. While the overall experience is good, the fountain is the real star. It's huge with a second story terrace. And what other fountain have you seen that has plants built into it? Awesome.", "publishedDate": "2019-02-05", "language": "en", "rating": 5}, {"id": 650007395, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d246511-r650007395-Parc_de_la_Ciutadella-Barcelona_Catalonia.html", "text": "This is a nice spacious park, good to sit and enjoy the cool breeze (depending on the season you go) and probably have a picnic. ", "publishedDate": "2019-02-03", "language": "en", "rating": 5}, {"id": 649932330, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d246511-r649932330-Parc_de_la_Ciutadella-Barcelona_Catalonia.html", "text": "Beautiful fountain and green spaces to lounge in the city centre when you need a break from all the concrete.", "publishedDate": "2019-02-03", "language": "en", "rating": 4}, {"id": 649904884, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d246511-r649904884-Parc_de_la_Ciutadella-Barcelona_Catalonia.html", "text": "Parc de la Ciutadella is one of my favourite spots in Barcelona! The park includes Cascada monument which is really amazing to see, a mammoth monument, a large pond to do boating and of course lots of people who do pic-nic and enjoy the sun! Totally recommended!!!", "publishedDate": "2019-02-03", "language": "en", "rating": 5}, {"id": 649698933, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d246511-r649698933-Parc_de_la_Ciutadella-Barcelona_Catalonia.html", "text": "The park was a short distance from Arc de Triomf. The park has a Cascada Monument, a mammoth sculpture and a magnificent pond. There is also a museum and an animal park in the park. Absolutely worth visiting. Spring and summer are probably the best time of year.", "publishedDate": "2019-02-02", "language": "en", "rating": 5}, {"id": 649667501, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d246511-r649667501-Parc_de_la_Ciutadella-Barcelona_Catalonia.html", "text": "Lovely place, full of nature and beautiful architecture. I' really enjoyed the Cascada Monumental. Beautiful place!", "publishedDate": "2019-02-02", "language": "en", "rating": 5}, {"id": 648982101, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d246511-r648982101-Parc_de_la_Ciutadella-Barcelona_Catalonia.html", "text": "We loved our trip to the park. We wandered all over. Lots of buildings, ponds, fountains, and greenery to see. People playing games, laying around, having picnics etc. A very leisure and nice park. A wonderful free activity and place to take beautiful pictures. Can do this and the arc de triomf at the same time.", "publishedDate": "2019-01-29", "language": "en", "rating": 5}, {"id": 648977475, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d246511-r648977475-Parc_de_la_Ciutadella-Barcelona_Catalonia.html", "text": "Beautiful park located in the city center with hot food stalls, live music, fountains, statues, a lake which you can travel across on boats, and hundreds of monk parakeets that will sit on you if you offer them food!", "publishedDate": "2019-01-29", "language": "en", "rating": 4}, {"id": 648547954, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d246511-r648547954-Parc_de_la_Ciutadella-Barcelona_Catalonia.html", "text": "This is a lovely park in Barcelona, we visited in January so not best time for sitting about. it was very pleasant to walk through with lovely fountains, the zoo is situated at southern end of park.\nWorth taking time to visit and get away from the traffic for a while.", "publishedDate": "2019-01-27", "language": "en", "rating": 5}, {"id": 648520804, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d246511-r648520804-Parc_de_la_Ciutadella-Barcelona_Catalonia.html", "text": "Great park to see local people and buskers and enjoy a break from the Hustle and Bustle of the City. Great photo ops around the fountain.", "publishedDate": "2019-01-27", "language": "en", "rating": 4}, {"id": 648489253, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d246511-r648489253-Parc_de_la_Ciutadella-Barcelona_Catalonia.html", "text": "Situated in the heart of Barcelona is this little gem. The park and garden is such a welcomed break from the noise of the city itself with its spacious green gardens, a small lake which you can go on with a row boat, art sculptures and the fountain which is absolutely stunning! I was very impressed with how clean and clear the water was also. I would certainly recommend anyone visiting Barcelona to definitely come and see this park it's well worth it. I truly enjoyed my visit here every moment of it.", "publishedDate": "2019-01-27", "language": "en", "rating": 5}, {"id": 648041713, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d246511-r648041713-Parc_de_la_Ciutadella-Barcelona_Catalonia.html", "text": "First time I took the time to walk through this park and I wasn't left disappointed. Impressive greenery and the most wonderful fountains I have ever seen. The gardens are enchanting and such a jewel in this wonderful city.", "publishedDate": "2019-01-24", "language": "en", "rating": 5}, {"id": 647721644, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d246511-r647721644-Parc_de_la_Ciutadella-Barcelona_Catalonia.html", "text": "A gorgeous park to stroll through. When we were there the ‘La Merce‘ festival which is Barcelona’s biggest festival on the year. The park is full food stalls, wine tasting and entertainment! Even without the festival it’s a lovely place to watch the world go by! You can also hire a boat if the weather is nice.", "publishedDate": "2019-01-23", "language": "en", "rating": 4}, {"id": 647212373, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d246511-r647212373-Parc_de_la_Ciutadella-Barcelona_Catalonia.html", "text": "There were a lot of tourists in the well-trod sections, but I was surprised by the solitude available in some of the outer nooks and crannies,,,, very peaceful and a chance to reflect and “process” all the beauties of the place.  Well worth the visit!", "publishedDate": "2019-01-20", "language": "en", "rating": 5}, {"id": 647141165, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d246511-r647141165-Parc_de_la_Ciutadella-Barcelona_Catalonia.html", "text": "This is a beautiful free park containing some lovely garden’s , plus various buildings of interest including botanical hot houses and the Zoo.", "publishedDate": "2019-01-20", "language": "en", "rating": 4}]}}]