[{"locationId": 4945354, "name": "Cementerio de Montjuic", "placeType": "ATTRACTION", "reviewListPage": {"reviews": [{"id": 743356732, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d4945354-r743356732-Cementerio_de_Montjuic-Barcelona_Catalonia.html", "text": "We planned to visit since we were in this general part of the city, and I love seeing cemeteries. This one is stunning, and if you enjoy the art, beauty, history and tranquility of a cemetery, you should absolutely visit. There were tombs and crypts in all directions, and I’ve never seen a mountainside graveyard before. Every foot of space has been used, and is still being used. \n\nThings to note: this cemetery is a far walk from the Olympic village or the Montjuic park. There doesn’t seem to be any mass transit around... and it’s an extremely hilly part of town! You need to be a strong walker to do this by foot, or plan your bus route carefully. We spent about 40 minutes walking from the Miró museum to the cemetery (downhill) and then again, uphill, all the way back up. \n\nStill worth it!", "publishedDate": "2020-02-06", "language": "en", "rating": 5}, {"id": 742767804, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d4945354-r742767804-Cementerio_de_Montjuic-Barcelona_Catalonia.html", "text": "This was high on my to do list in Barcelona and it did not disappoint. It isn’t hard to get to (Google maps will tell you where and when the closest bus is) but it goes far enough out of the main tourist spots that you’ll likely be alone when you get there. This makes it peaceful and helps to maintain the respect it deserves. (Although I did catch one lone visitor with a big camera literally climbing off a crypt...some people have no class). Anyway, the place is massive. There are maps available at the main building and an interactive screen to help you choose a route. That helps a little but if you don’t have time for a full trail you’ll just have to wander sort of blind because those maps don’t tell you what they are taking you to (one trail has artistic spots designated only by a number, no description; the other trail has historical graves and at least includes names. There is also a hybrid trail of these). \n\nWe were there for 60-90 minutes and mostly just wandered aimlessly. I can’t be certain but it felt like we saw about 5% of the place. It is massive and virtually every tomb is unique. The mausoleums are mostly huge and impressive, some the size of small chapels. Many of the more artistic tombs feature life size angels weeping, sculptures of the deceased, etc. and the hillside looks like a mosaic of tombs. \n\nI could’ve spent many hours there. So much to see and it’s all beautiful. ", "publishedDate": "2020-02-03", "language": "en", "rating": 5}, {"id": 693449288, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d4945354-r693449288-Cementerio_de_Montjuic-Barcelona_Catalonia.html", "text": "When you tire of the crowds on the Passig de Garcia a visit to this cemetery will be a welcome respite.\nHave your driver drop you off at the top of the hill.  From here you have far reaching views of the port and the Med.  Then follow the signs for either « artistic » or « historic » highlights.\nThe cemetery is extensive with many beautiful mausoleums and lots of wrought iron and sculptures...all in varying states of decay.\nThere are many places to sit along the way so bring a beverage  and enjoy some quiet time.", "publishedDate": "2019-07-28", "language": "en", "rating": 5}, {"id": 688446914, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d4945354-r688446914-Cementerio_de_Montjuic-Barcelona_Catalonia.html", "text": "This gorgeous cemetery is perched on a hill across from the bay and just begs to be toured. The tombs are unlike any we’ve ever seen and the history is palpable but the place has a serenity that you don’t expect. Go visit!", "publishedDate": "2019-07-10", "language": "en", "rating": 5}, {"id": 668147156, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d4945354-r668147156-Cementerio_de_Montjuic-Barcelona_Catalonia.html", "text": "In a city crowded with tourists, this was the only place I went to where I was really alone. I didn't see a single other tourist and only saw a couple workers. The cemetery is beautiful, with elaborate tombs and large trees on a magnificent hillside. The best and most important part though was the Fossar de la Pedrera, a former rock quarry that became a mass grave in the late 1930s when Franco took power after the Spanish Civil War. It is estimated that Spain has more mass graves than any country besides Cambodia, and most of them are unmapped and unmarked. The Fossar has been turned into a memorial for those who are buried there, and also contains memorials to the men and women of the CNT who died fighting against fascism, to the volunteers of the International Brigades during the Civil War, and to victims of the Holocaust all across Europe. It is a tranquil, beautiful, haunting, inspiring, and devastating space that deserves more recognition.", "publishedDate": "2019-04-21", "language": "en", "rating": 5}, {"id": 658827846, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d4945354-r658827846-Cementerio_de_Montjuic-Barcelona_Catalonia.html", "text": "After visiting Barcelona 20 years ago and driving by this cemetery on my way out of town I have longed to return and explore.  I had that opportunity and was completely amazed.  I saw just a small portion of the cemetery and it was heaven.  \n\nYou can take a bus and get dropped off at the top and walk down or vice versa.  I drove and parked at the office.  I walked up through several terraces of an abundance of amazing sculptures.  You could easily spend all day here and not see it all.  The array of examples of funerary sculptures is abundant.\n\nit is really a peacful and beautiful place.  If you enjoy visiting old cemeteries this one is not to be missed.", "publishedDate": "2019-03-16", "language": "en", "rating": 5}, {"id": 626621103, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d4945354-r626621103-Cementerio_de_Montjuic-Barcelona_Catalonia.html", "text": "It’s not to be missed if you can help it. This is a place I love to come to and it never fails to leave an impression on me each time I visit. The views are fantastic and the design of the mausoleums (which are said to be design based on the homes of the families that commission them) are works of art. There are guided tours each 2nd and 4th Sunday of the month although only in Spanish/Catalan. \nThere are two main routes: artistic and historic. Varying types of architecture include: Egyptian, classical, Neo-classic, Gothic and Romantic. \nI have a map and will happily send a scan/photo of it. There isn’t much info available and if there is it’s usually in Catalan. Happy to answer any questions.\nYou must like walking and or be comfortable using public transport as it’s not easy to get to. Number 21 bus in direction of el prat or H16 zona franca.", "publishedDate": "2018-10-19", "language": "en", "rating": 5}, {"id": 598795928, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d4945354-r598795928-Cementerio_de_Montjuic-Barcelona_Catalonia.html", "text": "One of most incredible places in Barcelona. Here you can see history of this city and families that have lived. Only downside is that there is no tour in English and QR-codes not working!", "publishedDate": "2018-07-23", "language": "en", "rating": 5}, {"id": 588573091, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d4945354-r588573091-Cementerio_de_Montjuic-Barcelona_Catalonia.html", "text": "Wasn’t on my list but was recommended by someone last minute. Wasn’t expecting much but when I actually got there it was stunning. It’s huge and could take a few hours to stroll around. I fell inlove with this place straight away, it was so beautiful and peaceful. Would love to go back to do some more exploring.", "publishedDate": "2018-06-18", "language": "en", "rating": 5}, {"id": 561023516, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d4945354-r561023516-Cementerio_de_Montjuic-Barcelona_Catalonia.html", "text": "This unique cemetery can be appreciated both by touring it or by just driving along the main road towards the airport and take a couple of glimpses at it.\nmost of the tombs are dug into the mountain and the entire place oozes an atmosphere of mystery.", "publishedDate": "2018-02-17", "language": "en", "rating": 3}, {"id": 524837801, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d4945354-r524837801-Cementerio_de_Montjuic-Barcelona_Catalonia.html", "text": "A beautiful cemetery. Lots of history.\nWe enjoyed strolling through all of the areas available. \nThis is a very large place, so having a car to drive to the different areas was a good idea. \nThey also provide a qr code that explains each important monument.", "publishedDate": "2017-09-16", "language": "en", "rating": 5}, {"id": 486136294, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d4945354-r486136294-Cementerio_de_Montjuic-Barcelona_Catalonia.html", "text": "Cemetery with some amazing tombs and and artistic monuments one short bus ride from the centre must see be prepared with some drinks not much shade but occasionally there is little caves to sit out of the sun in we spent about 2 or 3 hrs there and saw a good amount", "publishedDate": "2017-05-21", "language": "en", "rating": 5}, {"id": 484147023, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d4945354-r484147023-Cementerio_de_Montjuic-Barcelona_Catalonia.html", "text": "Make time to spend an hour or two here while you're in Barcelona. It's a bit out of the way but not too bad if you take the bus. The monuments and massive mausoleums make it feel more like a miniature city then a cemetery. We saw 2 funeral processions on the upper levels while we were so I'd suggest sticking to the bottom couple levels (and be respectful obviously). Many of the plots even towards the bottom seemed to be from within the past 30 years or so be mindful that other people there might not be tourists. Still, absolutely worth the visit.", "publishedDate": "2017-05-14", "language": "en", "rating": 4}, {"id": 483436212, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d4945354-r483436212-Cementerio_de_Montjuic-Barcelona_Catalonia.html", "text": "We took a guided tour and walked from the bottom with beautiful graves with gothic angels to the very top with modern burials. Learned a lot about history and culture. Recommended! ", "publishedDate": "2017-05-11", "language": "en", "rating": 5}, {"id": 473236848, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d4945354-r473236848-Cementerio_de_Montjuic-Barcelona_Catalonia.html", "text": "Best seen from the seaward side, actually from the Ronda Litoral, mix of funerary monuments and mausoleums and holes in the wall for ossuaries. It's huge. It's solemn. It's actually quite fun to see the Spanish customs of death.", "publishedDate": "2017-04-06", "language": "en", "rating": 4}, {"id": 461180659, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d4945354-r461180659-Cementerio_de_Montjuic-Barcelona_Catalonia.html", "text": "A beautiful cementery built on a hill with truly monumental tombs. It is in a somewhat isolated area, although there is a direct bus from Sants train station to an avenue closeby (number 109). Be sure not to miss the Batllo and Amatller Pantheons.", "publishedDate": "2017-02-19", "language": "en", "rating": 5}, {"id": 453285863, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d4945354-r453285863-Cementerio_de_Montjuic-Barcelona_Catalonia.html", "text": "Such a massive and overwhelming location. We had seen it driving in and returned to see it up close. You don't realize how huge it is until you are standing amongst all the crypts. 150,000 plots and such beautiful sculptures everywhere you look. If you have time you should spend an hour or two here.", "publishedDate": "2017-01-19", "language": "en", "rating": 5}, {"id": 450517832, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d4945354-r450517832-Cementerio_de_Montjuic-Barcelona_Catalonia.html", "text": "The cemetry is a very interesting and special place to visit. We walked in from the side of the olympic village and wound our way through the many many stone walls, with rows of family plots, all with something different about them. At the top of the hill there is a great view of the water / port and gives you an appreciation of the size of the cemetary as a whole. Starting from the bottom of the hill shows you the more historic and artistic tombs and graves. The statues over the tombs and graves in the artistic section are simply stunning, and are on par with many of the statues in museums.", "publishedDate": "2017-01-08", "language": "en", "rating": 4}, {"id": 425730523, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d4945354-r425730523-Cementerio_de_Montjuic-Barcelona_Catalonia.html", "text": "We had four hours to use during a wait for a train, so we took a taxi to the top of the cemetery and then walked down the stairs, wandering around the tombs, mausoleums and amazing structures. There are about 1.000,000 people buried there, and the artwork involved in honoring the dead is worthy of any fine museum. It is free, of course, and the chances are very good you will see not one, but several funerals, during a visit.  But, once you get down, you need to have a plan! You will be at the highway and there are no taxis. If you can, try to have a taxi phone number ready and a very specific location. Or, take the bus that is at the bottom to Plaza Espana. I cannot recall the number of the bus, but it runs about every 20 minutes. You go under the highway and turn to the right. There is also a bus that goes UP through the cemetery but you should research if that is an option.  Don't cut it too close if you have to be somewhere by a specific time. But, this is an uncrowded spot and a source for some amazing photos. ", "publishedDate": "2016-10-06", "language": "en", "rating": 5}, {"id": 402439047, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d4945354-r402439047-Cementerio_de_Montjuic-Barcelona_Catalonia.html", "text": "I stunning cementry at the hills of Montjuic. There are different routes through the cementerio which show you a varied sight upon the the way people out of Barcelona are buried during the aged. Note that de cementerio closes at the exact time indicated on the entrance. Be sure to leave before that time. There is a bus stop of line 21 at the southside along the motorway, but there don't go many busses. Best to make an appointment with a taxi.", "publishedDate": "2016-08-07", "language": "en", "rating": 5}, {"id": 389323067, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d4945354-r389323067-Cementerio_de_Montjuic-Barcelona_Catalonia.html", "text": "The location is a bit out of the way but it is worth taking the time to visit. The place offers a great view and is photogenic. It's a little odd walking around the cemetery but is oddly relaxing.", "publishedDate": "2016-07-05", "language": "en", "rating": 4}, {"id": 384694357, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d4945354-r384694357-Cementerio_de_Montjuic-Barcelona_Catalonia.html", "text": "Came here with a friend and her adult son. He was really interested in touring the cemetery after reading several books where it was mentioned.\n\nWe came in the \"back\" from near the Olympic park and walked down to the front entrance. Interesting to see how practices vary over the years and who had money to spend on a grand mausoleum. Especially interesting to see the burial and mourning practices of another country.\n\nWe took the bus back to downtown (walk out the front gates, under the overpass, turn right, and you'll see the bus stop). The inbound bus stop is right near the funeral carriages building. They are not across the street as in many cases.\n", "publishedDate": "2016-06-21", "language": "en", "rating": 4}, {"id": 342051587, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d4945354-r342051587-Cementerio_de_Montjuic-Barcelona_Catalonia.html", "text": "We visited the cemetry specifically because we wanted to visit the collection of funeral carriages, which, its website assured us, was open on the day of our visit. It wasn't! A handwritten note pinned to the door informed us that the collection is only on display Saturday and Sunday. Really irritating, particularly as the cemetry is only accessible by car or by a bus (number 21 from Av Paral-lel) which runs every 1/2 hr (approx). We had wanted to see the cemetry anyway and fortunately, it made up for the frustration of the misinformation mentioned. The cemetry really is like a city - it's huge, with house-sized mausoleums (mausolea?) and row upon row of family tombs. There are self-guided walks signposted: Historic, Artistic or Combined, and you are advised to allow three hours to see the whole place (yes, it really is that big). Be warned though, as with getting to the cemetry, there's only one way in and one way out of it. We climbed right to the top, thinking we'd be able to walk through to Montjuic but had to come back down again as we didn't fancy our chances of scaling 10 ft walls.", "publishedDate": "2016-01-22", "language": "en", "rating": 5}, {"id": 340239967, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d4945354-r340239967-Cementerio_de_Montjuic-Barcelona_Catalonia.html", "text": "I presume that visiting cemeteries is not on everyone’s to-do list when visiting a city like Barcelona, but this one should be an exception. This amazing structure is located on the rocky slope of Montjuic and it is more a work od art than a cemetery. The view at its burial places and niches, organized along the steep paths, is fantastic. Take the map, because it is so huge…", "publishedDate": "2016-01-15", "language": "en", "rating": 5}, {"id": 325476093, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d4945354-r325476093-Cementerio_de_Montjuic-Barcelona_Catalonia.html", "text": "A friend recommended this to me, knowing I would be exploring the Montjuic area while in Barcelona. I am so glad I took the advice. It was unbelievable and it's so hard to put into words the magnitude as well as solitude of this place.\n\nRows upon rows of niches full of ashes, each individually decorated by the families of the deceased. There are over one million on the site and it is truly awe inspiring to behold.", "publishedDate": "2015-11-09", "language": "en", "rating": 5}, {"id": 316700449, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d4945354-r316700449-Cementerio_de_Montjuic-Barcelona_Catalonia.html", "text": "I walked the whole day, and when I arrive it was just a cementery. So I come back home because I was too tired for that.\n\nI hope this will be an usefull opinion.\n", "publishedDate": "2015-10-06", "language": "en", "rating": 1}, {"id": 314186670, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d4945354-r314186670-Cementerio_de_Montjuic-Barcelona_Catalonia.html", "text": "very interesting and impressed cemetery. It is too big! but, day before I visit Poblenou cemetery and I prefer to go there. its smaller an easy to find all sculpture and other interesting and beauty things.\nI Barcelona you can find cats only in cemeteries. Only!", "publishedDate": "2015-09-27", "language": "en", "rating": 5}, {"id": 311641452, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d4945354-r311641452-Cementerio_de_Montjuic-Barcelona_Catalonia.html", "text": "Didn't expect that but this was one of the most interesting parts of the city. The cemetery is located up in a hill where there is a great view of the port of the city. The cemetery is so interesting and so HUGE. Don't go late in the day, so may get lost and you don't want to. Try to find a good map cause there are only 3 entrances-exits. So, go early and find the way!", "publishedDate": "2015-09-18", "language": "en", "rating": 5}, {"id": 285477248, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d4945354-r285477248-Cementerio_de_Montjuic-Barcelona_Catalonia.html", "text": "This is an unusual cemetery.\nIt is tucked into a corner of the Montjuic park and we accessed it from one of the main roads. \nAll the crypts or tombs are stacked above each other and relatives can use a step ladder to place flowers at the tombs of their loved ones.\nThe artwork & deco of the individual tombs are varied and interesting.\nWorth a visit.", "publishedDate": "2015-07-04", "language": "en", "rating": 4}, {"id": 271121101, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d4945354-r271121101-Cementerio_de_Montjuic-Barcelona_Catalonia.html", "text": "Wonderful scenic route uphill. I personally don't like cemeteries but this one is something different. Honestly i would like to rest in place like this when my time here is over. If you decide to take the trip up there make sure you plan ahead. You can get here by bus 21 which stops right at the main entrance - but only in direction from the city centre. You should know that on your way back the same bus has stop far outside the cemetery - on the side road of the highway (see my map). There is another bus 107, which has stops inside the cemetery but timetable is very limited. Also notice that closing time is 18:00 so you don't end up there locked like we did.", "publishedDate": "2015-05-10", "language": "en", "rating": 4}, {"id": 262289555, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d4945354-r262289555-Cementerio_de_Montjuic-Barcelona_Catalonia.html", "text": "Been to a lot of cemeteries but nothing like this and if you like it it is worth a visit. You will not be disappointed!", "publishedDate": "2015-03-28", "language": "en", "rating": 5}, {"id": 240314687, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d4945354-r240314687-Cementerio_de_Montjuic-Barcelona_Catalonia.html", "text": "I love European cemeteries with beautiful sculpture. This was worth the visit. There were a lot of hills, but it was an enjoyable, scenic walk. The only thing that was a bit confusing was the bus route. It was easy to get there, but on the way back you had to wait on the highway next to the bus sign.", "publishedDate": "2014-11-17", "language": "en", "rating": 4}, {"id": 234609977, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d4945354-r234609977-Cementerio_de_Montjuic-Barcelona_Catalonia.html", "text": "I make it a point to visit various cemeteries when I travel. I find them peaceful and I like the beauty of old and diverse grave markers. Until I visited Cementerio de Montjuic I had never seen anything like it. My travel companion spotted it as we drove from the airport into the city - the numerous crypts \"inhabiting\" the entire hillside - and we knew we had to investigate! Getting there was a bit of a trek, but boy was it worth it. The glass-encased \"chambers\" are so neatly arranged and so well kept. The sheer size of the grounds is amazing (we couldn't find our way out!). Fellow taphophiles, you probably won't get any grave marker etchings here, but you will enjoy the beauty of this cemetery!", "publishedDate": "2014-10-15", "language": "en", "rating": 5}, {"id": 224315187, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d4945354-r224315187-Cementerio_de_Montjuic-Barcelona_Catalonia.html", "text": "This is great place to visit. It is on the side of the hill so a lot of climbing. Make sure you have lots of water with you as there is no shop nearby (not like me - almost died from thirst). It is very quiet place with a lot of examples of great cemetery architecture. Great sculptures and tombs. I am sure it is not for everyone but if you have enough time in Barcelona it is worth visiting. It is far and there is a bit of walking to it and around it. See urself !! :)", "publishedDate": "2014-08-25", "language": "en", "rating": 5}, {"id": 187368679, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d4945354-r187368679-Cementerio_de_Montjuic-Barcelona_Catalonia.html", "text": "It was in fact my first time I was shocked by the complicate disign of a castle. so nice. must stay and try to feel the atmosphere of those days that are now passed.", "publishedDate": "2013-12-11", "language": "en", "rating": 5}, {"id": 186878321, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d4945354-r186878321-Cementerio_de_Montjuic-Barcelona_Catalonia.html", "text": "We got here by taking the wrong turn (and ended up in a dead-end) going to the Olympic Stadium and whilst I would not normally just drive through a cemetery, this particular cemetery was absolutely fascinating. If you have done Gaudi, churches and ruins etc and want something different - go and visit this place. There is even public bus access.", "publishedDate": "2013-12-05", "language": "en", "rating": 4}, {"id": 182508573, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d4945354-r182508573-Cementerio_de_Montjuic-Barcelona_Catalonia.html", "text": "i do not normally like to go to cemeteries, but there were very beautiful head stone here. They have routes you can walk that have you stop at certain tombs and explain who designed them. worth the trip.", "publishedDate": "2013-10-26", "language": "en", "rating": 4}]}}]