[{"locationId": 9859074, "name": "Monumento a Mosen Jacint Verdaguer", "placeType": "ATTRACTION", "reviewListPage": {"reviews": [{"id": 730198924, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d9859074-r730198924-Monumento_a_Mosen_Jacint_Verdaguer-Barcelona_Catalonia.html", "text": "Nice statue to look at that is in the middle of a big intersection. Best to view on a fine day to get a good photo.", "publishedDate": "2019-12-02", "language": "en", "rating": 3}, {"id": 689306988, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d9859074-r689306988-Monumento_a_Mosen_Jacint_Verdaguer-Barcelona_Catalonia.html", "text": "This monument stands in tribute to Jacint Verdaguer, a Spanish (or Catalan if you prefer) write and poet, considered to be a leading figure in the revival of Catalan literature.\n\nI’m afraid I don’t agree with all the 5 star ratings. The monument sits in the middle of a busy roundabout. The actual roundabout isn’t even that big as it’s diameter is designed to be big enough to accommodate the monument. The road of the roundabout is about 20 metres wide in most places with no means of crossing to the monument/roundabout and I wouldn’t even try. The closest you can physically get to the monument is one of the pedestrian crossing points.\n\nThe second reason I disagree with the 5 star ratings is that it’s a fairly simple column with a statue of Jacint Verdaguer on top. The column is surrounded by a balustrade adorned with standing three allegorical sculptures and relief sculptures. As I had no intention of risking my life to get a closer look as the adornments, I was left with the only option of squinting my eyes to get a good look, followed by the zoom lens on my camera phone.", "publishedDate": "2019-07-13", "language": "en", "rating": 3}, {"id": 676309202, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d9859074-r676309202-Monumento_a_Mosen_Jacint_Verdaguer-Barcelona_Catalonia.html", "text": "Monumento a Mosen Jacint Verdaguer is an impressive monument to a local Catalan great man. It is located in the middle of  a roundabout in a busy area. There is a kind of balustrade around the monument and inside it there is some greenery. There is a statue of Mosen Jacint Verdaguer at the top of the monument. There are also some smaller figures around the monument, probably making connections to the types of poetry by Verdaguer. Jacint Verdaguer, a priest and poet, is considered one of the greats of Catalan literature.", "publishedDate": "2019-05-25", "language": "en", "rating": 5}, {"id": 628506020, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d9859074-r628506020-Monumento_a_Mosen_Jacint_Verdaguer-Barcelona_Catalonia.html", "text": "We chanced upon this cool monument as we were heading towards the magnificent Sagrada Familia and what a wonderful find.\nA lovely monument with the statue of the famous Catalonian poet atop a 20 metre high column,it's in the middle of a busy roundabout and makes for some great photographic opportunities. \nVery easy to locate along Avinguda Diagonal Plaza De Mosen Jacinto Verdaguer.\nWell worth checking out. ", "publishedDate": "2018-10-26", "language": "en", "rating": 5}, {"id": 627054378, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d9859074-r627054378-Monumento_a_Mosen_Jacint_Verdaguer-Barcelona_Catalonia.html", "text": "Very close and worth to stop here while you are walking on the way to Sagrada Famillia. Admire the statue on top of the 20 m tall pillar, from the adjacent small park under big trees. The statue is on the roundabout in the middle of  busy intersection. Anyway, he is renowned poet and as well as a priest live in the 19th century.", "publishedDate": "2018-10-21", "language": "en", "rating": 3}, {"id": 583529019, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d9859074-r583529019-Monumento_a_Mosen_Jacint_Verdaguer-Barcelona_Catalonia.html", "text": "This is one of many monuments that we saw throughout the city. It commemorates Jacint Verdaguer i Santaló who is regarded as one of the greatest poets in Catalan literature. He stands on top of a 20m high column that rises from a monumental structure that features inscriptions of his writings. Worth a pause in passing to take a photo.", "publishedDate": "2018-05-28", "language": "en", "rating": 5}, {"id": 569363122, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d9859074-r569363122-Monumento_a_Mosen_Jacint_Verdaguer-Barcelona_Catalonia.html", "text": "Excellent place to visit but you need enough time to visit I had only one day for travel in Barcelona but you need about a week. Its a beautiful place", "publishedDate": "2018-03-28", "language": "en", "rating": 5}, {"id": 533798814, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d9859074-r533798814-Monumento_a_Mosen_Jacint_Verdaguer-Barcelona_Catalonia.html", "text": "If you are on a walking tour in the area of the avenue diagonal and Sagrada familia you may we'll pass this sizeable monument but don't make a special trip.", "publishedDate": "2017-10-17", "language": "en", "rating": 3}]}}]