[{"locationId": 10223979, "name": "Palau Robert", "placeType": "ATTRACTION", "reviewListPage": {"reviews": [{"id": 689544430, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d10223979-r689544430-Palau_Robert-Barcelona_Catalonia.html", "text": "The Palau Robert is a free museum on the corner of Avinguda Diagonal and Passeig de Gracia. There are supposed to be six rooms of exhibits, but on the day I visited, the museum, only one of the exhibitions was open. The exhibition was on Carme Ruscalleda  a 3 michelin starred head chef of the restaurant Sant Pau, specialising in Catalan cooking. Plenty of descriptions in Spanish, English and (I think) French, same goes the video documentary on the restaurant.\n\nShame the other exhibitions were closed, but I still enjoyed the one that was open.", "publishedDate": "2019-07-14", "language": "en", "rating": 5}, {"id": 672101379, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d10223979-r672101379-Palau_Robert-Barcelona_Catalonia.html", "text": "This neoclassical palace built in 1903 is located at the intersection of Passeig de Gracia and Avinguda Diagonal.\n\nIt is a former private residence but now it is a public museum with free admission. The Information Centre for Catalonia is also located here.\n\nThe museum has changing exhibitions. On our visit, there were two exhibitions: Catalonia - 7.5 million futures and Carme Ruscalleda - The essence of taste.", "publishedDate": "2019-05-07", "language": "en", "rating": 4}, {"id": 611906987, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d10223979-r611906987-Palau_Robert-Barcelona_Catalonia.html", "text": "We were pickpocketed in the Jardins de Palau Robert just before the gardens were due to close. Filed a police report and were told this happens a lot in the gardens of the Palau Robert — despite having signs for cctv management rarely switch it on. Apparently women have also been molested here.\n\nI would strongly suggest taking caution when visiting the gardens.", "publishedDate": "2018-08-29", "language": "en", "rating": 1}, {"id": 609122562, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d10223979-r609122562-Palau_Robert-Barcelona_Catalonia.html", "text": "I love the facade of this building at Passeig de Gracia, simple and yet elegant in architecture. It is now a government-run institution that hosts exhibition. Admission is free, hence drop by for a while if you are in this area.", "publishedDate": "2018-08-22", "language": "en", "rating": 4}, {"id": 588094384, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d10223979-r588094384-Palau_Robert-Barcelona_Catalonia.html", "text": "A number of lovely concerts, fairs and  gatherings are held here.  We have spent time there almost every day  relaxing and purchasing \nGifts from m vendors. Love the trees and the gravel. That are there ", "publishedDate": "2018-06-17", "language": "en", "rating": 5}, {"id": 502708164, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d10223979-r502708164-Palau_Robert-Barcelona_Catalonia.html", "text": "Yesterday I went to two of the expositions they are offering this Summer there and they were both amazing! They are both for free! They also have an information center there and barhrooms!! It has a small park inside one can also visit for free!", "publishedDate": "2017-07-17", "language": "en", "rating": 5}, {"id": 457800680, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d10223979-r457800680-Palau_Robert-Barcelona_Catalonia.html", "text": "This place is just located beside where I stay. And it's right at the entrance of Diagonal metro station. It's a lovely place to get visiting advices. And here are some exhibitions for free. Out side the building is a small garden where you can take a walk. If you ever happened to be around, please make sure you won't miss it.", "publishedDate": "2017-02-07", "language": "en", "rating": 4}, {"id": 442666513, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d10223979-r442666513-Palau_Robert-Barcelona_Catalonia.html", "text": "In the heart of Barcelona a must see place with a nice park. A picturesque venue for small meetings and events. ", "publishedDate": "2016-12-07", "language": "en", "rating": 4}, {"id": 437778725, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d10223979-r437778725-Palau_Robert-Barcelona_Catalonia.html", "text": "Palau Robert is a lovely building and worth visiting. It's free and usually has a photography exhibit (currently Outumuro). It also houses a tourist office.  But, for me, the most lovely surprise is the beautiful little park at the back of the building. It really is a peaceful oasis in the city centre. Bring your lunch and sit on a park bench in the sun or the shade.", "publishedDate": "2016-11-16", "language": "en", "rating": 5}, {"id": 432645523, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d10223979-r432645523-Palau_Robert-Barcelona_Catalonia.html", "text": "I really enjoyed the outomuro exhibit and the building in general! The only complaint was that it was boiling hot inside the exhibition. So much so that I couldn't stay and enjoy the photos for as long as I would have liked. I will continue to return for future exhibits! Fantastic location ajd cultural centre.", "publishedDate": "2016-10-29", "language": "en", "rating": 4}]}}]