[{"locationId": 7390331, "name": "Torre de les Aigues del Besos", "placeType": "ATTRACTION", "reviewListPage": {"reviews": [{"id": 689037218, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d7390331-r689037218-Torre_de_les_Aigues_del_Besos-Barcelona_Catalonia.html", "text": "The tower is closed until the third quarter of 2019.\n\nOriginally conceived as a water tower to supply water to the inhabitants of Barcelona, this tower was never used for it's original purpose as it was found that the water was not safe for human consumption. Uniquely for a building of this nature, it's made entirely of bricks without any metal support. At 51 metres, the tower looks majestic, especially with the spiral staircase on the outside of the tower about 40 metres up. Shame it's currently being renovated.", "publishedDate": "2019-07-12", "language": "en", "rating": 4}, {"id": 583849337, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d7390331-r583849337-Torre_de_les_Aigues_del_Besos-Barcelona_Catalonia.html", "text": "This tower is a landmark in Poblenou. It was initially planned to reach a height of  80m but construction  ceased at 51m. It was inaugurated in 1882.At that time it was the tallest building in Barcelona. Its purpose was to store and supply water to the city but due to poor quality the water was directed to industrial purposes. Refurbishment of the structured was completed between 2010/2012. The tower is brick construction with basic ornamental features. Good for a photo.", "publishedDate": "2018-05-30", "language": "en", "rating": 5}, {"id": 555532161, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d7390331-r555532161-Torre_de_les_Aigues_del_Besos-Barcelona_Catalonia.html", "text": "Off the beaten track. Great context to connect with the area of Poblenou.\nHistoric details and great views.\n", "publishedDate": "2018-01-22", "language": "en", "rating": 5}, {"id": 550367285, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d7390331-r550367285-Torre_de_les_Aigues_del_Besos-Barcelona_Catalonia.html", "text": "The last Saturday of the month they offer a night tour finishing with an amazing and romantic view all over the city of Barcelona and a glass of cava. As it was only my partner and me, the tour guide, who by the way was so passionate about the history of this tower, even offered to do the tour for us in English. The tower is designed by famous architect of modernism Pere Falqués who also designed the benches you find around the street lamps of paseo de gracia. After making our way all up to the top of the tower we enjoyed an amazing night view all over the city and finished the tour back down having a nice chat with the tour guide while having a glass of cava.", "publishedDate": "2017-12-31", "language": "en", "rating": 5}, {"id": 389869698, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d7390331-r389869698-Torre_de_les_Aigues_del_Besos-Barcelona_Catalonia.html", "text": "Stumbled across this, if that is possible for such a large object. It was free on the day but 2 Euro to view from the top from where you could see all over Barcelona. Lots of interesting art and sculptures with friendly helpful staff. The building itself is redundant water tower built entirely of brick and had a solid beauty all of its own. The climb is quite steep and not for the faint hearted. ", "publishedDate": "2016-07-06", "language": "en", "rating": 5}, {"id": 340649991, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d7390331-r340649991-Torre_de_les_Aigues_del_Besos-Barcelona_Catalonia.html", "text": "Good for a little walk after lunch.Interesting architecture around, pleasant pedestrian surroundings .", "publishedDate": "2016-01-17", "language": "en", "rating": 3}, {"id": 340475460, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d7390331-r340475460-Torre_de_les_Aigues_del_Besos-Barcelona_Catalonia.html", "text": "Well worth the €5 despite my Catalan de less than basic. Guide included us with references to Manchester and the industrial growth of late 19th century.\nExcellent engineering, great architecture, impressive display of artisan skills.\nOf course the views from top are wonderful but there is much more than that to appreciate", "publishedDate": "2016-01-16", "language": "en", "rating": 4}, {"id": 214972879, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d7390331-r214972879-Torre_de_les_Aigues_del_Besos-Barcelona_Catalonia.html", "text": "La Torre de les Aigües was built in 1882 by Pere Falqués, one of the many \"modernista\" architects in Cataluña at the time (think of Gaudí for example). It now stands out as a contrast to the new, hyper-modern Diagonal Mar.\nThe tower was supposed to provide water for parts of Barcelona, but because of the closeness to the sea the salinity level became too high, and the tower was closed down in the 1890s. It was then used by an industrial company until the late 1900s. This part of Barcelona used to house hundreds of factories; for this reason Barcelona was called \"Spain's Manchester\".\nRestoration work finished this year (cost about 3.5 million euros), and there are now regular visits to the tower. It is over 60 metres high and has four levels. From the observation deck you have an excellent view of the northern part of Barcelona. In an extension to the tower there is now the historical archives of Poblenou. \nAs far as I know the visits (some in the evening) are mainly in Catalán, and only on Sundays in Spanish. There might be a possibility of group visits with an English guide if you contact the administrators (see web site below).\nBy the way, the clock on the outside of the tower doesn't show the time, but the capacity of the water tank!\n\nFor further information, consult: www.torredelesaigues.cat", "publishedDate": "2014-07-12", "language": "en", "rating": 5}]}}]