[{"locationId": 531596, "name": "Casa Macaia (Palau Macaya)", "placeType": "ATTRACTION", "reviewListPage": {"reviews": [{"id": 736035618, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d531596-r736035618-Casa_Macaia_Palau_Macaya-Barcelona_Catalonia.html", "text": "Palau Macaya was designed by Josep Puig i Cadafalch, second only to Gaudi in the Catalan Art Nouveau movement, who is the author of several buildings in Barcelona but is little known to most visitors these days. Built as a family home for a rich industrialist, Palau Macaya passed through various uses before being turned into a cultural centre run by the La Caixa Foundation. Apart from the elegant decorated street facade, it is enough just to pop in to the light-filled atrium that serves as an entry hall with its balustraded staircase and tiled walls and floor. There is also an interesting photographic exhibition about the building and its architect.", "publishedDate": "2020-01-01", "language": "en", "rating": 4}, {"id": 675885173, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d531596-r675885173-Casa_Macaia_Palau_Macaya-Barcelona_Catalonia.html", "text": "I immediately saw from outside and walk to the hall. Finished in 1901, this elegant mansion with a grand courtyard was designed by Josep Puig i Cadafalch. Several artists were employed in its decoration. It is now an exhibition venue.", "publishedDate": "2019-05-23", "language": "en", "rating": 3}, {"id": 643347677, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d531596-r643347677-Casa_Macaia_Palau_Macaya-Barcelona_Catalonia.html", "text": "This is a nice looking building form the outside with a small quaint courtyard within. However, this is as far as the security guards will let you go inside. Not really worth the bother!", "publishedDate": "2019-01-03", "language": "en", "rating": 3}, {"id": 528566780, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d531596-r528566780-Casa_Macaia_Palau_Macaya-Barcelona_Catalonia.html", "text": "Barcelone is not great at signs or way-finding, so you have to search this out and it's worth it.  More beautiful architecture in the heart of downtown.", "publishedDate": "2017-09-30", "language": "en", "rating": 5}, {"id": 351836030, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d531596-r351836030-Casa_Macaia_Palau_Macaya-Barcelona_Catalonia.html", "text": "You were able to visit the courtyard with interesting gargoyles up the steps.  They also had various videos that you could listen to relating to the construction of the home.  All was free.  We were only there about 15 minutes.", "publishedDate": "2016-02-29", "language": "en", "rating": 4}, {"id": 341830019, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d531596-r341830019-Casa_Macaia_Palau_Macaya-Barcelona_Catalonia.html", "text": "One more modernist house in this quarter, this one was designed by Josep Puig i Cadafalch in 1901. It has a distinguished white facade with ocher ornaments. Don’t miss a relief of the bicyclist at the left side of the entrance - it is an homage to the architect who used to ride a bike through the city.", "publishedDate": "2016-01-21", "language": "en", "rating": 5}, {"id": 288110208, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d531596-r288110208-Casa_Macaia_Palau_Macaya-Barcelona_Catalonia.html", "text": "The outside of this building is lovely but unfortunately you cannot go inside to the art gallery. We were very disappointed! ", "publishedDate": "2015-07-12", "language": "en", "rating": 2}, {"id": 182754207, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d531596-r182754207-Casa_Macaia_Palau_Macaya-Barcelona_Catalonia.html", "text": "Very nice facade and court, which is accessible for free. The interior can not be visited and seems to be not original any more.", "publishedDate": "2013-10-28", "language": "en", "rating": 4}, {"id": 161828026, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d531596-r161828026-Casa_Macaia_Palau_Macaya-Barcelona_Catalonia.html", "text": "Not sure if one can even get into this building or if it would be worth doing so...but the exterior is very fanciful and a great representation of Moderniste style that isn't Gaudi.  It's got some very lighthearted sculptures on it and makes for some nice photos.  I recommend stopping by because it is on the way to La Sagrada Familia (assuming you're coming from the Las Ramblas, Passeig de Gracia area.  I've attached a couple of photos.  \n\nUnless you're a Moderniste nut...don't go out of your way...but again, assuming you're strolling to Sagrada...it's worth the two minute diversion off the main track.", "publishedDate": "2013-05-25", "language": "en", "rating": 4}]}}]