[{"locationId": 8036442, "name": "El Corte Ingles", "placeType": "ATTRACTION", "reviewListPage": {"reviews": [{"id": 750559174, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d8036442-r750559174-El_Corte_Ingles-Barcelona_Catalonia.html", "text": "Like many other big department stores, there is a lot for sale. It is worth while to enjoy lunch or dinner in the restaurant at the top floor from where you have a nice view over Barcelona.  However, don't expect a four or five star restaurant although the quality of the food is not bad. Opposite El Corte Ingles there are many bus lines, also to the airport.", "publishedDate": "2020-03-12", "language": "en", "rating": 4}, {"id": 743543354, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d8036442-r743543354-El_Corte_Ingles-Barcelona_Catalonia.html", "text": "We asked a simple questions at the information desk at the entrance, and the person was most unfriendly, made us feel very uncomfortable - We tried to have a sense of humour and a big smile, there was no way we felt welcome there. \nSo many nice people in Barcelona, why put someone who hates her job and people in the information desk!", "publishedDate": "2020-02-07", "language": "en", "rating": 2}, {"id": 735632669, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d8036442-r735632669-El_Corte_Ingles-Barcelona_Catalonia.html", "text": "Stomachache due to horrible chocolate con churros —after waiting 15 minutes for them. Before they were a reference. Today, avoid them.", "publishedDate": "2019-12-30", "language": "en", "rating": 1}, {"id": 735566763, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d8036442-r735566763-El_Corte_Ingles-Barcelona_Catalonia.html", "text": "This is a great store. It’s absolutely ginormous. We stopped at the food bit and it was fantabulous.", "publishedDate": "2019-12-30", "language": "en", "rating": 4}, {"id": 735499398, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d8036442-r735499398-El_Corte_Ingles-Barcelona_Catalonia.html", "text": "1) There's a nice foodcourt on the top floor. \n2) Tourist discounts are available in the form of credit points. I.e. If you make a purchase of $10, you get $1 in credit, which you can use to offset the next purchase.\n\nThe whole process was cumbersome because instructions were unclear. Before you pay, you have to check whether you can collect points on your purchase because some merchandise and brands are excluded. Two, check  whether you can use the credit points to offset your purchase. Again, certain brands are excluded. It didn't help that the girl working at Lindt just shrugged her shoulders and said, \"I don't know\", when asked whether the credit points could be used at the store. I got the same nonchalant reply when I asked if she could check with her colleagues. \n\nThis sent me walking round and round the mall to look for things to buy with my accumulated credit. But alas, I managed to end up with 40 cents left in my card.\n\nThe whole process could have been more hassle free for time-pressed tourists. ", "publishedDate": "2019-12-29", "language": "en", "rating": 4}, {"id": 735137789, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d8036442-r735137789-El_Corte_Ingles-Barcelona_Catalonia.html", "text": "We went here to grab water and found this huge multi level shopping mall. They have a restaurant, supermarket, and many different shopping levels. The supermarket prices were surprisingly very affordable and very crowded with locals. ", "publishedDate": "2019-12-28", "language": "en", "rating": 4}, {"id": 731994392, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d8036442-r731994392-El_Corte_Ingles-Barcelona_Catalonia.html", "text": "It is a very huge store , You can find anything you are looking for , But i notice that the prices are little higher than i saw in other smaller stores around the Ramblas street ", "publishedDate": "2019-12-10", "language": "en", "rating": 3}, {"id": 730735388, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d8036442-r730735388-El_Corte_Ingles-Barcelona_Catalonia.html", "text": "My girlfriend is in Barcelona with her best friend.  They have been traveling in Europe and this was the first time they were going to stay more than 2 days. I saw a review on Trip Advisor of this exact store that could provide 2 hour delivery in Barcelona.  \n\nFrom my experience .... dont waste your time, money or energy.  This store has items throughout its website that say click express.  HOME DELIVERY IN 2 HOURS OR THE TIME YOU WANT - is what is advertised.  All the items I selected were available as quick express.  I ordered at 400 a.m. US time which is 11 a.m. Barcelona time.\n\nStore said delivery between 1 and 3 p.m. Barcelona time.  No delivery occurred.  I spent better part of day sending emails to this company.  No emails ever returned.  I sought out their face book page who said they would get back to me.  No one has.  I even left message for them on Instagram.\n\nUnlike in the US where you have choice between English and Spanish there are not English options when you call the numbers available.\n\nSo its now day 3 of my Girlfriends stay and my surprise has still not been delivered.  The store it is coming from a manager could have walked it to her and left it  No call, no emails, no response from anyone but they had no problem taking the extra money for 2 hr shipping that never occurred.  \n\nI provided my girlfriends cell phone, my cell and work phone, both my work and home emails and other than they received, placed, and allegedly shipped the order I have not talked to one person.  For a store that carries luxury line products and supposed to have good customer service if I could rate them lest than terrible I would.\n\nI will not recommend them at all to anyone looking for delivery of goods from their website.", "publishedDate": "2019-12-04", "language": "en", "rating": 1}, {"id": 728026355, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d8036442-r728026355-El_Corte_Ingles-Barcelona_Catalonia.html", "text": "We needed a few things during our stay and this huge store worked as a one-stop for purchases.  They also have some good small things for souvenirs, unique to this part of Spain.  On the big Placa in the center.", "publishedDate": "2019-11-21", "language": "en", "rating": 4}, {"id": 720779265, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d8036442-r720779265-El_Corte_Ingles-Barcelona_Catalonia.html", "text": "Has bunch of brands but not too many. Has a convenient food court at the top with various foods including paella for one. Basement floor also has some take away places and a nice supermarket. Very convenient. ", "publishedDate": "2019-10-23", "language": "en", "rating": 4}, {"id": 720272571, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d8036442-r720272571-El_Corte_Ingles-Barcelona_Catalonia.html", "text": "In the dietetics aisle in the supermarket (lower ground floor) there is a good selection of gluten free bread, cereals, biscuits and cakes as well as other free from items.  Handy for snacks and items for breakfast, if not sure if your hotel can provide gluten free options.\n\n", "publishedDate": "2019-10-21", "language": "en", "rating": 4}, {"id": 714545084, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d8036442-r714545084-El_Corte_Ingles-Barcelona_Catalonia.html", "text": "Large 9 story department store offering a bit of everything. Nice shopping and fantastic views from the gourmet eatery on the 9th floor. Took our toddler to the toy section on the 8th floor and let him pick out a toy. Better than most U.S. department stores, but not the best European store I have been to.", "publishedDate": "2019-10-01", "language": "en", "rating": 3}, {"id": 705902575, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d8036442-r705902575-El_Corte_Ingles-Barcelona_Catalonia.html", "text": "Massive department store on the Plaça Catalunya.  Check out the restaurant area at the top for amazing views!", "publishedDate": "2019-09-03", "language": "en", "rating": 4}, {"id": 704162586, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d8036442-r704162586-El_Corte_Ingles-Barcelona_Catalonia.html", "text": "We visited this department store as you do.\nWhen we discovered the top floor restaurant canteen. Fantastic views of the city. So whilst there.....we decided to have coffee and pastries.\nLovely.\nSo we decided to come back for dinner and enjoy the city views at night.\nNoooooooo.......different style.\nNot as quiet and serene as lunch time.\nMayhem \nFood was rubbish\nWe thought the food was cooked fresh.....some of it was some was just microwaved.\nSo busy.....so dirty.....not Enough staff \nClearly couldn't cope with capacity of customers.\nAbsolutely disappointed. \nWhat a gem of a place but very bad organising.", "publishedDate": "2019-08-28", "language": "en", "rating": 2}, {"id": 703323065, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d8036442-r703323065-El_Corte_Ingles-Barcelona_Catalonia.html", "text": "Came here after lunch and bike tour.  Go straight to 9th Floor, grab a beer, coke light and water and maybe a sweet treat from cafeteria.  Great panoramic views of the city and a/c when it was warm in August.  Went there twice during our visit to Barcelona.", "publishedDate": "2019-08-26", "language": "en", "rating": 5}, {"id": 702772216, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d8036442-r702772216-El_Corte_Ingles-Barcelona_Catalonia.html", "text": "Each floor is a different department. It’s very crowded, but well organized. It’s located across the street from the Triangle Mall and near Catalunya Plaza. I don’t recommend shopping here.", "publishedDate": "2019-08-25", "language": "en", "rating": 5}, {"id": 701076715, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d8036442-r701076715-El_Corte_Ingles-Barcelona_Catalonia.html", "text": "If you want to experience the worst customer service in Barcelona - this place is for you. First, almost nobody speaks English. Second, while buying some cosmetic products I was charged twice and it was a challenge to get my money back- simply stuff do not understand what has happened and didn't want to assist. Third, after spending 20 minutes in a que at food court, you will be told that they don't accept contactless payments and that is ridiculous in 21t century. Never ever come here again, there are much better places around Barcelona for shopping experience ", "publishedDate": "2019-08-20", "language": "en", "rating": 1}, {"id": 698274379, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d8036442-r698274379-El_Corte_Ingles-Barcelona_Catalonia.html", "text": "We had a lovely lunch today on the top floor of El Corte Ingles the classy Selfridges type department store in Barcelona.\nAlways hard to know if you will get a consistent quality meal in a new city. Well think this place you can get sushi , tapas , beautiful salads , pizza Asian  foods , charcuterie, kids meals . All high quality. Meal for four with soft drinks 38 euro plus wonderful views of Barcelona.\n", "publishedDate": "2019-08-12", "language": "en", "rating": 5}, {"id": 696363807, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d8036442-r696363807-El_Corte_Ingles-Barcelona_Catalonia.html", "text": "This major store is in the centre of Barcelona at the square at the top of Las Rambla\nFor everything you need.\nGreat food court on the top floor with views", "publishedDate": "2019-08-06", "language": "en", "rating": 4}, {"id": 689291073, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d8036442-r689291073-El_Corte_Ingles-Barcelona_Catalonia.html", "text": "We were shopping & eating here today. Having an excellent time until our 8 year old wanted to use the toilets. Despite being quite obviously in desperate need the cleaner refused to allow her in and told us to use the toilets on the next floor. Unacceptable. She was unable to make it in time and was very upset and embarrassed. \nWe will think twice about shopping there again.", "publishedDate": "2019-07-13", "language": "en", "rating": 1}, {"id": 688511281, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d8036442-r688511281-El_Corte_Ingles-Barcelona_Catalonia.html", "text": "Really didnt think this place was that interesting. There are restaurants and shops all around, but nothing really to write home about. ", "publishedDate": "2019-07-10", "language": "en", "rating": 3}, {"id": 687491127, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d8036442-r687491127-El_Corte_Ingles-Barcelona_Catalonia.html", "text": "Landmark building in Plaza Catalunya. Went past the place many times. Was planning to visit on the sunday but it was closed on that day.\n\nThe topmost floor has beautiful views. Self service office cafe style dining looked inviting for a grub.\n\nSupermarket is downstairs. It is a busy place and counters had queues. Like other supermarkets it has automatic billing area and that was quick. There is a staff to help you in case you get stuck... I did need help with the language prompt 😊", "publishedDate": "2019-07-07", "language": "en", "rating": 4}, {"id": 687251577, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d8036442-r687251577-El_Corte_Ingles-Barcelona_Catalonia.html", "text": "From the time we stepped into the store we were wowed.  I read a review on TA about the food court on the top floor. AMAZING AND DELICIOUS!!!  Priced just right. We ate there several times and shopped in the store. Customer service was great in all areas and they have a lot. You must eat there. Grab your food cart and tray and explore. ", "publishedDate": "2019-07-06", "language": "en", "rating": 5}, {"id": 681317771, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d8036442-r681317771-El_Corte_Ingles-Barcelona_Catalonia.html", "text": "This place is an excelente option to have a casual lunch. It is a self service resto and you will find diferent chefs for all diferent food styles they offer. The food is generally cooked in the moment by request so you need to wait a few minutes until your choice is ready (the food is very good). The best part: If it's possible try to take a table just next to a window so you can enjoy an awesome rooftop view of Catalunya Square!. ", "publishedDate": "2019-06-13", "language": "en", "rating": 4}, {"id": 680216068, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d8036442-r680216068-El_Corte_Ingles-Barcelona_Catalonia.html", "text": "Tourists can get a card for discount card here but you must ask. Also tax free shopping! \nStaff are beyond appalling and disinterested in service in the women’s clothing and Majorca jewellery departments we went to. Just continued to chat to each other as we asked to see pearls. In the end we left and bought multiple things in a smaller shop. \nIf you can bear the rudeness of staff there are nice things here, from handbags and shoes to clothes.\nGood supermarket downstairs as well - staff here and in outside food shops much happier to help. \n", "publishedDate": "2019-06-09", "language": "en", "rating": 4}, {"id": 676570050, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d8036442-r676570050-El_Corte_Ingles-Barcelona_Catalonia.html", "text": "We dropped by this place for a few times because they have the good supermarket and deli sections underground.\n\nWe did scan through all floors on the first day, but we only hit the basement from our second visit\n They have high qualities of clothing and fashion items,  but we are kinda more interested to go to the basement to buy food items to cook our meal at our apartment room.  There is the famous market im Barcelona, but we do not speak Spanish, so buying the packed meat and vegetables from the supermarket made more sences. Qualities seem to be good and we went there everyday to stuff the fridge for breakies and dinner. Good that they open on Sunday.\n\nThey also have deli counter selling cooked food and bread. Great place for tourists.", "publishedDate": "2019-05-26", "language": "en", "rating": 5}, {"id": 675558727, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d8036442-r675558727-El_Corte_Ingles-Barcelona_Catalonia.html", "text": "This is a huge 9 story center right on one of the corners of plaza Catalunya.\n\n3rd floor is kids clothing and shoes, all sort of brands are entertained and a very wide price range.\n\n8th floor is electronics I bought an apple watch from there, and 9th floor is a food court with very nice views of the city.\n\nIf you are not Spanish, note that you can go to -2 with your receipt, and get a tax refund provided you are leaving the country with 21 days. Process is very quick, and you can receive the tax money in cash from there provided you have a credit card on you for guarantee. You will be given a paper to stamp at the airport and a paid envelope to mail the paper to government. Should you fail to do so, the money received plus a penalty will be charged to your credit card.\n\nOverall, the mail is comprehensive, and well priced. Well worth a visit!", "publishedDate": "2019-05-21", "language": "en", "rating": 5}, {"id": 674634122, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d8036442-r674634122-El_Corte_Ingles-Barcelona_Catalonia.html", "text": "We spent a couple of hours going from the grocery store at the bottom to the cafeteria at the top.  The view the cafeteria is great and worth the effort.", "publishedDate": "2019-05-17", "language": "en", "rating": 4}, {"id": 673228700, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d8036442-r673228700-El_Corte_Ingles-Barcelona_Catalonia.html", "text": "You cannot miss this enormous building next to Plaza Catalunya. \n\nIt is the biggest and most famous shopping center in Barcelona, with eleven floors and hundreds of different brands.\n\nDownstairs is a big supermarket.", "publishedDate": "2019-05-11", "language": "en", "rating": 4}, {"id": 668507877, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d8036442-r668507877-El_Corte_Ingles-Barcelona_Catalonia.html", "text": "when i tried to visit the department store on the sunday （april 14）it was closed. i was quite surprised because there were thousands of thousands tourists on RAMBLAS STREET that day! Is it every sunday closed? or only on special holidays??", "publishedDate": "2019-04-22", "language": "en", "rating": 5}, {"id": 665423265, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d8036442-r665423265-El_Corte_Ingles-Barcelona_Catalonia.html", "text": "Was given a tip off that the cafeteria was great value for money along with having a great view of Barcelona. Took the lift to the 9th floor and had breakfast there and went back for dinner in the evening. You get a great panoramic view of Barcelona, I would highly recommend a visit here. ", "publishedDate": "2019-04-11", "language": "en", "rating": 5}, {"id": 664856750, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d8036442-r664856750-El_Corte_Ingles-Barcelona_Catalonia.html", "text": "Go to the top floor of El Cortez Ingles to the cafeteria. There are lots of choices and it is all yummy and reasonably priced. Paella, sushi, tortillas.... something for everyone. Wines, desserts as well. Huge seating area has panoramic views over Barcelona. There is also a kid’s play area. This is a perfect spot when you return to Plaça Catalunya at the end of the day hungry and tired. Look no further!", "publishedDate": "2019-04-08", "language": "en", "rating": 5}, {"id": 664437357, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d8036442-r664437357-El_Corte_Ingles-Barcelona_Catalonia.html", "text": "This is Spanish department tore chain. I had a chance to visit the one located in Plaza Catalunya Barcelona. The service I received form an older lady in YSL cosmetics department was just outstanding.", "publishedDate": "2019-04-07", "language": "en", "rating": 5}, {"id": 656636037, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d8036442-r656636037-El_Corte_Ingles-Barcelona_Catalonia.html", "text": "El Corte Inglés is a HUGE department store. They sell everything - clothes, bags, shoes, electronics, souvenirs, and there's even a supermarket downstairs. There's also a food court on the top with options like pasta, pizza, paella, sandwiches, salads, just to name a few.\n\nFood is pretty good and prices are reasonable. My boyfriend and I shared an omelette and a seafood paella, which came with a good amount of seafood. However, I'm not sure if the food court is worth going to just because of the long checkout lines and fighting for a table. The seating area overlooks Placa de Catalunya, but it's tough enough getting a regular table, let alone a table with a view.\n\nI'm glad I got the chance to check it out but I doubt I would return.", "publishedDate": "2019-03-05", "language": "en", "rating": 3}, {"id": 655430575, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d8036442-r655430575-El_Corte_Ingles-Barcelona_Catalonia.html", "text": "Great food court with good variety of food and drink can get a bit busy but the views are good and the prices reasonable. Food was good overall.", "publishedDate": "2019-02-28", "language": "en", "rating": 4}, {"id": 654778028, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d8036442-r654778028-El_Corte_Ingles-Barcelona_Catalonia.html", "text": "This huge building in the main shopping street in Barcelona is the most traditional spanigh department store in Spain, with other stores inMadrid, Lisbon, Oporto and beyond. Fashion, accessories, all the main brands in the world, as well as a gourmet and beverage section. Worth eating in the underground. Worth visiting.", "publishedDate": "2019-02-25", "language": "en", "rating": 4}, {"id": 654354821, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d8036442-r654354821-El_Corte_Ingles-Barcelona_Catalonia.html", "text": "Very big and convenient shopping centre. You can buy everything there. Also, if you change your mind on what you bought, you can easily exchange it for money.", "publishedDate": "2019-02-23", "language": "en", "rating": 5}, {"id": 651350350, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d8036442-r651350350-El_Corte_Ingles-Barcelona_Catalonia.html", "text": "A friend had recommended to see the supermarket section of this department store in Barcelona. It is really an experience to see the amaizing selection of jamón, sausages and cheeses that the Spanish people enjoy. Makes me sad to go to the supermarket now...", "publishedDate": "2019-02-10", "language": "en", "rating": 5}, {"id": 649689688, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d8036442-r649689688-El_Corte_Ingles-Barcelona_Catalonia.html", "text": "An absolutely horrible service. Especially the womens shoe departement is totally neglecting their customers, make you feel like you are disturbing. Thet have a poor organisation and do not collaborate neither with each nor customers. I an sorry bit I have to recommend everyone to stay away.", "publishedDate": "2019-02-02", "language": "en", "rating": 1}, {"id": 646156658, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d8036442-r646156658-El_Corte_Ingles-Barcelona_Catalonia.html", "text": "This food court is a waste of great space. \nNot much food items to choose from. Clearly there’s demand for a restaurant in the building since it was packed with tourists. \nSalad Bar: just a few usual items. \nSoup: decent\nEverything else appeared grocery store deli counter quality. \nEmployees are on top of things. But the poor quality and poor selection of food make this place a 2 star restaurant. \nToo bad. It could be a 5 star restaurant if they decide to get serious. ", "publishedDate": "2019-01-15", "language": "en", "rating": 2}, {"id": 611177206, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d8036442-r611177206-El_Corte_Ingles-Barcelona_Catalonia.html", "text": "Store is huge. Amazing variety of departments. Clothing ranges the gamut from very inexpensive to designer extravagance. We enjoyed the food hall which has excellent variety of pre made snacks, crepes...the cafeteria on the top floor is worth a visit - very nicely presented food, chef hatted servers, and delightful views of Catalunya plaza. Short walk to amazing opancient cathedral. ", "publishedDate": "2018-08-27", "language": "en", "rating": 5}, {"id": 610275424, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d8036442-r610275424-El_Corte_Ingles-Barcelona_Catalonia.html", "text": "El corte ingles is a great shopping place in the centre of barcelona. With lots of brands and a lot of varities you will find anything you are looking for and more. Fo not miss it and don’t forget to go to the -2 floor to get your tax free voucher. ", "publishedDate": "2018-08-25", "language": "en", "rating": 5}, {"id": 608044514, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d8036442-r608044514-El_Corte_Ingles-Barcelona_Catalonia.html", "text": "We come here every time we visit Spain. It has lots of departments to look around in and shop. They have great deals because we go during the summer sales and they always have a further reduction at the till point.", "publishedDate": "2018-08-19", "language": "en", "rating": 4}, {"id": 607762138, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d8036442-r607762138-El_Corte_Ingles-Barcelona_Catalonia.html", "text": "In fact it’s a great place has a lot of variety brands throughout (8) floors, with great atmosphere and amazing views of the city on the top floor where you can enjoy your meal..\nIn addition to that there is a supermarket in the building, and more and more...", "publishedDate": "2018-08-18", "language": "en", "rating": 5}, {"id": 605128562, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d8036442-r605128562-El_Corte_Ingles-Barcelona_Catalonia.html", "text": "Since our rental was around the corner we shopped here daily. What an amazing store! And make sure you check out the restaurant on the top floor and the supermarket in the basement!", "publishedDate": "2018-08-10", "language": "en", "rating": 5}, {"id": 603427338, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d8036442-r603427338-El_Corte_Ingles-Barcelona_Catalonia.html", "text": "If you love shopping, Corte Ingles is a must. Tip!! Go downstairs to the tourist office and ask for a tourist card. You accumulate 10% of all your purchases (so you can get \"free\" stuff at the end of your shopping spree!)", "publishedDate": "2018-08-06", "language": "en", "rating": 5}, {"id": 602218142, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d8036442-r602218142-El_Corte_Ingles-Barcelona_Catalonia.html", "text": "The restaurant is located at the top floor of the Corte Ingles, It is like a buffet, You can pick your choice of food from a very good selection of kitchens(paella, spaghetti, sandwiches, pastry…) and you pay for items that you choose. Whatever you choose is very good. The portions are good and well priced. If you can sit in the outer perimeter you have a great view of the city. The place is very classy but very reasonable.  The staff is everywhere to help with selection or assist with..  The clean the tables rather promptly for the next. You can enjoy your meal with family and friends any hurry. You mus try it at least once.", "publishedDate": "2018-08-02", "language": "en", "rating": 5}, {"id": 595217967, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d8036442-r595217967-El_Corte_Ingles-Barcelona_Catalonia.html", "text": "Concierge recommendation and we went and stocked up on\nLots of cheeses\n- de ovej manche\n- divers ilches\n- cabra valsequi\n- en acei\n- cabra\n- bavaria\n- ecologi\n- azul\n- winsleydale ilcheste\nFoie gras\nAhumas domi\nBolsas reutil\n\nAt home we invited friends who enjoy these delicacies and had a great evening. ", "publishedDate": "2018-07-11", "language": "en", "rating": 4}, {"id": 593870204, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d8036442-r593870204-El_Corte_Ingles-Barcelona_Catalonia.html", "text": "While shopping, my wife’s bag got stolen.  It was attached on our kid’s travel prom but somehow, they managed to steal it without us noticing.  We went to the customer service to report the fact, and although they were polite, they were of very limited help because (a) they informed us that only the police could view the surveillance camera recordings and (b) they sent us to the police station to report the fact, which was more than 1 km away, in unknown surroundings.  When we finally managed to find the police station, the policeman guarding the entrance tried to deter us from filing a complaint by telling us that we might have to wait for 3-5 hours.\n\nOverall, I got the impression that muggings are so common that in reality they treat them as a mere matter of bad luck, without any real intention of doing anything about it, over and above keeping the minimum pretenses.  They might even treat it as a natural and expected part of a Spanish vacation!!!!!!", "publishedDate": "2018-07-07", "language": "en", "rating": 1}, {"id": 590321063, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d8036442-r590321063-El_Corte_Ingles-Barcelona_Catalonia.html", "text": "Our wifes had a shopping tour in the store, me and my friend had some hours to rest. We found a nice self service restaurant with an incredible view on the top of the store. Also the food was excellent!", "publishedDate": "2018-06-24", "language": "en", "rating": 5}, {"id": 587211646, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d8036442-r587211646-El_Corte_Ingles-Barcelona_Catalonia.html", "text": "Went here today on recommendation, terrific choice of different foods from many countries at very reasonable prices. This restaurant has views of the lovely city of Barcelona to die for, one ont to miss, especially the Restaurant on the 9th Floor.", "publishedDate": "2018-06-13", "language": "en", "rating": 5}, {"id": 584093376, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d8036442-r584093376-El_Corte_Ingles-Barcelona_Catalonia.html", "text": "This place has a heap of stuff, shows, clothes etc but the staff here are the worst. No service, poor attitude. Especially in the UA and New Balance area. Was going to buy a pair of shoes but there was no one to serve me, so left and went else where!", "publishedDate": "2018-05-31", "language": "en", "rating": 1}, {"id": 583740574, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d8036442-r583740574-El_Corte_Ingles-Barcelona_Catalonia.html", "text": "We used the travel agency to set up our train travel in Spain.  We ate in their top floor restaurant/cafeteria and found the quality and selection quite good at reasonable prices. Also bought saffron and smoked paprika (pimiento) to bring home for cooking. \nConveniently located near our hotel on the Rambla.  Great resource for travelers with English speaking high quality staffers.", "publishedDate": "2018-05-29", "language": "en", "rating": 4}, {"id": 583330854, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d8036442-r583330854-El_Corte_Ingles-Barcelona_Catalonia.html", "text": "This is a large Department Store, part of a Spanish chain. My wife likes shopping, well, more correctly, browsing. We had visited stores in Madrid and Seville, always a huge range on display, pricewise we considered it an upmarket store. This store was no different, great selection and displays and a range of prices. We did find that the sizing differs, a men's 4XL  varies from garment to garment and with very limited stock in this size range. Ditto ladies size L but no limit on the range available. My wife did enjoy a few purchases, I was left to believe that no male in Spain is larger than a 2XL. Service was helpful throughout.", "publishedDate": "2018-05-28", "language": "en", "rating": 4}, {"id": 581039917, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d8036442-r581039917-El_Corte_Ingles-Barcelona_Catalonia.html", "text": "Spain's big department store is like many big department stores elsewhere, so it is nice to go there for half an hour or so, to see it from the inside", "publishedDate": "2018-05-18", "language": "en", "rating": 3}, {"id": 579359417, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d8036442-r579359417-El_Corte_Ingles-Barcelona_Catalonia.html", "text": "Seven floors of shopping they will satisfy every member of your family , it caters for every need or requirement .It carry’s all top brands .\nThere is a food court on the 7th floor which is very upmarket and the food is delicious and the it’s good value for money .It has a large selection to chose .\nThere is a supermarket on the -1 level .\nI will definitely visit again .", "publishedDate": "2018-05-10", "language": "en", "rating": 5}, {"id": 578975559, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d8036442-r578975559-El_Corte_Ingles-Barcelona_Catalonia.html", "text": "Situated at the very top floor of El Corte Ingles is this restaurant with a wide variety of food from Spanish seafood paella to steaks and salad or even just coffee and sweets at very modest prices. The best thing however, is the view over Placa De Catalunya and in fact much of Barcelona. So treat yourself to good eats and the best view of the city! Get a window seat.", "publishedDate": "2018-05-09", "language": "en", "rating": 4}, {"id": 572538074, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d8036442-r572538074-El_Corte_Ingles-Barcelona_Catalonia.html", "text": "Great selection.  \nZero customer service. \nAssociate did not realize I spoke Spanish and spoke I'll of me to fellow associate.\nI promptly returned 1000 euro of merchandise.", "publishedDate": "2018-04-10", "language": "en", "rating": 1}, {"id": 572484237, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d8036442-r572484237-El_Corte_Ingles-Barcelona_Catalonia.html", "text": "This is a great, and really big, handsome department store in central Barcelona, right on Placa De Catalunya. Over its 9 floors, it has just about everything. My favourite part of the store is the restaurant on the top floor, which has a good self service and really exceptional views of the city. My other favourite part is the basement, which has a large deli \"Club del Gourmet\" and a great supermarket, good for buying Spanish and Catalan produce to take home.", "publishedDate": "2018-04-10", "language": "en", "rating": 4}, {"id": 571584625, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d8036442-r571584625-El_Corte_Ingles-Barcelona_Catalonia.html", "text": "You can buy what you need here or do some serious shopping.  My favorite area was the food, lots of fancy stuff, some good things to bring home.  Good displays and assistance.", "publishedDate": "2018-04-06", "language": "en", "rating": 3}, {"id": 568697773, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d8036442-r568697773-El_Corte_Ingles-Barcelona_Catalonia.html", "text": "Staff in the store in the different departments is very very rude. Nobody seems to like their job. Also they gossip about you since I do not look like I speak spanish, but I speak fluently. \nThe restaurant is really fun on the high floor, great view of the city, prices are very good for the location. Tortilla was delicious. They just need to organize everything a bit more. There are people alone sitting at tables for 4, or people not consuming at all taking on tables while others have to stand around looking for a place to sit and eat. BUt still worth the visit.", "publishedDate": "2018-03-25", "language": "en", "rating": 3}, {"id": 565516202, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d8036442-r565516202-El_Corte_Ingles-Barcelona_Catalonia.html", "text": "Huge selection--salads, sea food, pasta, sandwiches, grill, pizza, wine, dessert. Something here for every taste.  Free wi-fi and clean bathrooms.", "publishedDate": "2018-03-09", "language": "en", "rating": 5}, {"id": 565125025, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d8036442-r565125025-El_Corte_Ingles-Barcelona_Catalonia.html", "text": "This huge department was just fun to see what the current styles are in Barcelona. Actually, we went there to eat at La Rotonda, a buffet restaurant on the 8th floor with  amazing views of the area. The food choices are endless - from Spanish to Chinese to Pizza or hamburgers and more. Service was good and the food delicious.", "publishedDate": "2018-03-07", "language": "en", "rating": 4}, {"id": 564297939, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d8036442-r564297939-El_Corte_Ingles-Barcelona_Catalonia.html", "text": "Firstly I find It very very cheerful. Great selection of clothes, shoes, household goods and much much mote", "publishedDate": "2018-03-04", "language": "en", "rating": 5}, {"id": 551095994, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d8036442-r551095994-El_Corte_Ingles-Barcelona_Catalonia.html", "text": "A Spanish department store located throughout major cities in Spain.  This one is located around the perimeter of Placa Catalunya.  It is just a department store, no special products.  It does have a pretty good souvenir section on the upper levels.", "publishedDate": "2018-01-03", "language": "en", "rating": 3}, {"id": 550354368, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d8036442-r550354368-El_Corte_Ingles-Barcelona_Catalonia.html", "text": "El Corte Ingles is a typical downtown department store. The prices are significantly overpriced compared to Macy's and any other department store carrying similar brands. However, it is still fun to walk around the store to see the locals and people watch. Also, the food court in the basement is very good.", "publishedDate": "2017-12-30", "language": "en", "rating": 4}, {"id": 549459721, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d8036442-r549459721-El_Corte_Ingles-Barcelona_Catalonia.html", "text": "Centrally located next to Plaça de Catalunya, the main store of El Corte Ingles is a good place to do your shopping under one roof. There's a food court on the top floor (which is average) and a supermarket in the basement level.\n\nIf you're a tourist, remember to bring your passport and get your discount card in the customer service section in the basement level.", "publishedDate": "2017-12-27", "language": "en", "rating": 4}, {"id": 549029471, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d8036442-r549029471-El_Corte_Ingles-Barcelona_Catalonia.html", "text": "It’s a big store, you will find a lot, but it is a bit expensive. There are more El corte Ingles shops around this square Pl.d.l. Catalunia, so if you can’t find it in one, go to the other ;)", "publishedDate": "2017-12-24", "language": "en", "rating": 3}, {"id": 548895443, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d8036442-r548895443-El_Corte_Ingles-Barcelona_Catalonia.html", "text": "As in many other stores of this chain, good quality and very diverse products. However, for such a massive store, with several thousand customers per day, finding and accessing the toilet was a mission!!!! Only one and small (in the entire 4 floor building!), and a long queue of people waiting.\n\nVery disappointing!", "publishedDate": "2017-12-23", "language": "en", "rating": 4}, {"id": 546247273, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d8036442-r546247273-El_Corte_Ingles-Barcelona_Catalonia.html", "text": "This is your typical high end department store, if you come from any other Western country it will not surprise you. The beauty is that at the bottom there is a food court and supermarket which is very handy for picking up groceries and bottled water, and the aisles frequently have servers handing out tasty samples.", "publishedDate": "2017-12-09", "language": "en", "rating": 3}, {"id": 545595273, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d8036442-r545595273-El_Corte_Ingles-Barcelona_Catalonia.html", "text": "It’s not exactly cheap but they have some very high quality clothing and accessories.  We bought a substantial amount of clothing ourselves. It’s a busy place so prepare yourself for large crowds. ", "publishedDate": "2017-12-06", "language": "en", "rating": 4}, {"id": 544897748, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d8036442-r544897748-El_Corte_Ingles-Barcelona_Catalonia.html", "text": "At the 9th flr of this department store is a fsatfood ctr wrr you choose the food some are ready made, some just recently cooked and some cooked as u order. Varieties of cuisine like asian, mediterranean, halal foids. What striked us most was the paella paired with grilled chicken or steak plus vegie salad. We ate at other restau who served paella but nothing compared with the tadte of that at el corte ingles food court. A \"MUST\" place to eat and enjoy cataluna culinary. The dining place is very nice and clean . Always full if diners.", "publishedDate": "2017-12-03", "language": "en", "rating": 5}, {"id": 543682106, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d8036442-r543682106-El_Corte_Ingles-Barcelona_Catalonia.html", "text": "I love this store.  I have been here a few times as I usually stay in the area.  This time we visited to get some wine and snacks for our stay in Barcelona (and some wine for our cruise).  This is a huge grocery store with a lot to pick from.  I’ve purchased yogurt for breakfast, wines, chips, etc.  Very convenient location!", "publishedDate": "2017-11-27", "language": "en", "rating": 4}, {"id": 538439974, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d8036442-r538439974-El_Corte_Ingles-Barcelona_Catalonia.html", "text": "All you may need in all areas. Such a huge variety and well organized, with a personal attention that is not trivial in a big department store", "publishedDate": "2017-11-05", "language": "en", "rating": 5}, {"id": 536908303, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d8036442-r536908303-El_Corte_Ingles-Barcelona_Catalonia.html", "text": "Popped up to the 9th floor restaurant yesterday after time spent exploring this great city. Lovely view of Barcelona but that's where it ends.\nPoor, rushed & impatient service, very unpleasant and expensive food. Left after a few mouthfuls of a tepid, tasteless and curdled lasagna. Topped off with dirty, shabby toilets. A very unpleasant and disappointing experience.", "publishedDate": "2017-10-29", "language": "en", "rating": 1}, {"id": 535954448, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d8036442-r535954448-El_Corte_Ingles-Barcelona_Catalonia.html", "text": "you can find just about anything here for your shopping needs. I found soccer jerseys thtr my family needed.", "publishedDate": "2017-10-25", "language": "en", "rating": 5}, {"id": 532377856, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d8036442-r532377856-El_Corte_Ingles-Barcelona_Catalonia.html", "text": "Some nice shopping on multiple levels.  Grocery store in the basement and restaurant on top.  Restaurant has great views while grabbing a bite and a glass of wine.  Can be overwhelming for Americans as we aren't as used to that many levels of shopping.  Whether it's a rainy day or you need something, I'd go here.", "publishedDate": "2017-10-12", "language": "en", "rating": 5}, {"id": 531530129, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d8036442-r531530129-El_Corte_Ingles-Barcelona_Catalonia.html", "text": "It is a very good and big department store in barcelona, it has a variety of brands and offers. But if you are staying for a few days in barcelona and you wanna do shopping make sure to do it right away because you may find it close the other days of your stay! That's what happened to us, it is closed on sundays and it seems there are a lot of festivals in barcelona when all the shops are closed even the supermarket in the lower level!", "publishedDate": "2017-10-09", "language": "en", "rating": 4}, {"id": 528478075, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d8036442-r528478075-El_Corte_Ingles-Barcelona_Catalonia.html", "text": "I was lucky to be at El Corte Ingles on my birthday day, because hubby will have to fulfill my shopping wishes.\n\nIt has different floors each one of them with only male/female/kids stuff. I have to say that shopping here is not cheap at all but the merchandise its exclusive. I found a beautiful winter jacket made in Spain that I fell in love with.\nI was amazed with the organization of the place it was easy to find sizes and colors and the employees were attentive patient and kind.\n\nI want to give you two advises that I wish I knew.\n1.- Go there with time maybe 4 or 5 hours. WHY??\n2.- Before get inside just go to level 0 take the elevators down, BECAUSE:\nIf you are a tourist you get into an office pick a number sit down an wait your turn, to get a special discount card. you have to get this first because this discount card will only work after your first purchase. (the second and forward will have discount)\nTake your passport with you to El Corte Ingles.\nI got to know this when I got the jacket I mentioned before and that was my last purchase so we had the option to returned we got and buy it again.\ndue to the Euro/Dollar credit card situation and also we have to pick up my niece from school and we didn't have time for the waiting at the tourist office  we decided not to do that.\n\nOther than that I don't regret buying my beautiful unique clothing in here.\n\nIMPORTANT: lets say if you are in woman department and you want to go to men department make sure you pay before moving up thru floors.", "publishedDate": "2017-09-30", "language": "en", "rating": 5}, {"id": 528191533, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d8036442-r528191533-El_Corte_Ingles-Barcelona_Catalonia.html", "text": "Well, its a large department store, expensive, but high quality products, supermarket and barber,\nRecommend.", "publishedDate": "2017-09-28", "language": "en", "rating": 5}]}}]