[{"locationId": 3467639, "name": "MUHBA Via Sepulcral Romana", "placeType": "ATTRACTION", "reviewListPage": {"reviews": [{"id": 683487505, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d3467639-r683487505-MUHBA_Via_Sepulcral_Romana-Barcelona_Catalonia.html", "text": "Isn't it interesting to see how the ground rises throughout the years? Here we were on a ground level street gazing into a pit which was proof of the ground level several millenia ago during the Roman occupation of Spain. Ancient tombs. Roman ones. My first thought was Muslim tombs because of the style and orientation of them. But no. Roman. That's amazing. It was an illustration to me, as much as anything else, of the value of taking along some expert local knowledge occasionally, as opposed to wandering blindly around and missing exciting things. So there you go. A free glimpse of the extraordinary right there on (under) a little Barcelona street, just off the Rambla. I'd swap this for the horrible wavy tiles any day!\nThanks Adrian from Free Tours Barcelona!", "publishedDate": "2019-06-22", "language": "en", "rating": 5}, {"id": 660077330, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d3467639-r660077330-MUHBA_Via_Sepulcral_Romana-Barcelona_Catalonia.html", "text": "This Roman ruins in right in the heart of Barcelona and is a fantastic sight which I recommend you visit.  Great photos, too.", "publishedDate": "2019-03-21", "language": "en", "rating": 5}, {"id": 659790417, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d3467639-r659790417-MUHBA_Via_Sepulcral_Romana-Barcelona_Catalonia.html", "text": "One block off the tourist hustle of the Ramblas.... a quiet reflective place... a piece of Rome in Barcelona", "publishedDate": "2019-03-20", "language": "en", "rating": 4}, {"id": 658664097, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d3467639-r658664097-MUHBA_Via_Sepulcral_Romana-Barcelona_Catalonia.html", "text": "Another tiny slice of Roman history.  Originally on the road to the Roman centre of Barcelona, a set of ancient tombs remain.  Set below the existing ground level there are several places to view the row of tombs.  ", "publishedDate": "2019-03-15", "language": "en", "rating": 3}, {"id": 653629474, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d3467639-r653629474-MUHBA_Via_Sepulcral_Romana-Barcelona_Catalonia.html", "text": "This Roman Necropolis, hidden for centuries under buildings demolished after the civil war, is just a few seconds off the top of the Rambla-go down Carrer Canuda. Entry is free if you have visited MUBHA or else a token euro but you can just as easily view the tombs from street level for free. I enjoy walking past and thinking about the history of the place each time I visit Barcelona. The necropolis, once outside the city walls of Roman Barcino gives you an indication of the importance of the Roman settlement.", "publishedDate": "2019-02-19", "language": "en", "rating": 4}, {"id": 642244831, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d3467639-r642244831-MUHBA_Via_Sepulcral_Romana-Barcelona_Catalonia.html", "text": "These Roman ruins are housed in a small square and can be seen from a viewing walkway above if the actual entrance doors are closed. They are housed within the Gothic Quarter but I wouldn't go out of your way to view them if you're pushed for time.", "publishedDate": "2018-12-29", "language": "en", "rating": 3}, {"id": 621375970, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d3467639-r621375970-MUHBA_Via_Sepulcral_Romana-Barcelona_Catalonia.html", "text": "It is located in Placa Villa de Madrid in the Old Town (Ciutat Vella) section.  It is pretty close to La Rambla.  In the 2nd and 3rd centuries AD, Romans built their cemeteries outside of the city's walls and this excavation discovery of 70 tombs is an ancient Roman necropolis.  \n\nAn elevated viewing wall looks down into the cemetery's sarcophagus collection", "publishedDate": "2018-10-02", "language": "en", "rating": 4}, {"id": 551085195, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d3467639-r551085195-MUHBA_Via_Sepulcral_Romana-Barcelona_Catalonia.html", "text": "A very interesting stop on our walking tour.  One can view these graves from the street level.  So much history  in this area.  They say that you can view the tombs up close but the entry passage was not accessible during our stopover.  Such a unique part of history nestled between modern buildings.", "publishedDate": "2018-01-02", "language": "en", "rating": 4}, {"id": 461557778, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d3467639-r461557778-MUHBA_Via_Sepulcral_Romana-Barcelona_Catalonia.html", "text": "The remains can be seen, although many times the walkway is closed and unaccessible. You might want to take a look only if you happen to be in the area. Otherwise not a place you want to bother to find if it's out of your way.", "publishedDate": "2017-02-20", "language": "en", "rating": 3}, {"id": 455335477, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d3467639-r455335477-MUHBA_Via_Sepulcral_Romana-Barcelona_Catalonia.html", "text": "Its not very big and easy missed but is worth a quick stop if you are in the area, considering they are 2000 years old it is quite surreal to see it against the newer built up buildings around it and reminds you of the cities rich history. It is beautifully excavated and presented", "publishedDate": "2017-01-27", "language": "en", "rating": 4}, {"id": 441837441, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d3467639-r441837441-MUHBA_Via_Sepulcral_Romana-Barcelona_Catalonia.html", "text": "Turn down  Carrer Canuda at the top of the Ramblas and you will find these tombs. If you have a ticket from the Roman history museum, the entrance is free-otherwise 1 euro I think. Actually all the historical information is at the entrance and you can easily view the tombs by looking down from the road. You need only go down if you wish to read the Latin inscriptions-I had a free entry ticket and did so.", "publishedDate": "2016-12-03", "language": "en", "rating": 4}, {"id": 429887553, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d3467639-r429887553-MUHBA_Via_Sepulcral_Romana-Barcelona_Catalonia.html", "text": "I'm a huge fan of italy and any chance I get to check out the local roman ruins, I'm there.\n\nThe Via Sepulcral Romana is very important. You can get right above the ruins, for free and get up close and get some nice photos. If you want, you can pay for entry in the small museum center but I think if you're in the area take 2 minutes to check these out. If you like Roman things, spend 10 minutes like us reading about the history of what they found in this square, how the face of the square has changed (buildings, etc.) and how over time they kept preserving these ruins.  It's awesome!", "publishedDate": "2016-10-19", "language": "en", "rating": 4}, {"id": 403875771, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d3467639-r403875771-MUHBA_Via_Sepulcral_Romana-Barcelona_Catalonia.html", "text": "This is a small group of old Roman tombs in the middle of a square off La Rambla.  The history is very interesting.  I'm glad to see they built around the tombs and made them visible from street level (they are actually below street level).\n\nThe visit would take less than 30 minutes.\n\nLike so many unique and interesting parts of Spain and Europe as a whole, you never know what interesting pieces of history are around each corner and it is worth a visit if nearby.  I very much appreciate the preservation and the care taken to secure the tombs.", "publishedDate": "2016-08-10", "language": "en", "rating": 4}, {"id": 366493126, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d3467639-r366493126-MUHBA_Via_Sepulcral_Romana-Barcelona_Catalonia.html", "text": "This small and old cemetery is close to La Rambla. This is in the middle of a square. Even without paying the ticket fee, one can get a good view of this ancient cemetery.", "publishedDate": "2016-04-22", "language": "en", "rating": 3}, {"id": 361304931, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d3467639-r361304931-MUHBA_Via_Sepulcral_Romana-Barcelona_Catalonia.html", "text": "A brilliant archaeological exhibit beautifully presented in situ at this plaza. Worth stopping 10 minutes to take in some of the history.", "publishedDate": "2016-04-03", "language": "en", "rating": 4}, {"id": 351542051, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d3467639-r351542051-MUHBA_Via_Sepulcral_Romana-Barcelona_Catalonia.html", "text": "You can look down on various graves that have been excavated from the Roman period.  It is a quick stop to take in some history.", "publishedDate": "2016-02-28", "language": "en", "rating": 3}, {"id": 336527366, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d3467639-r336527366-MUHBA_Via_Sepulcral_Romana-Barcelona_Catalonia.html", "text": "A fascinating place to visit. So much history and beauty. It will take several visits to appreciate all that is there.", "publishedDate": "2016-01-01", "language": "en", "rating": 5}, {"id": 315646312, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d3467639-r315646312-MUHBA_Via_Sepulcral_Romana-Barcelona_Catalonia.html", "text": "This is only a ten minute stop on your way through, but one worth making, particularly given that it's only a few paces off La Rambla. It's beautifully excavated and presented and it's a joy to see the respect this city has for its past. You can simply look down from around the walkway and also pay your respects. It surprised me how many roman sites there were in this city.", "publishedDate": "2015-10-02", "language": "en", "rating": 5}, {"id": 283617671, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d3467639-r283617671-MUHBA_Via_Sepulcral_Romana-Barcelona_Catalonia.html", "text": "There is an amazing story behind how these tombs were discovered during planned construction of a road. Thankfully they were preserved and the space turned into a park.  I did not have a ticket to get close to them but I got a pretty good sense viewing them from above; probably not worth paying to get closer but a nice thing to have seen.", "publishedDate": "2015-06-28", "language": "en", "rating": 3}, {"id": 259385381, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d3467639-r259385381-MUHBA_Via_Sepulcral_Romana-Barcelona_Catalonia.html", "text": "The MUHBA Via Sepulcral Romana is an interesting historical site to visit. Similar to what you can find in Rome, Barcelona continues to unearth many wonderful historical relics within the city and is making them open to the public - as a living open air history museum'. Wonderful. MUHBA has many wonderful sites all around the city. The MUHBA Via Sepulcral Romana (Roman Tombs/ Burial Ground) are a great example of this. Recommended!", "publishedDate": "2015-03-14", "language": "en", "rating": 4}, {"id": 251326185, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d3467639-r251326185-MUHBA_Via_Sepulcral_Romana-Barcelona_Catalonia.html", "text": "We came here as part of our visit to many of the Roman sites in Barcelona. You can buy a ticket to see all of them, but you should check how many actually charge for admission before committing to that ticket. Several sights are out of town and you may find, as we did, that others are closed, thus reducing the savings from the combined ticket. With this place, you can see a great deal from the street and so you may not want to pay for admission.\n\nThere is little information available in English, which seems odd given the tourism in Barcelona. This means that you have to rely on understanding Spanish or just knowing about Roman history. There isn't much to see inside the small display area, but it is good to look at the grave markings and reflect on the immortality that these people have achieved by having people read their name almost 2000 years after they died. \n\nI'm not sure that I would have bothered to see this if we didn't have the combined ticket. We enjoy looking at Roman remains, so would always want to go somewhere like this, but still felt slightly disappointed by the experience. \n\nNice ice cream shop in the same square though.", "publishedDate": "2015-01-27", "language": "en", "rating": 3}, {"id": 236914854, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d3467639-r236914854-MUHBA_Via_Sepulcral_Romana-Barcelona_Catalonia.html", "text": "I don't know what I was expecting, but this was a pleasant surprise.  The city has turned this historic location  into a useful park for the city, thus not wasting any space.  It was very neat and the ruins were in good condition considering people could walk up and touch them...", "publishedDate": "2014-10-29", "language": "en", "rating": 4}, {"id": 195165076, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d3467639-r195165076-MUHBA_Via_Sepulcral_Romana-Barcelona_Catalonia.html", "text": "It is an amazing excavation, which shows Roman architecture and their life style.  Wine making brewery is flawlessly protected.  The video tour will explain neatly, how romans built structure, how they lived, life style etc.  Minute details like how they washed clothes, maintained spa etc.  Worth a visit to see the beauty of Roman culture", "publishedDate": "2014-02-23", "language": "en", "rating": 4}, {"id": 183026165, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d3467639-r183026165-MUHBA_Via_Sepulcral_Romana-Barcelona_Catalonia.html", "text": "Interesting to see how Barcelona is made of different layers of architecture. If you're walking close to it, it's worth a 20 minutes visit. If you don't want to pay, it is okay, since it is possible to see it from the top level of the square", "publishedDate": "2013-10-31", "language": "en", "rating": 5}, {"id": 140016931, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d3467639-r140016931-MUHBA_Via_Sepulcral_Romana-Barcelona_Catalonia.html", "text": "This is a tiny archaeological and historical exhibition in Placa Villa de Madrid. Costs 2 euros to enter, but if you kept your ticket from any of the other history museums (the MUHBA ones) then entrance is free.\nBasically it's one small room with several displays and a small walk in a 2000 year old cemetery. Nothing too special - except one thing. There is an ancient map of Europe, drawn short and wide. Really interesting. I spent about 10 minutes just looking at it and figuring out what is what.\nIf you're into history and archaeology (and maps) then it's a must, considering it's either free or really cheap. If it's not your thing, take a look at the cemetery from above and move on.", "publishedDate": "2012-09-11", "language": "en", "rating": 4}]}}]