[{"locationId": 2531489, "name": "Palau del Baro de Quadras", "placeType": "ATTRACTION", "reviewListPage": {"reviews": [{"id": 725178407, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d2531489-r725178407-Palau_del_Baro_de_Quadras-Barcelona_Catalonia.html", "text": "The Palau Baró de Quadras is a small Modernista palace, built between 1904 and 1906 by architect Puig i Cadafalch. The Palau is located  on Avinguda Diagonal.The modest size, but the outstanding  Palau Baró de Quadras is one of the jewels of Catalan modernism . The building is reminiscent of North-European palaces. The main facade is Gothic in its representation, referring to the Norman Gothic. The long, ornate balcony, with its busts of eminent medieval and Renaissance figures, floral motifs and heraldic shields, and the mansards on the upper floor, are really in keeping with the medieval European style. The gargoyles are particularly impressive. The interior of the palace hall deserves special attention.  The wide marble stairs are simply wonderful. The Palau opens to the public every Wednesday between 11 and 13h. Highly recommend.", "publishedDate": "2019-11-09", "language": "en", "rating": 5}, {"id": 689548168, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d2531489-r689548168-Palau_del_Baro_de_Quadras-Barcelona_Catalonia.html", "text": "The museum is not free as some have mentioned, at least not when I was there nor according to their website. The house museum conducts guided tours every Wednesday between 11am and 1pm, which costs €10. The English tour is at 11 and Catalan and Spanish at 12 an 1pm respectively. So quite limited.\n\nAs for the museum, it a house museum, which was originally a private residence designed by Josep Puig i Cadafalch in the Catalan Modernist architectural style, mixed with Gothic and Neo-Mudejar. The front façade has an impressive façade has impressive Gothic balconies, almost like a bay window covering the enter first floor level of the building.\n\nThe entrance to the building has demo-roofs typical of Neo-Mudejar buildings has does the upper part of the front. As you enter the building, the elaborate decorations of the stairway, mosaic walls and a glasswork on the skylight makes it instantly recognisable as Catalan Modernism as familiar to anyone who been inside Casa Mila or Casa Batllo.\n\nDefinitely worth a visit if you can accommodate the limited opening hours.", "publishedDate": "2019-07-14", "language": "en", "rating": 5}, {"id": 675884819, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d2531489-r675884819-Palau_del_Baro_de_Quadras-Barcelona_Catalonia.html", "text": "Built in 1906, this handsome house is by Josep Puig i Cadafalch. The intricate,\nsculptured frieze above the first-floor windows has close affinities to early Renaissance Plateresque style.", "publishedDate": "2019-05-23", "language": "en", "rating": 3}, {"id": 635432213, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d2531489-r635432213-Palau_del_Baro_de_Quadras-Barcelona_Catalonia.html", "text": "When viewed from the Avinguda Diagonal, the building is reminiscent of North-European palaces, with an intricately carved neo-plateresque style which highlights the noble character of the building. Here, the long, ornate balcony, with its busts of eminent medieval and Renaissance figures, floral motifs and heraldic shields, and the mansards on the upper floor, are fully in keeping with the medieval European style.", "publishedDate": "2018-11-24", "language": "en", "rating": 4}, {"id": 585388656, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d2531489-r585388656-Palau_del_Baro_de_Quadras-Barcelona_Catalonia.html", "text": "The facade of this building is impressive and photogenic. However the information is missing. We did not realize that it was open to the public and admission is free. Better management needed.", "publishedDate": "2018-06-05", "language": "en", "rating": 3}, {"id": 571344657, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d2531489-r571344657-Palau_del_Baro_de_Quadras-Barcelona_Catalonia.html", "text": "There's good things and less good things about being in Barcelona...a less good thing is when you are utterly unaware of a fantastic building like this one, only to spot it while you're in a taxi... and no time to investigate it! The lower rating is only because it doesn't seem like \"I was there\"...", "publishedDate": "2018-04-05", "language": "en", "rating": 3}, {"id": 503592840, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d2531489-r503592840-Palau_del_Baro_de_Quadras-Barcelona_Catalonia.html", "text": "We did the 1 hour tour.  If you want an english tour you have to come on Wednesday at 11.  The girl that gave the tour did an excellent job. If you are truly interested in the history take the tour. Otherwise, come and take pictures of the staircase. You will see multiple rooms during the tour. Beautiful construction throughout. I would not go out of your way for this attraction though.", "publishedDate": "2017-07-19", "language": "en", "rating": 3}, {"id": 389267775, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d2531489-r389267775-Palau_del_Baro_de_Quadras-Barcelona_Catalonia.html", "text": "When you are tired of Gaudi and audio tours, visit one of the Casas Singulares (also Casa Amantller and Casa Lleo Morera on the same block as Casa Battlo). Note: this building is open Wednesdays only, with bilingual tours. (As the only English speaker, descriptions were given in Catalan first, then English, leaving me to wonder if I was getting all the information!) Nouria was excellent and informative. The tour provides a thorough look at a Neo-Gothic / Modernist house by Puig I Calafalch, a contemporary of Gaudi's. I recommend highly for those interested in a deeper look at architecture of the period. ", "publishedDate": "2016-07-04", "language": "en", "rating": 5}, {"id": 380830944, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d2531489-r380830944-Palau_del_Baro_de_Quadras-Barcelona_Catalonia.html", "text": "This building was the most incredible we've seen and the lobby was spectacular. Sadly we were unable to see more as entry is limited to pre booked tours on specific times on Wednesdays only. It is a pity this was not mentioned elsewhere as we were disappointed", "publishedDate": "2016-06-08", "language": "en", "rating": 4}, {"id": 342300278, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d2531489-r342300278-Palau_del_Baro_de_Quadras-Barcelona_Catalonia.html", "text": "The work of Josep Puig i Cadafalch, who was commissioned by Baron de Quadras to refurbish the building, has two different and interesting facades. One, on the Avinguda Diagonal, emphasizes the noble character of the building in style of North-European palaces and the other, overlooking the Carrer del Rossello, is in modernist style with some secession characteristics.", "publishedDate": "2016-01-24", "language": "en", "rating": 5}, {"id": 326267769, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d2531489-r326267769-Palau_del_Baro_de_Quadras-Barcelona_Catalonia.html", "text": "Palau del Baro de Quadras. Beautiful building with great architecture. Well worth a visit if you are near Avinguda Diagonal.", "publishedDate": "2015-11-12", "language": "en", "rating": 5}, {"id": 287584128, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d2531489-r287584128-Palau_del_Baro_de_Quadras-Barcelona_Catalonia.html", "text": "Absolutely a must go !  Build by Josep Puig i Cadafalch between 1904 i 1906 and in its architecture and decoration it has islamic influences.", "publishedDate": "2015-07-10", "language": "en", "rating": 5}, {"id": 137425362, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d2531489-r137425362-Palau_del_Baro_de_Quadras-Barcelona_Catalonia.html", "text": "Designed by Modernista architect Puig i Cadafalch and now occupied by Casa Asia this is a little gem of a building. The exhibitions are quite specialist but it is worth visiting for the rooftop view and fantastic interiors.", "publishedDate": "2012-08-17", "language": "en", "rating": 4}]}}]