[{"locationId": 2218960, "name": "Museo del Perfume (Museum of Perfume)", "placeType": "ATTRACTION", "reviewListPage": {"reviews": [{"id": 705664841, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d2218960-r705664841-Museo_del_Perfume_Museum_of_Perfume-Barcelona_Catalonia.html", "text": "It was great we saw videos of the process, and the explanations behind the creation of the perfumes. Very educational", "publishedDate": "2019-09-02", "language": "en", "rating": 5}, {"id": 629003964, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d2218960-r629003964-Museo_del_Perfume_Museum_of_Perfume-Barcelona_Catalonia.html", "text": "Many perfumes you've heard of from the 40's on up to present. Also bottles and other vessels for perfumes, ointments and incense from ancient Greece, ancient Egypt, Japan, etc. It's in the back of a perfume store, so if you're inspired you can buy some perfume of your own. I like small quirky museums and I like perfume and I was staying at a guesthouse across the street, so this was a very nice way to spend about 45 minutes. It's on Passeig de Gracia not far from the \"Street of Discord\" with the 3 moderniste buildings.", "publishedDate": "2018-10-27", "language": "en", "rating": 4}, {"id": 541869409, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d2218960-r541869409-Museo_del_Perfume_Museum_of_Perfume-Barcelona_Catalonia.html", "text": "I am a perfume bottle collector so I loved this museum.  You enter through a perfume shop.  This little gem is located in the back.  The clerk was friendly and turned on the lights, leaving us alone to explore at our leisure.  They have a lovely collection spanning several centuries.  I really wanted to see the bottle owned by Marie Antoinette.  I was not disappointed.  If you love perfume bottles, don't miss this one.", "publishedDate": "2017-11-18", "language": "en", "rating": 5}, {"id": 530681669, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d2218960-r530681669-Museo_del_Perfume_Museum_of_Perfume-Barcelona_Catalonia.html", "text": "Cocopop25 summed it up nicely. I was really looking forward to this and we hunted it out but the whole experience was disappointing. We had to wait a while to buy a ticket to the museum which is located at the back of a store that is not welcoming at all. The lady took our 10 euro (it's 5 euro entry per person) and told us which perfumes we could smell. There are only a few available to smell which is understandable given most of them are old and locked behind glass. Expect to see lots of bottles and there is no information relating to the history. We managed to find a brochure on a stand but it was just a general overview. This has the potential to be a really cool place to visit but it needs a multi-lingual guide or audio guide to make it meaningful. You do get a discount in the shop afterwards if you choose to buy it but we didn't connect with the store at all. Staff were disinterested and avoided making eye contact with us as we left the museum. We did purchase from a fabulous perfumery called The Perfumery located at Baixada de Santa Eulàlia, 3, 08002 Barcelona, Spain so would recommend here if you are looking to buy a scent. Les Topettes, Carrer de Joaquín Costa, 33, 08001 Barcelona, also offered a different style of scents and great service", "publishedDate": "2017-10-06", "language": "en", "rating": 1}, {"id": 495226500, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d2218960-r495226500-Museo_del_Perfume_Museum_of_Perfume-Barcelona_Catalonia.html", "text": "This was located very close to our hotel, so we stopped in to check it out.  Although there is certainly an impressive array of perfumes and cosmetics inside, they are all things that are for sale...more like a store than a museum.", "publishedDate": "2017-06-22", "language": "en", "rating": 3}, {"id": 273540344, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d2218960-r273540344-Museo_del_Perfume_Museum_of_Perfume-Barcelona_Catalonia.html", "text": "this exhibit shows perfume bottles from different cultures and civilisations dating back to ancient greek and egyptian times.\nthink of a make of perfume and you will find it here. there is a large collection of original perfume bottles, most of which still have the original perfume in from of major perfume house in the world.\n\nall exhibits housed in glass showcases and with some authentic photographs of the designers themselves.\n\nwell worth the 3 euros entrance fee.", "publishedDate": "2015-05-21", "language": "en", "rating": 5}, {"id": 258951479, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d2218960-r258951479-Museo_del_Perfume_Museum_of_Perfume-Barcelona_Catalonia.html", "text": "Spent about an hour walking round looking for this place, which is inside the Perfumeria Regia shop, in a locked room. I wouldn't waste your time going here, we were charged 3 euros each for the privilege! Some of the bottles are of interest and you are supposed to get a 10 per cent discount on perfume at the shop, with the Barcelona Card, sadly we didn't see much fragrance we had heard of to get the discount.", "publishedDate": "2015-03-11", "language": "en", "rating": 1}, {"id": 254110058, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d2218960-r254110058-Museo_del_Perfume_Museum_of_Perfume-Barcelona_Catalonia.html", "text": "Expected smth else besides small perfume bottles....lots of them. Anyway, interesting and worth visiting ", "publishedDate": "2015-02-14", "language": "en", "rating": 3}, {"id": 252709328, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d2218960-r252709328-Museo_del_Perfume_Museum_of_Perfume-Barcelona_Catalonia.html", "text": "It's not a museum as advertised, just an ordinary perfume shop. Doesn't worth the visit except you wanna buy some perfumes.", "publishedDate": "2015-02-05", "language": "en", "rating": 3}, {"id": 176681872, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d2218960-r176681872-Museo_del_Perfume_Museum_of_Perfume-Barcelona_Catalonia.html", "text": "You pay €5 to get in and there's no information, no real order to the bottles, no sense of organisation. The staff in the shop seemed to find us a hindrance. They do have a phenomenal collection of bottles but it's completely disorganised and underdeveloped. What little information they do have is in Catalan and even for someone fluent in French and Castilian, that's not easy.", "publishedDate": "2013-09-10", "language": "en", "rating": 1}, {"id": 176469154, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d2218960-r176469154-Museo_del_Perfume_Museum_of_Perfume-Barcelona_Catalonia.html", "text": "I really enjoyed the perfume museum,as it takes you nicely through the history of perfumes. However,it is not the easiest to find (back of a perfume shop) and it would really be much better with more text explaining individual pieces. Otherwise worth a visit!", "publishedDate": "2013-09-09", "language": "en", "rating": 4}, {"id": 168169537, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d2218960-r168169537-Museo_del_Perfume_Museum_of_Perfume-Barcelona_Catalonia.html", "text": "This museum is a bit hard to locate, moreover, it occupies a back room in a perfume shop. When you enter it, you find yourself in a new world where centuries are neatly arranged on glass shelves in the form of various perfume containers. From the VIth century BC till nowadays - all is there! Small it may be, but it's not poor. You really get inspired just by looking at the exqusite bottles.", "publishedDate": "2013-07-19", "language": "en", "rating": 4}, {"id": 153185565, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d2218960-r153185565-Museo_del_Perfume_Museum_of_Perfume-Barcelona_Catalonia.html", "text": "We had trouble finding this 'museum' as we didn't realise it was a room at the back of a perfume shop, and had walked past the shop many times!\nA member of staff must have seen our puzzled faces as we struggled to locate the museum, and she kindly led us to the office where we paid entry to a man in his office while she went to switch the light on! \n\nA stunning collection of perfume bottles over the many many years. If you like your trinkets, you'll adore this collection and wish you could purchase bottles as if you were at the flea market. Unfortunately no information about how perfume is made, the history and even how/who can sell and represent it today. Just a battered folder of designers who have written to the museum to wish them well.\n\nThis would have worked better as a little gallery of perusal whilst shopping for perfume with a €2 donation or something. Lovely collection but don't expect much!", "publishedDate": "2013-02-26", "language": "en", "rating": 2}, {"id": 147186845, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d2218960-r147186845-Museo_del_Perfume_Museum_of_Perfume-Barcelona_Catalonia.html", "text": "A stunning collection of thousands of perfumes in beautiful bottles.  Many many collections of old and hardly known perfumes.  A must for anyone who loves perfume.\nI cnnot believe the previous comment `don't bother' - morons!! - what more could anyone want to see?! Well worth the £5.", "publishedDate": "2012-12-11", "language": "en", "rating": 5}, {"id": 132912051, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d2218960-r132912051-Museo_del_Perfume_Museum_of_Perfume-Barcelona_Catalonia.html", "text": "This is a small exhibit not a museum. There are lots of bottles of perfume Throughout the ages in glass cases. All on one room you could walk around in 1 minute. Entrance is €5. You walk through the shop pay some guy €5 each and they open the door to the room. If we had seem how small the room/museum was we would not have bothered. The highlight would be the dozen perfumes that you can smell. Your better off just sampling the shop (which is also very over priced). Sad really as with some thought they could make the museum free to bring punters into the shop. ", "publishedDate": "2012-06-27", "language": "en", "rating": 1}]}}]