[{"locationId": 1418568, "name": "Barcelona Fira Montjuic Hall of Conferences", "placeType": "ATTRACTION", "reviewListPage": {"reviews": [{"id": 675865985, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d1418568-r675865985-Barcelona_Fira_Montjuic_Hall_of_Conferences-Barcelona_Catalonia.html", "text": "Barcelona Fira Montjuic Hall of Conferences is a very large space. It has been there for decades and it is one of the most important in Europe. It hosts many exhibitions of various kinds where companies showcase their products. The building is a nice architectural sight. There was a car exhibition during our visit. Quite interesting. The building, or complex of buildings, is next to the \"Magic Fountain\" and the Art Museum and visitors are thus given the chance to admire several sights within easy walking distance of each other.", "publishedDate": "2019-05-23", "language": "en", "rating": 4}, {"id": 675281781, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d1418568-r675281781-Barcelona_Fira_Montjuic_Hall_of_Conferences-Barcelona_Catalonia.html", "text": "I love this place, if you like cars and the world of automobile in general, i really recommend it to you. It costs 10 € (1 evening)", "publishedDate": "2019-05-20", "language": "en", "rating": 5}, {"id": 672778526, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d1418568-r672778526-Barcelona_Fira_Montjuic_Hall_of_Conferences-Barcelona_Catalonia.html", "text": "This emblematic urban venue was built in 1929 to house the International Exhibition. \n\nThe location is very central next to Plaça d'Espanya. \n\nThe indoor area is 111.000 m² of floor space.", "publishedDate": "2019-05-09", "language": "en", "rating": 4}, {"id": 593567889, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d1418568-r593567889-Barcelona_Fira_Montjuic_Hall_of_Conferences-Barcelona_Catalonia.html", "text": "Our tour group stopped by the nearby Torres Venecianes for a photo-stop. And the Barcelona Fira Montjuic Hall of Conferences is just located opposite to it. The architectural design of the buildings is very beautiful and lovely.\n\nAccording to our guide, this place could be dated back to 1929 when Barcelona hosted the World Expo (not sure if I remembered correctly on the year) and it was then a grand event. Some of the current buildings remained as they were, with some being renovated and reconstructed. The place is now mainly used for exhibitions and conferences.\n\nAs we had limited time, we did not manage to enter but just simple walked around the external of the building. True enough it's very huge and the surrounding area is also very nice and splendid. It's clean and well maintained and we love the ambience!", "publishedDate": "2018-07-06", "language": "en", "rating": 4}, {"id": 531623627, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d1418568-r531623627-Barcelona_Fira_Montjuic_Hall_of_Conferences-Barcelona_Catalonia.html", "text": "It was very nice and big! Many artists from all over the world and different techniques. Nice organization and I would love to go again!", "publishedDate": "2017-10-10", "language": "en", "rating": 5}, {"id": 449096374, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d1418568-r449096374-Barcelona_Fira_Montjuic_Hall_of_Conferences-Barcelona_Catalonia.html", "text": "Lovely structure absolutely stunning .We walked past everything was very clean .The had a child event when we went pass everything looked well organised and clean .", "publishedDate": "2017-01-03", "language": "en", "rating": 3}, {"id": 436661816, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d1418568-r436661816-Barcelona_Fira_Montjuic_Hall_of_Conferences-Barcelona_Catalonia.html", "text": "Excellent conference location, good facilities, everything well organized. It's big, remember the address listed on your conference tickets to end up at the correct side of the place. Do check the connection from/to the hotel that you plan to book should you rely on public transportation.", "publishedDate": "2016-11-12", "language": "en", "rating": 4}, {"id": 407797211, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d1418568-r407797211-Barcelona_Fira_Montjuic_Hall_of_Conferences-Barcelona_Catalonia.html", "text": "I was here in my summer holiday 2015 and on this area it was so much to see but in this case i was fasinated of the look of this hall. I like this kind of style never get tired of looking at that.", "publishedDate": "2016-08-20", "language": "en", "rating": 4}, {"id": 401972655, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d1418568-r401972655-Barcelona_Fira_Montjuic_Hall_of_Conferences-Barcelona_Catalonia.html", "text": "Located at one corner of Placa Espana and Montjuic Parc in Barcelona. Very famous for hosting numerous international congresses and fairs. It is a modern building with curved shape. Its grandeur can be.viewed from the plaza.", "publishedDate": "2016-08-06", "language": "en", "rating": 4}, {"id": 351776893, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d1418568-r351776893-Barcelona_Fira_Montjuic_Hall_of_Conferences-Barcelona_Catalonia.html", "text": "As expos go, this was a nice location for one. Lovely historical buildings and a very spacious inside for the stands to be popped up. The food in the area is also good!", "publishedDate": "2016-02-29", "language": "en", "rating": 3}, {"id": 340239569, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d1418568-r340239569-Barcelona_Fira_Montjuic_Hall_of_Conferences-Barcelona_Catalonia.html", "text": "Over the years, I have visited the convention and trade fair center in numerous occasions. It is centrally located and easily accessible. The structure was built to host the 1929 International Exhibition, like many others in this area on the slopes of Montjuic. It successfully combines tradition with modern infrastructure.", "publishedDate": "2016-01-15", "language": "en", "rating": 4}, {"id": 316787964, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d1418568-r316787964-Barcelona_Fira_Montjuic_Hall_of_Conferences-Barcelona_Catalonia.html", "text": "A nice place for fair or exebision  at the centre of barcelona, accessable by locla transport, wide open space. last time i visted here in May 2015 at DENIM CONSTELLATION", "publishedDate": "2015-10-07", "language": "en", "rating": 3}, {"id": 192715126, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d1418568-r192715126-Barcelona_Fira_Montjuic_Hall_of_Conferences-Barcelona_Catalonia.html", "text": "The Barcelona Fira Monjuic is well located in the up part of the city connected to the city centre and attractions. It always supports the best events in Spain with lots of joy, glamour and sophistication. ", "publishedDate": "2014-01-31", "language": "en", "rating": 5}, {"id": 159253104, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d1418568-r159253104-Barcelona_Fira_Montjuic_Hall_of_Conferences-Barcelona_Catalonia.html", "text": "We had planned to visit this location mainly to see the evening performance of the Musical fountains. However we were told that the fountains are only operated on Friday and Saturday evenings nowadays. Whist disappointed we decided to still make the trip as we were in the area for a meal at the Placa Espanya on the Monday evening. To our surprise the TV were filming in the area and as we arrived the fountains were turned on in all their glory. We were able to watch the performance with only a few hundred other spectators and had perfect views whereas normally thousands of people crowd the area and a good viewing spot is hard to come by. This surprise made our holiday even more memorable. Well done Barcelona for making our trip special even if it was by coincidence.", "publishedDate": "2013-04-30", "language": "en", "rating": 5}, {"id": 150258640, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d1418568-r150258640-Barcelona_Fira_Montjuic_Hall_of_Conferences-Barcelona_Catalonia.html", "text": "This is a massive convention centre - not far from the Olympic Stadium. I am here now - at an IT convention in January. The size is impressive, but the rooms are so hot and stuffy people are finding it hard to stay awake.\n\nSadly it seems that there really is no air con in many of the rooms in hall 8. As a result, many people are skipping sessions, just to get some air!", "publishedDate": "2013-01-22", "language": "en", "rating": 2}, {"id": 125527238, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d1418568-r125527238-Barcelona_Fira_Montjuic_Hall_of_Conferences-Barcelona_Catalonia.html", "text": "I just came back from MWC 2012 which was at Fira Montjuic in Barcelona.  It is such an imposing site.   The entrance is from the direction of an imposing fountain.  The along sides of the entrance are imposing walls ( like that of the Colosseum in Rome) and at the far end is a magical fountain and Place/museum.  It was easy to get to the Fira by subway.  There were tons of restaurants and Tapas bars around the venue for a quite bite or drink.   I understand they are moving the MWC next year to another location in Barcelona, what a pity !", "publishedDate": "2012-03-02", "language": "en", "rating": 5}, {"id": 121419523, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d1418568-r121419523-Barcelona_Fira_Montjuic_Hall_of_Conferences-Barcelona_Catalonia.html", "text": "The Best Conference Halls facilities in all of Europe and with the best location. Plenty of Hotels and Restaurants to choose from nearby!", "publishedDate": "2011-12-05", "language": "en", "rating": 5}]}}]