[{"locationId": 244197, "name": "City Hall (Casa de la Ciutat / Ayuntamiento)", "placeType": "ATTRACTION", "reviewListPage": {"reviews": [{"id": 429051197, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d244197-r429051197-City_Hall_Casa_de_la_Ciutat_Ayuntamiento-Barcelona_Catalonia.html", "text": "Worth a view. Interesting architecture and history to match. Interesting sculptures on display. Was greeted by deputy mayor. ", "publishedDate": "2016-10-18", "language": "en", "rating": 4}, {"id": 425564545, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d244197-r425564545-City_Hall_Casa_de_la_Ciutat_Ayuntamiento-Barcelona_Catalonia.html", "text": "last May- 1st of May, world labor day\na sigh with a meaning\nin a place with a meaning\nin City Hall- Casa de la Ciutat-Ajuntament- in front of the Palau de la Generalitat de Catalunia, in Plaza se San Jaume\na peace scene for an openheart city", "publishedDate": "2016-10-06", "language": "en", "rating": 5}, {"id": 422162015, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d244197-r422162015-City_Hall_Casa_de_la_Ciutat_Ayuntamiento-Barcelona_Catalonia.html", "text": "Tucked inside the narrow lanes of the Barri Gotic, this building is much nicer from inside. We visited on a Sunday morning and were lucky enough to be able to visit it (we understand it's only open a few days a month). Some rooms are quite impressive, with frescos and historic furniture.", "publishedDate": "2016-09-25", "language": "en", "rating": 5}, {"id": 418749488, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d244197-r418749488-City_Hall_Casa_de_la_Ciutat_Ayuntamiento-Barcelona_Catalonia.html", "text": "The city hall is a popular place to view if in this area of Barcelona, it is set in a nice pedestrian square, full of people and lots going on, worth stopping for a photo of the outside. \nIf you found this review helpful, please like it.", "publishedDate": "2016-09-15", "language": "en", "rating": 4}, {"id": 385291811, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d244197-r385291811-City_Hall_Casa_de_la_Ciutat_Ayuntamiento-Barcelona_Catalonia.html", "text": "wandered through the quarter and stumbled upon the square where city hall is located. busy spot. some protesters were in the square. nice structure to look at and take some pics.", "publishedDate": "2016-06-23", "language": "en", "rating": 4}, {"id": 377265698, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d244197-r377265698-City_Hall_Casa_de_la_Ciutat_Ayuntamiento-Barcelona_Catalonia.html", "text": "The sign outside advertised a bit of gothic history. Once through the security we were blown away. This is a working city hall decorations going back 700 years in places, site of a revolution and where they store their carnival Giants. Yes you get to see it all for free and it's mind blowing. Oh and twice a day they do a free  string quartet in the salo de cent. Really a gem not to be missed if you find yourself in las ramblas.", "publishedDate": "2016-05-28", "language": "en", "rating": 5}, {"id": 368770838, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d244197-r368770838-City_Hall_Casa_de_la_Ciutat_Ayuntamiento-Barcelona_Catalonia.html", "text": "We had been wandering through the Gothic Quarter for some time when we came out to Placa Sant Jaume which is a grand looking square of some antiquity. After a few moments we saw the banner being proudly displayed on the City Hall which said in English 'Refugees Welcome'. Good on them for openly displaying a humanitarian response to the ongoing refugee crisis..", "publishedDate": "2016-04-29", "language": "en", "rating": 4}, {"id": 362462957, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d244197-r362462957-City_Hall_Casa_de_la_Ciutat_Ayuntamiento-Barcelona_Catalonia.html", "text": "Located in the heart of the gothic quarter; we came across City Hall by complete accident during a wander. Its located in a nice sunny square with lots of little shops & cafes nearby. Close to La Ramblas and the Liceu metro stop.", "publishedDate": "2016-04-08", "language": "en", "rating": 3}, {"id": 351535723, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d244197-r351535723-City_Hall_Casa_de_la_Ciutat_Ayuntamiento-Barcelona_Catalonia.html", "text": "The main floor and first floor are open free for visiting on Sunday's from 10 to 1:30.  You can take a guided tour - or visit on your own with a pamphlet written in English.  We chose to tour on our own - vs. waiting 25 minutes.  The upstairs rooms are quite beautiful.  I also enjoyed the various works of art that they had around.  You enter through a door in the back of the building - vs. entering through the main square door.", "publishedDate": "2016-02-28", "language": "en", "rating": 5}, {"id": 340660622, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d244197-r340660622-City_Hall_Casa_de_la_Ciutat_Ayuntamiento-Barcelona_Catalonia.html", "text": "Another administrative building at the Placa Sant Jaume is the City Hall, a neoclassical building with impressive Gothic Great Hall designed in the 14th century by Pere Llobet. The splendid murals which change perspective according to the angle you are standing are situated in the Hall of Chronicles. Thera are also many fine sculptures on display in the building. The building is open for visits every Sunday for a few hours.", "publishedDate": "2016-01-17", "language": "en", "rating": 5}, {"id": 340115126, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d244197-r340115126-City_Hall_Casa_de_la_Ciutat_Ayuntamiento-Barcelona_Catalonia.html", "text": "The Barcelona City Hall was started in 1399 and has been changed and upgraded several times over the year. The free guided tour lasts about 30 minutes and shows you the two floors with beautiful statues, carvings, paintings and meeting rooms. There is a lot of history here and a variety of architectural styles from the gothic to the neoclassical.\nThe entrance for the tour is NOT on the famous square of Saint Jaume but around the corner to the other side of the building.\nWorth experiencing!", "publishedDate": "2016-01-14", "language": "en", "rating": 4}, {"id": 314468790, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d244197-r314468790-City_Hall_Casa_de_la_Ciutat_Ayuntamiento-Barcelona_Catalonia.html", "text": "It's a shame that there are so many indifferent reviews on TA re this building in Placa Sant Jaume - clearly because people haven't had the chance to go inside. I understand that Sunday 10-12.30 are it's only opening hours, but you might want to check this. Certainly if you get a chance you have to go in. There are numerous great spaces in this building as well as some excellent paintings and sculptures. But the highlight must be council chamber itself which is an absolutely superb room. There can't be too many suites of council rooms like this anywhere in the world. So, to repeat, if you get a chance to go in don't hesitate; you won't be disappointed.", "publishedDate": "2015-09-28", "language": "en", "rating": 5}, {"id": 289011364, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d244197-r289011364-City_Hall_Casa_de_la_Ciutat_Ayuntamiento-Barcelona_Catalonia.html", "text": "Purely by coincidence our gothic quarter tour started from the tour offices in the building. Unfortunately, the rest of the building was closed on Saturday. I have seen several pictures since and heard it is a great place to visit, just not the day we had to tour. Still it is an amazing exterior on a great square at the center if the city. Great place to see, wish I could have visited.", "publishedDate": "2015-07-14", "language": "en", "rating": 3}, {"id": 284476106, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d244197-r284476106-City_Hall_Casa_de_la_Ciutat_Ayuntamiento-Barcelona_Catalonia.html", "text": "We stumbled upon this treat by accident. We went inside and they were offering free tours in english so we decided to stay. The tour was unbelievable and I must have taken 100 photos. ", "publishedDate": "2015-06-30", "language": "en", "rating": 5}, {"id": 248246183, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d244197-r248246183-City_Hall_Casa_de_la_Ciutat_Ayuntamiento-Barcelona_Catalonia.html", "text": "We have been during the 11 of September and Merce festivity. Nice building and interesting shows. We will be back", "publishedDate": "2015-01-08", "language": "en", "rating": 3}, {"id": 246585938, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d244197-r246585938-City_Hall_Casa_de_la_Ciutat_Ayuntamiento-Barcelona_Catalonia.html", "text": "The exterior was just like what i expect a city hall would look like.The plaza was a good place to have a coffee or a break.", "publishedDate": "2014-12-30", "language": "en", "rating": 4}, {"id": 239350392, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d244197-r239350392-City_Hall_Casa_de_la_Ciutat_Ayuntamiento-Barcelona_Catalonia.html", "text": "This is a secret gem that we chanced upon just before it closed. It is a beautiful historic building still used for some meetings and with some lovely artefacts - and FREE We had to rush round but can enjoy in less than anhour", "publishedDate": "2014-11-11", "language": "en", "rating": 5}, {"id": 239234560, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d244197-r239234560-City_Hall_Casa_de_la_Ciutat_Ayuntamiento-Barcelona_Catalonia.html", "text": "There we were..trying to locate the address of our segway ride. And suddenly the narrow lane opened up into a square with beautiful buildings. Then we realised that this place is called the city hall and houses some important government offices. \n\nBarcelona is a beautiful city and an architectural delight. The city hall is no exception.  Make a wonderful backdrop for some memorable photographs.", "publishedDate": "2014-11-11", "language": "en", "rating": 4}, {"id": 229531657, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d244197-r229531657-City_Hall_Casa_de_la_Ciutat_Ayuntamiento-Barcelona_Catalonia.html", "text": "The City Hall has a beautiful Neoclassic façade that makes it very elegant. The highest point on the façade is quite good with a beautiful pediment that was constructed in 1855 by the architect  Francesc Daniel Molina.", "publishedDate": "2014-09-17", "language": "en", "rating": 4}, {"id": 216384264, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d244197-r216384264-City_Hall_Casa_de_la_Ciutat_Ayuntamiento-Barcelona_Catalonia.html", "text": "The Barcelona City Hall is open only on select days and hours (check in advance).  The admission is free.  The building is beautiful inside and out.\n\nP.S. As with other attractions in BCN I noticed that, if you want to jam pack as much sightseeing as possible, you must plan your visit according to opening hours, which you should check in advance and plan around it.", "publishedDate": "2014-07-20", "language": "en", "rating": 5}, {"id": 196791508, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d244197-r196791508-City_Hall_Casa_de_la_Ciutat_Ayuntamiento-Barcelona_Catalonia.html", "text": "Casa de cuitat\n\nFlanking the side of a large open square, surrounded by lots of armed guards in the centre of the Barri Gothic is this lovely old building, the seat of city government from medieval times and likely to have a major role in any future Catalonian government. Outside the main entrance police stand guard, flags fly, protests happen, groups are moved on, and it is open to the public occasionally. The gothic fascade is lovely with fine columns and arches, the black marble staircase gleams with local black marble, the council meeting room and the Hall of Chronicles is spectacular, all black and gold with sparkle and quite surreal. The gargoyles above the courtyard sit in the sun and there are some fine statues in the entrance area (Miro etc). Didn't expect or plan to see this but delighted to have had the opportunity to do so. There is no admission charge and it is worth checking out if you are in the area", "publishedDate": "2014-03-09", "language": "en", "rating": 4}, {"id": 181451196, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d244197-r181451196-City_Hall_Casa_de_la_Ciutat_Ayuntamiento-Barcelona_Catalonia.html", "text": "We visited the City Hall almost by mistake as we were really planning on visiting the City Museum! However, this is a lovely building with really helpful guides who are happy to answer questions. Really interesting insight to the city government, pomp and ceremony. There are several sculptures and many works of art around the building. Well worth a visit.", "publishedDate": "2013-10-18", "language": "en", "rating": 4}, {"id": 165557314, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d244197-r165557314-City_Hall_Casa_de_la_Ciutat_Ayuntamiento-Barcelona_Catalonia.html", "text": "passed through this square several times during our stay.  Interesting buildings right in the middle if Barri Gothic.", "publishedDate": "2013-06-28", "language": "en", "rating": 4}, {"id": 150958628, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d244197-r150958628-City_Hall_Casa_de_la_Ciutat_Ayuntamiento-Barcelona_Catalonia.html", "text": "Yet another building of architectural interest in this amazing city. Only saw the exterior as we were short of time.", "publishedDate": "2013-01-29", "language": "en", "rating": 4}, {"id": 149419729, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d244197-r149419729-City_Hall_Casa_de_la_Ciutat_Ayuntamiento-Barcelona_Catalonia.html", "text": "We only visited the inner courtyard of the building, where a small exhibition was held.\nIt was nice, nothing more.\nThe building itself is beautiful with very nice looking features.\n15 minutes in the courtyard would certainly do the trick.", "publishedDate": "2013-01-11", "language": "en", "rating": 3}, {"id": 126240234, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d244197-r126240234-City_Hall_Casa_de_la_Ciutat_Ayuntamiento-Barcelona_Catalonia.html", "text": "We visited the City hall on our first day in Barcelona. You can only visit it on Sundays which is why it is probably not well know. The building is so beautiful inside and very historic. One lady I was talking to found it purely by accident. They do have some unfriendly looking guards outside which is another reason why people might not think they can visit it. Do not miss this if you are in Barcelona on a Sunday!", "publishedDate": "2012-03-17", "language": "en", "rating": 5}]}}]