[{"locationId": 3954329, "name": "Sant Pau del Camp", "placeType": "ATTRACTION", "reviewListPage": {"reviews": [{"id": 488587831, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d3954329-r488587831-Sant_Pau_del_Camp-Barcelona_Catalonia.html", "text": "My favorite church in Barcelona. 3 Euros to get in. Only one other person while I was there. Would fit in a large purse. Not an intimidating building like some of the others. The interior is beautiful with simple and clean architecture.", "publishedDate": "2017-05-28", "language": "en", "rating": 5}, {"id": 484489994, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d3954329-r484489994-Sant_Pau_del_Camp-Barcelona_Catalonia.html", "text": "This place is hidden in 5 minutes walk from Parallel.\nPlease check the working hours on the website (there’s also a schedule printed outside the place, it’s a bit different from the working hours on the website, not sure which one is correct).\nThis is a very old church and a cloister. If you’re a fan of everything medieval, you’ll be in awe. The church was founded in 900-1000 AD, and renovated in the 13th century (maybe some minor renovations afterwards, but they were done really well). Basically, the current look dates back to 13th century.\nBe careful, some beggars are usually sitting outside and asking for money.\nWhen we entered, there was an elderly ticket lady who spoke English. The entrance fee is 3 euros per person, 1,5 euros for students. We gave her the money and she gave as a booklet an English about with a story of the place, and showed us the way. Basically, you enter the old stone yard, and then you can proceed to the church itself. There are not many people there, in fact we stayed in the church for 15 minutes all by ourselves, which was great. Old Gregorian chants were played (not real, but recorded ones) and added to the atmosphere. \nThe territory open for tourists is small, but it’s enough. You can walk around and explore the old engravings, some interesting elements on the walls. Don’t forget to go to the small yard and to look at the church outside. \nTo me, this was an unforgettable experience. I felt something special here. So happy this gem stood here for so long and I could see it.", "publishedDate": "2017-05-15", "language": "en", "rating": 5}, {"id": 473954641, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d3954329-r473954641-Sant_Pau_del_Camp-Barcelona_Catalonia.html", "text": "OK, so the current church and cloister buildings may not date back to before 1000 a.d. But this is a very, very old church -- and it is very much worth visiting while you are visiting the nearby lower part of La Rambla. The admission charge is very modest, and the history that is offered is unique within Barcelona. We are glad we went. ", "publishedDate": "2017-04-09", "language": "en", "rating": 4}, {"id": 438391177, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d3954329-r438391177-Sant_Pau_del_Camp-Barcelona_Catalonia.html", "text": "We pretty much stumbled on this place as we were traversing the neighborhood.  The inside, at first glance, is very plain until you start noticing the details.  The wooden statues become more beautiful the more you look at them.  There are even carvings of animals and fish above the front door, 13th century.  And the church has a beautiful courtyard, also with capitals adorned by animals.  This is a very restful place to stop and visit.", "publishedDate": "2016-11-18", "language": "en", "rating": 5}, {"id": 426460295, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d3954329-r426460295-Sant_Pau_del_Camp-Barcelona_Catalonia.html", "text": "A very nice romanic-style church and cloister, dating from the 10th century at least, it is a beautiful spot to visit in Barcelona. You would think that this kind of gentle, aged, classical beauty belongs to somewhere else... but no, we are still in Barcelona, a short walk from the gothic cathedral and from Gaudi's modern masterpieces... We found it by chance, taking a walk to a palace... But it deserves an aimed visit, as much as the much better known highlights of Barcelona.", "publishedDate": "2016-10-09", "language": "en", "rating": 4}, {"id": 403163501, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d3954329-r403163501-Sant_Pau_del_Camp-Barcelona_Catalonia.html", "text": "This old church happened to be very close to where I was staying or I may not have made the visit. It is small and most people will probably only make a brief visit but it is very attractive in a distinctively Mediterranean style and has a serene ambiance. There is a shady courtyard populated by tall cypress trees and a stone bench to rest upon. Well worth a short pause.", "publishedDate": "2016-08-09", "language": "en", "rating": 4}, {"id": 392527739, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d3954329-r392527739-Sant_Pau_del_Camp-Barcelona_Catalonia.html", "text": "We walked quite a bit to find this church in the heart of Barcelona, right across the street from several small shops. I was tired and hot when I got there, but immediately calmed down as I entered the vestibule. As the other reviewer said, the church does have a tranquil and almost sacred atmosphere. Being one of the oldest buildings in the city, Sant Pau was admired by Picasso who frequently visited this church for inspiration.", "publishedDate": "2016-07-14", "language": "en", "rating": 5}, {"id": 375729028, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d3954329-r375729028-Sant_Pau_del_Camp-Barcelona_Catalonia.html", "text": "We were staying in the Tryp Apolo and we could see this ancient church from our bedroom.  It is a short walk through an urban park which was a surprise.  Lovely to find unexpected open spaces in the city!  Another surprise was a well laid out thriving vegetable garden.  The church is wonderful, very calm and orthodox in architecture.  It has plain walls and a a very few old statues of various saints.   The cloisters are beautiful.  The building is said to be the oldest used building in the city.  Perfect!  The visit is definitely worth a few minutes of anybody's time.", "publishedDate": "2016-05-23", "language": "en", "rating": 5}, {"id": 342919476, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d3954329-r342919476-Sant_Pau_del_Camp-Barcelona_Catalonia.html", "text": "Told to us that this is the oldest church in Barcelona we definitely had to make a visit. The nun who mans the entrance charged us 2 euro each to tour. It is very small and will take no more than 10 minutes to see everything and that's with taking photos and resting your feet. It is located in a very diverse neighborhood about a 10-15 minute walk from Las Ramblas. It is attached to a school. It was a very lovely visit and if you have time and 2 euro you should definitely stop in!!!!", "publishedDate": "2016-01-26", "language": "en", "rating": 5}, {"id": 338703072, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d3954329-r338703072-Sant_Pau_del_Camp-Barcelona_Catalonia.html", "text": "This is a wonderful church. Going through the cloister into the church is a pleasure. The statue of Mary and Baby Jesus is one of the more interesting I have seen, dating somewhere around the 12th-13th c. I loved it! The elderly woman who works at the front desk is wonderful, and also speaks English, if your Spanish is like mine, terrible! :-)", "publishedDate": "2016-01-09", "language": "en", "rating": 5}, {"id": 327454352, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d3954329-r327454352-Sant_Pau_del_Camp-Barcelona_Catalonia.html", "text": "I love cloisters and this one is a real gem (like the whole place, church and chapter house). Tiny, but very charming. Admission was just 1 Euro.", "publishedDate": "2015-11-17", "language": "en", "rating": 5}, {"id": 322354341, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d3954329-r322354341-Sant_Pau_del_Camp-Barcelona_Catalonia.html", "text": "This is an amazing place; unfortunately, I can't glean much from the brochure I got. (The translation is clumsy, for one thing.) But it's the oldest building I've ever been in, and I found many details to appreciate. Check the photos and you will see whether it is to your taste.", "publishedDate": "2015-10-27", "language": "en", "rating": 5}, {"id": 310722376, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d3954329-r310722376-Sant_Pau_del_Camp-Barcelona_Catalonia.html", "text": "Very old church just south of Las Ramblas.  Well worth the visit to see the old Church, the sanctuary and the cloister ... great piece of history.", "publishedDate": "2015-09-15", "language": "en", "rating": 5}, {"id": 290072504, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d3954329-r290072504-Sant_Pau_del_Camp-Barcelona_Catalonia.html", "text": "It is told, that this is the oldest church in Barcelona. Small but very charming, together with the cloister. It is from the 9th century! Just a little wonder.", "publishedDate": "2015-07-18", "language": "en", "rating": 5}, {"id": 274665845, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d3954329-r274665845-Sant_Pau_del_Camp-Barcelona_Catalonia.html", "text": "Stumbled across this whilst walking thro' El Raval district. Caretaker  reported it to be the oldest church in Barcelona. It is pleasantly understated, with a small cloister entered before the church itself. There is an entry fee but info is limited. Short interlude on way to other sites or resting point on a hot day.", "publishedDate": "2015-05-26", "language": "en", "rating": 3}, {"id": 266602995, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d3954329-r266602995-Sant_Pau_del_Camp-Barcelona_Catalonia.html", "text": "There is not much to see inside, old brick walls only - to be honest. Ticket costs 3 euro. Visit for people not really interested in building history without a guide may be disappointing.", "publishedDate": "2015-04-19", "language": "en", "rating": 3}, {"id": 262114183, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d3954329-r262114183-Sant_Pau_del_Camp-Barcelona_Catalonia.html", "text": "Old and nice monetary. If you want to spend some quiet moment and feel the history, this is place to visit. ", "publishedDate": "2015-03-27", "language": "en", "rating": 5}, {"id": 252511539, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d3954329-r252511539-Sant_Pau_del_Camp-Barcelona_Catalonia.html", "text": "The architecture and feel of this church is like nothing else in Barcelona, and possibly the oldest building we've ever seen.  It has a simple beauty and grace that is extraordinary and has stood through so much history.  And the grounds are beautiful, with a grove of trees in back and a series of gardens and bouganvilla walkways -- an oasis in this vibrant and gritty working neighborhood.  A gardener was weeding in the extensive church community garden, and children were playing in the playground next door.  We enjoyed this peaceful and Godly place as a respite from the busy pace of the rest of our visit to Barcelona.", "publishedDate": "2015-02-03", "language": "en", "rating": 5}, {"id": 236921616, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d3954329-r236921616-Sant_Pau_del_Camp-Barcelona_Catalonia.html", "text": "A simple church in a city full of artistic wonders was very refreshing and quite a change from most of the city which is loud and fast and in your face.", "publishedDate": "2014-10-29", "language": "en", "rating": 4}, {"id": 236388189, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d3954329-r236388189-Sant_Pau_del_Camp-Barcelona_Catalonia.html", "text": "I liked this church; after seeing all the grandeur of cathedrals, it was nice to see a church that was simple, not loud, and that does not have hordes of tourists.  Plus, they have real candles you can buy and light (instead of the automated light machine ones in the large cathedrals).  Go here to change things up and you won't be disappointed.\n\n3 euros entry fee.", "publishedDate": "2014-10-26", "language": "en", "rating": 5}, {"id": 232763337, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d3954329-r232763337-Sant_Pau_del_Camp-Barcelona_Catalonia.html", "text": "El Raval was definitively the most awkward and intimidating neighborhood we have seen in our visit to Barcelona, but stepping inside this church was like moving into an oasis where we easily forget the outside world and just feel like hanging around and enjoy.\nThe simple but warm architecture sets such a peaceful mood and the staff welcoming us was so kind that we'll never forget this place.", "publishedDate": "2014-10-05", "language": "en", "rating": 5}, {"id": 226521136, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d3954329-r226521136-Sant_Pau_del_Camp-Barcelona_Catalonia.html", "text": "Perhaps that might change now...The structure is quite impressive considering it is roughly 1200 years old.  Plus Guifre is buried there, the Count behind the bloody stripes on the shield. it has an amazing cloister and mosaic floors, vaulted ceilings the list goes on and on. check it out", "publishedDate": "2014-09-02", "language": "en", "rating": 5}, {"id": 213056049, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d3954329-r213056049-Sant_Pau_del_Camp-Barcelona_Catalonia.html", "text": "It's one of the less known churches from the Romanic period. Very central and out of the tourist crowded Gothic Quarter. Highly suggested a wald in the surrounding quarter of Paral.lel and Raval.", "publishedDate": "2014-07-01", "language": "en", "rating": 5}, {"id": 208249918, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d3954329-r208249918-Sant_Pau_del_Camp-Barcelona_Catalonia.html", "text": "Its hard to fathom that until recently, this quarter was not a place for a peaceful stroll. Appalling housing,in narrow,dirty,neglected old town,has been resurrected to also include cultural monuments. Its definitely the lively sub-culture inherent here contributes to Barcelona's reputation as a city 'where-its-at'.\n\n       The oldest survivor from the times of the Visigoths, is this Romanesque cloister of Sant Pau del Camp which is somewhat out of place in its grey surroundings. We liked its contemplative atmosphere emanating  from both the walls of the monastery and the superb medieval sculpture.  I  really liked the Capitals of the 13th century cloister which are particularly imaginative,whereas the barrel-vaulted interior is rather plain. \n\n         Further up the street is picturesque Mercat de St.Antoni decorated with cast-iron,this market building is laid out in shape of the cross,externally clad with tiles. beneath the dome,the loud cries of traders advertise the gleaming,silvery fish. For my money,this market and the Boqueria in La Rambla is the must visit locations. in Barcelona.\n\n        Who doesn't love the architecture of the 1930s?    Well,  get an eyeful at the carrer Torres Amate,the old tuberculosis clinic which is an impressive example of quality buildings. Its  \"L\" -shaped,steel-framed building with strip windows,and delicate colours, make it a stand-out.\n\n       Close to Sant Pau is the imposing complex of the Hospital de la Sta.Creu,originally a pilgrims' hospital,was still occupied in 1950. Gaudi died here ,which is reason enough to visit. Today,the Middle Ages gothic space is home to the Bibliotech of Catalan,with superb arcaded courtyard,surrounded by  capitals showing threatening dragons and other legendary animals", "publishedDate": "2014-05-31", "language": "en", "rating": 5}, {"id": 207335667, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d3954329-r207335667-Sant_Pau_del_Camp-Barcelona_Catalonia.html", "text": "This little church was cute, charming and.... was basically scanned by me because en route to finding it I passed an entrance leading into a place so intriguing to me that I couldn't quite get it out of my mind. I backtracked down Carrer de l'Hospital - reading the plaque \"Antic Hospital de la Santa Creu\" outside an archway which lead onto a courtyard so exquisite I thought I'd walked into some renowned architectural/monastic/museum/monument for which I'd have to pay an entrance fee - or a shelter for the poor for the mingled cross section of young people who seemed to belong there so I wasn't quite sure... I was finally approached by a student who revealed it to be the Library of Catalunya - that had once been a 15th century hospital... \nGo to the library! \nYou will be stunned to silence!\n(They've got a great little café in there too.)", "publishedDate": "2014-05-27", "language": "en", "rating": 3}, {"id": 161195757, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d3954329-r161195757-Sant_Pau_del_Camp-Barcelona_Catalonia.html", "text": "Spotted this on a leisurely walk back to our apartment, while in the pouring rain. Very dramatic and dark scene- but really moving. It's a beautiful church outside, though the area it is in is lacking, but seems to be being developed!", "publishedDate": "2013-05-19", "language": "en", "rating": 5}, {"id": 159916931, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d3954329-r159916931-Sant_Pau_del_Camp-Barcelona_Catalonia.html", "text": "While this Catherdral lacks the granduer of La Sagrada Familia and the flash of Casa Battlo it is a little gem in Barcelona. \n\nAccording to Wikipedia this is the oldest church in Barcelona which has its roots as a countryside monestary dating back to the first century. \n\nIf you are taking the funicular to the Teleferic de Montjuic I recommend that you stop here first.  It is located about 3 blocks from the subway Paral-el subway station.  \n\nThere is a 3 EUR entrance fee.  It is about a 30-40 minute tour.", "publishedDate": "2013-05-07", "language": "en", "rating": 5}]}}]