[{"locationId": 10214244, "name": "The Art of the Brick", "placeType": "ATTRACTION", "reviewListPage": {"reviews": [{"id": 457168261, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d10214244-r457168261-The_Art_of_the_Brick-Barcelona_Catalonia.html", "text": "We saw the exhibit in Madrid.\n\nThe exhibit consisted of quite a large number of incredible Lego sculptures of comic book superheroes , many of which were close to life-sized all by one artist.  The Lego sculptures were amazing and two of my favorites were the batmobiles  (cars for Batman & Robin).  \n\nThe exhibit is easily worth the 6 euro admission price and kids 4 and under are free.  We read all the commentaries provided by the artist and the entire exhibit thus took us about 2 hours.\n\nExcept for the free play with bins full of thousands of loose Legos I don't think the exhibit is geared towards really young kids like our 2 year old who cannot really appreciate the incredible creativity, artistry and engineering of the sculptures.\n\nOur toddler fell asleep and woke up near the end and enjoyed the free play area quite alot.", "publishedDate": "2017-02-04", "language": "en", "rating": 4}, {"id": 368253752, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d10214244-r368253752-The_Art_of_the_Brick-Barcelona_Catalonia.html", "text": "I'll start with the practicalities.  If you want to visit this exhibition, it is on the top floor at the Arenas shopping centre, which is the Old Bullring.  Espanya is the closest metro station.  This is a huge exhibition which is currently travelling the world.  It is in Barcelona until 12 June.  The standard adult ticket price is 14.50 Euros, but we got it cheaper by going on a weekday evening.  The opening hours I think are 10am until 9pm, with the last admittance at 8pm.  It took us 1.40 hours to go round at a leisurely pace and watch all of the films (which are in English with Spanish subtitles).\n\nThe exhibition is much larger and significantly more thought provoking than I expected.  I do not think it is suitable for young children as they can't really play with the bricks, but older children and teenagers I think would enjoy it.  When we were there, all of the visitors were adult.  If you are considering taking your children, please check out some of the photos online first to see whether you think it would interest them.  \n\nThere are some absolutely astonishing pieces in the exhibition.  The artist - Nathan Sawaya - shows both an astonishing awareness of anatomy and a unique deftness at Lego construction.  Without wishing to give too much away, a large number of his sculptures are reflective of human emotion and are truly profound.  There are one dimensional pieces too as the artist takes on the re-creation of major works of art in Lego.  There's even a special nod to Barcelona at the entry.\n\nTruly one of the most astonishing art exhibitions I've ever been to and well worth the entry fee.", "publishedDate": "2016-04-27", "language": "en", "rating": 5}, {"id": 368027492, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d10214244-r368027492-The_Art_of_the_Brick-Barcelona_Catalonia.html", "text": "Found this perusing the internet when looking for an activity for a rainy morning. A travelling exhibit from the U.S. It is a true art exhibit that is fun and fantastic for the whole family. Young kids can also play with Lego in a room at the end.", "publishedDate": "2016-04-26", "language": "en", "rating": 5}]}}]