[{"locationId": 9851986, "name": "La Parella", "placeType": "ATTRACTION", "reviewListPage": {"reviews": [{"id": 690674140, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d9851986-r690674140-La_Parella-Barcelona_Catalonia.html", "text": "The La Parella is a sculpture on the promenade of the Port Vell area. It features an armless couple, a man and a women sitting on the the walls of the promenade, looking out into the sea. Although there's classical influences in the face, the sculptures are cast in bronze with a rough finish and make it stand out as much as the lack of limbs.\n\nNot a must see, but a very popular sculpture for selfie takers.", "publishedDate": "2019-07-18", "language": "en", "rating": 4}, {"id": 677304831, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d9851986-r677304831-La_Parella-Barcelona_Catalonia.html", "text": "La Lareja is a set of two bronze statues, by the waterside, at the harbour. La Parella, in Catalan, the two abstract figures, are clearly a young couple sitting closely together, looking towards the sea. It seems the young man has his arm around the girl, although you can't see this, because the statues have no arms. But it is not too hard to see the closeness of this lovely young couple. This is a beautiful artwork and it is  must see.", "publishedDate": "2019-05-29", "language": "en", "rating": 5}, {"id": 657250273, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d9851986-r657250273-La_Parella-Barcelona_Catalonia.html", "text": "A random Statue opposite the harbour. No information as to what it symbolises. Photo opportunity at best.", "publishedDate": "2019-03-08", "language": "en", "rating": 3}, {"id": 581047403, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d9851986-r581047403-La_Parella-Barcelona_Catalonia.html", "text": "As we walked along the waterfront of Barcelona, we came across this sculpture. Just take a photo and that's it", "publishedDate": "2018-05-18", "language": "en", "rating": 3}, {"id": 367905535, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d9851986-r367905535-La_Parella-Barcelona_Catalonia.html", "text": "An interesting statue for tourists to see. While we were next to it there was a small queue of people waiting to have their photos taken in the middle of the two figures. My wife was one of them. I noticed, like elsewhere, that it was largely a case of women posing while the men took the photos. Is this always the case?", "publishedDate": "2016-04-26", "language": "en", "rating": 4}]}}]