[{"locationId": 10065946, "name": "Monumento a Roger de Lluria", "placeType": "ATTRACTION", "reviewListPage": {"reviews": [{"id": 712671609, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d10065946-r712671609-Monumento_a_Roger_de_Lluria-Barcelona_Catalonia.html", "text": "This monument stands near Arch de Triumph, it is just a regular monument nothing else, probable mean something to local people.", "publishedDate": "2019-09-24", "language": "en", "rating": 3}, {"id": 690668332, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d10065946-r690668332-Monumento_a_Roger_de_Lluria-Barcelona_Catalonia.html", "text": "This monument stands in tribute Roger de Lluria, a13th century Italian admiral in the service of the Aragonese. As successful admiral, his tactics were to lure ships out of port and feigning retreat, only to turn his fleet around and attack the enemy.\n\nThe sculpture depicts Roger de Lluria standing in portrait pose in full military uniform. He holds the hilt of his sword in his right hand, while the point of the sword rests on the ground next to him.\n\nThe statue is adjacent to the monument to Francisco de Paula Rius i Taulet. Worth a look if in the area.", "publishedDate": "2019-07-18", "language": "en", "rating": 4}, {"id": 672733357, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d10065946-r672733357-Monumento_a_Roger_de_Lluria-Barcelona_Catalonia.html", "text": "This bronze statue constructed in 1885 is located on Passeig Lluis Companys, just opposite the main entrance to the Ciutadella Park.\n\nRoger de Lluria was an Admiral who defeated the French Navy in 1285, after which the French were driven out of Catalonia.", "publishedDate": "2019-05-09", "language": "en", "rating": 3}, {"id": 667746970, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d10065946-r667746970-Monumento_a_Roger_de_Lluria-Barcelona_Catalonia.html", "text": "Free\nVisit Duration: 5 minutes.\nLocation: Passeig Lluis Companys, just opposite the main entrance to the Ciutadella Park.\n\nThe Roger de Llúria Monument\nwas part of a series of 8 statues of Catalan heroes. This bronze monument commemorate the brilliant Italian admiral born in 1245  and the commander of the Aragonese Navy based in Barcelona. He is famous for having defeated the French Navy in the battle of Formigues in 1285, after which the French were driven out of Catalonia.\nHe was probably the most successful and talented naval tactician of the medieval period.", "publishedDate": "2019-04-19", "language": "en", "rating": 4}, {"id": 583580200, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d10065946-r583580200-Monumento_a_Roger_de_Lluria-Barcelona_Catalonia.html", "text": "This monument is located on Passeig Lluis Companys, just opposite the main entrance to the Ciutadella Park.  de Llúria was born in 1245 and was the Admiral of the Aragonese Navy based in Barcelona. He defeated the French Navy in the battle of Formigues in 1285 after which the French were driven out of Catalonia. Good for a photograph.", "publishedDate": "2018-05-29", "language": "en", "rating": 4}, {"id": 492200116, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d10065946-r492200116-Monumento_a_Roger_de_Lluria-Barcelona_Catalonia.html", "text": "We happened to walk by this. Nice monument  if you happen to walk by. Not anything to plan a special trip for. ", "publishedDate": "2017-06-11", "language": "en", "rating": 4}]}}]