[{"locationId": 195252, "name": "Gran Teatre del Liceu", "placeType": "ATTRACTION", "reviewListPage": {"reviews": [{"id": 725925362, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d195252-r725925362-Gran_Teatre_del_Liceu-Barcelona_Catalonia.html", "text": "Good sound good light's good decoration . Right on the ramblas ,Barcelona best teathre ,yesterday was my 3rd time but is always like the first time", "publishedDate": "2019-11-12", "language": "en", "rating": 5}, {"id": 718931175, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d195252-r718931175-Gran_Teatre_del_Liceu-Barcelona_Catalonia.html", "text": "Have to disagree with earlier review about Turandot. Staging was more Fritz Lang’s Metropolis than StarWars.  Programme had plot summary in English and majority of seats have an electronic libretto system with Spanish, Catalan or English translation.  It was superb and the theatre is beautiful.", "publishedDate": "2019-10-16", "language": "en", "rating": 5}, {"id": 718844176, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d195252-r718844176-Gran_Teatre_del_Liceu-Barcelona_Catalonia.html", "text": "I was unpleasantly surprised, that flyers with program description were only printed in Catalan, no English available. The same goes for subtitles on the curtains, no subtitles at the seats either. They show it clearly - foreigners are not welcome. In addition, the new production of Turandot was obviously influenced by Star Wars. So much for rejecting foreign culture. ", "publishedDate": "2019-10-16", "language": "en", "rating": 2}, {"id": 707118634, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d195252-r707118634-Gran_Teatre_del_Liceu-Barcelona_Catalonia.html", "text": "A stunning place.\n\nVariety of tickets and easy booking\n\nPerformances are well chosen.  \n\nComfortable to sit.\n\nOrganized.", "publishedDate": "2019-09-06", "language": "en", "rating": 5}, {"id": 689508873, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d195252-r689508873-Gran_Teatre_del_Liceu-Barcelona_Catalonia.html", "text": "Even if you are not an opera lover, if you are touring Barcelona you most likely appreciate art and architecture, so this is well worth a stop on your itinerary.  Gorgeous art and the building is beautiful.  If you manage to see a performance even better.  \nHighly recommend!", "publishedDate": "2019-07-14", "language": "en", "rating": 5}, {"id": 689096989, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d195252-r689096989-Gran_Teatre_del_Liceu-Barcelona_Catalonia.html", "text": "It is not permitted to view the inside of the building unless you buy a ticket for performance or take a one hour tour which costs Euros 12.  Visitors are provided with an audio guide as well as a tour leader. The interior of the buildings is significant in its size, seating up to 2, 200 people for each performance in over 5 levels. The acoustics are such that no amplification is used or required.  The tour includes a visit to a private area of the building which has been in use for many decades by a select invited male society group who not only have their own bar but also a specially designed ornate lift to convey them to their seating ahead of the performance commencement.  The building has been damaged by fire on at least 2 occasions but the current reconstruction has kept to the overall feeling of opulence. A note of caution for those wishing to see opera performances is that there is  restricted viewing from certain areas of the theatre.", "publishedDate": "2019-07-12", "language": "en", "rating": 4}, {"id": 685726289, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d195252-r685726289-Gran_Teatre_del_Liceu-Barcelona_Catalonia.html", "text": "The Gran Teatre del Liceu was built in 1847 and is a unique cultural facility in Barcelona and one of Europe's leading opera houses. Located on the Rambla, every year it hosts major opera and ballet productions and symphony concerts. The building was destroyed by fire in 1994 and reopened in 1999 after a magnificent reconstruction.", "publishedDate": "2019-07-01", "language": "en", "rating": 5}, {"id": 685139868, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d195252-r685139868-Gran_Teatre_del_Liceu-Barcelona_Catalonia.html", "text": "We were fortunate enough to get tickets for Tosca performance. Absolutely beautiful auditorium, friendly staff, good acoustics. If u love opera- don’t miss a performance here!", "publishedDate": "2019-06-29", "language": "en", "rating": 5}, {"id": 674462792, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d195252-r674462792-Gran_Teatre_del_Liceu-Barcelona_Catalonia.html", "text": "A beautiful theatre with amazing shows and selections. Been there. A few times and it’s always such as pleasure. Always fully enjoying ourselves there. We recommend you to come and look at it.", "publishedDate": "2019-05-16", "language": "en", "rating": 5}, {"id": 670199270, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d195252-r670199270-Gran_Teatre_del_Liceu-Barcelona_Catalonia.html", "text": "Three works by Jiri Kylian. Beautifully danced, presented and lit.\n\nTwo hour performance. Less than hour in actual dance.\n\nConcluding with the amazing Petite Mort.\n\nGreat auditorium, comfortable seating, great sight lines, good accessibility.", "publishedDate": "2019-04-29", "language": "en", "rating": 5}, {"id": 665022436, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d195252-r665022436-Gran_Teatre_del_Liceu-Barcelona_Catalonia.html", "text": "Two weeks ago with the anniversary of the theater I had the great luck and the pleasure of being able to attend the opera Madame Butterfly. Be fascinated with the beauty of this theater, so many years for this city and never visited. And the performance of the excellent protagonist. Be fascinated", "publishedDate": "2019-04-09", "language": "en", "rating": 5}, {"id": 659310071, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d195252-r659310071-Gran_Teatre_del_Liceu-Barcelona_Catalonia.html", "text": "We make it a point to attend an opera performance at the Liceu every time we are in Barcelona, two to three times per year.  The theater itself is beautiful to see, the seats are comfortable and having your own individual subtitles in your own language is also a big plus.  The quality of the operas and singing is first rate.\n\nThe better seats are not inexpensive, but if you are just interested in seeing the theater you can get partial view or high up seats at reasonable prices. \n\nIf you can do a tour of the theater is certainly worth it,  not easy to get because it has to be on specific days so as to not interfere with the performances,  and the guides don't speak much English, but it is a experience not to be missed.\n\nAnd, lastly,  I have had the need to contact the Liceu in various occasions via e-mail prior to our visits and I am amazed at their professionalism and how quickly they respond.  This is a first class theater in every way.", "publishedDate": "2019-03-18", "language": "en", "rating": 5}, {"id": 650699817, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d195252-r650699817-Gran_Teatre_del_Liceu-Barcelona_Catalonia.html", "text": "Our hotel was very close to this theater.  I did not plan on visiting it, but because its tour was included in the Barcelona Pass, we gave it a shot.  We arrived 5 minutes before the scheduled tour start.  The waiting area was cozy with little seating.    \nWhat a delight the tour was!  The docent explained every spot she stopped us in both English and Spanish.  This is the biggest horseshoe shaped Opera theater in the world.  While some seats are not for seeing the singers (rather for being seen), acoustic must be phenomenal!  Unfortunately, we could not get to hear the sound this time.  Maybe we have to go back to see one of the shows there.  \nThis theater is across the street from Liceu Metro station (on Las Ramblas) as well as a stone throw from Mercado de La Boqueria (market).  It may not look much from outside, but inside, a well maintained theater awaits you.  Sit in one of the padded seats while the docent speaks.  It is a good rainy day activity!", "publishedDate": "2019-02-07", "language": "en", "rating": 4}, {"id": 650585294, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d195252-r650585294-Gran_Teatre_del_Liceu-Barcelona_Catalonia.html", "text": "We managed to get a last minute tour of the Barcelona opera house. A quick visit through the main hall, the concert hall and it was very informative. It is a beautiful site and a must for opera lovers! Just wished we could have spent more time inside! ", "publishedDate": "2019-02-06", "language": "en", "rating": 4}, {"id": 649643669, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d195252-r649643669-Gran_Teatre_del_Liceu-Barcelona_Catalonia.html", "text": "The Liceu is a beautiful theatre.\n\nIt's big and very well decorated. It's all gold and red.\n\nThere's good leg room and the seats are comfortable. \n\nThe ceiling and the boxes are amazing, and the acoustics are excellent.\n\nThe price is more than worth it.\n\nDon't miss it!! ", "publishedDate": "2019-02-02", "language": "en", "rating": 5}, {"id": 644148919, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d195252-r644148919-Gran_Teatre_del_Liceu-Barcelona_Catalonia.html", "text": "Expensive but high quality productions in general, wonderful theater. You can cheap tickets and sit in the upper part of the theater and have an incredible accoustic!", "publishedDate": "2019-01-06", "language": "en", "rating": 5}, {"id": 643347078, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d195252-r643347078-Gran_Teatre_del_Liceu-Barcelona_Catalonia.html", "text": "This is a nice looking building from the outside proudly flying it's Spanish flags. It's worth seeing as it's on La Rambla but costs nine euros to go inside on the tour which I didn't do.", "publishedDate": "2019-01-03", "language": "en", "rating": 3}, {"id": 637671553, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d195252-r637671553-Gran_Teatre_del_Liceu-Barcelona_Catalonia.html", "text": "A beautiful building to wander around. The Mirror room and Lobby are stunning. They were rehearsing in the Auditorium when we went so it was fairly dark & no pictures allowed; but it was awe-inspiring. I recommend this tour; but check if you can see the Auditorium properly.", "publishedDate": "2018-12-05", "language": "en", "rating": 4}, {"id": 602176292, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d195252-r602176292-Gran_Teatre_del_Liceu-Barcelona_Catalonia.html", "text": "We scheduled a tour while checking out the sights on La Rambla and had time to run across the street for lunch before our tour. Our guide spoke several languages and smoothly switched from English to the other couples language. She was very informative and gave us an excellent tour full of interesting history. The opera house was founded in 1847 for the high class society. It was rebuilt in 1999 after a fire in 1994. It is one of the most well known opera houses. The inside is lovely and the auditorium has 5 tiers, seats 2,292 with no royal box. The 4th and 5th tiers are the cheapest seats, the main floor seats are made of iron and red velvet and there are luxurious boxes called Banyeres. Worth taking the time for a guided tour.", "publishedDate": "2018-08-02", "language": "en", "rating": 5}, {"id": 595339608, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d195252-r595339608-Gran_Teatre_del_Liceu-Barcelona_Catalonia.html", "text": "Dan was an amazing and enthusiastic tour guide and really made it an engaging tour for us. You can tell that he's passionate about his work and it's not hard to see why when you see the absolute beauty of the opera house. It's impossible to see from the exterior how spectacular the interior really is, not to mention the incredible history. It's nine euros, or seven fifty for a student, and it's really worth it for a 45 minute tour of this beautiful place. It's just off La Rambla near the Boqueria market so very close to everything! Just arrive ten minutes before the hour (from 2 pm) to book a ticket or go inside earlier and book ahead. If you enjoy beautiful architecture and history - it's definitely worth it! Thank you Dan :)", "publishedDate": "2018-07-11", "language": "en", "rating": 5}, {"id": 595338718, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d195252-r595338718-Gran_Teatre_del_Liceu-Barcelona_Catalonia.html", "text": "Thanks to Dan for the most enthusiastic and informative tour I have been on since being in Europe for the last 5 weeks. Your zeal for the Gran Teatre del Liceu certainly made its mark on us. €9.00 and certainly worth every penny. Thanks again!", "publishedDate": "2018-07-11", "language": "en", "rating": 5}, {"id": 592498132, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d195252-r592498132-Gran_Teatre_del_Liceu-Barcelona_Catalonia.html", "text": "We had a personal tour just for the two of us. This is Barcelona's Opera house. When you go inside this amazing building, you would never imagine how incredibly big and beauty it is. Must see.", "publishedDate": "2018-07-02", "language": "en", "rating": 5}, {"id": 587884888, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d195252-r587884888-Gran_Teatre_del_Liceu-Barcelona_Catalonia.html", "text": "There are daily tours here that take place in the morning. Ask at the desk and they will tell you how to proceed. The early tours take place when the opera house is silent, so the lights are turned out and you can see everything. The later the tours, the more likely there will be action on the stage, and the house lights will be dimmed for rehearsals and you will not be allowed to photograph the stage. The reception areas are wonderful to see, especially since they represent a time gone by. Anyone with even a modest interest in theatre should take in this affordable tour, done in English and Spanish.", "publishedDate": "2018-06-16", "language": "en", "rating": 5}, {"id": 587264047, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d195252-r587264047-Gran_Teatre_del_Liceu-Barcelona_Catalonia.html", "text": "We saw Manon Lescaut and thought the stage design was outstanding \n\nThe €23 per head nibbles at interval was well worth it. Great space as well. Highly recommended \n\n", "publishedDate": "2018-06-13", "language": "en", "rating": 4}, {"id": 584787865, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d195252-r584787865-Gran_Teatre_del_Liceu-Barcelona_Catalonia.html", "text": "Because it was as a rainy Sunday and we were stuck outside the Opera House sheltering from the rain on La Rambla we spotted an advertisement for the tour run by the Ooera itself. It was hourly so we paid €9 for an adult and €6.50 for a Senior over 65. There are different tours some more extensive and some different schedules for weekdays so consult the website. Note there are some marble staircases to climb. \nIt was a pure delight. Would absolutely recommend it for the hour it takes. The guide held us entranced explaining the history and architecture first in Spanish then in English. There are other language audio guides. \nThis is a great tour and extremely reasonably priced. We loved it!", "publishedDate": "2018-06-03", "language": "en", "rating": 5}, {"id": 583330948, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d195252-r583330948-Gran_Teatre_del_Liceu-Barcelona_Catalonia.html", "text": "I don’t know this opera house until I walked pass there. What a lovely place. You can join he tour every hour. The tour guide was very nice and helpful. She knows a lot and answer every questions. I like the group is not a big group so you can enjoy the tour more. It’s a lovely place to visit. ", "publishedDate": "2018-05-28", "language": "en", "rating": 5}, {"id": 578806263, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d195252-r578806263-Gran_Teatre_del_Liceu-Barcelona_Catalonia.html", "text": "I saw The Demon here recently. I really enjoyed this lesser played opera and thought the innovative stage production was one of the best I've ever seen. The opera house was beautiful, large, but with quite a few empty seats (I guess La Boheme would have been full?). \n\nBigger stage than Covent Garden and v good legroom. At 5'5 I didn't even have to get up fully for people to get passed!! . Nice raking facilitated a perfect view from row 12 of the stalls. Tickets a bit expensive I thought! even by opera standards. \n\nThe little screens for subtitles, on the rear of the seats are a great idea. I thought I read there's an English option? there wasn't. I can read Spanish fine, but without that you'd be stuffed for understanding what's going on. Main surtitles are in Catalan. Staff were helpful to me. Overall great experience.", "publishedDate": "2018-05-08", "language": "en", "rating": 5}, {"id": 576101300, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d195252-r576101300-Gran_Teatre_del_Liceu-Barcelona_Catalonia.html", "text": "Stumbled into this Opera House by accident and paid for a one-to-one 50 minute tour of this wonderful building. My guide spoke excellent English and was very proud  interested in imparting all the information about the rooms, the decorations, the paintings, the artists and the glorious huge hall. My only regret was that I was unable to stand on the stage. There is a monthly tour that includes that. A very worthwhile history of a beautiful building", "publishedDate": "2018-04-27", "language": "en", "rating": 5}, {"id": 576011424, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d195252-r576011424-Gran_Teatre_del_Liceu-Barcelona_Catalonia.html", "text": "Liceu is pompous but creepy theatre were most visitors are old rich people from Barcelona that they rather prefer socialize than listen good music. the seats are uncomfortable, the staff is not willing to help, and the most important of all, ths sound is awful. If you want to hear a good concert in Barcelona I will rather recomend El Palau de la Musica, even If they don't do operas, becouse is not big enough, the bulduing is a real modernist artwork, and the sound is ten times better.", "publishedDate": "2018-04-27", "language": "en", "rating": 1}, {"id": 574685926, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d195252-r574685926-Gran_Teatre_del_Liceu-Barcelona_Catalonia.html", "text": "The horse shoe shaped auditorium is associated with a long history. It's five level seating area for the audiences is very impressive.", "publishedDate": "2018-04-21", "language": "en", "rating": 4}, {"id": 566133174, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d195252-r566133174-Gran_Teatre_del_Liceu-Barcelona_Catalonia.html", "text": "Inside the opera theater there is \"el cercle del Liceu\", a private club, inspired in the English men's club of Pall Mall in London. In fact, they have reciprocal agreement with several of them.\nInside decoration is Catalan art nouveau.\nYou can only visit it if you are member or invited by a member.\nDress code is formal.\n", "publishedDate": "2018-03-12", "language": "en", "rating": 5}, {"id": 559657017, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d195252-r559657017-Gran_Teatre_del_Liceu-Barcelona_Catalonia.html", "text": "This is a beautiful theater with a stunning façade, centrally located on the Rambla.\nWe visited the theater in the evening, when it was dramatically lit.", "publishedDate": "2018-02-10", "language": "en", "rating": 3}, {"id": 558888376, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d195252-r558888376-Gran_Teatre_del_Liceu-Barcelona_Catalonia.html", "text": "We had a friendly guid but he didn’t tell a lot of things, we watched a repetition of Romeo and Juliet for 20 min which was very nice. But the tickets for the visit are expensive, 7,5€ for a student...", "publishedDate": "2018-02-06", "language": "en", "rating": 3}, {"id": 557526821, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d195252-r557526821-Gran_Teatre_del_Liceu-Barcelona_Catalonia.html", "text": "The Liceu was one of the first places that we visited in Barcelona.  In addition to our guide, the venue provided a superb guide.  We learned of the history and saw some of the remarkable architecture. In a city of exceptional architecture, the Liceu shows the traditional past. Then, we had a unique opportunity to sit in and hear the practice of the youth choir and orchestra as they prepared for their upcoming show.  Wonderful voices and a demonstration of how the acoustics of the theatre allow you to hear everything perfectly even at the highest level.", "publishedDate": "2018-01-31", "language": "en", "rating": 5}, {"id": 556946795, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d195252-r556946795-Gran_Teatre_del_Liceu-Barcelona_Catalonia.html", "text": "If you like classical music and, mainly, if you like opera, you have to go!!!! We went to see \"L'elixir d'amore\" and it was terrific!!!! The place is also amazing, with nice chairs and subtitles not also in the upper part of the scene (it would be highly recommended to deliver them in Spanish, which is quite more common than Catalan) but you can also see them in front of your set (Spanish/English and Catalan). Quite an experience.", "publishedDate": "2018-01-28", "language": "en", "rating": 5}, {"id": 549521083, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d195252-r549521083-Gran_Teatre_del_Liceu-Barcelona_Catalonia.html", "text": "I booked for the tour that took in the private club, the reception room and the theatre itself. I was the only person on the tour so I had a very personalised experience. the Seniors price of 12€ was well worth it for the experience.", "publishedDate": "2017-12-27", "language": "en", "rating": 5}, {"id": 548613248, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d195252-r548613248-Gran_Teatre_del_Liceu-Barcelona_Catalonia.html", "text": "We sent off for our tickets to \"Tristan und Isolde\" well in advance of our travels because we know that Wagner is always a sell-out at any opera venue and wanted to make sure we had the best seats possible for my favorite opera. The Gran Teatre did not disappoint on any level. The theater's acoustics are as impeccable as its decor is gorgeous. We had saved our tickets to an app on our cell phones but neglected to save the receipt for our pre-paid programs (The Metropolitan in New York should look to the Gran Teatre as an example of what a fine printed program is. We had pre-ordered two copies (one for me and one for my partner) and were afraid we would have to do without. This turned out to be no problem whatsover, as the young man in charge quickly noted our names and, as he handed our programs to us, explained he would fix the tally on his computer once the curtain went up. The interior of the theater is exceptionally beautiful and the strained iron and red velvet setas in the main seating areas are comfortable. Most seats have individual monitors with electronic subtitling in English, Spanish or Catalan. Refreshments include excellent quality sandwiches and a good wine selection that includes cava, as might be expected. All employees and ushers were helpful and courteous. The excellence of the acoustics cannot be overemphasized,", "publishedDate": "2017-12-22", "language": "en", "rating": 5}, {"id": 545834539, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d195252-r545834539-Gran_Teatre_del_Liceu-Barcelona_Catalonia.html", "text": "We purchased two tickets for an Italian opera for September 18 after being assured English subtitles were available via electronic boxes at our seats.  Once the lights dimmed, so did our electronic boxes.  We immediately alerted the usher who acknowledged that our section had been having these problems of late.  However, the house manager on duty wasn't sympathetic.  After 30 minutes of mishandling our requests for comparable seats with working screens, we realized we had lost too much of the opera’s plot and requested to exchange our tickets for the next night when we could see the full performance.  Management refused our request and insisted we make another attempt to be re-seated.  We declined that offer and requested a refund, which was also summarily dismissed.   Management verbally insisted that fully operational boxes are not guaranteed, and they are not responsible for malfunctioning boxes.  Thus, be aware you purchase tickets at your own risk.", "publishedDate": "2017-12-07", "language": "en", "rating": 1}, {"id": 544815164, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d195252-r544815164-Gran_Teatre_del_Liceu-Barcelona_Catalonia.html", "text": "It was a great honor to visit Teatre for a special corporate event... great interiors, nice decors and plus, if you have a guide, who can tell you the story, than it is bring you entire picture together!", "publishedDate": "2017-12-03", "language": "en", "rating": 5}, {"id": 544145903, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d195252-r544145903-Gran_Teatre_del_Liceu-Barcelona_Catalonia.html", "text": "This opera house is very large and with good acoustics \nThe seats are a little tired and lumpy and the services are to few with difficult doors to use with so many people waiting \nIt is a charming house but needs some updating \nThe staff were great friendly and helpful \nI look forward to visiting again one day ", "publishedDate": "2017-11-29", "language": "en", "rating": 4}, {"id": 544079251, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d195252-r544079251-Gran_Teatre_del_Liceu-Barcelona_Catalonia.html", "text": "First, while they do have a nice interactive ticket buying system at the ticket office next door, well, guess what, they don't even friggin' tell you that some seats come with a viewer that translates the language of the opera WHILE OTHERS DON'T.  Learned that the hard way.  \n\nFurther, when we arrived, though there almost ZERO other patrons in the lobby, I HAD to seek out staff to take us to our loge to seat us.  And they made this seem like an imposition.  Further, at intermission, after I went to use the men's room, my e-ticket would not allow back into my loge.  The staff were dumbfounded and it took 5 mins. to find a manager who could get me back into my seating area. In short, the customer services was atrocious.  So why was I paying $100+ a ticket?  I don't know.  Well, at least the Catalonians are confident in why they must leave the Spanish behind-they are just so much more superior-hilarious.", "publishedDate": "2017-11-29", "language": "en", "rating": 1}, {"id": 543839066, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d195252-r543839066-Gran_Teatre_del_Liceu-Barcelona_Catalonia.html", "text": "Beautiful theatre. Absolutely fantastic renovation realised  by perfect architectural artists.  Loved this place. Recommend it .", "publishedDate": "2017-11-28", "language": "en", "rating": 5}, {"id": 542293058, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d195252-r542293058-Gran_Teatre_del_Liceu-Barcelona_Catalonia.html", "text": "My husband and I booked tickets online in advance (they were e-tickets). The hall is beautiful and the lobby and bar spacious and comfortable. We splurged on full view seats and were glad that we did. This is one of the top opera houses in Europe and the production of Don Giovanni that we saw was really well performed. And for a non-traditional staging, it wasn't too crazy. Orchestra and chorus top-notch.", "publishedDate": "2017-11-20", "language": "en", "rating": 5}, {"id": 541435330, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d195252-r541435330-Gran_Teatre_del_Liceu-Barcelona_Catalonia.html", "text": "Bought some 100% obstructed view tickets to a performance for like 13 Euros - actually cheaper than tour tickets. Don't worry about obstructed views. The seats have tiny video screens - kind of like an airplane - so you can see what is going on on stage. The best part is you can choose the language of the subtitles on your individual screen. So while seats that can actually see the stage have to use the Catalan supertitles projected above the stage as the only translation, my wife and I could watch our little TVs, listen to the live performance in the theater, and read English subtitles so we actually knew what was going on! Actually turned out better than if we paid to see the stage.\nWe got there early enough before the show so we wandered around the really nice bar they have and also down to the orchestra where we could get a great view of the whole place!\nDon't worry about dress code or anything - I just wore the nicest stuff I had with me - a button down shirt and khakis.\nWe actually skipped out after the first act so we could run over to the Palau de Musica and catch another show in that theater!", "publishedDate": "2017-11-16", "language": "en", "rating": 5}, {"id": 540831266, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d195252-r540831266-Gran_Teatre_del_Liceu-Barcelona_Catalonia.html", "text": "Me and my partner bought tickets for romeo and Juliet on Tuesday 7th Nov. We were late to the performance due to an honest mistake with the time difference between uk & spain and they wouldn't allow entry - they made us watch the performance on a small cinema projection.\n\nMy main gripe is that when I engaged there customer services they became completely ignorant when I wanted to discuss the possibility of a refund or make a complaint. I have not had a response back. \n\nTerrible customer service, although I appreciate I was late to the performance, more could have been done to provide a good customer experience.", "publishedDate": "2017-11-13", "language": "en", "rating": 1}, {"id": 537046889, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d195252-r537046889-Gran_Teatre_del_Liceu-Barcelona_Catalonia.html", "text": "We decided to do a guided tour and it was amazing, we were privileged to be able to listen to a rehearsal for the evenings performance. Unbelievable. The young girl guide was so enthusiastic she just made the tour . ", "publishedDate": "2017-10-30", "language": "en", "rating": 5}, {"id": 536870597, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d195252-r536870597-Gran_Teatre_del_Liceu-Barcelona_Catalonia.html", "text": "This is our second time here.  It is SOOOO beautiful and compares with the best in the world - we travel for opera.  The opera company is also outstanding as was the orchestra.  Worth the visit for sure.  I know they give tours too and that must be worthwhile as well.", "publishedDate": "2017-10-29", "language": "en", "rating": 5}, {"id": 536015917, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d195252-r536015917-Gran_Teatre_del_Liceu-Barcelona_Catalonia.html", "text": "We didn’t plan to visit this place, but we got there because we purchased Barcelona pass cards and Liceu Opera theatre was included in the list of attractions.\nThis was a guided tour. The quality was excellent. We were pleasantly surprised!\n\nThis Opera theatre has a rich history. It was built more than 150 years ago and it burned in fire three times and three times it was rebuilt in its original status, with some improvements.\nInitially it was a private venue, where the rich people could buy a box etc, but after the third fire, this Opera theatre was rebuilt by the state and it is now a public building.\n\nThe Liceu Opera is stunningly beautiful - the walls, the ceilings, everything inside looks like a rich royal palace.\nWhat surprised me was that there were areas in this theatre with almost no visibility to the stage (acoustic is perfect, but no visibility). Hence the sits with no visibility have small monitors. Most of the places have small screens for subtitles in various languages... \nThe guide of the tour was excellent - she was knowledgable, charming and friendly. Strongly recommended attraction in Barcelona. A hidden gem!", "publishedDate": "2017-10-25", "language": "en", "rating": 5}, {"id": 526521824, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d195252-r526521824-Gran_Teatre_del_Liceu-Barcelona_Catalonia.html", "text": "We went here by mistake - intending to go to the Palace of Music  - but  really, really glad we did.  An escorted tour with just 4 people was amazing.  The history of the building is very interesting but it is the design, décor and furnishings of all the rooms that catches the eye.  The guide was first rate and explained things very clearly.  Lots of very interesting details, culminating in a view of the theatre from the top balcony.  Well worth a visit", "publishedDate": "2017-09-22", "language": "en", "rating": 5}, {"id": 507253273, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d195252-r507253273-Gran_Teatre_del_Liceu-Barcelona_Catalonia.html", "text": "Just because you are a visitor you dont have to miss out on culture. We booked two tickets for an opera performance the same night. Good seats for E108pp. World class perfromers in a magic building. Skip the crowds at the Segrada Familia and  go Opera. Relaxed dress code so smart causla is all that required. Counter service available in English.. Free Cava at hald time. Heh!", "publishedDate": "2017-07-30", "language": "en", "rating": 5}, {"id": 501279731, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d195252-r501279731-Gran_Teatre_del_Liceu-Barcelona_Catalonia.html", "text": "The opera itself is beautiful and interesting but we were able to listen in on rehearsals for Il Travatore and although I'm not a big fan of opera music in general, it was wonderful to hear the voices and see the performers perfecting their craft. ", "publishedDate": "2017-07-12", "language": "en", "rating": 5}, {"id": 499120538, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d195252-r499120538-Gran_Teatre_del_Liceu-Barcelona_Catalonia.html", "text": "Wished for many years to have the opportunity to visit inside this opera house. I found the opportunity to spend less than one hour in a guided tour, very nice; friendly guide; quite expensive.", "publishedDate": "2017-07-06", "language": "en", "rating": 5}, {"id": 495299446, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d195252-r495299446-Gran_Teatre_del_Liceu-Barcelona_Catalonia.html", "text": "Located at the La Rambla, it is a delightful place to visit. Just pop in and book a tour of the theater. It was magnificent. The ceiling was breathtaking. It is a huge place and very ornated as one would expect. I am not an opera lover but the architecture was amazing. I enjoyed it very much and hope you would do.", "publishedDate": "2017-06-22", "language": "en", "rating": 4}, {"id": 494485640, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d195252-r494485640-Gran_Teatre_del_Liceu-Barcelona_Catalonia.html", "text": "Rigoletto. Brilliantly played, sung, acted and produced. The set was flexible. The red robes swirled.", "publishedDate": "2017-06-20", "language": "en", "rating": 5}, {"id": 490080399, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d195252-r490080399-Gran_Teatre_del_Liceu-Barcelona_Catalonia.html", "text": "This a stunning Opera House which is both traditional and modern. The tour was a great opportunity to learn more about the history of the building - it was an hour well spent and a great opportunity to explore the Opera House, which is a stunning building.", "publishedDate": "2017-06-03", "language": "en", "rating": 5}, {"id": 487631154, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d195252-r487631154-Gran_Teatre_del_Liceu-Barcelona_Catalonia.html", "text": "The Liceu Opera House was built in 1847, the works of construction having begun two years before. The opening ceremony of the theatre took place on April 4th 1847. The building was devastated by a fire in 1861 and rebuilt under the direction of the architect Josep Oriol Mestres. Again the building was destroyed by a fire in 1994 and once more rebuilt, the relevant opening ceremony after finishing that last rebuilding works was held in 1999. The stated rebuilding conformed with the standards regarding the Opera House atmosphere and advantage of such a rebuilding was taken to enlarge the stage considerably in order to adapt the same to the present trends.\nThat Opera House stands in the Ramblas, which is perhaps the most popular, most crowded and most colourful street in Barcelona. In it the building concerned can be deemed as one of the most conspicuous architectural landmarks. It has three façades and that looking onto the Ramblas is stupendous. At the entrance there are three portals with semicircular arches, there being above each one of them a large nicely decorated window of the same type. At the top level, above each one of the said windows there is a set of five smaller windows – three sets altogether – of identical style thus forming the whole a very attractive and beautiful ensemble. Everything inside the theatre is grandiose, beautiful and designed with a refined taste: the hall, the mirrors saloon, the staircase and of course the different interior spaces, architecture and decoration of the auditorium and stage. All the mentioned elements reflect the ambiance of the nineteenth century and therefore that monumental edifice ought to be deemed as a single artistic unit despite the different stages of building and rebuilding to which it has been subjected from 1844 to 1999. In this respect it must be outlined that the results corresponding to all the enlargements that the building has endured are not distinguishable from the original parts dating from the nineteenth century which were not affected by the different fires. Therefore the criterion of unity has been abidden by, what can be observed in the whole building from an architectural viewpoint. That feature keeps up with and is essential to the functionality of the Gran Teatro del Liceo.\nThe Opera House counts with a large artistic heritage. The most famous of its art works are the mural paintings consisting of twelve oil canvass works by Ramon Casas. Besides, the library and the art nouveau decoration at large are also outstanding elements in this regard, and the furniture, the sculptures and the inlaid work in the auditorium is a real sample of taste and splendid refinement.\nThe seats in general in the auditorium are very comfortable and their layout is very adequate for watching a performance easily. The acoustics inside the auditorium is fabulous. The singings and the music are easily audible from any part of it as clearly as if the singers and musicians were close to anyone of the audience irrelevant of the distance from the stage. The undersigned went there on April 6th 2017 to see the scenic interpretation of Rigoletto and it was great. Everything was perfect. \nThe only drawback as regards that Opera House is that the entrance fees are too dear, the more so if compared with those to be paid in similar opera houses in other European countries. The price of the pit seat tickets for the performance referred to in the previous paragraph was about 270 euros, which is simply abusive and ridiculously expensive. In spite of this disadvantage it’s worth going to see an opera in that theatre though only once in the lifetime.", "publishedDate": "2017-05-25", "language": "en", "rating": 5}, {"id": 481226038, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d195252-r481226038-Gran_Teatre_del_Liceu-Barcelona_Catalonia.html", "text": "I was able to attend the express tour (30 minutes, €6) and it was excellent! The opera house has an interesting history, and you hear lots of stories on the tour. Inside the theatre is so beautiful, well worth a quick trip inside! ", "publishedDate": "2017-05-03", "language": "en", "rating": 5}, {"id": 479551604, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d195252-r479551604-Gran_Teatre_del_Liceu-Barcelona_Catalonia.html", "text": "I used to live in Barcelona, and had for several years a subscription to El Liceu, so I know this venue very well.\nThe opera house was rebuilt after a fire in the 90s. It caused much controversy because some folks believed the fire was intentional so they could kick neighbors nearby of, which is what they ended up doing. Regardless, the work they did is fabulous, and this is currently one of the top 5 opera houses in Europe.\nThere are many DVD recordings on sale from El Liceu, but BE AWARE, and this is very important, that most of the productions are very bold and contemporary, which many opera goers despise.\nI am not so against them, and actually, I have watched many which are done with gusto. I do admit that some others (Beito for instance comes to mind) are not very pleasant to watch. Ultimately, though, this is a personal preference and I am not trying to start a debate here.\nI'd say though that, if you love opera and happen to be in the city, get tickets and attend a show. Tickets are expensive and hard to find. Catalan people actually love music in general and opera in particular, so the venue is usually sold out. But still, try it and see it for yourself. The building inside is a pure joy, with many reasons for you to believe your money was worth. (Only El Palau de la Musica is a better building than this).\nThe venue is located in the middle of LAS RAMBLAS. Be careful because the Ramblas are infested with pickpockets, and late and night, other uglier stuff. Just use common sense.", "publishedDate": "2017-04-27", "language": "en", "rating": 5}, {"id": 475115712, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d195252-r475115712-Gran_Teatre_del_Liceu-Barcelona_Catalonia.html", "text": "I am not a big opera-fan., but a visit here was fanstastic.\nThe house is so beautiful.\nThe opera-hall is amazing.", "publishedDate": "2017-04-12", "language": "en", "rating": 5}, {"id": 473958264, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d195252-r473958264-Gran_Teatre_del_Liceu-Barcelona_Catalonia.html", "text": "This was not a must-see on our list, but we happened to go by about 15 minutes before the next guided tour, so why not? It turned out to be very interesting, not just architecturally, but for the history that goes with it; civil strife, fires and more. Very worthwhile, in our view. The tour guide in English was excellent. This may not be an essential part of the Barcelona experience, but it was nonetheless quite worthwhile. Glad we went.", "publishedDate": "2017-04-09", "language": "en", "rating": 4}, {"id": 473417553, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d195252-r473417553-Gran_Teatre_del_Liceu-Barcelona_Catalonia.html", "text": "I've never had such comfortable seats.  Lots of space in the stalls.  There's a good system with subtitles in English or Catalan - the main surtitles are in Spanish.  The Hall of Mirrors is good to look at but a bit crowded at the interval.  The lower level snack bar is more spacious and better.", "publishedDate": "2017-04-07", "language": "en", "rating": 5}, {"id": 473412902, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d195252-r473412902-Gran_Teatre_del_Liceu-Barcelona_Catalonia.html", "text": "We didn't go inside, but passed the Teatre whilst wandering down La Rambla. Worth a stop for a good look and photos.", "publishedDate": "2017-04-07", "language": "en", "rating": 3}, {"id": 470639521, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d195252-r470639521-Gran_Teatre_del_Liceu-Barcelona_Catalonia.html", "text": "Joined the English speaking guided tour for the opera house and private club. The opera auditorium is lovely but the lobby and salons before it are even better. The arts and crafts style of the private club contrasts with the Grecian style of lobby area. Lots to see. Photos welcome. No shop or cafe. \n\nOur tour guide was great. Her English and knowledge of Spanish history and art history was excellent. There were only three of us. We sat down in the auditorium and ended up talking about politics and history for ages. She was in no hurry to move us along. \n\nHighly recommend. Location on La Rambla also really convenient for metro and shops. ", "publishedDate": "2017-03-27", "language": "en", "rating": 5}, {"id": 470264741, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d195252-r470264741-Gran_Teatre_del_Liceu-Barcelona_Catalonia.html", "text": "I'm not a particular avid fan of the Opera but love to have a look around the Grand Opera houses whilst  on city breaks.\nThe Gran Teatre del Liceu is situated on La Ramblas and cost us 9 euros (£7.80) each for a 45 minute tour.\nThere were only four of us in our group so the tour was quite intimate and we were able to ask a number of question to the tour guide. The tour guide spoke good English and was extremely informative.\nThey were making preparations for the performance of Rigoletto whilst we were there and unfortunately couldn't take any pictures of the main stage. The rest of the Opera house was very impressive, well worth visiting.", "publishedDate": "2017-03-26", "language": "en", "rating": 4}, {"id": 460846539, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d195252-r460846539-Gran_Teatre_del_Liceu-Barcelona_Catalonia.html", "text": "This is a lovely centrally located theater.\nYou will see it when you stroll La Rambla.\nThe guided tour inside was just average, but you can also go to a show in the theater (just make sure to check the schedule and buy tickets in advance, as they sell out rather quickly).", "publishedDate": "2017-02-18", "language": "en", "rating": 3}, {"id": 459102217, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d195252-r459102217-Gran_Teatre_del_Liceu-Barcelona_Catalonia.html", "text": "Well contemporary and modern dance. Difficult stuff. Is it good, or is it pretentious stuff critics tell me is good? Honest answer is that I don't know. Ballet Prejlocja isn't readily accessible like a narrative ballet. Interesting choreography, strange percussion and sounds, Vivaldi apart.  No idea what it was about. Theatre was great as ever. It's a lovely place to see opera and dance.", "publishedDate": "2017-02-13", "language": "en", "rating": 5}, {"id": 458953439, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d195252-r458953439-Gran_Teatre_del_Liceu-Barcelona_Catalonia.html", "text": "Built in the late 18th century this theatre has hosted many great singers and performers such as Placido Domingo and Pavarotti. It has a grand entrance foyer where you can book a guided tour lasting up to an hour. Some parts of the building were destroyed but then rebuilt for example the hall of mirrors with its ornate painted ceiling. The Gentlemans club has a grand piano and auditions of prospectful artists may be held here. It is said that Montserrat Caballe was auditioned here and she was later invited to join this elite club room.The tour visits the main auditorium where you will experience the grandeur and elegance of this great old theatre. Backstage is so tall that it could accommodate the statue to be found at the marina which I understand is around 60 metres tall. Impressive. Our tour guide was most informative and though conducted mainly in Spanish you are provided with a headset to translate the narrative. Value for money and worth the time to visit.", "publishedDate": "2017-02-12", "language": "en", "rating": 4}, {"id": 455054952, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d195252-r455054952-Gran_Teatre_del_Liceu-Barcelona_Catalonia.html", "text": "Me and my partner decided to book an opera show in advance for our trip to Barcelona. We were immediately drawn to this particular theatre because the interior gave a feeling of history, culture and purpose. We were not wrong the building was very impressive from the inside and the opera was great also. The event ran very smoothly. The theatre is situated on La Rambla and easily accessible by getting the subway to Liceu. Once you come up the stairs the theatre is just there. \n\nI recommend you try this experiance even if you like opera or not. It will give you a sense of joy just being in the presence of such history and culture.", "publishedDate": "2017-01-26", "language": "en", "rating": 5}, {"id": 447369165, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d195252-r447369165-Gran_Teatre_del_Liceu-Barcelona_Catalonia.html", "text": "Beautiful theater! Try to see a recital, opera, or other performance here. If not, do take a tour, either self-guided or a morning tour with a guide.. Unless there's a special event, you'll get to see the theater, hallways, and maybe the private rooms. As you tour, Keep in mind that this theater has been the recipient of two massive fires and one terrorist bomb attack. And it has been revitalized so beautifully. Located on the Rambla. easy to find", "publishedDate": "2016-12-28", "language": "en", "rating": 5}, {"id": 447161016, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d195252-r447161016-Gran_Teatre_del_Liceu-Barcelona_Catalonia.html", "text": "It's a large opera house. Book your ticket in advance. You can tour, but better watch a performance if you have time.", "publishedDate": "2016-12-28", "language": "en", "rating": 4}, {"id": 443350814, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d195252-r443350814-Gran_Teatre_del_Liceu-Barcelona_Catalonia.html", "text": "While working in Barcelona, Spain we had the chance to see a performance of Macbeth at the lovely Gran Teatre del Liceu. It was a fabulous production of the timeless story of Macbeth based upon Shakespeare's play and set to divine music by the incomparable Verdi, first premiered in Florence, Italy in 1847. French baritone Tezier and Austrian soprano Serafin sung the title roles flawlessly. Really a treat. Hope to attend another performance soon.", "publishedDate": "2016-12-10", "language": "en", "rating": 5}, {"id": 440414019, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d195252-r440414019-Gran_Teatre_del_Liceu-Barcelona_Catalonia.html", "text": "Large opera house in typical late 19th century style. Definitely take a tour. If time see a show. I wish we were in Barcelona one more day to see Elektra", "publishedDate": "2016-11-27", "language": "en", "rating": 4}, {"id": 432217857, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d195252-r432217857-Gran_Teatre_del_Liceu-Barcelona_Catalonia.html", "text": "The last time I was in Barcelona I had a tour of the opera house.  This time I bought tickets online and enjoyed an outstanding performance of Macbeth in this beautiful opera house.", "publishedDate": "2016-10-27", "language": "en", "rating": 5}, {"id": 430764913, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d195252-r430764913-Gran_Teatre_del_Liceu-Barcelona_Catalonia.html", "text": "The Liceu is one of the world's great opera houses, and for opera lovers a visit to Barcelona would be incomplete without attending a performance there. We had reserved our seats several months ago and were pleased with our front row box seats. The house is a gorgeous 19th-century jewel, fully restored after the fire 20+ years ago. The production of Macbeth we attended was problematic. Dramatically the opera is inferior to Shakespeare's play, and the director, Christof Loy, did not help matters. By staging the work almost entirely in black and white he undermined its visual interest; the mostly bare stage did not help much either. On the other hand, Lucs Salsi and Tatiana Serjan, were excellent as Macbeth and his lady, as was Tedor Ilincai as Macduff. The chorus was simply wonderful. With a German director in charge, it was inevitable that the opera featured a number of unexplained bits of action -- what's with the man who gets stripped of all his clothes and strides slowly offstage dressed only in a piece of drapery? -- but we've seen far sillier things on German opera stages, or even in Toronto. All in all, a satisfying evening of opera in a gorgeous building.", "publishedDate": "2016-10-22", "language": "en", "rating": 5}, {"id": 430568337, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d195252-r430568337-Gran_Teatre_del_Liceu-Barcelona_Catalonia.html", "text": "This is one of the largest and grandest opera houses ion the world. We got to view it, but did no attend a performance. That has now become a bucket list event for us", "publishedDate": "2016-10-22", "language": "en", "rating": 4}, {"id": 428004460, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d195252-r428004460-Gran_Teatre_del_Liceu-Barcelona_Catalonia.html", "text": "My wife took me to see Macbeth I was really excited to see it. We arrived at the theartre and i looked very nice the staff qere lovley the atmosphere was a bit hectic but ok. We  found our seats and the building was lovely the detail was very impressive. We waited for the play to start but to be brutaly honest I wish we didn't!!  all I can say was what the hell did I just painfully sit through!!!  The play was set between the 1800s the 1920s and the performance was rubbish Macbeth more like Macshite I would not recommend this play as I feel it was not up to par but I would recommend the theatre if going to see another play.\n\n", "publishedDate": "2016-10-14", "language": "en", "rating": 1}, {"id": 427548182, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d195252-r427548182-Gran_Teatre_del_Liceu-Barcelona_Catalonia.html", "text": "We attended the opening evening of Verdis Macbeth. Visibility is limited from many seats, but they are still rather expensive. The most expensive - but with fine visibility - cost 300 E.", "publishedDate": "2016-10-13", "language": "en", "rating": 4}, {"id": 424814661, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d195252-r424814661-Gran_Teatre_del_Liceu-Barcelona_Catalonia.html", "text": "Located in the center of the city. Nice architecture style. Excellent interior. Very good acoustic. Recommend to visit", "publishedDate": "2016-10-03", "language": "en", "rating": 5}, {"id": 422900120, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d195252-r422900120-Gran_Teatre_del_Liceu-Barcelona_Catalonia.html", "text": "Wow! What an Opera company! The production of Mozart's The Magic Flute blew me away. I have seen it several times but never in such a creative thought provoking manner! ", "publishedDate": "2016-09-27", "language": "en", "rating": 5}, {"id": 400636234, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d195252-r400636234-Gran_Teatre_del_Liceu-Barcelona_Catalonia.html", "text": "Mature couple, decided on trip to Barcelona to go to opera - Mozarts's Magic Flute. Best is to plan well ahead for seats - we did it 3 days before, and seats were limited. Eventually got 2 seats , at EUR 100.00 each, but they were to teh side, and on the 3rd floor. Strangly enough, the EUR 12.00 student seats, up in the Gods, were mostly sold out.\n\nThis is the 2nd largest opera house in Europe, in the grand style - look at the Interent and you'll see (good review on wikipedia). With 2,292 seats it is one of the biggest opera houses in Europe. Friendly and helpful, English speaking staff. One hassle is the stairs - marble, and I saw a number of near falls with high heels. Casual dressing from the locals. We didn't do the internal bars.\n\nMagic Flute was certainly different - mainly a large multimedia production with opera singing. Enjoyed it thoroufghly", "publishedDate": "2016-08-02", "language": "en", "rating": 4}, {"id": 397788669, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d195252-r397788669-Gran_Teatre_del_Liceu-Barcelona_Catalonia.html", "text": "Worth a visit - regular, if you are a local, at least a performance if you are a visitor. There are ticket prices for most pockets, and it is a great place to see.", "publishedDate": "2016-07-26", "language": "en", "rating": 5}, {"id": 396090988, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d195252-r396090988-Gran_Teatre_del_Liceu-Barcelona_Catalonia.html", "text": "An escape from La Rambla to the serenity and calm of an international opera house. Beautiful building. Can be eye-watering prices but we paid the money and went in the stalls - totally worth it. Be sure not to miss the mirrored salon for interval drinks - very efficiently served and a good choice. Food options also looked great for a snack.", "publishedDate": "2016-07-24", "language": "en", "rating": 5}, {"id": 389507967, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d195252-r389507967-Gran_Teatre_del_Liceu-Barcelona_Catalonia.html", "text": "We went to see La Boheme at the Grand Teatre Del Liceu. The theatre is beautiful and it seems that every seat is a good seat to see the show. We were on the 3rd floor, the seats were comfortable but it was too hot which made it uncomfortable. The opera was nice but the subtitles were in spanish so we could not understand a thing. Imagine watching a theatre show but not understanding what the actors are saying but at the same time not understand the subtitles. We just sat there watching people sing which was good but could not understand the story itself. We left half way throughout the show cause we were falling asleep.\n\nSo unless you are a big fan  ... do not bother. I gave a 3 stars rating because other people in the crowd seemed to enjoy it and clap and the end of every scene. So my rating is also based on the view that I had of other people cause if not it would have been a 1 star.", "publishedDate": "2016-07-05", "language": "en", "rating": 3}, {"id": 382853540, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d195252-r382853540-Gran_Teatre_del_Liceu-Barcelona_Catalonia.html", "text": "We had a very good English speaking guide who was vey understandable. Also, he was quite knowledgable about the facility.  It is splendid attraction. Very beautiful.  Well worth visiting again when in Barcelona. Perhaps for an evening event.", "publishedDate": "2016-06-15", "language": "en", "rating": 5}, {"id": 379732888, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d195252-r379732888-Gran_Teatre_del_Liceu-Barcelona_Catalonia.html", "text": "Liceu is a lovely theater and we were fortunate to see a opera here while visiting Barcelona. Greatly enjoyed by all.", "publishedDate": "2016-06-04", "language": "en", "rating": 5}, {"id": 378534526, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d195252-r378534526-Gran_Teatre_del_Liceu-Barcelona_Catalonia.html", "text": "A gorgeous opera house presenting internationally acclaimed artists in exciting and innovative productions. We saw Joyce Di Donato give a fantastic performance as Romeo. At 110 euros each our seats were not cheap but good value compered to equivalent tickets in the UK. After a fire the theatre has been tastefully restored but with modern technology and facilities.\nIt was also great to enjoy an interval glass of wine at 5 euros compared to the fifteen quid you get ripped of at Covent Garden", "publishedDate": "2016-06-01", "language": "en", "rating": 5}, {"id": 378432593, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d195252-r378432593-Gran_Teatre_del_Liceu-Barcelona_Catalonia.html", "text": "On the same day I managed to get a ticket with an excellent view.  Not familiar with the opera (I am no expert) but very nice performance. The theater is beautiful inside. \n\nI liked it better when opera performances were big events with expensive scenography but I understand that this increases the price enormously. Just having a complete orchestra and many good singers is already luxury.\n\nA good eat will cost around 50 euros, but I am sure the sound is great in the whole theater.", "publishedDate": "2016-05-31", "language": "en", "rating": 5}, {"id": 375127344, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d195252-r375127344-Gran_Teatre_del_Liceu-Barcelona_Catalonia.html", "text": "We were hoping to see an Opera here, and could have booked tickets, some are only 10 Euros, but you don't get a view of the stage AT ALL!!!.  You have a tiny tv screen and can hear what is going on, but not see anything, so I couldn't see the point! The best seats are obviously a lot more expensive, so sadly we didn't get to see a production, but for 6 euros we had a personal guided tour by a charming lady, whose name sadly I can't remember. However this allowed us into the auditorium and gave us a taste. It is a magnificent building, but I can't help but feel that the layout is all wrong, there is very limited view of the stage from upper levels. The building has had a refurb after the fire a few years ago, and I can't help but think that the designers aren't the ones who would opt for seating without a view. The toilets too are all beautifully laid out, but totally impractical. We thought the wooden panel with the sign for men & ladies was the door, but it was only a panel, the frosted glass door is to the side, yet the first thing you see as you open the communal door is the sign on the panel. Then in the ladies, there are three large wash basins, lovely, but when you are rushing for the loo in the interval, you need more cubicles and several wash basins … clearly the designers have never been in the long queue for the ladies loo in an interval!!!\nThe bar area is a stunning room and I'm so glad I've seen it, but I'm not sure I could afford to see an opera here with full view of the stage.", "publishedDate": "2016-05-21", "language": "en", "rating": 5}, {"id": 374106282, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d195252-r374106282-Gran_Teatre_del_Liceu-Barcelona_Catalonia.html", "text": "a lot was destroyed in a fire but the guided tour was reasonably priced and the tour interesting you only see the hall of mirrors and foyer which are original and the auditorium.  you may be better to see a performance here instead.", "publishedDate": "2016-05-18", "language": "en", "rating": 3}, {"id": 370403102, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d195252-r370403102-Gran_Teatre_del_Liceu-Barcelona_Catalonia.html", "text": "We decided back several months ago to arrange a trip to this wonderful city and we were looking for things to do. I knew that this was a venue worthy of a visit and while researching it discovered that on one of the nights we were to be there Plácido Domingo was appearing as Simon Boccanegra, Quickly booked tickets. Although some seven months in advance I didn't find it easy to find too many good seats left at an affordable price, it was already well booked. Our seats were perfect, this is a massive auditorium once inside, not at all as you might expect from the fairly inconspicuous exterior. We were relatively far back and up from the stage, not that that mattered as the acoustics are awesome and designed to showcase opera at its best. The theatre is stunning and the bar on the basement level is just wonderful and created such a great atmosphere for a truly spectacular evening. Plácido Domingo and the entire cast were superb, the audience adored him and we had a fantastic evening in an absolutely stunning venue - truly magical.", "publishedDate": "2016-05-05", "language": "en", "rating": 5}, {"id": 367467416, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d195252-r367467416-Gran_Teatre_del_Liceu-Barcelona_Catalonia.html", "text": "Fantastic concert in this stunningly beautiful theatre was the highlight of our visit.  Definitely worth while to check what they have on, get tickets in andvance and arrive early to absorbe the beauty and atmosphere.  Good location too on La Rambla to enjoy a before or after performance drink at one of the outdoor restaurants.", "publishedDate": "2016-04-25", "language": "en", "rating": 5}, {"id": 365752871, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d195252-r365752871-Gran_Teatre_del_Liceu-Barcelona_Catalonia.html", "text": "When i saw the Gran Teatre del Liceu from the outside, I wasnt wowed by it, but I couldnt imagine, how is all the people gonna fit in. And inside its just magical, really beautiful and grande! I attended the concert of Ludovico Einaudi, which was really really beautiful. Seats were really comfortable and you have the metro just in front of it, which is great. Really comfortable for girls with high heels. Taxis are all around after concerts if you need :)", "publishedDate": "2016-04-20", "language": "en", "rating": 5}, {"id": 364082719, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d195252-r364082719-Gran_Teatre_del_Liceu-Barcelona_Catalonia.html", "text": "As far as i know the opera building was built as a theatre so it's difficult to see from the box seat located at each side of the scenario. However it's easy to find your place and there are many people helping there. It's advisable to visit if your stay enough and you fancy the opera.", "publishedDate": "2016-04-14", "language": "en", "rating": 4}, {"id": 361497956, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d195252-r361497956-Gran_Teatre_del_Liceu-Barcelona_Catalonia.html", "text": "We did the express tour which took 25 minutes. It turned out to be a private tour as no other visitors were there at the allotted time. Our guide was a charming young lady who explained everything in good English and gave us enough time to take photos of the very grand interior.", "publishedDate": "2016-04-04", "language": "en", "rating": 4}, {"id": 361359123, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d195252-r361359123-Gran_Teatre_del_Liceu-Barcelona_Catalonia.html", "text": "we took the one hour guided tour of the theatre.  It is beautiful.  I would love to return to see a performance.", "publishedDate": "2016-04-03", "language": "en", "rating": 4}, {"id": 359393506, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d195252-r359393506-Gran_Teatre_del_Liceu-Barcelona_Catalonia.html", "text": "They offer express tours every half an hour in English and Spanish for five euro. \nWorth it, beautiful building with an incredible history. \n", "publishedDate": "2016-03-28", "language": "en", "rating": 5}, {"id": 358930725, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d195252-r358930725-Gran_Teatre_del_Liceu-Barcelona_Catalonia.html", "text": "The auditorium was stunningly beautiful and the guide was very informative.  It is very easy to miss this gem on the Ramblas, but it is definitely worth a visit", "publishedDate": "2016-03-27", "language": "en", "rating": 4}, {"id": 355366097, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d195252-r355366097-Gran_Teatre_del_Liceu-Barcelona_Catalonia.html", "text": "We went to see a Johnny Hallyday rock concert here last week and were so impressed with the venue, the acoustics and the sheer beauty of this theater.  It was a most memorable evening.", "publishedDate": "2016-03-14", "language": "en", "rating": 5}, {"id": 353827253, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d195252-r353827253-Gran_Teatre_del_Liceu-Barcelona_Catalonia.html", "text": "This is a beautiful opera house.  It is on the Ramblas and has decor and acoustics to die for.  Compared to others, this is a very good value place to see good opera.  The house orchestra is very good and the performances are good enough to match many other venues around Europe. Just don't get the ornate brackets on the lights!", "publishedDate": "2016-03-08", "language": "en", "rating": 5}, {"id": 342728364, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d195252-r342728364-Gran_Teatre_del_Liceu-Barcelona_Catalonia.html", "text": "As a big fan of live theatre, the Liceu was on our list of attractions to see while in Barcelona this past December (2015).The only show during our visit was Lucia di Lammermoor, an opera with a plot indistinguishable from Romeo and Juliet. Even securing seats several months in advance, all of the reasonably priced tickets with full visibility were already filled, so we ended up settling on a pair of seats that were 40 euro each with 60% visibility. We arrived in Barcelona the same day of the show and had just enough time to drop our bags off at the hotel and change before heading to the popular La Rambla area where the theatre is located. We arrived early and got some time alone in the empty theatre to take in its extravagance and beauty. We were pleased to learn there were tiny monitors with an english translation of the opera to follow along with. Unfortunately, as soon as the lights went off, the 18-hour flight began to take its toll and I couldn't stay awake. I fought mightily against my heavy eyelids, but the opera was more than 3 hours long with intermission and I was being slowly defeated. Although my friend was enjoying the opera, we were both exhausted and decided to leave at intermission. We know how Romeo and Juliet ends so it wasn't an agonizing decision.", "publishedDate": "2016-01-25", "language": "en", "rating": 4}]}}]