[{"locationId": 244860, "name": "Mercat de les Flors", "placeType": "ATTRACTION", "reviewListPage": {"reviews": [{"id": 729790814, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d244860-r729790814-Mercat_de_les_Flors-Barcelona_Catalonia.html", "text": "Saw a performance from Societat Doctor Alonso here. Great theatre space and drinks. Very art focused. Wonderful place to see affordable and local performance art in Barcelona!", "publishedDate": "2019-11-30", "language": "en", "rating": 4}, {"id": 335414558, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d244860-r335414558-Mercat_de_les_Flors-Barcelona_Catalonia.html", "text": "I only had the plrssure to see it from outside. It is the theatre beside de Dance center. So nothing to do with a market..m", "publishedDate": "2015-12-28", "language": "en", "rating": 4}, {"id": 275321448, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d244860-r275321448-Mercat_de_les_Flors-Barcelona_Catalonia.html", "text": "A market frequented by the locals with none of the hype of the Boqueria in the Ramblas. The quality of the produce was excellent. Try to make a visit to the croquetas stall where you can buy flavours such as wild boar or ceps.", "publishedDate": "2015-05-28", "language": "en", "rating": 5}, {"id": 230904488, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d244860-r230904488-Mercat_de_les_Flors-Barcelona_Catalonia.html", "text": "If there is one place that you must go in Barcelona , this is it. The sheer abundance and high quality of the products that are offered here is mind boggling. Whole generations of people have \nplied their crafts in this market. It covers probably several square blocks and is very lively inside. It is a good spot to not only buy products such as Iberico hams, fruits, vegetables but all types of sweets, home goods, paper goods and other types. There are a number of small restaurants with different clientele cooking most of the products that are found in the market and some that are highly creative spots that offer great  values at less than 20% of what restaurants outside the market charge.  We always seem to buy way too much but that is becasue it is unbelievable to see. Make sure that if you want to bring it home the vendors vacuum pack items or else they may not clear customs.", "publishedDate": "2014-09-25", "language": "en", "rating": 5}, {"id": 142811727, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d244860-r142811727-Mercat_de_les_Flors-Barcelona_Catalonia.html", "text": "I like my theatre close and creative, thank you Mercat de les Flors for years of enjoyment.  backing onto the school of Theatre of Barcelona expect keen service.", "publishedDate": "2012-10-14", "language": "en", "rating": 5}, {"id": 65777371, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d244860-r65777371-Mercat_de_les_Flors-Barcelona_Catalonia.html", "text": "From the very first vendor with a huge cascade of perfect fruit, this place is a wonder for the eyes and nose and taste buds.  The most amazing was the mounds of mushrooms on one vendor's counters.  Go there hungry because there are places where you can sit and eat.", "publishedDate": "2010-05-29", "language": "en", "rating": 5}]}}]