[{"locationId": 2165013, "name": "Montjuic Castle", "placeType": "ATTRACTION", "reviewListPage": {"reviews": [{"id": 752539243, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d2165013-r752539243-Montjuic_Castle-Barcelona_Catalonia.html", "text": "It has nice views and surroundings, but do not eat at their cafe because we got food poisoned badly from their seafood paella. If you must eat, just eat their commercially-packaged foods! I recommend walking up as well, because we did not know and had to wait for the cable car. Walking is better exercise.", "publishedDate": "2020-04-12", "language": "en", "rating": 5}, {"id": 752358324, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d2165013-r752358324-Montjuic_Castle-Barcelona_Catalonia.html", "text": "We decided to take the walk up instead of taking the cable car or taxi. Tried after walk. Got to the castle at 5.35pm. Unfortauntely it was winter opening times and the castle closed at 5.30pm that day. So we couldn't get in. We walked around the castle to find a view of the setting sun, but it's hard to find any spot as the trees are too tall and blocks the view of the horizon. I guess all the views are reserved for people who actually go inside the castle  Eventually we did find one spot after walking around the whole castle where we could see the sunset. A few other people were also there at that spot as well. There is an admission fee to enter the castle (but as we didn't go in I don't recall the price). The surrounding area around the castle is free admission. We walked down a little from the castle and found a bus stop where there were some buses that went to downtown Barcelona area where we found a metro station. Would have rated the castle higher, but didn't go in", "publishedDate": "2020-04-07", "language": "en", "rating": 3}, {"id": 750383301, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d2165013-r750383301-Montjuic_Castle-Barcelona_Catalonia.html", "text": "Part of the castle was closed for our visit but this didn’t spoil our enjoyment. It was a nice walk from the Olympic Park and the views were spectacular. It was also free on the day of our visit. Worth spending an hour there. ", "publishedDate": "2020-03-10", "language": "en", "rating": 4}, {"id": 749642146, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d2165013-r749642146-Montjuic_Castle-Barcelona_Catalonia.html", "text": "We didn’t enter the castle but enjoyed the walk up from the centre of Barcelona. The walk is very scenic and has so many sights to see along the way. Worth the visit if in Barcelona.", "publishedDate": "2020-03-06", "language": "en", "rating": 5}, {"id": 749414109, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d2165013-r749414109-Montjuic_Castle-Barcelona_Catalonia.html", "text": "Very beautiful castle, great (and sad) history. We were lucky enough to go on a sunny day, enjoyed the amazing views of the port, sea, and Barcelona from all sides of the castle, would definitely recommend the visit. (we actually took the cable cars up and walked down through the gardens, lovely stroll. ", "publishedDate": "2020-03-05", "language": "en", "rating": 5}, {"id": 749057198, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d2165013-r749057198-Montjuic_Castle-Barcelona_Catalonia.html", "text": "We were here on the first Sunday of the month, which is a free day, but we still decided to do the 1-hour 11am English tour, which cost 4 euros each. Probably since it was a free day, we were the only people on the tour, so it was like a private tour. Except for the view, it probably would have been a disappointing experience, considering the effort it is to get here, if we hadn't done the tour. We are not Spanish history buffs, so the history of the castle was very interesting. The rooms that used to hold political prisoners were particularly interesting. The guide spent quite a bit of time going through some of the different stories that were drawn on the walls, which we found fascinating. Also, you only get to go up in the tower on the tour, which was a spectacular view!", "publishedDate": "2020-03-04", "language": "en", "rating": 5}, {"id": 748575711, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d2165013-r748575711-Montjuic_Castle-Barcelona_Catalonia.html", "text": "We went there since it’s free every first Sunday of the month. It is a nice place, with a long history, but would come back mostly for the views! Plenty of places where you can see the city and the sea.", "publishedDate": "2020-03-01", "language": "en", "rating": 4}, {"id": 748341843, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d2165013-r748341843-Montjuic_Castle-Barcelona_Catalonia.html", "text": "For a break from Barcelona city. Come here to enjoy some peaceful quiet and views of Barcelona.  TAke the metro to Parel Lel stop.  And take the funicular you hilltop to castle Montjuic. It’s 13 euros round trip but I hike and it’s a good 20 minute hike.  Enjoy views of Barcelona, the port and ships of Barcelona.  \nThe castle itself is plain.  Not much to see.  Just open grounds and garden. Good thing it’s only 5 euros. \n", "publishedDate": "2020-02-29", "language": "en", "rating": 3}, {"id": 747541180, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d2165013-r747541180-Montjuic_Castle-Barcelona_Catalonia.html", "text": "Before two Sundays, we decided to visit this place. It didn't worth it..We were there during the free hours of visiting, fortunately. Only the place in front of the castle is nice with beautiful gardens!", "publishedDate": "2020-02-25", "language": "en", "rating": 2}, {"id": 747348259, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d2165013-r747348259-Montjuic_Castle-Barcelona_Catalonia.html", "text": "The cable car ride was great and with the ticket price. Our kids enjoyed it a lot. The castle itself is just ok and there isn’t much signage to educate you on its history.", "publishedDate": "2020-02-24", "language": "en", "rating": 3}, {"id": 747088065, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d2165013-r747088065-Montjuic_Castle-Barcelona_Catalonia.html", "text": "It is up to you how you get there, there are so many options, but if you decide to walk up or down, bear in mind some steep slippery streets. You get a great view of the city and the sea. And what is really impressive is the number of planes landing at El Prat.", "publishedDate": "2020-02-23", "language": "en", "rating": 4}, {"id": 746662067, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d2165013-r746662067-Montjuic_Castle-Barcelona_Catalonia.html", "text": "This castle has amazing views of Barcelona and environs. The castle has a very interesting exhibition about its history and the locality. The cafe seves a good selection of freshly prepared food that you can enjoy in the courtyard. We used the cable car to arrive in style.", "publishedDate": "2020-02-22", "language": "en", "rating": 4}, {"id": 746588453, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d2165013-r746588453-Montjuic_Castle-Barcelona_Catalonia.html", "text": "Great place to visit, learn about the castle's history, enjoy the view of the city and the sun and have a coffee and snack at the cafe in the place!!!", "publishedDate": "2020-02-21", "language": "en", "rating": 5}, {"id": 745845475, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d2165013-r745845475-Montjuic_Castle-Barcelona_Catalonia.html", "text": "Montjuic castle\n€5 entry fee. Under 16 free. Do online and avoid a queue. Nice for an hours walk. Good views. Not a lot to see in the castle but many good viewing points. We got taxi up from city centre. €12. Would be a long walk. Cable car down €8.90 each for 10 mins but worth it for the ride. Funicular first last bit but we walked. For €5 place is worth a visit. Links to Spanish civil war and it is a very good historic sight where you can see for miles. Nice cafe in courtyard. ", "publishedDate": "2020-02-18", "language": "en", "rating": 4}, {"id": 745067904, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d2165013-r745067904-Montjuic_Castle-Barcelona_Catalonia.html", "text": "Montjuic Castle is a great place to escape the hustle and bustle of the city life below, even if just for a few hours.  We rode the cable car all the way up and while I wished the museum part had more information to explore, the breath taking views of all of Barcelona was amazing.", "publishedDate": "2020-02-14", "language": "en", "rating": 4}, {"id": 744581886, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d2165013-r744581886-Montjuic_Castle-Barcelona_Catalonia.html", "text": "A definite to visit! With the best views of Barcelona and it’s great history you’ve got to visit it.", "publishedDate": "2020-02-12", "language": "en", "rating": 5}, {"id": 742098506, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d2165013-r742098506-Montjuic_Castle-Barcelona_Catalonia.html", "text": "The best way of accessing the castle is via the metro to Paral-lel station then the funicular railway (the station for which is within the metro station complex) to Parc de Montjuïc station to connect with the cable cars to the castle. The day we visited was a very clear and warm day although a bit breezy in some of the exposed areas. We spent several hours in the castle taking photos of the views over the city, port with the airport in the distance. Although the castle has its history displayed as it was a warm and dry day, I found the best part of the visit the views which there were in pretty much every direction I looked. There’s a café in the castle where we had lunch (coffee & sandwiches) before completing our tour of the castle.", "publishedDate": "2020-01-30", "language": "en", "rating": 4}, {"id": 742092197, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d2165013-r742092197-Montjuic_Castle-Barcelona_Catalonia.html", "text": "In Barcelona you have everything. If you want to escape go to Mantjuic Castel. You can go by car, bus or cable car( as we did) and to enjoy the amazing view. You can walk near the castel. We did not enter in it, but next time for sure we will. Must go", "publishedDate": "2020-01-30", "language": "en", "rating": 5}, {"id": 741621133, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d2165013-r741621133-Montjuic_Castle-Barcelona_Catalonia.html", "text": "We took the cable car up to the top and made the short walk over to the Castle.  Incredible views of Barcelona.  Even if you have no intentions of touring the Castle, still go for the views!", "publishedDate": "2020-01-27", "language": "en", "rating": 4}, {"id": 738997475, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d2165013-r738997475-Montjuic_Castle-Barcelona_Catalonia.html", "text": "Not worth going to see. We did it but not happy about it. We saw the Olympic stadium and castle was not so great.", "publishedDate": "2020-01-13", "language": "en", "rating": 2}, {"id": 736602720, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d2165013-r736602720-Montjuic_Castle-Barcelona_Catalonia.html", "text": "If you are visiting the Montjuic Castle, there is  cafeteria-restaurant inside and it is the only possibility to eat and not a good one. Eat before you visit the castle, but somewhere else.\n\nThere were only about ten people on a waiting line to this cafeteria-restaurant but it took half an hour to order and then almost the same to get your food.\n\nFood (curry chicken) was almost cold, maybe the sauce had been in the micro wave oven? We ate, as we were hungry, but would not eat again. The curry portion costs about 11 euros.", "publishedDate": "2020-01-03", "language": "en", "rating": 2}, {"id": 735839541, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d2165013-r735839541-Montjuic_Castle-Barcelona_Catalonia.html", "text": "Took a bus to the top and walked back to arena shopping mall.\nA good historical place to visit. Nice views and a good opportunity to take pictures.\nCafe was extremely busy, had to wait for 30minutes in the line.", "publishedDate": "2019-12-31", "language": "en", "rating": 4}, {"id": 735572311, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d2165013-r735572311-Montjuic_Castle-Barcelona_Catalonia.html", "text": "It’s ok but not so good as it was projected. Yes if you are keen castle visitors than you can but be prepared for disappointment", "publishedDate": "2019-12-30", "language": "en", "rating": 3}, {"id": 734423569, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d2165013-r734423569-Montjuic_Castle-Barcelona_Catalonia.html", "text": "Location:South west of the city on the mountain. You can access via foot, bus (free with travel pass) or cable car (12E return for adults)\nPrice: Castle entry is cheap. Under 30s pay 3E, this gives you access to the castle grounds and view on top of it. \n\nThe cable car is closed on windy days so bare that in mind before you queue for hours (they won't tell you). It's a good view of the harbour/pier and city from the west but nothing spectacular. There are some old canons for children to play on too.", "publishedDate": "2019-12-24", "language": "en", "rating": 3}, {"id": 734225434, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d2165013-r734225434-Montjuic_Castle-Barcelona_Catalonia.html", "text": "Monjuic castle is the highest peak in Barcelona. Higher than La Sagrada Familia. There are many types of entrance tickets. The best choice is castle with botanical gardens. Must check it. ", "publishedDate": "2019-12-22", "language": "en", "rating": 5}, {"id": 731858940, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d2165013-r731858940-Montjuic_Castle-Barcelona_Catalonia.html", "text": "You can take cable car from in the near of metro station Paral Lel. You should look for Funicular Monjuic. If you use Barcelona City Pass there is option to have tocket fro this cable car included. Also you can walk trough beautiful gardens. The castle is nice but nit fascinating for not-fans of defence strategy etc. But still you can have nice walk there, enjoy amazing views. At the entrance visitors get a map with interesting information about castle. If you take excursion probably it will be more interesting but we went just with this map. It is also windy on top probably it can be a nice idea to take scarf or hat or jacket. ", "publishedDate": "2019-12-10", "language": "en", "rating": 4}, {"id": 731827102, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d2165013-r731827102-Montjuic_Castle-Barcelona_Catalonia.html", "text": "We had fun ridding the cable cars to get here. The view is spectacular, the castle is nice! I am glad we came!, but it would not be a must for me.", "publishedDate": "2019-12-10", "language": "en", "rating": 4}, {"id": 731756727, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d2165013-r731756727-Montjuic_Castle-Barcelona_Catalonia.html", "text": "We came here by funicular which are one of the best atracctions in Barcelona and spent about one hour walking among old historical walls.  Tickets are not expensive and it's worth for panorama of the city. ", "publishedDate": "2019-12-09", "language": "en", "rating": 4}, {"id": 731333643, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d2165013-r731333643-Montjuic_Castle-Barcelona_Catalonia.html", "text": "Yesterday was in this amazing place❤️😍😍\nThe view is absolutely perfect 😍😍\nYou can see the town and the sea from the castle.\nDefinitely recommended to visit", "publishedDate": "2019-12-08", "language": "en", "rating": 5}, {"id": 730885144, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d2165013-r730885144-Montjuic_Castle-Barcelona_Catalonia.html", "text": "I walked several thousand steps uphill to Montjuic Castle -- a healthy workout!  Having arrived, I enjoyed, but wasn't overwhelmed by, a self-guided stroll of the castle's defensive armaments.  The structure is functional but of little obvious architectural or aesthetic interest.  That said, the expansive views of city and seacoast were great! \n\nThe Castle's best feature was its very informative and interesting interpretative center. Please don't miss it!  The exhibits recount the Catalans' savage mistreatment at the hands of Mother Spain over multiple centuries, up to and including the sad era of General Franco's reign, and thereby shed light on ongoing contemporary efforts to obtain independence for Catalonia.  In addition, the center provides good information about the Castle's strategic importance as a defensive bulwark over the centuries.", "publishedDate": "2019-12-05", "language": "en", "rating": 4}, {"id": 730873897, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d2165013-r730873897-Montjuic_Castle-Barcelona_Catalonia.html", "text": "I find it unbelievable that this attraction only has 3700 reviews. It is an amazing piece of history that has incredible views that cover all of Barcelona to the ocean. It was one of my favorite attractions in Barcelona. It is also really large and you can spend hours exploring. You will not find a better panoramic view of Barcelona. It even has a cafe to grab a cup of coffee.", "publishedDate": "2019-12-05", "language": "en", "rating": 5}, {"id": 729857386, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d2165013-r729857386-Montjuic_Castle-Barcelona_Catalonia.html", "text": "To save time and energy, my husband and I took the cable car to reach Montjuic castle and we enjoyed the lovely views over Barcelona along the way. \n\nFortunately, when we arrived, there was no queue to enter the castle. We paid our €5 per person admission fee and explored the castle on our own following the map that we were given. The map focussed on the castle as a fortress with its bastions, watchtower, ramparts, and moats. The highlight for us was the 360 degree views from the terrace of the parade grounds. We were lucky to have visited on a clear sunny day. The views over the city and the Mediterranean Sea were impressive. These views were better than the views from outside of the castle and may have been worth the price of admission alone. \n\nThere is a little cafe with inside and outside seating which was a  handy place to stop for refreshments and a light snack. \n\nWhile we enjoyed our visit, there wasn’t too much to see of the castle itself. Perhaps it would have been better to have timed our visit so we could have taken the official guided tour to see more and learn more about the history and architecture of the castle. ", "publishedDate": "2019-11-30", "language": "en", "rating": 4}, {"id": 728870334, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d2165013-r728870334-Montjuic_Castle-Barcelona_Catalonia.html", "text": "If you are a history buff, this is for you, if you like interesting, different places, this is for you, if you just want to relax and have a nice view, this place is definitely for you.", "publishedDate": "2019-11-25", "language": "en", "rating": 5}, {"id": 728463651, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d2165013-r728463651-Montjuic_Castle-Barcelona_Catalonia.html", "text": "We took the HOHO bus and got off at this stop where we took the cable car up to see the castle/fort.  great views of Barcelona port.  we did not pay to go into fort as I've been there when it was a military museum.  we did get back on the HOHO bus and got off at the Aeri Cable car stop to take cable car down to port. cable car was crowded but views were very good.", "publishedDate": "2019-11-23", "language": "en", "rating": 4}, {"id": 728260920, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d2165013-r728260920-Montjuic_Castle-Barcelona_Catalonia.html", "text": "Castillo montjuic sits on the hills above Barcelona and provides some stunning views of the city.\nEntry was only 5 euros each ,which is a bargain for wandering around a beautiful spot.  \nThere is a cafe on site for refreshments, and some exhibitions about the history of the castle. \nGetting here from the city is relatively easy, take the parael funicular railway up to the cable car station and the it's a short 12 euro ride to the top", "publishedDate": "2019-11-22", "language": "en", "rating": 5}, {"id": 728249194, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d2165013-r728249194-Montjuic_Castle-Barcelona_Catalonia.html", "text": "The best panoramic city and ocean views but quite a jaunt uphill to get there. The cable car or bus would have helped. The bus is cheaper and you can ride it from the cable car station.", "publishedDate": "2019-11-22", "language": "en", "rating": 5}, {"id": 727487317, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d2165013-r727487317-Montjuic_Castle-Barcelona_Catalonia.html", "text": "definitely worth a visit, we went on a sunday and were lucky enough to get in for free as it was 3pm. Definitely take the cable car up, the views are amazing.", "publishedDate": "2019-11-19", "language": "en", "rating": 5}, {"id": 726659426, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d2165013-r726659426-Montjuic_Castle-Barcelona_Catalonia.html", "text": "Great views of Barcelona. Can’t believe how epic the view is. The restaurant here was great to have dessert and take in the scenery.", "publishedDate": "2019-11-15", "language": "en", "rating": 5}, {"id": 725225458, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d2165013-r725225458-Montjuic_Castle-Barcelona_Catalonia.html", "text": "The hike up the hill is very much worth it. The sweeping views from the castle top can not be beat. I would suggest going at sunset for a beautiful orange-tinged photo. ", "publishedDate": "2019-11-09", "language": "en", "rating": 5}, {"id": 725122343, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d2165013-r725122343-Montjuic_Castle-Barcelona_Catalonia.html", "text": "We decided the take the guided tour as it was inexpensive and that was a great choice. The guided tour includes areas of the fortress that are off limits like the top of the watch tower with beautiful views of Barcelona. In addition, you get to visit the dungeons that contains writings and art work from the prisoners and the very large cistern. ", "publishedDate": "2019-11-08", "language": "en", "rating": 5}, {"id": 723305470, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d2165013-r723305470-Montjuic_Castle-Barcelona_Catalonia.html", "text": "Definitely take the cable car up, it is worth the money as the view from the cable car is stunning. It is fun to walk back through different parks though on way down. ", "publishedDate": "2019-11-02", "language": "en", "rating": 4}, {"id": 723056993, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d2165013-r723056993-Montjuic_Castle-Barcelona_Catalonia.html", "text": "This was my second visit here and was just as good this time!\nThe views over the city and across to Tibidabo fantastic. It's a really, really interesting castle telling the history of the city. We chose to walk up which you have to be reasonably fit to do but it's a nice walk. ", "publishedDate": "2019-11-01", "language": "en", "rating": 5}, {"id": 722464869, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d2165013-r722464869-Montjuic_Castle-Barcelona_Catalonia.html", "text": "Worth the journey for the spectacular views of the city and the port. The highlight was a man singing who was dressed in leopard print 😂", "publishedDate": "2019-10-29", "language": "en", "rating": 4}, {"id": 721872118, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d2165013-r721872118-Montjuic_Castle-Barcelona_Catalonia.html", "text": "One can pay a fee to reach the entrance of the castle though gondola, or walk up from a close by parking lot. The castle allows you have a sneak peek of the military power at the time, and provide great views of the city and the port. In the castle, there are also exhibitions that provide more information on the history and development of the castle. At the time of our visit, there was also exhibition on Chinese art of war in one of the exhibition sections.", "publishedDate": "2019-10-27", "language": "en", "rating": 5}, {"id": 721779579, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d2165013-r721779579-Montjuic_Castle-Barcelona_Catalonia.html", "text": "Nice surprise to get in for free.  Otherwise 5 euro. Great views of the city and port.  Not a lot to see the in the castle but worth seeing if you made the trip to that area.  ", "publishedDate": "2019-10-27", "language": "en", "rating": 4}, {"id": 721512870, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d2165013-r721512870-Montjuic_Castle-Barcelona_Catalonia.html", "text": "The views from the castle tremendous.  You can see the ships on the meditteranean.  You can see the city, downtown, and great neighborhoods.", "publishedDate": "2019-10-26", "language": "en", "rating": 5}, {"id": 721486085, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d2165013-r721486085-Montjuic_Castle-Barcelona_Catalonia.html", "text": "We paid €12.70 to ride the funicular up to the castle , the view was amazing but the visit to the castle was not worth €5. \nNothing to see inside de caste , the view from above its not worth €5 neither. \nOn one side all you see it’s just the port of Barcelona , and from the other side the city. \nJust riding the funicular one way it’s fine , you’ll enjoy the view of the city and then you can walk down to take the bus or the Metro back to the city. ", "publishedDate": "2019-10-26", "language": "en", "rating": 2}, {"id": 720778385, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d2165013-r720778385-Montjuic_Castle-Barcelona_Catalonia.html", "text": "I took the Metro, funicular (ticket included in your Metro ticket), and bus (ticket not included) to Montjüic, including the castle and fort, which supplies panoramic views of the Port of Barcelona.  I decided to walk downhill to Plaça d’Espanya, truly a long walk when the weather is hot.  I passed several parks, the Olympic Stadium (which was empty but open for viewing), the Catalunyan Art and Cultural Museum, a lovely multitiered waterfall sculpture in front of the Museum, and eventually made it down into the plaza.  If you take this ride/walk, be prepared to spend up to three hours.  I walked 29000 steps total on the hot Barcelona day.", "publishedDate": "2019-10-23", "language": "en", "rating": 4}, {"id": 720737679, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d2165013-r720737679-Montjuic_Castle-Barcelona_Catalonia.html", "text": "Very cheap entry and well worth a visit for the incredible views and interesting walk through history. We didn’t opt for a guide but there was some information to read as you walk around. We enjoyed exploring the castle, but it would have been more fun if more of the ‘rooms’/‘chambers’ were open. The surrounding gardens/parks are well kept and beautiful, and you could spend many hours walking around, particularly if the weather is nice.", "publishedDate": "2019-10-23", "language": "en", "rating": 4}, {"id": 720164379, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d2165013-r720164379-Montjuic_Castle-Barcelona_Catalonia.html", "text": "We purchased a tour that included a English speaking guide and a trip through the dungeons and to the very top of tower. Beautiful views of the city. Was quite a hike up the several flights of stairs from the apartment we were staying in at the base of the mountain. There are other options though. Unfortunately the cable car was not operating because of a strike. We walked to the cable car location and then took a metro bus up to the tower. Took the bus back down to the same stop and walked back to our apartment. There is a lot to see on the mountain besides the castle itself. ", "publishedDate": "2019-10-21", "language": "en", "rating": 4}, {"id": 719829877, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d2165013-r719829877-Montjuic_Castle-Barcelona_Catalonia.html", "text": "This is a place from.where one can get beautiful views of the city of Barcelona. Well kept gardens and easy access define the place. Fitness friends can enjoy a jog around the castle. We saw a lot of dogs walking around as well. There is a cable car as well, but we preferred the bus.", "publishedDate": "2019-10-20", "language": "en", "rating": 4}, {"id": 719341183, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d2165013-r719341183-Montjuic_Castle-Barcelona_Catalonia.html", "text": "There is so much more that could be done to bring some kind of life to this castle with a bit of imagination!!  Maybe open the dungeons and add some kind of animation and perhaps charge a little more to the entrance fee. Yes it has great views but so has lots of other places in Barcelona. At the top there is nothing to get excited about apart from a few cannons, one covered in graffiti. ( a massive problem in Barcelona) At the bottom there are rooms with a visual running commentary, but nothing special. We left after 30 minutes somewhat disappointed.", "publishedDate": "2019-10-18", "language": "en", "rating": 2}, {"id": 718980239, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d2165013-r718980239-Montjuic_Castle-Barcelona_Catalonia.html", "text": "Was a great way to see the City...New and Old. To attaempt to imagine the history and defense of a city from a hilltop. See the Old and the True City from the top.", "publishedDate": "2019-10-16", "language": "en", "rating": 5}, {"id": 718921611, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d2165013-r718921611-Montjuic_Castle-Barcelona_Catalonia.html", "text": "We very much enjoyed our visit, our tour guide was excellent. We had a great day weather wise and I don't think it would be as enjoyable on a rainy cloudy day'", "publishedDate": "2019-10-16", "language": "en", "rating": 5}, {"id": 718408707, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d2165013-r718408707-Montjuic_Castle-Barcelona_Catalonia.html", "text": "went up via cable car well worth visiting you can walk around the castle  free but for a a couple of euro you can go through we enjoyed it and the most amazing vies", "publishedDate": "2019-10-14", "language": "en", "rating": 5}, {"id": 718143376, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d2165013-r718143376-Montjuic_Castle-Barcelona_Catalonia.html", "text": "Walked up to the cable car from the World Trade Centre. Steep in parts and a bit strenuous. Could take the metro - cheap. The castle is well kept and interesting but not a compelling visit. The views over the harbour are worth the effort. Entry is quite inexpensive and quite a nice cafe inside that is reasonably priced.", "publishedDate": "2019-10-13", "language": "en", "rating": 4}, {"id": 717948411, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d2165013-r717948411-Montjuic_Castle-Barcelona_Catalonia.html", "text": "Went to Montjeuc by cable car from the docks area and came down walking. Spent about 3 hours there. A long wait at the ticket counter for the cable car ticket but well worth it. It was a Sunday and the entry to the castle was free. Walked around and took lovely pictures of the castle, the moat which has beautiful gardens with colorful flowers, well maintained, went up to the terrace of the castle to see magnificent views of the city on one side and the ocean on the other. Then walked down a short distance to reach the bottom. The views on the way were breathtaking.", "publishedDate": "2019-10-13", "language": "en", "rating": 5}, {"id": 717779104, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d2165013-r717779104-Montjuic_Castle-Barcelona_Catalonia.html", "text": "Really enjoyed our trip up to the castle. Caught the venicular as part of our T10 ticket (so basically free). Then took the cable car one way (€8.40) to the top, from which there were great views. \nEnjoyed the castle (including historical video showing how the castle had been used) and gardens, but mostly the wonderful views of Barcelona. Also stopped for a glass of sangria at the courtyard café, before walking down the hill into the Montjuic area.", "publishedDate": "2019-10-12", "language": "en", "rating": 5}, {"id": 717348560, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d2165013-r717348560-Montjuic_Castle-Barcelona_Catalonia.html", "text": "Nice Castle located on top of a hill whith a spectacular view over the sea and the port and also on the city. I recommend taking the bus to get here, it's the easiest way to access it. \nEntry is not free but the price is pretty cheap and there is not much queue at the entry. \nDefinitely one of the must visit attractions while in Barcelona. ", "publishedDate": "2019-10-11", "language": "en", "rating": 5}, {"id": 717108850, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d2165013-r717108850-Montjuic_Castle-Barcelona_Catalonia.html", "text": "This castle was a fun trip our first day in Barcelona. We took the cable cars up the mountain (do this if you do not want to make the hike. the wait for tickets was not long and it was affordable). We walked around the castle grounds, which were fully of awesome areas to sit and just look around. The castle walls provided lovely views of the city. You can go into the top as well and see even more. This was a very enjoyable and quick stop for us. If you are carrying bags, they do provide lockers to store your things.", "publishedDate": "2019-10-10", "language": "en", "rating": 5}, {"id": 717083930, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d2165013-r717083930-Montjuic_Castle-Barcelona_Catalonia.html", "text": "Take the tour! Use a guide! This small investment made all of the difference. We saw what was hidden and learned much about the history of Barcelona! Worth the extra $. Our tour guide Jaon was the best!", "publishedDate": "2019-10-10", "language": "en", "rating": 5}, {"id": 716773661, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d2165013-r716773661-Montjuic_Castle-Barcelona_Catalonia.html", "text": "The old building was impressive and the history of the castle was very good explained inside the castle. The sight from the castle over the city is spectacular.", "publishedDate": "2019-10-09", "language": "en", "rating": 5}, {"id": 716020795, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d2165013-r716020795-Montjuic_Castle-Barcelona_Catalonia.html", "text": "We walked up to the cable car and took it to the top. We then walked around the outside of the castle walls for some fantastic views of Barcelona and the harbour areas. After this we went inside the castle for a self guided tour. There were not a lot of displays, but those that were there were eye opening in telling how the Catalon people have struggled for centuries to be an independent people.\nVery worthwhile visit, I highly recommend it.", "publishedDate": "2019-10-07", "language": "en", "rating": 5}, {"id": 715071819, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d2165013-r715071819-Montjuic_Castle-Barcelona_Catalonia.html", "text": "We did not go inside, as we went on a free day and it was too busy. The views are pretty good from here (there are still better spots in the city) and the castle makes for a nice photo spot. I do not think it's worth the pricey cable car up, instead take the walk and enjoy the various parks and views", "publishedDate": "2019-10-03", "language": "en", "rating": 4}, {"id": 714760152, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d2165013-r714760152-Montjuic_Castle-Barcelona_Catalonia.html", "text": "We went to the location mainly to use the cable car. And it had some terrific views. Entrance fee is less so it's ok. Great location. Get to see all the sides of Barcelona. ", "publishedDate": "2019-10-02", "language": "en", "rating": 4}, {"id": 714242557, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d2165013-r714242557-Montjuic_Castle-Barcelona_Catalonia.html", "text": "Great City views, this a must when visiting Barcelona, you can also take the cable on the way down, gardens are very well kept, and there is a great view of the Barcelona Port,   is a great place for pictures, kids had fun while visiting Monjuic.", "publishedDate": "2019-09-30", "language": "en", "rating": 5}, {"id": 713898228, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d2165013-r713898228-Montjuic_Castle-Barcelona_Catalonia.html", "text": "We bought our cable car tickets online. This underrated attraction has the best views of Barcelona. The castle/fort has a 10 minute movie that explains everything. Walk around for an hour and bring a good camera. ", "publishedDate": "2019-09-29", "language": "en", "rating": 5}, {"id": 713492248, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d2165013-r713492248-Montjuic_Castle-Barcelona_Catalonia.html", "text": "Well, maybe not the second best thing to do but behind going to the Sagrada Familia this place needs to be visited.   On a clear day, you can see all of this great city and miles into the Mediterranean ocean.   Take the cable car and walk down.", "publishedDate": "2019-09-27", "language": "en", "rating": 5}, {"id": 712910185, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d2165013-r712910185-Montjuic_Castle-Barcelona_Catalonia.html", "text": "Using the hop on/off bus we got off at organe stop number 7 just up from the cable car.\nHaving read how tuff the walk up to the castle was we decided to brave it and give it ago.\nIt is a bit steep but definitely manageable and you get to see the lovely gardens that lead up to it, plus you have €12 by not using the cable car.\nOnce at the entrance of the castle it is truly stunning to look at.\nWith large guns out the front and the formal gardens as you cross the bridge the side if the place really starts to hit you.\nOnce inside there are a number of different exhibitions as well as incredible views from all angels.\nMy partner when to the very top and said you could get a excellent view across all of the city.\nDefinitely worth a visit!!", "publishedDate": "2019-09-25", "language": "en", "rating": 5}, {"id": 708276183, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d2165013-r708276183-Montjuic_Castle-Barcelona_Catalonia.html", "text": "We were not sure what to expect after reading mixed reviews. We really enjoyed our visit. The cable car was pricey but the entrance fee to the castle was reasonable. The video at the start was informative as was the visitors information centre. The staff were helpful and friendly. The walk around and views were excellent. The cafe was reasonable and staff we’re polite and helpful. \nI recommend a trip up and ignore the negative reviews. We were impressed and enjoyed our couple of hours there. We walked down and this was not hard but it was hot. There were cafes on the way and more views over the city.", "publishedDate": "2019-09-09", "language": "en", "rating": 4}, {"id": 707782948, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d2165013-r707782948-Montjuic_Castle-Barcelona_Catalonia.html", "text": "We went up here in the afternoon. We caught the cable car up which was €12 each for a return trip. Entry was €5 each. The grounds were in good shape and the walk around was easy. The castle itself it’s not that interesting with not a great deal of rooms to look in, but you go here for the views. On a clear day they would be incredible. The day we went was a bit hazy, but still worth it, with plenty of photos taken. And from up here, you can see just how big Barcelona is. If we were to go back, I think I would take the cable car up, but then walk back down through the lovely gardens.", "publishedDate": "2019-09-08", "language": "en", "rating": 4}, {"id": 707290202, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d2165013-r707290202-Montjuic_Castle-Barcelona_Catalonia.html", "text": "Beautiful castle! The flowers were all taken care of. They definitely keep up the grounds well! Great views too!", "publishedDate": "2019-09-06", "language": "en", "rating": 4}, {"id": 705114419, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d2165013-r705114419-Montjuic_Castle-Barcelona_Catalonia.html", "text": "The castle is rather small and it does not have lot of exhibits. But it has amazing panoramic view of the city and the price is cheap! It is worth visiting!", "publishedDate": "2019-08-31", "language": "en", "rating": 4}, {"id": 704060471, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d2165013-r704060471-Montjuic_Castle-Barcelona_Catalonia.html", "text": "Amazing views of the City and sea but was very disappointed at how little we learned about the Castel itself.  There were only a handful of things to read and from which to learn unfortunately. ", "publishedDate": "2019-08-28", "language": "en", "rating": 3}, {"id": 703617501, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d2165013-r703617501-Montjuic_Castle-Barcelona_Catalonia.html", "text": "The castle is small and don't have lot of exhibits. But it has panoramic view of the city and the price is cheap so if you have time, visit it! ", "publishedDate": "2019-08-27", "language": "en", "rating": 3}, {"id": 702543591, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d2165013-r702543591-Montjuic_Castle-Barcelona_Catalonia.html", "text": "We went up with the cable cart. A short but nice ride. Booking in advance makes it 3 euros cheaper. The castle itself isn't that special, nor is the view on the city. Part is view on the harbour, very industrial. The entrance is 5 euro pp and that's all its worth. The cool and very friendly guide Anna was the main attraction 🙂", "publishedDate": "2019-08-24", "language": "en", "rating": 3}, {"id": 701464007, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d2165013-r701464007-Montjuic_Castle-Barcelona_Catalonia.html", "text": "Stunning location good history and information good and not too overpowering. Kids can roam freely. Combine with Funicular and Teleferic. No discount with Barcelona card but it is\nnot expensive to get in. Plenty more of space so if we had planned ahead better we would have taken a picnic. Good cafe not too pricy for Tapas and drinks etc.", "publishedDate": "2019-08-21", "language": "en", "rating": 5}, {"id": 700794706, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d2165013-r700794706-Montjuic_Castle-Barcelona_Catalonia.html", "text": "The views are stunning, located at the top of the hill. You can watch the city and locate the main attractions like Sagrada Familia, Parc Guell, Arenas mall and others.From the other side you will have a great view of the port, the beaches and the skyline merging with the sea.\nThere is a cafe inside and also public washrooms.\nWe took the public bus 150 from Arenas mall to Montjuic, then the cable car. But you can walk all the way up.", "publishedDate": "2019-08-19", "language": "en", "rating": 5}, {"id": 699492404, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d2165013-r699492404-Montjuic_Castle-Barcelona_Catalonia.html", "text": "Walked from the city to the Castle, great walk though steep in parts. But well worth it for the absolutely stunning views of  Barcelona and beyond. Also great view along the coast in both directions. Great value as well only 5 euro for entry and plenty of information boards throughout the castle to explain its history. The staff were also very helpful.", "publishedDate": "2019-08-16", "language": "en", "rating": 5}, {"id": 699015002, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d2165013-r699015002-Montjuic_Castle-Barcelona_Catalonia.html", "text": "It was a trek to walk from town, but we started our day up at the castle and had amazing views of the entire city. We were able to have lunch up there and then on the walk back to town stopped by the Olympic Arena and Magic Fountain.", "publishedDate": "2019-08-14", "language": "en", "rating": 5}, {"id": 698312667, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d2165013-r698312667-Montjuic_Castle-Barcelona_Catalonia.html", "text": "Our Barcelona, Spain adventure begins on Montjuic (Jew Mountain), which was a Jewish cemetery from 700-1492 CE. It now has a former military fortress from where people did not return under Franco, a Joan Miró Museum and 1992 Olympic groups. Beautiful city views.", "publishedDate": "2019-08-12", "language": "en", "rating": 4}, {"id": 697863906, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d2165013-r697863906-Montjuic_Castle-Barcelona_Catalonia.html", "text": "The castle is empty from inside you can just see a panoramic view all over Barcelona and the sea nothing special ", "publishedDate": "2019-08-11", "language": "en", "rating": 3}, {"id": 697671867, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d2165013-r697671867-Montjuic_Castle-Barcelona_Catalonia.html", "text": "This Castle is good for family and kids, and adults as well. This is one of the most sun-lit and bright castles in France. It is not so big you cannot cover the distance. Transport is convenient. There is bus and metro going there.  Then you take the lift going up to the castle. There is a mini café up the rooftop for you to grab a bite and some drinks. However, beware of pick-pockets when going up the lift as some guys posing as tourists will open the zippers of your backpacks as you squeeze into the lift.", "publishedDate": "2019-08-10", "language": "en", "rating": 3}, {"id": 697350130, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d2165013-r697350130-Montjuic_Castle-Barcelona_Catalonia.html", "text": "A adult is €5 to get in, seriously cannot complain at the price. The views are stunning, and others have said there isn’t a huge amount of exhibits but there is clearly a lot of history there.\n\nThere is a cafe, toilets and some lovely gardens.\n\nWould seriously recommend you get the underground to Para-Lel and then the funicular railway to Montjuic, then the cable car, unless you want to walk.\n\nIt should be noted that there is no additional fare, if you take the tube to Para-lel \n\n", "publishedDate": "2019-08-09", "language": "en", "rating": 5}, {"id": 697192107, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d2165013-r697192107-Montjuic_Castle-Barcelona_Catalonia.html", "text": "This is worth the 5€ just for the view from the top! I didn’t read any of the information displays, I was only interested in the 360 degree views, they are absolutely stunning. There is a place to grab a drink and a snack while you are there. I got there using the Montjuic cable car but noticed that others were getting there via taxi. It would be possible to walk back, but I wouldn’t fancy the walk there! ", "publishedDate": "2019-08-09", "language": "en", "rating": 4}, {"id": 697052163, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d2165013-r697052163-Montjuic_Castle-Barcelona_Catalonia.html", "text": "Visited Montjuïc Castle 18th July 2019 Parked up and continued up hill to the castle.\nWalked all the way around the grounds to take in the outstanding views.\nReturned to the car to find the rear quarter window smashed and all our cases and backpacks stolen. On further inspection various amounts of glass was evident suggesting that this is a regular occurance.\nThere are no CCTV cameras or warnings anywhere.\nI think the thieves park in the car park watching for tourists to leave their car.\nMy party of 5 adults were left with only the clothes we stood up in. Not a good ending to a nine day holiday.", "publishedDate": "2019-08-08", "language": "en", "rating": 1}, {"id": 696904423, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d2165013-r696904423-Montjuic_Castle-Barcelona_Catalonia.html", "text": "I thought it’d be interesting to come here but there wasn’t anything there of much historical interest.  The views are ok but I’ve seen better elsewhere in Barcelona.  It’s not worth the effort to come here.", "publishedDate": "2019-08-08", "language": "en", "rating": 3}, {"id": 696274266, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d2165013-r696274266-Montjuic_Castle-Barcelona_Catalonia.html", "text": "I love visiting historical landmarks and trying to imagine the activities that may have occurred. This landmark is just average, honestly not worth the hike up the hill to see it. Take the bus as far up as you can. Bring tons of water and be prepared to wait. ", "publishedDate": "2019-08-06", "language": "en", "rating": 3}, {"id": 696196878, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d2165013-r696196878-Montjuic_Castle-Barcelona_Catalonia.html", "text": "Take the cable car up. It is definitely worth the ride. The view of Barcelona is spectacular. The castle itself is so so, however the views are great. Take the walk back down so you don't miss the gardens. Have a dram of whiskey at the beverage stand.", "publishedDate": "2019-08-06", "language": "en", "rating": 5}, {"id": 695981263, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d2165013-r695981263-Montjuic_Castle-Barcelona_Catalonia.html", "text": "Easy place to get to, either public transportation or with the cable cars. \n\nThere's a guided tour provided, but you can go in on your own.", "publishedDate": "2019-08-06", "language": "en", "rating": 5}, {"id": 695895281, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d2165013-r695895281-Montjuic_Castle-Barcelona_Catalonia.html", "text": "If you want to enjoy the best views overlooking the city and surrounding area this is the place.  Take the metro as far as you can go and then either the bus (cheap) or funicular (expensive, some views) up to the castle.\n\nMake sure to allow at least an hour or more to wander around the top of the castle and enjoy the view.  Not much to see inside, but the view is totally worth it.  Nice little snack bar where you can grab a light lunch or beverage.", "publishedDate": "2019-08-05", "language": "en", "rating": 5}, {"id": 695466135, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d2165013-r695466135-Montjuic_Castle-Barcelona_Catalonia.html", "text": "A great place to get out of the city for a while.  The views are great of the whole city and the air fresh.  Get the cable car either up or down.", "publishedDate": "2019-08-04", "language": "en", "rating": 5}, {"id": 694933464, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d2165013-r694933464-Montjuic_Castle-Barcelona_Catalonia.html", "text": "Stumbled across this today after getting the cable car up. Fabulous views across the port and across the whole of Barcelona. Small entry fee to get in but worth a wander around. Cafe there and toilets too. Unexpected bit of history discovered here. ", "publishedDate": "2019-08-02", "language": "en", "rating": 5}, {"id": 694808004, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d2165013-r694808004-Montjuic_Castle-Barcelona_Catalonia.html", "text": "Montjuic Castle was great to see. Teens loved Fenucular. Be sure to walk down and enjoy a cold beverage or a snack.", "publishedDate": "2019-08-01", "language": "en", "rating": 5}, {"id": 693997648, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d2165013-r693997648-Montjuic_Castle-Barcelona_Catalonia.html", "text": "The view from the castle is amazing and the castle itself is really good. You can learn about its history and see how it is from inside. The only issue is on how you will get there. Apart from that, it worths a visit.", "publishedDate": "2019-07-30", "language": "en", "rating": 4}, {"id": 690787484, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d2165013-r690787484-Montjuic_Castle-Barcelona_Catalonia.html", "text": "Walked up in the late afternoon from the Parallel. The view on the city is amazing and the castle itself is quite impressive. I always wanted to visit it because of the history associated with it and finally got to do it. If you find the climbing too difficult there is a cable car and the option to go by car all the way up.", "publishedDate": "2019-07-18", "language": "en", "rating": 4}, {"id": 688452564, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d2165013-r688452564-Montjuic_Castle-Barcelona_Catalonia.html", "text": "If you plan to walk up there be prepared to sweat! It was about 600ft climb to walk up there but the views were amazing. It had some nice historical information but no need for more than a quick visit. We took the gondola down!", "publishedDate": "2019-07-10", "language": "en", "rating": 4}, {"id": 687369511, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d2165013-r687369511-Montjuic_Castle-Barcelona_Catalonia.html", "text": "The Castell de Montjuic is one of the focal points of Catalan history. Getting to the Castell is either by walking all the way up through Parc de Montjuic, via the local bus, or the Barcelona Bus Turistic. There is a very small entry fee (3 to 5 euros) per person, and they even have a cafe inside. Overall a great experience with amazing views of the port and the entire city.", "publishedDate": "2019-07-06", "language": "en", "rating": 5}, {"id": 686186719, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d2165013-r686186719-Montjuic_Castle-Barcelona_Catalonia.html", "text": "almost end of city,great view to port and see. good place for people they like fortification...not so far from Pl. Espanol", "publishedDate": "2019-07-02", "language": "en", "rating": 5}, {"id": 686172327, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d2165013-r686172327-Montjuic_Castle-Barcelona_Catalonia.html", "text": "Great place to see Barcelona from a high point.  Interesting walk up to the Castle. There is not that much to see around the castle but still it's worth coming to.", "publishedDate": "2019-07-02", "language": "en", "rating": 4}]}}]