[{"locationId": 8670722, "name": "Mercat de Sants", "placeType": "ATTRACTION", "reviewListPage": {"reviews": [{"id": 674589470, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d8670722-r674589470-Mercat_de_Sants-Barcelona_Catalonia.html", "text": "Mercat de Sants  is a nice market with a large variety of food. You can find all types of food, meat, fish, fruit and vegetables as well as other types. The prices are probably more suited to the locals, perhaps, as we found that they are a bit different from other similar markets we had visited. Still you can have something simple or not so simple to eat here or take away and you will feel quite satisfied.", "publishedDate": "2019-05-17", "language": "en", "rating": 4}, {"id": 624597208, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d8670722-r624597208-Mercat_de_Sants-Barcelona_Catalonia.html", "text": "Not the best market, but since I was staying in this area, went to check it out.not major selections, but able to find what I needed.and managed to get by with my small spanish\nspeaking.sad to see so may lovely folks not working, very political. folks are so sweet and helpful. enjoyed the experience.", "publishedDate": "2018-10-14", "language": "en", "rating": 4}, {"id": 557156972, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d8670722-r557156972-Mercat_de_Sants-Barcelona_Catalonia.html", "text": "The products here were slightly more than what you would get outside, but it's worth at least perusing the stand.  It's also not so pricey that I regretted indulging in an item or two.", "publishedDate": "2018-01-29", "language": "en", "rating": 5}, {"id": 435171691, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d8670722-r435171691-Mercat_de_Sants-Barcelona_Catalonia.html", "text": "This was a typical market that had a good array of products but did not stack up to some other markets such as Bouqueria.if you happen to be in the area which is out of the old town it is worth a visit.", "publishedDate": "2016-11-06", "language": "en", "rating": 3}, {"id": 419046271, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d8670722-r419046271-Mercat_de_Sants-Barcelona_Catalonia.html", "text": "Well worth finding this a small but lovely neighbourhood market in an unusual brick building. Fantastic food. We had a snack at the bar near the entrance which was good. There is another snack place in the centre of the market where we couldn't get a seat, suggests it may be even better. Very Catalan ", "publishedDate": "2016-09-16", "language": "en", "rating": 4}, {"id": 387490793, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d8670722-r387490793-Mercat_de_Sants-Barcelona_Catalonia.html", "text": "The food market is placed near sants station. in a nice and air conditioned building. the market contains shops of: fruits and vegetables, fresh  sorts of meat, pickled meat, fresh fish and sea food. It is a nice place to buy and enjoy food.", "publishedDate": "2016-06-29", "language": "en", "rating": 5}, {"id": 326680217, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d8670722-r326680217-Mercat_de_Sants-Barcelona_Catalonia.html", "text": "Nice building with brics outside. Inside is nice to see the roof and the building, petty that the majority is occupied by Mercadona. Good the free parking if you buy there. For 9 euro aoent 1 hour free, 18 euro then 2 houra free", "publishedDate": "2015-11-14", "language": "en", "rating": 3}, {"id": 323108928, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d8670722-r323108928-Mercat_de_Sants-Barcelona_Catalonia.html", "text": "When in Barcelona, we stay near Sants Estacio.  The hotel breakfast is pricey, so we head instead to the Sants train station for a bite to eat.  This cafe fills the bill with multigrain (\"cereal\") and chocolate croissants, palmeras (\"pig's ear\" pastry), and a full range of breakfast beverages.\n\nEat here and spend the difference on museum admission.", "publishedDate": "2015-10-30", "language": "en", "rating": 4}, {"id": 313315285, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d8670722-r313315285-Mercat_de_Sants-Barcelona_Catalonia.html", "text": "I have visited this market several times now and every time I go I have a great experience. You can find fresh fish, seafood, meats, vegetables, hams and cheeses from local farmers and typical of Catalonia and Spain.\n\nThere is a market shop, Arrom, that serves food. The food is prepared with fresh ingredients they sell at their shop and it is very tasty. \n\nThey have a \"menu del dia\" and you can have 3 platters and wine or beer for less than 12 euros. Great deal.\n\nIf you have enough time in Barcelona, you should visit this market.", "publishedDate": "2015-09-24", "language": "en", "rating": 5}]}}]