[{"locationId": 11930433, "name": "El Forjador", "placeType": "ATTRACTION", "reviewListPage": {"reviews": [{"id": 689874145, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d11930433-r689874145-El_Forjador-Barcelona_Catalonia.html", "text": "El Forjador or The Forger is a statue that adorns the extract to a fountain in the north west of Placa de Catalunya. As the title suggests, it’s a very Germanic interpretation of sculpture of a blacksmith. The smith is topless, showing his muscular physique in the Germanic fashion. He wears a pair of blacksmith trousers, which is partially covered by the top part of his smiths work cloths. In his right hand, he is holding a hammer which is also resting on the ground and in his left, he holds a chisel.\n\nI like the allegory to work, but I’m also not a fan of Germanic art, so I think it’s only okay.", "publishedDate": "2019-07-15", "language": "en", "rating": 3}, {"id": 676769479, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d11930433-r676769479-El_Forjador-Barcelona_Catalonia.html", "text": "El Forjador is one of numerous sculptures located around Plaza de Catalunya. It is a lovely statue of a Blacksmith, standing proud. The artwork was made in 1914 and even won an award at the 1914 International Exhibition of Art in Brussels, Belgium. It was placed at the Plaza in 1928. The blacksmith is wearing his blacksmith's apron and is holding a chisel and a hammer.", "publishedDate": "2019-05-27", "language": "en", "rating": 5}, {"id": 630487135, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d11930433-r630487135-El_Forjador-Barcelona_Catalonia.html", "text": "In Plaça De Catalunya there are loads of statues in this magnificent plaza and El Forjador is one of the most eye catching. \nEl Forjador ( The Blacksmith  ) is a really well detailed statue and makes for some great photographic opportunities .\nSculpured in 1914 by Josep Llimona, it's been on this current location since 1928 \nEasy to locate on Plaça De Catalunya and most definitely well worth seeking out if your in the area if only for that all important selfie. ", "publishedDate": "2018-11-03", "language": "en", "rating": 5}, {"id": 529943348, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d11930433-r529943348-El_Forjador-Barcelona_Catalonia.html", "text": "Saw this during the day and at night when the fountains are lighted up.\nI recommend both.\nThis is a good stop on your way to Las Ramblas", "publishedDate": "2017-10-04", "language": "en", "rating": 4}, {"id": 452687858, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d11930433-r452687858-El_Forjador-Barcelona_Catalonia.html", "text": "The big beautiful square, Plaza de Cataluna, has many sculptures.\nEl Forjador is one of them.\nForjador means: Blacksmith.\nThe Sculpture shows a muscular man with smith-tools.\nEl Forjador is made by Josep Llimona in 1914.\nIn 1928 El Forjador was placed on the current position on the north part of Plaza de Cataluna.", "publishedDate": "2017-01-17", "language": "en", "rating": 3}]}}]