[{"locationId": 9764670, "name": "Miraestels", "placeType": "ATTRACTION", "reviewListPage": {"reviews": [{"id": 635427174, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d9764670-r635427174-Miraestels-Barcelona_Catalonia.html", "text": "Nice way to reuse some old buoys. Sculptures were placed on top of the buoys, depicting a man watching the stars. \nThey can be seen while walking over the wooden walkway toward Maremagnum shopping center. Some benches are available to sit and enjoy the view.", "publishedDate": "2018-11-24", "language": "en", "rating": 4}, {"id": 629574918, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d9764670-r629574918-Miraestels-Barcelona_Catalonia.html", "text": "Fabulous piece of public art in the harbour. Two silent figures in white staring at the stars. Had to look up what it meant but looks great", "publishedDate": "2018-10-30", "language": "en", "rating": 4}, {"id": 563761384, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d9764670-r563761384-Miraestels-Barcelona_Catalonia.html", "text": "These are formerly buoys used for ships that moored in the area but now that this area is only used for huge ferries that go to other countries, another use has been made of these former buoys. \n\nThere is a sculpture of a man atop each buoy and as the water moves and bobs around so do the men (see pics).  They are quite large - very noticeable and there are some bench seats located opposite them so you can sit and enjoy it.  The area they are located is a very busy location, a gorgeous modern bridge takes you to these buoys (see pic) and at the end of the bridge you'll find the Maremagnum shopping centre.", "publishedDate": "2018-03-02", "language": "en", "rating": 4}, {"id": 563382784, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d9764670-r563382784-Miraestels-Barcelona_Catalonia.html", "text": "I really liked these 2 buoys, so different and worth seeking out.  They are huge buoys formerly used for mooring boats, now given a modern twist with sculpture of a man on them.\n\nAs they bob around in the water the men turn and twirl, either way it's interesting and different.  There area bench seats opposite each buoy inviting you to sit and enjoy.", "publishedDate": "2018-02-28", "language": "en", "rating": 4}, {"id": 491328037, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d9764670-r491328037-Miraestels-Barcelona_Catalonia.html", "text": "These stark white statues are floating in the marina and look lovely in the sunlight. There are also several in the Maratime Museum on display. They are about 2 mtrs high in the water but the museum has them in several sizes, right down to souvenir size in their gift shop.", "publishedDate": "2017-06-07", "language": "en", "rating": 5}, {"id": 385929835, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d9764670-r385929835-Miraestels-Barcelona_Catalonia.html", "text": "floating in the harbor are- these artistic things are quite charming to observe. makes for a nice photo.", "publishedDate": "2016-06-25", "language": "en", "rating": 4}]}}]