[{"locationId": 10459206, "name": "ArticketBCN: Barcelona Museum Pass", "placeType": "ATTRACTION", "reviewListPage": {"reviews": [{"id": 727579334, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d10459206-r727579334-ArticketBCN_Barcelona_Museum_Pass-Barcelona_Catalonia.html", "text": "Got this art passport which gave me access to 6 main museums for a mere €35, not only is this a significant discount but you also do I get to skip the lines! Passport can be bought at main office or any of the participating museums: Picasso Museum, National Museum of Art in Catalunya, Foundation Juan Miró, CCCD and MACBA. Some museums even allow several entrances and passport is good for a year!", "publishedDate": "2019-11-19", "language": "en", "rating": 5}, {"id": 724129409, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d10459206-r724129409-ArticketBCN_Barcelona_Museum_Pass-Barcelona_Catalonia.html", "text": "Used the Articket at 3 museums.  Compared to the list price to get into the museums, you might save a little, or if you go to all 6 it might work out to your advantage.  If you take the Hop On Hop Off Bus, you get a discount booklet that gets you 20% off most, if not all, of the museums on the Articket.  That negates the Articket savings.  It might help at the Picasso Museum, if there is a line for tickets.  There was not when I went. The other places had no lines.  The \"passport\" makes a cute souvenir.", "publishedDate": "2019-11-05", "language": "en", "rating": 3}, {"id": 603009324, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d10459206-r603009324-ArticketBCN_Barcelona_Museum_Pass-Barcelona_Catalonia.html", "text": "We were on free admission day (by coincidence) in Picasso museum, and still we were printed full admission. So we basically paid full price on free admission day without any warning.  Museum was more than full of peoples on that day, of course. Be wary of that. And now, to go on normal day we will have to pay full price, which is more than 50% of art pass price.\n\nIf the service will be that unfriendly in other museum, I wouldn’t recommend artpass to anyone. ", "publishedDate": "2018-08-05", "language": "en", "rating": 2}, {"id": 602201647, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d10459206-r602201647-ArticketBCN_Barcelona_Museum_Pass-Barcelona_Catalonia.html", "text": "I highly recommend advance purchase of the Articket Barcelona. If you see just three of the six museums, you will save money on entrance fees. More importantly, you do not have to pick a date and time to enter a museum and you bypass the lines. Could this be any smarter?", "publishedDate": "2018-08-02", "language": "en", "rating": 5}, {"id": 584766121, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d10459206-r584766121-ArticketBCN_Barcelona_Museum_Pass-Barcelona_Catalonia.html", "text": "Just wondering if I post here if anyone knows -- I'd like to get an ARTicket -- it seems worth it for the Picasso, Joan Miro and Catalan Art Museums which I'm planning to visit in August when we go.-- but will I have to line up for a  \"free\" ticket for my 15 year old to the Picasso museum or will we be expedited through the ARTicket line?", "publishedDate": "2018-06-03", "language": "en", "rating": 5}, {"id": 582700559, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d10459206-r582700559-ArticketBCN_Barcelona_Museum_Pass-Barcelona_Catalonia.html", "text": "We knew about the articket and tried several times to purchase two passes before we left for Barcelona, but were unable to get the website to work even on three devices.  When we arrived at the Placa de Catalunya, we saw the kiosk and purchased our passes right away.  They were a fantastic buy even though we didn't have time to see every one of the museums.  Strongly recommend the articket if you plan to see even three of the sites.  Hopefully, website issues can be resolved so that more of those interested are able to purchase the passes.", "publishedDate": "2018-05-25", "language": "en", "rating": 5}, {"id": 578072941, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d10459206-r578072941-ArticketBCN_Barcelona_Museum_Pass-Barcelona_Catalonia.html", "text": "Unless you are REALLY into super modern/contemporary art than this ticket isn’t worth it.\nI love art but I would have rather spent my money at different locations.\nPicasso and Catalunya galleries were brilliant. But CCCB, MACBA and Antoni Tapies were a waste of my limited time (and they’re very small galleries too).\nI suggest buying separate tickets so you don’t feel obligated to go to all the galleries like I did!", "publishedDate": "2018-05-05", "language": "en", "rating": 2}, {"id": 568498673, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d10459206-r568498673-ArticketBCN_Barcelona_Museum_Pass-Barcelona_Catalonia.html", "text": "with this tickets we visited different museums very easy and cheaper than buying separated tickets, you save time and money", "publishedDate": "2018-03-24", "language": "en", "rating": 4}, {"id": 477772456, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d10459206-r477772456-ArticketBCN_Barcelona_Museum_Pass-Barcelona_Catalonia.html", "text": "problems with the website, malfunctioned and \ncharged me twice for our tickets and cant get anyone on the phone or email to respond", "publishedDate": "2017-04-21", "language": "en", "rating": 2}, {"id": 453982900, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d10459206-r453982900-ArticketBCN_Barcelona_Museum_Pass-Barcelona_Catalonia.html", "text": "We only visited 4 of the 6 museums, but it was still worth the money.  In addition, the fact that we could skip the line made this worth it, as we skipped a huge line at the Picasso Museum.  If you like mementos, you get a cute red passport which is stamped at each museum.", "publishedDate": "2017-01-22", "language": "en", "rating": 5}, {"id": 439064164, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d10459206-r439064164-ArticketBCN_Barcelona_Museum_Pass-Barcelona_Catalonia.html", "text": "We purchased the Articket on line, and we were really glad we did.  With this ticket to 8 sights, you avoid the lines, and there is considerable savings.  If you go to at least 3 of the 8, you will save money and time.  Check this out on line.  With the Picasso Museum, for instance, you might avoid a 2 hour line.  We visited 5 out of 8.", "publishedDate": "2016-11-21", "language": "en", "rating": 5}, {"id": 436841517, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d10459206-r436841517-ArticketBCN_Barcelona_Museum_Pass-Barcelona_Catalonia.html", "text": "Saves money if visiting 3 or more museums. Check to be sure the ones you want are included.  Best of all we skipped long lines at Picasso, Miro, and Catalunya", "publishedDate": "2016-11-13", "language": "en", "rating": 5}, {"id": 435114785, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d10459206-r435114785-ArticketBCN_Barcelona_Museum_Pass-Barcelona_Catalonia.html", "text": "Amazing with tickets to 6 museum on this pass.\nOne entry each.\nAbsolutely recommendeble\nEUR 30.\nBuy online", "publishedDate": "2016-11-06", "language": "en", "rating": 5}, {"id": 430409595, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d10459206-r430409595-ArticketBCN_Barcelona_Museum_Pass-Barcelona_Catalonia.html", "text": "The price is excellent you save almost 50% of the cost and no lines (a lot of time). Bottom line you take it, if you have the time or want to visit MACBA, Picasso, Miro and MNAC. Apart from those, we relly enjoyed the exhibition at the CCCB. ", "publishedDate": "2016-10-21", "language": "en", "rating": 5}, {"id": 387823748, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d10459206-r387823748-ArticketBCN_Barcelona_Museum_Pass-Barcelona_Catalonia.html", "text": "We bought Articket passport and use it in 4 different art museums out of the 6 included. So far it was a good value than paying the full fare in every museum. Besides you have a fast track, so we didn't have to queue (especially at Picasso Museum where are eternal lines). I strongly recommend it.", "publishedDate": "2016-06-30", "language": "en", "rating": 5}, {"id": 387404769, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d10459206-r387404769-ArticketBCN_Barcelona_Museum_Pass-Barcelona_Catalonia.html", "text": "The Articket BCN or Art Passport is one of the best deals you can get for a longer stay in Barcelona. There are six museums included for half price on the passport. They are: Museu Picasso, Fundacio aAntoni Tapies, CCCB (B.arcelona Centre for Contemporary Culture), MACBA (Contemporary Art Museum of Barcelona),Fundacio Joan Miro, Museu Nacional D'Art de Catalunya.\n\nWe devoted at least two hours minimum for a visit and in most cases only experienced part of the exhibition of art. Some have audio guides, usually worth taking unless you are already familiar with the artist or work on exhibit. Picasso and Miro are single artist exhibits. The Art of Catalunya is a history of Catalan artists and for those going to any of the Gaudi sites would be useful for understanding context and seeing works by his contemporaries like Jujol, for example, who did work at Park Guell. The Contemporary galleries may not be focusing on Spanish art at all but worth the visit as they will be exhibiting significant work in any event. At the CCCB for example, we saw a show called Making Africa and at MACBA we saw the Andrea Fraser exhibit. \n\nIf you are at all interested in art Catalonia has some of the greatest in its list of names and this is the way to experience them.", "publishedDate": "2016-06-29", "language": "en", "rating": 5}]}}]