[{"locationId": 2449596, "name": "Monasterio de Sant Pere de les Puel.les", "placeType": "ATTRACTION", "reviewListPage": {"reviews": [{"id": 745883319, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d2449596-r745883319-Monasterio_de_Sant_Pere_de_les_Puel_les-Barcelona_Catalonia.html", "text": "Located in the Born district in an area where all the streets have in the name \"Sant Pere\" and something more ...\nLook for Sant Pere Square on the map and you will find it there.\nOld and architecturally interesting, it's really worth seeing.\nMajka and Ryszard from Poland\n\nPołożony w dzielnicy Born w okolicy gdzie wszystkie uliczki mają w nazwie \"Sant Pere\" i coś tam więcej ...\nPoszukaj na mapie placu Sant Pere i tam go znajdziesz.\nStary i ciekawy architektonicznie, naprawdę warto zobaczyć.\nMajka i Ryszard z Polski", "publishedDate": "2020-02-18", "language": "en", "rating": 4}, {"id": 672724890, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d2449596-r672724890-Monasterio_de_Sant_Pere_de_les_Puel_les-Barcelona_Catalonia.html", "text": "This Barcelona's first convent of Benedictine nuns is located next to the Placa de Sant Pere. The monastery dates back to 945 AD.\n\nVery little remains of the original building. All that remains of the original monastery is a heavily restored Romanesque church.", "publishedDate": "2019-05-09", "language": "en", "rating": 4}, {"id": 628828266, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d2449596-r628828266-Monasterio_de_Sant_Pere_de_les_Puel_les-Barcelona_Catalonia.html", "text": "Monasterio De Sant Pere De Les Puelles is a beautiful monastery located just off one of Barcelona's most evocative plaza's, namely Plaça De Sant Pere Mes Alt, a great area to just walk around and take in the great Barcelonian nightlife vibe.\nConstructed by 945 AD it's a great looking building that has some serious history attached to it, it's survived wars and fires,only one of the original bell towers is still standing but it still looks awesome and makes for some great photographic opportunities. \nEasy to locate on Carrer De Lluis Piados and most definitely well worth checking out if your in the area. \n\n", "publishedDate": "2018-10-27", "language": "en", "rating": 5}, {"id": 588135039, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d2449596-r588135039-Monasterio_de_Sant_Pere_de_les_Puel_les-Barcelona_Catalonia.html", "text": "Spent 2 hours going from one Catholic church to another on a Saturday afternoon, looking for a vigil Mass.  Finally, the 4th one was operating as a church, by offering Mass, instead of operating as a business, by selling admission tickets.  Went to a nice Mass in Catalan at 17:00 Saturday evening.", "publishedDate": "2018-06-17", "language": "en", "rating": 5}, {"id": 525728592, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d2449596-r525728592-Monasterio_de_Sant_Pere_de_les_Puel_les-Barcelona_Catalonia.html", "text": "This is not a review of the nearby monastery, but of the church situated on the Placa de St Pere. The church is one of the oldest in Barcelona (dating back to 1147). Do not miss the posters along the walls highlightening many historical events during 2000 years.", "publishedDate": "2017-09-19", "language": "en", "rating": 4}, {"id": 470390024, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d2449596-r470390024-Monasterio_de_Sant_Pere_de_les_Puel_les-Barcelona_Catalonia.html", "text": "We were trying to get off the beaten path and stumbled upon this square.  We were just regrouping from walking all day.  I noticed the Church and looked closer at it.   I noticed that it had a winged cow on the side of the building.  I don't think I have ever seen a winged cow.  I looked for a winged pig --well.....just for the heck of it.  I couldn't find one.\n\nWe didn't go in the building.\n\nI am curious why this cross in a circle is on this building.  I attached a pic of it.\n\nIf anybody knows please contact me.\n\nthanks\n\nvisited \nMarch 2017", "publishedDate": "2017-03-26", "language": "en", "rating": 5}, {"id": 285119004, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d2449596-r285119004-Monasterio_de_Sant_Pere_de_les_Puel_les-Barcelona_Catalonia.html", "text": "Sant Pere de les Puelles is a Benedictine monastery in the Sant Pere, Santa Caterina i la Ribera neighbourhood of Barcelona.  Built in the Romanesque-Gothic style.   A nice place to visit, in a quieter part of Barcelona.  There's a small cafe outside the monastery, and a little square with tall shady trees, and a beautiful antique water fountain, that one can still drink from.", "publishedDate": "2015-07-02", "language": "en", "rating": 5}, {"id": 259638148, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d2449596-r259638148-Monasterio_de_Sant_Pere_de_les_Puel_les-Barcelona_Catalonia.html", "text": "The Eglesia de Sant Pere des les Puelles is a lovely church in Barcelona. A quiet, less touristy church set in a nice simple square, this is a church that is well recommended for a visit.", "publishedDate": "2015-03-15", "language": "en", "rating": 4}, {"id": 239510009, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d2449596-r239510009-Monasterio_de_Sant_Pere_de_les_Puel_les-Barcelona_Catalonia.html", "text": "If you like visiting churches this ones deserves a visit to be different form most of the gothic ones you can find in Barcelona. But what I like is to have a break in its peaceful and gorgeous square.", "publishedDate": "2014-11-12", "language": "en", "rating": 4}]}}]