[{"locationId": 2015831, "name": "Mercat Santa Caterina", "placeType": "ATTRACTION", "reviewListPage": {"reviews": [{"id": 749330389, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d2015831-r749330389-Mercat_Santa_Caterina-Barcelona_Catalonia.html", "text": "Love this Mercat, not as large as La Boqueria on la rambles but has everything you need. Colorful vegetables, great cheeses and olives and you can find a wonderful selection of jamon.\nAlso, great neighborhood and the restaurants outside use food from the mercat.", "publishedDate": "2020-03-05", "language": "en", "rating": 5}, {"id": 746511999, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d2015831-r746511999-Mercat_Santa_Caterina-Barcelona_Catalonia.html", "text": "Don’t get me wrong much more hygienic than la Boqueria but sorry for me just didn’t have the atmosphere ", "publishedDate": "2020-02-21", "language": "en", "rating": 3}, {"id": 746336170, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d2015831-r746336170-Mercat_Santa_Caterina-Barcelona_Catalonia.html", "text": "DAVID: Best meat shop. To me, probably (I dont know that many, yes) the greatest meat shop in Barcelona: superb meats, highly friendly service. Visit with a local to experience how David treats customers.", "publishedDate": "2020-02-20", "language": "en", "rating": 5}, {"id": 745237526, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d2015831-r745237526-Mercat_Santa_Caterina-Barcelona_Catalonia.html", "text": "We visit the Caterina Market whenever we're in Barcelona. It's much nicer than La Boqueria and much much less crowded. It's very clean and well organized and the prices are very good.", "publishedDate": "2020-02-15", "language": "en", "rating": 5}, {"id": 736762158, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d2015831-r736762158-Mercat_Santa_Caterina-Barcelona_Catalonia.html", "text": "Great local market with associated restaurants. We had a fantastic lunch here so nice. Lots of local produce and meats.", "publishedDate": "2020-01-04", "language": "en", "rating": 5}, {"id": 734798310, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d2015831-r734798310-Mercat_Santa_Caterina-Barcelona_Catalonia.html", "text": "We love food markets and try to visit one whenever we travel. This one is in a charming area of Palma and even though its compact the selection was impressive. Fresh fruit, vegetables, meat, fish, cheeses, baked goods, and great florists\nIt was really busy as it was Christmas Eve and we couldn’t try out any of the food stalls but hope to return another day\nWe did get a beautiful xmas ornament as a lovely reminder of our visit", "publishedDate": "2019-12-26", "language": "en", "rating": 4}, {"id": 729519435, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d2015831-r729519435-Mercat_Santa_Caterina-Barcelona_Catalonia.html", "text": "Nice local market where you can pick up cheese, jamon, and olive oil for good prices. There are even restaurant/bars to sit down and have tapas, a meal or drinks.", "publishedDate": "2019-11-28", "language": "en", "rating": 4}, {"id": 728845122, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d2015831-r728845122-Mercat_Santa_Caterina-Barcelona_Catalonia.html", "text": "This is a nice clean and neat market with modern design, but we were disappointed when we saw it. You can’t admire the mosaic on the roof from the ground and the market is so empty and with no cool vibe to it. While Santa Caterina may be good and convenient for locals, in my opinion only La Boqueria market is really worth the visit for tourists. There is that special vibe and exciting atmosphere. ", "publishedDate": "2019-11-25", "language": "en", "rating": 3}, {"id": 726575037, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d2015831-r726575037-Mercat_Santa_Caterina-Barcelona_Catalonia.html", "text": "Santa Catrina Market is a “local” market.  We visited on a food tour and sampled hams, cheeses and olive oil.  As it turns out each neighborhood tends to have it’s own market; most of them a little less crowded than the Boqueria market on the Ramblas.  This market was wonderful.  It was spacious and airy.  We weren’t jostled or cramped and we were able to spend time in front of many of the stalls that interested us.  Olisoliva Com is the olive oil store in the market.  It was pretty busy and certainly popular.  We sampled four different oils, and they explained the significance and difference of each oil. We love visiting markets, and this one was totally a plus!\n", "publishedDate": "2019-11-15", "language": "en", "rating": 5}, {"id": 720967777, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d2015831-r720967777-Mercat_Santa_Caterina-Barcelona_Catalonia.html", "text": "This is the market where locals shop, and prices are considerably lower than at Boqueria. Plenty of produce, best and seafood, a few restaurants, no flowers", "publishedDate": "2019-10-24", "language": "en", "rating": 5}, {"id": 718678114, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d2015831-r718678114-Mercat_Santa_Caterina-Barcelona_Catalonia.html", "text": "This market is conveniently located in the city area quite near to the Cathedral De Barcelona.\nThere is a variety of fresh produce sold in the morning - fish, meats, sausages, ham, fruits, vegetables etc. You can even have an economical breakfast or brunch in the market.", "publishedDate": "2019-10-15", "language": "en", "rating": 4}, {"id": 718008802, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d2015831-r718008802-Mercat_Santa_Caterina-Barcelona_Catalonia.html", "text": "We went tot this market and were very disappointed.  It said it was open all day, but while open most of vendors had left.  Very limited produce.  Maybe they reopen in the evening but they sure were not open at 3:00 PM!", "publishedDate": "2019-10-13", "language": "en", "rating": 3}, {"id": 716231824, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d2015831-r716231824-Mercat_Santa_Caterina-Barcelona_Catalonia.html", "text": "All different meat cuts available under one roof. Its not much of a touristy place  thus you can troll quitely without  the hustle bustle", "publishedDate": "2019-10-08", "language": "en", "rating": 4}, {"id": 715756511, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d2015831-r715756511-Mercat_Santa_Caterina-Barcelona_Catalonia.html", "text": "Vibrant food market used by locals and tourists located next to the Barcelona Edition Hotel.  The market has something for everyone: butchered meats, fresh fish, produce, cheese, nuts, treats, wine, restaurants, etc.\n\n We wandered through the market to check it out one afternoon.  We bought a nice bottle of wine for 5E and several pieces of fruit.\n\nOn another day we came back for dinner at the Cuines Santa Caterina at their inside restaurant.  Days later we came back to Cuines Santa Caterina for breakfast at their outdoor seating restaurant.", "publishedDate": "2019-10-06", "language": "en", "rating": 4}, {"id": 713704558, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d2015831-r713704558-Mercat_Santa_Caterina-Barcelona_Catalonia.html", "text": "We visited three markets in the city and this was my favourite, even moreso than La Boqueria. While Boqueria is cram packed with tourists and pretty stalls, Santa Caterina has the same fresh produce at a cheaper price and with my more space to move around and see it all. This feels more like a real market and less of a tourist attraction", "publishedDate": "2019-09-28", "language": "en", "rating": 5}, {"id": 711379403, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d2015831-r711379403-Mercat_Santa_Caterina-Barcelona_Catalonia.html", "text": "Food and ambiance much nicer than Boqueria. Less crowded so less stressful. Can relax and enjoy walking around taking in the experience without feeling part of a herd.", "publishedDate": "2019-09-20", "language": "en", "rating": 4}, {"id": 709424685, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d2015831-r709424685-Mercat_Santa_Caterina-Barcelona_Catalonia.html", "text": "We LOVED the cones of cut offs of manchego cheese  or various jamons all for 2euros each. So yummy! There is an archaeological dig of the site. ", "publishedDate": "2019-09-13", "language": "en", "rating": 5}, {"id": 704642869, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d2015831-r704642869-Mercat_Santa_Caterina-Barcelona_Catalonia.html", "text": "Lots of fresh meat, seafood, vegetables etc... and attached lunch restaurant was very busy too. Good spot for lunch.", "publishedDate": "2019-08-30", "language": "en", "rating": 5}, {"id": 704598056, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d2015831-r704598056-Mercat_Santa_Caterina-Barcelona_Catalonia.html", "text": "A lovely market. Much smaller, less busy, and more affordable than La Boqueria Market. I’d still recommend going to La Boqueria Market as well, as the buzz is just fantastic! \nThe pace here, however, is a lot more easy going and relaxed. We enjoyed a walk, coffee and breakfast! ", "publishedDate": "2019-08-30", "language": "en", "rating": 4}, {"id": 702043391, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d2015831-r702043391-Mercat_Santa_Caterina-Barcelona_Catalonia.html", "text": "Nice surroundings. Great open areas in the outside. The market is very picturesque. Not a big market, but something you can definitely handle. ", "publishedDate": "2019-08-22", "language": "en", "rating": 3}, {"id": 698665552, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d2015831-r698665552-Mercat_Santa_Caterina-Barcelona_Catalonia.html", "text": "It’s very casual. You may sit with other people on a long table. The selection of food is very good Spanish Mediterranean, but not only Tapas! The service is friendly and it’s also good for vegetarians. They have a lot of yummy dishes with no meat. And finally very good value for money.", "publishedDate": "2019-08-13", "language": "en", "rating": 5}, {"id": 687934651, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d2015831-r687934651-Mercat_Santa_Caterina-Barcelona_Catalonia.html", "text": "Great place to buy fresh produce, meat and fish or grab something for lunch.  Josep is a small corner food stand with some great takeaway items such as pasta, meatballs, salads, meats and a variety of other dishes.", "publishedDate": "2019-07-08", "language": "en", "rating": 4}, {"id": 683003945, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d2015831-r683003945-Mercat_Santa_Caterina-Barcelona_Catalonia.html", "text": "You know you have arrived when you see a wavy brightly painted tin roof.  It is very similar to le market de la Boqueria, in terms of fresh produce, fish, seafood in abundance and herbs spices and everything lovely about food.  We loved it, and we particularly loved Bar Joan, serving wine, beer and lovely tapas.  It was also great to see how busy they were with local people.  The locals also shopped for fresh produce within the market.  Lovely place to spend some time.", "publishedDate": "2019-06-20", "language": "en", "rating": 5}, {"id": 680526439, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d2015831-r680526439-Mercat_Santa_Caterina-Barcelona_Catalonia.html", "text": "Market is nice, there are a lot of products that seem to be of good quality and a lot to see even if you don’t intend to buy many stuff. Just look around and enjoy!", "publishedDate": "2019-06-10", "language": "en", "rating": 4}, {"id": 679323730, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d2015831-r679323730-Mercat_Santa_Caterina-Barcelona_Catalonia.html", "text": "We went to this market late one afternoon and allot of the stalls/vendors were closed.  This is a very small market compared to the La Boqueria Market (off of Las Ramblas) and has a wavy Gaudi-inspired multi-colored ceramic roof.", "publishedDate": "2019-06-05", "language": "en", "rating": 3}, {"id": 678568789, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d2015831-r678568789-Mercat_Santa_Caterina-Barcelona_Catalonia.html", "text": "Great place to get some coffee or wine and of course some great Spanish food.  We like Bar Joan for breakfast.  Also,  there are some good shoppes for gifts.", "publishedDate": "2019-06-03", "language": "en", "rating": 4}, {"id": 677952177, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d2015831-r677952177-Mercat_Santa_Caterina-Barcelona_Catalonia.html", "text": "Sad we missed this our first 2 days in Barcelona, as it was right next to the hotel we were staying at! We discovered it one night walking past it to another destination, and ended up trying breakfast there the following morning. The opening hours here are much more constrained than Boqueria. This is the underrated sister of Mercat La Boqueria, and we would have preferred this market much more. It's not nearly as crowded, prices are about the same if not better, and you can tell it's one the locals frequent. We had eggs and jamon and eggs and chorizo for a fraction of the cost of the same dishes at La Boqueria, and tasted was not inferior. Definitely check this one out if you're visiting the Catedral, it's right nearby. ", "publishedDate": "2019-05-31", "language": "en", "rating": 4}, {"id": 677631363, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d2015831-r677631363-Mercat_Santa_Caterina-Barcelona_Catalonia.html", "text": "We visited the place to see how the local market would be.\nThe market was quite clean and well maintained. They are selling fresh products, spices and various other items such as snacks and candies.\nAs it was not early morning, some stores were closed and bit lacking of busy and lively atmosphere. \n\nInteresting experience.", "publishedDate": "2019-05-30", "language": "en", "rating": 4}, {"id": 677054366, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d2015831-r677054366-Mercat_Santa_Caterina-Barcelona_Catalonia.html", "text": "We found this market a couple of days after having visited the one off Las Ramblas. A very similar market in terms of what they sell however much quieter so could have a good wander around and see the produce on sale. A selection of bars and cafes around the market.", "publishedDate": "2019-05-28", "language": "en", "rating": 5}, {"id": 675592889, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d2015831-r675592889-Mercat_Santa_Caterina-Barcelona_Catalonia.html", "text": "Lovely more local market, not as big as the one on the ramblas but more personal and friendly.  Good choice of stalls and eating places ", "publishedDate": "2019-05-21", "language": "en", "rating": 4}, {"id": 674657513, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d2015831-r674657513-Mercat_Santa_Caterina-Barcelona_Catalonia.html", "text": "nice Barcelona market for fresh local food and a few household items. not as big as Boqueria but supposedly more for locals (i.e., not as touristy)\n\nwe stopped here as part of a private food walking tour and this was a very cool stop", "publishedDate": "2019-05-17", "language": "en", "rating": 4}, {"id": 671792793, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d2015831-r671792793-Mercat_Santa_Caterina-Barcelona_Catalonia.html", "text": "We went there out of curiosity more than anything else. And what a surprise it was! After having already visited Mercado de La Boqueria this was a different  experience. No huge crowds for a start! And this place is actually properly covered and looked quite clean, even spotless, on the day, compared to other markets. It has lots of different stalls, selling fresh meat, fish, fruit and vegetables, and many other goods. A good place to do your shopping, particularly if you are a local!", "publishedDate": "2019-05-06", "language": "en", "rating": 4}, {"id": 671747449, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d2015831-r671747449-Mercat_Santa_Caterina-Barcelona_Catalonia.html", "text": "So visted here after going to la boqueria based on multiple recommendations by locals. They said it was better and cheaper. My take its much smaller and not as crowded as la boqueria. If la boq is a 10 on crowds this is a 4.  The restaurants are grouped in 1 section so easier to peruse and pick from as opposed to scattered . Prices were cheaper but the difference may favor la boq bc taxi expense to caterina if u staying near Plaça Catalunya. I would visit both.", "publishedDate": "2019-05-05", "language": "en", "rating": 4}, {"id": 671696330, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d2015831-r671696330-Mercat_Santa_Caterina-Barcelona_Catalonia.html", "text": "It would be amazing if you were staying nearby in an apartment - we just had to drool over fresh vegetables and a wide olive selection and super fresh fish ", "publishedDate": "2019-05-05", "language": "en", "rating": 4}, {"id": 669491024, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d2015831-r669491024-Mercat_Santa_Caterina-Barcelona_Catalonia.html", "text": "Good place to have a stop to eat something and to buy food for while you’re in hollidays. It’s less famous than other markets so there are much less people in tourists. We saw many locals in fact.", "publishedDate": "2019-04-26", "language": "en", "rating": 5}, {"id": 669375213, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d2015831-r669375213-Mercat_Santa_Caterina-Barcelona_Catalonia.html", "text": "This is one of the smaller markets in Barcelona, but as good as the big one at La Ramblas. \nNot so busy, with good little restaurants, try L universe.\n", "publishedDate": "2019-04-26", "language": "en", "rating": 5}, {"id": 664932805, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d2015831-r664932805-Mercat_Santa_Caterina-Barcelona_Catalonia.html", "text": "La Boqueria is a real tourist trap and was told this was alot more authentic.\nIt actually was. Problem is it's so small.\nVisited Mercado de maravillas in Madrid which was very authentic as well but it must be at least 5 or 6 times bigger.\nDid not impress.", "publishedDate": "2019-04-08", "language": "en", "rating": 2}, {"id": 663753235, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d2015831-r663753235-Mercat_Santa_Caterina-Barcelona_Catalonia.html", "text": "Been to La Boqueria, but loved Santa Caterina because it allows you some elbow room & ability to casually wander the stalls. This market is an easy walking distance from the Barcelona Cathedral, As you face the cathedral, look to your left & you'll be able to spot the colorful wavy roof.  The Hop On Hop Off bus also stops here. There are stalls of fresh vegetables, seafood, meats, chicken, olives, eggs, olive oil, spices, prepared foods, gift shop, restaurants, etc. There is even a traditional grocery store for household goods.  My favorite stall was Lamiel for its array of spices sold by the gram, candies, cookies, olive oil (only place where I've seen it also sold in plastic bottles), etc.  There's are public restrooms, but you need to show a receipt & the attendant will open the door for you.", "publishedDate": "2019-04-04", "language": "en", "rating": 5}, {"id": 661210382, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d2015831-r661210382-Mercat_Santa_Caterina-Barcelona_Catalonia.html", "text": "I visited as a tourist, but loved this market, because it was just the right size. Not to big, great location, fresh clean, fresh and well kept up. Every individual market has fresh and amazing product, so well displayed, I wanted to rent and apartment just to go there and shop. There is a restaurant adjacent to it not to be missed. See another review", "publishedDate": "2019-03-25", "language": "en", "rating": 5}, {"id": 659901865, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d2015831-r659901865-Mercat_Santa_Caterina-Barcelona_Catalonia.html", "text": "I agreed that this market had a lot more local products for you to shop than the other tourist markets. However this is a bit too small to visit as oversea visitors. Actually when we visited, there wasn't many people inside.\nNot if we thought if anything wrong with this market, we did some purchase as well.\nJust not as spectacular site for us.", "publishedDate": "2019-03-20", "language": "en", "rating": 3}, {"id": 657928800, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d2015831-r657928800-Mercat_Santa_Caterina-Barcelona_Catalonia.html", "text": "This time when I holidayed in Barcelona iI skipped the Boqueria Market in favour of the Mercat Santa Caterina. The eateries around it have a more local feel, it is not seething with elbow-to elbow tourists, the produce is well displayed and the vendors friendly. I have always liked the olive oil shop which also sells Spanish smoked paprika cheaper than the other market. If you want to shop more local and not be crowded out go to the Sana Caterina It is only about a 2 min walk from the Cathedral. Look to your left as you stand admiring the cathedral facade and you will see the modern wavy-lined roof of the market", "publishedDate": "2019-03-11", "language": "en", "rating": 5}, {"id": 654089127, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d2015831-r654089127-Mercat_Santa_Caterina-Barcelona_Catalonia.html", "text": "This market has been on my list to visit for sometime it was completely refurbished and reopened in 2005. The rooftop is ver attractive with a wavy design covered in colourful patchwork design finish. If you are near the old Barcelona cathedral it is a 5 minute walk away.\nObviously as a market it has lots of variety in products to sell to take home and cook. As an alternative there is a bar where you can eat.\nIt is alot less crowded than the famous Boqueria market, but it gives you a sample of a Spanish food market. Worth a visit for the colourful spectrum.", "publishedDate": "2019-02-22", "language": "en", "rating": 5}, {"id": 653987020, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d2015831-r653987020-Mercat_Santa_Caterina-Barcelona_Catalonia.html", "text": "This is a much less crowded and cleaner market than la Boqueria.  It has more of a neighborhood feel with most of the people in the market being locals in contrast to la Boqueria which is largely tourists.  There is a wonderful tapas bar in the market called Bar Joan which is reason in itself to visit this market.  ", "publishedDate": "2019-02-21", "language": "en", "rating": 5}, {"id": 649005085, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d2015831-r649005085-Mercat_Santa_Caterina-Barcelona_Catalonia.html", "text": "Very nice market. Had fresh juices, cured meats, fish, olive bar etc. Also a few shops selling pottery and goods like that. The vendors were welcoming and excited to sell their products. Did not have any issues speaking only English.  Good experience, got a few souvenirs here. Just watch the hours. The siesta is real and going mid day you might find most everything closed.", "publishedDate": "2019-01-29", "language": "en", "rating": 5}, {"id": 647688430, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d2015831-r647688430-Mercat_Santa_Caterina-Barcelona_Catalonia.html", "text": "Located not that far from the Cathedral this old market  goes back to 1845 and was built on the site of the former convent of Santa Catarina hence its name.It is a good market, quite sapcious with some modern touches  and worth a look.", "publishedDate": "2019-01-22", "language": "en", "rating": 3}, {"id": 643176729, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d2015831-r643176729-Mercat_Santa_Caterina-Barcelona_Catalonia.html", "text": "Nice little market with a good mix of locals and tourists.  A few restaurants that serve food there but they were quite full as we arrived at around 1pm.  We ended by buying some precooked food and eat it outside.  The 3 items were a total of 14 euros, bargain!!  I loved the Arroz Negro, even though it was cold, still lovely.  The codfish canelloni was great too!!!", "publishedDate": "2019-01-02", "language": "en", "rating": 4}, {"id": 640427436, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d2015831-r640427436-Mercat_Santa_Caterina-Barcelona_Catalonia.html", "text": "We decided to visit this market because we were at the Barcelona Cathedral very early and we were looking for something to see to kill some free time. The place was not crowded but plenty of people having their breakfast and doing their grocery shopping. The place is indoor and small so it is relatively clean and easy to navigate. ", "publishedDate": "2018-12-18", "language": "en", "rating": 3}, {"id": 634896229, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d2015831-r634896229-Mercat_Santa_Caterina-Barcelona_Catalonia.html", "text": "The mercat de La boqueria is famous, but can be busy. This market on the other hand felt like a place where locals go to get groceries. If you need to pick up some items for a stay and avoid the crowds, I would go here. ", "publishedDate": "2018-11-21", "language": "en", "rating": 4}, {"id": 625384055, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d2015831-r625384055-Mercat_Santa_Caterina-Barcelona_Catalonia.html", "text": "Well just dive into this wonderful and colorful market.  I was not cooking during my visit, but the vendors didn’t mind my interest without buying anything! Long discussions about how to cook goats head, what’s different about duck eggs, where does this and that grow?  We were staying next door at the wonderful hotel Edition, not sure I would have gone otherwise and so glad I did. Then go explore the nearby winding lanes of the Born neighborhood starting with the old concert hall - Palau de musica (not exact name!) and continuing through the interesting shops and little bars.", "publishedDate": "2018-10-16", "language": "en", "rating": 5}, {"id": 620761982, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d2015831-r620761982-Mercat_Santa_Caterina-Barcelona_Catalonia.html", "text": "A great free stop off with something for anyone who eats. The range and freshness of the produce puts the U.K. shelves to shame! Don’t forget to pick up a sample cone of ham, cheese or sausage for €1 - €3 👍🏻", "publishedDate": "2018-09-30", "language": "en", "rating": 5}, {"id": 618232925, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d2015831-r618232925-Mercat_Santa_Caterina-Barcelona_Catalonia.html", "text": "We visited 3 markets in Barcelona last week - the Boqueria, St Antoni, and Santa Caterina.  As soon as we walked in we knew this was, for us, the best of the three.  It is a true functioning neighbourhood market, not overrun with people just looking. \n\nInside, we found \"Llegums Cuits Rafols\" (= Rafol's cooked veg).  Imagine a row of cooked beans, pulses, rice, couscous... and a range of wonderful cooked dishes with all kinds of veg and some meats too. I had stuffed aubergine with beef, pork and veg stuffing; my husband said his bacalau was the best he'd ever had.  We also had mixed grilled veg and spinach with garlic.   The proprietors kindly heated it up for us, packaged it, handed us forks, and we had a wonderful picnic outside on a municipal concrete bench.  Everything was excellent.  One of the best and least expensive meals we had in Barcelona.\n\nIf you've been eating restaurant food for too many days, you know how you can crave vegetables.... we'll make a beeline for those folks next time we're there.", "publishedDate": "2018-09-20", "language": "en", "rating": 5}, {"id": 614985720, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d2015831-r614985720-Mercat_Santa_Caterina-Barcelona_Catalonia.html", "text": "The display of the food products is stunning.  And you can buy some prepared food for your lunch.  I loved the fresh fruit juice.", "publishedDate": "2018-09-08", "language": "en", "rating": 5}, {"id": 611199945, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d2015831-r611199945-Mercat_Santa_Caterina-Barcelona_Catalonia.html", "text": "While La Boqueria is bigger, prettier and close to La Rambla, I bought more at the Santa Caterina market. La Boqueria has lots freshly butchered meats and beautiful colorful vegetables all arranged in stunning displays but as I stayed in a hotel I could not do much with those. Santa Caterina had olive oils and things we found to be more transportable. And it's much less crowded.  ", "publishedDate": "2018-08-27", "language": "en", "rating": 5}, {"id": 608316176, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d2015831-r608316176-Mercat_Santa_Caterina-Barcelona_Catalonia.html", "text": "This market is less touristy and crowded compared to Mercado de La Boqueria. There are many stalls selling fresh meat, fish, fruits and produce. There are also small restaurants serving food and drinks. I bought some apples and peaches here. I personally prefer this quieter market than Mercado de La Boqueria.", "publishedDate": "2018-08-20", "language": "en", "rating": 4}, {"id": 607022492, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d2015831-r607022492-Mercat_Santa_Caterina-Barcelona_Catalonia.html", "text": "A nice little market. Not too many stalls but it’s got several fruit, meat, nuts stalls so it’s got all I’m looking for. It’s just not so Instagram-friendly compared to Boqueria as it’s not as ‘fancy’ as Boqueria but other than that it’s excellent. One stall sells paella and other cooker food so it suits me well as I’m traveling alone and don’t want to spend €15-20 for a meal of paella in the restaurant.  Can clearly tell some locals have been getting their groceries here for a long time. Only thing is I was there at 1-ish but several stalls seemed to have been getting ready to shut down at that time. ", "publishedDate": "2018-08-16", "language": "en", "rating": 4}, {"id": 605299029, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d2015831-r605299029-Mercat_Santa_Caterina-Barcelona_Catalonia.html", "text": "Excellent selection and quality of local produce available. Staff very friendly and helpful. Reasonable prices. ", "publishedDate": "2018-08-11", "language": "en", "rating": 5}, {"id": 596842059, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d2015831-r596842059-Mercat_Santa_Caterina-Barcelona_Catalonia.html", "text": "Not much for tourists to see other than the actual fresh food market the locals use. If you want fruit or cheese this is a good place to get some.", "publishedDate": "2018-07-16", "language": "en", "rating": 3}, {"id": 594660359, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d2015831-r594660359-Mercat_Santa_Caterina-Barcelona_Catalonia.html", "text": "nothing like eating in the middle of a food market, and choosing your type of food the wines are well selected\nand it is hard to go wrong", "publishedDate": "2018-07-09", "language": "en", "rating": 4}, {"id": 591607147, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d2015831-r591607147-Mercat_Santa_Caterina-Barcelona_Catalonia.html", "text": "We took some Santa Catarina Market virgins and loved their reaction to the market. It also never ceases to amaze me. I would love love love to shop here everyday, although I’d be the size of a house!\nFantastic for wandering and browsing. Just don’t look at the tripe 🤢", "publishedDate": "2018-06-29", "language": "en", "rating": 5}, {"id": 587472491, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d2015831-r587472491-Mercat_Santa_Caterina-Barcelona_Catalonia.html", "text": "Not as well known as la Boqueria it nevertheless is an amazing collection of seafood vendors, meat purveyors, various candy and vegetable\nVendors of course sone amazing restaurants. Loved the meals here and it is less crowded so talking to them is easier. Really an under appreciated spot in the city. Needs to be seen", "publishedDate": "2018-06-14", "language": "en", "rating": 5}, {"id": 585351003, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d2015831-r585351003-Mercat_Santa_Caterina-Barcelona_Catalonia.html", "text": "This market is a more local choice than the touristy Mercat de la Boqueria. It has both local shops and tourist stalls (not really that touristy, indeed). A good place to really see the real life of Barcelona residents.", "publishedDate": "2018-06-05", "language": "en", "rating": 5}, {"id": 584553233, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d2015831-r584553233-Mercat_Santa_Caterina-Barcelona_Catalonia.html", "text": "Great lunch near Museo Picasso. Busy, crowded, large restaurant in the mercat...we were seated at the bar right away by a friendly hostess. Fun to watch the chefs prepare beautiful dishes while we ate. Many vegetable and fish choices—too many lovely things on the menu to have in one meal! Mussels, gazpacho, seafood rice were all delicious and served quickly. Service was very good.", "publishedDate": "2018-06-02", "language": "en", "rating": 5}, {"id": 583997779, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d2015831-r583997779-Mercat_Santa_Caterina-Barcelona_Catalonia.html", "text": "We visited the mercat and tried different foods from the vendors, all with a beautiful presentation and great quality.", "publishedDate": "2018-05-30", "language": "en", "rating": 5}, {"id": 583965516, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d2015831-r583965516-Mercat_Santa_Caterina-Barcelona_Catalonia.html", "text": "The market has such a range of foods from seafoods through to lollies and fruits and vegetables. Do all your shopping for the evening meal here and cook up a storm.", "publishedDate": "2018-05-30", "language": "en", "rating": 5}, {"id": 583531063, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d2015831-r583531063-Mercat_Santa_Caterina-Barcelona_Catalonia.html", "text": "This is another gem that we came across during our walks. We were attracted by the colourful undulating roof of coloured tiles and, on arrival discovered that it was a food market. There are all types of fruits, vegetables, fish,  meats, hams and other treats on the many stalls inside and you can also buy fresh flowers. An tapas bar at the entry and we enjoyed excellent service and a meal outside under the roof before setting off again to the next sight. The market is built on the location of a former Convent of Santa Caterina and dates to 1845.", "publishedDate": "2018-05-28", "language": "en", "rating": 4}, {"id": 583489495, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d2015831-r583489495-Mercat_Santa_Caterina-Barcelona_Catalonia.html", "text": "We were closer to the main market but decided to walk a little further for less crowds.  Very nice facility, clean and modern.  Bought local grown produce and was very impressed with freshness and quality.  Sampled several fish like sardines and anchovies.  Since the market was not full of tourists, the merchants were helpful and explained the foods that were new to us.  Eating while walking around is a most enjoyable experience here.", "publishedDate": "2018-05-28", "language": "en", "rating": 4}, {"id": 581571034, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d2015831-r581571034-Mercat_Santa_Caterina-Barcelona_Catalonia.html", "text": "Mercat Santa Caterina is a great market to visit as a family or couple to shop or to have something tasty to eat for lunch. A snack or a taste of something. The place has a good mix of shops/stalls with lots of action and market atmosphere. This is a great place to start a city trip to Palma, when you arrive around lunch hour and want something to eat before you start shopping. Walking to Palma shopping area took 5 minutes. Highly recommendable place. I would shop here regularly if i could.", "publishedDate": "2018-05-20", "language": "en", "rating": 5}, {"id": 581035165, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d2015831-r581035165-Mercat_Santa_Caterina-Barcelona_Catalonia.html", "text": "This Market is located not far from the Cathedral. This is a nice market. It's roof is unique. Not so many tourists  there", "publishedDate": "2018-05-18", "language": "en", "rating": 3}, {"id": 579407328, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d2015831-r579407328-Mercat_Santa_Caterina-Barcelona_Catalonia.html", "text": "It’s a very nice market near the cathedral but not so good as La boqueria\nThere are 2 good restaurants inside the market to have lunch ", "publishedDate": "2018-05-11", "language": "en", "rating": 4}, {"id": 573684741, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d2015831-r573684741-Mercat_Santa_Caterina-Barcelona_Catalonia.html", "text": "Very busy place with great, fresh food. My steak was delicious, although the waiter told me it was a burger! Lovely to see the food cooked right in front of you, straight from the market. You can choose tapas by the bar or full plates. Crema Catalana was one of the best I’ve ever had. Popular with groups and serves until v late. Only didn’t mark higher as service was quite impersonal. Had to ask for a few things more than once. Waitress looked the other way when serving us, never smiled, made eye contact or even spoke to us. I’d recommend, all the same. ", "publishedDate": "2018-04-16", "language": "en", "rating": 4}, {"id": 572897915, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d2015831-r572897915-Mercat_Santa_Caterina-Barcelona_Catalonia.html", "text": "Was told this was more local and authentic than the Boqueira one. It wasn't good, quite small and nothing much to buy. Wouldn't recommend ", "publishedDate": "2018-04-12", "language": "en", "rating": 2}, {"id": 572775261, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d2015831-r572775261-Mercat_Santa_Caterina-Barcelona_Catalonia.html", "text": "This is probably the most beautiful and animated market in Barcelona.  Gorgeous display of fruits and vegetables, plus lots of prepared food.  Good place to buy your lunch, and there are some places to sit and eat, although not many.  I love the fruit and the juice drinks.", "publishedDate": "2018-04-11", "language": "en", "rating": 5}, {"id": 572769551, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d2015831-r572769551-Mercat_Santa_Caterina-Barcelona_Catalonia.html", "text": "We love this market, not too expensive and great local products.  I`m a huge fan of the olive stand.  The ladies don`t speak much english, but they are really nice and helpful.  It`s the second time I took vacuum sealed olives overseas, especially the olives \"Campo Viejo\" style and the olives in chilli carrot marinade are beautiful.  The tiny marinated onions are also very yummy.  Hope they are still there next time :)", "publishedDate": "2018-04-11", "language": "en", "rating": 5}, {"id": 572209942, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d2015831-r572209942-Mercat_Santa_Caterina-Barcelona_Catalonia.html", "text": "Smaller and more of a local market than la Boqueria, this is not far from the Cathedral and worth a visit. It is quite a new building, very stylish, and has the range of fresh produce you would expect in Barcelona. There are also places to eat.", "publishedDate": "2018-04-09", "language": "en", "rating": 4}, {"id": 569419435, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d2015831-r569419435-Mercat_Santa_Caterina-Barcelona_Catalonia.html", "text": "Not crowded, also turist oriented, with many small places to have quick snack. Very good location. Pleasant stuff.", "publishedDate": "2018-03-29", "language": "en", "rating": 5}, {"id": 569165591, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d2015831-r569165591-Mercat_Santa_Caterina-Barcelona_Catalonia.html", "text": "This market lacked the edge of the Las Ramblas one (and was more pricey somehow) but was informed the locals visit. \n\nCovered so great for wet weather and no beggars rogging you out.  Check out the Fruits Sec Josep stall for the best dates ever!\n\n", "publishedDate": "2018-03-27", "language": "en", "rating": 3}, {"id": 566624808, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d2015831-r566624808-Mercat_Santa_Caterina-Barcelona_Catalonia.html", "text": "I enjoyed this market much more than La Boqueria. It was far less crowded and touristy. Some reviews mentioned crime, but I never felt this was an issue. La Rambla and La Boqueria are more crowded and better candidates for theft. The architecture of the structure was beautiful. Prices are also very reasonable. There is a fantastic shop to get Spanish olive oil where you could taste before buying. We also got jamon, chorizo, and manchego at one of the stalls too for a picnic. We were also able to try before buying there. Highly recommend this market! It is steps away from the cathedral.", "publishedDate": "2018-03-15", "language": "en", "rating": 5}, {"id": 559585546, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d2015831-r559585546-Mercat_Santa_Caterina-Barcelona_Catalonia.html", "text": "This is a lovely market, perfectly suitable for a 15-minute stroll, just to absorb the atmosphere, even if you're not looking to buy anything.", "publishedDate": "2018-02-10", "language": "en", "rating": 4}, {"id": 556371458, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d2015831-r556371458-Mercat_Santa_Caterina-Barcelona_Catalonia.html", "text": "As some people already know, I go there with my loved wife every Sunday to lunch. At this time we know every one of the waiters, the guys from the bar, etc. \nThey are all gentle guys (and girls) that make all they can to please the customers, especially those who go to the \"Cuines\" so often as we do!\nThe food is always great, done the same perfect way they always do in that open kitchen along the \"barra\". \nLast Sunday I had the \"arroz salvaje con verduras y salsa mostaza\", that is \"Wild Rice with Vegetables and Mustard Sauce\" that was perfect! Wil rice is a black type of rice. The dish was so delicious and well done I didn't let even one seed in the plate.\nFor dessert, as I always do, I asked for a \"crema catalana\" that is a English cream with caramelized sugar over it! Superb! My preferred dessert, perfectly done! Delicious! And also the coffee in Santa Caterina is always good.\nNext Sunday, guess where will we go for lunch? \nIf you come to the beautiful Barcelona in Spain, you must go to Santa Caterina Restaurant for at least  one meal.", "publishedDate": "2018-01-25", "language": "en", "rating": 5}, {"id": 552143878, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d2015831-r552143878-Mercat_Santa_Caterina-Barcelona_Catalonia.html", "text": "This is a beautiful market in the historic center of Barcelona. Less crowded than La Boqueria, and with some good places to have a very good meal. The building is amazing, designed by Enric Miralles and Benedetta Tagliabue.", "publishedDate": "2018-01-06", "language": "en", "rating": 5}, {"id": 546885562, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d2015831-r546885562-Mercat_Santa_Caterina-Barcelona_Catalonia.html", "text": "Good Market, great variety of fruits , veggies, meats etc but closed on Sundays . Few metres from the Barcelona Cathedral.", "publishedDate": "2017-12-12", "language": "en", "rating": 4}, {"id": 543429468, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d2015831-r543429468-Mercat_Santa_Caterina-Barcelona_Catalonia.html", "text": "Really fun to go into the market as there are lots of great places to eat fresh seafood and of course tapas.  I keep reading about pick pockets, but to be honest, just be smart.  Don't wear a backpack with easy access to zippers.  You must stroll into this area and take in all the smells and sights.  This was a real treat!", "publishedDate": "2017-11-26", "language": "en", "rating": 5}, {"id": 543258810, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d2015831-r543258810-Mercat_Santa_Caterina-Barcelona_Catalonia.html", "text": "Barcelona is famous for thieves and pickpockets.  They operate in gangs of women, women and men and men and men in groupsof 3-5.  Santa Caterina is a great market to browse around and buy you favorite Spanish goodies but beware - this place is crawling with thieves and pickpockets. Always keep your belongings in front of you and any bags should be stringed around your body. No phones on the table while you eat of have a coffee. I lost my shoulder bag even though I was careful.  But a distraction from a women with baby in pram, I lost my bag on the table in front of me in just 2 sec. Distraction is the modus operandi. And don't expect Spanish police to care.  They see some 400 of these daylight robberies every day.  I was at the police station off La Ramblas. They were some some 25 unfortunate others like me - all tourists.  To make a report, they would ask for your phone IMEI number and other ridiculous details so that they can turn you away. Don't expect any help for tourists. A plus at Santa Catarina Market - you can pick up some great iberico ham and a nice bottle of spanish red.", "publishedDate": "2017-11-25", "language": "en", "rating": 2}, {"id": 542815722, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d2015831-r542815722-Mercat_Santa_Caterina-Barcelona_Catalonia.html", "text": "Friends who live in Barcelona suggested this as the perfect combination of local market-style offerings and tourist-friendly interests. We got a little cone of delicious Iberian ham and wandered through the stalls. This is a great place to stop in if you bring a bag and want to have a cute little picnic (I suggest la rambla!!) With fresh fruit, cheeses, and as much meat as you can fit!", "publishedDate": "2017-11-23", "language": "en", "rating": 5}, {"id": 541371799, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d2015831-r541371799-Mercat_Santa_Caterina-Barcelona_Catalonia.html", "text": "This is a typical market and has meat and cheese vendors that our guide took us to see and taste. They are all very friendly. Walk around the outside so you can see the roof. Inside they kept remains of what they found when they renovated this site...what could it be?  Check it out!\nTIP:  when in this area go to the Picasso Museum and the church Santa Maria Del Mar. all in the same area. See my reviews for Casa Gispert and Brunellos pastry shop. All in the same area. ", "publishedDate": "2017-11-16", "language": "en", "rating": 4}, {"id": 539856354, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d2015831-r539856354-Mercat_Santa_Caterina-Barcelona_Catalonia.html", "text": "This market tries to imitate its bigger and more popular market on the Ramblas. It is quiet and very clean, but lacks the authenticity of a \"real\" fruit and vegetables market - a bit \"plastic\"", "publishedDate": "2017-11-09", "language": "en", "rating": 3}, {"id": 532127346, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d2015831-r532127346-Mercat_Santa_Caterina-Barcelona_Catalonia.html", "text": "This market is relatively new, but nice and not as touristic as some others. The restaurant on the corner has great food!", "publishedDate": "2017-10-11", "language": "en", "rating": 5}, {"id": 532033450, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d2015831-r532033450-Mercat_Santa_Caterina-Barcelona_Catalonia.html", "text": "A really good local market, well worth a visit and make sure you stop at Bar Joan’s for a couple of drinks and probably the best tapas available, very cheap too because it’s there for the locals not us tourists ", "publishedDate": "2017-10-11", "language": "en", "rating": 5}, {"id": 530867173, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d2015831-r530867173-Mercat_Santa_Caterina-Barcelona_Catalonia.html", "text": "Agree with the other posters that this is the best local market - not crowded and truly a market rather than a tourist spot.  We made several visits to pick up fresh fruit, ham, and cheeses, and we also found some reasonably priced saffron and smoked paprika to take home.", "publishedDate": "2017-10-07", "language": "en", "rating": 5}, {"id": 527561718, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d2015831-r527561718-Mercat_Santa_Caterina-Barcelona_Catalonia.html", "text": "This is an excellent fresh food market, well worth finding, and it contains a number of good quality bars and eateries -  well worth finding away from the crowds", "publishedDate": "2017-09-26", "language": "en", "rating": 5}, {"id": 526949898, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d2015831-r526949898-Mercat_Santa_Caterina-Barcelona_Catalonia.html", "text": "the better market to visit I think.  it is wonderfully varied in offerings and there are tables outside if you want to order food.  clean, uncrowded (compared to Boqueria market which is a zoo).  I wanted to buy spices and found the people at the Torres spice shop very helpful.  english is limited but you can get buy with a word or two.  had a nice lunch at one of the sidewalk cafes.", "publishedDate": "2017-09-24", "language": "en", "rating": 4}, {"id": 526885537, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d2015831-r526885537-Mercat_Santa_Caterina-Barcelona_Catalonia.html", "text": "Love this market.  My favorite are the fresh fruit juices.  But you can buy just about anything else here.  The displays are beautiful, and it is so alive.  Good place for lunch.  A must!", "publishedDate": "2017-09-23", "language": "en", "rating": 5}, {"id": 526231142, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d2015831-r526231142-Mercat_Santa_Caterina-Barcelona_Catalonia.html", "text": "We have visited this market several times and have always found the selection and quality to be superior and the prices to be reasonable. It is not as touristy as others and the people are friendly. The tapas bar is a little pricey but there are other options close by. ", "publishedDate": "2017-09-21", "language": "en", "rating": 5}, {"id": 523244493, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d2015831-r523244493-Mercat_Santa_Caterina-Barcelona_Catalonia.html", "text": "This fresh food market was 100 metres from where I was staying. I'm an early riser (especially by Spanish standards!) and found this was a great spot to have my morning cortado and bocadillo con Jamon y questo as the market opens at 7:30am. Bar Joan and La Torna both great and you eat with the locals. The fresh foods here are amazing as well. Highly recommended for a really local experience. ", "publishedDate": "2017-09-10", "language": "en", "rating": 5}, {"id": 521416267, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d2015831-r521416267-Mercat_Santa_Caterina-Barcelona_Catalonia.html", "text": "We always visit the market when in Barca, in particular Bar Joan for a bikini breakfast (ham & cheese toastie) and the best cafe con leche in the city. \nIt's fun to watch the world go by and the very talented fish stall employees who fascinate me! \nIt's a very local market, full of regulars and the produce is second to none.", "publishedDate": "2017-09-05", "language": "en", "rating": 5}, {"id": 516849342, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d2015831-r516849342-Mercat_Santa_Caterina-Barcelona_Catalonia.html", "text": "This is a nice, clean market with a good selection of meat, fish, fruits and local food. I bought a paella pan, paella seasoning and some rice to take home and try my hand at making paella. We had brunch at the corner restaurant called Restaurant L'Unibers, we thought it would be a nice place to eat tapas, but it was overpriced and the food was nothing special.", "publishedDate": "2017-08-23", "language": "en", "rating": 4}, {"id": 514033338, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d2015831-r514033338-Mercat_Santa_Caterina-Barcelona_Catalonia.html", "text": "We were planning on having lunch here after seeing the museo Picasso. However the food was not appealing to the teenagers and there wasn't a lot of seating. We spent about 10 minutes.  In one corner of the market they have a view to some Roman ruins and that's how we ended up visting the historic museum of Barcelona.", "publishedDate": "2017-08-16", "language": "en", "rating": 3}, {"id": 509618213, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d2015831-r509618213-Mercat_Santa_Caterina-Barcelona_Catalonia.html", "text": "We came across this when visiting the Santa Maria del Mar. It is literally a 2 minute walk for the church. We probably would have made a separate journey for this otherwise. Market was full of fresh meats, fruits and fish with a few places to eat. \n\nOne of the fruit shops were selling some really nice smoothies for 1.5 Euro. Which are worth getting while you are there ", "publishedDate": "2017-08-07", "language": "en", "rating": 4}, {"id": 506512139, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d2015831-r506512139-Mercat_Santa_Caterina-Barcelona_Catalonia.html", "text": "We went to the Market on a Sunday after a tour of Barcelona, since it was Sunday the market side was closed but the restaurants were open.  Don't get put off by it looking like food stalls, completely different than the States.  You sit down and have a waitress and can order from about six different types of restaurants all from one menu.  Everything was absolutely delicious, if you like foie gras, get the foie with mushrooms and sunny side up egg, still thinking about it three weeks later.", "publishedDate": "2017-07-28", "language": "en", "rating": 5}, {"id": 499748922, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d2015831-r499748922-Mercat_Santa_Caterina-Barcelona_Catalonia.html", "text": "We went to La Boqueria first and it was insanely crowded. Then we came here and could easily stroll through. We had a delicious lunch at one of the restaurants there.", "publishedDate": "2017-07-08", "language": "en", "rating": 4}]}}]