[{"locationId": 4469233, "name": "Port Olimpic", "placeType": "ATTRACTION", "reviewListPage": {"reviews": [{"id": 752508472, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d4469233-r752508472-Port_Olimpic-Barcelona_Catalonia.html", "text": "During our exploration of Barcelona, my wife and I spent part of an afternoon exploring the waterfront. This included the port that was full of boats of various sizes. I learned that like the other Olympic facilities from 1992, the port has been repurposed as a marina as well as the home for local shopping and cafes.", "publishedDate": "2020-04-11", "language": "en", "rating": 4}, {"id": 751752981, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d4469233-r751752981-Port_Olimpic-Barcelona_Catalonia.html", "text": "We had an Amazing Opportunity to spend some time at Sea on the Afternoon of our last Night in Barcelona, and what an amazing Port it is with all the Luxury Yachts in the Marina, as we left the Port out to Sea.The Views of the Barcelona Coastline too was breathtaking,and our Skipper Juan,was more than helpful in giving us Information throughout our Tour, even providing us with some Nibbles,whilst keeping our Drinks cooled in the Fridge down below.A very Good Port to take a day at Sea from.", "publishedDate": "2020-03-24", "language": "en", "rating": 4}, {"id": 735562184, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d4469233-r735562184-Port_Olimpic-Barcelona_Catalonia.html", "text": "We traveled here with our feet from petit palace boqueria garden. The views were great and I was jealous because there were massive boats in this port.", "publishedDate": "2019-12-30", "language": "en", "rating": 4}, {"id": 729106169, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d4469233-r729106169-Port_Olimpic-Barcelona_Catalonia.html", "text": "This is a great place for a very long stroll to enjoy the water views.  This was one of the sites of the Olympics and what they left behind transformed this part of the city, modernized it.   Lots of places to eat and drink.", "publishedDate": "2019-11-26", "language": "en", "rating": 4}, {"id": 728884416, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d4469233-r728884416-Port_Olimpic-Barcelona_Catalonia.html", "text": "Port Olimpic is an easy place to walk about.  It dates to the 1992 Olympics in Barcelona.  Barcelona had water, but no beaches so they imported sand from Egypt  and  palms from Hawaii and voila with 7 beaches became the third most popular European tourist destination—next to London and Paris.", "publishedDate": "2019-11-25", "language": "en", "rating": 5}, {"id": 722614634, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d4469233-r722614634-Port_Olimpic-Barcelona_Catalonia.html", "text": "Our morning stroll took us from the Cuitadella metro past the hotel Arts and to the port Olympic. We had a look at the boats and took in the scenery before morning onto the beach.\n\nMany happy memories here from my previous visits as well as this one. A lovely area of the city.", "publishedDate": "2019-10-30", "language": "en", "rating": 5}, {"id": 690172763, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d4469233-r690172763-Port_Olimpic-Barcelona_Catalonia.html", "text": "A nice marina area way out from the cultural tourist circuit of Barcelona and right on the beach and sea tourist circuit. Lots of restaurants, cafes and beaches here. Not much to see, but plenty of chilling to do.", "publishedDate": "2019-07-16", "language": "en", "rating": 4}, {"id": 683639696, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d4469233-r683639696-Port_Olimpic-Barcelona_Catalonia.html", "text": "I almost forgot about this wonderful place! We got off here while on our hop on hop off bus tour. We walked around a little bit and even ended up eating at a wonderful Buffett restaurant. My friend too some great pictures but she never sent them to me lol But we had a great time here!", "publishedDate": "2019-06-23", "language": "en", "rating": 5}, {"id": 673474668, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d4469233-r673474668-Port_Olimpic-Barcelona_Catalonia.html", "text": "We visited late afternoon & it was very quiet, there was hardly anyone out. There are some restaurants along the port. The boats were nice. The road leads to the beach. ", "publishedDate": "2019-05-12", "language": "en", "rating": 3}, {"id": 664850492, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d4469233-r664850492-Port_Olimpic-Barcelona_Catalonia.html", "text": "We had a nice stroll through and to Port Olimpic during our first visit to Barcelona.  In addition to seeing the 25th Olympic Iconic flags we enjoyed walking along the coastline seeing the various vendors, restaurants, the big metal iconic Fish  and overall people watching. To change it up, we hopped on one of the bike taxis ($15 US per couple at the time) from one end of the area to the other.  It was a great ride that allowed you to enjoy the breezy Barcelona air.    During our visit to Port Olimpic, we also stopped by the GRAN casino to  have a hand or two of poker. Interestingly, once you give the dealer your money, everything is automated.   Pretty Cool.  Even though we didn't win big another interesting fact is that they allowed us to take a pictures of us losing  BIG...HAHAH:)", "publishedDate": "2019-04-08", "language": "en", "rating": 4}, {"id": 662089898, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d4469233-r662089898-Port_Olimpic-Barcelona_Catalonia.html", "text": "This is a very pleasant area to walk in, especially in the morning before it gets too warm. It's easy to get to on public transport, and has plenty to see and do, and if you eat early - around 12 noon onwards there are good restaurants, with excellent food, at very reasonable prices", "publishedDate": "2019-03-29", "language": "en", "rating": 4}, {"id": 656996312, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d4469233-r656996312-Port_Olimpic-Barcelona_Catalonia.html", "text": "Really nothing that pops out and makes you say WOW, but it was good for a quick visit to say, ya we've been there.", "publishedDate": "2019-03-07", "language": "en", "rating": 3}, {"id": 634658234, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d4469233-r634658234-Port_Olimpic-Barcelona_Catalonia.html", "text": "Great place to shop, eat or relax by the port. Plenty to see and do in beautiful surroundings. When we were there the galleon andalucia was there", "publishedDate": "2018-11-20", "language": "en", "rating": 5}, {"id": 634454724, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d4469233-r634454724-Port_Olimpic-Barcelona_Catalonia.html", "text": "This is a great little area that remained after Barcelona created for the Olympics. It's a nice by the water cleaner than Barcolonetta area to walk around and explore. ", "publishedDate": "2018-11-19", "language": "en", "rating": 4}, {"id": 623076907, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d4469233-r623076907-Port_Olimpic-Barcelona_Catalonia.html", "text": "Lovely place to spend beautiful evenings in Barcelona with awesome view and lots and lots of bars and restaurants. You can sit for long there ", "publishedDate": "2018-10-07", "language": "en", "rating": 5}, {"id": 618920883, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d4469233-r618920883-Port_Olimpic-Barcelona_Catalonia.html", "text": "Basically this is a large marina with surrounding restaurants and an adjacent beach. Unfortunately the beach opens up onto the entrance to the marina so the sea does not look too clean. It is a hot place with little shade unless you stop at the bar/restaurant. There are surrounding attractions such as a casino and also events on the promenade next to the marina.  You may go as part of an organised tour or on a hike along the seafront.  However there are plenty more interesting attractions in Barcelona. ", "publishedDate": "2018-09-23", "language": "en", "rating": 3}, {"id": 609249631, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d4469233-r609249631-Port_Olimpic-Barcelona_Catalonia.html", "text": "Port Olimpic is fabulous for affordable food. There is a public park with playgrounds between the road and the port below, which is more of a marina. We would have found more places open, other than shisha (hookah smoking) bars, if we’d visited at night. The paella at Salamanca is known to be the freshest. We ate at the other end of the port at Jerusalem. Their service was good and the food was generous...kebab, skewers, vegetarian hummus and baba ganoush. We shared an arayes carne (ground beef pita), cut in four. The teas are nice. From there, we walked up to the Casino next door, where people sit or sip tea under the fish-structure (ginormous for shade) as designed by Canadian architect Frank Gehry. City and tour buses circle around the casino, and closer to the port, carry passengers toward the central Plaza de Catalunya. You could easily spend 2-3 hours at the port, but don’t expect air conditioning. All of the cafe stalls are canvas-covered, but otherwise, open to wind and air!", "publishedDate": "2018-08-22", "language": "en", "rating": 4}, {"id": 602134725, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d4469233-r602134725-Port_Olimpic-Barcelona_Catalonia.html", "text": "This area received a makeover when Barcelona was chosen to host the 1992 Olympic Games. The city opened it's doors to the sea and became a true Mediterranean city. Redefining the skyline the two skyscrapers and Frank Gehry's golden fish became the symbol of the Olympic Port. There are plenty of leisure activities to choose from for day time or nightlife. The Port is the Gateway to Barcelona's beaches, close to the Zoo, has some of the best seafood restaurants and famous night clubs and a Sailing Center. Take a stroll along Moll de Gregal dock for views of Barcelona from the sea.", "publishedDate": "2018-08-02", "language": "en", "rating": 4}, {"id": 596596094, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d4469233-r596596094-Port_Olimpic-Barcelona_Catalonia.html", "text": "Came to port olimpic on the hop on hop off bus! Really good casino when you step off off the bus and nice to have a drink. There’s a square of bars and restaurants round the port which has something for everyone. I’d recommend that the square is mainly for the younger generation when it gets to after 11pm can get quiet rowdy but still fun! Few drink offers round the bars sheesha available etc. Would return. ", "publishedDate": "2018-07-16", "language": "en", "rating": 4}, {"id": 590307291, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d4469233-r590307291-Port_Olimpic-Barcelona_Catalonia.html", "text": "This is a nice area that was built mainly for the olympics. There are a lot of restaurants. However, some of them can be quite touristic so make sure you check the reviews. I would recommend La Fonda del Port Olympic if you are looking for a nice seafood restaurant. The beach here is also less crowded than at barceloneta and there are also beach volleyball nets and water sports (jet ski rentals, parasailing, etc..).", "publishedDate": "2018-06-24", "language": "en", "rating": 4}, {"id": 583810898, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d4469233-r583810898-Port_Olimpic-Barcelona_Catalonia.html", "text": "We visited on three occasions, twice to dine in restaurants and once to have a look in daylight. It was built in 1991 during the redevelopment of the area and is located across from the Olympic Village. The marina has 740 berths, (calculate the $$$$ here), there are two skyscrapers, the Casino, beaches, facilities for water sports, restaurants and more restaurants. Nice promenade to stroll. Sculptures to see. Worth seeing with the adjacent attractions.", "publishedDate": "2018-05-30", "language": "en", "rating": 4}, {"id": 581209000, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d4469233-r581209000-Port_Olimpic-Barcelona_Catalonia.html", "text": "We started our walk at Rambla del Mar close to the Maritime Museum, diverted through some of the streets and the market of Barceloneta, and continued walking as far as the Port Olimpic.\n\nThe promenade alongside Barceloneta beach is flat and smooth, ideal for all (including buggies and wheelchairs) with some interesting sculptures and buildings along the way. Nice to be segregated from the many bicycles, Segways, roller bladers etc because there were so many of them. Nice views of all the activities on the beach and in the sea, and plenty benches to rest on.\n\nBe aware there isn't much in the way of shade, so on hotter days this would be more enjoyable early morning or in the evening.", "publishedDate": "2018-05-19", "language": "en", "rating": 4}, {"id": 577286734, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d4469233-r577286734-Port_Olimpic-Barcelona_Catalonia.html", "text": "It seemed like a good place where to seek a place for some lunch or dinner. Two skyscrapers integrates well in the place with the link to the past Olympics", "publishedDate": "2018-05-01", "language": "en", "rating": 4}, {"id": 576100179, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d4469233-r576100179-Port_Olimpic-Barcelona_Catalonia.html", "text": "Years ago it was absolutelly perfect,today some parts are to old and need renovation. But marina and restaurants are still fine!", "publishedDate": "2018-04-27", "language": "en", "rating": 4}, {"id": 573532135, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d4469233-r573532135-Port_Olimpic-Barcelona_Catalonia.html", "text": "A lovely area for a walk, a nice stretch of beach and promenade.  Docked boats and some restaurants around.  A relaxed feel to the area.", "publishedDate": "2018-04-15", "language": "en", "rating": 5}, {"id": 571302538, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d4469233-r571302538-Port_Olimpic-Barcelona_Catalonia.html", "text": "There is a big beach here, very popular, with a long promenade, excellent for strollers.  Have a drink at the big hotel and enjoy the view.", "publishedDate": "2018-04-05", "language": "en", "rating": 4}, {"id": 570955394, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d4469233-r570955394-Port_Olimpic-Barcelona_Catalonia.html", "text": "This a nice part of the seafront and marina in Barcelona. There are some bars and restaurants, a spacious boardwalk on which you can walk out to the seafront, plus of course beaches nearby. You can see the 'W' hotel from here and walk past the giant 'Goldfish' sculpture.", "publishedDate": "2018-04-04", "language": "en", "rating": 4}, {"id": 565862395, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d4469233-r565862395-Port_Olimpic-Barcelona_Catalonia.html", "text": "Port Olimpic is a wonderful area containing boats docked (see pics), millionaire yachts and sailboats (see pics), beaches (see pics), restaurants dotted all along the marina (see pics), flashy casino with its pretty boardwalk with artistic designed lighting (see pic), nightclubs and marvellous views all around.\n\nIt's popular at night when everyone eats out, goes to the themed nightclubs and just enjoys romantic walks in low light.  This Port is located at the opposite end to the famous W Hotel which looks like a giant sail from a sailboat.  If you walk towards the Goldfish (see pic), once you reach it and then walk past it continuing to the marina straight ahead, you're in Port Olimpic.", "publishedDate": "2018-03-11", "language": "en", "rating": 5}, {"id": 563763267, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d4469233-r563763267-Port_Olimpic-Barcelona_Catalonia.html", "text": "This stadium was used for the olympics in 1992 and still looks fantastic. It is a great place to look around and has a cafe and shop within it. It is sometimes used for concerts. ", "publishedDate": "2018-03-02", "language": "en", "rating": 4}, {"id": 553741711, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d4469233-r553741711-Port_Olimpic-Barcelona_Catalonia.html", "text": "Walked down Port Olimpic has a good boardwalk and the beautiful work of art in Front of Hotel Arts.   You can also head down to the Columbus statue a 20 minute walk.", "publishedDate": "2018-01-14", "language": "en", "rating": 4}, {"id": 550168992, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d4469233-r550168992-Port_Olimpic-Barcelona_Catalonia.html", "text": "The Barcelona Olympic Port is one of the most important in the city, today. There you´ll find beaches, the Catalonia History Museum, Rambla of the sea, and the Aquarium.\n\nThis area was born with the 1992 Olympic Games in Barcelona. For this reason, a once abandoned area turned into building and leisure activities, business, and some of the most important tourism offices in Spain. A walk along the Olympic Port is tons of fun. You can enjoy their golden sand beaches, and in some, you can enjoy fun aquatic sports.\n\nThe Catalonia History Museum is also a main place to see, the Palace of the Sea and the Aquarium of Barcelona in the Costa Brava. One of the most important in the world.\n\nNext to the Olympic Port you´ll find the Barcelonesa, a fishermen district made of narrow streets with the aroma of the sea. \n\nThere is also a big shopping center with many restaurant with terraces on the water. So see you later, now i will enjoy the sun and have my lunch!", "publishedDate": "2017-12-30", "language": "en", "rating": 4}, {"id": 527629484, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d4469233-r527629484-Port_Olimpic-Barcelona_Catalonia.html", "text": "This place is just lovely, lots of bars, restaurants and cafes, lovely boats and yaughts in the water. Lovely walkways very picturesque. So well worth a walk around. You can hop off the tourist buses at hotel arts, and walk along the marina", "publishedDate": "2017-09-26", "language": "en", "rating": 5}, {"id": 525872612, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d4469233-r525872612-Port_Olimpic-Barcelona_Catalonia.html", "text": "Great place for a stroll, the very popular beaches and some pleasant bars and restaurants, and one huge modern hotel.  Nicely reclaimed part of town.", "publishedDate": "2017-09-19", "language": "en", "rating": 5}, {"id": 524739468, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d4469233-r524739468-Port_Olimpic-Barcelona_Catalonia.html", "text": "We arrived here shortly before dinner, and walked through the building right against the water looking for something to eat.  We settled on La Balanca Del Pescador and couldn't have been happier - our waiter was friendly, helpful, and professional (and spoke good English since our Spanish is virtually non-existent!) and had a table right up against the boardwalk, where we watched the world go past.  Young people, old, roller-blading, walking dogs, traveling in groups, alone snapping photos - so much to see.  And then the beauty of the sunset beyond the many, many boats tied up in front of us - it was a magical evening.\n\nHighly recommend.", "publishedDate": "2017-09-15", "language": "en", "rating": 4}, {"id": 523924781, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d4469233-r523924781-Port_Olimpic-Barcelona_Catalonia.html", "text": "Nice to walk along the seafront and around the harbour wall, especially early evening. Enjoyed watching the kayaks, windsurfers, volleyball players. Lots of bars and restaurants, some of which are very pricey! Lovely area to spend time relaxing after the hustle and bustle of the city.", "publishedDate": "2017-09-12", "language": "en", "rating": 4}, {"id": 518571113, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d4469233-r518571113-Port_Olimpic-Barcelona_Catalonia.html", "text": "Stayed on a yacht. The Dandy. For two nights and it was amazing. Perfect weekend extravagance for a special occasion. Highly recommended for that special treat. The harbour itself had a great variety of bars and restaurants to choose from.", "publishedDate": "2017-08-28", "language": "en", "rating": 5}, {"id": 512102891, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d4469233-r512102891-Port_Olimpic-Barcelona_Catalonia.html", "text": "Zur modern Port is an area in which you can easily go for a run or walk in the morning. Not too crowded and enough Space for everyone. Look at the beach and Enjoy the Weather.", "publishedDate": "2017-08-13", "language": "en", "rating": 4}, {"id": 508753660, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d4469233-r508753660-Port_Olimpic-Barcelona_Catalonia.html", "text": "Never been to this part of Barcelona before and can't believe I missed such a gem. So many fantastic seafood restaurant and smaller holiday type bars which are really good fun. Will be back!", "publishedDate": "2017-08-04", "language": "en", "rating": 5}, {"id": 508612163, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d4469233-r508612163-Port_Olimpic-Barcelona_Catalonia.html", "text": "Port Olimpic offers a lot of different restaurants where you can enjoy the view of many more different boats. The harbor is relatively smallish but most people will have enough to watch including the many people passing by.", "publishedDate": "2017-08-03", "language": "en", "rating": 3}, {"id": 503396941, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d4469233-r503396941-Port_Olimpic-Barcelona_Catalonia.html", "text": "Park del port Olimpic:\n\nThere is a statue by Robert Limos at this location. It is a colorful and genderless person dedicated to Son Marc Limós who died 1995. Marc in Catalan means frame and you can see the city of Barcelona through this frame.", "publishedDate": "2017-07-19", "language": "en", "rating": 3}, {"id": 501625739, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d4469233-r501625739-Port_Olimpic-Barcelona_Catalonia.html", "text": "With a 5 year and 1 year old boys we went there in the afternoon and took a speed boat ride at 2 pm. #BCNaval was great. Kids friendly. It was awesome. They were on time and 35 minutes was fun seeing coastline on a speed boat. Lunch was on the beach restaurant in Divercub. Great ambience. \n", "publishedDate": "2017-07-13", "language": "en", "rating": 5}, {"id": 499956510, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d4469233-r499956510-Port_Olimpic-Barcelona_Catalonia.html", "text": "Comparing to other Barceloneta Beach 1, Port Olimpic is much nicer and cleaner. You can easily spend whole your day lying on the beach and enjoy it", "publishedDate": "2017-07-09", "language": "en", "rating": 5}, {"id": 497726461, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d4469233-r497726461-Port_Olimpic-Barcelona_Catalonia.html", "text": "Great place to visit . Beautiful at night ! Love Barcelona . Super food . Nice sandy beach . Will come back again !!! ", "publishedDate": "2017-07-01", "language": "en", "rating": 4}, {"id": 496947924, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d4469233-r496947924-Port_Olimpic-Barcelona_Catalonia.html", "text": "Port Olimpic has lots of great restaurants and bars nearby, as well as a  beautiful beach and a casino", "publishedDate": "2017-06-28", "language": "en", "rating": 5}, {"id": 494432291, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d4469233-r494432291-Port_Olimpic-Barcelona_Catalonia.html", "text": "We were tired and needed a break from the intense urban traffic and touring.  We hopped on a taxi and were dropped off in lovely Port Olimpic, where happy sunbathers, boaters, and walkers were enjoying the sea breezes and beautiful coastline.\n\nThere are stops on the hop on and off buses nearby, and the boardwalk is broad and inviting. We even shared a park bench with the 60's age group women's running champ and her silver cup, earned that morning.\n\nAfter several hours there, we felt renewed.", "publishedDate": "2017-06-19", "language": "en", "rating": 5}, {"id": 492200733, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d4469233-r492200733-Port_Olimpic-Barcelona_Catalonia.html", "text": "It's always a treat to walk by the sea. We enjoyed the view and the cool breeze. There are plenty of places to get a meal too.", "publishedDate": "2017-06-11", "language": "en", "rating": 4}, {"id": 491338310, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d4469233-r491338310-Port_Olimpic-Barcelona_Catalonia.html", "text": "I stayed on my partners yacht in port olympic. Very clean marina. Toilets and showers very clean.  Many restaurants around the marina. Good food and great atmosphere.  Only down side was the blaring music on a Friday and Saturday night.\nBarcelona is beautiful. Well worth spending a good fews days in the centre. ", "publishedDate": "2017-06-07", "language": "en", "rating": 5}, {"id": 489943328, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d4469233-r489943328-Port_Olimpic-Barcelona_Catalonia.html", "text": "Very nice place to walk, on summers day. Lovely exotic palm trees. full of character. Lots of bars and places to eat.", "publishedDate": "2017-06-02", "language": "en", "rating": 5}, {"id": 485529319, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d4469233-r485529319-Port_Olimpic-Barcelona_Catalonia.html", "text": "Great food and service located right on the beach.  The staff was wonderful.  Not cheap but still great value.  Fills up quickly for lunch so go early to be abler to be sure to have a table.", "publishedDate": "2017-05-19", "language": "en", "rating": 5}, {"id": 481904919, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d4469233-r481904919-Port_Olimpic-Barcelona_Catalonia.html", "text": "Here was the Olympic town, there were also Olympics competitions. It is now a marina with access to Barcelona beach.", "publishedDate": "2017-05-05", "language": "en", "rating": 4}, {"id": 481371614, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d4469233-r481371614-Port_Olimpic-Barcelona_Catalonia.html", "text": "We came here on Spain's Labour Day (May Day Bank Holiday) and it was heaving - beautiful sunny day, full of people drinking, eating, playing voleyball on the beach.  Really had a bustling atmosphere.\n\nVisit here either on a sunny day or on a weekend night - we walked back to it the day after our first visit (Tues night) and it was dead.  We didn't want to eat here as there was no atmosphere but because of the 40 minute walk we'd just done, we wanted a drink but most places wouldn't allow us to just have a drink apart from the rather rowdy sports bars.  \n\nDefinitely worth a visit but time it well!\n\nIf you do decide to walk here, there is a taxi-rank type are between the hotel and office block.  Really came in handy for us!", "publishedDate": "2017-05-03", "language": "en", "rating": 4}, {"id": 475740701, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d4469233-r475740701-Port_Olimpic-Barcelona_Catalonia.html", "text": "Port Olympic is located in the Barceloneta neighborhood, alongside lovely beaches and a large number of restaurants and cafes.  The harbor full of ships is beautiful and there are various boardwalks that allow you to walk out over the water.  I suggest going in the morning to avoid the worst crowds.  If you want to save $$$ on food, cut back a few streets away from the shore to find a cafe while you check out the apartment buildings covered with Catalan flags and signs supporting Catalan independence.  Yes, there will be lots of people, but this area is beautiful and a must-see in Barcelona.", "publishedDate": "2017-04-15", "language": "en", "rating": 4}, {"id": 472469371, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d4469233-r472469371-Port_Olimpic-Barcelona_Catalonia.html", "text": "The Olimpic port is the fruit of the 1992 Olympic Games in Barcelona. The entire area was rebuilt to give better living conditions to the original poor people living there. The result is a successful port along the sea, with modern sculptures such as a whale. The views to the beach and the few boats are very nice. Enjoy.", "publishedDate": "2017-04-03", "language": "en", "rating": 4}, {"id": 461652793, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d4469233-r461652793-Port_Olimpic-Barcelona_Catalonia.html", "text": "We had fun walking by the port watching the boats,  there plenty of restaurants to choose from and lovely coffee shops ", "publishedDate": "2017-02-21", "language": "en", "rating": 5}, {"id": 460126720, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d4469233-r460126720-Port_Olimpic-Barcelona_Catalonia.html", "text": "A quarter century after the Barcelona Olympics, this place is still majestic and well kept. A really beautiful area to wander around and take pictures - and also to be a bit sad of not being there to live the glorious weeks of sports in 1992.", "publishedDate": "2017-02-15", "language": "en", "rating": 5}, {"id": 448108427, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d4469233-r448108427-Port_Olimpic-Barcelona_Catalonia.html", "text": "Our boat tour  left from Port Olympic .this is where the city hosted the Olympics . I especially liked seeing the beaches along the coast of Barcelona . They are pretty nice for city beaches. It is a nice area for shopping and lots of restaurants.", "publishedDate": "2016-12-31", "language": "en", "rating": 4}, {"id": 427823433, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d4469233-r427823433-Port_Olimpic-Barcelona_Catalonia.html", "text": "A very nice area close to Barceloneta beach.There's a nice touristic harbor,a few restaurants close to the beach and the symbols of the area:two towers and a strange monument looking like a slaughtered whale.A nice place for a walk in a sunny afternoon.", "publishedDate": "2016-10-14", "language": "en", "rating": 4}, {"id": 427543745, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d4469233-r427543745-Port_Olimpic-Barcelona_Catalonia.html", "text": "At the 92 Barcelona Olympics this must have been a wonderful site for the sailing competitions. Today the Olympic spirit has left the area which seems as a gigantic eclectic and tasteless tourist trap with Frank Gehrys \"Copper Fish\" as the only interesting thing.", "publishedDate": "2016-10-13", "language": "en", "rating": 2}, {"id": 423200002, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d4469233-r423200002-Port_Olimpic-Barcelona_Catalonia.html", "text": "Lovely place to wander around, plenty to see and do. Very busy area with tourists visiting Barcelona.  Nice place to take pictures. Tuc tucs available for hire. Very clean, no litter. Look across to the boats in the harbour,  look up and see the cable cars crossing the sky, justt well worth seeing.", "publishedDate": "2016-09-28", "language": "en", "rating": 5}, {"id": 413720249, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d4469233-r413720249-Port_Olimpic-Barcelona_Catalonia.html", "text": "Pretty area.  We took a Segway tour which was a great way to see it all without doing too much walking.  Kids loved it too!", "publishedDate": "2016-09-01", "language": "en", "rating": 4}, {"id": 404144865, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d4469233-r404144865-Port_Olimpic-Barcelona_Catalonia.html", "text": "We started our walk down the beach front from here and we made our way to one of the many beach front restaurants for a cold beer and fantastic lunch ", "publishedDate": "2016-08-11", "language": "en", "rating": 4}, {"id": 402902529, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d4469233-r402902529-Port_Olimpic-Barcelona_Catalonia.html", "text": "The water here is gorgeous but the beach is crowded and has many hawkers that approach trying to sell you things. It was a nice getaway for the day but it is not a priority to get back here soon.", "publishedDate": "2016-08-08", "language": "en", "rating": 3}, {"id": 397445771, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d4469233-r397445771-Port_Olimpic-Barcelona_Catalonia.html", "text": "The beach is quite busy and isn't the best beach I have been to. It's alright to go for a few hours however it's not the place for a week long beach holiday as it's busy and doesn't have many beds/umbrellas and you have to pay for them. There are many bars and restaurants around here and also clubs and lots of club promoters who are really keen to get you into their clubs. Nice place to visit, also has the 2 towers where the athletes of the Olympics stayed. Overall nice to visit but not the best beach.", "publishedDate": "2016-07-26", "language": "en", "rating": 4}, {"id": 391718431, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d4469233-r391718431-Port_Olimpic-Barcelona_Catalonia.html", "text": "It would have been a pleasant walk to port Olympic and the beach but for the lookie lookie men lining both sides of the route selling their cheap wares.. and also being acosted by young people trying to rent you scooters and bicycles. There was also a large presence of police in the area as well. Not an area I will visit again.", "publishedDate": "2016-07-12", "language": "en", "rating": 3}, {"id": 390716250, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d4469233-r390716250-Port_Olimpic-Barcelona_Catalonia.html", "text": "We walked up along the front to the Port Olimpic. This is a lovely area of Barcelona right beside the sea! There seemed to be plenty of restaurants around too which is always a positive!", "publishedDate": "2016-07-09", "language": "en", "rating": 4}, {"id": 389300739, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d4469233-r389300739-Port_Olimpic-Barcelona_Catalonia.html", "text": "We hopped on the D20 bus and road along the sea passing sculptures and boats and finally arrived at the area where people were swimming. Later we found out when we walked toward the big metal fish that this is where all the action is. The Olympic Port where you can work out on the beach, play volleyball or just watch. Very exciting area and walking around at night is very pretty with some neon lights on the W hotel and the restaurant and Casino areas are well lit", "publishedDate": "2016-07-05", "language": "en", "rating": 5}, {"id": 386166720, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d4469233-r386166720-Port_Olimpic-Barcelona_Catalonia.html", "text": "Modern seaside development which is pleasant to stroll through on way to the sea. Interesting examples of modern architecture the best and weirdest of which is Frank Gherys fish.  ", "publishedDate": "2016-06-26", "language": "en", "rating": 4}, {"id": 385380890, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d4469233-r385380890-Port_Olimpic-Barcelona_Catalonia.html", "text": "We walked all the way from Plaza de Cataluna to the monument of Cristoforo Colombus along Las Ramblas and then to Port Olimpic. It is almost an hour walk. This area is a nice neighbourhood to stroll alongside the sea, breath the fresh air from the sea and feast your stomach at the wonderful fish restaurants spread around the marina. There is a beach nextdoor for sun bathers and swimmers. Aplace definitely to be seen in Barcelona.", "publishedDate": "2016-06-23", "language": "en", "rating": 3}, {"id": 379747892, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d4469233-r379747892-Port_Olimpic-Barcelona_Catalonia.html", "text": "There are plenty of decent restaurants around Port Olympic. There seem to be even more Shisha bars. Oh, and there is a McDonalds for the desperate. The marina is lively with toilet and bathroom facilities and plenty of boats...from the pitiful to the obscenely opulent.", "publishedDate": "2016-06-04", "language": "en", "rating": 4}, {"id": 372251664, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d4469233-r372251664-Port_Olimpic-Barcelona_Catalonia.html", "text": "A nice place for an afternoon walk, a coffee or snack, there are many eateries in this area, there are beautiful views and plenty of photo opportunities, plenty of yachts to view, a most enjoyable afternoon", "publishedDate": "2016-05-11", "language": "en", "rating": 3}, {"id": 371893258, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d4469233-r371893258-Port_Olimpic-Barcelona_Catalonia.html", "text": "We stopped off here on the open top bus to enjoy the wonderful surroundings and views. It is lovely  and clean and a joy to just take a leisurely walk around the area and gasp at the beautiful boats and ships docked in the port!!", "publishedDate": "2016-05-10", "language": "en", "rating": 5}, {"id": 370302028, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d4469233-r370302028-Port_Olimpic-Barcelona_Catalonia.html", "text": "This was a wonderful marina to walk around but it is going down hill rapidly. During the day it is ok, although the wonderful quay side restaurants have been taken over by cheap and nasty bars. Avoid in the evening when it is primarily nightclubs and the place is full of security who seem to want to fight everyone. Such a shame.", "publishedDate": "2016-05-04", "language": "en", "rating": 3}, {"id": 366918987, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d4469233-r366918987-Port_Olimpic-Barcelona_Catalonia.html", "text": "I stayed on a boat in this port and loved it.\nIt has a casino, restaurants, bars and the beach on your doorstep. It is also very close to the city centre but if you don't fancy walking then the city sightseeing bus stops on the nearby main road and there are taxis outside the casino. \nIf you are staying on one of the boats there is a shower and toilet block.\n", "publishedDate": "2016-04-24", "language": "en", "rating": 5}, {"id": 364744865, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d4469233-r364744865-Port_Olimpic-Barcelona_Catalonia.html", "text": "The Port Olimpic is a brilliant place to plan a morning run through or conversely, a leisurely weekend stroll stopping in at some of the eateries along the way. Expect to spend about 30 minutes - 1 hour strolling along the Port Olimpic plus any additional time for any stops that you may plan. You will get some really nice marina photos so make sure you bring a camera. The Port will eventually lead on towards the Bogatell Beach which is another worthwhile stop in the area.", "publishedDate": "2016-04-16", "language": "en", "rating": 5}, {"id": 364101852, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d4469233-r364101852-Port_Olimpic-Barcelona_Catalonia.html", "text": "Loved this area of Barcelona, the beach is beautiful, lots of good restaurants and a nice boardwalk for strolling. The views are amazing!", "publishedDate": "2016-04-14", "language": "en", "rating": 5}, {"id": 360863433, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d4469233-r360863433-Port_Olimpic-Barcelona_Catalonia.html", "text": "Rented a 53\" boat to stay in here. Loved the whole experience; the boat, the location, the bars and restaurants.\nJust 10 minutes walk from the city centre too. The Barcelona Tour bus stops at the entrance to the port too.\n\nGreat to see some of the yachts in the Marina and there is a well appointed shower block accessible only by residents.\n\nIt is a little noisy until 5:00am but I just made sure I went to bed with a full belly and some wine and I managed to sleep through.\n\nI wouldn't personally advise anyone to go wandering around the surrounding area late at night... Stay in the Marina or your boat. I went for a walk at about 4:00 am one morning and it was an eye opener!\n\nI would advise this if you're adults and can cope with the party lifestyle.", "publishedDate": "2016-04-02", "language": "en", "rating": 5}, {"id": 358107435, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d4469233-r358107435-Port_Olimpic-Barcelona_Catalonia.html", "text": "Yup...a beautiful view of the parked Yatchs, a great promenade to walk,  best clubs in town, gourmet restaurants and....the Barcelona Casino.\n\nThis place has it all. You cannot miss this place during your Barcelona trip. A must go place. \n\nPS: you can even rent a segway or an electric cycle and have an awsome spin..", "publishedDate": "2016-03-24", "language": "en", "rating": 5}, {"id": 358015458, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d4469233-r358015458-Port_Olimpic-Barcelona_Catalonia.html", "text": "We were staying near Port Olimpic while in Barcelona and walked over for dinner at different restaurants every night. All day and late into the night, this area is alive with activity. The picturesque harbor loaded with sailboats makes a wonderful dining backdrop.", "publishedDate": "2016-03-23", "language": "en", "rating": 4}, {"id": 355369284, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d4469233-r355369284-Port_Olimpic-Barcelona_Catalonia.html", "text": "Lovely place with a beach, skyscrapers, marina and restaurants. Great upbeat feel around this place, I recommend walking from Port Olympic all the way to Port Veill and Colombus Monument! Great walk! ", "publishedDate": "2016-03-14", "language": "en", "rating": 5}, {"id": 355004362, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d4469233-r355004362-Port_Olimpic-Barcelona_Catalonia.html", "text": "Thoroughly enjoyed this area of the city, especially being able to photograph the scenery. This is a quick trip and we saw all there was to see in the port after 10 minutes or so. Great to walk along the coastline in Barceloneta once you've finished your time at the port. ", "publishedDate": "2016-03-13", "language": "en", "rating": 5}, {"id": 353590420, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d4469233-r353590420-Port_Olimpic-Barcelona_Catalonia.html", "text": "This is a nice port for power boats and yachts which is surrounded by places to eat as well as a burger king being there with Wifi, nice area to walk around and the beach is nice and clean.", "publishedDate": "2016-03-07", "language": "en", "rating": 4}, {"id": 352974308, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d4469233-r352974308-Port_Olimpic-Barcelona_Catalonia.html", "text": "A must when visiting Barcelona to escape the major hustle and bustle although it can get quite busy, a stroll along the promenade and take in the sea air and you'll soon forget your in a major city, there's a coffee shop located under the first of the 2 towers next to the casino which is fab for a coffee and a rest (2.20) for 2 Americanos, you can walk for miles along the promenade and there's plenty of restaurants to choose from or stroll along the beach", "publishedDate": "2016-03-04", "language": "en", "rating": 4}, {"id": 349494736, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d4469233-r349494736-Port_Olimpic-Barcelona_Catalonia.html", "text": "Very nice area of Barcelona although quite touristy. \n\nSome fantastic restaurants as well as night life and Irish bars.\n\nExperience live music, good seafood and lovely views. \n\nRight near the beach and casino. ", "publishedDate": "2016-02-20", "language": "en", "rating": 4}, {"id": 347431280, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d4469233-r347431280-Port_Olimpic-Barcelona_Catalonia.html", "text": "Modern complex with many hotels, bars and restaurants. Many of these places are fancy and high class.", "publishedDate": "2016-02-13", "language": "en", "rating": 4}, {"id": 342890946, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d4469233-r342890946-Port_Olimpic-Barcelona_Catalonia.html", "text": "Great place to walk and relax.\nAmuse at the development of this part of this city as you see the old photos.\nSome good restaurants here and cafes to choose from.\nWorth the walk.", "publishedDate": "2016-01-26", "language": "en", "rating": 3}, {"id": 339967041, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d4469233-r339967041-Port_Olimpic-Barcelona_Catalonia.html", "text": "The Olympic Harbor is very nice marina just east of the Barcelona’s port. It was opened in 1991 and hosted the sailing events during the Summer Olympic Games in 1992. Thanks to the beautiful weather, I spent an entire autumn afternoon enjoying the sea view and scent.", "publishedDate": "2016-01-14", "language": "en", "rating": 4}, {"id": 325483215, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d4469233-r325483215-Port_Olimpic-Barcelona_Catalonia.html", "text": "We were staying at the Hotel Arts so we were right by the beach. The weather was so good we spent the day we were leaving by the beach. There were lots of places to eat which were reasonably priced, even a Burger King and macdonalds.  Lots of people playing volleyball so we just chilled after 2 previous full on days and late nights", "publishedDate": "2015-11-09", "language": "en", "rating": 5}, {"id": 325014848, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d4469233-r325014848-Port_Olimpic-Barcelona_Catalonia.html", "text": "We only found this port on our stay in Barcelona because of the Barcelona bus city tour. It is a great port with many bars, restaurants and nightlife. Although most of the restaurants were seafood restaurants but if you like that then its great. Also a lot of shisha bars which we weren't keen on. But other then that we were so glad we found this spot to go to in the evenings as before then we were struggling to find lively places to go at night, has some great bars, a casino and as far as I know three great clubs. Pacha, Opium and Shoko, we went to both Pacha and Shoko and both were really good nights, 10euro entry with a free drink. Also next to the port is a lovely beach which had plenty of sunbeds which you did have to pay for but many other beaches nearby didn't have any sunbeds. Also had a few beach bars which had good food and drinks and the bar men would serve you from your sunbeds.", "publishedDate": "2015-11-07", "language": "en", "rating": 5}, {"id": 322355075, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d4469233-r322355075-Port_Olimpic-Barcelona_Catalonia.html", "text": "there are muscular man ski and trained at the beach that you will love to stay. those bars and restaurant is nice but a bit too commercial.", "publishedDate": "2015-10-27", "language": "en", "rating": 3}, {"id": 320761460, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d4469233-r320761460-Port_Olimpic-Barcelona_Catalonia.html", "text": "This is a go-to place if you are after a fantastic night life in Barcelona. There is everything here: Beach, Clubs, Shisha, Casino. I went during September so everything was open till late hours of the morning and it was a very energetic place. There are some of the known clubs such as catwalk a few others that are boardering with the beach, however you must cross the bridge to get on to the other side to where there is a sign of Port Olympicia to really witness the energy.", "publishedDate": "2015-10-21", "language": "en", "rating": 5}, {"id": 320208710, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d4469233-r320208710-Port_Olimpic-Barcelona_Catalonia.html", "text": "Lovely Area Day and Night, had meals during day time in a really nice area of Barcelona and at night it comes alive! Opium was great! ", "publishedDate": "2015-10-19", "language": "en", "rating": 5}, {"id": 319811951, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d4469233-r319811951-Port_Olimpic-Barcelona_Catalonia.html", "text": "Even in october this beach is full of tourists playing volleyball and enjoying sitting on the  soft sand. Too cold to swim by now though. Bars are littered along the beach strip so if you ever crave a pint it's always a short walk. Beach is easily accesible by multiple bus routes or even by cable car from Tibidabo mountain (although this is overpriced and not very scenic).", "publishedDate": "2015-10-18", "language": "en", "rating": 4}, {"id": 309238299, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d4469233-r309238299-Port_Olimpic-Barcelona_Catalonia.html", "text": "Great walk. LOTS of great restaurants - too many to choose from.If you love water sports, this is the place to find the tour companies.", "publishedDate": "2015-09-11", "language": "en", "rating": 4}, {"id": 307503226, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d4469233-r307503226-Port_Olimpic-Barcelona_Catalonia.html", "text": "This is a nice area with many restaurants , pubs and outdoor areas to wander around, also a nightclub if you are in that age group.", "publishedDate": "2015-09-06", "language": "en", "rating": 4}, {"id": 302097328, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d4469233-r302097328-Port_Olimpic-Barcelona_Catalonia.html", "text": "If you ever visit Barcelona make sure to visit Port Olimpic. There are ton's of shisha places and food. What I really liked about Port Olimpic is the food is gourmet and there are also 2 club's nearby. A very convenient place for a good night out.", "publishedDate": "2015-08-22", "language": "en", "rating": 4}, {"id": 298181141, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d4469233-r298181141-Port_Olimpic-Barcelona_Catalonia.html", "text": "Nice place to spend the evening! Nice restaurants, yachts, figure of the whale and the view of W hotel. Mapfre tower is nice", "publishedDate": "2015-08-11", "language": "en", "rating": 5}, {"id": 296150773, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d4469233-r296150773-Port_Olimpic-Barcelona_Catalonia.html", "text": "We went to visit the beach.  The water was lovely, but the sand was littered with cigarettes and peanut shells.  Not like the beaches I have visited.  Not to mention it was very busy.  After, we went to find a place to eat and the restaurants down below are like a sales pitch every 10 feet!  It felt like I just left a cruise ship and was repulsed by all of the waiters trying to lure me into their restaurant.  We immediately left.", "publishedDate": "2015-08-05", "language": "en", "rating": 3}, {"id": 286069706, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d4469233-r286069706-Port_Olimpic-Barcelona_Catalonia.html", "text": "Absolutely beautiful and worth visiting. The view of the yachts on the water is striking! Also visited the Maramagnum which had great shopping with good restaurants ", "publishedDate": "2015-07-06", "language": "en", "rating": 5}, {"id": 283778665, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d4469233-r283778665-Port_Olimpic-Barcelona_Catalonia.html", "text": "Lovely beach in Barcelona. Nice place to enjoy. Peaceful than Barceloneta Beach. Very near to City centre.", "publishedDate": "2015-06-28", "language": "en", "rating": 5}, {"id": 283327064, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d4469233-r283327064-Port_Olimpic-Barcelona_Catalonia.html", "text": "At Port Olympic, you have numerous options for shopping and dining, plus a beautiful beach to look at. We chose to eat a light meal at a beach bar while watching the waves and beachgoers. With lots of umbrellas for shade, this is a great place to kick back, have some cava or sangria and enjoy a lazy afternoon.   ", "publishedDate": "2015-06-27", "language": "en", "rating": 5}]}}]