[{"locationId": 244903, "name": "Teatre Poliorama", "placeType": "ATTRACTION", "reviewListPage": {"reviews": [{"id": 625975835, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d244903-r625975835-Teatre_Poliorama-Barcelona_Catalonia.html", "text": "We had an excellent time. Tickets were easy to find and the location of the theater was great. More importantly, the show was high quality. Fine dancers, singers and musicians for 1.5 hours. Perfect to taste flamenco. ", "publishedDate": "2018-10-17", "language": "en", "rating": 5}, {"id": 612924632, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d244903-r612924632-Teatre_Poliorama-Barcelona_Catalonia.html", "text": "Unforgetable impression, strong, passionate, sensual, professional performance, beautiful music, great musicians and dancers. Fantastic. I would really recommend.", "publishedDate": "2018-09-01", "language": "en", "rating": 5}, {"id": 526085134, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d244903-r526085134-Teatre_Poliorama-Barcelona_Catalonia.html", "text": "The singers were ok and poorly amplified - better heard through earplugs. and some of the dancing was excellent.  The musicians were good. \nAt 40 euros for an hours show it was too expensive,  even for the over-commercialised Ramblas. ", "publishedDate": "2017-09-20", "language": "en", "rating": 3}, {"id": 501282430, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d244903-r501282430-Teatre_Poliorama-Barcelona_Catalonia.html", "text": "Stopped here for a guitar and flamenco show.  The auditorium was small so the seats are all good.  We were fortunate to sit close the the front.  The guitarists were truly skilled and the singer and dancer, were amazingly expressive and passionate.  The show was much more guitar than flamenco, I would have preferred a better mix.  ", "publishedDate": "2017-07-12", "language": "en", "rating": 4}, {"id": 493899497, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d244903-r493899497-Teatre_Poliorama-Barcelona_Catalonia.html", "text": "Not a play but more than an hour long quiz game to be resolved by the audience, where you either escape or die, according to their advertising campaign. There are several tests to be completed on cities or the word, movie productions, etc. The final objective is to figure out the secret combination to the lock which opens a wooden box provided to each two people sitting together, with either a whistle or a paper with instructions to scream at the end of the show inside. Definitely a very low budget production, with only three actors on stage and a very-low resolution screen where instructions for each quiz are given. Last, even if you have been handling the provided items all night, everything is to be returned at the end of the show (the wooden box, its lock and even a cheap pen provided), except for the whistle. Quite long and disappointing.", "publishedDate": "2017-06-18", "language": "en", "rating": 2}, {"id": 419526195, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d244903-r419526195-Teatre_Poliorama-Barcelona_Catalonia.html", "text": "If you like real opera and enjoy hearing the human voice without amplification, avoid this show.  Everything is miked, the two opera singers (soprano and tenor) were downright horrible, and the operatic selections bore little or no relation to the flimsy story the show attempted to tell.  The three flamenco dancers - one female, two male - were impressive.  The musicians and other singers were okay, though the amplification seemed unnecessary.  Had our schedule permitted, I would have chosen to attend the \"Gran Gala Flamenco\" show that the same company puts on in a different and - judging from the photo in the brochure - much nicer theater and without some misunderstood operatic arias.", "publishedDate": "2016-09-17", "language": "en", "rating": 3}, {"id": 418320363, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d244903-r418320363-Teatre_Poliorama-Barcelona_Catalonia.html", "text": "All right, so locals and tourists will tell you that Flamenco is not what it used to be in the good old days, or that opera and flamenco don't jell, whatever..... If you're a first timer in Barcelona like we were, then a flamenco evening is a must and we thoroughly enjoyed ours at the Teatre Poliorama. We were given a good discount and, when we realized our view was obstructed by some burly men in front of us, the staff were so prompt in letting us move to the front at no extra charge before the show started. We thoroughly enjoyed the GranGala Flamenco. The opera had a Moroccan/Algerian music touch, the guitar was fabulous and the dancers, (especially the long-haired man) were simply exquisite. See any flamenco but do see one, and the Teatre Poliorama does not disappoint. \n\nTip: Use a proper DSLR camera without flash and without backlight LED (never a smartphone) to click pics in the interludes so you don't bother people around you.", "publishedDate": "2016-09-13", "language": "en", "rating": 5}, {"id": 412380998, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d244903-r412380998-Teatre_Poliorama-Barcelona_Catalonia.html", "text": "This was a waste of precious time in my Barcelona visit. I have seen much better flamenco dancing and heard much better opera singing. The theatre building is a stunning piece of architecture inside which is a modern seating plan with absolutely no atmosphere. There are no other facilities within, you can't even buy a drink. There are numerous venues showing flamenco music and dance. ", "publishedDate": "2016-08-29", "language": "en", "rating": 2}, {"id": 403370540, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d244903-r403370540-Teatre_Poliorama-Barcelona_Catalonia.html", "text": "Flamenco!\nI had not expected such a show.\nFeating Chicuelo on amazing, absolute world class spanish guitar, the dancers were literally giving 200%! The whole band and dancers delivered amazing dynamics and on beat flamenco. This was worth every minute. A memory for life.\n\n", "publishedDate": "2016-08-09", "language": "en", "rating": 5}, {"id": 361146480, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d244903-r361146480-Teatre_Poliorama-Barcelona_Catalonia.html", "text": "Though the combination of Opera and Flamenco seemed incongruous,  the fact that we were in the heart of Spain and Flamenco’s birthplace was sufficient to counter any doubts, so we reserved tickets for what we thought would be a performance at the Palau de la Musica – our first disappointment.  The photograph on the booking site had set the dancers against a backdrop of the instantly recognisable glass ceiling of the Palau, but the performance for that night was in Teatre Poliorama, which is half the size and was half full.  Nevertheless, determined to enjoy the show and impressed by the first singers and dancers, we sat back and waited for the opera singers to do their thing.    \n\nMy first thought was \"Thank god we are not sitting under a glass roof\".  My second was \"Did he just sing a Puccini aria?\"  When I heard my daughter’s stifled sniggers harmonising with a group of people sitting behind us, I knew that I was not alone.\n\nFrom here the audience was hauled along a nauseous roller coaster of heady Flamenco moments and the depths of embarrassing mismanaged warbling.  The Stage management, worse than a bad school nativity play, included highlights such as watching one of the dancers change behind a flimsy screen on stage, while another climbed up on a box and then climbed back down.  At one point it was clear that the second of the male dancers, whose day job must have eating too many Tapas, had forgotten that he was due back on.  As a consequence the excellent first dancer was forced to improvise a very obvious solo duo, while the singer repeated, albeit with a beautiful voice, « Yes, you can dance, keep on dancing … »  Then, after barely an hour, just when we thought that an interval and drink were due, they took a bow and offered an unasked for encore.  \n\nIn the interests of health and safety my daughter and I left before the encore aria, but outside on the pavement our laughter quickly transformed into anger.  Does playing to tourists give performers and their managers the right to abuse their intelligence, taste and hard-earned cash?  Does the fact that tourists are just passing through really mean that the quality of what they pay for is irrelevant?  Visitors are told to hang onto their bags and watch out for pickpockets, but nothing in their guidebook warns them about this kind of blatant theft.\n\nTo conclude, I am writing this review in the interests of anyone who might be thinking of spending 35 euros or more to see Opera y Flamenco.  Don’t.  I suspect that the GranGala Flamenco, performed in the Palau de la Musica and including the best performers from Opera y Flamenco - but NOT the opera singers – will be at least 50% better.  If you are determined to hear and see Flamenco on a large stage, my advice is that you should go there, but anything that purports to blend opera with Flamenco in Barcelona, is to be avoided like the plague, or a mugger.", "publishedDate": "2016-04-03", "language": "en", "rating": 1}, {"id": 355060200, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d244903-r355060200-Teatre_Poliorama-Barcelona_Catalonia.html", "text": "A small theater on La Rambla, which is easy to find, and we really enjoyed our first experience of flamenco. The musicians and singers were all good, and I couldn't take my eyes off the dancers! They were superb! I would recommend this show to all.", "publishedDate": "2016-03-13", "language": "en", "rating": 5}, {"id": 308800932, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d244903-r308800932-Teatre_Poliorama-Barcelona_Catalonia.html", "text": "We managed to get catch of the shows here while in Barcelona.  No doubt that it doesn't have the avant-garde architectural designs like most theaters in Europe, but it definitely serves its purpose of featuring some of the best shows which is Barcelona y Flamenco.  \n\nIf you are in La Rambla area, check out this theater and catch a show, if time permits.  ", "publishedDate": "2015-09-09", "language": "en", "rating": 4}, {"id": 305965047, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d244903-r305965047-Teatre_Poliorama-Barcelona_Catalonia.html", "text": "No one performs there, everyone lives on stage!\nHighly recommend to visit Flamenco show!!! excellent costumes and we didn't notice how time passed!", "publishedDate": "2015-09-01", "language": "en", "rating": 5}, {"id": 304041937, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d244903-r304041937-Teatre_Poliorama-Barcelona_Catalonia.html", "text": "The two men-dancers told the story with engagement to the fullest (5stars) but the rest of the crew looked either bored or newbies. \nThe live singers volume level was very unstable- either they song to near the microphone (too loud) or not at all (too low)...\nMissing the authentic surroundings and the lack of engagement I wouldn't say it's 40€ worth. ", "publishedDate": "2015-08-27", "language": "en", "rating": 3}, {"id": 275948618, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d244903-r275948618-Teatre_Poliorama-Barcelona_Catalonia.html", "text": "I saw the GranGala Flamenco show here whilst on holiday.  It was a spur of the moment decision as I passed the tourist information centre.\n\nThe dancers were very good, however the drummer looked bored, and at one point when one of the dancers took over the stage and danced for ages the other dancers were nudging one another and shuffling about like he was acting like a prima donna or something.  I wasn't sure what that was about but it didn't look very professional.\n\nI also thought that at 40 euros it was a lot as the show only lasted one hour.  I'd have expected a lot more for my money.\n\nBut, that said, the flamenco was incredible to watch, very talented performers.  If I was to see another flamenco show in Barcelona I'd probably shop around a bit more though.", "publishedDate": "2015-05-31", "language": "en", "rating": 4}, {"id": 243450011, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d244903-r243450011-Teatre_Poliorama-Barcelona_Catalonia.html", "text": "A very nice and centric theatre near Plaça Catalunya. The show \"Polònia, el Musical\" was fun and worth seeing", "publishedDate": "2014-12-08", "language": "en", "rating": 5}, {"id": 242669663, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d244903-r242669663-Teatre_Poliorama-Barcelona_Catalonia.html", "text": "\nThis theatre was next to our hotel (Royal Ramblas).  It was a wonderful show of flamenco and Opera, superb dancing and singing.  We had a meal elsewhere first but you can book dinner and a show.  The architecture was stunning.", "publishedDate": "2014-12-03", "language": "en", "rating": 5}, {"id": 161468217, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d244903-r161468217-Teatre_Poliorama-Barcelona_Catalonia.html", "text": "we enjoyed the opera and flamenco show experience , the show was great , the artists very talented, the theatre is located in the La Rambla area.", "publishedDate": "2013-05-22", "language": "en", "rating": 5}, {"id": 146542996, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d244903-r146542996-Teatre_Poliorama-Barcelona_Catalonia.html", "text": "a cosy theatre and we bought tickets on the spur of the moment one afternoon for the evening show, each 38E, and we were seated 4  rows from the front. Seats are comfortable, lighting good and acoustics good.\nthe Flamenco show was entertaining and the actors/ entertainers pulled out all the stops. Great dancing and music, and a lovely array of Flamenco costumes and styles. The show was told as a story and good fun. There is an intermission to get refreshments", "publishedDate": "2012-12-01", "language": "en", "rating": 4}]}}]