[{"locationId": 1493833, "name": "Fundacio Sunol", "placeType": "ATTRACTION", "reviewListPage": {"reviews": [{"id": 604354965, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d1493833-r604354965-Fundacio_Sunol-Barcelona_Catalonia.html", "text": "Anotherexcellent gallery with quite specialist works. Again like it or not it has to be appreciated. I loved it others may hate it. The staff were exceptional and very happy to help / advise. Beautifully displayed in a beautiful building and location", "publishedDate": "2018-08-08", "language": "en", "rating": 5}, {"id": 422543556, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d1493833-r422543556-Fundacio_Sunol-Barcelona_Catalonia.html", "text": "This is a museum of contemporary art, the 1960's onwards, on display on the Passeig de Gracia in Barcelona.  It is close to La Pedrera and the back of this building can be seen from the terrace of the Fundacio.\n\nThe collection of about 1,200 is rotated so not all is on display at the one time.  Mostly it is Spanish artists.  The works are laid out over two small floors.  It is a more compact and better collection than that of the city's own Contemporary art, MACBA.\n\nIf you have the Barcelona card the entrance price is reduced.", "publishedDate": "2016-09-26", "language": "en", "rating": 3}, {"id": 253539800, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d1493833-r253539800-Fundacio_Sunol-Barcelona_Catalonia.html", "text": "Opened originally in 2007, two floors of a contemporary art collection of businessman Josep Sunol. There are at least 100 piece of arts on display. Also includes some historic and predominant Catalan and Spanish artists work.", "publishedDate": "2015-02-10", "language": "en", "rating": 4}, {"id": 213638397, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d1493833-r213638397-Fundacio_Sunol-Barcelona_Catalonia.html", "text": "This is a private collection of mostly Spanish and Catalan art from the 1950s through the 1990s. It's of excellent quality and beautifully installed. The foundation is housed in a Modernista building redecorated inside in a Minimalist white box style that nonetheless preserves the scale of the typical 19th century architecture. It has a gorgeous terrace and there they hold innovative contemporary art exhibitions. Besides the collection of Mr. Sunol, they hold great temporary shows (now there's a retrospective of the sculpture Susana Solano).", "publishedDate": "2014-07-04", "language": "en", "rating": 5}, {"id": 202832934, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d1493833-r202832934-Fundacio_Sunol-Barcelona_Catalonia.html", "text": "If you're looking for contemporary art in Barcelona one of the best districts is Eixample. A good starting point is the Suñol Foundation with its art collection in 2 floors. The collection is interesting, the personnel friendly and there you can also get a free map to 37 galleries, art foundations, centers and museums exhibiting contemporary art in the area (\"Circuit d'Art Contemporari de Barcelona\").", "publishedDate": "2014-04-26", "language": "en", "rating": 4}, {"id": 178604377, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d1493833-r178604377-Fundacio_Sunol-Barcelona_Catalonia.html", "text": "Though it's small, the collection amassed by the founder is truly remarkable! Warhol, Picasso, Man Ray, Tapies, Avedon etc. good value, too!", "publishedDate": "2013-09-25", "language": "en", "rating": 4}, {"id": 123167341, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d1493833-r123167341-Fundacio_Sunol-Barcelona_Catalonia.html", "text": "A total contrast with everything else we saw and one of teh best value at 5 euros per person.  helpful staff had info in several languages for the permanent collection and some of the temporary exhibits.  Glad we came across this gallery.", "publishedDate": "2012-01-16", "language": "en", "rating": 4}]}}]