[{"locationId": 2366700, "name": "Torre Agbar", "placeType": "ATTRACTION", "reviewListPage": {"reviews": [{"id": 735351628, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d2366700-r735351628-Torre_Agbar-Barcelona_Catalonia.html", "text": "Saw it from the top of the viewing platform on the fantabulous bullring shopping mall and it looks amazing and weirdly look like the gherkin in London.", "publishedDate": "2019-12-29", "language": "en", "rating": 5}, {"id": 733533097, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d2366700-r733533097-Torre_Agbar-Barcelona_Catalonia.html", "text": "We were very lucky to have a fabulous view of the Torre Agbar from our hotel room at the Novotel Barcelona City. The lights are a tribute to Gaudi and his architectural work. The building had reflections of blue and red during the day and during the evening lights up with Ange of colours as seen in the stain glass windows of the Sagrada la Família. ", "publishedDate": "2019-12-18", "language": "en", "rating": 5}, {"id": 733039575, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d2366700-r733039575-Torre_Agbar-Barcelona_Catalonia.html", "text": "A very cool building in Barcelona!!!  Very different to all of the other buildings in the city.  A modern building amongst all the history.  Very cool at night with the lights and colour.", "publishedDate": "2019-12-16", "language": "en", "rating": 5}, {"id": 728835427, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d2366700-r728835427-Torre_Agbar-Barcelona_Catalonia.html", "text": "An icon building that you will notice from all over the city. It's more mesmerizing at the night time with lights and colors.", "publishedDate": "2019-11-25", "language": "en", "rating": 5}, {"id": 725939889, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d2366700-r725939889-Torre_Agbar-Barcelona_Catalonia.html", "text": "Stepping out of the Glories metro station, this tall unique looking building stood staring at us. With it's multi-color lighting combination, it definitely stood apart from any other building around. It was quite windy out there. We enjoyed spending some time around, in the vicinity of this unique and differently lit building.", "publishedDate": "2019-11-12", "language": "en", "rating": 4}, {"id": 690176342, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d2366700-r690176342-Torre_Agbar-Barcelona_Catalonia.html", "text": "We got off the hop on and hop off and said look at the cool building.\nDidn't even realize it was a stop.\nVery different and colorful by night.", "publishedDate": "2019-07-16", "language": "en", "rating": 4}, {"id": 689041339, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d2366700-r689041339-Torre_Agbar-Barcelona_Catalonia.html", "text": "This building is like the Barcelona version of the Gherkin in London. The Torre Agbar is much like the Gherkin in shape, it’s a distinctive piece of contemporary architecture that stands out in a relatively open area. The coloured square panes that cover the exterior is a mixture of red and blue shades that remind me of the sunset or sunrise. The colours of the building are further accentuated by the nocturnal illumination.\n\nDefinitely worth coming here both night and day to see the contrast.", "publishedDate": "2019-07-12", "language": "en", "rating": 4}, {"id": 676768193, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d2366700-r676768193-Torre_Agbar-Barcelona_Catalonia.html", "text": "During the day, it’s a nice building, very tall and big and you can get some nice photos of this architecture. But at night, it’s even more impressive, because it lights up completely! Beautiful!", "publishedDate": "2019-05-27", "language": "en", "rating": 5}, {"id": 674756170, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d2366700-r674756170-Torre_Agbar-Barcelona_Catalonia.html", "text": "The tower, now also known as the Torre Glories, stands at the gateway to the new technological quarter of Barcelona, a fast-growing area of regeneration with new buildings housing university departments, commercial companies and government agencies.  The scale and ambition of the regeration of this former industrial area is astonishing while several developments retain some of the old historic structures.\n\nI was there on one of Barcelona's rare days of torrential rain, and I did not linger to see the tower lit up at night, but what I saw of the quality of the regeration was impressive. ", "publishedDate": "2019-05-18", "language": "en", "rating": 4}, {"id": 660210901, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d2366700-r660210901-Torre_Agbar-Barcelona_Catalonia.html", "text": "We stayed near this building.  It's an office building so it's not open for public tours however when lit up at night, it is beautiful.   Most nights it was blue and red, however colors changed to purple for International Women's Day.   Nice landmark to point out from look out point at Carmel Bunker.", "publishedDate": "2019-03-21", "language": "en", "rating": 4}, {"id": 652917215, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d2366700-r652917215-Torre_Agbar-Barcelona_Catalonia.html", "text": "We stopped by when cycling back from camp nou. Got some good pics. Worth stopping off if you're passing, not sure if we'd make a special trip although it was nice to see it lit.", "publishedDate": "2019-02-17", "language": "en", "rating": 3}, {"id": 650480177, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d2366700-r650480177-Torre_Agbar-Barcelona_Catalonia.html", "text": "There’s nothing really going on with this building other than it’s architecture and when lite up at night no obsevjation deck just and office building and nice to view at night from a distance ", "publishedDate": "2019-02-06", "language": "en", "rating": 3}, {"id": 643519185, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d2366700-r643519185-Torre_Agbar-Barcelona_Catalonia.html", "text": "Unfortunately this building is just an office block and does not have an observation deck for views of the city. However, it has definitely got the wow factor and worth seeing for photos of it's exterior. It is truly an amazing piece of engineering brilliance. Not to be missed!", "publishedDate": "2019-01-04", "language": "en", "rating": 4}, {"id": 634483991, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d2366700-r634483991-Torre_Agbar-Barcelona_Catalonia.html", "text": "This building definitely stands out, especially at night.  The architecture is different from anything in the Surrounding area, it’s that different.  ", "publishedDate": "2018-11-19", "language": "en", "rating": 4}, {"id": 634377334, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d2366700-r634377334-Torre_Agbar-Barcelona_Catalonia.html", "text": "If your interested in Architecture then this is a buildng to see in Barcelona. Its just beautiful from up close and furrher away. Plus there are a few other gems around the area. The area is a developing down town with flashy office space and hotels.\nRight next to the tower is a design museum called Museu del Desinney, picture 2", "publishedDate": "2018-11-19", "language": "en", "rating": 4}, {"id": 632506664, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d2366700-r632506664-Torre_Agbar-Barcelona_Catalonia.html", "text": "Torre Agbar is intended to recall the shape of a geyser rising into the air. It was inspired by Montserrat, a mountain near Barcelona.\nA defining feature of the building is its nocturnal illumination.", "publishedDate": "2018-11-11", "language": "en", "rating": 4}, {"id": 629428253, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d2366700-r629428253-Torre_Agbar-Barcelona_Catalonia.html", "text": "Easy metro ride there but on a cloudy day it isn’t at its best. Nice enough building but not worth the visit to a built up part of town which is being developed further", "publishedDate": "2018-10-29", "language": "en", "rating": 3}, {"id": 622671957, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d2366700-r622671957-Torre_Agbar-Barcelona_Catalonia.html", "text": "Great piece of architecture, we stayed right next door for 5 nights and didn't really see anyone going in and out of the building but it was very pretty at night time.  A great part of the skyline in that are of Barcelona.", "publishedDate": "2018-10-06", "language": "en", "rating": 5}, {"id": 621229982, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d2366700-r621229982-Torre_Agbar-Barcelona_Catalonia.html", "text": "Nice,i read that is illuminated only friday,saturday and sunday but is very nice.I saw it by day and by night too.", "publishedDate": "2018-10-02", "language": "en", "rating": 5}, {"id": 620327738, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d2366700-r620327738-Torre_Agbar-Barcelona_Catalonia.html", "text": "Stunning day or night.  4500 windows of different colors.  It shines in the sunlight and glows at night.  Built in 2005 by French architect Jean Nouvel.  It resembles a babbling brook.  Unfortunately unless you know someone there you can't get in but by all means you need to see it both by day and night.  Part of a three hour architectural tour by a friend.  Look for reviews of other buildings.  Barcelona is full of reał gems.", "publishedDate": "2018-09-28", "language": "en", "rating": 5}, {"id": 591542971, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d2366700-r591542971-Torre_Agbar-Barcelona_Catalonia.html", "text": "This building is very different to most of the other ones in Barcelona,so it stands out from almost everywhere in the city.It is well worth seeing at night.It has 4000 glass window of all different colours There is another very similar one in St Petersburg right out near the cruise terminal which is privately owned by a family that deals in natural gas.", "publishedDate": "2018-06-28", "language": "en", "rating": 5}, {"id": 584358137, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d2366700-r584358137-Torre_Agbar-Barcelona_Catalonia.html", "text": "It is Barcelona and this building which is different fits in and if you like different architecture worth a visit.", "publishedDate": "2018-06-01", "language": "en", "rating": 3}, {"id": 582303849, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d2366700-r582303849-Torre_Agbar-Barcelona_Catalonia.html", "text": "It is a skyscraper worth seeing. Very impressive at night with the lights on! It is also very close to a subway station (Glòries) which was great!", "publishedDate": "2018-05-23", "language": "en", "rating": 5}, {"id": 572774688, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d2366700-r572774688-Torre_Agbar-Barcelona_Catalonia.html", "text": "Only saw this building during the day and couldn’t figure out what it was. Had to go online to discover that the architect intended it to recall the shape of a geyser. Brings to mind though an item of pleasure instead. This building cant be missed in Barcelona. It can be seen from most everywhere.", "publishedDate": "2018-04-11", "language": "en", "rating": 3}, {"id": 548996271, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d2366700-r548996271-Torre_Agbar-Barcelona_Catalonia.html", "text": "This is really a pretty neat building, I had seen it from several spots in the city so I headed that way.  It is huge, well worth seeing at night when it is lit up!", "publishedDate": "2017-12-24", "language": "en", "rating": 4}, {"id": 548165333, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d2366700-r548165333-Torre_Agbar-Barcelona_Catalonia.html", "text": "Just an important building with commercial activity with beautiful night lighting. Can be seen from any part of the city.", "publishedDate": "2017-12-19", "language": "en", "rating": 5}, {"id": 547566705, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d2366700-r547566705-Torre_Agbar-Barcelona_Catalonia.html", "text": "One of the most talked about buildings in Barcelona. The locals refer to it as the \"Big Pickle\" among many other names. It is a sight to see as the architecture is most unusual. We saw it in the day time but, at night it lights up in some spectacular colors. It is a wonderful landmark and can be seen from many places around the city. don't miss this one.", "publishedDate": "2017-12-16", "language": "en", "rating": 3}, {"id": 547378370, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d2366700-r547378370-Torre_Agbar-Barcelona_Catalonia.html", "text": "Very interesting building, beautiful to look at during the night when it’s lit in the Barcelona colors.\n\nUnique architecture and advanced building technology.", "publishedDate": "2017-12-15", "language": "en", "rating": 4}, {"id": 539217001, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d2366700-r539217001-Torre_Agbar-Barcelona_Catalonia.html", "text": "The building looks great, especially in the evening/night, unfortunately you cannot visit, it's closed. We have heard that there will be a 5 star hotel. Better to be some offices and also to have oportunity to see Barcelona from top.", "publishedDate": "2017-11-07", "language": "en", "rating": 3}, {"id": 534794274, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d2366700-r534794274-Torre_Agbar-Barcelona_Catalonia.html", "text": "Located on the Plaza Glories near the Glories station, the Tower is remarkable because of its unique shape said to be inspired from the rocks of the nearby Montserrat.\n\nThe round tower rises straight up from the ground and has an oval profile. It is a great sight during the day but really comes into its own at night when it, along with the nearby plaza is lighted up in a multitude of ever changing colors.\n\nDefinitely worth a short visit especially at night.", "publishedDate": "2017-10-21", "language": "en", "rating": 4}, {"id": 532623240, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d2366700-r532623240-Torre_Agbar-Barcelona_Catalonia.html", "text": "An interesting landmark, I guess, but without the ability to enter it hardly warrants getting closer than a few hundred yards to appreciate it for what it is.", "publishedDate": "2017-10-13", "language": "en", "rating": 2}, {"id": 530870918, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d2366700-r530870918-Torre_Agbar-Barcelona_Catalonia.html", "text": "This is a fuuny shaped office building which is not open to the public. It is worth looking at because of the pickle shape. It would be so much better if they allowed tourists to go to the deck on the roof. As it is a quick photo is about all you can do.", "publishedDate": "2017-10-07", "language": "en", "rating": 4}, {"id": 530198181, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d2366700-r530198181-Torre_Agbar-Barcelona_Catalonia.html", "text": "Could this building be any cooler.\nIt caught our attention the first time we passed it.\nYou have to see it at night as the colors change.", "publishedDate": "2017-10-05", "language": "en", "rating": 5}, {"id": 526490366, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d2366700-r526490366-Torre_Agbar-Barcelona_Catalonia.html", "text": "We drove pass at night from the airport and it was all lit up. We got in from Dubai and it reminded me somewhat of the Burj al Arab. We used this land mark to get back to our hotel when on foot. This seems more modern compared to gaudi's architectural master sagrada familia. ", "publishedDate": "2017-09-22", "language": "en", "rating": 3}, {"id": 520131985, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d2366700-r520131985-Torre_Agbar-Barcelona_Catalonia.html", "text": "It is a new modern design building. We didn't get inside. Outside it reminds me the 30 St Mary Axe in London. Nothing special in daylight, I think that at the night it will be better. All the other popular attractions are far away, So don't go there if you have nothing to do.", "publishedDate": "2017-08-31", "language": "en", "rating": 3}, {"id": 516357334, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d2366700-r516357334-Torre_Agbar-Barcelona_Catalonia.html", "text": "Nice building. Very modern. But in the city of Barcelona, a bit out of place. Nothing you do except for watch it.", "publishedDate": "2017-08-22", "language": "en", "rating": 3}, {"id": 515105074, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d2366700-r515105074-Torre_Agbar-Barcelona_Catalonia.html", "text": "Wanted to see it up close as it is one of the famous buildings in Barcelona.The building is impressive and creative . It looks like standing alone dwarfing other buildings around.The concept and the execution is superb.The coloured window panes add to the beauty of the building .Although the space utilization due to the round shape of the building will be an issue.I hear that the building has changed hands many times.\nI still consider it as a landmark for Barcelona and the city should do its best to preserve it.", "publishedDate": "2017-08-19", "language": "en", "rating": 5}, {"id": 514008251, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d2366700-r514008251-Torre_Agbar-Barcelona_Catalonia.html", "text": "Next to the Torre Agbar is the Diagonal Hotel with a rooftop bar. Great view of this structure and lovely views of tree lined streets. ", "publishedDate": "2017-08-16", "language": "en", "rating": 5}, {"id": 511940323, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d2366700-r511940323-Torre_Agbar-Barcelona_Catalonia.html", "text": "A great building that can be seen from far away. Up close you can see the different colours. You can't go in. Metro station is Glories. Only visit if in the area......Nothing special. Visited during the day and at night. Wanted to see it lit up but it didn't happen. ", "publishedDate": "2017-08-12", "language": "en", "rating": 3}, {"id": 509852785, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d2366700-r509852785-Torre_Agbar-Barcelona_Catalonia.html", "text": "Worth a visit, including Gloria. Great for a Sunset. Not much to do except for some great shopping in the area. ", "publishedDate": "2017-08-07", "language": "en", "rating": 5}, {"id": 509228078, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d2366700-r509228078-Torre_Agbar-Barcelona_Catalonia.html", "text": "Located a little bit far away from the city centre so I would suggest visiting only if you are somewhere near or if you have a lot of time. It's nothing very special, just a commercial building, but its shape and size are exceptional in that area,", "publishedDate": "2017-08-06", "language": "en", "rating": 4}, {"id": 497992004, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d2366700-r497992004-Torre_Agbar-Barcelona_Catalonia.html", "text": "Good colour changing sky scrapper in Barclays. Can be seen from quite far and worth a look in the dark. ", "publishedDate": "2017-07-02", "language": "en", "rating": 4}, {"id": 495624309, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d2366700-r495624309-Torre_Agbar-Barcelona_Catalonia.html", "text": "What I like most is the architecture of Torre Agbar. It is also very pretty at night when lit up. I would visit if in the area. ", "publishedDate": "2017-06-24", "language": "en", "rating": 5}, {"id": 494508127, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d2366700-r494508127-Torre_Agbar-Barcelona_Catalonia.html", "text": "Usefull as a landmark. May look gorgeous at night time with its changibg colour patterns. \n\nMostly buildings like this tell people that there is sone kind of financial district ahead and there is unlikely to be any reason to go any closer to it.", "publishedDate": "2017-06-20", "language": "en", "rating": 2}, {"id": 492024177, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d2366700-r492024177-Torre_Agbar-Barcelona_Catalonia.html", "text": "We stayed at Four Point Sheraton which is only blocks from this building. The good part is we can  be anywhere in the city, if we look up, we know exactly where our hotel is just by searching the skyline for Torre Agbar. Line 1 of the Metro get off at Glories Station, you will be at the foot of this tower. Glories district is nice. It has the film museum. Carrefour supermarket and a fairly new food court are nearby.  ", "publishedDate": "2017-06-10", "language": "en", "rating": 3}, {"id": 481500134, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d2366700-r481500134-Torre_Agbar-Barcelona_Catalonia.html", "text": "Its a good reference point if walking around that part of town, but it looked nothing like the colourful night pictures I've seen on TA.  During the day it looked very grey & pretty dull. I can see why its called the suppository!  At least the gherkin in london has patterned windows making it more interesting.  Certainly not something I'd go specifically to see when in Barcelona!", "publishedDate": "2017-05-04", "language": "en", "rating": 3}, {"id": 476718817, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d2366700-r476718817-Torre_Agbar-Barcelona_Catalonia.html", "text": "The Agbar tower is visible from many places in the city.  We went to the design museum and it is close by to that.   We like it and have seen it at night. The colours change at night because it has literally 1000s of LED lights and it does look good then.  But with the sun shining it was quite colourful during the day.", "publishedDate": "2017-04-18", "language": "en", "rating": 4}, {"id": 475728783, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d2366700-r475728783-Torre_Agbar-Barcelona_Catalonia.html", "text": "Let´s be honest: Torre Agbar is ugly.  It´s an interesting point of reference to note from another spot, such as the parks above this city, but up close it`s pretty bland.  I did not see it at night, so perhaps it is more of a site worth seeing then.  If you happen to walk by it on your way to something else, it´s worth noting, but I wouldn´t go out of your way to see it.", "publishedDate": "2017-04-15", "language": "en", "rating": 3}, {"id": 475448577, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d2366700-r475448577-Torre_Agbar-Barcelona_Catalonia.html", "text": "It's better to see it by the distance, from Park Güell, for example. If you want to get inside it could be tricky to do it... Better at night, of course", "publishedDate": "2017-04-13", "language": "en", "rating": 2}, {"id": 475394462, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d2366700-r475394462-Torre_Agbar-Barcelona_Catalonia.html", "text": "Looked a bit like the Gerkin in London but the unusual double glass layers made it look unfinished or skeletal. Unfortunately didnt get to see it lit up at night as we visited in teh day time.", "publishedDate": "2017-04-13", "language": "en", "rating": 3}, {"id": 473936675, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d2366700-r473936675-Torre_Agbar-Barcelona_Catalonia.html", "text": "During the day it is a pretty standard building, but worth seeing at night when its all illuminated!", "publishedDate": "2017-04-09", "language": "en", "rating": 3}, {"id": 473234906, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d2366700-r473234906-Torre_Agbar-Barcelona_Catalonia.html", "text": "It's like marmite, you'll love or loath. It's a grey steel and glass phallus by day. But at night they light it up. It's spectacular.", "publishedDate": "2017-04-06", "language": "en", "rating": 4}, {"id": 471116806, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d2366700-r471116806-Torre_Agbar-Barcelona_Catalonia.html", "text": "Torre Agbar was opened in June 2005 and marks the gateway to the new technological district of Barcelona and owned by the multinational group Agbar.\nIt's very similar to 30 St, Marry  Axe or 'The Gherkin' in London and although it's not really worth going out of  your way to see it..... you can't really miss it!\nIt's better at night lit up than during the day.", "publishedDate": "2017-03-29", "language": "en", "rating": 3}, {"id": 470944380, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d2366700-r470944380-Torre_Agbar-Barcelona_Catalonia.html", "text": "This is probably the ugliest building in Barcelona's skyline. It looks very phallic. It only looks nice at night when its lit up. Other than that, it looks like a regular grey-blue bullet from afar. It's a business building, so you can only enter if you work there. It's not worth going out of your way to see.", "publishedDate": "2017-03-28", "language": "en", "rating": 3}, {"id": 469855618, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d2366700-r469855618-Torre_Agbar-Barcelona_Catalonia.html", "text": "I have mixed feelings about this place... It is an amazing building in itself but was quite new when I arrived and reminded me of the 'Gherkin' in London, which was also errected while I had been away.\n\nIt was also the first place I worked upon arriving in Barcelona which was pretty cool, even if the job wasn't!\n\nThe nightime illuminations - due to the panels on the building's exterior - are definitely worth seeing,\n\nBe aware that the Plaza Glorias area was a building site as it was undergoing massive improvement works, but there is a metro station very close for you to take a look at the tower, and a shopping centre opposite, should that be your wont. Also a bit further down Avenida Diagona you can find the Diagonal Mar shopping centre, which is close/next to a part of the BCN beach which is quieter and cleaner than Barceloneta.", "publishedDate": "2017-03-24", "language": "en", "rating": 4}, {"id": 459928964, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d2366700-r459928964-Torre_Agbar-Barcelona_Catalonia.html", "text": "The critics have it right. The tower looks like a giant suppository and is an absolute eyesore in Barcelona's skyline. One wonders how they let such a disgrace happen to a beautiful city. The lights during the night are pretty, but don't make up for its awful presence in the landscape every day.", "publishedDate": "2017-02-15", "language": "en", "rating": 2}, {"id": 459787236, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d2366700-r459787236-Torre_Agbar-Barcelona_Catalonia.html", "text": "I haven't seen this place during the day but it is best at night anyway or so I'm led to believe! See for yourself! It is all lit up at night and it does look very striking it's like looking at a stained glass window inverted it's very cool to see! ", "publishedDate": "2017-02-14", "language": "en", "rating": 4}, {"id": 455510052, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d2366700-r455510052-Torre_Agbar-Barcelona_Catalonia.html", "text": "Best viewed from the top of Gaudi's Pedrera after dark and after the Barcelona Football Club has won a match. When this happens, the building is bathed in the teams colors, blue and claret.", "publishedDate": "2017-01-28", "language": "en", "rating": 4}, {"id": 449706931, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d2366700-r449706931-Torre_Agbar-Barcelona_Catalonia.html", "text": "Pretty to look at when coming back to hotel in evening. Take red line to glories station and you pop out right at building", "publishedDate": "2017-01-05", "language": "en", "rating": 4}, {"id": 447712744, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d2366700-r447712744-Torre_Agbar-Barcelona_Catalonia.html", "text": "Very close to the metro station and nice to see the lighting effects on the tower. Please do note that you cannot enter the tower ) and the lights go off at 23:00 PM. I must say it is good to see but not must. we were staying close to the tower so liked it. But it can be viewed from many parts of the city specially areas around arc the triumph", "publishedDate": "2016-12-30", "language": "en", "rating": 5}, {"id": 446336587, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d2366700-r446336587-Torre_Agbar-Barcelona_Catalonia.html", "text": "The building looks similar to the Gherkin building in London, although when looking close-up one can see the differences and not just the size (the Gherkin is taller); the skyscraper is the home to Grupo Agbar, a Spanish water company. We saw the building several times during our stay, up-close and from a distance; from a distance, the building does stand out because of the design.", "publishedDate": "2016-12-23", "language": "en", "rating": 3}, {"id": 443313497, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d2366700-r443313497-Torre_Agbar-Barcelona_Catalonia.html", "text": "This building stands out like a sore thumb in the Barcelona skyline. The building is lit up at night, and then becomes beautiful. I understand the view from the viewing level is great.", "publishedDate": "2016-12-10", "language": "en", "rating": 3}, {"id": 442488777, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d2366700-r442488777-Torre_Agbar-Barcelona_Catalonia.html", "text": "It was a great landmark for us as we were staying at the four points just down the road from us. One night in particular it came in handy when we had hit too many cafes on the way home. Reminds me of a building in London. Not sure if you can tour it, never appeared to be a way to when we walked by, but an interesting piece of architecture to soak in.", "publishedDate": "2016-12-06", "language": "en", "rating": 4}, {"id": 436675138, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d2366700-r436675138-Torre_Agbar-Barcelona_Catalonia.html", "text": "This is similar in shape to the famous gherkin in London England and can be seen all over Barcelona both by day and by night", "publishedDate": "2016-11-12", "language": "en", "rating": 4}, {"id": 435167014, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d2366700-r435167014-Torre_Agbar-Barcelona_Catalonia.html", "text": "This building is reminiscent of the 'Gherkin' building that is another iconic building London \n\nOne can see this building from most places in Barcelona both by day and by night although at night it is all lit up so can be seen far better and far brighter", "publishedDate": "2016-11-06", "language": "en", "rating": 4}, {"id": 432580243, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d2366700-r432580243-Torre_Agbar-Barcelona_Catalonia.html", "text": "A very tall building that is most impressive by night. The round shape is unique and it's height gives it a more robust feeling ", "publishedDate": "2016-10-29", "language": "en", "rating": 4}, {"id": 428722943, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d2366700-r428722943-Torre_Agbar-Barcelona_Catalonia.html", "text": "This impressive building by Jean Nouvel in the form of a cucumber has been part of the Barcelona skyline since 2005.", "publishedDate": "2016-10-17", "language": "en", "rating": 3}, {"id": 424174643, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d2366700-r424174643-Torre_Agbar-Barcelona_Catalonia.html", "text": "An impressive tower at night. Unfortunately it is illuminated only during the Weekend and after 9 p.m.", "publishedDate": "2016-10-01", "language": "en", "rating": 4}, {"id": 422456711, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d2366700-r422456711-Torre_Agbar-Barcelona_Catalonia.html", "text": "It's closed..near a quiet part of the city...used it as a point of reference when we walked. Fun to look at but useless otherwise.", "publishedDate": "2016-09-26", "language": "en", "rating": 3}, {"id": 422217169, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d2366700-r422217169-Torre_Agbar-Barcelona_Catalonia.html", "text": "Good monument but not worth visiting. You can take tram 🚊 T4 passing by and take a look.Nothing really interesting.", "publishedDate": "2016-09-25", "language": "en", "rating": 3}, {"id": 414702168, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d2366700-r414702168-Torre_Agbar-Barcelona_Catalonia.html", "text": "Nice area to visit at night. The tower is lit beautifully. It you visit during the day combine  it with a visit to the Glories shopping center and the rambla the poble you.", "publishedDate": "2016-09-04", "language": "en", "rating": 4}, {"id": 414094276, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d2366700-r414094276-Torre_Agbar-Barcelona_Catalonia.html", "text": "Free from outside...night time is best time to take pictures...near by shopping center is very convenient", "publishedDate": "2016-09-02", "language": "en", "rating": 5}, {"id": 402665648, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d2366700-r402665648-Torre_Agbar-Barcelona_Catalonia.html", "text": "This building is not much to look at during the day except for the actual shape of it being interesting.  See it at night but don't hang out in the area too long.  It's not in the best of locations in Barcelona.", "publishedDate": "2016-08-07", "language": "en", "rating": 3}, {"id": 396116047, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d2366700-r396116047-Torre_Agbar-Barcelona_Catalonia.html", "text": "First of all, don't go there any night thinking that the tower will be lit. This only happens Friday, Saturday and Sunday and I think you have to wait until 9pm.\n\nMe and my wife were firstly there on a Wednesday night and nothing happened so we were disappointed. But after a little research we found that it had a specific schedule. So we went there on Friday and the sight is as the photos show.\n\nThe lights don't move so the photos all look alike but it's very well worth visiting.", "publishedDate": "2016-07-24", "language": "en", "rating": 5}, {"id": 395472918, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d2366700-r395472918-Torre_Agbar-Barcelona_Catalonia.html", "text": "You should visit Torre Agbar at night, when it is beautifully illuminated. Of course you can see it from the distance, but it is more spectacular when you stand close to it. Right next to Torre Agbar is Glories shopping center with lots of shops and restaurants.", "publishedDate": "2016-07-22", "language": "en", "rating": 5}, {"id": 385334073, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d2366700-r385334073-Torre_Agbar-Barcelona_Catalonia.html", "text": "Definitely not a must see in my opinion but worth passing by if you had the chance. The changing lights is kind of mesmerizing at night, but eh, its just ok. Might as well check it out if you are in Barcelona right?", "publishedDate": "2016-06-23", "language": "en", "rating": 4}, {"id": 380664037, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d2366700-r380664037-Torre_Agbar-Barcelona_Catalonia.html", "text": "La Torre Agbar is a very interesting building that lights up in different colors every night. It's free and cool to look at, but it is not a must-see.", "publishedDate": "2016-06-07", "language": "en", "rating": 3}, {"id": 375911706, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d2366700-r375911706-Torre_Agbar-Barcelona_Catalonia.html", "text": "As far as office buildings go this one is pretty nice, but when compared to places like the Sagrada Familia or even the gothic cathedrals of Barcelona, it appears simplistic and uninspired. Its ok to look at for a minute or two, maybe snap a picture (at night it looks better, because its light-up) other than that there isn't much to see in there, offices are offices whether you're in spain, china or chicago. OK at best, if you don't see it you have not missed out on anything special.", "publishedDate": "2016-05-23", "language": "en", "rating": 3}, {"id": 372175368, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d2366700-r372175368-Torre_Agbar-Barcelona_Catalonia.html", "text": "One of the most amazing buildings of Barcelona, imponent in the midle of the town. I recomend you see it by night cause its when she is full of light.", "publishedDate": "2016-05-11", "language": "en", "rating": 5}, {"id": 368189723, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d2366700-r368189723-Torre_Agbar-Barcelona_Catalonia.html", "text": "I went there at night with a friend, it's right by the metro exit so if you take the metro you don't even have to walk a minute. It's beautiful!!! there are some stairs right in front that are really big, on which me and my friend had a really long conversation, and just hung out there for a while appreciating the nice architecture.", "publishedDate": "2016-04-27", "language": "en", "rating": 5}, {"id": 362689255, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d2366700-r362689255-Torre_Agbar-Barcelona_Catalonia.html", "text": "Wandered up to the Tower after a visit to a nearby museum. Its located close go the Glories metro and tram stations. There is also a shopping centre with a food court located nearby. The tower itself is home to the corporate hq of a company and is cool to look at at night when lit up. ", "publishedDate": "2016-04-08", "language": "en", "rating": 3}, {"id": 362588163, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d2366700-r362588163-Torre_Agbar-Barcelona_Catalonia.html", "text": "Free to the public, I had to see it! Cool but not all that! \nWent there to snap some pictures, the locals call it Barcelona's\"penis\" hehe! Check it out!", "publishedDate": "2016-04-08", "language": "en", "rating": 3}, {"id": 358641822, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d2366700-r358641822-Torre_Agbar-Barcelona_Catalonia.html", "text": "Speak to the locals, snd they will tell you that this building is a butt of most jokes owing to its suggestive shape. \n\nWe crossed this building several times during the Barcelona trip. It is pretty boring and bland during the day, but is quite well lit on some nights. \n\nNot an attraction. At all", "publishedDate": "2016-03-26", "language": "en", "rating": 3}, {"id": 352706637, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d2366700-r352706637-Torre_Agbar-Barcelona_Catalonia.html", "text": "Went right up to this building during the day and it's pretty boring. The glass slats around it are dirty and not much else to see. At night however with the lighting it becomes something completely different.", "publishedDate": "2016-03-03", "language": "en", "rating": 3}, {"id": 352406645, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d2366700-r352406645-Torre_Agbar-Barcelona_Catalonia.html", "text": "You can see this building from quite some distance.  It is very modern looking.  Not sure if you can go inside for a peek or not.", "publishedDate": "2016-03-02", "language": "en", "rating": 3}, {"id": 350972967, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d2366700-r350972967-Torre_Agbar-Barcelona_Catalonia.html", "text": "We took a foot trip to give it a closer look and I would say it definitely wasn't worth it. Yet we were there in a full sunlight. To me nothing interesting.\nMaybe nightly experience would be better but for some reason we never see it at night even from a distance.\nAnyway it is one of a objects today presented on many Barcelona souvenirs and postcards... So give it a look. And if you don't want to have this visit as a complete waste of time (if you have feelings similar to mine), go to the nearby flea market (open on Wednesdays, don't know if on any other day as well) or one of the museums (we didn't visit the museums so nothing I can recommend but there are few nearby).", "publishedDate": "2016-02-25", "language": "en", "rating": 2}, {"id": 350614261, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d2366700-r350614261-Torre_Agbar-Barcelona_Catalonia.html", "text": "My wife and I had a great view of the tower from our hotel balcony. Great when lit up at night, shame they seem to switch the lights off about half past eleven.", "publishedDate": "2016-02-24", "language": "en", "rating": 5}, {"id": 349917072, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d2366700-r349917072-Torre_Agbar-Barcelona_Catalonia.html", "text": "Torre Agbar is a building which adds a modern flair to the Barcelona skyline. Visible from different points of the city, if in the area, it´s always worth a visit to see it towering above the city in front of your eyes. ", "publishedDate": "2016-02-22", "language": "en", "rating": 4}, {"id": 342593391, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d2366700-r342593391-Torre_Agbar-Barcelona_Catalonia.html", "text": "The inside used to be occuppied by offices. The last thing I heard is that they want it to build a Hotel from a very important american chain but the new government stop the deal.\nIt's a nice place to walk around night time as it has a shopping center just in front.", "publishedDate": "2016-01-25", "language": "en", "rating": 5}, {"id": 340012868, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d2366700-r340012868-Torre_Agbar-Barcelona_Catalonia.html", "text": "The oval tower has a spacious floor plan without any pillars. Its color is changing from red at the base to blue and white at the top, which is a spectacular sight at night. This 38-story tower is designed by French architect Jean Nouvel and opened in 2005.", "publishedDate": "2016-01-14", "language": "en", "rating": 5}, {"id": 338736430, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d2366700-r338736430-Torre_Agbar-Barcelona_Catalonia.html", "text": "One of those sights better seen from a distance. Up close its a glorified office building trying to imitate the 'Gherkin' in London and failing badly. Reports say it looks good at night, we were there during the day. Boring.", "publishedDate": "2016-01-09", "language": "en", "rating": 3}, {"id": 337982565, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d2366700-r337982565-Torre_Agbar-Barcelona_Catalonia.html", "text": "what an amazing structure,i called it the dildo of Barcelona,nice land mark if you get lost,nice shopping centre nearby to have some breakfast or lunch,i had to take the underground to get there", "publishedDate": "2016-01-06", "language": "en", "rating": 5}, {"id": 334110592, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d2366700-r334110592-Torre_Agbar-Barcelona_Catalonia.html", "text": "Blue, red, pink, yellow, white, grey, green, purple, you name it, the tower has it. The locality is upmarket and among all the malls, residential buildings and offices we can see one towering structure standing so majestic displaying a show of psychedelic colors in patterns that you cannnnnnottttt take your eyes off it. Visit this place in the night only, the light show is worth the visit. May be you can visit the Sagrada Familia and walk down this place for the night.", "publishedDate": "2015-12-20", "language": "en", "rating": 5}, {"id": 331251999, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d2366700-r331251999-Torre_Agbar-Barcelona_Catalonia.html", "text": "Both interesting & innovative, this tower is definitely worth seeing at night when it is illuminated in different colours. Easy to reach too, only a few mins walk from the metro station.", "publishedDate": "2015-12-07", "language": "en", "rating": 4}, {"id": 330487351, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d2366700-r330487351-Torre_Agbar-Barcelona_Catalonia.html", "text": "I caught the view of this place at night. The illumination is beautiful, in the day it is still interesting but at night the lights just make it magical.", "publishedDate": "2015-12-03", "language": "en", "rating": 5}, {"id": 330331863, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d2366700-r330331863-Torre_Agbar-Barcelona_Catalonia.html", "text": "Went to Barcelona with my girlfriend on the end of March and went to visit this tower, it was really nice, especially in the evening when lights are on is even better, for me is one the best things to see in Barcelona.", "publishedDate": "2015-12-02", "language": "en", "rating": 5}, {"id": 328567985, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d2366700-r328567985-Torre_Agbar-Barcelona_Catalonia.html", "text": "This is a private building housed with private company but catches attraction of tourists from a distance with its constant changing colours from red to purple via blue.Oh!wonderful.Although surrounding is not so attractive this is the only colourful attraction in the area and gives pleasure in photography.I sat under this tall building and relaxed .Did lot of photography.If you have some spare time must go there.", "publishedDate": "2015-11-23", "language": "en", "rating": 4}, {"id": 327982175, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d2366700-r327982175-Torre_Agbar-Barcelona_Catalonia.html", "text": "It is a simple but emblematic building. When I was living there, Barna, I heard that it was empty but the lights were to be on for Urban landscape matters, a pitty, because be cost of mainteining this building relies over the people´s shoulders.", "publishedDate": "2015-11-20", "language": "en", "rating": 4}, {"id": 327256238, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d2366700-r327256238-Torre_Agbar-Barcelona_Catalonia.html", "text": "Great building that changes light from red to blue and purple you must see it and take a picture in front of ", "publishedDate": "2015-11-16", "language": "en", "rating": 5}, {"id": 326180547, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d2366700-r326180547-Torre_Agbar-Barcelona_Catalonia.html", "text": "One of jean Nouvel's towers (french architect)\nMonumental & dominant in its surrounding.. but we couldn't get access since it is a private building for a company.\nHowever, by night it gets interesting for its skin colorful lighting display.", "publishedDate": "2015-11-11", "language": "en", "rating": 3}]}}]