[{"locationId": 619690, "name": "Museu de la Xocolata", "placeType": "ATTRACTION", "reviewListPage": {"reviews": [{"id": 750405061, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d619690-r750405061-Museu_de_la_Xocolata-Barcelona_Catalonia.html", "text": "money paid for nothing, there is nothing inside, but some banners with written text that you can find on google.", "publishedDate": "2020-03-11", "language": "en", "rating": 1}, {"id": 750259436, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d619690-r750259436-Museu_de_la_Xocolata-Barcelona_Catalonia.html", "text": "As soon as you pay to get in you are given a free bar of chocolate which acts as your entrance through the gate if you scan the barcode on the label. Then after your tour round all the exhibits you can buy chocolates or have something from their cafe or do both. Although you don't get to see how they make the chocolate like they do in Bruges it's still quite good to visit.", "publishedDate": "2020-03-10", "language": "en", "rating": 3}, {"id": 747509404, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d619690-r747509404-Museu_de_la_Xocolata-Barcelona_Catalonia.html", "text": "You cannot just drop in here as a family with young children. Anyone under 12 will just find it boring. That's why the Museum goes out of its' way to advise the visitor that if you want to participate in any of its' activities - workshops,chocolate tasting, lollipops workshops etc... - you must book in advance. I got bowled over by a party of young kids aged between 5 and 12 because I stood between them and the museum kitchen where the workshops take place. It is only this part of the museum that will appeal to children directly and it is obviously over-subscribed.\nThis is first and foremost a museum that describes how the cacao bean was discovered, how it became important over the centuries,how countries fought over controlling it and how it became the \"chocolate\" that we know today. Making the assumption that the museum is just about the taste of chocolate and why children might like it because of that, is more a product of careless parenting or people with too much of a sweet tooth. \nSo bear that in mind when you look at the \"terrible\" reviews as there is a lot to read and digest here if you want to learn about chocolate and how it has become part of our social and culinary landscape. The museum has tried to make the story of chocolate user-friendly and fascinating but it will not hold the attention of a precocious child who just wants to eat it.Where it comes from,how it was made in the past contrasted with how it is made now,how it was and is marketed  - all of this is presented with fascinating audio-visual tableaux. If any child or teenager walks past the dioramas showing the faithful representations of literary characters such as Don Quixote,Asterix and Obelix,Tintin and his fellow adventurers - then you know that they suffer from a deeply-flawed upbringing.\nThen there is a section that shows the antique machinery used in the making of chocolate and photographs of the \"chocolatiers\" who have made Barcelona a centre of chocolate excellence. There is also an area that shows works created for the Annual Chocolate Sculptures Contest and it is here that you are viewing the creative skills of these artists. This is truly at the other end of the spectrum from the production line of Cadbury's \"Dairy Milk\" bars. Stick around for the video that shows how a reproduction of Thomas the Tank Engine is made from chocolate. Then you realise that the chocolate bar that you used to get into this museum is not just made from any chocolate.\nWhen you are done with the museum, you exit into the coffee shop where there are on sale a truly mind-boggling selection of flavoured and pure chocolate products made especially for the museum. It might seem expensive but you are not buying \"ordinary\" here. You are buying a piece of Barcelona's culinary history. It is to be savoured not gorged.\n A note of caution,don't be seduced into buying a large cup of hot chocolate from Barcelona with what looks like a simple chocolate croissant,unless you are truly ravenous and intend walking around Barcelona for the rest of the day. I shiver at the memory of how many calories they contained- but then, I was on holiday.", "publishedDate": "2020-02-25", "language": "en", "rating": 5}, {"id": 744622250, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d619690-r744622250-Museu_de_la_Xocolata-Barcelona_Catalonia.html", "text": "Wish I could rate it 0 \nWhat a crock of sh*t , totally boring, lasted 2 minutes and wouldn’t recommend to my worst enemy.", "publishedDate": "2020-02-12", "language": "en", "rating": 1}, {"id": 741806082, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d619690-r741806082-Museu_de_la_Xocolata-Barcelona_Catalonia.html", "text": "This is rather educational if you want to earn more about one of many people's favourite foods! There is a good reason for MX to be in Barcelona - this was the first port where chocolate was imported through into Europe. And the history of chocolate from that time to today is worth knowing!", "publishedDate": "2020-01-28", "language": "en", "rating": 5}, {"id": 736463893, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d619690-r736463893-Museu_de_la_Xocolata-Barcelona_Catalonia.html", "text": "We had plenty of time during our stay in Barcelona, my husband wanted to visit camp Nou and the kids weren’t bothered so thought I’d try here whilst he went to there . Honestly a complete waste of money, a few ‘chocolate’ sculptures mainly of Asterix that really looked way past their best, and well, that was it, kids said ‘is that it’ as we came to the end I was like err I think so, sorry kids! Really took us 5-10 mins and that was me trying to read the bumf to bulk it out a bit. This really is a bit of a con to take your money - nice cafe but expensive - would be better to let people go to cafe and view the few sculptures for free as part of cafe visit. We found the Cuitadella park over the road that was worth the visit then up to Arc de Triompe .", "publishedDate": "2020-01-02", "language": "en", "rating": 1}, {"id": 734427057, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d619690-r734427057-Museu_de_la_Xocolata-Barcelona_Catalonia.html", "text": "Location: West of the city, near the zoo.\nPrice: Varies depending on your status (Students are 5.10E)\n\nYour entry ticket is a bar of chocolate which seems to change depending on which ticket you purchase. Student tickets received a smaller bar of dark chocolate. The museum itself is the same as every other chocolate museum in Europe - they all claim that they were the first to discover it and show the same cultivation process and history. The best part is viewing all of the sculptures made from chocolate. This whole museum could be done in 30 minutes, there are no free samples of chocolate at different stages like other museums.", "publishedDate": "2019-12-24", "language": "en", "rating": 3}, {"id": 732443709, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d619690-r732443709-Museu_de_la_Xocolata-Barcelona_Catalonia.html", "text": "Attended the chocolate making class. Carla, the instructor, was friendly and informative. We got to take all our creations home with us, which is a LOT. A chocolate bar (white and dark), chocolate lollipops, chocolate cups, and chocolate bombs, with whatever nut, seed, or fruit fillings you wanted to add. Gift store with more chocolate for sale. \"Museum\" part was very small but adequately explained history of chocolate. Many chocolate sculptures, but most were 30+ years old without explanatory signs... Thankfully Carla have us a personal tour and explained the sculptures for us. The entrance ticket is a bar of chocolate!", "publishedDate": "2019-12-13", "language": "en", "rating": 4}, {"id": 731338151, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d619690-r731338151-Museu_de_la_Xocolata-Barcelona_Catalonia.html", "text": "The smell, the atmosphere and the stories behind...Theese are the most important things to be in attention of every visitor of this beautiful and interesting museum.\nPS: buy 4-5 tickets for 1 person. They are delicious :X", "publishedDate": "2019-12-08", "language": "en", "rating": 5}, {"id": 730338638, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d619690-r730338638-Museu_de_la_Xocolata-Barcelona_Catalonia.html", "text": "A short walk from the Palau de la Musica Catalana (awesome place) is the Museum of Chocolate.  It has a great history of chocolate in Europe from its earliest days of importation from the Americas, how chocolate is made - and of course, a chocolate shop. However, the highlight is definitely the chocolate sculptures. Everything from the Asterix cartoons to horse races to flamenco dancers, soccer players, buildings - probably 30 or 40 different sculptures, mostly 3 to 4 feet tall. Older kids would love it too once they know it's chocolate.  I am a history buff so take that into account, but my 21 year old daughter also enjoyed the 1/2 hour or so we spent here.", "publishedDate": "2019-12-02", "language": "en", "rating": 4}, {"id": 729991443, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d619690-r729991443-Museu_de_la_Xocolata-Barcelona_Catalonia.html", "text": "Free entry with the Barcelona card, which by the way is great value.\nOn entry you are given a bar of chocloate which is the entry ticket.\nWe visited because we passed it on the way to a restaurant and my wife is partial to chocolate.\nGreat explanation as to the history and the manufacture of chocolate and it was great to see a school group there with the children really engaged in the projects their teachers set,\nThere is a chocolate making area which has to be pre-arranged but the kids we saw doing it seemed to really enjoy themselves.\nNot a massively intellectual place but fun nonetheless and informative about your addiction should you be a chocaholic.\nStaff were friendly, helpful and engaging at all stages of the visit.\nThere is a cafeteria/bar where you can enjoy a snack as well as chocolate related products.\nNot really a reason to visit Barcelona but once you are here, are in the area and have a spare 40 minutes, well worth a visit.", "publishedDate": "2019-12-01", "language": "en", "rating": 3}, {"id": 729225726, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d619690-r729225726-Museu_de_la_Xocolata-Barcelona_Catalonia.html", "text": "Some of the exhibits are fiendishly clever, many are past their sell by date and bug infested.                                               I HATE WRITING BAD REVIEWS AND SELDOM DO, BUT READ ON, BECAUSE THIS IS WHAT HAS PROMPTED  THIS STINKER: Two weeks ago I was delivered a package by the courier company Seur from whom I've  had many deliveries, but never asked  for cash on delivery before. But this time they asked me for €18.50. I could have got  cab to & from the museum for less.The Museu de la xocolata packaging was 35,5 14,5 x 14, 5 x 32cm, the box of chocolates just 20,5 x 2,5 x 10,5cm.There was no note to say who'd sent it. \nImagine ordering a gift online & not being able to include even your name & not being told your friend would have to pay on receipt! I emailed the museum & got a very prompt reply apologising and insisting the charge was an error and that the courier company would ring to refund me. I wasn't asked for my number for this to happen (!) so I supplied it by return. Over two weeks later I have not been contacted by Seur or the museum shop. I've just emailed them again. I'll  let you know what happens. But the moral to my rant is that Barcelona has many marvels: the chocolate museum is not one of them, and whatever you do, don't order from them online. Sorry, that was two morals!", "publishedDate": "2019-11-27", "language": "en", "rating": 1}, {"id": 729196572, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d619690-r729196572-Museu_de_la_Xocolata-Barcelona_Catalonia.html", "text": "It's only really worth doing if you like chocolate, and  are interested in how it all came about. Also if you have time that needs to be killed, it's also good for that. A nice Cheap activity that can easily kill about 45 minutes up to an hour. ", "publishedDate": "2019-11-27", "language": "en", "rating": 3}, {"id": 727402787, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d619690-r727402787-Museu_de_la_Xocolata-Barcelona_Catalonia.html", "text": "Not in the league of other museums, but geared to a curious client this unique experience is worth taking a few minutes to learn about the process of sourcing beans and making chocolate.  There are some interesting antique processing machines on display.  I found it informative enough that I didn’t mind spending a bit for admission (and the ticket is a chocolate bar for you to eat once you have scanned it for entry).  After walking through the displays, we enjoyed a luscious cup of chocolate—superb! ", "publishedDate": "2019-11-18", "language": "en", "rating": 5}, {"id": 723813980, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d619690-r723813980-Museu_de_la_Xocolata-Barcelona_Catalonia.html", "text": "Go to the other and bigger museums first.  We had fun and finally learned how chocolate is produced and its important history.  Enjoyed some large scale chocolate sculptures.  But actually the displays are small and not all that well produced.  Just OK and could be much better.", "publishedDate": "2019-11-04", "language": "en", "rating": 3}, {"id": 722581868, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d619690-r722581868-Museu_de_la_Xocolata-Barcelona_Catalonia.html", "text": "I’d read about this beforehand and it had rave reviews to visit with children. I expected an amazing museum and to be able to watch them making chocolate in the workshop. We were in and out in about 10 minutes- it was boring and dull- nothing to engage our boys at all so for over 20 euros it was a waste of money. I asked them upon exit why there was no demonstrations of chocolate making and she shrugged and said not today. If she had told me that before I bought the tickets we wouldn’t have paid to go in!! Don’t waste your time or money visiting here!", "publishedDate": "2019-10-30", "language": "en", "rating": 1}, {"id": 721744507, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d619690-r721744507-Museu_de_la_Xocolata-Barcelona_Catalonia.html", "text": "Great place to spend an hour learning about the history of chocolate in the old world and how it started primarily as a drink and morphed into a solid treat many years later. \n\nSmall cafe at the end plus many chocolates for sale that are made on site. Your tickets are actually small bars so you can eat the evidence at the end!  Cheers!", "publishedDate": "2019-10-27", "language": "en", "rating": 5}, {"id": 716072879, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d619690-r716072879-Museu_de_la_Xocolata-Barcelona_Catalonia.html", "text": "We were hoping it would be better than some reviewed warned, but we truly did not have a good experience. 12€ for two people, not a terrible price.\n\nHowever, 2/3 video segment did not work. When we talked to the lady about it, she just told us you needed to press the button longer. We went back in, still didn’t work.\n\nNo refund even though 2/3 of the exhibit didn’t work. I don’t recommend. We didn’t learn much, you could’ve learned everything on google.\n\nI think the most entertaining aspect was looking for bugs in some of the bug infested sculptures. \n\nThat was it.\n\nThe ticket comes with a chocolate bar, but it’s nothing exceptional. \n\nIf you are on a time crunch, or budget. Skip it. ", "publishedDate": "2019-10-07", "language": "en", "rating": 1}, {"id": 715476753, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d619690-r715476753-Museu_de_la_Xocolata-Barcelona_Catalonia.html", "text": "Excellent attraction, really worth a look. 6€ admission is worth every penny. Therrs a chance to sample some chocolate and coffee on the way out. Had a great time.", "publishedDate": "2019-10-05", "language": "en", "rating": 5}, {"id": 710616079, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d619690-r710616079-Museu_de_la_Xocolata-Barcelona_Catalonia.html", "text": "There is a lot of info and displays about the history of chocolate, how it is made and where it came from. But, the most interesting part to me was the many sculptures they had made of chocolate. You get a unique admission ticket.", "publishedDate": "2019-09-17", "language": "en", "rating": 4}, {"id": 708452651, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d619690-r708452651-Museu_de_la_Xocolata-Barcelona_Catalonia.html", "text": "Paid 5 euro for a small bitter chocolate bar and were done with the museum in 15 mins max. Displays were dry and boring, the only vaguely interesting part was some of the chocolate sculptures. Save your money and go to a better museum For this price. ", "publishedDate": "2019-09-10", "language": "en", "rating": 1}, {"id": 706930300, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d619690-r706930300-Museu_de_la_Xocolata-Barcelona_Catalonia.html", "text": "Entry ticket is a fun touch, where our of English flyers, but not a big loss. Make sure to bring earphones because you can actually listen to an online audio guide (didn't have earphones on me so no idea about the quality). Lots of sculptures, some information, some screens and 3 little movie rooms. This made for a lot of noise with commercial music and dubbed movies with the original Spanish on the background. Sometimes it was just too much sound to enjoy. Half an hour or so, defenitly not 2-3 hours! Maybe with a workshop or so, we could see those rooms but no information was given on how to book that... Shame. Not bad, but already seen better Chocolat museums actually", "publishedDate": "2019-09-05", "language": "en", "rating": 3}, {"id": 703247180, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d619690-r703247180-Museu_de_la_Xocolata-Barcelona_Catalonia.html", "text": "The best part was the chocolate as a ticket replacement! The rest of the museum is OK. Not sure it is worth the hunt, unless you are in desperate need of the dark stuff which is nice...not amazing, but nice.", "publishedDate": "2019-08-26", "language": "en", "rating": 3}, {"id": 701150683, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d619690-r701150683-Museu_de_la_Xocolata-Barcelona_Catalonia.html", "text": "You get a little bar of chocolate too on entering. Gluten and dairy free btw which is always a bonus for us 😃Doesn’t take too long to whizz around, next to a few other things you can see for free with the card. Watch out for your bags in this area as we nearly got caught out by a tea-leaf and spend a few minutes with the Barcelona Police filling out a report. Staff were amazing as they spotted it and were very alert. In fact they were the reason my wife still has her phone etc. and he was caught. Muchas gracias!", "publishedDate": "2019-08-20", "language": "en", "rating": 4}, {"id": 697883333, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d619690-r697883333-Museu_de_la_Xocolata-Barcelona_Catalonia.html", "text": "Crossing the Passeig de Picasso on my way to the bus station, I happened to be passing by a nondescript building with a sign by the door that arrested by attention - Museum of Chocolate, Out of sheer curiosity, I walked in with no high expectations. Surprise! - an array of docu panels tell the story of chocolate manufacturing in the city which reputed chocolatiers turned into art such as illustrated by the pieces on display in big glass boxes, some of them award-winners at international competitions of the trade. Taking the risk of being stupid or ridiculous, I nonetheless admit to amusing  myself on seeing cartoon characters, Don Quixote and his Rosinanta, Satchmo, Western saloons and Stars War heroes or Barcelona's iconic Sagrada and Canaletes etc. made of...chocolate.\n     Before leaving the place,spare a little time to have an icecream or cake and buy some delicious sweets - my suggestion.\n     P.S. Another \"source\" of special chocolate, cacao a.s.o. is the cafeteria of Casa Amatller, itself a magic place worth visiting.", "publishedDate": "2019-08-11", "language": "en", "rating": 4}, {"id": 697687067, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d619690-r697687067-Museu_de_la_Xocolata-Barcelona_Catalonia.html", "text": "It seems to be part of a confectionery school. Very small, and do not recommend if you do not have enough time in Barcelona.", "publishedDate": "2019-08-10", "language": "en", "rating": 3}, {"id": 696086639, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d619690-r696086639-Museu_de_la_Xocolata-Barcelona_Catalonia.html", "text": "I expected more interactive opportunities and possibly more chocolate!\n\nThe entrance using a small chocolate bar was promising but after that there was quite a bit of reading about cocoa and history of chocolate.\n\nI didn’t find it hugely memorable", "publishedDate": "2019-08-06", "language": "en", "rating": 3}, {"id": 694107784, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d619690-r694107784-Museu_de_la_Xocolata-Barcelona_Catalonia.html", "text": "I was traveling with my two teenage boys and we needed to kill some time before heading to the airport. This museum was close to our hotel and was a nice walk to get to - lots of shops and TTs (tourist traps) on the way there - so we decided to give it a go. \n\nCost was EUR 6,20 for adults and EUR 5 for students, which seems a little much for what it is. However, the kids were excited that the admission ticket was a bar of chocolate...until they opened it and discovered it was fairly bitter dark chocolate. They both immediately handed the bars back to me. \n\nThe museum has free WiFi and some QR codes you can scan to get more information about the exhibits along with some short films. That didn’t really interest my boys. The museum is otherwise primarily glass-covered displays with chocolate artifacts and chocolate sculptures of cartoon characters and similar. \n\nThere were some glass enclosed demonstration kitchens which had student groups doing some kind of projects with chocolate ... it looked like they were having fun. However, those activities need to be booked in advance. \n\nKids wanted to leave after 10-15 minutes. We stuck around in the cafe at the end of the tour to use the WiFi and very nice air conditioning as it was a super-hot July day and hours before our flight. \n\nBottom line is that if you: \n1. advance-book an activity, \n2. are a big chocolate nerd and love chocolate history for some reason, or \n3. need some place to hang out and kill time with good WiFi and air conditioning, \nthen this is the place for you. Otherwise, skip it. ", "publishedDate": "2019-07-30", "language": "en", "rating": 3}, {"id": 689823921, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d619690-r689823921-Museu_de_la_Xocolata-Barcelona_Catalonia.html", "text": "Small museum of arts created in chocolate. It’s perhaps more an exhibition than a museum because most is spent on displays of chocolate sculptures than actuality telling the story of chocolate.\nAnyway the kids loved it and it was a nice break away from the sun. \nSeems you can pay to create chocolate art yourself but we didn’t try it.\nYour entrance ticket is a piece of chocolate.", "publishedDate": "2019-07-15", "language": "en", "rating": 4}, {"id": 687382962, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d619690-r687382962-Museu_de_la_Xocolata-Barcelona_Catalonia.html", "text": "Not really sure who would find this a good place to visit with kids... there is no interactive things.. its just reading the history of how chocolate was made... no fun factor.. no excitement for them.. the chocolate sculptures in the glass cages were fairly interesting... the best bit really was the chocolate bar ticket... but the most expensive bar of chocolate you will ever buy.... wouldn't recommend this place...", "publishedDate": "2019-07-06", "language": "en", "rating": 2}, {"id": 686014933, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d619690-r686014933-Museu_de_la_Xocolata-Barcelona_Catalonia.html", "text": "The biggest scam in Barcelona. It portrays itself as a chocolate museum, but is nothing more than a cafe with a few chocolate “sculptures“. It is 6 euro per person to enter which is shameful as there is nothing worthwhile seeing there. Don’t waste your time or money. In case they review things in future and don’t charge an entry fee, still avoid it like the plague. It’s no Willy Wonka’s chocolate factory. ", "publishedDate": "2019-07-02", "language": "en", "rating": 1}, {"id": 685529284, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d619690-r685529284-Museu_de_la_Xocolata-Barcelona_Catalonia.html", "text": "After reading the mixed reviews we weren’t sure.....but glad we did.  Just the right size and informational as to history etc.  the chocolate bar admission ticket was creative.  My only negative was the prices were not on things in the gift shop.  Some seemed reasonable and others seemed pricy.  Oh it was very cool and pleasant inside important on a HOT day! Our group from 10 to 80 and enjoyed by all. ", "publishedDate": "2019-06-30", "language": "en", "rating": 5}, {"id": 685260187, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d619690-r685260187-Museu_de_la_Xocolata-Barcelona_Catalonia.html", "text": "We were two families from Texas spending 2 weeks on a European vacation, visiting London, Paris and Barcelona European 14 Day trip from Texas. We had spent months planning this trip, to get the best bang for our bucks and see as many sites as possible. For some reason, my buddy wanted to visit. I though it was going to be a waste and a little cheezy, but I agreed to go as tickets were really inexpensive. IT is actually a working chocolate factory and museum and chocolate carvings. I actually learned some interesting things about the cocoa plant, beans and there importance in ecomomics", "publishedDate": "2019-06-29", "language": "en", "rating": 3}, {"id": 684304076, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d619690-r684304076-Museu_de_la_Xocolata-Barcelona_Catalonia.html", "text": "Counter to what some other reviewers have recently written, I have to say that we really enjoyed our visit today. I was here five years ago and I was happy to return.\n\nThere is a competition each year in Barcelona and the winning chocolate creation appears in the museum. There is a wide variety of chocolate sculptures to view. There is a free audio guide which they don’t always tell you about as you pay your admission. You get a free treat when you pay your admission. There is a small reduction for seniors if you show your passport.\n\nAfter touring the museum, which takes about a half hour, you can go through the small café at the exit. You can also access the café without going through the museum. Order a hot chocolate. The small size is very inexpensive at €1.80. This is not a typical North American hot chocolate. This is actually melted chocolate and there are two sizes. The small one was enough for me! It is thick and wonderful to drink. And very hot.\n\nIf you like this review or the photos, please give me a thumbs up. You may also like to check my reviews of other tourist sites in Barcelona, and other Spanish cities, as well as Lisbon, Sintra, Porto, and cities in Australia and New Zealand, Southeast Asia and South America.", "publishedDate": "2019-06-25", "language": "en", "rating": 4}, {"id": 683112437, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d619690-r683112437-Museu_de_la_Xocolata-Barcelona_Catalonia.html", "text": "Feeling totally ripped off.  Staff were extremely rude (manager included).  We weren’t advised that there were no activities that day or we would have chosen a different day and time. When we asked we were talked too very rudely and interrupted by the staff on the desk. Don’t waste your time and money viewing stale chocolate ", "publishedDate": "2019-06-21", "language": "en", "rating": 1}, {"id": 683111120, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d619690-r683111120-Museu_de_la_Xocolata-Barcelona_Catalonia.html", "text": "Don’t waste your time in this tourist milking rip off operation. Small room with some poor chocolate statues. Activities not available unless booked ahead. We complained and asked for a refund but were given short rude no from the director. ", "publishedDate": "2019-06-21", "language": "en", "rating": 1}, {"id": 680748511, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d619690-r680748511-Museu_de_la_Xocolata-Barcelona_Catalonia.html", "text": "The admission ticket is a chocolate bar!!!\nIt's a small museum - only one story - filled with chocolate displays and information on the history of chocolate. A good stop in El Born especially on a rainy day.", "publishedDate": "2019-06-11", "language": "en", "rating": 4}, {"id": 680693951, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d619690-r680693951-Museu_de_la_Xocolata-Barcelona_Catalonia.html", "text": "A great rainy day activity, Price is right, just $6 for a candy bar to eat as you stroll around the museum. Just one floor but multiple rooms of intricate sculptures all made out of chocolate. Signs in English, we liked an interactive game to play asking questions of things learned from the museum and a matching game as well, teaches you about the gifts of chocolate and how it is made, upon exiting there is a culinary school with an all glass viewing area. This was very exciting to see over 20 apprentice chefs making sculptures out of colorful pulled sugar candy!", "publishedDate": "2019-06-11", "language": "en", "rating": 4}, {"id": 680017341, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d619690-r680017341-Museu_de_la_Xocolata-Barcelona_Catalonia.html", "text": "It is highly useless to loose time and money (6 euro) for 10 “statues” of chocolate most of then ugly. I can’t understand how that could have 3-4 start really....", "publishedDate": "2019-06-08", "language": "en", "rating": 1}, {"id": 678165841, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d619690-r678165841-Museu_de_la_Xocolata-Barcelona_Catalonia.html", "text": "We stumbled onto this museum on our way to the Picasso Museum and returned to visit.  Charming and well organized history of chocolate.  And you get a delicious chocolate bar with your ticket!  Features impressive chocolate sculptures by local and international pastry chefs, including one of Barca's Rinaldo Messi.  Great fun.", "publishedDate": "2019-06-01", "language": "en", "rating": 4}, {"id": 677448057, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d619690-r677448057-Museu_de_la_Xocolata-Barcelona_Catalonia.html", "text": "Huge building for a very small museum! Only took about 15 minutes to walk round. The ticket is actually a chocolate bar which is great! No opportunity for tasting the chocolate or making your own. Minimal activities for children.  Quite expensive for an average experience. Chocolate makes up for it though!", "publishedDate": "2019-05-29", "language": "en", "rating": 3}, {"id": 676834372, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d619690-r676834372-Museu_de_la_Xocolata-Barcelona_Catalonia.html", "text": "€6 each for a small bar of chocolate and access to a couple of rooms with chocolate machinery and statues. Sane your money!", "publishedDate": "2019-05-27", "language": "en", "rating": 1}, {"id": 676667129, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d619690-r676667129-Museu_de_la_Xocolata-Barcelona_Catalonia.html", "text": "First thing. Entrace ticket is edible. That is enough to visit. You will not lesrn a lot on chocolate but you will see nice chocolate sculpture", "publishedDate": "2019-05-26", "language": "en", "rating": 5}, {"id": 675994217, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d619690-r675994217-Museu_de_la_Xocolata-Barcelona_Catalonia.html", "text": "under renovation, so benefit of a doubt\nnot very exciting, poor explanations and terrible chocolate statues\nnot worth the visit", "publishedDate": "2019-05-23", "language": "en", "rating": 2}, {"id": 674853547, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d619690-r674853547-Museu_de_la_Xocolata-Barcelona_Catalonia.html", "text": "There are some interesting chocolate sculptures and items related to the history of chocolate and your entrance ticket is a small chocolate bar, It is free with the Barcelona card, and therefore worth a look. Not sure if it is worth paying an entrance fee (though it was free the day we visited anyway). I would like to have seen some more technical stuff about the manufacture of chocolate. Still, it passed a pleasant half hour and it is in a nice part of town.", "publishedDate": "2019-05-18", "language": "en", "rating": 3}, {"id": 670435699, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d619690-r670435699-Museu_de_la_Xocolata-Barcelona_Catalonia.html", "text": "We went to the museum after the. Birch and Picasso museum S it was in the area.  It was definitely a fun place to go and had some amazing chocolate creations of movie scenes, characters, architectural building etc.   \n\nIt was fun", "publishedDate": "2019-04-30", "language": "en", "rating": 3}, {"id": 668325716, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d619690-r668325716-Museu_de_la_Xocolata-Barcelona_Catalonia.html", "text": "It’s a shame this place has so many great reviews because it means you have high expectations...but it’s literally just one room with some statues made from chocolate. Not great if you’re expecting something more interesting!", "publishedDate": "2019-04-22", "language": "en", "rating": 2}, {"id": 667239903, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d619690-r667239903-Museu_de_la_Xocolata-Barcelona_Catalonia.html", "text": "Our second visit to this amazing museum in a couple of years and if you love chocolate and I mean drinking chocolate look no further! This is deliciously educational and Wow a must do while in old town Barcelona!", "publishedDate": "2019-04-17", "language": "en", "rating": 5}, {"id": 665712823, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d619690-r665712823-Museu_de_la_Xocolata-Barcelona_Catalonia.html", "text": "We were so excited to visit the museo de la Xocolata, specially our kids, but it was the worst visit ever!\nResuming a corridor with some chocolate statues. We have seen more and better in chocolate houses. We were expecting something wow since its a museu!\n6€ per adult, Not worth it. Better save it amd buy chocolates.\n", "publishedDate": "2019-04-12", "language": "en", "rating": 1}, {"id": 662522957, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d619690-r662522957-Museu_de_la_Xocolata-Barcelona_Catalonia.html", "text": "The museum has exhibits of impressive chocolate sculptures, but this can get a bit boring. They do have very informative panels that detail the history of chocolate, as well as the machines used to make chocolate. Ticket is a cute, small bar of dark chocolate. There were also a few classes going on in the attached school for making chocolate. If you register beforehand, there are also some small hands-on workshops, although I can't vouch for those as I didn't know they were there until I visited. Looked fun, especially for children, though, and I believe they are free as long as you sign up.", "publishedDate": "2019-03-31", "language": "en", "rating": 4}, {"id": 662486088, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d619690-r662486088-Museu_de_la_Xocolata-Barcelona_Catalonia.html", "text": "We re ll very excited to go to this place, especially my 6 year old son was thrilled when I told him we re going to this museum.  To keep it short once we got there, my son said \"that's it\"?  We re done in less than 10 mins.  Personally for the  amount of money we paid it wasn't worth it.", "publishedDate": "2019-03-31", "language": "en", "rating": 3}, {"id": 653975969, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d619690-r653975969-Museu_de_la_Xocolata-Barcelona_Catalonia.html", "text": "You won’t be wowed by the museum which has underwhelming visual exhibits about chocolate but if you allow yourself to read the accompanying written summaries for each exhibit you’ll learn much about the history of chocolate.  Your ticket is literally a chocolate bar which is a plus.  The museum is attached to what appeared to be an active working culinary school specializing in sweets/pastries.  You’ll be able to watch class (when in session) through glass walls.  ", "publishedDate": "2019-02-21", "language": "en", "rating": 5}, {"id": 650929044, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d619690-r650929044-Museu_de_la_Xocolata-Barcelona_Catalonia.html", "text": "Large display of figures made from chocolate as well as a detailed history of how chocolate came to Europe. Shop also sells a large range of amazing chocolate.", "publishedDate": "2019-02-08", "language": "en", "rating": 5}, {"id": 649366691, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d619690-r649366691-Museu_de_la_Xocolata-Barcelona_Catalonia.html", "text": "Just skip the \"museum\" as I am honestly shocked they can charge an admission. The subject matter drew me in and it was such a waste of money. There isn't much to look at and the few things there are silly.\n\nSpend the entry fee in the attached shop instead and call it a day. But, in total honesty, there are better chocolate shops tucked away in the Gothic Quarter but the museum shop is easy to find and has some lovely chocolates for purchase.", "publishedDate": "2019-01-31", "language": "en", "rating": 2}, {"id": 648158099, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d619690-r648158099-Museu_de_la_Xocolata-Barcelona_Catalonia.html", "text": "The subject matter, chocolate, drew me in, but the place is, frankly, corny and looks like it’s never been updated.  I can’t believe they charge an entry fee.  The chocolate bar “tickets” we were given were really stale.   The chocolate sculptures were impressive but hardly worth the fee. Spend your money on a hot chocolate and some churros someplace instead. Or treat yourself to some nice chocolates.", "publishedDate": "2019-01-25", "language": "en", "rating": 2}, {"id": 647109674, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d619690-r647109674-Museu_de_la_Xocolata-Barcelona_Catalonia.html", "text": "This is a museum of amazing sculptures in Chocolate, there is also a very nice cafe, which serves some of the best Hot Chocolate i have ever had, the opening portion is an exhibition of the history of chocolate\n\nNot on the scale of Cadbury world in Birmingham UK, but the sculptures are amazing, particularly the dragon from GOT.", "publishedDate": "2019-01-20", "language": "en", "rating": 4}, {"id": 646445595, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d619690-r646445595-Museu_de_la_Xocolata-Barcelona_Catalonia.html", "text": "We learned a lot about the history and etymology of chocolate, including where the substance referred to as \"white chocolate\" comes from and how they get away with calling it \"chocolate\".\n\nThere are some impressive examples of chocolate art.\n\nAt the end there is a barista where you MUST try the most amazing hot chocolate. It is like drinking a melted high-end chocolate bar. They also have a \"mocha\" which is that same hot chocolate mixed with an equal quantity of espresso. It is to die for.", "publishedDate": "2019-01-16", "language": "en", "rating": 5}, {"id": 644773432, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d619690-r644773432-Museu_de_la_Xocolata-Barcelona_Catalonia.html", "text": "This museum is small - it occupies one floor of an average-sized building, but you get to learn about the history of xocolata and see various sculptures made out of chocolate.  It's a good thing to do on a rainy afternoon or if you want to spend an hour somewhere nice.", "publishedDate": "2019-01-09", "language": "en", "rating": 4}, {"id": 642473435, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d619690-r642473435-Museu_de_la_Xocolata-Barcelona_Catalonia.html", "text": "My wife and I were keeping our expectations somewhat low since we have been to chocolate making and tasting events where we learned about the process. I guess what was most interesting about this museum is that they had many various sculptures, or rather pieces of Art, made from chocolate. What was rather disappointing, or should I say funny, was that many of the displays had broken pieces in them. If you want to kill some time and learn some things about chocolate while seeing some neat sculptures then I recommend going here. Plus, your entrance ticket that you scan is actually a candy bar with a flag on it from the country that you are from!", "publishedDate": "2018-12-30", "language": "en", "rating": 3}, {"id": 641138623, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d619690-r641138623-Museu_de_la_Xocolata-Barcelona_Catalonia.html", "text": "It is 6 euros but they give you a chocolate bar. If you have kids, it is probably a good place to go.", "publishedDate": "2018-12-23", "language": "en", "rating": 3}, {"id": 635249587, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d619690-r635249587-Museu_de_la_Xocolata-Barcelona_Catalonia.html", "text": "If you are in Barcelona do visit this place if you love chocolates, it's not just the story of chocolate and Spain's history with chocolate, it's the awesome spread of chocolates that want you to go again ana again. Don't forget to try the dark chocolate, giant bonbon and finally the hot chocolate that's heavenly, it's not too sweet and you just want to drink more and more and it's too hard to resist", "publishedDate": "2018-11-23", "language": "en", "rating": 5}, {"id": 634331739, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d619690-r634331739-Museu_de_la_Xocolata-Barcelona_Catalonia.html", "text": "When we arrived we were actually quite relieved to escape the rainstorm outside and have something indoors to do to kill some time. The most impressive thing about the museum are the chocolate sculptures. Not that you can eat them but the detail and effort that has been put into them is pretty cool. There's also a wall dedicated to some of the confectionary artists and what creations they're responsible for. \n          There's displays describing the history of chocolate as well as the equipment used in the chocolate making process. You don't expect it to be too long as there's only so much you can really talk about chocolate for. I believe there's also chocolate making demonstartions as well as but I think you might need to book a class in advance for this. There's a cafe and the shop has a good selection it was great to buy and try a variety of chocolate confectionary we'd not come across before.", "publishedDate": "2018-11-18", "language": "en", "rating": 3}, {"id": 630842972, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d619690-r630842972-Museu_de_la_Xocolata-Barcelona_Catalonia.html", "text": "My husband and I found this place walking around the Gothic quarter we were drawn in by the lovely chocolate scent.  Thought it was wonderful that our ticket was a chocolate bar.  Interesting exhibits, but a little small with just chocolate figure displays.  Tickets were cheap though it was a good time waster.", "publishedDate": "2018-11-04", "language": "en", "rating": 3}, {"id": 630507243, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d619690-r630507243-Museu_de_la_Xocolata-Barcelona_Catalonia.html", "text": "Not a very exciting museum. Not very informative. Quite short exhibition about the history of chocolate, but the museum primarily contains of sculptures made of chocolate. ", "publishedDate": "2018-11-03", "language": "en", "rating": 2}, {"id": 630441666, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d619690-r630441666-Museu_de_la_Xocolata-Barcelona_Catalonia.html", "text": "The good: \nChildren under 7 enter for free\nYour entry ‘ticket’ is a small bar of dark chocolate\n\nThe bad:\nThe museum is very small, the information is not presented in a way which is engaging to small children and many of the chocolate sculptures are cracked and broken.\nThe toilets were not clean and not easy to access.\n\nI would not return and not recommend this museum.", "publishedDate": "2018-11-03", "language": "en", "rating": 2}, {"id": 629934662, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d619690-r629934662-Museu_de_la_Xocolata-Barcelona_Catalonia.html", "text": "Although short I thought it was enjoyable and a perfect time killer between other activities. If I had one criticism it would be that a lot of the chocolate art was damaged. I think the exhibition could do with a bit of maintenance. ", "publishedDate": "2018-10-31", "language": "en", "rating": 3}, {"id": 629479211, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d619690-r629479211-Museu_de_la_Xocolata-Barcelona_Catalonia.html", "text": "Following an initial look at their website, this place sounded amazing.\n\nRather than offering an immersive experience with tastes and smells, the museum is simply just a load of chocolate sculptures on display with information on this history of chocolate (all probably sourced from google).\n\nTheir website suggests tasting sessions and opportunities to get involved; sadly they have to be privately organised well in advance.\n\nThe museum could do so much better with very little effort - e.g. offering regular guided tours every 15 minutes which include tasting sessions.\n\nA very poor experience overall - save your money and spend the 6 euro p.p. entry fee in a chocolate shop.", "publishedDate": "2018-10-29", "language": "en", "rating": 2}, {"id": 629291266, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d619690-r629291266-Museu_de_la_Xocolata-Barcelona_Catalonia.html", "text": "A small chocolate gallery masquerading as a museum. The highlights, a chocolate entry ticket and clever sculptures based (for the most part) on popular culture.  Not particularly informative and very limited archival material.", "publishedDate": "2018-10-29", "language": "en", "rating": 3}, {"id": 628611833, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d619690-r628611833-Museu_de_la_Xocolata-Barcelona_Catalonia.html", "text": "Stumbled upon this museum while touring Barcelona.  It is not a large museum, so you won’t need a lot of time, an hour at most.  There are some fun displays made out of chocolate, exhibits explaining about chocolate and machines and tools used when making chocolate.  There is a cafe where you can buy different types of chocolate and drinks.", "publishedDate": "2018-10-26", "language": "en", "rating": 3}, {"id": 624722616, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d619690-r624722616-Museu_de_la_Xocolata-Barcelona_Catalonia.html", "text": "Loved this place!  The things created with chocolate were breathtaking!  They ranged from complete scenes of superheroes and Star Wars to intricate single pieces (a dragon that looked like it was ready to breathe fire) . \n\nThe tickets are a chocolate bar! The guided audio tour tells the story of chocolate from its earliest beginnings.  The audio guides voice made us all giggle,  as she talks very sensuously about chocolate. \n\nThis is a great place to visit! We loved it!  \nFun and delicious too!! ", "publishedDate": "2018-10-14", "language": "en", "rating": 5}, {"id": 624317992, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d619690-r624317992-Museu_de_la_Xocolata-Barcelona_Catalonia.html", "text": "We came across the Museu de la Xocolata while walking to the Bari Gotic from our hotel and we stopped to have a dark chocolate drink. For €1.80 we had a xocolata petita, just the right consistency and sweetness. An unforgettable experience.", "publishedDate": "2018-10-12", "language": "en", "rating": 5}, {"id": 621566667, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d619690-r621566667-Museu_de_la_Xocolata-Barcelona_Catalonia.html", "text": "This place is chocolate everything. Upon entering the museum, you are handed chocolate that serves as your ticket and souvenirs. I learned so much about the process of making chocolate!", "publishedDate": "2018-10-02", "language": "en", "rating": 3}, {"id": 619871176, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d619690-r619871176-Museu_de_la_Xocolata-Barcelona_Catalonia.html", "text": "So exciting to see all of the chocolate sculptures!  Enjoyed the tour.  Desserts were great too.  A must see while in Barcelona!", "publishedDate": "2018-09-26", "language": "en", "rating": 5}, {"id": 617770885, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d619690-r617770885-Museu_de_la_Xocolata-Barcelona_Catalonia.html", "text": "Maybe 30 minutes?  Walked through the museum, saw some cool chocolate art (maybe 35 creations?), read/viewed some history on chocolate. Best part was the shop of chocolates.  Quick stop with a tasty gift shop. ", "publishedDate": "2018-09-18", "language": "en", "rating": 4}, {"id": 616901602, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d619690-r616901602-Museu_de_la_Xocolata-Barcelona_Catalonia.html", "text": "what a waste of time and money.. Just go out and buy yourself some good dark chocolate instead of going to this place.", "publishedDate": "2018-09-16", "language": "en", "rating": 1}, {"id": 613996654, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d619690-r613996654-Museu_de_la_Xocolata-Barcelona_Catalonia.html", "text": "We were expecting for something more impressive, bigger and more interesting, but the museum is very very small, quite and not really fun, even for kids.\nThe only really nice thing is the ticket for the place, you get a small chocolate with flag of your country. \n\n", "publishedDate": "2018-09-05", "language": "en", "rating": 3}, {"id": 612872956, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d619690-r612872956-Museu_de_la_Xocolata-Barcelona_Catalonia.html", "text": "With a family of four (2 boys 5 and 8) we were a little underwhelmed. Best parts were the shop and the free chocolate bar on entry which is the ticket. Otherwise it is just a history of chocolate making, lots of things made from chocolate and some machinery. Took us about 20 mins max to get through.", "publishedDate": "2018-09-01", "language": "en", "rating": 3}, {"id": 609371439, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d619690-r609371439-Museu_de_la_Xocolata-Barcelona_Catalonia.html", "text": "There is not much to see in the museum to justify the price. Also there is no chocolate manufacturing, just a small museum with few displays. This should be free or priced much lower.", "publishedDate": "2018-08-22", "language": "en", "rating": 2}, {"id": 609281819, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d619690-r609281819-Museu_de_la_Xocolata-Barcelona_Catalonia.html", "text": "During one of our days visiting Barcelona it started to rain so we came here as it was indoors. My husband is a huge fan of chocolate so thought this would be great. The entrance tickets are barcodes on chocolate bars associated with your home country which I thought was cool. The museum itself was underwhelming. While it shwocases a lot of very cool sculptures created with chocolate, the lack of chocolate history/interactive spaces made it a bit dull. At the end of the visit, they have a large chocolate selection which you can purchase chocolate. Maybe this is just because I'm Canadian (haha) but the lady selling the chocolate looked like she would rather be doing anything else except for working, she was super rude and left a bad taste in our mouth. I would recommend this place if you find yourself needing to fill some time during a rainy day but that's about it. I would spend 30 min here max.", "publishedDate": "2018-08-22", "language": "en", "rating": 3}, {"id": 607683012, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d619690-r607683012-Museu_de_la_Xocolata-Barcelona_Catalonia.html", "text": "It is nice that the ticket is chocolate and the sculptures are quite amazing. However, the service is not too great, e.g. we order some chocolate milks and my mom accidentally dropped one. Instead of offering a new one they got a bit upset.", "publishedDate": "2018-08-18", "language": "en", "rating": 3}, {"id": 607129588, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d619690-r607129588-Museu_de_la_Xocolata-Barcelona_Catalonia.html", "text": "Fairly small museum, finshed the tour in 30 min. It's ok for young kids to spend some quite time in Barcelona. Its certainly not a waste of time. ", "publishedDate": "2018-08-16", "language": "en", "rating": 4}, {"id": 604818591, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d619690-r604818591-Museu_de_la_Xocolata-Barcelona_Catalonia.html", "text": "HUGE waste of time.  Nothing to see except some chocolate sculptures.  The only thing worth seeing is the chocolate counter which is not part of the museum so is free.  Even still, would rather find a chocolate store nearby to visit and purchase gourmet chocolate.", "publishedDate": "2018-08-09", "language": "en", "rating": 2}, {"id": 604173024, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d619690-r604173024-Museu_de_la_Xocolata-Barcelona_Catalonia.html", "text": "Not recommended. The highlight is being given a small bar of chocolate.\nSterile, non-interactive displays.\nNeeds a major rethink!!\n", "publishedDate": "2018-08-07", "language": "en", "rating": 1}, {"id": 603761852, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d619690-r603761852-Museu_de_la_Xocolata-Barcelona_Catalonia.html", "text": "We were there with the kids hoping to have a nice afternoon, but the place was smaller than I expected. We finished the tour in 15 minutes only. There are some cute chocolate sculptures to see and some machines used in the making process of chocolates but, as I said, it was too little, too short.  ", "publishedDate": "2018-08-07", "language": "en", "rating": 3}, {"id": 601576575, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d619690-r601576575-Museu_de_la_Xocolata-Barcelona_Catalonia.html", "text": "The exhibition part of the museum is not especially impressive. Small museum for the entry price and the chocolate-bar “ticket” seems a fun idea from somewhere, but tasted like cheap cooking chocolate from a budget supermarket so even my kids threw them in the garbage. Thankfully the kids got in for free.\n\nYes there are some fun sounding activities for kids but note: you need to book well in advance!", "publishedDate": "2018-07-31", "language": "en", "rating": 1}, {"id": 599083345, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d619690-r599083345-Museu_de_la_Xocolata-Barcelona_Catalonia.html", "text": "The museum is small, but has a lot of information about the history of chocolate.  Unfortunately, most of it is in text, so the younger children are not engaged by it.  There are a lot of chocolate sculptures, but you can only appreciate so many.  There were a couple of films as well.  Overall the presentation was just okay.  Our kids were somewhat entertained.", "publishedDate": "2018-07-23", "language": "en", "rating": 3}, {"id": 595908569, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d619690-r595908569-Museu_de_la_Xocolata-Barcelona_Catalonia.html", "text": "Now, had a small window in Barcelona and so we thought why not try the Chocolate Museum. What an unexpected delight. Chocolate is all around and you think you know it but its history is fascinating. From the monks to the French ladies and their bonbons, through to its use as money. And the Chocolate sculptures are great. It's not a big place and so if you have some time pop in. And you can take classes as well. We didn't but looks interesting. So delight yourself. The hot chocolate drink is nice too. ", "publishedDate": "2018-07-13", "language": "en", "rating": 5}, {"id": 593244519, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d619690-r593244519-Museu_de_la_Xocolata-Barcelona_Catalonia.html", "text": "Whilst a fairly small museum i feel it is still worth a visit. You could be around it in under half an hour but its not that expensive to get in to and if you are in that direction it is nice to see all the scenes and characters made from chocolate.", "publishedDate": "2018-07-05", "language": "en", "rating": 5}, {"id": 592512132, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d619690-r592512132-Museu_de_la_Xocolata-Barcelona_Catalonia.html", "text": "Been to various chocolate museums previously, whilst ok it was not one of the greatest we have been to,only went to entertain the kids and utilise our BCN cards. Provide with your entry ticket in the form of a chocolate bar wrapped in the country you are visiting from, except for Scotland where the saltire appears to have been replaced by the Swiss flag. Limited in history of chocolate and interactive exhibits, but plenty of great chocolate sculptures to see", "publishedDate": "2018-07-02", "language": "en", "rating": 3}, {"id": 589775379, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d619690-r589775379-Museu_de_la_Xocolata-Barcelona_Catalonia.html", "text": "It’s seems appropriate that this museum is on the city that made chicken collate so famous. \nThe story of the development is laid out for all to see here and it is a good one. Very  good  layout and enjoyable was to spend an hour. \nShould be seen by all chocolate lovers to gain appreciation of the process ", "publishedDate": "2018-06-22", "language": "en", "rating": 5}, {"id": 589575132, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d619690-r589575132-Museu_de_la_Xocolata-Barcelona_Catalonia.html", "text": "I was a little unimpressed with this museum. I recommend only if you absolutely have nothing else to do. Although the sculptures are neat, there is not much else to do or see. I expected to see a live view of how chocolate is made or something of that nature... I can’t really complain for the price but I wouldn’t recommend to anyone.", "publishedDate": "2018-06-21", "language": "en", "rating": 2}, {"id": 587886804, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d619690-r587886804-Museu_de_la_Xocolata-Barcelona_Catalonia.html", "text": "This small museum presents a multitude of chocolate sculptures of many different popular scenes and interests. The chocolate itself, as a product, is less interesting. We stopped by the cafe at the end of the tour and sampled some coffee. However, DO NOT order the hot chocolate. Believe it or not, it has the consistency of nutella, and is virtually impossible to drink. This is a place of mild diversion if you happen to be in the area.", "publishedDate": "2018-06-16", "language": "en", "rating": 3}, {"id": 584805870, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d619690-r584805870-Museu_de_la_Xocolata-Barcelona_Catalonia.html", "text": "We were there for about 45 minutes. A good way to keep cool during the middle of the day. There are some interesting sculptures and an audio visual presentation on the history of chocolate. you get a piece of dark chocolate with your country's flag on it. About 6 euros entry. Worth it for a bit of a stop and to look around. You can connect to wifi for an audio guide but we didnt do that.", "publishedDate": "2018-06-03", "language": "en", "rating": 3}, {"id": 583177283, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d619690-r583177283-Museu_de_la_Xocolata-Barcelona_Catalonia.html", "text": "We thought this place was really nice and frankly adorable. Our entry ticket was a chocolate bar with our country flag on it!", "publishedDate": "2018-05-27", "language": "en", "rating": 5}, {"id": 580704648, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d619690-r580704648-Museu_de_la_Xocolata-Barcelona_Catalonia.html", "text": "Me and my friends had great expectations for this place. The scultures made entire from chocolate are impressive but it's just it! Nothing to be excited for. In the end you have to eat a chocolate because the smell makes you craving (when you buy the ticket they give you a small chocolate... the best ticket ever)", "publishedDate": "2018-05-16", "language": "en", "rating": 2}, {"id": 577025763, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d619690-r577025763-Museu_de_la_Xocolata-Barcelona_Catalonia.html", "text": "Quaint museum with gives an illustrated history of chocolat. Entrance fee of 6 euros with your chocolate bar. A place to visit when it is too hot or wet outside.", "publishedDate": "2018-05-01", "language": "en", "rating": 3}, {"id": 574987135, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d619690-r574987135-Museu_de_la_Xocolata-Barcelona_Catalonia.html", "text": "We visited the Chocolate Museum on a recent trip to Barcelona with the kids. \n\nHaving visited Caburys's World in Bourneville, we thought it would be a good place to visit with the kids. How wrong were we. Upon arrival you pay your admission fee and they ask you what country you are from, and you are given a small bar of dark chocolate for each member of your party, and than you walk around the museum which takes less than 20-30 mins and you come out into the cafe area where there are lots of chocolates to buy. That's literally it, there are no rides, no activities, literally some displays which had been put together.\n\nMy own recommendation would be to watch paint dry rather than visit the Chocolate Museum. Save your money and buy some chocolate from a supermarket and eat that instead, it'll be more enjoyable.", "publishedDate": "2018-04-22", "language": "en", "rating": 2}, {"id": 573622241, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d619690-r573622241-Museu_de_la_Xocolata-Barcelona_Catalonia.html", "text": "yes, impressed we were with how sculptures were made with chocolate, but it is a waste of money and time. just spend half an hour there", "publishedDate": "2018-04-15", "language": "en", "rating": 2}, {"id": 572205509, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d619690-r572205509-Museu_de_la_Xocolata-Barcelona_Catalonia.html", "text": "Cute, but not much to it. There were exhibits o  the history of Chocolate and a number of very cute chocolate sculptures, but thats about it. The admission is 6 Euros and you get a delicious chocolate bar labelled with  the country you are from. They said there was a free audio tour but we couldn't figure out how to get the app, so we just walked around and read the signs.", "publishedDate": "2018-04-09", "language": "en", "rating": 3}, {"id": 571080157, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d619690-r571080157-Museu_de_la_Xocolata-Barcelona_Catalonia.html", "text": "This is another Museum of Chocolate which inform you how is made, imported to Europe, etc. History of chocolate is very interesting as how is made too from cocoa plants. ", "publishedDate": "2018-04-04", "language": "en", "rating": 4}]}}]