[{"locationId": 3782382, "name": "Rambla del Mar", "placeType": "ATTRACTION", "reviewListPage": {"reviews": [{"id": 745659783, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d3782382-r745659783-Rambla_del_Mar-Barcelona_Catalonia.html", "text": "Excellent place to have a walk, sit for a drink, have a relaxed stroll..seagulls flying, nice breeze.. etc", "publishedDate": "2020-02-17", "language": "en", "rating": 5}, {"id": 735336811, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d3782382-r735336811-Rambla_del_Mar-Barcelona_Catalonia.html", "text": "If it wasn't too busy and wasn't too unsafe this would be an absolutely fantabulous bridge bit I get why since it's a big city.", "publishedDate": "2019-12-29", "language": "en", "rating": 3}, {"id": 727360764, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d3782382-r727360764-Rambla_del_Mar-Barcelona_Catalonia.html", "text": "Great area by the harbour for a walk. The path leads to the shopping centre and starts at Las Ramblas.", "publishedDate": "2019-11-18", "language": "en", "rating": 4}, {"id": 725012117, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d3782382-r725012117-Rambla_del_Mar-Barcelona_Catalonia.html", "text": "Lovely promenade walk which takes in the harbour and shopping centre and just off the Ramblas and Columbus column.", "publishedDate": "2019-11-08", "language": "en", "rating": 4}, {"id": 722299746, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d3782382-r722299746-Rambla_del_Mar-Barcelona_Catalonia.html", "text": "A lovely area at the bottom of Las Ramblas connecting onto Maremagnum. Great for a stroll to the shops for a browse or a beverage. A lovely area to be a tourist!", "publishedDate": "2019-10-29", "language": "en", "rating": 5}, {"id": 722264973, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d3782382-r722264973-Rambla_del_Mar-Barcelona_Catalonia.html", "text": "Rambla Del Mar is found at the bottom of Las Ramblas, just past the Columbus monument. The walkway and bridge is very impressive and great for photos. There is a shopping centre and some restaurants once over the bridge and you can walk right round the area viewing the spectacular yachts that one can only dream of owning! \nA nice place for a visit.", "publishedDate": "2019-10-29", "language": "en", "rating": 5}, {"id": 721821204, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d3782382-r721821204-Rambla_del_Mar-Barcelona_Catalonia.html", "text": "Nice open walkway with expansive views either side but unfortunately spoiled by the blanket sellers selling all kinds of cheap tourist crap , so much so that theres a sign on the walkway saying that you the customer will be fined for buying off the sellers , spoils the energy of what is a modern clean route to the Maremagnum and the beach", "publishedDate": "2019-10-27", "language": "en", "rating": 3}, {"id": 707262558, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d3782382-r707262558-Rambla_del_Mar-Barcelona_Catalonia.html", "text": "It's a lovely walk.you can see the fish, the beautiful port, and the maremagnum shopping center across the bridge! If you're lucky you get to see the bridge turn to let some sail boats through!", "publishedDate": "2019-09-06", "language": "en", "rating": 4}, {"id": 694149831, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d3782382-r694149831-Rambla_del_Mar-Barcelona_Catalonia.html", "text": "We had a great afternoon walk with the kids, the are is so nice, with outdoor restaurants to enjoy with the family", "publishedDate": "2019-07-30", "language": "en", "rating": 5}, {"id": 690694254, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d3782382-r690694254-Rambla_del_Mar-Barcelona_Catalonia.html", "text": "At the end of La Rambla is the Christopher Columbus Monument. The statue of Columbus points out across the port to the Mediterranean Sea. Head the direction that Columbus points and you will find Rambla de Mar. This is a beautiful seaside walk that provides  a wonderful view of Montjuïc and the bottom section of the Barri Gòtic. The Rambla of the Sea was designed by Helio Piñon and Albert Viaplana, opening in September 1994. It begins next to the Port Autònom building on Moll de la Fusta and stretches across to the wharf opposite, the Moll d'Espanya. Above and beyond walking around the port area, visitors will also find numerous options for pleasure boat trips in this area. Further, those walking in this area will also find a number of places for food and/or drinks, some with views of the harbor. Another area of Barcelona that is worth seeing.", "publishedDate": "2019-07-18", "language": "en", "rating": 3}, {"id": 690359840, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d3782382-r690359840-Rambla_del_Mar-Barcelona_Catalonia.html", "text": "The Rambla del Mar is an interesting walkway that takes you from the southern end of La Rambla, near Plaza de Colom to Maremagnum. Aside fro being a nice shortcut, the walkway gives fantastic views of Montjuic as well.", "publishedDate": "2019-07-17", "language": "en", "rating": 4}, {"id": 688203653, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d3782382-r688203653-Rambla_del_Mar-Barcelona_Catalonia.html", "text": "This shopping centre has a number of bars, cafes and restaurants. Shops are mid-range including a pharmacy. Be aware of the opening bridge that lets boats in and out of the harbour as well! Loads of hawkers in the areas selling knock-off goods...pickpockets as well I'm afraid!", "publishedDate": "2019-07-09", "language": "en", "rating": 4}, {"id": 686288230, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d3782382-r686288230-Rambla_del_Mar-Barcelona_Catalonia.html", "text": "Worth a visit to spend a few hours shopping at the Mall and a bite of lunch and few beers.  Cheaper drinks than in the City, with a view of the harbour.", "publishedDate": "2019-07-02", "language": "en", "rating": 4}, {"id": 684096886, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d3782382-r684096886-Rambla_del_Mar-Barcelona_Catalonia.html", "text": "My wife and I recently stayed in Barcelona for the first four nights of our trip and the last two before flying home.During both stays we visited Las Rambla and the Port area, Port Vell.\n\nThe port area is not to be missed. The sights, street vendors, cafes, restaurants and shops are a major reason to go here. We both went up the Columbus Monument (Mirador de Colom ), checked out numerous shops and walked across the bridge that connects the port to the La Rambla. We even rode the Teleferico de Montjuic....\n\nThere is so much to see and do in this area of Barcelona....You truly need to spend a couple of days taking it all in.", "publishedDate": "2019-06-24", "language": "en", "rating": 5}, {"id": 676698754, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d3782382-r676698754-Rambla_del_Mar-Barcelona_Catalonia.html", "text": "Nice place to hang around, shop or just buy something to eat. This is good starting point to discover Barcelona by walk to go to La Rambla or to the beach. Part is shopping centre and impressive aquarium.", "publishedDate": "2019-05-26", "language": "en", "rating": 5}, {"id": 675869056, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d3782382-r675869056-Rambla_del_Mar-Barcelona_Catalonia.html", "text": "This is a super area starting at the statue of Columbus.  Nice promenade,the wealth of the harbour and plenty restaurants. ", "publishedDate": "2019-05-23", "language": "en", "rating": 5}, {"id": 673212151, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d3782382-r673212151-Rambla_del_Mar-Barcelona_Catalonia.html", "text": "After you have walked down the La Rambla and passed the Columbus Statue you will come to a wavy wooden walkway continuing to Maremagnum Shopping Centre.\n\nOn our visit, Rambla del Mar was full of African men selling fake products. The walking space was very narrow.", "publishedDate": "2019-05-11", "language": "en", "rating": 3}, {"id": 672507895, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d3782382-r672507895-Rambla_del_Mar-Barcelona_Catalonia.html", "text": "Rambla del Mar is a wonderful timber walkway over the water, in Port Vell. It allows pedestrians to walk over the water to the area beyond, and reach the shopping complex on the far side , thus enjoying the stunning water views and more! We visited this area and just could not get enough! It is really beautiful. The walkway is called Rambla, as it is taken to be an extension of La Ramblas. However in reality it is not a proper extension, but it is good advertising by the locals, I think! The walkway is a little wavy in its design and this makes it even more appealing. At the entry point there is a bridge which opens whenever a \"big\" boat needs to cross at that spot. The whole opening and closing thing takes a while and is quite exciting, particularly for tourists, as the \"bridge\", which is the walkway, at that point moves slowly. It's something not to be missed.", "publishedDate": "2019-05-08", "language": "en", "rating": 5}, {"id": 650024862, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d3782382-r650024862-Rambla_del_Mar-Barcelona_Catalonia.html", "text": "This is where everyone, the locals, the expats, the tourists, are heading on a sunny day!\nEnjoy the salty air breeze, the vistas of the super-rich's yachts, the crowds, sip some vion or beer while sunbathing your face in the sun!", "publishedDate": "2019-02-03", "language": "en", "rating": 5}, {"id": 642666601, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d3782382-r642666601-Rambla_del_Mar-Barcelona_Catalonia.html", "text": "This harbour has a lovely wooden walkway taking you past the port. You can then walk around behind the shopping centre where the real treats lie in wait in the shape of the enormous sized yachts. Some of these mega rich vessels are as long as 100ft and look like cruise liners. Fantastic to see.", "publishedDate": "2018-12-31", "language": "en", "rating": 4}, {"id": 544372097, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d3782382-r544372097-Rambla_del_Mar-Barcelona_Catalonia.html", "text": "Lovely walk over a swing bridge takes you to Maremagnum Mall.  Lovely views of the port and Marina.  The Shopping Centre is not quite what I expected but it is nice enough.", "publishedDate": "2017-12-01", "language": "en", "rating": 4}, {"id": 541452426, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d3782382-r541452426-Rambla_del_Mar-Barcelona_Catalonia.html", "text": "This is really nice for a walk or even just sitting with your feet hanging over the edge. We always ended up near here at sunset and it was beautiful.", "publishedDate": "2017-11-16", "language": "en", "rating": 4}, {"id": 539193252, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d3782382-r539193252-Rambla_del_Mar-Barcelona_Catalonia.html", "text": "Nice open area for a wander in the sunshine\nwhen finished take a boat ride along the coast for a different perspective on Barcelona", "publishedDate": "2017-11-07", "language": "en", "rating": 4}, {"id": 539188916, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d3782382-r539188916-Rambla_del_Mar-Barcelona_Catalonia.html", "text": "Even though this bridge is a bit crowded, but it's worth the visit. It connect the aquarium and Port Vell to the Columbus Monument and Las Ramblas. But this is not the best thing about it; the architecture of the building, its view over the sun rays reflected on the water surface in the morning and its amazing light system in the night. All of the previous add more value to Rambla del Mar, It's a masterpiece itself and an amazing tourist attraction. \n\nI highly recommend walking over this bridge, enjoying the view and taking some pictures. It won't steal much time, but worth the visit", "publishedDate": "2017-11-07", "language": "en", "rating": 5}, {"id": 532872319, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d3782382-r532872319-Rambla_del_Mar-Barcelona_Catalonia.html", "text": "We walked along Rambla del Mar while waiting for our boat trip and we had a delightful stroll to Maremagnum where we had a delicious ice cream and then walked back.  Definitely worth a visit.", "publishedDate": "2017-10-14", "language": "en", "rating": 5}, {"id": 529114933, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d3782382-r529114933-Rambla_del_Mar-Barcelona_Catalonia.html", "text": "This is a nice walkway and you can see the marina from here.\nIf you happen to have a boat that needs to pass the walkway actually slides over. It was very cool.", "publishedDate": "2017-10-02", "language": "en", "rating": 4}, {"id": 527871912, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d3782382-r527871912-Rambla_del_Mar-Barcelona_Catalonia.html", "text": "A shopping and entertainment area. There are some interesting statues, some in the water. Street performers. Lots of cafes and other dining options. Even a retail center. Truly something for everyone, but there are much more interesting places to visit in Barcelona.", "publishedDate": "2017-09-27", "language": "en", "rating": 3}, {"id": 520627947, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d3782382-r520627947-Rambla_del_Mar-Barcelona_Catalonia.html", "text": "A nice place for enjoying the outdoor specially in good weather. Nice place for making sport or just simply walking.", "publishedDate": "2017-09-02", "language": "en", "rating": 5}, {"id": 517003525, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d3782382-r517003525-Rambla_del_Mar-Barcelona_Catalonia.html", "text": "Nice places very close to the port clean it's beautiful for family with kids after the mum can go to the closer mall for shopping ", "publishedDate": "2017-08-24", "language": "en", "rating": 3}, {"id": 506627379, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d3782382-r506627379-Rambla_del_Mar-Barcelona_Catalonia.html", "text": "Off people walking up and down This street and IT is a must IF you like that kind off thing, personally i dont get IT but", "publishedDate": "2017-07-28", "language": "en", "rating": 3}, {"id": 506364127, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d3782382-r506364127-Rambla_del_Mar-Barcelona_Catalonia.html", "text": "Rambla..a dream came throught. Every time I was in Barcelona, i spend 2 days walking on the Rambla..", "publishedDate": "2017-07-27", "language": "en", "rating": 5}, {"id": 502173532, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d3782382-r502173532-Rambla_del_Mar-Barcelona_Catalonia.html", "text": "This walkway takes you across from the Christopher Columbus monument area to the waterfront shopping and dining areas of Port Vell around the Maremagnum Centre.This walkway can be quite crowded,particularly when it opens and you wait for for a boat to  go through.", "publishedDate": "2017-07-15", "language": "en", "rating": 4}, {"id": 498644667, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d3782382-r498644667-Rambla_del_Mar-Barcelona_Catalonia.html", "text": "Head for Catalunya Metro Stn and head South towards the Columbus Monument and The Sea Port and you will find Rambla del Mar . So nice to feel some fresh ,cool air as i was so  hot with the heat . This bridge takes not long to cross and has great view of the Port and boats around it . With  a shopping mall and plenty of places to eat and drink this place is good on those hot , humid days , Just even to cool down . Also boat trips run most days and are not that dear next to the bridge .", "publishedDate": "2017-07-04", "language": "en", "rating": 4}, {"id": 494943917, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d3782382-r494943917-Rambla_del_Mar-Barcelona_Catalonia.html", "text": "One of the best locations in Barcelona. Lot of people taking photographs, crossing the bridge to explore the shopping mall, taking boat trips, sitting by the Pier, walking by the Promenade, watching the pleasure boats going and returning to Port, sailing boats going to sea, lots of activities and excitement going on. It is a fun and pleasurable place.", "publishedDate": "2017-06-21", "language": "en", "rating": 5}, {"id": 492482136, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d3782382-r492482136-Rambla_del_Mar-Barcelona_Catalonia.html", "text": "Nice sea side walk nothing special but nice on a hot day. Shopping centres close by as is why we walked this path.", "publishedDate": "2017-06-12", "language": "en", "rating": 3}, {"id": 492220433, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d3782382-r492220433-Rambla_del_Mar-Barcelona_Catalonia.html", "text": "Had nice little wonder around here! Lots of shops, nice views and other attractions there which we didn't do.", "publishedDate": "2017-06-11", "language": "en", "rating": 4}, {"id": 492203957, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d3782382-r492203957-Rambla_del_Mar-Barcelona_Catalonia.html", "text": "We walked here to get to the shops. Cute view of the sea and the boats. Just a nice place to feel the sea air.", "publishedDate": "2017-06-11", "language": "en", "rating": 3}, {"id": 485807739, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d3782382-r485807739-Rambla_del_Mar-Barcelona_Catalonia.html", "text": "It is one of the most beautiful places in Barcelona. This walkway allowed us to admire the port and old buildings surrounding it. It leads you from the well known La Rambla to the newest part and attractions of the area: the mega mall, the aquarium, etc.\nIts architecture emphasizes the creative side of the Spanish people and  it is well embedded in the overall architecture of the city.", "publishedDate": "2017-05-19", "language": "en", "rating": 5}, {"id": 483837494, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d3782382-r483837494-Rambla_del_Mar-Barcelona_Catalonia.html", "text": "Enjoyed getting away from the city areas to the sea air and just wander. Interesting architecture on landslide . Plenty of interest on marina and harbour. Nearby shopping mall if that's your thing. Plenty of restaurants outside.", "publishedDate": "2017-05-13", "language": "en", "rating": 5}, {"id": 483447188, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d3782382-r483447188-Rambla_del_Mar-Barcelona_Catalonia.html", "text": "This takes you over the harbor to a shopping area and the aquarium.  I liked the floating sculptures in the water by Robert Llimos.  ", "publishedDate": "2017-05-11", "language": "en", "rating": 3}, {"id": 483355620, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d3782382-r483355620-Rambla_del_Mar-Barcelona_Catalonia.html", "text": "This area gets very busy on Sundays and holidays, but quiet early morning.  Its the walkway to the aquarium and shopping mall. Watch the seagulls if you are eating food!", "publishedDate": "2017-05-11", "language": "en", "rating": 4}, {"id": 482034211, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d3782382-r482034211-Rambla_del_Mar-Barcelona_Catalonia.html", "text": "The street linking the Columbus monument to Maremagnum. It has a nice view of the harbor and the big cruise ships.", "publishedDate": "2017-05-06", "language": "en", "rating": 4}, {"id": 480293964, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d3782382-r480293964-Rambla_del_Mar-Barcelona_Catalonia.html", "text": "Following on from the bottom of La Ramblas you can enjoy this lovely walk across the water. Leading to the magnificent port and the huge shopping centre ' Magnum' also the aquarium. It does get busy but worth the visit, you can also quite easily from here see the cable car further up that takes you up to mount Motujuic.", "publishedDate": "2017-04-30", "language": "en", "rating": 5}, {"id": 480005360, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d3782382-r480005360-Rambla_del_Mar-Barcelona_Catalonia.html", "text": "I really like this place, it's calming and you feel like you are walking on the sea - it's usually super crowded, but if you go there early in the morning, it tends to be quite empty.", "publishedDate": "2017-04-29", "language": "en", "rating": 4}, {"id": 474084591, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d3782382-r474084591-Rambla_del_Mar-Barcelona_Catalonia.html", "text": "It was nice walking on the paved way reaching the aquarium and the mare magnum shopping center. Some yachts, some seagulls and the sea under the sun. What else ?", "publishedDate": "2017-04-10", "language": "en", "rating": 4}, {"id": 473233524, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d3782382-r473233524-Rambla_del_Mar-Barcelona_Catalonia.html", "text": "A mix of promenade, pier and bridge to the aquarium and small shopping centre. The best bit is to look over the edge and see the fish.", "publishedDate": "2017-04-06", "language": "en", "rating": 4}, {"id": 472209276, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d3782382-r472209276-Rambla_del_Mar-Barcelona_Catalonia.html", "text": "There a lot of places to go at Barcelona before Maremagnum. The food here is just standar, and the views are regular. Enjoy at Barceloneta or Badalona, don't waste your time & money here.", "publishedDate": "2017-04-02", "language": "en", "rating": 2}, {"id": 470936675, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d3782382-r470936675-Rambla_del_Mar-Barcelona_Catalonia.html", "text": "The only reason for this boardwalk's existence is to attract tourists to the mall and aquarium on the beach. There are no locals here, just tourists. It is always really crowded. There is nothing special about this.", "publishedDate": "2017-03-28", "language": "en", "rating": 3}, {"id": 470634099, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d3782382-r470634099-Rambla_del_Mar-Barcelona_Catalonia.html", "text": "The Rambla  De Mar, connects La Rambla to Port Vell a focal point of the city and tourists attraction.\nIt contains the Maremagnum, a mall containing shops, a multiplex cinema, bars, restaurants and an aquarium so is quite a bustling place to  be.\nIt's a wonderful scenic walk especially along the Marina/Port with the white floating subbuteo figures in the harbour (Unsure of what they are).", "publishedDate": "2017-03-27", "language": "en", "rating": 4}, {"id": 469597444, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d3782382-r469597444-Rambla_del_Mar-Barcelona_Catalonia.html", "text": "it's not far from the maritime museum.  The area itself is quite a nice walk.  It has a good little bustling vibe to it.  The boats are pretty.  The cable car looks scary but I'm sure some people might find them fun.  The shopping area is good with many highstreet brands.  A good place to spend a few hours.", "publishedDate": "2017-03-23", "language": "en", "rating": 4}, {"id": 467976404, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d3782382-r467976404-Rambla_del_Mar-Barcelona_Catalonia.html", "text": "Wonderful area to walk the Barcelona harbor area and take in the sights and sounds of the marina it surrounds.  Modern pieces of architecture are like waves in the air over this usually crowded boardwalk.  Entry near Christopher Columbus monument at harbor end of Las Ramblas.", "publishedDate": "2017-03-16", "language": "en", "rating": 4}, {"id": 463830934, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d3782382-r463830934-Rambla_del_Mar-Barcelona_Catalonia.html", "text": "This innovative walkway along and above the harbor is a delightful place to stroll. It is sited next to the old yacht club, and if you're lucky, a tall masted sailing vessel will need to pass under the walkway (which is also a bridge) as you stroll. Then you get to experience the walkway as a drawbridge as it swings open to let the boat pass. This only takes a few minutes but it's fun to be part off. The extra time also allows you to take a closer look at the white floating sculptures in the harbor. Clearly human figures, I can't begin to guess what they \"mean,\" but they're whimsical and well done", "publishedDate": "2017-03-01", "language": "en", "rating": 5}, {"id": 461209935, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d3782382-r461209935-Rambla_del_Mar-Barcelona_Catalonia.html", "text": "Lovely boardwalk over swing bridge which is periodically lifted to allow shipping through. The shopping centre is a shopping centre...", "publishedDate": "2017-02-19", "language": "en", "rating": 4}, {"id": 460865962, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d3782382-r460865962-Rambla_del_Mar-Barcelona_Catalonia.html", "text": "This is a lovely stroll along the marina and the port with numerous shops and restaurants to match.\nWhile the traffic on the road might be heavy, it is possible to get further away from the road towards the sea and continue the stroll there.", "publishedDate": "2017-02-18", "language": "en", "rating": 3}, {"id": 460615396, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d3782382-r460615396-Rambla_del_Mar-Barcelona_Catalonia.html", "text": "you can walk there over a cool bridge (be aware, that there a boats sailing in and out - you can't pass then and have to wait) - there's a shopping center which is open 365 days a year. you can sit on benches and look on yachts, the city. there's some restaurants where you can sit outside and look on the water - it really is a lovely stroll", "publishedDate": "2017-02-17", "language": "en", "rating": 4}, {"id": 459950888, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d3782382-r459950888-Rambla_del_Mar-Barcelona_Catalonia.html", "text": "Barcelona is made for walking, and this route is lovely, once you shoulder your way through the many, many other people also enjoying the journey. Most of the street art are by Miro, which is fun and playful and a treat to photograph. And the constant presence of the sea is very pleasing. ", "publishedDate": "2017-02-15", "language": "en", "rating": 4}, {"id": 459333146, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d3782382-r459333146-Rambla_del_Mar-Barcelona_Catalonia.html", "text": "You have not been in Barcelona if you have not been walking down the Rambla. There is a lot of people (be aware of your pockets) but a must go when you are in Barcelona. A lot of turists. From the big square down to the harbour - just fantastic.", "publishedDate": "2017-02-13", "language": "en", "rating": 3}, {"id": 454039057, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d3782382-r454039057-Rambla_del_Mar-Barcelona_Catalonia.html", "text": "A nice walkway over the water, lovely views of Montjuic in the background. There are some nice restaurants to eat at the end, especially in the summer though can be a little pricey, the shopping mall at the end is also quite good. ", "publishedDate": "2017-01-22", "language": "en", "rating": 5}, {"id": 453192334, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d3782382-r453192334-Rambla_del_Mar-Barcelona_Catalonia.html", "text": "One of our favourite spots. Plenty of spots to eat and drink, be careful of blanket sellers and pick pockets but don't let that put you off -  situated at the end of Las Ramblas and easy to find.  Great sea views and of the harbour", "publishedDate": "2017-01-18", "language": "en", "rating": 4}, {"id": 452279354, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d3782382-r452279354-Rambla_del_Mar-Barcelona_Catalonia.html", "text": "I quote David B \"At the end of the La Rambla and the Columbus monument and come to this area. The walkway opened to let one of the boats out the marina. Again adding something different to the day out. There is also a modern shopping centre that has many places to eat\". all I can add is be careful of pickpockets especially when the bridge opens and then you are packed like sardines waiting for it to close so you can continue on.", "publishedDate": "2017-01-15", "language": "en", "rating": 4}, {"id": 451753323, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d3782382-r451753323-Rambla_del_Mar-Barcelona_Catalonia.html", "text": "This is a contemporary twist on La Rambla and takes you across the water in the marina across a wooden walkway, complete with swingbridge for passing boats. There are plenty of places to sit and watch the world go by, boats come and go and enjoy the sea air, but it can also be very crowded, and when it is, street vendors are there en-masse (literally in their hundreds) selling their fake goods and generally causing an obstruction.", "publishedDate": "2017-01-13", "language": "en", "rating": 3}, {"id": 447682055, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d3782382-r447682055-Rambla_del_Mar-Barcelona_Catalonia.html", "text": "Great views of the sea and harbor area; take La Rambla all the way to the sea and you have your choice of clubbing, walking or bike riding along the shoreline, visiting one of the many restaurants or bars, etc.", "publishedDate": "2016-12-29", "language": "en", "rating": 4}, {"id": 440329508, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d3782382-r440329508-Rambla_del_Mar-Barcelona_Catalonia.html", "text": "Rambla del Mar is an extension to the popular La Rambla area of Barcelona.\nThis takes in the waterfront area adjacent to the Puerto Colon statue, and the walkway/bridge over the marina to the shopping centre Maremagnum.\nDespite work done by the local police, there are still a number of 'blanket' sellers peddling their wares. Be warned, if you are caught purchasing from these guys, YOU can be fined €50!", "publishedDate": "2016-11-27", "language": "en", "rating": 3}, {"id": 439815397, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d3782382-r439815397-Rambla_del_Mar-Barcelona_Catalonia.html", "text": "I enjoyed a quiet stroll to the aquarium surrounded by the boats and sea air. The wooden undulating walkway was lovely on a sunny day and despite the mall at the end-not too crowded. At night the lights are lovely but it is a lot more crowded with vendors and people going to restaurants-but the view with the lights is worthwhile. It depends on personal preference when you would like it most, I love the sun and sea air. I also visited both times in the off-season so it was not too crowded.", "publishedDate": "2016-11-24", "language": "en", "rating": 4}, {"id": 439473795, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d3782382-r439473795-Rambla_del_Mar-Barcelona_Catalonia.html", "text": "At the end of the La Rambla and the Columbus monument and come to this area. The walkway opened to let one of the boats out the marina. Again adding something different to the day out. There is also a modern shopping centre that has many places to eat.", "publishedDate": "2016-11-23", "language": "en", "rating": 4}, {"id": 436935890, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d3782382-r436935890-Rambla_del_Mar-Barcelona_Catalonia.html", "text": "As part of our stroll along La Rambla, we also took a walk along this new section.  While impressive, it does not have the history or the grandeur of the original street.  However, there are some nice views and it is quite a pleasant place to walk,", "publishedDate": "2016-11-13", "language": "en", "rating": 4}, {"id": 436689665, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d3782382-r436689665-Rambla_del_Mar-Barcelona_Catalonia.html", "text": "I first saw it on arrival, and I didn't pay much attention, then on my last day I came because of the lights and wow! What a nice place to visit! There is food, there are people selling stuff, and the lights at night just amazing! It might be a little busy but for a Sunday night when most places are closed this area was great! You should definitely come by and see it for yourself! Barcelona is great any day!! ", "publishedDate": "2016-11-12", "language": "en", "rating": 5}, {"id": 436312397, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d3782382-r436312397-Rambla_del_Mar-Barcelona_Catalonia.html", "text": "Designed in 1994 by the architects Albert Viaplana and Helio Piñón, the Rambla de Mar is an undulating wooden walkway over the water, with two openings. It`s supported over the water by two iron arms. Every hour on the dot it opens up to allow recreational boats to pass through.", "publishedDate": "2016-11-11", "language": "en", "rating": 4}, {"id": 435165573, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d3782382-r435165573-Rambla_del_Mar-Barcelona_Catalonia.html", "text": "This is where La Rambla meets the port area and although interesting it is not the most attractive or interesting. Worth a visit but there is more places of interest in the Gothic area.", "publishedDate": "2016-11-06", "language": "en", "rating": 3}, {"id": 429928147, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d3782382-r429928147-Rambla_del_Mar-Barcelona_Catalonia.html", "text": "If you have more time, you could go there. Nice,but nothing special. Many little shops. I liked the atmosphere.", "publishedDate": "2016-10-20", "language": "en", "rating": 4}, {"id": 429670080, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d3782382-r429670080-Rambla_del_Mar-Barcelona_Catalonia.html", "text": "The place is definitely packed with tourists. There's a big shopping mall, so if you need something you could find it there but other than that, there's not many reason to go on Rambla del Mar. It's basically continuation of Las Rambla, a place to avoid. ", "publishedDate": "2016-10-19", "language": "en", "rating": 2}, {"id": 429544813, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d3782382-r429544813-Rambla_del_Mar-Barcelona_Catalonia.html", "text": "This is a lovely place to stroll and check out the activities around and the yachts etc. moored in the harbour. Places nearby for picnics and for the kids to play. Markets nearby on different days.", "publishedDate": "2016-10-18", "language": "en", "rating": 5}, {"id": 429401346, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d3782382-r429401346-Rambla_del_Mar-Barcelona_Catalonia.html", "text": "We happened on the Rambla Del Mar as a continuation of our walk from Las Ramblas.  We chose the absolute worst time to come here.  Height of the tourist season at night when all the street vendors have set up their wares on the walkway.  Hence, you have the equivalent of the population of a small country trying to squeeze through a gauntlet only 2 metres wide in places because half the walk way cannot be used for walking.  Claustrophobia sets in, you can't see the view if there is one because it's dark, you shuffle along with the sea of humanity and only stop in front of one of the vendors and haggle for a blanket you really don't need just because you need a break from the monotony of walking to where?\n\nAfter buying your blanket for what you think is a great price you walk a few minutes and find another vendor who has the exact same blanket who would have sold his to you for 5 Euros less than what you paid for yours.  So what did you do?  You buy the second blanket as well to not feel so cheated the first time.  Now you have two blankets you never needed in the first place... and shuffle back in line and try to make it out of there without having to buy a third.\n\nCould have spent my time better instead of spending my money here.", "publishedDate": "2016-10-18", "language": "en", "rating": 2}, {"id": 427782452, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d3782382-r427782452-Rambla_del_Mar-Barcelona_Catalonia.html", "text": "A very nice promenade placed in Port Vell.It's mobile and it can be moved to allow the yachts passing in the touristic harbor.Very nice views of the area.You can even feed the fishes swimming under you feet.", "publishedDate": "2016-10-13", "language": "en", "rating": 4}, {"id": 425237577, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d3782382-r425237577-Rambla_del_Mar-Barcelona_Catalonia.html", "text": "An interesting modern bridge separating the yaught harbour and the ferry harbour. At one end is the Magnamare shopping centre and a fish restaurant.", "publishedDate": "2016-10-05", "language": "en", "rating": 4}, {"id": 423745405, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d3782382-r423745405-Rambla_del_Mar-Barcelona_Catalonia.html", "text": "Nice place to take a daily walk or to spend your evening. There was different attractions so it can get crowded. Try sipping a mojito or a glass of sangria and for sure you will have a good night! ", "publishedDate": "2016-09-30", "language": "en", "rating": 4}, {"id": 421245587, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d3782382-r421245587-Rambla_del_Mar-Barcelona_Catalonia.html", "text": "Shopping center and some touristic restaurants next to the water. Nothing really special, but it is a good place to chill in the sun next to the water and watch the people go by", "publishedDate": "2016-09-22", "language": "en", "rating": 3}, {"id": 419851459, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d3782382-r419851459-Rambla_del_Mar-Barcelona_Catalonia.html", "text": "A very typical place to visit a lot to do in this area lots of restaurants and places to explore a different variety of foods and events.", "publishedDate": "2016-09-18", "language": "en", "rating": 5}, {"id": 419081149, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d3782382-r419081149-Rambla_del_Mar-Barcelona_Catalonia.html", "text": "Went for the boat tour to see the skyline was ok, boat was clean and efficient but no commentary so a bit boring ", "publishedDate": "2016-09-16", "language": "en", "rating": 3}, {"id": 416019837, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d3782382-r416019837-Rambla_del_Mar-Barcelona_Catalonia.html", "text": "Very nice place to go ,\nThere are in the place also big mall that open on Sundays when all the other malls are closed", "publishedDate": "2016-09-08", "language": "en", "rating": 4}]}}]