[{"locationId": 7055716, "name": "Refugio Antiaereo de la Placa Del Diamant", "placeType": "ATTRACTION", "reviewListPage": {"reviews": [{"id": 584070132, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d7055716-r584070132-Refugio_Antiaereo_de_la_Placa_Del_Diamant-Barcelona_Catalonia.html", "text": "Very interesting point of view to understand what Spanish civil war was for lot of people. Outside the refugi they provide a brief explanation of Barcelona during that time. ", "publishedDate": "2018-05-31", "language": "en", "rating": 4}, {"id": 472501009, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d7055716-r472501009-Refugio_Antiaereo_de_la_Placa_Del_Diamant-Barcelona_Catalonia.html", "text": "Been here for a visit with some friends. Organization is good, also a very nice and prepared staff made the two hours of visit shorter than expectations. ", "publishedDate": "2017-04-03", "language": "en", "rating": 4}, {"id": 276005204, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d7055716-r276005204-Refugio_Antiaereo_de_la_Placa_Del_Diamant-Barcelona_Catalonia.html", "text": "Visiting the Refugio of the Placa del Diamant is an amazing way to learn a little more about the Spanish Civil War---which, let's face it, can still be a little confusing to many Americans. The brief introduction with photographs helps to put the bombardment of Barcelona in a historical perspective, while at the same time helping you to learn about the horrors of the Spanish Civil War for Barcelona's citizens. The tour inside is interesting for both kids and adults. Our guide, Ruben, was amazing, and we felt so fortunate to get his knowledge and perspective on this historical event. Our group included grandparents and kids, and everyone came away with a new insight. Be aware that this trip is not handicapped accessible, and you need to be prepared to walk up and down about 60 steps.", "publishedDate": "2015-05-31", "language": "en", "rating": 5}, {"id": 212374730, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d7055716-r212374730-Refugio_Antiaereo_de_la_Placa_Del_Diamant-Barcelona_Catalonia.html", "text": "During the Spanish Civil War (1936 - 1939), the city of Barcelona was systematically bombed by the pro-Franco air force and his allies, Italy and Germany. As a result, the citizens build air raid shelters to protect themselves from the attacks. One of the biggest and the best conserved air raid shelters can be found underneath the Plaça del Diamant. It is a network of narrow tunnels (250 meters length) and small rooms, twelve metres below street level. Around 200 residents could take refuge here when the siren started to sound. The walls and ceiling are made of bricks and they are rich with history. To this day you can still see the stone benches, nursery and the basic male and female lavatories and on the walls there is still smoke from the candles used to light up the bomb shelter.\n\nThis shelter  was rediscovered in 1992. Once a week guided visits are organised so you can see how a civilian population defended itself in a city besieged by bombs. During the visits, visitors are actively involved, and they play the role of people who hid in the shelters. For reservations contact: Taller Història Gràcia Tel. 0034 932 196 134 or e-mail tallerhistoriagracia@gmail.com.", "publishedDate": "2014-06-27", "language": "en", "rating": 4}]}}]