[{"locationId": 10445408, "name": "Immersión con tiburones Aquarium Barcelona", "placeType": "ATTRACTION", "reviewListPage": {"reviews": [{"id": 652797043, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d10445408-r652797043-Immersion_con_tiburones_Aquarium_Barcelona-Barcelona_Catalonia.html", "text": "If you are planing a visit to the Barcelona Aquarium please be advised that the security staff is none existent.\nThey are seriously understaff and your safety might be in jeopardy at any given moment. \nDONT TAKE YOUR FAMILY!! There is no security!’ ", "publishedDate": "2019-02-16", "language": "en", "rating": 1}, {"id": 652593722, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d10445408-r652593722-Immersion_con_tiburones_Aquarium_Barcelona-Barcelona_Catalonia.html", "text": "Very average and for the cost of €20 an adult probably not worth we went on a relatively quiet day but even then some display/fish tanks you couldn't see properly also some displays closed on the whole not value for money and  better aquarium s to go see ", "publishedDate": "2019-02-15", "language": "en", "rating": 3}, {"id": 643399941, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d10445408-r643399941-Immersion_con_tiburones_Aquarium_Barcelona-Barcelona_Catalonia.html", "text": "Acording with the price it was a poor experience. I visit the full aquarium and no news activities or shows are added to the visit. The bathroom was old and dirty. Full of kids in the area, it ahould be an schedule only for kids. Poor experience. ", "publishedDate": "2019-01-03", "language": "en", "rating": 1}, {"id": 641452827, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d10445408-r641452827-Immersion_con_tiburones_Aquarium_Barcelona-Barcelona_Catalonia.html", "text": "I decided to swim with sharks today. The instructor was speaking really good English , he explained all details very thoroughly for me to understand. I've never had experience with scuba diving before. He was reassuring every step of mine, and he was extra cautious. He taught me how to breathe underwater with all the equipment. He took me into the tank with the fish, while I followed his instructions completely. We did two rounds in the tank, while he was holding me all the time, I never felt scared. All animals were near us but he was moving me around, so I didn't have to make any effort but breathing. It was a great experience for me. Ideal even for kids. They provide everything . Towels, diving suits, fins, shoes , ofc all the proper scuba diving equipment. I left the aquarium with the best feelings, impressions and memories. Pricelist can be found on the aquarium's site. ", "publishedDate": "2018-12-25", "language": "en", "rating": 5}, {"id": 583242002, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d10445408-r583242002-Immersion_con_tiburones_Aquarium_Barcelona-Barcelona_Catalonia.html", "text": "After visiting Barcelona, we decided to finish the day with the Aquarium and wasn’t disappointed, plenty to see and we easily spent an afternoon here! The moving floor in the tunnel was a really good idea and moved slowly enough to get a good view of the sharks and fish. I would definitely go there again. There were plenty of little kids as well and a big Hall with things to do to keep them entertained. Well priced at €20 each adult.", "publishedDate": "2018-05-28", "language": "en", "rating": 4}, {"id": 564385720, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d10445408-r564385720-Immersion_con_tiburones_Aquarium_Barcelona-Barcelona_Catalonia.html", "text": "We have been to a lot of aquariums lately and this one doesn’t rank in the top ten.....\nMake sure you have your tickets prebooked and printed out to avoid queues. Once inside, the aquarium offers a circular conveyor where you can step on and let yourself get carried away ( sorry for the pun) ", "publishedDate": "2018-03-04", "language": "en", "rating": 3}, {"id": 550189841, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d10445408-r550189841-Immersion_con_tiburones_Aquarium_Barcelona-Barcelona_Catalonia.html", "text": "The Barcelona Aquarium is a fun experience. From the various tanks of the different regions, to the escalator-type circular ride of the big tank.  It is fun and very educational. The penguin exhibit was great!", "publishedDate": "2017-12-30", "language": "en", "rating": 5}, {"id": 535407662, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d10445408-r535407662-Immersion_con_tiburones_Aquarium_Barcelona-Barcelona_Catalonia.html", "text": "The aquarium itself is fine, but not on the scale of Baltimore or Valencia. The actual experience of being able to dive with the sharks was incredible though! The instructor was very kind and helpful even though I don't speak much Spanish (my bad!). I had never scuba dived before so it was a doubly new experience. The stingrays and sharks all swam right by the cage and the instructor takes you out in the open water one by one and swims you be all the sharks, It was awesome and I can't wait to do it again. Next time I'll remember to bring a GoPro.", "publishedDate": "2017-10-23", "language": "en", "rating": 5}, {"id": 505705711, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d10445408-r505705711-Immersion_con_tiburones_Aquarium_Barcelona-Barcelona_Catalonia.html", "text": "Made the mistake of going around midday and not first thing. Lots of smelly unwashed people in a confined space is not good! Aquarium itself is good and very informative, quite expensive to go in. Good , level flooring for wheelchairs and trolleys. Electric walkway good through the tunnels, leaves you able to watch the fish above you. Penguins always good fun, even when they have been fed. If you can avoid the cafeteria, very overpriced and food not good, staff attitude is they are doing you a massive favour by serving you not that they are ripping you off charging 20 euros for chicken burger, chips and a coke!", "publishedDate": "2017-07-26", "language": "en", "rating": 4}, {"id": 458160291, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d10445408-r458160291-Immersion_con_tiburones_Aquarium_Barcelona-Barcelona_Catalonia.html", "text": "The aquarium was pretty quiet when we got there, but as you can buy your tickets and go within 90 days there's no reason not to pre-purchase.\nThe aquarium has many many gorgeous tanks of fish, we spent almost 3 hours in here! There are large tanks and small ones, things for all the family to enjoy.\nThe only one thing I didn't like was the lit signs above the tanks were visible in almost every photo I took -  my husband must've looked like a muppet covering the reflection with his arms for me.\nThe moving walkway at the end is a bit rickety, but a perfect end to it. I would definitely recommend this place to anyone going to Barcelona!", "publishedDate": "2017-02-08", "language": "en", "rating": 5}, {"id": 428490973, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d10445408-r428490973-Immersion_con_tiburones_Aquarium_Barcelona-Barcelona_Catalonia.html", "text": "Largest aquarium in Europe, excellent for all, great education for kids. Buy tickets in advance to save queuing.", "publishedDate": "2016-10-16", "language": "en", "rating": 4}, {"id": 416093120, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d10445408-r416093120-Immersion_con_tiburones_Aquarium_Barcelona-Barcelona_Catalonia.html", "text": "The Barcelona aquarium is definitely a experience worth having. Very impressive and magical. Excellent for a family or friends trip.", "publishedDate": "2016-09-08", "language": "en", "rating": 5}]}}]