[{"locationId": 265458, "name": "La Barceloneta", "placeType": "ATTRACTION", "reviewListPage": {"reviews": [{"id": 749670369, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d265458-r749670369-La_Barceloneta-Barcelona_Catalonia.html", "text": "You can stay there whole day! From morning run, through lunch with a sea view to late night parties in one of many clubs! Worth visiting!", "publishedDate": "2020-03-07", "language": "en", "rating": 5}, {"id": 749296226, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d265458-r749296226-La_Barceloneta-Barcelona_Catalonia.html", "text": "Excellent boulevard and beach to enjoy a time in front of the mediterranean sea in the heart of Barcelona city ! Lots of cafe and bars, restaurants and other facilities. Nice to do walking , biking , sport, etc. Come and visit !!!", "publishedDate": "2020-03-05", "language": "en", "rating": 5}, {"id": 744349575, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d265458-r744349575-La_Barceloneta-Barcelona_Catalonia.html", "text": "We came early in the morning and it was really peaceful. We were able to see the sunrise and it was beautiful! I think early morning is the best time to go there if you hate crowds. A must-see!", "publishedDate": "2020-02-11", "language": "en", "rating": 5}, {"id": 735768951, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d265458-r735768951-La_Barceloneta-Barcelona_Catalonia.html", "text": "An amazing beach, warm weather in December, barcelona and Barceloneta are the place to be in winter.", "publishedDate": "2019-12-30", "language": "en", "rating": 5}, {"id": 735694818, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d265458-r735694818-La_Barceloneta-Barcelona_Catalonia.html", "text": "We took the bus #59 on La Rambla to get there. I recommend getting off the bus near last stop to avoid the crowds. You get to have a nice and peaceful walk and no need to rush to take photos.\nThere are various kinds of nice restaurants at the end of the beach with more reasonable prices. ", "publishedDate": "2019-12-30", "language": "en", "rating": 5}, {"id": 734853816, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d265458-r734853816-La_Barceloneta-Barcelona_Catalonia.html", "text": "I have to say I love the lobster I think it’s absolutely amazing. The neighbourhood has bars and has a gorgeous view.", "publishedDate": "2019-12-26", "language": "en", "rating": 5}, {"id": 730426790, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d265458-r730426790-La_Barceloneta-Barcelona_Catalonia.html", "text": "The most beautiful area in my humble opinion. Next to the sea, with wonderful paths to walk, stores and hotels. Also, if you visit at night time, it has buzzing nightlife!", "publishedDate": "2019-12-03", "language": "en", "rating": 5}, {"id": 728484967, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d265458-r728484967-La_Barceloneta-Barcelona_Catalonia.html", "text": "Curious area, very compact and old fashioned yet located right at the beach where all the tourists congregate.  Take a short walk around.", "publishedDate": "2019-11-23", "language": "en", "rating": 4}, {"id": 725002933, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d265458-r725002933-La_Barceloneta-Barcelona_Catalonia.html", "text": "I came here for a business lanch, so I was invited. We tried:\n\n- Octopus.\n- Calamaris.\n- Squid.\n- Soupy rice with seafood.\n- \"Gypsy arm\" dessert.\n\nSmall portion of octopus, but the rest was good and nicely served. Is a nice place in a nice spot.", "publishedDate": "2019-11-08", "language": "en", "rating": 4}, {"id": 723035863, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d265458-r723035863-La_Barceloneta-Barcelona_Catalonia.html", "text": "Very nice and relaxing area that is located by the harbor.  There are many seafood restaurants and shops not to mention wonderful sunset views of the harbor.  You can also see the Christopher Columbus statue, visit La Rambla, take a boat and/or funicular ride from this area.", "publishedDate": "2019-11-01", "language": "en", "rating": 4}, {"id": 722551016, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d265458-r722551016-La_Barceloneta-Barcelona_Catalonia.html", "text": "A nice area of Barcelona just behind the beach and Port Vell. We had a nice walk through and stopped for lunch at a fab restaurant Can Mano.", "publishedDate": "2019-10-30", "language": "en", "rating": 5}, {"id": 719499214, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d265458-r719499214-La_Barceloneta-Barcelona_Catalonia.html", "text": "I can honestly say spending time in Barcelona is just an amazing experience, I loved the diversity of the beautiful historic city filled with rich culture, along with the added treat of spending time on the beach, we hired bicycles and toured our way around, parking them where we wished to be and taking it all in, the people are friendly, the food is delicious and I can honestly say a day on the beach soaking up the sunshine just adds to the experience, I must admit there are parts of the beach that don’t seem as clean as you would like, but walk along and find your spot, lying there watching the world go by with people from all cultures is just an experience I will never forget, I would absolutely go back.", "publishedDate": "2019-10-18", "language": "en", "rating": 5}, {"id": 718669885, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d265458-r718669885-La_Barceloneta-Barcelona_Catalonia.html", "text": "Favorite by far was the honey goat cheese with crusted bread.  The cava sangria was so good we ordered a second round.  The mussels didn’t have a strong enough spice but tasted good none the less.  And the view.....well it out shined the food but the food was delicious. ", "publishedDate": "2019-10-15", "language": "en", "rating": 5}, {"id": 714268369, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d265458-r714268369-La_Barceloneta-Barcelona_Catalonia.html", "text": "A very busy public beach with lots of people hassling you to buy things. Quite a lot of overpriced food outlets too. ", "publishedDate": "2019-09-30", "language": "en", "rating": 3}, {"id": 711211035, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d265458-r711211035-La_Barceloneta-Barcelona_Catalonia.html", "text": "The bad factory of food. First a blasting load sound of amusement center so have no sense of relaxation outside on the restaurant design. 2nd food is like the nearby cafeteria for the homeless with very bad quality thrown at the table. Your chair is hit numerous times with almost running waiters hitting the table. 46 dollars for 4 shrimp is the nome and fisherman soup with rice in a puddle of 5 pieces of fish. Save your money and go to local tapas bar at way lower price and quiet with better food. We rate this below 1 star", "publishedDate": "2019-09-19", "language": "en", "rating": 1}, {"id": 699358501, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d265458-r699358501-La_Barceloneta-Barcelona_Catalonia.html", "text": "Went with family on a 3 centre tour of Spain and ate at one of the many small cafe bars with tables overlooking the beach.  It was one of the best meals we ate as the seafood is wonderful.  Don'y miss going as it's one of the best places to go when visiting Barcelona", "publishedDate": "2019-08-15", "language": "en", "rating": 5}, {"id": 696192859, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d265458-r696192859-La_Barceloneta-Barcelona_Catalonia.html", "text": "If you are looking to lay up and relax and soak up sun on beautiful white sand, this is not the beach for that, go somewhere else. This beach is very crowded and full of a lot of activity and if that is your style then you may have a good time. A lot of restaurants to eat at and not a far walk from the Port.", "publishedDate": "2019-08-06", "language": "en", "rating": 3}, {"id": 695313831, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d265458-r695313831-La_Barceloneta-Barcelona_Catalonia.html", "text": "Great place to eat in Barcelona!! Very unique restaurant.. the attention Is great! The food is amazing, will not disappoint you! Worth it!! ", "publishedDate": "2019-08-03", "language": "en", "rating": 5}, {"id": 690086620, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d265458-r690086620-La_Barceloneta-Barcelona_Catalonia.html", "text": "Barcelona's beaches are not natural to the area, but they sure are fun! If you're looking for soft, white sand and a quiet atmosphere, this is not your beach. But there are so many people and fun things to do. Also, great people-watching! This is just one of the beaches in Barcelona. If you want a more chill atmosphere, check out one of the other ones.", "publishedDate": "2019-07-16", "language": "en", "rating": 5}, {"id": 688256829, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d265458-r688256829-La_Barceloneta-Barcelona_Catalonia.html", "text": "On our first trip to Barcelona, Spain, my wife and I did as much sightseeing as we could. This city has so much to offer it is virtually impossible to see everything in one visit. Or two...\n\nWe headed down to the port area a couple of times while visiting as there was so much to see and do...restaurants, Sidewalk Cafes, shops, monuments, the beach, historic buildings.....the list goes on and on.\n\nWe went up the Columbus Monument, crossed the Rambla de Mar bridge, took the Teleferico del Puerto tram, ate a couple of restaurants, and did plenty of sightseeing.If you are planning on visiting Barcelona, make sure you visit Barceloneta....", "publishedDate": "2019-07-09", "language": "en", "rating": 5}, {"id": 686956412, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d265458-r686956412-La_Barceloneta-Barcelona_Catalonia.html", "text": "We visited La Barceloneta for a business lunch, the food was very well prepared and fresh, the wine was OK, only problem - too bright sun on the terrace, but we enjoyed to be close to the water.", "publishedDate": "2019-07-05", "language": "en", "rating": 5}, {"id": 686884239, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d265458-r686884239-La_Barceloneta-Barcelona_Catalonia.html", "text": "Sand is pretty rough, pretty crowded. Had the unpleasant surprise to bump into nudists in full display on an otherwise public beach with kids and all. ", "publishedDate": "2019-07-04", "language": "en", "rating": 2}, {"id": 686827752, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d265458-r686827752-La_Barceloneta-Barcelona_Catalonia.html", "text": "The water is gorgeous, the sand is hot and clean and it's a terrific attraction to have in a city like Barcelona.  I really wished I had packed a swimsuit so I could swim, but I had to settle for wading.  I enjoyed my brief sojourn, especially because a walking vendor came by with a Mojito for eight euro that just made the whole day better.  \n\nSomething to realize is that this is a tops-optional beach.  About half of the women were not wearing tops, so if you're bringing your kids, be aware.\n\nWhen I realized I was starting to burn, I walked over to a nearby restaurant for lunch.  It was very good and reasonably priced, with a view of the water.  All in all, it was a great afternoon!", "publishedDate": "2019-07-04", "language": "en", "rating": 4}, {"id": 686688531, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d265458-r686688531-La_Barceloneta-Barcelona_Catalonia.html", "text": "This is not like the beaches along the Costa Brava, gets extremely crowded in summers, but is generally a nice place to relax and have some snacks.", "publishedDate": "2019-07-04", "language": "en", "rating": 3}, {"id": 681981685, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d265458-r681981685-La_Barceloneta-Barcelona_Catalonia.html", "text": "Went on a sunny day and it was very lively... Even the buses to this place was very crowded. There are a few free shows and changing rooms, and of course there was long quite long. There are many vendors hanging around that sells beer, alcohol etc. Only thing I did not like about the beach is the nature of sand. It is rather like soil or sand with very high content of soil... Otherwise it is a great place.", "publishedDate": "2019-06-16", "language": "en", "rating": 3}, {"id": 676503001, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d265458-r676503001-La_Barceloneta-Barcelona_Catalonia.html", "text": "I will never go to this beach again as  I didn’t get a moments peace,  what with the Vietnamese woman asking if I wanted a massage every 2 minutes and not taking No for an answer, one women even put her hands on me and I had to swipe it away and abruptly tell her No, she laughed and eventually went away but then another woman would appear. Being a young woman on my own this was very scary, ruined my whole beach experience and I would highly recommend people NOT to come here. It’s sleazy, it’s like sodom and Gomorrah, full of con artists. ", "publishedDate": "2019-05-26", "language": "en", "rating": 1}, {"id": 675601126, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d265458-r675601126-La_Barceloneta-Barcelona_Catalonia.html", "text": "This is a great area of the city and far more developed from my last visit.  You have the beach, harbour and lots of nice restaurants. ", "publishedDate": "2019-05-21", "language": "en", "rating": 4}, {"id": 674460765, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d265458-r674460765-La_Barceloneta-Barcelona_Catalonia.html", "text": "A modern place in Barcelona where everything is pretty new and looks really nice. Nice views and nice architecture, a lot of various shops and restaurants but a bit expensive sometimes. Just have to pick and choose.", "publishedDate": "2019-05-16", "language": "en", "rating": 5}, {"id": 672371903, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d265458-r672371903-La_Barceloneta-Barcelona_Catalonia.html", "text": "Some of the best views of the city, GREAT architecture, and overlooks the seashore, great lineup of restaurants and very modern touch. Palm trees around just add to perfection.  Definitely recommend it", "publishedDate": "2019-05-07", "language": "en", "rating": 4}, {"id": 671816266, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d265458-r671816266-La_Barceloneta-Barcelona_Catalonia.html", "text": "La Barceloneta is a lovely area by the sea front. It is a relatively \"new\" area, compared to the rest of Barcelona. It came to life some time during the 18th century, and in more recent times. It has some good restaurants and bars, and other types of shops. Some locals complain about the huge influx of tourists, a complaint that is being increasingly heard in several European cities in recent years. But tourists continue to flock there. If it wasn't for tourism one wonders what the economy would look like in some of these places. La Barceloneta is definitely worth a visit, if only to just have a look at the beautiful surroundings and to spend money at the local shops.", "publishedDate": "2019-05-06", "language": "en", "rating": 4}, {"id": 668463610, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d265458-r668463610-La_Barceloneta-Barcelona_Catalonia.html", "text": "It is an area at seashore, very popular for Catalans and tourists.  A very nice visit and perfect for lunch or dinner overlooking the sea and in a pleasant atmosphere.  Here you can enjoy fresh seafood dishes and choose from the many options of restaurants that specialize in this type of food.  There is also an area of docks, where there are large number of boats and yachts parked.   Also perfect for a walk and enjoy the different shops, restaurants, coffee shops, gardens and fountains.  A very nice attraction to spend an afternoon or some time at day.  There are blocks of restaurants, many options.  An easy access too, since it is located at 200 meters from the metro station.  A recommended visit!", "publishedDate": "2019-04-22", "language": "en", "rating": 4}, {"id": 667185052, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d265458-r667185052-La_Barceloneta-Barcelona_Catalonia.html", "text": "Free \nVisit Duration: You can spend a full day sunbathing and swming in Summer and spend the whole night partying.\n\nThe Barceloneta, once home of fishermen,  is now one of the city's most visited and popular. \nToday, it is one of the most active areas of the city, known for its first-class sandy beach  and its many restaurants and nightclubs along the boardwalk.", "publishedDate": "2019-04-17", "language": "en", "rating": 4}, {"id": 666419417, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d265458-r666419417-La_Barceloneta-Barcelona_Catalonia.html", "text": "After having lived in Barcelona for 6 months in 2012, i was excited to visit the La Barceloneta area and have a walk down the promenade and around the harbour. Unfortunately the whole area (100s of metres of promenade), has now been overtaken by people trying to sell illegal and fraudulent designer goods, or fridge magnets. It is very intimidating and has ruined the area. It seems to be totally out of control and the police are doing nothing about it. It is ruining the Barcelona city beach experience unfortunately.", "publishedDate": "2019-04-14", "language": "en", "rating": 1}, {"id": 664980332, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d265458-r664980332-La_Barceloneta-Barcelona_Catalonia.html", "text": "This is a beautiful section of the city with gorgeous architecture, narrow streets and some of the best restaurants. ", "publishedDate": "2019-04-09", "language": "en", "rating": 5}, {"id": 659830257, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d265458-r659830257-La_Barceloneta-Barcelona_Catalonia.html", "text": "Great fish restaurant - have visited it many times and find it to be consistently good. Paellas well worth trying as well as the suquet.", "publishedDate": "2019-03-20", "language": "en", "rating": 5}, {"id": 659097132, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d265458-r659097132-La_Barceloneta-Barcelona_Catalonia.html", "text": "Barcelona in the evening may be the most lively here at the beach. I personally enjoyed sitting idly watching people relaxing. Bring some cloth (or the likes) if you want to sit on the beach though.", "publishedDate": "2019-03-17", "language": "en", "rating": 4}, {"id": 658872343, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d265458-r658872343-La_Barceloneta-Barcelona_Catalonia.html", "text": "This is best beach of Barcelona, if you are lucky and sun is shining you can have lots of fun. Many restaurants in this area where you can have local food and many place to hangout. For water sports this is also a very good place. All main attractions are near buy... you can try a boat ride to take a good view of city from the sea. You can plan to play also here. Beach is clean but sand is not very soft but still this is a must go place of Barcelona. After sunset this place become the biggest party place of the town. ", "publishedDate": "2019-03-16", "language": "en", "rating": 4}, {"id": 658204444, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d265458-r658204444-La_Barceloneta-Barcelona_Catalonia.html", "text": "What a pleasant walk along the harbourfront. Interesting architecture and many sculptures, expensive yachts and a bridge that didn’t swing or raise but was drawn back into itself. Ingenious engineering. Well worth a trip down by the metro, a wander around and then finish of in La Rambla for drinks and tapas.", "publishedDate": "2019-03-13", "language": "en", "rating": 4}, {"id": 658073509, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d265458-r658073509-La_Barceloneta-Barcelona_Catalonia.html", "text": "This whole area has yachts, open spaces, beach and boardwalk, bars and street sellers. Great to wander around in the sun, go to the beach, look at the huge yachts and have a drink or some tapas.", "publishedDate": "2019-03-12", "language": "en", "rating": 4}, {"id": 656913079, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d265458-r656913079-La_Barceloneta-Barcelona_Catalonia.html", "text": "Pleasing walkway next to the port with plenty of restaurants, bars and shops takes you towards Las Rambla.", "publishedDate": "2019-03-06", "language": "en", "rating": 4}, {"id": 561685421, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d265458-r561685421-La_Barceloneta-Barcelona_Catalonia.html", "text": "I'm used to seeing better harbors. I live in Gran Canarias and I can't help but compare. Sorry. It is average. Lovely but small.", "publishedDate": "2018-02-20", "language": "en", "rating": 3}, {"id": 557615217, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d265458-r557615217-La_Barceloneta-Barcelona_Catalonia.html", "text": "Such a great spot - we had a walk then stopped here for a drink whilst soaking up the winter sun- lovely views of the city and the sea. Very relaxing.", "publishedDate": "2018-01-31", "language": "en", "rating": 4}, {"id": 555343399, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d265458-r555343399-La_Barceloneta-Barcelona_Catalonia.html", "text": "really amazing Place in Barcelona\nyou must come here and eat their sea food\nit's a very beautiful place", "publishedDate": "2018-01-21", "language": "en", "rating": 5}, {"id": 551706719, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d265458-r551706719-La_Barceloneta-Barcelona_Catalonia.html", "text": "The beach is notable in itself but this promenade is a nice walk along, much in keeping with the rest of the expansive Barcelona coastline and port.", "publishedDate": "2018-01-05", "language": "en", "rating": 3}, {"id": 548995397, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d265458-r548995397-La_Barceloneta-Barcelona_Catalonia.html", "text": "While it isn't right on the water (there are a couple roads between you and the water) this is a great place to walk, ride a bike, skate, people watch.  On a nice day, you might need sunscreen!", "publishedDate": "2017-12-24", "language": "en", "rating": 4}, {"id": 548902935, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d265458-r548902935-La_Barceloneta-Barcelona_Catalonia.html", "text": "Barcelona's beach front is not notable in of itself. However, there are good restaurants in the area, the Columbus Column and best of all the aquarium. We did not go the the aquarium this time since we had spent a good part of a day there on our last visit. It is a do not miss attraction.", "publishedDate": "2017-12-23", "language": "en", "rating": 4}, {"id": 548459406, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d265458-r548459406-La_Barceloneta-Barcelona_Catalonia.html", "text": "Have been a few times and is a great beach (even in the winter!). In the summer it gets crazy busy, but as you can see from the photos, woff peak is perfect", "publishedDate": "2017-12-21", "language": "en", "rating": 4}, {"id": 546404206, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d265458-r546404206-La_Barceloneta-Barcelona_Catalonia.html", "text": "This neighbourhood offers everything you ever want to do in Barcelona. Great restaurants, amazing food, awesome views and a relaxing environment. Lose yourself in the narrow streets and explore everything this area has to offer.", "publishedDate": "2017-12-10", "language": "en", "rating": 5}, {"id": 543114885, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d265458-r543114885-La_Barceloneta-Barcelona_Catalonia.html", "text": "Nice beach with perfect sand. We stayed 1 day at the beach and it was very relaxing. Go prepared there are only a few bars in the proximity of the beach.", "publishedDate": "2017-11-25", "language": "en", "rating": 5}, {"id": 543090771, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d265458-r543090771-La_Barceloneta-Barcelona_Catalonia.html", "text": "Restaurants along the beach are a bit overpriced but the beach was lovely and not as busy as expected. Plenty of bike tours available too. ", "publishedDate": "2017-11-24", "language": "en", "rating": 3}, {"id": 542210049, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d265458-r542210049-La_Barceloneta-Barcelona_Catalonia.html", "text": "even if only seen atop the Barcelona Bus Tour. Once we spotted it however, we asked a taxi cab to take us back here so we could have a fish dinner. Good places to eat and stroll around.", "publishedDate": "2017-11-20", "language": "en", "rating": 4}, {"id": 541865300, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d265458-r541865300-La_Barceloneta-Barcelona_Catalonia.html", "text": "Cute neighbourhood with beach, bars and restaurants. Raining when we were there so not super exciting. Giant lobster was cool, port looked meh as it was so dreary. Some good bars though.", "publishedDate": "2017-11-18", "language": "en", "rating": 4}, {"id": 540496994, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d265458-r540496994-La_Barceloneta-Barcelona_Catalonia.html", "text": "Quite a small beach but still pretty busy for November. A lot guys going up to people to sell things, I can only imagine how many more there are in summer time. If I visited in summer and had a chance at a day at the beach or day trip out I'd pick day trip out. Maybe there are nicer beaches nearer. We didn't eat in area but we couldn't find anything that didn't look like a tourist trap.", "publishedDate": "2017-11-12", "language": "en", "rating": 3}, {"id": 540011927, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d265458-r540011927-La_Barceloneta-Barcelona_Catalonia.html", "text": "Lovely walkways, views back onto the city and out on the marina. Sculptures & statues  around and fantastic restaurants. The beach is also lovely to walk along, again with nice bars.", "publishedDate": "2017-11-10", "language": "en", "rating": 5}, {"id": 539511867, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d265458-r539511867-La_Barceloneta-Barcelona_Catalonia.html", "text": "This is a nice beach with lots happening. The sea views are stunning. There are lots of people trying to sell you stuff so be prepared. A lot of the restaurants seemed cheap and touristy (think hamburger and french fries (yuck!)) but we managed to find an outstanding  seafood restaurant with a great view, Restaurant Salamanca.", "publishedDate": "2017-11-08", "language": "en", "rating": 5}, {"id": 539192308, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d265458-r539192308-La_Barceloneta-Barcelona_Catalonia.html", "text": "Great to see the beach area...away from the city bustle\nThe place to be seen obviously\nPleasant stroll if it wasn't for the beachmat sellers...a pain", "publishedDate": "2017-11-07", "language": "en", "rating": 4}, {"id": 538302463, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d265458-r538302463-La_Barceloneta-Barcelona_Catalonia.html", "text": "Not a very attractive beach area. OK for a stroll. We stopped at a beach-side cafe for an ice cream, and was so crowded it was impossible to move.", "publishedDate": "2017-11-04", "language": "en", "rating": 2}, {"id": 537761775, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d265458-r537761775-La_Barceloneta-Barcelona_Catalonia.html", "text": "We had to get to the beach! It was Sunday and 75 Degrees in October! The street on the way to La Barceloneta was packed with locals, tourists, restaurants and cafes. Vendors lined the street alongside the dock. Views were beautiful. Men walk the beach selling cold beer and drinks and women were selling a back rub. Many brought lunch to the beach and by days end people had wine and there was music. And there were lifeguards in October! So relaxing and a close walk to the outdoor/indoor mall, Maremagnum. A perfect day!", "publishedDate": "2017-11-01", "language": "en", "rating": 5}, {"id": 535478236, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d265458-r535478236-La_Barceloneta-Barcelona_Catalonia.html", "text": "Reminded me of Naples, a little rough around the edges , would return here to explore it better, more han likely to be arted up in he next few years", "publishedDate": "2017-10-23", "language": "en", "rating": 5}, {"id": 535090324, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d265458-r535090324-La_Barceloneta-Barcelona_Catalonia.html", "text": "The beach is manmade and not the most beautiful, but the boardwalk is great to walk around and people watch. ", "publishedDate": "2017-10-22", "language": "en", "rating": 4}, {"id": 534831274, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d265458-r534831274-La_Barceloneta-Barcelona_Catalonia.html", "text": "A lovely area for a stroll - nice marina, good vibe, interesting (if not eclectic!) art (NB to smiling lobster sculptor : crustacean tails cannot distend downwards).", "publishedDate": "2017-10-21", "language": "en", "rating": 4}, {"id": 533569722, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d265458-r533569722-La_Barceloneta-Barcelona_Catalonia.html", "text": "Amazing resturant by the sea .i highly recommend their paella and seafood in general and sangria  ..very good service ..indoor and outdoor dinning ..no dress code ..", "publishedDate": "2017-10-16", "language": "en", "rating": 5}, {"id": 531602330, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d265458-r531602330-La_Barceloneta-Barcelona_Catalonia.html", "text": "As I was in Barcelona, I knew I wanted to explore the Mediterranean so I hopped of the bus at Stop 5 for an afternoon at the beach. I walked several miles of sand stretching into beautiful blue water. I had lunch at a little cafe and explored the city. If you like the Beach, spend a few hours.", "publishedDate": "2017-10-10", "language": "en", "rating": 5}, {"id": 531313203, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d265458-r531313203-La_Barceloneta-Barcelona_Catalonia.html", "text": "Ideal place for walking around and doing nothing. Cool. Numerous b class restaurants, cozy streets and squares, a huge beach, a lot of youngsters. So different from pre Olympic era. ", "publishedDate": "2017-10-09", "language": "en", "rating": 5}, {"id": 531099114, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d265458-r531099114-La_Barceloneta-Barcelona_Catalonia.html", "text": "Very good restaurant for tapas (as starters), served in a nice atmosphere and close to some nice clubs, if you want to go clubbing afterwards. As main some of us got beef and the perceived quality was somewhat mixed. Service is friendly and focused.", "publishedDate": "2017-10-08", "language": "en", "rating": 3}, {"id": 530026363, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d265458-r530026363-La_Barceloneta-Barcelona_Catalonia.html", "text": "Had a lovely night in a few of the bars and also visited the market stalls opposite. Nice experience and lovely atmosphere. Recommended .", "publishedDate": "2017-10-04", "language": "en", "rating": 4}, {"id": 528039604, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d265458-r528039604-La_Barceloneta-Barcelona_Catalonia.html", "text": "Reasonably nice area to tale a walk and view the differing types of architecture that provides Barcelona with so many subjects of conversation.! ", "publishedDate": "2017-09-28", "language": "en", "rating": 4}, {"id": 527072847, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d265458-r527072847-La_Barceloneta-Barcelona_Catalonia.html", "text": "One of the city's oldest neighborhoods, still as ever in spite of the invasion of tourists.  Walk the narrow streets, go to the beach, enjoy the impressive outdoor art.  Lots of fun.", "publishedDate": "2017-09-24", "language": "en", "rating": 5}, {"id": 524434794, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d265458-r524434794-La_Barceloneta-Barcelona_Catalonia.html", "text": "visit the area to see local small streets/tapas bar and nice beach. Also a good idea to jog along the beach. There are chiringuitos (bars) by the beach in the summer though the beach can be crowded with tourists.", "publishedDate": "2017-09-14", "language": "en", "rating": 5}, {"id": 524123467, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d265458-r524123467-La_Barceloneta-Barcelona_Catalonia.html", "text": "We came down to this area to go to the history museum and stay to enjoy the people watching and the wonderful breeze off the water. This place has really developed over the past 10 years and is seeing a lot more tourist traffic. Good to visit any time of the day. ", "publishedDate": "2017-09-13", "language": "en", "rating": 4}, {"id": 523339016, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d265458-r523339016-La_Barceloneta-Barcelona_Catalonia.html", "text": "The sandy beaches, the gym swinging bars, the jogging strip, the hot people make this place a must see/ must do place a few days per week. Don't overpay for chaise longue and umbrella by the beach. Chose an open spot and lay down your beach towel and act like a sea lizard (don't google it)! Do take a morning jog to discover the many beaches around", "publishedDate": "2017-09-11", "language": "en", "rating": 5}, {"id": 520126596, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d265458-r520126596-La_Barceloneta-Barcelona_Catalonia.html", "text": "Really enjoyed this area of town. The obvious routes are in through the metro or along the marina but you could use the Telerifico. The obvious attractions are the beach and beachside bars and restaurants but the real pleasure is exploring the bars within the narrow streets where you can still enjoy some local culture without the first words being 'you want an English menu?'.", "publishedDate": "2017-08-31", "language": "en", "rating": 5}, {"id": 517012726, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d265458-r517012726-La_Barceloneta-Barcelona_Catalonia.html", "text": "Great for nice walk. It's very easy to get there, since there's a metro stop. There are many restaurants, bars, and mini markets. It's a place full of live during the whole day. ", "publishedDate": "2017-08-24", "language": "en", "rating": 5}, {"id": 515949740, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d265458-r515949740-La_Barceloneta-Barcelona_Catalonia.html", "text": "We started from the El Born area and walked down to the Columbus Memorial.  Interesting sculptures.  We could not find a way to cross over to the water side over the highway.  We did see a red bridge, but it was closed, and looked like it had been for years.  Too bad.", "publishedDate": "2017-08-21", "language": "en", "rating": 3}, {"id": 515845233, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d265458-r515845233-La_Barceloneta-Barcelona_Catalonia.html", "text": "Beautiful beach of barcelona on the mediterranean coast, perfect place for sunbathing with bars and restaurant. Try MOJITO and Paella  ", "publishedDate": "2017-08-21", "language": "en", "rating": 4}, {"id": 515412542, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d265458-r515412542-La_Barceloneta-Barcelona_Catalonia.html", "text": "The beach area is pretty close to the city and the Harbour and it is full of live 24/7.\nIn the morning you see plenty of People doing Sports and it is just Perfect for an Early morning run. Later more and more People come to the beach and Enjoy themselves. It is crowded but that is no Problem as everyone is relaxed. You find all ages, families, tourists, couples, everyone...\nFurthermore there are nice shops, relaxing bars and cafes and Great nightlife. \nDo not miss. ", "publishedDate": "2017-08-20", "language": "en", "rating": 5}, {"id": 514782850, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d265458-r514782850-La_Barceloneta-Barcelona_Catalonia.html", "text": "La Barceloneta is the beach and marina district of Barcelona. Much different vibe than other parts of Barcelona.  If you're not going to the beach, go for lunch and enjoy the salty air and breeze.", "publishedDate": "2017-08-18", "language": "en", "rating": 3}, {"id": 513714900, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d265458-r513714900-La_Barceloneta-Barcelona_Catalonia.html", "text": "yes, yes .. Amos alla plaja!\nI have a very interesting video to share with you!\nunfortunately, I was not prep ared for a swim but the weather was mild-warm and it was fun to just look around by foot!", "publishedDate": "2017-08-16", "language": "en", "rating": 5}, {"id": 512211772, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d265458-r512211772-La_Barceloneta-Barcelona_Catalonia.html", "text": "Take a walk on the promenade with thousands of tourists in season\nExcellent area with a marina, close to the underwater observatory\nMagnum mall, 5 minutes walk", "publishedDate": "2017-08-13", "language": "en", "rating": 5}, {"id": 510305866, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d265458-r510305866-La_Barceloneta-Barcelona_Catalonia.html", "text": "We spent a little time here on our tour but I would have liked longer. The beach was lovely and it was such a leisurely walk. There's plenty to see and do in the area so give yourself plenty of time.", "publishedDate": "2017-08-08", "language": "en", "rating": 4}]}}]