[{"locationId": 2223619, "name": "Museu dels Automats del Tibidabo", "placeType": "ATTRACTION", "reviewListPage": {"reviews": [{"id": 385652656, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d2223619-r385652656-Museu_dels_Automats_del_Tibidabo-Barcelona_Catalonia.html", "text": "It can be tricky to work out what's going on with this. I'd only wanted to visit the museum and the church, but didn't want to pay the park entry fee (which I think is around 50 euros). If you're the same, then don't fret! Just say you want a ticket for the museum only. It's 2 euros, and entry to the church is free.\nThe museum is a lovely collection of about 30 automata, and then there are some other old fair attractions like bagatelle and button football in there as well. The emphasis is distinctly on the old rather than the mechanically interesting. There are a couple of pieces more than a century old, which are fascinating to watch work as though new. There are also some more recent pieces, including a three-litte-pigs automaton with a see through case so you can see how it works. This wasn't really a very complex piece though so I didn't wholly see the point.\nAll of the automata work and are activated by buttons that show red when disabled and green when ready to go. In order to (I assume) cool down, and not get damaged, many of the pieces have LONG periods of being disabled in between runs. The shortest is probably around 30 seconds, and the longest ran at about 10 minutes. This is slightly aggravated by the presence of children whizzing round the museum. You get free entry if you're in the theme park and I think many of them view it as just another attraction when it isn't really. Several times I saw kids running around hitting whichever buttons were green and then not actually watching the automaton, which becomes frustrating when you look around to see every piece is currently disabled!\nThe information provided with each piece is well translated and interesting. Many of them give you a context for a piece, and how it's been studied. For example one piece could be dated from the fact the faces were modelled using old german newspaper which is starting to show up as the paint fades.\nI did find it kind of weird the extents to which the information would avoid dealing with the climate the exhibits come from. One example is an American automaton depicting a black jazz band with two of the members being monkeys. The information says \"they make a very unusual band.\" No. It's not unusual. It's racist. The piece definitely belongs there as a way to look at how people enjoyed themselves in American history, but it doesn't do us any good to gloss over the fact it's racist.\nThere are lots of different ways to get to Tibidabo, and some are significantly more expensive than others. If you get a T-10 though, this gives you 10 journeys for 10 euros, and you can get to Tibidabo from anywhere near a metro station in one journey by: 1) getting the underground to placa de catalunya, 2) walking through the tunnel to the train station (marked with a chainlink type logo), 3) getting the S1 or S2 trains to peu del funicular, 4) getting the funicular (this is fun anyway) to vallvidrera superior, 5) getting the 111 bus from right outside to the tibidabo. It's a there-and-back bus so you'll know when you're there.\nFor me, this journey took just under an hour, and so with the t-10 cost 1 euro. This is the way google maps takes you, but for whatever reason isn't the way google maps takes you back, so just remember you can reverse all the above and get back that way for another 1 euro trip.\n\nOverall, I'd recommend going. It's only open on weekends and public holidays, but the museum, the church, and the view over the whole of barcelona are three very worthwhile attractions here.", "publishedDate": "2016-06-24", "language": "en", "rating": 4}, {"id": 265850197, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d2223619-r265850197-Museu_dels_Automats_del_Tibidabo-Barcelona_Catalonia.html", "text": "Asanssor was superb. . The Elevator..\n\nIts give you more hights of meters to view barcelona and the suburbans with amazing topview..\n\nRecommend while visiting the  mountain and the park", "publishedDate": "2015-04-15", "language": "en", "rating": 4}]}}]