[{"locationId": 2690761, "name": "Maremagnum", "placeType": "ATTRACTION", "reviewListPage": {"reviews": [{"id": 749696503, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d2690761-r749696503-Maremagnum-Barcelona_Catalonia.html", "text": "A great spot for all weather's.\nSome well known high Street brands and smaller independent one's.\nThe bar on the top floor is a nice chill out area with good music played at the right level.\nThe only negative is the toilets. We couldn't understand why one of the toilets closed for a while to be cleaned. Normally, a notice is sufficient allowing the public to know a cleaner is present", "publishedDate": "2020-03-07", "language": "en", "rating": 3}, {"id": 749425166, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d2690761-r749425166-Maremagnum-Barcelona_Catalonia.html", "text": "This is one of the best malls in BC , you can find many stores Low-Mid- high range of Money , some coffee shops  , restaurants as well  ", "publishedDate": "2020-03-05", "language": "en", "rating": 5}, {"id": 746663361, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d2690761-r746663361-Maremagnum-Barcelona_Catalonia.html", "text": "Definitely worth a visit if you do not want to walk far between designer shops. The Baritimo restrauant had great sea views and is worth your patronage, even just for drinks. ", "publishedDate": "2020-02-22", "language": "en", "rating": 4}, {"id": 742419903, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d2690761-r742419903-Maremagnum-Barcelona_Catalonia.html", "text": "The mall is so stuffy, no need to visit of you do not planing to buy something like clothes, shoes... But the outside of mall and the pier worth to visit, seabreeze and people, you can enjoy your time", "publishedDate": "2020-02-01", "language": "en", "rating": 2}, {"id": 741674645, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d2690761-r741674645-Maremagnum-Barcelona_Catalonia.html", "text": "The location was so nice overlooking the see and marina. It was really unique. There is a good selection of restaurants. There was no much shopping stores, but I found the ones I like, the official stores of the football clubs, Real Madrid and Barcelona.", "publishedDate": "2020-01-27", "language": "en", "rating": 4}, {"id": 741642064, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d2690761-r741642064-Maremagnum-Barcelona_Catalonia.html", "text": "Love this mall super clean and chill , love every brand is it kiko , victoria ,mango ,breshka my all time favorites ❤️", "publishedDate": "2020-01-27", "language": "en", "rating": 5}, {"id": 738422247, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d2690761-r738422247-Maremagnum-Barcelona_Catalonia.html", "text": "A nicely designed mall just beside the sea side to enjoy serene view and cold breeze while shopping, having coffee or enjoying a dinner. ", "publishedDate": "2020-01-11", "language": "en", "rating": 5}, {"id": 735567420, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d2690761-r735567420-Maremagnum-Barcelona_Catalonia.html", "text": "This is an absolutely fantastic shopping centre. It has good shops and the toilets really came in handy.", "publishedDate": "2019-12-30", "language": "en", "rating": 4}, {"id": 735282960, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d2690761-r735282960-Maremagnum-Barcelona_Catalonia.html", "text": "Overcrowded. Dirty and unpleasant. Toilets must be avoided. Some respect to visitors is highly recommended. ", "publishedDate": "2019-12-29", "language": "en", "rating": 2}, {"id": 728647625, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d2690761-r728647625-Maremagnum-Barcelona_Catalonia.html", "text": "This shopping mall is not worth visiting, though the place where it is is very beautiful .I would suggest not to waist your time there ", "publishedDate": "2019-11-24", "language": "en", "rating": 2}, {"id": 728069693, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d2690761-r728069693-Maremagnum-Barcelona_Catalonia.html", "text": "Just a place to shop and maybe to eat.  Best feature is that it is on the water and near all the beach areas.  But it is just a shopping center with no unique stores.", "publishedDate": "2019-11-21", "language": "en", "rating": 3}, {"id": 727373169, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d2690761-r727373169-Maremagnum-Barcelona_Catalonia.html", "text": "We walked out on the pier and saw this shopping centre. I didn't think it was anything special. Most shopping centers seem to be very much the same thing these days.", "publishedDate": "2019-11-18", "language": "en", "rating": 3}, {"id": 725432677, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d2690761-r725432677-Maremagnum-Barcelona_Catalonia.html", "text": "Please please let me spare you the horror of going to this mall. I read it was a large mall with a variety of stores that are open on a sunday. First of all, nearly every store in the Gothic quarter was open, so there is no need to come here for that reason. And then, I want to point out that every store in here it’s somewhat cheap, and poor quality-the kind of clothes that teenagers wear. And along with the price point, you get a very predictable group of personality types that shop here. Basically, expect a lot of pushing, screaming children, a million people asking for a price checks on items that are already so cheap they shouldn’t even care... Thank God there are so many good bars and restaurants in Barcelona. I need to go get really drunk now to wash the horror of this place off of me.", "publishedDate": "2019-11-10", "language": "en", "rating": 1}, {"id": 725208617, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d2690761-r725208617-Maremagnum-Barcelona_Catalonia.html", "text": "A large shopping complex at the end of the Rambla del Mer which contains shops and eateries with a great view over the Port Vell ,great place to kick back for a few hours away from the madness of Las Ramblas.", "publishedDate": "2019-11-09", "language": "en", "rating": 4}, {"id": 718527033, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d2690761-r718527033-Maremagnum-Barcelona_Catalonia.html", "text": "Great place to sit back and relax!  Dinner was wonderful and staff was helpful, although they charge you for the bread without asking if you want it and already charge 10% for tip!  Food was wonderful though ", "publishedDate": "2019-10-15", "language": "en", "rating": 5}, {"id": 718511106, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d2690761-r718511106-Maremagnum-Barcelona_Catalonia.html", "text": "A big place with shopping and nice places to eat and drink near by the water. It was nice place and we got a drink", "publishedDate": "2019-10-15", "language": "en", "rating": 3}, {"id": 716508989, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d2690761-r716508989-Maremagnum-Barcelona_Catalonia.html", "text": "This was not a big mall. It looks big from the pictures, however not a lot of shopping at least from what I am used to in America. ", "publishedDate": "2019-10-08", "language": "en", "rating": 3}, {"id": 716010398, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d2690761-r716010398-Maremagnum-Barcelona_Catalonia.html", "text": "It's the only shopping mall that is open on Sunday. But I don't think the shops are very different. Not much of a choice. The view is on the other hand is very good. Just go and relax. ", "publishedDate": "2019-10-07", "language": "en", "rating": 3}, {"id": 715732347, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d2690761-r715732347-Maremagnum-Barcelona_Catalonia.html", "text": "Very nice shopping mall close to the sea, the only one we found open during the weekend. Close to it you can find the Aquarium which I recommend you also visit. Also in thr mall you can rent small cars foe kids which are really nice. Also, they have a nice playground for kids, even suited for smaller kids. Definitely worth checking tho not very big in size. ", "publishedDate": "2019-10-06", "language": "en", "rating": 4}, {"id": 714720707, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d2690761-r714720707-Maremagnum-Barcelona_Catalonia.html", "text": "It is not a common thing to find a very big mall resting on water; this is a very unique mall in the heart of barcelona .\nIt has really very nice views and many things to do including many shopping spots.\nThe car park is very expensive so it is better to visit it without a car.\n", "publishedDate": "2019-10-02", "language": "en", "rating": 5}, {"id": 705040446, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d2690761-r705040446-Maremagnum-Barcelona_Catalonia.html", "text": "Neat mall by the water. Really cool to walk through and look at the water! Close to the main street so not a bad walk at all.", "publishedDate": "2019-08-31", "language": "en", "rating": 5}, {"id": 690380322, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d2690761-r690380322-Maremagnum-Barcelona_Catalonia.html", "text": "Another greatshopping centre that i like lots of good shops and i got a dicount card to get a discount on certain sort of items in the shops, nice mcdonalds inside too for a tasty treat", "publishedDate": "2019-07-17", "language": "en", "rating": 4}, {"id": 688907959, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d2690761-r688907959-Maremagnum-Barcelona_Catalonia.html", "text": "A nice variety of shops, including a good Souvenir Shop called Senses of Barcelona. Pop in while you walk from La Rambla to the Aquarium or Barceloneta.", "publishedDate": "2019-07-12", "language": "en", "rating": 4}, {"id": 688703763, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d2690761-r688703763-Maremagnum-Barcelona_Catalonia.html", "text": "We visited the mall after our tour of the port, where we waited for the sun to go down, and then went and had a coffee at this place. They have a lot of restaurants and retail outlets, so I would recommend ending your port tour over here, before heading back.", "publishedDate": "2019-07-11", "language": "en", "rating": 4}, {"id": 686073608, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d2690761-r686073608-Maremagnum-Barcelona_Catalonia.html", "text": "This mall is overrated & expensive.  If your time is limited in Barcelona don’t waste it by coming here.  If you do decide to go, bring plenty of coins for the toilets as you have to pay to use them!  Also, the shops & restaurants are more expensive than elsewhere around La Rambla. \nIt’s worth a visit but don’t expect a bargain or value for money.", "publishedDate": "2019-07-02", "language": "en", "rating": 3}, {"id": 685238844, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d2690761-r685238844-Maremagnum-Barcelona_Catalonia.html", "text": "One of the few retail establishments that has shops open on Sundays. You can spend a lot of time in here shopping, window shopping and eating at the restaurants inside.", "publishedDate": "2019-06-29", "language": "en", "rating": 4}, {"id": 683693803, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d2690761-r683693803-Maremagnum-Barcelona_Catalonia.html", "text": "Wife and I stumbled across the shopping center while we were walking around the beach. It’s a full size mall with lots of great restaurants right by the seaside. Very nice walk with a views. ", "publishedDate": "2019-06-23", "language": "en", "rating": 4}, {"id": 680538673, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d2690761-r680538673-Maremagnum-Barcelona_Catalonia.html", "text": "Situated at the bottom end of La Rambla, this shopping centre is situated over a bridge by the harbour. The walk across is picturesque but it is not worth visiting the shopping centre.The shops are all high end and expensive and many are vacant. There was nothing special at all. We stopped to have a drink and cake and the price was extortionate. Don't waste your time.", "publishedDate": "2019-06-10", "language": "en", "rating": 3}, {"id": 675560744, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d2690761-r675560744-Maremagnum-Barcelona_Catalonia.html", "text": "This is a nice mall by the aquarium of Barcelona. Made of 3 floors, the mall has several local and international brands: shoes, clothing, and a top floor with restaurants and bars overlooking the marina.\n\nI bought some sports clothes from a store called inside, quite nice and good prices.\n\nPremium location, but the mall itself is less than ordinary in terms of shop content.\n\n", "publishedDate": "2019-05-21", "language": "en", "rating": 4}, {"id": 675445638, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d2690761-r675445638-Maremagnum-Barcelona_Catalonia.html", "text": "On the last day in Barcelona, we visited this mall for shopping. \n\nThe mall is along the bay side and the view is very nice. The place is not very huge, but housing quite a number of shops and eateries.\n\nSome of the shops are famous Spanish labels while some seem to be good for bargain hunters. \n\nQuite nice place to pick ladies fashion items.", "publishedDate": "2019-05-21", "language": "en", "rating": 4}, {"id": 675392779, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d2690761-r675392779-Maremagnum-Barcelona_Catalonia.html", "text": "If you visit the Aquarium then it is recommended to stop by and grab a bite to eat in this mall. You have several options. ", "publishedDate": "2019-05-20", "language": "en", "rating": 4}, {"id": 675060885, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d2690761-r675060885-Maremagnum-Barcelona_Catalonia.html", "text": "Open 365 days a year. This mall has 3 floors of stores and restaurants to help you find that special gift. Situated on the water, some of the restaurants have fabulous views ", "publishedDate": "2019-05-19", "language": "en", "rating": 3}, {"id": 672495253, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d2690761-r672495253-Maremagnum-Barcelona_Catalonia.html", "text": "We visited this area twice while in Barcelona. The location is fantastic! This shopping centre has numerous shops where you can buy practically anything you wish. If you want it, then they most probably have it! There are some food places too and the food is quite good. The mirrored entrance to the Centre is absolutely unique. You can find seats inside and outside and your preference would probably outside because that would give you the opportunity to enjoy the stunning water views and also of the city. This is a lovely place to visit.", "publishedDate": "2019-05-08", "language": "en", "rating": 4}, {"id": 668609257, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d2690761-r668609257-Maremagnum-Barcelona_Catalonia.html", "text": "This mall is great! It’s very good, there’s everything you need for shopping and for food and it’s extremely beautiful. It’s in a very good location and it makes the view so beautiful!", "publishedDate": "2019-04-23", "language": "en", "rating": 5}, {"id": 666876000, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d2690761-r666876000-Maremagnum-Barcelona_Catalonia.html", "text": "Free access.\nVisit Duration: 1.5 Hours.\n\nCommercial center located at the end of la ramblas, beyond Columbus Monument, just above the sea. You can access it by crossing a long bridge above the sea and enjoy the views.\n\nMany shops, terraces, discotheques, movie theaters, Europe's largest aquarium and a lot of hobby activities.\n\nFor shopping don't expect that much, however the view through the port daytime and nighttime is really amazing.", "publishedDate": "2019-04-16", "language": "en", "rating": 4}, {"id": 664808433, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d2690761-r664808433-Maremagnum-Barcelona_Catalonia.html", "text": "Nice Place not so many shops though the outdoors seating area is very pleasant the interior is average ", "publishedDate": "2019-04-08", "language": "en", "rating": 4}, {"id": 661727695, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d2690761-r661727695-Maremagnum-Barcelona_Catalonia.html", "text": "BEWARE when you decide to park here. They charge a premium (30 euros/day) and offer NO SECURITY. Someone broke into our car in the middle of the day and stole 7 pieces of luggage without anyone from the security noticing. They could have probably left with our car as well if they wanted. There are professional gangs of thieves crawling this mall and the security is false advertising.", "publishedDate": "2019-03-27", "language": "en", "rating": 1}, {"id": 659127643, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d2690761-r659127643-Maremagnum-Barcelona_Catalonia.html", "text": "We had taken a Metro ride into Passeig De  Gracia to get to the Global Blue Office to organize a few receipts for tax refund and totally forgotten from our several previous visits to Barcelona that Shops there are closed on Sunday. I guess that was why the Global Blue queue was so short.\nWe decided to head to Maremagnum Mall, this Mall being one that had restaurants and shops open on Sunday. We used Metro L4 with a short ride to Barceloneta Station and then a lovely and easy Sunday stroll with thousands of people along the Marina to the Mall.\nThe Mall was lively and busy, most of the shops are little different to other malls missing the top EU Designers, but still interesting and colorful. We did not stop for lunch, as most restaurants were nearly full but also had good views of the water.\nAnyway, it was a good near two hours walking around, people watching and working off a big breakfast. And the Museum of Catalona and Maritime Museum, plus the Chris Columbus Statue are within walking distance for those who has not been here before.\n", "publishedDate": "2019-03-17", "language": "en", "rating": 4}, {"id": 658059286, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d2690761-r658059286-Maremagnum-Barcelona_Catalonia.html", "text": "This is a fun place to hang out and watch what is going on. There are tons of people wandering around, plus benches to just sit. The marina is lovely and you can see ferries going and going. ", "publishedDate": "2019-03-12", "language": "en", "rating": 5}, {"id": 657702686, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d2690761-r657702686-Maremagnum-Barcelona_Catalonia.html", "text": "We had lunch at The Chipiron and after lunch went for a walk around this shopping centre. There is a good mixture of shops and lots of little food outlets. The centre itself is very clean and bright and easy to get around. They have little car for the toddlers to ride around in while their parents are shopping, very cute.", "publishedDate": "2019-03-10", "language": "en", "rating": 4}, {"id": 657379155, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d2690761-r657379155-Maremagnum-Barcelona_Catalonia.html", "text": "This is my favourite place to shop.  There are nice restsurants and enough stores to keep you coming back. ", "publishedDate": "2019-03-09", "language": "en", "rating": 5}, {"id": 652610437, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d2690761-r652610437-Maremagnum-Barcelona_Catalonia.html", "text": "This place is not just for shopping, it is nice to walk there. Good restaurants to eat lunch and enjoy watching and walking around.", "publishedDate": "2019-02-15", "language": "en", "rating": 5}, {"id": 652510671, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d2690761-r652510671-Maremagnum-Barcelona_Catalonia.html", "text": "Maremagnum-as every  shopping mall have several brand shops an food court.But what the difference--you ask me ? First of all in work on Sunday  too-its unusual for Barcelona malls.2.Here is wonderful view from Starbucks terrace on the sea and an d a lot of ships and yachts, Also there are   variety of lounge bars and fresh music--in the Summer is the best choice. For those who love shopping--there is shop\"leaflets \" -with best  discounted prices :)", "publishedDate": "2019-02-15", "language": "en", "rating": 5}, {"id": 649512442, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d2690761-r649512442-Maremagnum-Barcelona_Catalonia.html", "text": "We were in Barcelona for 3 days and visited the Maremagnum mall twice during our stay. It is a great mall with beautiful views however on the second visit we were having coffee at the dunkin donuts and there were 2 ladies sitting behind us. I put my jacket over my chair and after they left I realized they had removed all my money from the inside pocket of my jacket. ", "publishedDate": "2019-02-01", "language": "en", "rating": 4}, {"id": 649427061, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d2690761-r649427061-Maremagnum-Barcelona_Catalonia.html", "text": "This may not be the biggest mall in Barcelona but it certainly is the most scenic. Set amongst the yachts of the rich and famous it provides excellent views as you relax with a drink or coffee. This was our second visit and as it is open on a Sunday it is very useful for tourists. Situated at the end of the Rambla it is within easy walking distance.This mall provides a good alternative to some of the tat in souvenir shops", "publishedDate": "2019-01-31", "language": "en", "rating": 4}, {"id": 648947755, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d2690761-r648947755-Maremagnum-Barcelona_Catalonia.html", "text": "Take in the flair of these yachts.\nI think everybody should go there if in barcelona, definitely worth a visit.", "publishedDate": "2019-01-29", "language": "en", "rating": 3}, {"id": 643076514, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d2690761-r643076514-Maremagnum-Barcelona_Catalonia.html", "text": "I liked the place. And you have some fun activities for kids too here along with nice restaurants.....! ", "publishedDate": "2019-01-02", "language": "en", "rating": 5}, {"id": 641396117, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d2690761-r641396117-Maremagnum-Barcelona_Catalonia.html", "text": "Nice and not too big Mall. The closest to the center. The only one open on Sundays when all malls and shops are closed. Quite a busy place on weekends.", "publishedDate": "2018-12-25", "language": "en", "rating": 3}, {"id": 640932412, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d2690761-r640932412-Maremagnum-Barcelona_Catalonia.html", "text": "We came for early dinner after visiting the Aquarium which is just next door.\nThe mall is big but not too crowded. Some toilets you need to pay but the free ones are at the top floor.\nThe mall is at the Port Veil, next to the marina. There is a bridge and you can walk passing the bridge to the nearest metro station.", "publishedDate": "2018-12-21", "language": "en", "rating": 3}, {"id": 639440391, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d2690761-r639440391-Maremagnum-Barcelona_Catalonia.html", "text": "If you want to do some shopping for every occasion this is the right place to visit.You can do your shopping and after right next to the sea with a nice view you can enjoy your lunch or dinner in any of the restaurants around the place. It gets busy though.", "publishedDate": "2018-12-13", "language": "en", "rating": 4}, {"id": 636887352, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d2690761-r636887352-Maremagnum-Barcelona_Catalonia.html", "text": "If you visit Barcelona, like many tourists and visitors, you will be shocked to know that all shopping malls are closed on Sundays. If you are on a business trip and arrive on a Sunday for some important meetings on Monday, and you discover that you have forgotten an item and would need to buy something on Sunday, then you are out of luck. Except for Maremagnum. This is a life saver shopping mall that is open on Sundays.", "publishedDate": "2018-12-01", "language": "en", "rating": 5}, {"id": 635177969, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d2690761-r635177969-Maremagnum-Barcelona_Catalonia.html", "text": "I ate here at 11.00 am. I took a breakfast with seafood and omlette vhith potatoes and onion. Delicios! The waiter Azwem was very gentle. His recommandation were perfectly tasty. Very good services!", "publishedDate": "2018-11-23", "language": "en", "rating": 5}, {"id": 631389131, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d2690761-r631389131-Maremagnum-Barcelona_Catalonia.html", "text": "Got a Sunday spared during a business trip to Barcelona.  Maremagnum was suggested by the hotel - as the only choice for shopping on Sundays - all other places were closed.  This shopping centre was small and brands were limited.  Left within 1 hour.  Not worthwhile unless you have absolutely no where else to go.", "publishedDate": "2018-11-06", "language": "en", "rating": 1}, {"id": 630011216, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d2690761-r630011216-Maremagnum-Barcelona_Catalonia.html", "text": "On a hot August day in Barcelona, with the mercury hitting 36 degrees, the Maremagnum shopping centre was a welcome break from the heat, especially with a toddler in tow.\n\nA great selection of shops, restaurants and concessions, but more importantly some much needed air-conditioning! \n\nIt’s super new and in gleaming condition in a top spot in Barcelona’s Port Vell area. We were travelling on a cruise ship, in port for just a day, so Maremagnum was an ideal distance.", "publishedDate": "2018-11-01", "language": "en", "rating": 5}, {"id": 629592929, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d2690761-r629592929-Maremagnum-Barcelona_Catalonia.html", "text": "Shopping centre at the harbour.  We went on a Sunday as all other shops in Barcelona are closed on a Sunday.  It is pleasant enough - small lower end high street shops - a tiny Mango is the highlight.", "publishedDate": "2018-10-30", "language": "en", "rating": 3}, {"id": 629314846, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d2690761-r629314846-Maremagnum-Barcelona_Catalonia.html", "text": "This is where you go on a freezing Barcelona morning when you have packed inappropriate clothing and you need a drink. ", "publishedDate": "2018-10-29", "language": "en", "rating": 3}, {"id": 628073798, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d2690761-r628073798-Maremagnum-Barcelona_Catalonia.html", "text": "Location, the view and the atmosphere is just amazing.Another great place to visit with the family. Plenty to shop. Beware of pickpocketers. Not all the toilets are free to use. That's the only negativity.   ", "publishedDate": "2018-10-25", "language": "en", "rating": 4}, {"id": 627396211, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d2690761-r627396211-Maremagnum-Barcelona_Catalonia.html", "text": "We did an afternoon trip to Maremagnum. It's a lovely clean shopping centre with a lot of fashion shops and a souvenir shop for those last minute bits. The pricing was very fair.\n\nI recommend Tapa Tapa for lunch (by the main entrance) as it has loads of tapas dishes to choose from which are all delicious and very fairly priced. The view across the harbour as you eat is lovely!\n\nTIP - there are free toilets to use on the very top floor. Lovely and clean!", "publishedDate": "2018-10-23", "language": "en", "rating": 4}, {"id": 624833672, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d2690761-r624833672-Maremagnum-Barcelona_Catalonia.html", "text": "My wife and my children visited the Maremagnum on our visit to Barcelona. It is a very large commercial center in which there are not only stores. They have several restaurants of very good quality in which you can eat very well. An interesting place to visit and spend a couple of hours in a relaxed way\n", "publishedDate": "2018-10-14", "language": "en", "rating": 5}, {"id": 623792559, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d2690761-r623792559-Maremagnum-Barcelona_Catalonia.html", "text": "Very good mall, with good stores! Worth the time going there. Very good location! Good that they had a map over the mall!", "publishedDate": "2018-10-10", "language": "en", "rating": 5}, {"id": 621498504, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d2690761-r621498504-Maremagnum-Barcelona_Catalonia.html", "text": "A Shopping mall, at the harbour. Nice view  at the harbour. Good to go on a Sunday a lot to see and there are some well known shops. ", "publishedDate": "2018-10-02", "language": "en", "rating": 4}, {"id": 620880293, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d2690761-r620880293-Maremagnum-Barcelona_Catalonia.html", "text": "We went to look around grab a bit to eat and rest.  There is lot of store but you can definitely find much more in the Rambla Cataluna or Gran via.  We did find great place to grab a quick bit.  It has a beautiful view of the ocean.", "publishedDate": "2018-09-30", "language": "en", "rating": 3}, {"id": 618033261, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d2690761-r618033261-Maremagnum-Barcelona_Catalonia.html", "text": "It’s fine. Shopping mall, lots of name brand stores, coffee stands, teenagers everywhere. You could get some Barcelona sport team gear here, but it’s expensive. We popped into a few shops here and had coffee at Starbucks to avoid the rain. Nice seating areas that overlook the port. Otherwise it’s just like every other mall in the world. ", "publishedDate": "2018-09-19", "language": "en", "rating": 3}, {"id": 618002851, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d2690761-r618002851-Maremagnum-Barcelona_Catalonia.html", "text": "A large shopping center with easy shopping. Spacious and clear. Outdoors you can eat and enjoy the sea air.", "publishedDate": "2018-09-19", "language": "en", "rating": 3}, {"id": 616608971, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d2690761-r616608971-Maremagnum-Barcelona_Catalonia.html", "text": "Had a really good experience here. Great variety of shops, nice spacious shopping centre with relaxed atmosphere. Good variety of different kinds of eateries from McDonald’s & Subway to restaurants overlooking harbour. Signs for toilets misleading (they are on 2nd floor next to Subway). Overall a good experience, ", "publishedDate": "2018-09-14", "language": "en", "rating": 4}, {"id": 616311667, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d2690761-r616311667-Maremagnum-Barcelona_Catalonia.html", "text": "It was a beautiful Sunday and not much opened (major shops) in Barcelona so someone recommended this mall. After walking and looking at the amazing building we decided to visit this Mall, well, like all malls you can be anywhere in the world except for the well known ‘Pickpockets’ that i had no idea Barcelona was No. 1 in the world for.   Be on the ARLERT,  while I was in H&M store made my way to the cashier, it was my turn, went to pay for my goods, my bag was open, I knew I had locked and zippered it up, to find my Wallet not there, in shock I looked through my bag over and over again but No Not There any more.  First time in my life and I have traveled twice a year for the past 40 years to be Pickpocketed and I did not feel a thing.   Received no assistance from the store (where it happened H$M, not the shopping Center as they both said it is very common in Barcelona).  So moral to my story maybe beautiful place but Safty is more important to me and I did not feel safe in the Barcelona  and Mall.  Do not bring money, Jewlery on you, bags, if you are a women and you want to bring money put it in your bra.  I think It maybe the safest place to store your cash and cards from pickpockets.", "publishedDate": "2018-09-13", "language": "en", "rating": 3}, {"id": 615826109, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d2690761-r615826109-Maremagnum-Barcelona_Catalonia.html", "text": "Enjoying the evening at the harbour in Barcelona, Love it should not miss it. The shopping complex was not great but enjoying the moment there. Lots of restaurants around there. Sea life is in the building too, so not to be miss out", "publishedDate": "2018-09-11", "language": "en", "rating": 4}, {"id": 614653789, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d2690761-r614653789-Maremagnum-Barcelona_Catalonia.html", "text": "Nice restaurant, nice personnel with kind service (Meryam). Would return next time also! Paella and prosecco sangria is our recommendation to the new visitors! ;)", "publishedDate": "2018-09-07", "language": "en", "rating": 5}, {"id": 613499063, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d2690761-r613499063-Maremagnum-Barcelona_Catalonia.html", "text": "Maremagnum is a large shopping mall located at the port area of Barcelona. You can find many shops, cafés, restaurants and other facilities at the mall. It has a nice view in terms of location and site. The connection route from the main avenue to the mall is well designed and enriched by bridges. You can take many photos during your visit.", "publishedDate": "2018-09-03", "language": "en", "rating": 5}, {"id": 612704213, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d2690761-r612704213-Maremagnum-Barcelona_Catalonia.html", "text": "Went here on the Sunday of our holiday as most shops close elsewhere. A nice change from the crowded Ramblas and more to my taste as there were some craft stalls nearby . Shops included Lush and Kicko and the aquarium and cinema were nearby.", "publishedDate": "2018-08-31", "language": "en", "rating": 4}, {"id": 611957272, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d2690761-r611957272-Maremagnum-Barcelona_Catalonia.html", "text": "Took refuge here from shopping but sadly it offered no sanctuary. Waited thirty minutes for the most disgusting latte I’ve ever had in a Starbucks. When the rest of my group arrived, they didn’t bother to have anything as the queue was twenty people long by then and I was so unhappy with my drink. Does nothing for the brand! ", "publishedDate": "2018-08-29", "language": "en", "rating": 1}, {"id": 606047409, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d2690761-r606047409-Maremagnum-Barcelona_Catalonia.html", "text": "It is the only open  mall in Barcelona on sunday. So if you are in Barcelona on a weekend and you are tight in time try to discover the city on Saturday and keep the shopping at  Maremagnum on Sunday.", "publishedDate": "2018-08-13", "language": "en", "rating": 5}, {"id": 605439807, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d2690761-r605439807-Maremagnum-Barcelona_Catalonia.html", "text": "Maremagnum is one of the few places open in Barcelona on Sunday. Most of the shops except Somme tourist booths are closed. Maremagnum provides a nice break where you can shop and eat and enjoy the views of the harbor. For food however I would take a small walk to the beach and get some food there with some stunning views of the beach.\n\nMaremagnum is well accessible for wheelchair users, though you might have to wait a little while for a lift, since there are only two and “regular” walking people also take it because they are lazy.\n\nWalking to the beach from Maremagnum will take you about 30 minutes but it’s a very nice walk.", "publishedDate": "2018-08-11", "language": "en", "rating": 5}, {"id": 605181009, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d2690761-r605181009-Maremagnum-Barcelona_Catalonia.html", "text": "Can easily be left off the visitor trail. Mediocre shops and not that many some very cheap and fairly poor eateries. The McDonalds went for a quick drink was hellish. In the middle of the harbour so some nice views and thats about as good as it gets", "publishedDate": "2018-08-10", "language": "en", "rating": 3}, {"id": 602829716, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d2690761-r602829716-Maremagnum-Barcelona_Catalonia.html", "text": "located at Port Vell area, it can be accessed by road on the Citybus route, or walking across the wooden bridge from the Columbus Monument. \n\nNothing Special about the mall inside, but it's a nice place to stop by while wandering the surrounding area.", "publishedDate": "2018-08-04", "language": "en", "rating": 3}, {"id": 599993787, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d2690761-r599993787-Maremagnum-Barcelona_Catalonia.html", "text": "Easy walk from Ramblas. Right on the sea. Interesting walk on a curvy bridge over water, passing lots of vendors. Benches along the way.  Several outdoor cafes and restaurants, including a Starbucks.  It seemed to us that it was mostly locals there. Many stores found in the States but also some unique shops. Some big cosmetic shops that offer great European brands.", "publishedDate": "2018-07-26", "language": "en", "rating": 5}, {"id": 596626237, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d2690761-r596626237-Maremagnum-Barcelona_Catalonia.html", "text": "Shopping mall down near the docks with a variety of shops. In a pretty setting, but otherwise quite typical modest size mall. About the only shopping area reliably open on Sunday so quite busy on weekends.", "publishedDate": "2018-07-16", "language": "en", "rating": 3}, {"id": 594043460, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d2690761-r594043460-Maremagnum-Barcelona_Catalonia.html", "text": "Our tour group was having lunch at the nearby restaurant, The Chipiron (do check out my earlier review of this restaurant here too) earlier and we had a short break time and decided to walk over here for a quick visit, before heading to Zaragoza in the late afternoon.\n\nThe mall was not crowded when we were there, possibly because it was a Monday afternoon. It's spacious and bright, cooling too from the heat outside. There were several shops with cafes and restaurants, apparently selling lifestyle merchandise, fashion, IT and phone etc. However, did not find a supermarket here which's quite uncommon for a shopping mall.\n\nNonetheless, we had a quick walk around before catching our coach. It would be perfect if we could spend more time here, and also visit The Aquarium next door too!", "publishedDate": "2018-07-08", "language": "en", "rating": 4}, {"id": 591779147, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d2690761-r591779147-Maremagnum-Barcelona_Catalonia.html", "text": "A variety of shops including Pull and Bear, Claires and the official Barcelona store. The ice cream van outside was a lovely addition.", "publishedDate": "2018-06-29", "language": "en", "rating": 5}, {"id": 590118495, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d2690761-r590118495-Maremagnum-Barcelona_Catalonia.html", "text": "Me and my friend went here after getting off a boat ride, the harbour is just next to the shopping centre. The walk to the shopping centre was nice with a view of all the yachts as well as lots of restaurants along the side of it with a sea view. There are a lot of shops such as H&M and Victoria's Secret. It is very big and spacious which made walking around a lot easier - it is very well air conditioned which gave us a break from the hot weather outside.", "publishedDate": "2018-06-23", "language": "en", "rating": 5}, {"id": 588165247, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d2690761-r588165247-Maremagnum-Barcelona_Catalonia.html", "text": "We stopped to pick up a couple items - One lost and One forgotten at home. Maremagnum is easy to navigate, has a wide variety of stores, from H&M to electronics, with tons of specialty stores for things like swimwear and sunglasses. Or, get SIM cards and cellphones. There a large variety of cafes, restaurants, and bars. A great stop anything but groceries. ", "publishedDate": "2018-06-17", "language": "en", "rating": 5}, {"id": 586785943, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d2690761-r586785943-Maremagnum-Barcelona_Catalonia.html", "text": "You can spend the whole day there if you have enough money with you :) \nLefties is a more budget one and it looks more like Dunnes Stores in Ireland but quality of clothing much better. If you are thinking about shopping in Barcelona then this mall should be in your list. \nAlso you can have a Ferrari driving experience from €69 which is a fantastic value if you don’t own a supercar yourself :)", "publishedDate": "2018-06-11", "language": "en", "rating": 5}, {"id": 586411161, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d2690761-r586411161-Maremagnum-Barcelona_Catalonia.html", "text": "In Barcelona on a Sunday, what to do?\nGo shopping, lots of shops, restaurants and cafes etc.\nLunched at Udon noodle bar, trendy, reasonably priced, I had pork ribs yakisoba noodles etc.\nShops not very busy, lots of people there, \nYes, worth visiting there on Sunday and enjoy the eating n shopping there.", "publishedDate": "2018-06-10", "language": "en", "rating": 3}, {"id": 584693337, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d2690761-r584693337-Maremagnum-Barcelona_Catalonia.html", "text": "I recently visited the Maremagnum Shopping Centre whilst in Barcelona.  The centre is well set out, in a lovely setting, great location, and there are plenty of restaurants.  \n\nThe shops are the usual brands, including H&M, Stradavarius, Mango, Lefties and others, but to my disappointment, no Zara.  It is open on Sundays which is very convenient, as most shops are closed in Barcelona on that day.\n\nI will visit this shopping centre again when I am in Barcelona.", "publishedDate": "2018-06-02", "language": "en", "rating": 5}, {"id": 583776421, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d2690761-r583776421-Maremagnum-Barcelona_Catalonia.html", "text": "My wife felt like some shopping therapy  after 14 days of visiting historic sights and other attractions. Bus Turistic stops here, just cross the street, climb the steps and you are there. It looks impressive but when you step inside you become aware of the open spaces, some are atrium like. Most of the shops are designer or upmarket outlets and geared towards the younger crowd. Still the same problem with sizing that we encountered elsewhere. Maybe there is a secret campaign in Spain  that wants all men to be 2XL or less and women to not exceed L. We enjoyed a nice coffee and snack at one of the cafes. Some attractive vertical gardens adorn sections of the interior. Worth a visit if in the area but  better variety elsewhere.", "publishedDate": "2018-05-29", "language": "en", "rating": 4}, {"id": 581041302, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d2690761-r581041302-Maremagnum-Barcelona_Catalonia.html", "text": "The location of this shopping center is great, just at the waterfront of Barcelona. However, the shopping center itself is dissappointing, too small and too expensive", "publishedDate": "2018-05-18", "language": "en", "rating": 2}, {"id": 577327959, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d2690761-r577327959-Maremagnum-Barcelona_Catalonia.html", "text": "Great views and promenade is a nice way to visit. Shopping center itself is pretty standard, Mango, Zara, Lefties? etc are the main shops. Two floors of shops ~50 in total. Lots of food outlets in and around this area. The advantage is that it is open Sunday until 9.00pm. So great for last minute shopping on a weekend away.", "publishedDate": "2018-05-02", "language": "en", "rating": 4}, {"id": 573319341, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d2690761-r573319341-Maremagnum-Barcelona_Catalonia.html", "text": "It's definitely big and definitely a destination but it's a bit more than just a mall. There's indoor and outdoor activities and shopping, lots of kids oriented activity plus it's on the waterfront, so it makes a good stroll..", "publishedDate": "2018-04-14", "language": "en", "rating": 4}, {"id": 572136077, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d2690761-r572136077-Maremagnum-Barcelona_Catalonia.html", "text": "The Maremagnum Mall is nothing to shout about in the sense that there are a few decent outlets such as H&M, Pull & Bear, Berksha, Adidas, etc. \n\nHowever, it is a good \"rest\" stop when visiting the area considering it is the Barcelona Harbor and is near the beaches and there is the aquarium next door as well. The Barcelona hop-on/off has a stop here! \n\nGood food available in the mall as well!", "publishedDate": "2018-04-09", "language": "en", "rating": 3}, {"id": 571987683, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d2690761-r571987683-Maremagnum-Barcelona_Catalonia.html", "text": "My Kiwi gfs and I visited on our first night in Barcelona. The walk through La Ramblas with its wonderful stalls, entertainment and many smiling faces was the prequel to dinner of paella and a bucket of beers. Maremagnum has several  places to eat and drink. We sat outside right on the harbour edge to have our meal. The atmosphere is quite electric with many people still walking around at 10.30 in the evening. The harbor lights twinkle off the water, and we watched little fishes darting just below the surface. There are many shops inside over several floors. The WCs are spotlessly clean as is the entire complex. There is a play area for the kids. On the top floor/roof is an open top bar called Ola, where you a have a nice cold beverage like the Long Island Tea that I enjoyed in the sunshine.", "publishedDate": "2018-04-08", "language": "en", "rating": 5}, {"id": 568359306, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d2690761-r568359306-Maremagnum-Barcelona_Catalonia.html", "text": "The is probably the most beautifully situated shopping complex I have seen. That being said, we came by chance as we were strolling by the waters.  Took a walk around and found it very crowded with tourists (like myself) and found the stores to be mostly multinational chain stores that could be found anywhere else.  Great if you need to pick up a couple items but definitely nothing special.", "publishedDate": "2018-03-23", "language": "en", "rating": 3}, {"id": 565518015, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d2690761-r565518015-Maremagnum-Barcelona_Catalonia.html", "text": "Situated in the Port Vell area, the shopping mall contains a good selection of shops including high end designer labels, toy shops and the usual chains such as Claire’s. There are a great number of restaurants from McDonalds, to Tapas bars.\nCan be accessed by road on the Citybus route, or across the wooden bridge from the Columbus Monument. Worth a visit.", "publishedDate": "2018-03-09", "language": "en", "rating": 3}, {"id": 565294663, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d2690761-r565294663-Maremagnum-Barcelona_Catalonia.html", "text": "The actual shopping centre itself is all mirrors and pretty from the outside, inside it's just like any other shopping centre.  It's not bad, it's well maintained but aesthetically it lacks anything to stand out.  If you want a shopping trip, this shopping centre will definitely fill your desires.\n\nI liked the outdoor area better (see pic), where kids seem to drive around in the little rent-a-cars and artists set up shop.  The area on the way to the shopping centre front entrance is stunning and full of great things to see and enjoy, always busy with people.", "publishedDate": "2018-03-08", "language": "en", "rating": 3}, {"id": 563785999, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d2690761-r563785999-Maremagnum-Barcelona_Catalonia.html", "text": "Nice mall, good size. The walkway here is so pretty at night. There were also plenty of places to have a bite to eat both inside and out. ", "publishedDate": "2018-03-02", "language": "en", "rating": 4}, {"id": 562832921, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d2690761-r562832921-Maremagnum-Barcelona_Catalonia.html", "text": "This shopping centre was built on a very beautiful location - waterfront of Barcelona. Although there are several restaurants with a nice terrace, this place will offer not many stores but it’s open year around.", "publishedDate": "2018-02-25", "language": "en", "rating": 2}, {"id": 559459024, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d2690761-r559459024-Maremagnum-Barcelona_Catalonia.html", "text": "Went on a rainy day on Sunday. The location has a beautiful view on the sea. However the mall is clearly very touristic and nothing special inside. Average restaurants and shops. Open on Sundays.", "publishedDate": "2018-02-09", "language": "en", "rating": 3}, {"id": 556827036, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d2690761-r556827036-Maremagnum-Barcelona_Catalonia.html", "text": "Maremagnum is really well located in Barcelona. In front of the sea and the marina, the view is really gorgeous. But do not expect to find a lot of good stores inside the mall. But you should go to take your own conclusions.", "publishedDate": "2018-01-28", "language": "en", "rating": 4}, {"id": 554581411, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d2690761-r554581411-Maremagnum-Barcelona_Catalonia.html", "text": "The only shopping centre open on Sundays. Very nice one but too busy and compact. walking distance to Las Rambla", "publishedDate": "2018-01-18", "language": "en", "rating": 4}, {"id": 549709713, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d2690761-r549709713-Maremagnum-Barcelona_Catalonia.html", "text": "Guide books said there was little shopping on Sundays but Maremagnum open. Lots of shops in the shopping centre which is in Barcelona harbour area. Plenty of eating places catering for all tastes. Managed to pick up a few Christmas presents. Views outside were stunning. Sat on the harbour watching boats and cruise ships passing by.", "publishedDate": "2017-12-28", "language": "en", "rating": 5}, {"id": 546086137, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d2690761-r546086137-Maremagnum-Barcelona_Catalonia.html", "text": "Went to visit the City Centre and also Maremagnum with friends for the first time. What a wonderful shopping experience. It was very busy with locals and tourists. Most people are dressed up and very fashionable. Its a nice walk from Las Rambles over the bridge and passed the water. They have a restaurant overlooking the water too. Kiko Milano Cosmetics was our favorite. Be sure to walk up and down Las Ramblas and visit the Maremagnum shopping mall.", "publishedDate": "2017-12-08", "language": "en", "rating": 4}]}}]