[{"locationId": 10296861, "name": "Wallace fountain", "placeType": "ATTRACTION", "reviewListPage": {"reviews": [{"id": 689894720, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d10296861-r689894720-Wallace_fountain-Barcelona_Catalonia.html", "text": "This fountain in Barcelona is an example of a Wallace Fountain, a concept that originated in Paris when safe drinking water was scare. The scarcity meant that the poor were disproportionately affect and resorted to drinking alcohol because it was both cheaper and safer. So an Englishman by the name of Richard Wallace finance the construction of public fountains to both provide for the poor and prevent people falling into alcoholism.\n\nThis Wallace fountain is fairly typical design of four caryatids supporting a decorative roof, above the dispensing tap. Not a must see, but interesting for a bit of history and worth a quick detour if in the area.", "publishedDate": "2019-07-15", "language": "en", "rating": 3}, {"id": 676533776, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d10296861-r676533776-Wallace_fountain-Barcelona_Catalonia.html", "text": "This is a beautiful fountain with a classical look. It  provides drinking water. Its origins go back to the late 19th century. Worth a look.", "publishedDate": "2019-05-26", "language": "en", "rating": 5}, {"id": 579991828, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d10296861-r579991828-Wallace_fountain-Barcelona_Catalonia.html", "text": "If you walk up and down Paseig de Gracia you will probably walk by this little jewel.  It is on a very busy street corner, which also has a fountain in the middle, so one could be enjoying the fountain or could be scurrying across the street and possibly miss it.  It is located where Paseig de Gracia and Gran Via de les Cortes Catalanes meet.", "publishedDate": "2018-05-13", "language": "en", "rating": 4}, {"id": 554788846, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d10296861-r554788846-Wallace_fountain-Barcelona_Catalonia.html", "text": "we love monumetn and walk, we found this fountain near city center, las ramblas, we check after this in internet to know more about this fountain, is very interesting a lot of amazing things you can find in Barcelona", "publishedDate": "2018-01-19", "language": "en", "rating": 4}, {"id": 431952257, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d10296861-r431952257-Wallace_fountain-Barcelona_Catalonia.html", "text": "I was admiring this fountain and then discovered it was on TripAdvisor. \nIt's a beautiful fountain with a great story. ", "publishedDate": "2016-10-26", "language": "en", "rating": 4}]}}]