[{"locationId": 244897, "name": "L'Auditori", "placeType": "ATTRACTION", "reviewListPage": {"reviews": [{"id": 728645397, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d244897-r728645397-L_Auditori-Barcelona_Catalonia.html", "text": "L'Auditori is the home of the Barcelona Symphony Orchestra, and the Barcelona wind band. Once inside, it is a beautiful building despite the very austere exterior. Friendly staff, and high quality performances of a wide range of classical music. Location is not easy - it's not on the \"tourist trail\", but if you are interested in classical music, check the excellent website and book in advance of your visit to Barcelona.", "publishedDate": "2019-11-24", "language": "en", "rating": 5}, {"id": 659311638, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d244897-r659311638-L_Auditori-Barcelona_Catalonia.html", "text": "There is not a bad seat in the house,  the way the theater was designed the accousticas are great and every seat has a good view.  I try to make it to L'Auditory every time we are in Barecelona, several times a year.\n\nThey have some very good quality performances along with other more modest local talent, but overall very good.    \n\nThe theater is away from the toursity areas of Barcelona so most of the patrons are locals, and people of every age.\n", "publishedDate": "2019-03-18", "language": "en", "rating": 5}, {"id": 566145039, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d244897-r566145039-L_Auditori-Barcelona_Catalonia.html", "text": "L'Auditori is designed by Spanish star architect Rafael Moneo. Many good concerts are held there all year round. Before I go to Barcelona, I always check what's on there. Last year, I went to 2 concerts there which were held in Salas 2 and 3 (not the main auditorium). This time, before I went, I noticed that Johann Johansson was having a one night only concert there and I was thrilled. I went. It was held in Sala 1 (so I got to see the main auditorium as well). It was a wonderful concert. Sadly, Johann Johansson passed away 10 days later. The world has lost a great talent. I would not forget this opportunity I had.\nIf you are a music lover, don't forget to check out the programmes there.", "publishedDate": "2018-03-12", "language": "en", "rating": 5}, {"id": 545650224, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d244897-r545650224-L_Auditori-Barcelona_Catalonia.html", "text": "This hall must be seriously destroyed by the city of Barcelona and rebuilt from the ground up. I've been to bad concert halls before, but unfortunately L'auditori tops my list. As soon as the clapping began prior to the concert, you could tell this hall is just painfully saturated, with penetrating trebles, barely inaudible mids and completely one-hundred-percent muted lows. All players playing to a bass clef were just for show—and you hear that from a classical composer's point of view, with still excellent hearing. It really felt not much different than listening to music through tiny phone speakers, including the lack of \"body\" or warmth to the music, and plenty of inaudible parts. If that was not enough, in quiet parts, the A/C noise sadly overcame the music. Other than that, seats were OK, staff was helpful and toilets were clean.", "publishedDate": "2017-12-06", "language": "en", "rating": 1}, {"id": 533585633, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d244897-r533585633-L_Auditori-Barcelona_Catalonia.html", "text": "I cant belive such a place exists in barcelona... but once you are inside everything changes... nice place to listen to some great orchestra... downpoints... everything is in catalan... and the architecture of the place... music, organization and seats... excellent!!", "publishedDate": "2017-10-16", "language": "en", "rating": 4}, {"id": 367161530, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d244897-r367161530-L_Auditori-Barcelona_Catalonia.html", "text": "went to a classical in this wonderful building and had a really good evening Booked the concert on line, the tickets were waiting for us at the booking office.  The staff went out of there way to ensure you knew where you were going and escorted us to our seats. Never seen such a clean and well presented building in all my life", "publishedDate": "2016-04-25", "language": "en", "rating": 5}, {"id": 361877256, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d244897-r361877256-L_Auditori-Barcelona_Catalonia.html", "text": "Saw the Barcelona symphony orchestra play the live soundtrack to Pirates of the Caribbean: The Curse of the Black Pearl here. They were excellent. L'Auditori is clearly not a place many tourists are aware of, a refreshing change and opportunity to mix with real Barcelonins. We had a great time and were attended to very well by bilingual staff. ", "publishedDate": "2016-04-05", "language": "en", "rating": 5}, {"id": 355553950, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d244897-r355553950-L_Auditori-Barcelona_Catalonia.html", "text": "Seats are comfortable, the acoustic is OK, the prices aren’t high at all and the level of Barcelona Symphonic Orchestra is good enough. Very few tourists -if any- among the audience.", "publishedDate": "2016-03-15", "language": "en", "rating": 5}, {"id": 216050144, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d244897-r216050144-L_Auditori-Barcelona_Catalonia.html", "text": "This is a modern purpose built concert venue that looks better from the inside than outside.  It's principal use appears to be for classical music, which I would guess would be great at this venue but I attended a 'Chicago' concert (probably the best band in the world).  Not having been before I selected one of the most expensive seats, right in front of the band about 11 rows back.  However, the design is such that the upper floors, boxes and lateral seating all have great views of the stage.  Attending a concert of the sort you like will not disappoint at this venue.", "publishedDate": "2014-07-18", "language": "en", "rating": 4}, {"id": 150644550, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d244897-r150644550-L_Auditori-Barcelona_Catalonia.html", "text": "If you are visiting Barcelona for its archirecture you can't miss this work by Rafael Moneo. The contrast between its harsh skin and its warm and marvellous halls make it worth buying a ticket for a concert. Next to it you can also visit many interesting buildings by contemporary architects. A must!", "publishedDate": "2013-01-25", "language": "en", "rating": 4}, {"id": 66001767, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d244897-r66001767-L_Auditori-Barcelona_Catalonia.html", "text": "If to rate L'Auditori among all Barcelona attractions, then it's a 4/5. But if to rate it among European musical halls then it's a 3/5. Very mediocre. Acoustics and sound could have been worse, but there're nothing good I can say about it. If there is an orchestra, you can hear them quite well, but the piano doesn't sound loud enough. Make sure you sit in the lower amphitheater - it's the best. I've been there three times, and I liked it most of all. Avoid the upper levels though, because it's very bad.", "publishedDate": "2010-06-01", "language": "en", "rating": 4}]}}]