[{"locationId": 12352280, "name": "Baleària", "placeType": "ATTRACTION", "reviewListPage": {"reviews": [{"id": 712249108, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d12352280-r712249108-Balearia-Barcelona_Catalonia.html", "text": "In 11 September we should have our 3 h ride boat at 11:00 in the morning, but due the bad weather they canceled the ship and we had the option to go at 10:00 in the morning with a long ship (9 H until Bcn ). All good until now, we accepted to go with a long boat but at least to recive the diffrence of money or a camarote to sleep. Nothing of this was possible. Okay. After we arrive in Menorca Port we were informed our boat is canceled (again) so we should take a boat until Mallorca and from there we´ll go to BCN. Okay, we acceped this, they said the boat will leave from Mallorca at 14:30.\nWe arrive in Mallorca and drive from a port to another the catch the new boat we should take to arrive home.\nWe arrived in Mallorca port and there we find a boat where 6 trucks were stucked, so we wait to take out the trucks and cars so we can move to BCN.\n\nWe wait from 14:30 in that boat that was NOT MOVING until at 2;00 IN THE NIGHT, when a boat for IBITZA comes to take us home.\nIn all this time, NOBODY tell us something regarding to th hour when will leave. ALL the emplooyes lies to us, nobody said sorry or something. They give us free dinner and a horror  breakfast -only bread. We complain about that, and until now Balearia didin´t respond or give us a solution. We spent around 650 Euro for a fast boat and we spent almost 1 day in a sh..y Balearia boat. Worst service ever", "publishedDate": "2019-09-23", "language": "en", "rating": 1}, {"id": 692117262, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d12352280-r692117262-Balearia-Barcelona_Catalonia.html", "text": "For the inward journey we travelled via Corsica Ferries who were excellent. Here are the reasons why I will never travel with Balearia again.\n\n1) Toulon to Alcudia via Corsica Ferries Euro 197 for a cabin 3 pax. Balearia Palma to Barcelona Euro 360 for 3 pax. Twice the price.\n\n2) we arrived 70 minutes before departure and was greeted by a very rude bus driver that said we were late. Even though the reservation says to arrive 60 minutes in advance. The luggage department was full and we had to take all out luggage onboard between the seats. No help from the rude driver. By the way as a comparison the inward leg from Toulon via Corsica ferries was excellent. The driver was insistent we were too late and was not happy while we loaded our luggage.\n\n3) one we arrived on board one small lift for the passengers to take their luggage to the 8th cabin deck.\n\n4) very poor air conditioning in the cabins much cooler in the common areas.\n\n5) choice of food and food quality very poor compared to excellent choices in Corsica ferries\n\nAll in all very poor and having now traveled with Corsica Ferries will take the round trip Toulon / Alcudia\n\n \n\n", "publishedDate": "2019-07-23", "language": "en", "rating": 1}, {"id": 690635120, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d12352280-r690635120-Balearia-Barcelona_Catalonia.html", "text": "The journey was nice wth comfortable seats. Overall good experience.\nThe staff was not good with linguistic ability of english so communication problem was present.\nThey were short of blankets.", "publishedDate": "2019-07-18", "language": "en", "rating": 3}, {"id": 675609363, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d12352280-r675609363-Balearia-Barcelona_Catalonia.html", "text": "I booked and paid online for a one way trip from Barcelona  to Palma de Mallorca on 1 May 2019.\n\nOn the DIRECTFERRIES booking portal there is an option that reads NIE/Residency Certificate, which I selected for a fare of 89€ since I have a Spanish NIE card. The next best fare was 120€.\n\nOn checking in I was informed that I have used the incorrect fare (see above) since I am not a resident of the Balearic islands.\n\nThe check in clerk informed me I have to pay in an additional 200€ to change the fare or I can purchaSE A NEW TICKET AT 120€ AND THEN RECLAIM THE FIRST FARE OF 89€ FROM DIRECT FERRIES.\n\nI did so and nbow, much to my dismay and frustration, getting any replies from Direct Ferries is like shouting against thunder since I am being shifted from pillar to post by every single customer service agent I have made contact with and as for one 'Shirley' on the customer service call desk, listen sweety, it is expensive to phone internationally and you are hardly able to assist me if the bulk of the conversation amounts to you repeatedly interrupting me instead of hearing me out first and then deciding what action to take or recommendation to make.\n\nI WOULD NOT USE EITHER DIRECT FERRIES OR BALEARIA AGAIN BY CHOICE.\n\nThe crossing itself was fine", "publishedDate": "2019-05-21", "language": "en", "rating": 1}, {"id": 601127883, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d12352280-r601127883-Balearia-Barcelona_Catalonia.html", "text": "I booked the ferry from Barcelona to Mallorca and return online some time ago for September 2018. I was choosing Balearia instead of Transmediterranea line even if it was more expensive because they confirmed a modern ferry with nicer cabins on this route. Now I found out that they changed the vessel on this route without informing me. The ferry they use now is old and the cabins are outdated.\nI wanted to cancel my booking as they do not use the confirmed vessel as named in the contract but Balearia refuses to cancel and to refund the price for the booking (almost 500 Euro). The answer from the hotline was just \"Sue us if you want!\"\nBeware of this company!", "publishedDate": "2018-07-30", "language": "en", "rating": 1}, {"id": 583929673, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d12352280-r583929673-Balearia-Barcelona_Catalonia.html", "text": "What can I say good about this crossing? Possibly the only thing is the speed of the disembarkation.\n\nI'll start the negative stuff at home. The ticket was booked through direct ferries and wasn't cheap. I paid for a larger cabin with the expectation that it would be A) Outside B) Nice, I'll come to those once we've boarded the vessel.\n\nI received confirmation from Direct Ferries and shortly before the journey I had an email advising me that I could save time by checking in online. Balaeria on the other hand said no, I must go to the check in desk. \"Which desk\" I asked them (two are listed for Barcelona), \"I don't know, I'm in Denia\" was the unhelpful reply. Oh well, Google earth found me one place which happened to be the right one.......Google clearly knows more than Balearia staff.\n\nLet's move to the port now. I managed to find some parking (a huge underground car-park right by the check in desk) and I went in and checked in. The lady said, park at Teminal C after 7pm. OK, I turned up at terminal C at 7pm only to find it had been moved to Termianl B,not a major issue as they are close by. We then waited, and waited, and waited. Then at the last possible moment we were taken in convoy to a completely different dock about 2 miles away. It was farcical.\n\nAre you still with me on this horror story? Well, let's move onto the ship. We were parked up and made our way to the reception. Now, I use ferries quite a lot and I'm used to helpful staff in clean uniforms. Not here. Greeted by a guy who simply pointed to reception. You see, although you've already checked in you've not been allocated your room or it's key, unlike Stena or Brittany Ferries. So, another queue now at 23:00 this time for a rather unhelpful lady who clearly didn't want to be there and was making that fact rather obvious. The key was duly handed over and I made my way to the room, expecting something clean, tidy with a window. What I found was a dirty cabin, peeling paint on walls in corridors and an inside cabin which frankly, I was loathe to sleep in. Oh, and no air conditioning as it was broken on a warm night on the med, lovely!\n\nNo bar, no food, nothing to eat or drink anywhere. Just a single bottle of water in a 4 berth cabin left on the side!\n\nI slept fitfully in my clothes on the top of the bed.\n\nAt 5:45am someone walked up and down the corridor tapping on the doors giving us a rather rude awakening.\n\nNow, this part isn't the fault of the staff, but my wife left her Google Tablet either in the room or on a table while we were waiting to disembark. We didn't find out until later and contacted Balaeria straight away using their web contact form. I still have not heard a peep from them. Yet a member of staff will have found it in the room if it was there and almost certainly a member of staff will have found it on a table!\n\nSorry for the long and often rambling review. Bit I want other travellers to be fully aware of what they're paying for if they use this crossing.", "publishedDate": "2018-05-30", "language": "en", "rating": 1}, {"id": 577939863, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d12352280-r577939863-Balearia-Barcelona_Catalonia.html", "text": "We travelled from Barcelona to Palma on the overnight ferry leaving at 11pm. The confirmation email for our booking said that there were maps on the Balearia website of the ports. I looked everywhere and could only find the details for what turned out to be the restricted dockside area. Not knowing that at the time, we drove to that address (thankfully very early) and were turned away by a quite bemused armed policeman. We then proceeded to drive back to Barcelona and had to follow signs for the docks until eventually we were lucky enough to spot a sign for the Balearia terminal. We parked and went in to ask where we were supposed to take the car, to be told to drive it to terminal S. This information does not appear to be anywhere on Balearia's website (I looked again at both the Spanish and English translations of the site thinking that perhaps something had been lost in the language barrier) which is very strange. \nWe arrived as advised two hours before the departure time and then took part in a rather messy display of cars having to reverse into queues in a small space on the quay. I am only grateful we were not towing anything, unlike the several caravans and boats being taken on board. It was confusing that there appeared to be Balearia staff there with no identification or high-visibility jackets so we were unsure who was supposed to be organising things. \nWe then waited until about 40 minutes before the departure time at which point we were guided into a single queue on the quay. Cars in front of us all had their hazard lights on which we assumed they had been advised to do by the staff but none mentioned this to us and we didn't understand why this would be necessary. We were near the back of this queue but it later transpired that we were following a Balearia van in convoy through the streets of Barcelona, with vehicles ignoring street signs and traffic lights in the desperation not to lose sight of the vehicles in front, leading to some interesting moments with other road-users. The last two cars in the convoy (us and the car in front) did eventually get left behind. By this time we realised that they were leading us back to exactly where we had been earlier in the day. Thankfully, another member of staff was waiting near that part of the actual dock and flagged down the next convoy leader for us to join them. We finally arrived at the boat and boarded without incident. \nThe ferry itself was fine if a little tatty. We had a four-berth cabin which was comfortable and had everything you would expect (decent towels, bedding, soap etc). We slept well and woke up just before the staff began the very subtle process of banging on doors and shouting down the corridors to warn people we would be arriving soon. There was not a lot of direction as to when we should leave our cabin but we don't appear to have been told off for waiting until we were permitted to go back to our car so it seems to be fine. \nI don't think I have ever witnessed anything quite so shambolic as the organisation of this trip from start to finish. I can only hope this was a one-off but I somehow doubt that and I would be amazed if no one has ever come to grief following the convoy in this way. For the amount of money we paid this was pretty poor.", "publishedDate": "2018-05-04", "language": "en", "rating": 2}, {"id": 517810168, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d12352280-r517810168-Balearia-Barcelona_Catalonia.html", "text": "Crossing from Palma to Barcelona on ferry Abel Matutes.\n\nAlthough we crossed in flat seas during the day, the 7 hour trip was not enjoyable. For 900 passengers, there were very few toilets and the men's on the top deck were blocked and disgusting. (Heaven help poor travellers if it's bad seas). The bins were overflowing with rubbish and the outside bar area was awash with food and rubbish on the ground. The staff made no attempt to tidy and clean at all throughout the crossing.\n\nThe cafeteria was open for a couple of hours at the start of the crossing but after that was closed for the rest of the crossing. The outside bar and inner mini cafe then ran out of food when we were only 3 hours into the crossing and it was a 7 hour crossing arriving at 8pm. There were no sandwiches, no rolls, no ice (it was a very hot day too)- the only food left were chocolate bars. Not impressed.\n\nFinally, we had booked seats in the cafeteria area but immediately regretted it! Not enough seating for everyone who had booked there, it was very hot and tables and seating were broken. Not great at all for 7 hours.... We managed to upgrade to the 'Neptune' reclining seats area which was better. We were very lucky to be able to do this as there were very few left so I recommended pre booking this. However, again, it was still hot and sticky plastic seats (take a towel or pareo in summer time to stop sticking to seats). I can't comment on the cabins as we didn't used one. \n\nReally not that enjoyable when it should have been a lovely experience. But maybe that's just what you get when Balearia have the monopoly on this route and it's all unionised...", "publishedDate": "2017-08-26", "language": "en", "rating": 2}, {"id": 505744664, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d12352280-r505744664-Balearia-Barcelona_Catalonia.html", "text": "Barca to Alcudia was 'ok'\nThe boarding of the ferry was chaotic. Why is only 1 person allowed in each vehicle that drives on? No one told us until we were driving into the ferry and then I got out of the car to walk on the ferry. Other people were also turfed out of their cars as they drove towards the ferry too - why? for what purpose? it doesn't happen in Alcudia or Palma to come back to Barca...it makes no sense! \nAs for the actual loading of the ferry, I think someone from Balearia should spend some time on any of the cross Channel or Irish Sea ferries and learn how to board them. Never had to reverse around a ferry before - it was madness.\nOvernight ferry, not very busy for July and the seating in the canteen area was quite comfortable- we even managed to get a bit of sleep. The public areas were pretty clean and tidy throughout the crossing.\n\nPalma to Barca\nWe were both allowed to stay in the car - much easier. Boarding was more organised (but that is only compared to our outbound experience!) and certainly took less time.\nAgain the ferry was not that busy but it was filthy. It was a daylight crossing this time.\nOur seating was the the cafeteria- with a large group of French school kids who apparently had no idea how to use a toilet without making a mess. \nIn the cafe area itself there were damaged tables and broken furniture piled in a corner! The seats were not great and the floor was dirty.\nWe went for a walk outside - the outside deck areas were filthy. Old rubbish and cigarette ends in the matting on the floor - clearly it hadn't been cleaned for some time. The outside bar looked grubby too.\n\nThis was not an inexpensive crossing.\nI don't plan to do it again and if I did I would certainly look at the other companies before booking with Balearia again.", "publishedDate": "2017-07-26", "language": "en", "rating": 2}]}}]