[{"locationId": 7132622, "name": "Cat, Fernando Botero", "placeType": "ATTRACTION", "reviewListPage": {"reviews": [{"id": 751538498, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d7132622-r751538498-Cat_Fernando_Botero-Barcelona_Catalonia.html", "text": "This was right outside our hotel (NIU) and while the area is far from stunning, I never felt threatened or uncomfortable.\n\nThe cat sculpture itself certainly has a unique appearance and if you are nearby it maybe worth a little detour to take a photo, if not, no great loss.", "publishedDate": "2020-03-21", "language": "en", "rating": 4}, {"id": 738757325, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d7132622-r738757325-Cat_Fernando_Botero-Barcelona_Catalonia.html", "text": "Fernando stands proud, Botero the sculpture has captured him in a larger than life. We got here by walking from the Los Ramblas area. Put on your walking shoes because Barcelona has a lot to offer.", "publishedDate": "2020-01-12", "language": "en", "rating": 5}, {"id": 728429142, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d7132622-r728429142-Cat_Fernando_Botero-Barcelona_Catalonia.html", "text": "I admire Botero, his paintings and statues, so that’s why we went to see it, but I gotta say it was the first time in many years when we felt so uncomfortable in the neighborhood, where it’s located (and we lived in New York!). We visited between 4 and 5 PM and sat nearby to rest and saw very unpleasant situations and suspicious people which made us feel unsafe. We quickly took photos and left the area! So my advice- please don’t show up too late and be careful. The cat is a large bronze sculpture that is hard to miss. I liked it. ", "publishedDate": "2019-11-23", "language": "en", "rating": 3}, {"id": 726441238, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d7132622-r726441238-Cat_Fernando_Botero-Barcelona_Catalonia.html", "text": "This is about 10 minutes from Las Ramblas. It's a  working class area - though  our rather swish hotel  was actually on this square. It comes alive at night with the locals sitting out eating and drinking from the many bars / restaurrants that surround the square. I got pick -  pocketed  right outside of  my hotel here, so be very careful. The local bar owner informed us that it is  not  safe for tourists to be out late at night in this neighbourhood -  as crime was so  rife. In the day  it'll be fine, just be vigilant.\nThe sculpture will only take a few minutes of your time - it's unusual and amusing  and perfect for photography snaps. There's nothing much else here but you're not far  from other sites of interest. I had no idea the cat  had such a famous  creator.", "publishedDate": "2019-11-14", "language": "en", "rating": 3}, {"id": 723246442, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d7132622-r723246442-Cat_Fernando_Botero-Barcelona_Catalonia.html", "text": "This odd little curiosity is located in the middle of an otherwise nondescript and empty (there is a child play area) plaza.  We past by it several times when returning to our hotel and never noticed it until a random scan of Google Maps for interesting sites turned it up.  It is fun for a quick picture and then you can quickly move on.  The tough choice is which angle you use for the photo.  Judging from Google images, many people prefer to take a picture this cat's undercarriage.", "publishedDate": "2019-11-02", "language": "en", "rating": 3}, {"id": 712526652, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d7132622-r712526652-Cat_Fernando_Botero-Barcelona_Catalonia.html", "text": "It was a good idea to put this Gato here in the end. If many people come and take pictures, this will be excellent for this neighboorhood that urgently needs this kind of social control. Locals protest against drugs and street violence, so let's help them by going there. That's exactly what they succeeded doing on the Plaça Reial.", "publishedDate": "2019-09-24", "language": "en", "rating": 4}, {"id": 710038913, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d7132622-r710038913-Cat_Fernando_Botero-Barcelona_Catalonia.html", "text": "I look for Botero's in every city I travel to. This one was a little difficult to find. It is in a park in the center of a neighborhood.\n", "publishedDate": "2019-09-15", "language": "en", "rating": 5}, {"id": 703845558, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d7132622-r703845558-Cat_Fernando_Botero-Barcelona_Catalonia.html", "text": "Fun piece by famous Colombian artist. Its worth it for the photos with you kids and teh giant cat!. Its only 10min from Las Ramblas down small side streets or less from Colombus monument ... easy to find in large leafy boulvard. Area feels unloved but isnt .. \n\nIMPORTANT BIT .. THIS IS FREE AND BRILLIANT\n\nWhile yu are there go to Hotel Barcelo Raval (the bit modern tower thing opposite side of the road ...looks a bit like a giant car park).. take lift on the far end ... goes to 11th Floor... \n\nIts a public bar on top of the hotel and has some of the very best views of Barcelona city scape from its 360degree vantage", "publishedDate": "2019-08-28", "language": "en", "rating": 4}, {"id": 697381688, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d7132622-r697381688-Cat_Fernando_Botero-Barcelona_Catalonia.html", "text": "Typical Botero's creation! El Gato Grande! This cat looks so cool, it's dificult not to touch! Very photogenic)))", "publishedDate": "2019-08-09", "language": "en", "rating": 5}, {"id": 690177496, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d7132622-r690177496-Cat_Fernando_Botero-Barcelona_Catalonia.html", "text": "El Gat de Botero is a sculpture by the Columbian artist Fernando Botero. It’s a fun sculpture of a cat feature his signature Boterismo style of exaggerated and Rubenesque proportions.\n\nA bit of a detour, but worth it for something a little different in Barcelona.", "publishedDate": "2019-07-16", "language": "en", "rating": 5}, {"id": 683294214, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d7132622-r683294214-Cat_Fernando_Botero-Barcelona_Catalonia.html", "text": "This gigantic cat is a spectacular sculpture made by Colombian Fernando Botero. It has been placed at the Rambla de Raval, a large boulevard located in a very deteriorated neighborhood. The whole area is filthy, with awful smells everywhere, and you feel very unsafe, even in bright daylight. \n\nHowever, there are construction works going on, and hopefully these repairs in the Rambla will help improve the whole atmosphere of the area, which is currently really disheartening.\n\nUnfortunately, I do not think it is wise or nice to visit the spectacular Cat of Botero while the surroundings stay as they are now.", "publishedDate": "2019-06-21", "language": "en", "rating": 4}, {"id": 676670171, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d7132622-r676670171-Cat_Fernando_Botero-Barcelona_Catalonia.html", "text": "This statue made me very happy as I was missing my own cat at home. This one is huge and cast in bronze very nicely indeed. It's a fun piece of street art in Ravel on the Rambla and lovely so see but no need to go out of the way for it.", "publishedDate": "2019-05-26", "language": "en", "rating": 5}, {"id": 675941559, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d7132622-r675941559-Cat_Fernando_Botero-Barcelona_Catalonia.html", "text": "Such an interesting and wonderful statue of a giant cat that I just had to see to believe and it's even better in real life, absolutely loved it.", "publishedDate": "2019-05-23", "language": "en", "rating": 5}, {"id": 657244959, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d7132622-r657244959-Cat_Fernando_Botero-Barcelona_Catalonia.html", "text": "We walked past this statue today on the way to a museum.\n\nRather odd. Only worth seeing if you are interested in cats or are passing by. \n\nThe surrounding streets aren't the best.", "publishedDate": "2019-03-08", "language": "en", "rating": 4}, {"id": 657104228, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d7132622-r657104228-Cat_Fernando_Botero-Barcelona_Catalonia.html", "text": "Whilst in Barcelona, Doris&Elsie were also on holiday in the cattery so I just had to go and find Fernando and take a picture.", "publishedDate": "2019-03-07", "language": "en", "rating": 4}, {"id": 639367380, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d7132622-r639367380-Cat_Fernando_Botero-Barcelona_Catalonia.html", "text": "We stayed at the Barceló Raval looking over this creature day and night. While I see that it's a cat, I'm not sure what the artist's intentions were when he placed it here. The Raval neighbourhood is a bit weird - let's call it adventurous. \n\nThe cat is a touristy hot spot, and if you're nearby, then go take a look. But don't travel to Raval just to see the cat.", "publishedDate": "2018-12-13", "language": "en", "rating": 4}, {"id": 633656539, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d7132622-r633656539-Cat_Fernando_Botero-Barcelona_Catalonia.html", "text": "We've searched for this cat and finally found it. It is a funny sculpture worth seeing and taking pictures with :)", "publishedDate": "2018-11-15", "language": "en", "rating": 5}, {"id": 624887226, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d7132622-r624887226-Cat_Fernando_Botero-Barcelona_Catalonia.html", "text": "I knew about this cat for a long time after seeing the London one, but only just got to visit.\nI am extremely fond of cats & loved this very large sculpture easy to find & for me definitely worth the time it took to visit the cat.", "publishedDate": "2018-10-14", "language": "en", "rating": 5}, {"id": 623598428, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d7132622-r623598428-Cat_Fernando_Botero-Barcelona_Catalonia.html", "text": "Rambla Del Raval is a boulevard in the eclectic Raval neighbourhood teeming with bars and restaurants either side and down the centre of this boulevard is this magnificent structure of a huge cat.\nIt looks absolutely amazing ,a true selfie magnet and in such a vibrant district it really is a superb addition,the amount of people I saw getting a selfie against this huge moggy was amazing.\nA wonderful statue,well worth checking out if your walking down Rambla Del Raval .", "publishedDate": "2018-10-09", "language": "en", "rating": 5}, {"id": 617767873, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d7132622-r617767873-Cat_Fernando_Botero-Barcelona_Catalonia.html", "text": "Not much to it other than it's an impressive large bronze statue of a cat. A guide told my group that luck comes to whoever touches its bell or balls. Something about returning to Barcelona if you do.\nCool statue, dont feel the need to go far out of your way to see it.", "publishedDate": "2018-09-18", "language": "en", "rating": 4}, {"id": 612951205, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d7132622-r612951205-Cat_Fernando_Botero-Barcelona_Catalonia.html", "text": "Located about 10 mins from La Rambla the big cat sculpture is in a quiet square in Raval area.  I wouldn't make a special detour to visit this unless you are into Botero's work", "publishedDate": "2018-09-01", "language": "en", "rating": 3}, {"id": 612075168, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d7132622-r612075168-Cat_Fernando_Botero-Barcelona_Catalonia.html", "text": "This is a magnificent Cat.\nIt is created by the colombian figurative artist and sculptor Fernando Botero.\nThe Cat was purchased by Barcelona City Council in 1987, and after that the sculpture was placed different places in the city.\nIn 2003 the Cat moved to the beautilful Rambla del Raval, and it is good home for the Cat.", "publishedDate": "2018-08-29", "language": "en", "rating": 4}, {"id": 588220101, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d7132622-r588220101-Cat_Fernando_Botero-Barcelona_Catalonia.html", "text": "Love this sculpture with its playful atmosphere. Great spot to take pictures to send home and gives the area a joyous feeling often absent in other places. The art scene is an important part of the city and this should be viewed by all art lovers.", "publishedDate": "2018-06-17", "language": "en", "rating": 5}, {"id": 578067404, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d7132622-r578067404-Cat_Fernando_Botero-Barcelona_Catalonia.html", "text": "Ran across “el Gato de Botero” while wandering around. The neighborhood does feel a bit sketchy but safe enough in daylight hours. \n\nThe giant black cat appears to be cast in bronze with cartoonish features. An endearing statue to any feline fans. Bright side : he never gets fleas and doesn’t need a litter box. ", "publishedDate": "2018-05-05", "language": "en", "rating": 4}, {"id": 571354196, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d7132622-r571354196-Cat_Fernando_Botero-Barcelona_Catalonia.html", "text": "An adorable statue of a giant cat. He’s cute, claimable and photogenic. What’s not to enjoy? The area is nice as well and only 5/10 minutes gentle stroll from the Ramblas. The “square”is surrounded by affordable and serviceable cafes, they are a la carts dining but they are ideal for families or budget dining. ", "publishedDate": "2018-04-05", "language": "en", "rating": 4}, {"id": 557081900, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d7132622-r557081900-Cat_Fernando_Botero-Barcelona_Catalonia.html", "text": "Botero's is worth a look see.  Down some strange little alley way you come out into a apartment park square and there he is.  He isn't ferral he has a bell and a collar.  He's large and truly a statement.  Where would you out him if someone gave you him as a gift?", "publishedDate": "2018-01-29", "language": "en", "rating": 4}, {"id": 556672133, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d7132622-r556672133-Cat_Fernando_Botero-Barcelona_Catalonia.html", "text": "I’ve given this giant ugly fellow 5 stars out of sympathy. The story goes that Botero made a gift of this somewhat rotund feline, to the city of Barcelona. Barcelona being a city of great beauty, we’re somewhat taken aback and it has moved from several locations to it’s current one. It would seem el gato is not particularly wanted and currently resides in a ramshackle back square of the Ramblas. However he is huge and you can’t miss him and he had no choice as to his appearance or of his locale. He’s worth a 5 minute diversion, as you won’t ever see anything quite like him again", "publishedDate": "2018-01-27", "language": "en", "rating": 5}, {"id": 549091183, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d7132622-r549091183-Cat_Fernando_Botero-Barcelona_Catalonia.html", "text": "This statue is fun to stop by for a few minutes and take a some photos. The area around the statue and the street leading from La Ramble looks like they have not been properly maintained in recent years, although should not deter a visit.", "publishedDate": "2017-12-24", "language": "en", "rating": 4}, {"id": 547151766, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d7132622-r547151766-Cat_Fernando_Botero-Barcelona_Catalonia.html", "text": "After a glowing recommendation from my taxi driver, who said it was one of the must see attractions in Barcelona, I made a visit to see the big gato and I must say I was underwhelmed and it is hardly worth going out of your way to see. Pep, the taxi driver, may have exaggerated the need to see it with his multiple 'pffffffff's' as if we were going to see the Pyramids of Giza. Not for me unfortunately! ", "publishedDate": "2017-12-14", "language": "en", "rating": 2}, {"id": 539335202, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d7132622-r539335202-Cat_Fernando_Botero-Barcelona_Catalonia.html", "text": "We wandered from La Ramblas to find this beauty because we love cats. Don't miss his little cat balls!", "publishedDate": "2017-11-08", "language": "en", "rating": 5}, {"id": 538541586, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d7132622-r538541586-Cat_Fernando_Botero-Barcelona_Catalonia.html", "text": "But it’s so funny! A giant cat in the middle of the way. Just to take a photo and have a laugh with friends.", "publishedDate": "2017-11-05", "language": "en", "rating": 4}, {"id": 534355894, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d7132622-r534355894-Cat_Fernando_Botero-Barcelona_Catalonia.html", "text": "I mean, you kind of know what to expect based on the picture, but this isn't really an attraction or thing to do. If you're already on this strip to eat or take a stroll, sure, stop by like we did and get a quick picture, but otherwise, don't make a special trip out of it.", "publishedDate": "2017-10-19", "language": "en", "rating": 2}, {"id": 520771939, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d7132622-r520771939-Cat_Fernando_Botero-Barcelona_Catalonia.html", "text": "I was missing my cats on this trip (I was away with my job for six months when I saw Fernando).  It was nice to run into him while walking around.  He is a good sized statue and is purrfect for a photo opportunity.", "publishedDate": "2017-09-03", "language": "en", "rating": 4}, {"id": 520260725, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d7132622-r520260725-Cat_Fernando_Botero-Barcelona_Catalonia.html", "text": "This is my favorite sculpture in Barcelona, Botero fat cat located in Raval district. It has very funny little balls and ugly face.", "publishedDate": "2017-09-01", "language": "en", "rating": 5}, {"id": 517254560, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d7132622-r517254560-Cat_Fernando_Botero-Barcelona_Catalonia.html", "text": "This cat was one of the highlights of my trip to Barcelona. My family are crazy cat people and this was a great photo opportunity. At first we didn't know it was a cat. Over a week it grew on us. Every time we saw it, it made us smile.", "publishedDate": "2017-08-24", "language": "en", "rating": 5}, {"id": 505238221, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d7132622-r505238221-Cat_Fernando_Botero-Barcelona_Catalonia.html", "text": "While touring in Raval you have to visit Rambla del Raval, a great pedestrian designed street with palms and flowering plants. In the middle of Rambla del Raval is a great piece of public art for your amusement and enjoyment. You have to get a picture with the \"Cat\". I am sure it is some kind of homage to the historic alley cats of the historic quarter but it now serves as a great picture sight for those visiting El Raval. It takes nearly no time but it will bring a smile to your face and something you can show your friends that is uniquely Barcelona.", "publishedDate": "2017-07-24", "language": "en", "rating": 4}, {"id": 501316844, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d7132622-r501316844-Cat_Fernando_Botero-Barcelona_Catalonia.html", "text": "Well, not really worth looking for it but if you are walking around Raval you will end up finding it. Good for funny photos. :) ", "publishedDate": "2017-07-12", "language": "en", "rating": 4}, {"id": 499643393, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d7132622-r499643393-Cat_Fernando_Botero-Barcelona_Catalonia.html", "text": "Walking down La Rambla de Raval has a different sense of Barcelona, it's more quite and never too overwhelmed with people you can observe quietly the neighborhood. Just before the avenue is ending you encounter with the massive Cat by Fernando Botero the great and it's simply a unique experience! This cat has something special. Don't miss it! ", "publishedDate": "2017-07-08", "language": "en", "rating": 4}, {"id": 487104972, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d7132622-r487104972-Cat_Fernando_Botero-Barcelona_Catalonia.html", "text": "Walked quite a bit to see this lovely huge smiling cat and was not disappointed :) great fun and a perfect selfie setting!", "publishedDate": "2017-05-23", "language": "en", "rating": 5}, {"id": 483950819, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d7132622-r483950819-Cat_Fernando_Botero-Barcelona_Catalonia.html", "text": "Loved the statue, only downside was that we felt slightly uncomfortable with the surroundings. There were no other tourists around and the area looked quite rundown and my partner wasn't comfortable enough to unpack his camera to take photos. I managed to snap as a couple with my mobile phone though! We didn't linger and moved quickly on. ", "publishedDate": "2017-05-13", "language": "en", "rating": 3}, {"id": 478841238, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d7132622-r478841238-Cat_Fernando_Botero-Barcelona_Catalonia.html", "text": "Perfect weather and a Lovely walk from the marina to visit this statue by Fernando Botero   Pedestrian area was full of locals enjoying the day and each other.  Had a nice lunch in a local cafe.  It was a fun way to spend some quality time and a whole lot quieter than bumping into people on Las Ramblas.  It was fun to see it and take photos.", "publishedDate": "2017-04-25", "language": "en", "rating": 5}, {"id": 460808620, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d7132622-r460808620-Cat_Fernando_Botero-Barcelona_Catalonia.html", "text": "If your a cat person or have kids don't miss this as its good fun! its an art installation similar to that of the charging bull in new york. The puss looks happy and the area he resides is full of bars and restaurants so you might be able to kill two birds with one stone here.", "publishedDate": "2017-02-17", "language": "en", "rating": 4}, {"id": 460285218, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d7132622-r460285218-Cat_Fernando_Botero-Barcelona_Catalonia.html", "text": "I discovered so far 3 public boteros, one is in T2 Airport of Barcelona, other is at the beginin of rambla Cataluña and this one that is the best... there are a lot of nice bars around with great terraces to enjoy the sun of Barcelona ", "publishedDate": "2017-02-15", "language": "en", "rating": 5}, {"id": 458177206, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d7132622-r458177206-Cat_Fernando_Botero-Barcelona_Catalonia.html", "text": "The cat sculpture puts a smile on your face. It reflects the artistry, quirkiness and panache that pervades Barcelona. Meow Meow Meow Meow!", "publishedDate": "2017-02-08", "language": "en", "rating": 5}, {"id": 455911585, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d7132622-r455911585-Cat_Fernando_Botero-Barcelona_Catalonia.html", "text": "Random cat statue on Rambla de Raval - quite impressive/unique but nothing worth making a big effort to see.\n\nThe Rambla is similar to many Ramblas in BCN, with pavements either side of a wide pedestrian area - where the cat statue is located. However, being in the centre of Raval, a predominantly immigrant area, most of the bars, cafés and other eateries are kebab style takeaways, some of which offer indoor seating and dining facilities.\n\nIt is certainly a 'watch your belongings' area and relatively cheap given its central location, but in my personal opinion, certainly not one of my favourite areas.", "publishedDate": "2017-01-30", "language": "en", "rating": 3}, {"id": 427777665, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d7132622-r427777665-Cat_Fernando_Botero-Barcelona_Catalonia.html", "text": "A very big bronze cat placed on sidewalk,in Raval.Nice but you don't need more than 10 minutes to admire it.", "publishedDate": "2016-10-13", "language": "en", "rating": 4}, {"id": 401624596, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d7132622-r401624596-Cat_Fernando_Botero-Barcelona_Catalonia.html", "text": "Fernando Boteros giant bronze-cat is standing on Rambla Raval. It´s spectacular depending on the size.", "publishedDate": "2016-08-05", "language": "en", "rating": 5}, {"id": 399457997, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d7132622-r399457997-Cat_Fernando_Botero-Barcelona_Catalonia.html", "text": "I love Botero statues, I have seen them everywhere and this is his giant cat. They are always fun, human or animal. It's about the statue and Botero, more so then this one being a CAT .\n\nIt's worth the side trip, takes a few minutes ....", "publishedDate": "2016-07-31", "language": "en", "rating": 4}, {"id": 389190360, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d7132622-r389190360-Cat_Fernando_Botero-Barcelona_Catalonia.html", "text": "Absolutely adorable in a not so adorable street just off Las Ramblas. Perfect for any who loves cats, simple cute statue and very easy go get to. Worth a 10-15 minute walk from Las Ramblas ", "publishedDate": "2016-07-04", "language": "en", "rating": 4}, {"id": 386563358, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d7132622-r386563358-Cat_Fernando_Botero-Barcelona_Catalonia.html", "text": "Had some extra time and was close to la rambla and decided to check it out..not the best neighborhood but plenty of tapas bar and restaurants around..took us a while to get a picture since a family decided to let their kids fooled around with the cat whiskers,  but I'll say it was ok to be able to admire this piece of art...", "publishedDate": "2016-06-27", "language": "en", "rating": 4}, {"id": 382294526, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d7132622-r382294526-Cat_Fernando_Botero-Barcelona_Catalonia.html", "text": "Fun to take photos with! Nice little walkway beside the cat too which is surrounded with trees. Great food places close by too", "publishedDate": "2016-06-13", "language": "en", "rating": 4}, {"id": 381471956, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d7132622-r381471956-Cat_Fernando_Botero-Barcelona_Catalonia.html", "text": "This is cat statue, sculpture, yokey thingy was my saving grace when I stayed in Barcelona. My apartment building and balcony was looking opposite the big cat yoke. If I was ever lost and when I saw this cat I knew I was safe. People visit it contantly and it's very popular.", "publishedDate": "2016-06-10", "language": "en", "rating": 5}, {"id": 377345359, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d7132622-r377345359-Cat_Fernando_Botero-Barcelona_Catalonia.html", "text": "If you are in the neighbourhood then check it out. The cat looks great. Where else will you see such a big cat made of bronze. \n\nBecareful using Google maps as it's not where it says it is!", "publishedDate": "2016-05-28", "language": "en", "rating": 5}, {"id": 371006724, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d7132622-r371006724-Cat_Fernando_Botero-Barcelona_Catalonia.html", "text": "Although no real story about this cat, it is still fun and the place is very nice and worth visiting!", "publishedDate": "2016-05-07", "language": "en", "rating": 4}, {"id": 359739454, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d7132622-r359739454-Cat_Fernando_Botero-Barcelona_Catalonia.html", "text": "Great find - gigantic cat - very novel !! Made a unique photo opportunity\n !! Neighbourhood is very cosmopolitan didn't feel very safe ! ", "publishedDate": "2016-03-29", "language": "en", "rating": 4}, {"id": 359071961, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d7132622-r359071961-Cat_Fernando_Botero-Barcelona_Catalonia.html", "text": "Great big bronze cat ! Haha great! This has to be the best large bronze cat I have ever seen in all of Barcelona. Ah, is it the only one? ", "publishedDate": "2016-03-27", "language": "en", "rating": 5}, {"id": 343719018, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d7132622-r343719018-Cat_Fernando_Botero-Barcelona_Catalonia.html", "text": "In Barcela there are lot of things you should see. One of them is this Gatto. I really like it. It is close to Rambla and it is easy to find it. ", "publishedDate": "2016-01-30", "language": "en", "rating": 5}, {"id": 339538763, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d7132622-r339538763-Cat_Fernando_Botero-Barcelona_Catalonia.html", "text": "This lovely sculpture by Fernando Botero was purchased by the city in 1987 and wandered around for several years until it found the permanent location. It is a well-known and recognizable emblem of the city, a favorite spot for taking pictures and a popular meeting point.", "publishedDate": "2016-01-12", "language": "en", "rating": 5}, {"id": 338258291, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d7132622-r338258291-Cat_Fernando_Botero-Barcelona_Catalonia.html", "text": "Super nice cat sculpture in Raval. The perfect photo shooting for cat lovers like we were. New profile picture on Facebook? Here we go. Took some time to get a clear shot but most tourist are respectful and let you take turns. Close to La Rambla, worth the detour !!!!!", "publishedDate": "2016-01-07", "language": "en", "rating": 5}, {"id": 334477665, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d7132622-r334477665-Cat_Fernando_Botero-Barcelona_Catalonia.html", "text": "I finally went to check this cat out since it was near my hotel.  It is cute and it just sticks out in the park.  The tail part is funny. ", "publishedDate": "2015-12-22", "language": "en", "rating": 4}, {"id": 330584510, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d7132622-r330584510-Cat_Fernando_Botero-Barcelona_Catalonia.html", "text": "It is in a hidden location. We had to walk with a map to find it. The nearest metro station is Paral-lel.", "publishedDate": "2015-12-03", "language": "en", "rating": 4}, {"id": 321154874, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d7132622-r321154874-Cat_Fernando_Botero-Barcelona_Catalonia.html", "text": "Very nice and friendly cat. I want to bring him With me home. I like the square around too not so many turist,  nice and quiet.", "publishedDate": "2015-10-23", "language": "en", "rating": 5}, {"id": 321045946, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d7132622-r321045946-Cat_Fernando_Botero-Barcelona_Catalonia.html", "text": "Fernando Botero is one of my favorite artists and this large sculpted cat is a very good work of art. Everyone can relate to it because almost everyone has had a cat at some part of his life.", "publishedDate": "2015-10-22", "language": "en", "rating": 5}, {"id": 320838674, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d7132622-r320838674-Cat_Fernando_Botero-Barcelona_Catalonia.html", "text": "I was going to my way to plaza cataluña and suddenly I found this enormous fat and cute cat! It was on the middle of a little square, at first it doesn't has any sense to me, but then I realized that it was the whole plaza for the cat, and suddenly .... Botero's cat in front of me! I really enjoy it, it's a perfect spot to take a pic! ", "publishedDate": "2015-10-22", "language": "en", "rating": 4}, {"id": 317021355, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d7132622-r317021355-Cat_Fernando_Botero-Barcelona_Catalonia.html", "text": "During our stay in Barcelona, we saw many examples of interesting and unique architecture. It appeared that the people of Barcelona love their street sculptures as well.\nThe city is decorated in many places, with examples of contemporary and creative sculptures. Many of the sculptures feature characterizations of animals. One such example of this is the Cat, Fernando Botero.\nWe walked by this sculpture several times, as we made our way up and down Las Ramblas. On each occasion, we paused momentarily to admire this amusing, giant black cat.\nIf you happen to be in Las Ramblas, keep a lookout for Fernando. He is sure to bring a smile to your face!", "publishedDate": "2015-10-08", "language": "en", "rating": 4}, {"id": 314186023, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d7132622-r314186023-Cat_Fernando_Botero-Barcelona_Catalonia.html", "text": "I've heard its not his first location. but he is so fatty and nice) find him on your walk in the city)", "publishedDate": "2015-09-27", "language": "en", "rating": 5}, {"id": 304681132, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d7132622-r304681132-Cat_Fernando_Botero-Barcelona_Catalonia.html", "text": "We were very surprised to stumble across this huge statue in the middle of a square in a not very touristy area. It's definitely this kind of \"detail\" that adds some more character to the area and brings a smile onto your face.\n\nI rated it as \"excellent\" not only because of the sculpture itself, but also because of the surroundings. The cat is situated in El Raval, a district west of La Rambla, much less crowded, full of immigrants who preserve their heritage, which mixes nicely with the typical local features. Worth exploring.", "publishedDate": "2015-08-29", "language": "en", "rating": 5}, {"id": 291457703, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d7132622-r291457703-Cat_Fernando_Botero-Barcelona_Catalonia.html", "text": "I love cats so I loved this statue! It was much bigger than I expected and got some cool photos with it. Worth a look for sure if you like cats", "publishedDate": "2015-07-22", "language": "en", "rating": 5}, {"id": 290067593, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d7132622-r290067593-Cat_Fernando_Botero-Barcelona_Catalonia.html", "text": "There are a lot of Botero sculpture in different cities around the world. If a city can get one, they are very happy. This sculputure was wandering around Barcelona in different places, until they found this final place for it - Rambla del Raval.", "publishedDate": "2015-07-18", "language": "en", "rating": 5}, {"id": 286696137, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d7132622-r286696137-Cat_Fernando_Botero-Barcelona_Catalonia.html", "text": "statue is situated in a very interesting area, off the beaten path.  there were a few winos around the square, where this is situated but didn't cause us any concern.  what was very annoying however, is that my camera battery had run out, so the excellent photo opp this statue provides, could not be achieved.", "publishedDate": "2015-07-08", "language": "en", "rating": 4}, {"id": 262118171, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d7132622-r262118171-Cat_Fernando_Botero-Barcelona_Catalonia.html", "text": "Ramlas De Raval is location our favorite statue, cute cat statue Gato Botero, Do not miss it. Nice area where you can enjoy tapas or some other food with beer Estrella", "publishedDate": "2015-03-27", "language": "en", "rating": 5}, {"id": 237680281, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d7132622-r237680281-Cat_Fernando_Botero-Barcelona_Catalonia.html", "text": "If you are feeling down in the dunps in Barcelona, and are all Gaudi'd out, go and see this wonderful wacky sculpture by Botero. I guarantee it will bring a smile to your face....:-)", "publishedDate": "2014-11-02", "language": "en", "rating": 5}]}}]