[{"locationId": 7694897, "name": "Placa del Rei", "placeType": "ATTRACTION", "reviewListPage": {"reviews": [{"id": 589117659, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d7694897-r589117659-Placa_del_Rei-Barcelona_Catalonia.html", "text": "Catalan medieval splendour shines out today in the Placa del Rei,one of the best enclaves of the Gothic Quarter.It is overlooked by the Palau Reial Major,with its Renaissance flight of steps and the Salo del Tinell,the Palau del Lloctinent and the sober royal chapel of Santa Anna.The square is closed by Casa Padellas,a Gothic palace from the late 15th century,moved,in 1931,stone by stone from Carrer de los Mercaders due to the opening up of Via Laietana.This palace is the main centre of the Museum of History of Barcelona.\nThe tour around the museum is completed with the two main architectural landmarks of the Palau Reial Major,the official residence of the counts of Barcelona and later the monarchs of the Crown of Aragon:the Salo del Tinell and the Capel of Santa Agata.", "publishedDate": "2018-06-20", "language": "en", "rating": 5}, {"id": 587885578, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d7694897-r587885578-Placa_del_Rei-Barcelona_Catalonia.html", "text": "Went to music concert at  this historic sight on pau Casals day. Th concert was a wonderful one with various groups of students playing Casals music c.  The site was next to the cathedral in the shadow of the cathedral ", "publishedDate": "2018-06-16", "language": "en", "rating": 5}, {"id": 587754307, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d7694897-r587754307-Placa_del_Rei-Barcelona_Catalonia.html", "text": "Placa del Rei located inside Gothic Quarter has historical significance upon Colombus successful return from North America.  The medieval structures around the square are more impressive at night time with the illumination being lid up.", "publishedDate": "2018-06-15", "language": "en", "rating": 4}, {"id": 587302672, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d7694897-r587302672-Placa_del_Rei-Barcelona_Catalonia.html", "text": "These buildings are very beautiful at night with the moonlight shining down on them and the glow of the street lights. We went for a walk through the Gothic Quarter one evening and came upon them. They are very old historic buildings and make good pictures! This area is really filled with many different restaurants and bars nearby. ", "publishedDate": "2018-06-13", "language": "en", "rating": 4}, {"id": 578977574, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d7694897-r578977574-Placa_del_Rei-Barcelona_Catalonia.html", "text": "The King's Square is located in the Gothic Quarter and is Placa del Rei is surrounded by historical medieval buildings. The square is associated with Christopher Columbus who is thought to have been received here by King Ferdinand and Queen Isabella on his return from the New World.The placa is not anything special to look at but you will see it if you plan to visit the History museum as the entrance is from here.Within the museum you can see the remains of Roman Era Barcelona which were uncovered during the relocation of the palace.Do visit.", "publishedDate": "2018-05-09", "language": "en", "rating": 3}, {"id": 572929497, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d7694897-r572929497-Placa_del_Rei-Barcelona_Catalonia.html", "text": "Take a guide to the significance of these steps. These are the steps Colombus returned after discovering North America and was greeted by the king. He stayed some time in this castle.", "publishedDate": "2018-04-12", "language": "en", "rating": 4}, {"id": 572455527, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d7694897-r572455527-Placa_del_Rei-Barcelona_Catalonia.html", "text": "We tripped upon this square and needed a rest. We sat down for a drink and tapas. Little did we know the history that came with where we were sitting. This is the Palace where Columbus was commissioned by the King  to find the Americas and where he returned. I could go on and on. I wish we had time to visit the museum, but you have to leave some things  for the next trip. I wish I could remember  the name of the cafe. If somebody knows could you please tell me? I have been trying to look it up.", "publishedDate": "2018-04-10", "language": "en", "rating": 5}, {"id": 564683888, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d7694897-r564683888-Placa_del_Rei-Barcelona_Catalonia.html", "text": "Placa del Rei (place of the king) is part of of Barrio Gotico and always worth a visit. You will see a beautifull Gothic Neighborhood already on your way to the placa. And the place itself is surrounded by lots of history besides its own.", "publishedDate": "2018-03-05", "language": "en", "rating": 4}, {"id": 550352585, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d7694897-r550352585-Placa_del_Rei-Barcelona_Catalonia.html", "text": "This is the underbelly of old-time Barcelona,  The ruins and remains of Iberian and Roman life in the center of town.  Well done with interesting features documented and an insight into life here 2000 years ago.  I enjoyed the laundry and cloth dye facilities pus the old wine making area.", "publishedDate": "2017-12-30", "language": "en", "rating": 4}, {"id": 549285652, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d7694897-r549285652-Placa_del_Rei-Barcelona_Catalonia.html", "text": "A small square that we saw after exiting MUHBA. A few cafes around, but otherwise by itself I did not find anything particularly noteworthy. However, it is one of the many places that contribute to making the entire Barri Gotic quaint and historic.", "publishedDate": "2017-12-26", "language": "en", "rating": 3}, {"id": 548642565, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d7694897-r548642565-Placa_del_Rei-Barcelona_Catalonia.html", "text": "lovely square surrounded by bars and restaurants, you can seat in the border of the fountain and there are also some nightclubs on it. it's a nice place to pass by.", "publishedDate": "2017-12-22", "language": "en", "rating": 5}, {"id": 532843460, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d7694897-r532843460-Placa_del_Rei-Barcelona_Catalonia.html", "text": "This the Barcelona Natural History Museum.  Enjoy a cervessa, tapa or a mojito at this quaint plaza.  A very relaxing spot for a drink with friends.  ", "publishedDate": "2017-10-14", "language": "en", "rating": 4}, {"id": 532052565, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d7694897-r532052565-Placa_del_Rei-Barcelona_Catalonia.html", "text": "Placa del Rei located at Barri Gotic and perhaps it is the best place in town go get you a feel for Barcelona's faint connection to Old World royalty, this \"Square of the Monarch\" offers a good view of The Royal Palace, where both Spanish Kings and Catalan counts one resided. While the palace complex is mostly closed to tourists, parts of the building are used for exhibits for Barcelona History Museum. So if you are looking for this museum it is right there on Placa del Rei.", "publishedDate": "2017-10-11", "language": "en", "rating": 4}, {"id": 522740965, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d7694897-r522740965-Placa_del_Rei-Barcelona_Catalonia.html", "text": "During our most recent visit to Barcelona, we took another long walk through the Gothic Quarter of the city. Eventually, we found ourselves once again in the Place del Rei. This small  square has the Palau Reial Major (Royal palace) as a backdrop and the Watchtower of King Marti situated along one side of it. \nThese structures radiate a real sense of history and tradition for those visiting the square.\nThere is a cafe with an outdoor dining area located in the square, providing for those in need of something to eat or drink. \nWe did not stay for long as it was a hot day and we still had lots to see.\nThis small square is worthy of a visit by any tourist with an interest in medieval history!", "publishedDate": "2017-09-08", "language": "en", "rating": 4}, {"id": 520279200, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d7694897-r520279200-Placa_del_Rei-Barcelona_Catalonia.html", "text": "A gorgeous medieval place, small but very peaceful . The terrasse/ bar is very good, excellent mojito and very kind and charming service. Will come back. Really charming. ", "publishedDate": "2017-09-01", "language": "en", "rating": 5}, {"id": 488666873, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d7694897-r488666873-Placa_del_Rei-Barcelona_Catalonia.html", "text": "Couple, 50+. One of the few living group dances (street dancing), a symbol of Catalanness. Open to anyone that wants to join in and knows the basic two steps that make up the dance. Accompanied by a 'cobla' (11 musicians), the riungs of dancers give an impression of how entertainment may have looked in days gone by. Stand and watch, listen to the music and soak up the atmosphere. All in all a pleasant way to spend an hour.", "publishedDate": "2017-05-29", "language": "en", "rating": 3}, {"id": 488213630, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d7694897-r488213630-Placa_del_Rei-Barcelona_Catalonia.html", "text": "Very interesting walk through the Roman era of Barcelona. Note that you take the lift down in to the actual archaeological site and there is no need to purhase tickets online.", "publishedDate": "2017-05-27", "language": "en", "rating": 4}, {"id": 488065739, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d7694897-r488065739-Placa_del_Rei-Barcelona_Catalonia.html", "text": "Lots of people hanging out, surrounded by the small alleyways of the Old Town. Seemed popular with students. There were quite a few souvenir shops on the 2 streets leading to the square. I don't think I would hang out there.", "publishedDate": "2017-05-26", "language": "en", "rating": 3}, {"id": 479777380, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d7694897-r479777380-Placa_del_Rei-Barcelona_Catalonia.html", "text": "Found by coincidence, this place definitely should be included in guides (maybe it is?) - a small place surrounded by walls of medieval buildings, with a really nice atmosphere. You definitely should check it out!", "publishedDate": "2017-04-28", "language": "en", "rating": 5}, {"id": 475435924, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d7694897-r475435924-Placa_del_Rei-Barcelona_Catalonia.html", "text": "In summer the days are longer and the square is full of life, take a short stop on your visit to la Rambla ask for a nice and cold caña and observe your surroundings.", "publishedDate": "2017-04-13", "language": "en", "rating": 5}, {"id": 463564936, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d7694897-r463564936-Placa_del_Rei-Barcelona_Catalonia.html", "text": "I was there in the morning and evening too.very specific place in the old quarter of the Barcelona. many restaurants in side", "publishedDate": "2017-02-28", "language": "en", "rating": 5}, {"id": 450565610, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d7694897-r450565610-Placa_del_Rei-Barcelona_Catalonia.html", "text": "Pretty non-descript partially-closed plaza behind the Cathedral. I walked past it several times, stopped for a brief look, and then moved on. I never realized its historical significance. But when I leafed through the guide book I read that this is generally accepted to be the location where Isabella and Ferdinand greeted Columbus's procession upon his return from the Caribbean in 1493. So for history buffs seeking connections, this is a must see. I must assume that the plaza layout and construction was  dramatically different some 500 years ago. There's only one tavern that services the plot.", "publishedDate": "2017-01-08", "language": "en", "rating": 4}, {"id": 449811205, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d7694897-r449811205-Placa_del_Rei-Barcelona_Catalonia.html", "text": "My wife, two children and I visited Barcelona in December 2016 and January 2017.  I went to the Placa del Rei.  It is not far from the Barcelona Cathedral but I recommend that you look on a map to find it.  This small square has buildings with Roman architecture.  The Barcelona History Museum is next to the plaza.  Unfortunately it was closed so I did not get to see it.  There is also the Calle Libreteria nearby which has a lot of shops and food places and a nice bookstore.", "publishedDate": "2017-01-06", "language": "en", "rating": 4}, {"id": 440707833, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d7694897-r440707833-Placa_del_Rei-Barcelona_Catalonia.html", "text": "A quiet square at the exit to the wonderful underground history museum. It is peaceful-look up and you will see remains of the Roman walls. You will have a chance to see a piece of very old Barcelona without being crowded out with shops etc", "publishedDate": "2016-11-28", "language": "en", "rating": 4}, {"id": 434958958, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d7694897-r434958958-Placa_del_Rei-Barcelona_Catalonia.html", "text": "Unusual in the sense that it is neither grand nor populated, Placa del Rei is one for history buffs....I found this quaint corner rather interesting during a morning walk through the old town!!", "publishedDate": "2016-11-05", "language": "en", "rating": 4}, {"id": 432509249, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d7694897-r432509249-Placa_del_Rei-Barcelona_Catalonia.html", "text": "Excellent site.  My wife spotted it in a tour book and since I love history, it was a natural.  Not only describes the history of Roman and early Christian times in Barcelona, but goes underground to show you Roman ruins from the earliest settlement.  Cost was €7.00.  I would give it 5 stars except the vast majority of signs and information were only in Castilian or Catalan.  Given the very large number of English, Germans, Japanese, etc, it would be better if they added other language support.", "publishedDate": "2016-10-28", "language": "en", "rating": 4}, {"id": 430964031, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d7694897-r430964031-Placa_del_Rei-Barcelona_Catalonia.html", "text": "This small stark square is about history and architecture, not cafes and shops. The Roman Wall, MHUBA, and other ancient structures can be viewed without tourist and vendor distraction. Take a second and envision, the people, the costumes, the customs of many different ages gone by. You'll not find a better stimulus.", "publishedDate": "2016-10-23", "language": "en", "rating": 5}, {"id": 429887234, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d7694897-r429887234-Placa_del_Rei-Barcelona_Catalonia.html", "text": "This square is where you exit leaving the MUHBA roman ruins and it's quite pretty and unusual from the ancient architecture.\n\nDo look for information about the ancient roman wall around the gothic center of barcelona and make an effort to check out the ruins. They are free, have informative descriptions about them, in english.", "publishedDate": "2016-10-19", "language": "en", "rating": 5}, {"id": 427821940, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d7694897-r427821940-Placa_del_Rei-Barcelona_Catalonia.html", "text": "Nothing really interesting here...just a not very square,empty,surrounded by old high stone walls.There's no reason to go there if it isn't in your way.", "publishedDate": "2016-10-14", "language": "en", "rating": 3}, {"id": 422965547, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d7694897-r422965547-Placa_del_Rei-Barcelona_Catalonia.html", "text": "This plaza is bordered by a number of historic buildings that were once part of the residence of the Counts of Barcelona. It was originally built as a Romanesque fortress, leaning against the Roman Walls. The palace was later expanded with Gothic additions.\n\nNearby, on the same plaza, is the Royal Chapel of St Agatha with a unique octagonal bell tower and shaped like a crown.  This tower is also known as \"king's chapel.\"\n\nIt's free to visit the plaza, not sure about the chapel.", "publishedDate": "2016-09-27", "language": "en", "rating": 3}, {"id": 409652067, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d7694897-r409652067-Placa_del_Rei-Barcelona_Catalonia.html", "text": "Between the Cathedral and Via Laietana,every building in this square is steeped in history. The gorgeous Salon del Tinell not only is of architectural interest but was the scene of one of the crucial debates between Judaism and Christianity. The museum of the history of Barcelona, at one end of the square, is a must! The Palau Reial is also beautiful. Particularly interesting and fun to spot are some of the stones used for its construction, which were brought from the Jewish Cemetery on Montjuic and still display inscriptions in Hebrew.", "publishedDate": "2016-08-23", "language": "en", "rating": 5}, {"id": 396071757, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d7694897-r396071757-Placa_del_Rei-Barcelona_Catalonia.html", "text": "Placa del Rei is located in Barri Gotic \"behind\" the Cathedral.\nIt is a little square surrounded by high old buildings.\nPlaca del Rei is interesting for historic and architecht lovers.\nBut it isn't interesting as a restplace.\n", "publishedDate": "2016-07-23", "language": "en", "rating": 3}, {"id": 377073108, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d7694897-r377073108-Placa_del_Rei-Barcelona_Catalonia.html", "text": "This small square is composed of bare stone, gothic architecture with no markets, no restaurants or pubs, which makes for an austere small plaza that's unfriendly to visitors and fairly grim to behold. It is on the other hand architecturally impressive and the preserved gothic buildings are quite striking in their severity. As with a lot of places in Barcelona this square was \"helped\" to look more gothic as one of the buildings (Casa Padellàs) was moved here from another part of town in the 1930's.", "publishedDate": "2016-05-27", "language": "en", "rating": 4}, {"id": 364789867, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d7694897-r364789867-Placa_del_Rei-Barcelona_Catalonia.html", "text": "Sitting on this very steps on Placa del Rei, surrounded by Barcelona's royal palace, Palau Reial Major, I imagined myself part of the crowd that listen to Christopher Columbus' discovery of the New World as he relates his tale to the King and Queen. It might just be folklore but didn't stop me from still pretending that it's true.\n\nDuring the Middle Ages, the Palau Reial Major is home to the kings and counts, who ruled Barcelona. The buildings here are great examples of the different civilisations that has made their mark in this city. Just notice how the Romanesque buildings are transformed with Gothic architecture on top of original structures.", "publishedDate": "2016-04-17", "language": "en", "rating": 4}, {"id": 362517938, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d7694897-r362517938-Placa_del_Rei-Barcelona_Catalonia.html", "text": "Good place to visit if you're into medieval architecture and history. Very near to the city Cathedral and integral part of the old city.", "publishedDate": "2016-04-08", "language": "en", "rating": 4}, {"id": 340985755, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d7694897-r340985755-Placa_del_Rei-Barcelona_Catalonia.html", "text": "This intimate, peaceful and atmospheric square fully represents the city’s splendor in the medieval times. The Palau Reial Major was the residence of the Catalan counts from the 13th to the 15th century and the Casa Padellas, which is a home of a The Museum of the History of Barcelona, is a 16th century palace, carefully moved, stone by stone, from Mercaders street. A brilliant square!", "publishedDate": "2016-01-18", "language": "en", "rating": 5}, {"id": 326331396, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d7694897-r326331396-Placa_del_Rei-Barcelona_Catalonia.html", "text": "Placa del Rei is a lovely square in the Gothic quarter. Lovely architecture. Cafe situated here. Well worth a visit.", "publishedDate": "2015-11-12", "language": "en", "rating": 5}, {"id": 304433440, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d7694897-r304433440-Placa_del_Rei-Barcelona_Catalonia.html", "text": "Historic square with good cafe/bar.Lovely architecture. Worth finding to take a rest and enjoy the ambiance.", "publishedDate": "2015-08-28", "language": "en", "rating": 5}, {"id": 292790188, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d7694897-r292790188-Placa_del_Rei-Barcelona_Catalonia.html", "text": "We stumbled on this courtyard by accident as we had just come from Basilica of Santa Maria del Mar.  A quiet place, we didn't go in but did go through a building that was just off this place which was rather nice.  Barcelona is a beautiful city to get lost in!", "publishedDate": "2015-07-26", "language": "en", "rating": 4}, {"id": 290680970, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d7694897-r290680970-Placa_del_Rei-Barcelona_Catalonia.html", "text": "Under the city there are ruins.I love seeing ruins so for me it was worth walking underground and seeing how a population lived thousands of years ago.There is a audio tour as well as part of the admission fee. they also give discounts to other museums in the city", "publishedDate": "2015-07-20", "language": "en", "rating": 5}, {"id": 289010575, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d7694897-r289010575-Placa_del_Rei-Barcelona_Catalonia.html", "text": "Barcelona has so many great squares but only one is the plaza of the king, literally. It is hard to imagine this is the site of Ferdinand and Isabella when Columbus returned from the New World. The church and the palace are great but that sense of history make this an incredible square you have to visit. Day or night no Gothic Quarter visit is complete with walking to this square.", "publishedDate": "2015-07-14", "language": "en", "rating": 4}, {"id": 284189668, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d7694897-r284189668-Placa_del_Rei-Barcelona_Catalonia.html", "text": "if you can manage to navigate to Placa Del Rei, it's a quaint square with a fountain and falling yellow petals from the large tree in the square. Apparently used in the movie Vicky Cristina Barcelona, it's not as touristy as a lot of the other places in the Gothic quarter in Summer. Good for contemplation and taking a break before moving on to the next tourist attraction! Barcelona's highest star-rated hotel also resides here.", "publishedDate": "2015-06-30", "language": "en", "rating": 5}, {"id": 279295059, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d7694897-r279295059-Placa_del_Rei-Barcelona_Catalonia.html", "text": "Supernice square by night in Barri Gottic. Visit and have a drink on the terrace on of the two bars or go on top of the bar on the side, you enjoy the view there.", "publishedDate": "2015-06-10", "language": "en", "rating": 4}, {"id": 278251301, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d7694897-r278251301-Placa_del_Rei-Barcelona_Catalonia.html", "text": "Wow, I've never seen a Gothic square quite like this. You feel as if you've entered a portal to a medieval time period. There is so much to see. The most prominent feature is the watchtower of King Martí, which towers over the square. It's the first structure that you notice as you're walking towards Placa del Rei. There's the old Roman wall that is at the base of the Royal Chapel. You will also see the Royal Palace, the house of Clariana-Padellàs, and the Lieutenant's Palace. The latter one has a beautiful courtyard in the Renaissance style that is lined with grapevines (one of which is over 100 years old). Don't miss seeing Subirachs' bronze door of Sant Jordi on the stairway. I totally missed taking a picture of it, and I regret it already. The square is just full of history. There's even a museum that houses the Roman history of Barcelona. We didn't have enough time to see it, but it's very similar to the El Born Cultural Center. \n\nThe steps seem to be very popular as well. It's a great place to sit down and enjoy the scenery. It's a comfortable area, and the surrounding buildings provide shade from the sun. Don't miss seeing this part of the Gothic quarter.", "publishedDate": "2015-06-06", "language": "en", "rating": 5}, {"id": 274707601, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d7694897-r274707601-Placa_del_Rei-Barcelona_Catalonia.html", "text": "The Placa is an ordinarily magnificent square in old Barcelona.  The cathedral nearby is not to be missed.  The Palau Rejal Major, which feels like an ambassador's residence, probably IS missed by the vast majority of visitors.  Step inside and look directly up: you'll see one of the most magnificent wooden carved ceilings ever built.  Simply outstanding.  You might not make a separate expedition just to see the Placa del Rei, but if you're in the area, don't miss it.", "publishedDate": "2015-05-26", "language": "en", "rating": 5}, {"id": 274431596, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d7694897-r274431596-Placa_del_Rei-Barcelona_Catalonia.html", "text": "This enchanting, small place is located aside the cathedral. It's relatively quiet: on the right, the Palau Rejal Major, that hosts the Museu of Historia de la Ciudad; on the left, the Palace of King's Liutenant (you can enter its inner court and take a look, very nice; walking across it you'll arrive to the left side of the Cathedral of Barcelona).", "publishedDate": "2015-05-25", "language": "en", "rating": 5}, {"id": 259391170, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d7694897-r259391170-Placa_del_Rei-Barcelona_Catalonia.html", "text": "The Placa del Rei is a small square not far from the Placa Reial in Barcelona's Barri Gotic. It is home to the largest MUHBA center and has wonderful Gothic architecture. Recommended!", "publishedDate": "2015-03-14", "language": "en", "rating": 4}]}}]