[{"locationId": 10020538, "name": "Barcelona Beach Festival", "placeType": "ATTRACTION", "reviewListPage": {"reviews": [{"id": 694215763, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d10020538-r694215763-Barcelona_Beach_Festival-Barcelona_Catalonia.html", "text": "Loved the dj’s which I came for. \nI have visited a lot of festivals (outside of Spain) and this was on my list because of the line up and location on the beach. \n\nHowever, I was shocked by the poor logistics around the festival: \nEntering the festival was a real challenge. You don’t want to mind waiting. Hundreds of people (maybe thousandso) need to show their ticket to just 1 or 2 hosts that will manually check your ticket. Then security, same limited number of staff and then the bonus: 1 man scanning your ticket and 1 man providing you a bracelet and then try to scan it a couple of times. Imagine 100.000 visitors in this inefficient process. \n\nWaiting for drinks is ok. Not sure if this is because of the high prices. \nWaiting for food however is a nightmare. Apart of the medium quality there is only 3 caravans with hotdogs and tortilla chips open. Again for 100.000 people. \nDidn’t the organizers travel to festivals like in the Netherlands or Belgium to see how you do catering...? Might be a good advice. \n\nYou pay an extra 2€ per glass deposit. After 3am there is only one booth open for refund. When you see more than 100 people standing in this line, you skip this and lose your refund. What a cash cow for them. \n\nAgain, great line up but poor organization. ", "publishedDate": "2019-07-30", "language": "en", "rating": 3}, {"id": 690207897, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d10020538-r690207897-Barcelona_Beach_Festival-Barcelona_Catalonia.html", "text": "Good all round vibe from an International crowd.\nI did not witness any trouble, despite some of the reviews I read on TA from previous years events.\nSound quality very good by stage, but could do with more speakers further back for a more overall venue sound.\n\nTIP: Do not wear anything white, if going to 2020 event due to the sand and dust in the air!!! ", "publishedDate": "2019-07-16", "language": "en", "rating": 4}, {"id": 690172172, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d10020538-r690172172-Barcelona_Beach_Festival-Barcelona_Catalonia.html", "text": "This is our first time on BBF.\n\nLine up is great and venue is good organised. \n\nDrinks are so so expensive and you need to top up your wristbands if you wanna take a drink.\n\nMix is 11€ and beer €8 but on the price list was 9€ and €6 but we were told is extra €2 for the plastic cup that we were keep reusing.\nWater is €2.50.\n\nOn the end we had €1.50 and €1 left on each wristband and apparently you can not get refund if is less than €4. \n\nCan you imagine festival with 120 000 visitors and everyone has €1 left that’s a making additional money.\n\nDrugs everywhere if you wanna buy and everyone was smoking weed and offering for sale. \n\nThank you Barcelona.", "publishedDate": "2019-07-16", "language": "en", "rating": 3}, {"id": 603558082, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d10020538-r603558082-Barcelona_Beach_Festival-Barcelona_Catalonia.html", "text": "I enjoy going to festivals so in the year that I lived in Barcelona I could not miss this one. It was deffinetely worth it. It is on the beach, so be careful what shoes you wear. When it comes to clothing just be comfortable, you can even bring your bikini for a swim. Great line up, good food, decent prices for drinks. ", "publishedDate": "2018-08-06", "language": "en", "rating": 5}, {"id": 596989739, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d10020538-r596989739-Barcelona_Beach_Festival-Barcelona_Catalonia.html", "text": "The accommodation needs to be booked in advance if you are going to the festival.\nI've enjoyed this festival a lot (2018). The line up was amazing all the best DJ-s Armin, David Guetta, Robin Shultz, the Chainsmokers, Don Diablo, Axwell and many others. No selfiesticks allowed and many other things. Definitely get money topped up online, prior the festival to avoid the crowds. I went from 7 pm -7 am and had 100 euros on my account, shared some of the money with my friend. Had loads of water, around 5/6 run & cock and we ate twice too and I had 33.50 euros left.The atmosphere was amazing and we had a lot of fun. The downside that in the middle of the night in the main bar there was a massive queue of 100 people or more and only 3/4 staff members were serving. We waited 40 minutes and then went to another bar where got served pretty quickly, so they should have more staff next year. The festival is on the beach so it's full of dust in the air, your head and face, as everyone is dancing on the sand. I haven't seen any fights or drugs around, not even drugged people. I guess i just enjoyed the music so much that didn't have time to look around:). Going next year again for sure!!!", "publishedDate": "2018-07-17", "language": "en", "rating": 4}, {"id": 594794604, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d10020538-r594794604-Barcelona_Beach_Festival-Barcelona_Catalonia.html", "text": "120,000 people on the beach was amazing to see. Music playing everywhere, awesome atmosphere.\nBad points - drugs and fights all over the place - Bar prices really high but can buy cheap beer off locals on beach - toilets....well you can imagine - pick pockets, 2 of our party were robbed from their pockets without knowing - taxi's - non existent when you want to go home.\nIt was a great experience - not sure if I'd do again though", "publishedDate": "2018-07-10", "language": "en", "rating": 3}, {"id": 592722663, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d10020538-r592722663-Barcelona_Beach_Festival-Barcelona_Catalonia.html", "text": "Hey Guys,\n\nLast minute let down from a friend means I’ll be coming to the party solo. Anyone looking for a festival buddy? Interests are dancing & drinking.\n\nCheers\nAlexandra", "publishedDate": "2018-07-03", "language": "en", "rating": 3}, {"id": 504363986, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d10020538-r504363986-Barcelona_Beach_Festival-Barcelona_Catalonia.html", "text": "We had a small reunion with some of our Australian friends who were doing a Euro tour and this was our first time visiting BBF. It was one of the best nights We have ever had and we will definitely be returning. The only downside was the lack of organisation at the main front gate. I would highly recommend you try this festival out, especially if you love EDM. Salud!", "publishedDate": "2017-07-21", "language": "en", "rating": 5}]}}]