[{"locationId": 9997409, "name": "Fuente de Carmen Amaya", "placeType": "ATTRACTION", "reviewListPage": {"reviews": [{"id": 689993999, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d9997409-r689993999-Fuente_de_Carmen_Amaya-Barcelona_Catalonia.html", "text": "This fountain can be found in the Somorrostro beach area and I only happen to come across this while enjoying the beach.\n\nThe fountain is named in honour of Carmen Amaya, a Spanish flamenco dancer and singer, who was born in this area. I can't pretend to know much about this art form, but I read that she was described as \"the greatest Spanish Romani dancer of her generation\".\n\nGiven such high praise, this fountain is a sad reflection of her career. The fountain is fairly simple, with relief sculpture of figure during a dance routine featuring three dancers and two guitarists. Apart from her name cut into a nearby metal board, it's nondescript, not even something to describe her life and career.\n\nIt's okay, but don't go out of the way to see it.", "publishedDate": "2019-07-16", "language": "en", "rating": 3}, {"id": 677027545, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d9997409-r677027545-Fuente_de_Carmen_Amaya-Barcelona_Catalonia.html", "text": "Barcelona has a plethora of fountains. Many are stunningly beautiful. This is not one of them. The area around the fountain is not really one of the most desirable. The are a couple of shops around, but you would definitely not want to go out of your way to get there. Give it a miss.", "publishedDate": "2019-05-28", "language": "en", "rating": 3}, {"id": 584352630, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d9997409-r584352630-Fuente_de_Carmen_Amaya-Barcelona_Catalonia.html", "text": "The Fuente de Carmen  Amaya is not really a great reflection of this famous flamenco dancer who grew up in the streets around this area of Barcelona. Carmen would not be pleased.", "publishedDate": "2018-06-01", "language": "en", "rating": 3}, {"id": 515436114, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d9997409-r515436114-Fuente_de_Carmen_Amaya-Barcelona_Catalonia.html", "text": "If you go to Barcelonetta, the last thing you want to see is this. It is dirty and some people were sleeping near it. ", "publishedDate": "2017-08-20", "language": "en", "rating": 3}]}}]