[{"locationId": 3270333, "name": "Sopars Amb Estrelles", "placeType": "ATTRACTION", "reviewListPage": {"reviews": [{"id": 724814600, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d3270333-r724814600-Sopars_Amb_Estrelles-Barcelona_Catalonia.html", "text": "Advertised as open so we travelled up there to arrive at 9pm. We were turned away at the gate and told they were closed. Wasted taxi money and time. Very disappointed.", "publishedDate": "2019-11-07", "language": "en", "rating": 1}, {"id": 718528261, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d3270333-r718528261-Sopars_Amb_Estrelles-Barcelona_Catalonia.html", "text": "My husband and I were looking forward to our evening at the Observatory. We had experienced rain during the day and were concerned about the weather affecting our evening at the Observatory. We made a call to ensure that the evening would go ahead and was assured all was good to go. The rain had ceased by late afternoon.\nWe arrived in the evening (approx 7.30pm) and were welcomed with a glass of champagne. As we approached the terrace of the Observatory I noticed none of the tables were set for dinner. The dinner was sold to us as an 'outdoor dinner event'. This was disappointing, but we decided to focus on what the rest of the evening had to offer. \nWe enjoyed pre-dinner drinks and views of Barcelona before we made our way indoors. The tables were set inside the observatory surrounded by displays filled with equipment and small 'telescopes'. This was interesting!! \nThe wine was offered and my husband made his selection, however, when I asked for another glass of champagne as I don't drink wine, that was declined. Our entre was served. When it came to the table it was presented beautifully. I wanted to like it, however, the texture and flavour were not appetising. It was a fish/seafood mousse cannelloni. Both my husband and I could not get through it. I would call my husband a fussy eater, however, I am not. The mousse was not palatable. Then the main meal arrived. It was what I would call a 'pot roast' style meat dish covered in gravy. My husband had two bites, I pushed myself to eat half the dish. A very ordinary dish. I would call it a 'mid-week' family dinner at best! Very soon after, the dessert was served, and luckily for us it was something we didn't mind. A cheesecake slice. It was the only course we finished (we were hungry!!!).\nOnce dinner was over, we were given a guided tour of the observatory. Our guide was a lovely young man, who was a student by day and a waiter and guide in the evening. He did a great job of sharing his knowledge. We looked at the night sky through a telescope built-in 1904, however, due to the overcast sky, no stars were present. This is not a cheap evening. The food served was very ordinary. The promised 'sunset dinner overlooking Barcelona' was not delivered. And we did NOT get any rain throughout the evening.\nIf you are considering booking this evening, look at the weather forecast several days beforehand and I would suggest you consider the more expensive meal option. I don't know if that would be better, however, I do know to advise you not to waste your money on the cheaper meal option!\nOverall, both my husband and I were disappointed with our evening at the Fabra Observatory.", "publishedDate": "2019-10-15", "language": "en", "rating": 2}, {"id": 717740097, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d3270333-r717740097-Sopars_Amb_Estrelles-Barcelona_Catalonia.html", "text": "In a city surrounded in beautiful panoramic views, this is another one. It is, though, next to a little bit of local scientific history. It isn't a museum you'd go out of your way to visit, but consider stopping by if you're in the area.", "publishedDate": "2019-10-12", "language": "en", "rating": 4}, {"id": 704740326, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d3270333-r704740326-Sopars_Amb_Estrelles-Barcelona_Catalonia.html", "text": "It is a really nice place and definitely you'll have an amazing panoramic view of Barcelona. The menus are pretty good for the price you pay and you'll have a different visit if you speak English so the conferences are in catalan/spanish. Although, it is quite far away from the city. Book a taxi to go and come back if you do not have a car or let the staff know that you need one, so they'll book it for you.\nIn conclusion, if you are visiting Barcelona book this in advance and enjoy one of the most beautiful panoramic visits from Barcelona and discover the observatory while you're enjoying an amazing dinner.\n\nThe only two things I would recommend to improve would be:\n\n- the starters for the vegetarian menu. It is just one tiny piece of watermelon, nothing spectacular and quite disappointing. The rest of the menu is great.\n\n- Ask the clients if they would require a taxi afterwards so they can call them to be there after the observatory visit avoiding the clients to be waiting for 20 minutes or more for taxis.\n\nClara\n\n", "publishedDate": "2019-08-30", "language": "en", "rating": 4}, {"id": 615932791, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d3270333-r615932791-Sopars_Amb_Estrelles-Barcelona_Catalonia.html", "text": "All drinks from arrival and throughout the meal were included which we did not expect.\nThe view from the tables (which are outdoor) was beautiful and it was lovely to see the sun go down as we ate.\n\nAny issues we had the staff were on hand to help and they catered to our dietary requirements that we had informed them off beforehand.\nFood was of better quality than expected and very filling.\nOnce the sun was down and the evening started to cool, blankets were also provided which was a nice touch.\n\nTwo tours were provided, one in English and one in Spanish, and the opportunity to look through the telescope was not something we expected and an experience we will not forget.\n\nWould say to be aware this did appear to be more of a locals activity than tourist, however this should not cause any issues.\nThe staff also organised a taxi for our return back to the centre.", "publishedDate": "2018-09-12", "language": "en", "rating": 5}, {"id": 588169018, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d3270333-r588169018-Sopars_Amb_Estrelles-Barcelona_Catalonia.html", "text": "I have just finished this visit.  I'm unfortunate to have taken this tour with a group of locals,  as it was mostly conducted in Catalan. I was asked when I came in if I understood Spanish, and I said yes (probably not everything,  but I could get by). And yet the introduction was conducted in Catalan by the same woman who asked. During the tour, the guide (another one) asked if everybody spoke Catalan, and I said no. I was at the back so he probably didn't hear me. But some of the locals did, and they paid no mind.  Later on,  the same guide talked to me in Catalan and I responded in English \"I'm sorry, I don't understand\". He didn't respond and just walked onward. I find that rude when I've paid like everybody else.\n\nIt's true that the views are amazing, but you can get the same view having a much better dinner in Gran Hotel La Florida (14min away on foot). The food is so so, and they forgot to serve my husband his dinner (we saw everybody else was finished with theirs and then we had to ask 3 times).\n\nAnd I looked a total of 5 seconds through the telescope built in 1904, and saw the equivalent of a normal full moon and 3 stars (supposedly Jupiter and its 3 moons).", "publishedDate": "2018-06-17", "language": "en", "rating": 2}, {"id": 518638597, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d3270333-r518638597-Sopars_Amb_Estrelles-Barcelona_Catalonia.html", "text": "If you have any interest in astronomy, science in general & history, it's a very special place. \nYou have an excellent meal- vegetarian in our case- with spectacular views over BCN as the sun sets, followed by a short talk (in Spanish) on an astronomical topic. \nthen you have a guided tour of the observatory & small museum (in Catalan, but they happily change to Spanish if you don't understand). If it's not cloudy (ie most days) you actually get a chance to look through the observatory's main instrument- a piece of history.\nEveryone involved in the project (from the waiting staff to the astronomer to the 'tour' guide) are extremely enthusiastic & professional- happy to answer any questions.\nWorth every cent.", "publishedDate": "2017-08-28", "language": "en", "rating": 5}, {"id": 503422603, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d3270333-r503422603-Sopars_Amb_Estrelles-Barcelona_Catalonia.html", "text": "The setting outside the observatory is just amazing! Great view, romantic atmosphere to go with couple and nice food.. After the dinner we had a private tour in the observatory, since me and my girlfriend were the only English speakers, where the staff explained us everything. Also the staff was very helpful and willing to organise everything according to our preferences. Highly recommended for an unforgettable night!", "publishedDate": "2017-07-19", "language": "en", "rating": 5}, {"id": 492045737, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d3270333-r492045737-Sopars_Amb_Estrelles-Barcelona_Catalonia.html", "text": "First off, at the top off the mountain there is this amazing view! It absolutely takes your breath. You pay for a tour, a dinner and a conference. The dinner is nothing to brag about, if you're hungry you betyer eat before. But the view almost pays for itself. A nice activity if you wanna do something extra! ", "publishedDate": "2017-06-10", "language": "en", "rating": 3}, {"id": 467066589, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d3270333-r467066589-Sopars_Amb_Estrelles-Barcelona_Catalonia.html", "text": "we went with our friend, we did a special celebration and decide to go to the mountain to see the stars and the sky, was very emotive moment", "publishedDate": "2017-03-13", "language": "en", "rating": 5}, {"id": 405856298, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d3270333-r405856298-Sopars_Amb_Estrelles-Barcelona_Catalonia.html", "text": "If you can book to visit and take dinner on the docket patio, you will experience one of life's special occasions. \n\nThe setting will impress everyone, it is stunning. The food and wine flight is of very good quality and the service excellent. But it's not the food that makes it, it's the location, the ambiance and the view - oh, the view. Barcelona is below you and as you dine the shadow and light changes and ends with the thousands of twinkling lights that are a city at night. \n\nHaving experienced a great dinner in a unique setting, you are then invited to tour the observatory with a guide. Fascinating from both a historic viewpoint and the study of the cosmos. For the non astronomers, the culmination of personally using the telescope, tracking Saturn will be something you will remember. \n\nYou can get there by taking the cable car to the top (the amusement park) and walking down the hill. Or you can drive, or use a taxi. You will need to taxi back as the walk back up the hill is daunting. An afternoon in the amusement park and then dinner may work well. \n\nIt's not a bargain, but what price that view and that ambience? ", "publishedDate": "2016-08-15", "language": "en", "rating": 5}, {"id": 401844756, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d3270333-r401844756-Sopars_Amb_Estrelles-Barcelona_Catalonia.html", "text": "This event takes place at the Observatori Fabra on the Collserola hill from which you have an incredible view over Barcelona. First, you can enjoy a glass of cava and then dinner is served, all in the open air. The terrace is quite crowded but thanks to the privileged situation and the well thought lighting you can really enjoy your meal. The food and wine are quite basic but of good quality. After dinner, a lecture is delivered about a scientific subject. The evening we assisted the subject was \"Contamination in the Universe\". A very interesting presentation! Finally, you can visit the Observatori which includes an impressive telescope. Just take into account that the Observatori Fabra cannot be reached by public transport and that getting a taxi can be quite a challenge, so it is recommended to go to the event by car.", "publishedDate": "2016-08-05", "language": "en", "rating": 4}, {"id": 338989619, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d3270333-r338989619-Sopars_Amb_Estrelles-Barcelona_Catalonia.html", "text": "Been there during the cold month of february 2015 and that was the only real problem, cold and clouded sky didn't allow us to actually see the sky through the telescope, nonetheless a unique experience.", "publishedDate": "2016-01-10", "language": "en", "rating": 4}, {"id": 151165209, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d3270333-r151165209-Sopars_Amb_Estrelles-Barcelona_Catalonia.html", "text": "I went there last year with my family and the dinner, visit and presentation where all great! The food was really delicious, and it was awesome to have dinner seeing Barcelona from a bird's view. The presentation after dinner was very interesting and educational. At the end, we visited the beautiful modernist observatory. It was really exciting to see Jupiter through the telescope.\n\nI highly recommend this activity; a little pricey, but really worth it.", "publishedDate": "2013-02-01", "language": "en", "rating": 5}]}}]