[{"locationId": 4597992, "name": "Palau De La Generalitat De Catalunya", "placeType": "ATTRACTION", "reviewListPage": {"reviews": [{"id": 368421159, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d4597992-r368421159-Palau_De_La_Generalitat_De_Catalunya-Barcelona_Catalonia.html", "text": "Very important place for Barcelona and Catalonia, seat of the regional government. Great historical importance aswell. Beautiful architecture. Worth seeing.", "publishedDate": "2016-04-28", "language": "en", "rating": 5}, {"id": 364790844, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d4597992-r364790844-Palau_De_La_Generalitat_De_Catalunya-Barcelona_Catalonia.html", "text": "Palau de la Generalitat de Catalunya, located at Plaça de Sant Jaume is the White House of Catalunya. It is the seat of the Government of Catalonia and the Presidency of the Generalitat.\n\nWhile you're standing on the square outside the Generalitat, look closely at the facade of the City Hall and you’ll see a sculpture of St George and the Dragon, a tale that has been passed down for generations in the Catalan folklore. I had found this story fascinating. Legend has it, and I’m paraphrasing quite a bit, is that the city was once terrorised by a dragon and the King offered up the princess as a blood sacrifice to save the people. So happened that on the day of the sacrifice, St George happened to rode by and decided to save the princess by slaying the dragon. The story takes so much prominence in Barcelona that the people actually celebrates St George’s Day, which is actually their version of Valentine’s Day. Do notice as you visit around Barcelona that the dragon motif featured prominently across the city. If I didn’t head the story in the first place, I would have completely missed interesting nugget.", "publishedDate": "2016-04-17", "language": "en", "rating": 4}, {"id": 357644937, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d4597992-r357644937-Palau_De_La_Generalitat_De_Catalunya-Barcelona_Catalonia.html", "text": "This is a visit which needs to be pre booked beforehand on the Generalitat web site. We had to make contact twice before we got a reply, when we did it was very helpful. Check the visiting schedule as it is very limited and when we visited the only languages were Castillian or Catalan. \nThe tour starts of with an auditorium presentation before you head of into the building proper, which is beautiful, only wish we could have followed the narration. One point -  the numerous St George and the dragon statues and images which being English seems odd to us as we think of him as our patron saint.\nMany thanks to the Generalitat for making this visit available and to the wonderful guide on the 13 Mar.\n  ", "publishedDate": "2016-03-22", "language": "en", "rating": 5}, {"id": 340660000, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d4597992-r340660000-Palau_De_La_Generalitat_De_Catalunya-Barcelona_Catalonia.html", "text": "The Presidential Palace of Catalonia is a medieval building at Placa de Saint Jaume square, opposite the Barcelona City Hall. The building was purchased in 1400 for this purpose and in 1596 its current look was designed in the Renaissance style. Later, several neighboring houses were integrated into the same complex of the palace.", "publishedDate": "2016-01-17", "language": "en", "rating": 5}, {"id": 304725907, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d4597992-r304725907-Palau_De_La_Generalitat_De_Catalunya-Barcelona_Catalonia.html", "text": "This is just a spot to set with your friends before trevling trouh the streets which is really cool.", "publishedDate": "2015-08-29", "language": "en", "rating": 3}, {"id": 289012206, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d4597992-r289012206-Palau_De_La_Generalitat_De_Catalunya-Barcelona_Catalonia.html", "text": "I had heard several great things about the building. Unfortunately, the day we had to visit the Gothic Quarter, it was closed. Still like city hall, it has a great and impressive exterior. It is also a long building going all the way to the Cathedral. The back portion used to be the home of the bishop but now houses the Catalan chief administrator. What we could see was great just wish is was more.", "publishedDate": "2015-07-14", "language": "en", "rating": 3}, {"id": 285708639, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d4597992-r285708639-Palau_De_La_Generalitat_De_Catalunya-Barcelona_Catalonia.html", "text": "Spent a nice couple of hours in this building on Sunday morning. The building \nstarted in the thirteenth century and the Catalonian cabinet govern the province \nfrom there. Admission was free and the guides were very informative about the \nhistory of the building and the goings on there. There are numerous contemporary \nsculptures by various artists housed within. The rooms where they both used to, \nand still do govern from are magnificent, as is the staircase. I don't know if \nit's open every Sunday but if you like grand buildings and you're kicking your \nheels then it's worth a visit.", "publishedDate": "2015-07-05", "language": "en", "rating": 4}, {"id": 235313541, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d4597992-r235313541-Palau_De_La_Generalitat_De_Catalunya-Barcelona_Catalonia.html", "text": "The building is architecturally not very prominent but I was surprised to find Saint Jorge s statue on top. Catalunia and England share the same patron.\nThe square is very nice for a walk.", "publishedDate": "2014-10-20", "language": "en", "rating": 3}, {"id": 212312484, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d4597992-r212312484-Palau_De_La_Generalitat_De_Catalunya-Barcelona_Catalonia.html", "text": "I'm surprised that people are commenting on this attraction based on it's dull reworked external feature. Tours are at limited weekends only (I think the 3rd weekend in the month except August)  and need to be booked through the office of the Generalitat. This is complicated as it requires a Spanish National ID but I managed to get on a tour by emailing the Catalan President's office. It is much easier to visit the City Hall opposite (this is by audio guide) and there are similarities between the building's interiors. Both are free.\nUnfortunately the tours were only in Catalan or Spanish on the day I visited in February but there may be English tours in other months. Luckily the kind guide took time to sum up every room with me in her fluent English. She made the building come alive in the context of the Catalan people's historic struggles. There are some fine art pieces from all eras and interesting architectural contrasts and use of form to facilitate it's function as the totem of the Catalan people's struggle for self determination. The tour is 2 hours and you need to bring the official invite with you plus ID and arrive ahead of time.", "publishedDate": "2014-06-27", "language": "en", "rating": 5}, {"id": 180841855, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d4597992-r180841855-Palau_De_La_Generalitat_De_Catalunya-Barcelona_Catalonia.html", "text": "I went there on my last day in Barcelona just to look at the local shops. It's a nice walk and they were setting for el festival de le merce which happens every year. It's spacious and nice to take pictures at. Part of the culture but if you miss it won't be a big deal.", "publishedDate": "2013-10-13", "language": "en", "rating": 3}, {"id": 130179861, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d4597992-r130179861-Palau_De_La_Generalitat_De_Catalunya-Barcelona_Catalonia.html", "text": "This building isn't to bad but it is northing special, certainly not worth going out of your way for but if your in the area it'd be worth going by.\n\nNothing else much to say about it as it's just a public building which is fairly old but doesn't have particularly impressive architecture, not quite to sure why everyone else has given it four stars.", "publishedDate": "2012-05-18", "language": "en", "rating": 2}]}}]