[{"locationId": 3518832, "name": "Artevistas Gallery", "placeType": "ATTRACTION", "reviewListPage": {"reviews": [{"id": 662132014, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d3518832-r662132014-Artevistas_Gallery-Barcelona_Catalonia.html", "text": "Lovely and welcoming atmosphere, there’s no pressure you can just wander in and have a look. The works on display are beautiful and very well priced! Ended up buying a piece of art from here and I am very glad I did as I got to know more about the local artists. \n\nIf you have even a just a few minutes spare I would suggest paying this beautiful gallery a visit, you may walk away with something you’ll treasure.", "publishedDate": "2019-03-29", "language": "en", "rating": 5}, {"id": 655826905, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d3518832-r655826905-Artevistas_Gallery-Barcelona_Catalonia.html", "text": "This place is amazingly affordable.  They ship anywhere in the world for very affordable prices.  Artists from around the world.  Mostly modern abstract art of all mediums.  The staff are friendly and helpful.  I have purchased numerous pieces of art from here and will continue to come back for more.", "publishedDate": "2019-03-02", "language": "en", "rating": 5}, {"id": 546681694, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d3518832-r546681694-Artevistas_Gallery-Barcelona_Catalonia.html", "text": "I really enjoyed this gallery. I had a small peep (10 minutes or so) and I found really interesting things in there from a range of artists. The lady who I spoke to (on the front desk) was helpful and friendly. I had a browse through the prints and they are very reasonably priced (suited for me as a student!) with prints starting at around 25 euros. I can’t wait to go back! ", "publishedDate": "2017-12-11", "language": "en", "rating": 5}, {"id": 545620280, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d3518832-r545620280-Artevistas_Gallery-Barcelona_Catalonia.html", "text": "Nice and friendly art gallery. Great choice of art and a great location.\nA wonderful  place to discover new artists.", "publishedDate": "2017-12-06", "language": "en", "rating": 5}, {"id": 389141301, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d3518832-r389141301-Artevistas_Gallery-Barcelona_Catalonia.html", "text": "We visited the gallery and really liked a painting in beginning of May 2016.  I called the gallery and they said it was no problem to arrange shipment.  They sent an invoice and I paid it.  Now, the gallery will no longer return emails or calls as of beginning of July.  It is truly incredible and we do not know how we can get back our money.  Please do not purchase from this gallery unless you carry your purchases out the door yourself!", "publishedDate": "2016-07-04", "language": "en", "rating": 1}, {"id": 377041535, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d3518832-r377041535-Artevistas_Gallery-Barcelona_Catalonia.html", "text": "Interesting gallery and many works were well done.  Many works of female nudity and of humor.  The modernism and nudity simply wasn't my style, and I enjoyed Carre D'artistes far more.", "publishedDate": "2016-05-27", "language": "en", "rating": 3}, {"id": 286506961, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d3518832-r286506961-Artevistas_Gallery-Barcelona_Catalonia.html", "text": "Amazingly it is hard to get good contemporary art Galleries walking distance of ramblas, but this beats the odds. Great art of different medium. And for people of a tight budged who want a piece of art instead of souvenirs, they offer a good selection of giclee prints, to fit your budget. ", "publishedDate": "2015-07-07", "language": "en", "rating": 5}, {"id": 269084716, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d3518832-r269084716-Artevistas_Gallery-Barcelona_Catalonia.html", "text": "Visited Artevistas Gallery and experienced theirpromotion of young talents and artists. Their collection includes over 800 original works, including paintings, drawings, photographs, sculptures.  It was great to see so many different styles and techniques used by artists here. Worth a visit!", "publishedDate": "2015-04-30", "language": "en", "rating": 4}, {"id": 233783369, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d3518832-r233783369-Artevistas_Gallery-Barcelona_Catalonia.html", "text": "We stumbled across Artevistas Gallery as we wondered through Barcelona--falling in love with a picture displayed in the front window. It was large and expensive (although very well-priced for the quality and size), and my husband and I weren't quite ready to make a decision. We were also nervous to deal with a business we had no knowledge of involving significant funds and shipping overseas.\n\nWe talked to one of the gallery associates, Chimera, who took my email address and said she would email me a photo of the piece as we considered its purchase. Chimera followed through exactly as she said she would. She made the process so seamless and took the fear out of buying a rather expensive item while traveling in a foreign country and getting it efficiently and safely transported. It arrived in less time than expected in perfect condition, and we are thrilled with the entire transaction.", "publishedDate": "2014-10-11", "language": "en", "rating": 5}, {"id": 212572565, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d3518832-r212572565-Artevistas_Gallery-Barcelona_Catalonia.html", "text": "Found this gallery by chance while on a walk. Really nice work and there are lot of very cool work for sale.", "publishedDate": "2014-06-29", "language": "en", "rating": 5}, {"id": 188866885, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d3518832-r188866885-Artevistas_Gallery-Barcelona_Catalonia.html", "text": "A brilliant concept - interesting and challenging artwork from emerging talents. I purchased work from the gallery in February 2013 and subsequently bought several pieces on-line. The staff at the gallery are attentive and offer a high quality service. On-line purchases are packaged well and sent promptly and securely via Fed-Ex. Excellent value for money and an establishment that should be visited during any visit to Barcelona.", "publishedDate": "2013-12-29", "language": "en", "rating": 5}]}}]