[{"locationId": 11930430, "name": "Dona amb nen i flabiol", "placeType": "ATTRACTION", "reviewListPage": {"reviews": [{"id": 689883653, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d11930430-r689883653-Dona_amb_nen_i_flabiol-Barcelona_Catalonia.html", "text": "The Dona amb nen i flabiol, is a sculpture by Josep Viladomat is also titled “Motherhood”. The sculpture depicts mother and her child. The mother is depicted with a naked torso, a cloak around her midriff, while cradling a flute in right left arm. The child stands in her right is is holding onto her cloak with his left hand and a bunch of grapes with his right. Conceptually, the statue feels like an allegory of Demeter with child Bacchus, who would’ve been his grandmother according to Orphic tradition.\n\nThis statue is part of a sculptural ensemble by in the north part of Placa de Catalunya, but I’d only visit if you’ve got time or are in the area.", "publishedDate": "2019-07-15", "language": "en", "rating": 4}, {"id": 677317881, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d11930430-r677317881-Dona_amb_nen_i_flabiol-Barcelona_Catalonia.html", "text": "Dona amb nen i flabiol is a beautiful sculpture depicting a woman and a child. It's one of those images that are really touching, showing the bond between mother and child. The woman here is also holding a woodwind instrument or flute, an idyllic image. This sculpture is in front of the stunning fountains in wonderful  Plaza de Catalunya. It's a must visit sight.", "publishedDate": "2019-05-29", "language": "en", "rating": 5}, {"id": 672072566, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d11930430-r672072566-Dona_amb_nen_i_flabiol-Barcelona_Catalonia.html", "text": "This statue 'Mother and Child' next to the beautiful fountain is one of the many statues located at Plaza Catalunya.", "publishedDate": "2019-05-07", "language": "en", "rating": 4}, {"id": 669054245, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d11930430-r669054245-Dona_amb_nen_i_flabiol-Barcelona_Catalonia.html", "text": "\"Motherhood\" sculpture consists of a mother and her child. You will notice many sculptures in plaza Catalunia   related to this subject since it  was very common that time. \n\nJosep Viladomat Massanas sculpture of “Motherhood” made his name and marked him as one of the most promising Catalan sculptors at that time and  the most outstanding in the 20th century.", "publishedDate": "2019-04-24", "language": "en", "rating": 4}]}}]