[{"locationId": 3226916, "name": "Plaza Francesc Macià", "placeType": "ATTRACTION", "reviewListPage": {"reviews": [{"id": 689583984, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d3226916-r689583984-Plaza_Francesc_Macia-Barcelona_Catalonia.html", "text": "Plaza Francesc Macia is a public square surrounding a large and I mean large roundabout. It’s named for Francesc Macia, the president of the shorted lived Catalan Republic, which lasted three days. It sits at the junction of Avinguda Diagonal, Avinguda de Josep Tarradellas and Travessera de Gràci. It’s a busy intersection and not really a public square in the traditional sense. Go for the shops around the roundabout and that it. There no much in the roundabout itself, most grass and while statue of a woman washing her hair.\n\nThe roundabout does seem to be used occasionally for political rallies. It’s okay, but don’t go out of the way to see it.", "publishedDate": "2019-07-14", "language": "en", "rating": 3}, {"id": 676115128, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d3226916-r676115128-Plaza_Francesc_Macia-Barcelona_Catalonia.html", "text": "Plaza Francesc Macia is basically a very large traffic roundabout. It is called a \"Plaza\", but you would be risking your life trying to get to it from the footpath, a long way away! You would have to avoid the continuously moving traffic. The plaza is named after the Catalan president whose name it bears. He proclaimed Catalonia as the \"Catalan Republic within The Iberian Federation\". This state of affairs, however, only lasted between 14-17 April, 1931. The plaza has plenty of greenery, and a pond in its middle, along with a female sculpture. Around the plaza there are many shops and shopping centres as well as office buildings.", "publishedDate": "2019-05-24", "language": "en", "rating": 4}, {"id": 606577804, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d3226916-r606577804-Plaza_Francesc_Macia-Barcelona_Catalonia.html", "text": "Frances Macia was President of the Catalan Government in start of 20th century. This intersection on the Avinguda Diognal avenue is named after him. The area is popular for its high end international brand stores, shopping centres and business areas. The entire street comes across as a business district with little to offer the tourist other than modernly designed commercial buildings and expensive shopping. We were told there is a Turo Park near this junction which retains the nostalgia of thirties with a statue of Pau Casals, a famous Catalan musician, at its entrance. However from our bus we missed seeing or stopping by at the same. For the tourist a fleeting glimpse of this square seemed justified.", "publishedDate": "2018-08-14", "language": "en", "rating": 3}, {"id": 583786263, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d3226916-r583786263-Plaza_Francesc_Macia-Barcelona_Catalonia.html", "text": "This plaza commemorates Francesc Macia, first President of the Catalan Government from 1932/33. It is located at one of the busiest intersections in Barcelona, traffic is continuous. Our hotel was located in one of the streets, Carrer del Comte d’Urgell, that joined this intersection. You can access the centre area but beware of the traffic. It is somewhat overgrown, there is a small pond located there with a bust of a female, named Joventut.  Wonder why the monument to the Pesident is not located here instead of Plaça Catalunya? Not a remarkable plaza but surrounded by some buildings of architectural stature.", "publishedDate": "2018-05-29", "language": "en", "rating": 3}, {"id": 581218851, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d3226916-r581218851-Plaza_Francesc_Macia-Barcelona_Catalonia.html", "text": "This is a fairly standard major intersection on Avenue Diagonal , a major street in Barcelona. This is an up-market area of the city but the square is pleasant and has interesting buildings but that is about it. Avenue Diagonal is a great place to walk with its wide street and interesting old buildings.", "publishedDate": "2018-05-19", "language": "en", "rating": 3}, {"id": 539776500, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d3226916-r539776500-Plaza_Francesc_Macia-Barcelona_Catalonia.html", "text": "It’s a square on diagonal which itself is one of the main shopping streets in Barcelona which along with Passeig de Gracia are the main upmarket shops in the City. The square itself I surrounded by more businesses. ", "publishedDate": "2017-11-09", "language": "en", "rating": 3}, {"id": 339628965, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d3226916-r339628965-Plaza_Francesc_Macia-Barcelona_Catalonia.html", "text": "One of the busiest squares in the city is crossed by Avinguda Diagonal and several other major streets. The square is named after the Catalan president, Francesc Macia i Llussa who proclaimed the Free Catalan Republic during the Second Spanish Republic. This is an elegant, business area of Barcelona with upscale restaurants, bars and shops, a safe neighborhood with far less pick pocketing than in the more tourist areas of the city.", "publishedDate": "2016-01-13", "language": "en", "rating": 5}, {"id": 259420036, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d3226916-r259420036-Plaza_Francesc_Macia-Barcelona_Catalonia.html", "text": "The Piazza Francisco Macia is at the intersection of Avenida Diagonal and Avenida Josep Tarradellas. The neighbourhood is very elegant, with chic stores, restaurants, cafes and stores all around. It is also home to the financial/ business district. There is a statue of Pau Casals - arguably one of the most famous Catalan musician.s Francisco Macia was the first Presiddent of Catalunya. A nice square - it is worth stopping by here for a moment or two to watch life pass by as you start your stroll down towards Diagonal.", "publishedDate": "2015-03-14", "language": "en", "rating": 4}]}}]