[{"locationId": 8807625, "name": "Palau de Lloctinent", "placeType": "ATTRACTION", "reviewListPage": {"reviews": [{"id": 682724623, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d8807625-r682724623-Palau_de_Lloctinent-Barcelona_Catalonia.html", "text": "This gorgeous building (built 1549-1557) is worth a visit for the architecture and flora alone. \n\nIt time permits, enter the on-site museum and learn about the Archives of the Crown of Aragon (begin in 1318) now evidently the largest Medieval Archive, and how it came into existence. \n\nAlthough most of the archives have been moved off-site, Pau de Lloctinent is amazing for history buffs and passerby’s alike. ", "publishedDate": "2019-06-19", "language": "en", "rating": 5}, {"id": 657243188, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d8807625-r657243188-Palau_de_Lloctinent-Barcelona_Catalonia.html", "text": "We stumbled across this courtyard on the way to visit a museum. There not much to say other than... It's wonderful. \n\nSmall, peaceful and beautiful. Lots of plants and a water feature. \n\nThere is not much to see other than that as it seemed part of a government building. However, definitely pop in!", "publishedDate": "2019-03-08", "language": "en", "rating": 5}, {"id": 543347921, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d8807625-r543347921-Palau_de_Lloctinent-Barcelona_Catalonia.html", "text": "We were brought here as part of our walking tour and visited twice on or own afterwards. It isn’t a tremendously big courtyard but it’s peaceful and allowed for a bit of quiet away from the hustle and bustle of the city for a while. That ceiling too... beautiful. ", "publishedDate": "2017-11-26", "language": "en", "rating": 4}, {"id": 523364194, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d8807625-r523364194-Palau_de_Lloctinent-Barcelona_Catalonia.html", "text": "The building is beautiful per se and it can be visited for free. The patio is quite nice, but the coffered ceiling is really impressive. It was an unexpected surprise.", "publishedDate": "2017-09-11", "language": "en", "rating": 4}, {"id": 495884331, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d8807625-r495884331-Palau_de_Lloctinent-Barcelona_Catalonia.html", "text": "This is a beautiful, peaceful courtyard and free to enter. Well worth walking through and make sure you look at the stunning door halfway up the stairs and ceiling above. ", "publishedDate": "2017-06-25", "language": "en", "rating": 4}, {"id": 463671039, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d8807625-r463671039-Palau_de_Lloctinent-Barcelona_Catalonia.html", "text": "Free entry to this beautiful and peaceful 16th century courtyard, tucked away behind the cathedral and close to the Museu Frederic Mares.\nThis building houses the archive detailing the history of the Crown of Aragon and Catalonia.\nTake a stroll up the main stairs to the gallery/balcony and look up at the stunning wooden carved ceiling - amazing (this was pointed out to us by the friendly trio of security guards on duty here).\nThere are temporary exhibitions housed here, when we visited it was one detailing how the history of Spain and Catalonia had been represented in comics and graphic novels over the years. As a total lover of this subject I was in heaven, it was excellent.\nWell worth a visit.", "publishedDate": "2017-03-01", "language": "en", "rating": 5}, {"id": 430991898, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d8807625-r430991898-Palau_de_Lloctinent-Barcelona_Catalonia.html", "text": "It wasn't on our radar. Wasn't in our guidebooks. Wasn't even directionally signed. But there it was. An exquisite medieval building with a gorgeous courtyard open to the public. I love these unexpected moments", "publishedDate": "2016-10-23", "language": "en", "rating": 4}]}}]