[{"locationId": 8820217, "name": "F1 - Spanish Grand Prix", "placeType": "ATTRACTION", "reviewListPage": {"reviews": [{"id": 717998621, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d8820217-r717998621-F1_Spanish_Grand_Prix-Barcelona_Catalonia.html", "text": "We found the facilities and organization at this circuit to be excellent. Parking was well organised and we had no problem finding our assigned area (Parking C), which we booked for E20 for all 4 days, along with our seats. It was very close to our stand Tribune K Zone 1. Row F 22 Seat 13 was right at the top. We had an excellent view. \n\nThere are many access roads to the parking areas. Although everything was very well organised, we were a little disappointed at the lack of spirit compared to, for example, the Austrian Red Bull Track, where a lot of effort is put into providing more entertainment and activities for the spectators, especially between races. All in all, a great experience, though.", "publishedDate": "2019-10-13", "language": "en", "rating": 5}, {"id": 686117910, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d8820217-r686117910-F1_Spanish_Grand_Prix-Barcelona_Catalonia.html", "text": "It's a shame that it won't come back next year, because I thought it was a great experience overall. The race this year was't so exciting at the top, but it had many fun moments with the other racers and teams.\n\nPlanning-wise, I felt that Barcelona offered a lot in terms of enjoyment and ease-of-access.\n\nWe were 4 adults and 1 child (1 couple, 1 dad + son (10) and 1 adult). We rented an apartment in town (Arago312), within minutes of walking of the station Barcelona Nord. At first we had planned to take the Sagales bus for ease of travel, but we tried out the train for qualifications and it was very convenient, smooth and a lot cheaper too, most of all if you get a pass for a few days which also allows you to travel to the airport, as well as around the city. \n\nWalking from the train station to the track isn't that long and it allows you to pick up a sandwich and some drinks for the day, saving a few euros.\n\nWe sat in the SuperFan stands L and had a really great view of the track, allowing us to see turns 1, 2, 4, 5 and 6, which means the first turns from the start. We saw quit a bit of actions during qualifications and race, as well as the other racing events. It was easy to access from Entrance 6, which might be the closest to the train station.\n\nFacilities were good, there was plenty of toilets and stands, though there could have been more ice cream vendors.\n\nOverall, it was a great trip, with Barcelona being a great location for the evening activities, even though you wouldn't have been able to tell there was a F1 race in the city, as there were no banners or anything marketing the event at all.", "publishedDate": "2019-07-02", "language": "en", "rating": 5}, {"id": 680813089, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d8820217-r680813089-F1_Spanish_Grand_Prix-Barcelona_Catalonia.html", "text": "Wrote a separate review about the service. (which is poor)\n\nThis review is about the event, and it was absolutely brilliant. The seats we picked had a great view, able to see 7 of the 16 turns from one place. We had a terrific race view over 2 days.\n\nGreat event experience, and we got to walk on to the track after the race.", "publishedDate": "2019-06-11", "language": "en", "rating": 5}, {"id": 677385967, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d8820217-r677385967-F1_Spanish_Grand_Prix-Barcelona_Catalonia.html", "text": "Great week end, stadium a little tired and seats dirty.\nNo alcohol sold on site ( no wonder they lost it for next year)", "publishedDate": "2019-05-29", "language": "en", "rating": 4}, {"id": 676376860, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d8820217-r676376860-F1_Spanish_Grand_Prix-Barcelona_Catalonia.html", "text": "We recently attended the Spanish Grand Prix at the Catalunya circuit. \n\nWe had great seats in grand stand \"G\" which provided about a 30 second view of the cars. However, the race was pretty much a parade with Mercedes finishing 1, 2. Even so, we thoroughly enjoyed the race weekend. \n\nOn the downside, they only sell non-alcoholic beer at the track. We lucked out as they sold real beer at the helipad just outside the entrance.\n\nWith Alonzo retiring and the Spanish government not providing additional funding it looks like this will be the last Spanish Grand Prix for awhile.", "publishedDate": "2019-05-25", "language": "en", "rating": 5}, {"id": 674570780, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d8820217-r674570780-F1_Spanish_Grand_Prix-Barcelona_Catalonia.html", "text": "This is our fist Grand Prix and we had fab seats in the main grandstand across from the Start/Finish line and the Mercedes garage to watch all the goings on and pit stops etc...\nWe used the Sagalés bus service to and from Barcelona about 30/40 min journey and I can’t help praise this service highly enough it was so efficient and well organised - I recommend it to anyone and it drops/picks up about a 5/10 min walk to the main entrance of the circuit, €15 round trip was I thought reasonable.\nI had read about the bad food and the confiscation of bottle caps etc.. and yes the food was pretty pants but we took in a subway we bought in Barcelona which was a third of the price and eat it in our seats. As for the bottle caps well we didn’t have any issues on the 3 days we were there. You are not allowed to take tins in and we did get stopped on the first day as we had sun cream in a metal tin and that was taken off us.\nAs for being a dry circuit, yes it is, and the 0% beer was on sale and it was marked as such - so i couldn’t see an issue. I like a beer as much as the next person but I wasn’t that bothered as you left the stadium at 4 or 5pm and could get a drink on the way to the bus if you so desired. I was there for the racing not getting plastered.", "publishedDate": "2019-05-17", "language": "en", "rating": 5}, {"id": 674164567, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d8820217-r674164567-F1_Spanish_Grand_Prix-Barcelona_Catalonia.html", "text": "Just had a great weekend in Barcelona incorporating the Grand Prix.  Arrived on the Thurs and decided to find out how to get to Montmelo, and as it turned out it's very easy on the Renfe from Passieg de Gracia, 6 stops on the train.  Sadly there were no shuttle buses on the Thurs for the Pitwalk so we had a 40 min walk to the track, but the buses were running every other day to and from the station.  What we didn't find out til the last day was that instead of buying 2 returns for E10.20, which was still relatively cheap, we could buy a T10 book for E14.70 which is for 10 journeys and as many people as you like can use it, so on the sunday 5 of us used it to go to the track and back, so that was excellent value.  You are told before you go there is no alcohol on the track, and it's no different to any other race venue where food and drink is going to be expensive and you can take your own in so it is what you make it.  Thanks to the glorious weather we had a great time, with a couple of extra days thrown in for sightseeing.", "publishedDate": "2019-05-15", "language": "en", "rating": 4}, {"id": 673696598, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d8820217-r673696598-F1_Spanish_Grand_Prix-Barcelona_Catalonia.html", "text": "Invited by a sponsor, we stayed all weekend and enjoyed the hospitality of Paddock Club. The views, activities and experience-sessions, catering...all was of superb Quality and outstanding friendliness. Thans to all the people involved...fantastic spirit.", "publishedDate": "2019-05-13", "language": "en", "rating": 5}, {"id": 673514417, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d8820217-r673514417-F1_Spanish_Grand_Prix-Barcelona_Catalonia.html", "text": "Great track very tired need more money injection the food was awful and no alcoholic allowed buses were great we had a taxi from Barcelona to track 38 euros return 100 euros", "publishedDate": "2019-05-12", "language": "en", "rating": 2}, {"id": 673465044, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d8820217-r673465044-F1_Spanish_Grand_Prix-Barcelona_Catalonia.html", "text": "This is very fun but too disorganized.  \n\nThere should be more information provided to tourists on how to get to the race and how to return to barcelona.  More signs should be placed around the area and personnel should be able to answer questions to tourists.", "publishedDate": "2019-05-12", "language": "en", "rating": 3}, {"id": 672697974, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d8820217-r672697974-F1_Spanish_Grand_Prix-Barcelona_Catalonia.html", "text": "Spanish Grand prix is one of the best in Europe. The Spanish GP is also known as Circuit de Catalunya.", "publishedDate": "2019-05-08", "language": "en", "rating": 4}, {"id": 636059767, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d8820217-r636059767-F1_Spanish_Grand_Prix-Barcelona_Catalonia.html", "text": "I am not normally a Grand Prix fan, however my son and i had a great day!\nWe got the train from Barcelona to Mont melo and walked through the vibrant streets to the circuit.\nA tip stop for a bite to eat here as in the circuit it costs an absolute fortune.\nI also picked up a Lewis Hamilton shirt half the price when you walk back after the race.\nCome equipped with liquid refreshments as its a canny walk to the circuit.\nOverall a good day, still prefer the football at the Nou Camp.", "publishedDate": "2018-11-27", "language": "en", "rating": 3}, {"id": 602536685, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d8820217-r602536685-F1_Spanish_Grand_Prix-Barcelona_Catalonia.html", "text": "The 2018 GP was an excellent experience to have as a part of my Spain Trip. The transport to and from the track was seamless using the bus specially provided for the F1, it was cheap and on time. I opted for a general entrance. The circuit is nestled among hills so there are many really good vantage points all around the circuit. I purchased my entry at the gate with no problems, there were grandstand seats available on the day. I would recommend any motorsport enthusiast to include thisactivity.", "publishedDate": "2018-08-03", "language": "en", "rating": 5}, {"id": 587375733, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d8820217-r587375733-F1_Spanish_Grand_Prix-Barcelona_Catalonia.html", "text": "it was a wonderful experience it is a beautiful track well planed and organised . it was a wonderful day no rain. and a good race", "publishedDate": "2018-06-14", "language": "en", "rating": 5}, {"id": 580981673, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d8820217-r580981673-F1_Spanish_Grand_Prix-Barcelona_Catalonia.html", "text": "Race track is far from the city center (about 30 km) and while getting there is not a problem, getting back to the city could be a hassle. For qualifying on Saturday I went straight from the airport with a taxi (€60). Tried to get one on the way back I faced a line of 200 people waiting. Choose to return by bus, 300 m from the east entrance. For €7.5 one way, 35 minutes later I was at the Barcelona Nord bus station, and taxi took €10 to the center. Around the track itself, lot of activities, food outlets but only 0% alcohol beer :( ", "publishedDate": "2018-05-18", "language": "en", "rating": 3}, {"id": 580699318, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d8820217-r580699318-F1_Spanish_Grand_Prix-Barcelona_Catalonia.html", "text": "Our first Grand Prix. \nThe organisation of people from the city to the circuit was a credit to its people. \nThe big let down came at the actual circuit. The outer perimeter had vendors selling the usual, overpriced food and drinks, but the areas around these were a veritable mud bath. Not what you’d expect for an elitist sport.\nThe stadium can’t blame the previous inclement weather. With the ticket prices they charge, they could certainly afford some decent hard standing instead of steep, uneven, muddy banks. The car park was twice as bad. Not so glamorous! The interior of the circuit was much better organised, but once again, the extortionate franchise prices were eye watering and not of any kind of reasonable standard.\nSomewhere else next year me thinks !", "publishedDate": "2018-05-16", "language": "en", "rating": 3}, {"id": 580371829, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d8820217-r580371829-F1_Spanish_Grand_Prix-Barcelona_Catalonia.html", "text": "Slightly disapointed by the circuit even though we had great seats - dont go expecting alcohol at the grand prix as non allowed inside the stadium only heineken alcohol free beer known as water ! - good transport links to Barcelona but would always prefer Monza", "publishedDate": "2018-05-15", "language": "en", "rating": 3}, {"id": 580340023, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d8820217-r580340023-F1_Spanish_Grand_Prix-Barcelona_Catalonia.html", "text": "We visited the Spanish GP as a treat for my sons 21st birthday.  What a great experience.\n\nIt was very very busy on the Sunday, so I would recommend getting there early if you haven't got a grandstand ticket. The gates opened at 8am (we were there just before).\n\nFood and drink is pretty expensive so I would recommend taking your own.  They allow most things in - just not glass bottles.\n\nWe sat between turns 8 & 9 which seemed to be a very popular spot.  There is a TV screen there and just at the top of the hill are all the toilets, food outlets etc.  These can be tricky to get to on the Sunday with the amount of people, unfortunately you just have to stand where to can!\n\nThe car parks are all sign posted well.  If you are parking in Car Park D like us, this one hasn't got a sign for the car park like the others at the entrance but it is next to one of the entrance gates and is at the top of the circuit opposite to the main grandstand area.\n\nOverall a great weekend and we can't wait to go again!", "publishedDate": "2018-05-15", "language": "en", "rating": 5}, {"id": 580246493, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d8820217-r580246493-F1_Spanish_Grand_Prix-Barcelona_Catalonia.html", "text": "We had a great time despite the cold temperatures! A few notes - no soap in the bathrooms. For some reason this didn’t seem to bother most but we found it rather gross. I also did a lot of research and everything said you could come and go through gates 1 and 6 as you please. That was NOT what we experienced at all. We got there early to check out the track (Sunday ticket only) and left the majority of our things in the car. Not only were we stopped by police when we attempted to leave (friendly but concerned) but when they brought us to a ticket collector to determine if we could re-enter, his response was “why?” As if no one had ever done this before (keeping in mind, we were parked at the outside bar). We explained we left something in the car and he said okay. When we got back to the gate we decided it would be best to go back to the man that told us it was okay to leave - and good thing we did. Luckily he remembered us because our tickets no longer worked. There were no passes given to us as I had read happened in previous years. I don’t know if this is a new rule but it would have been pretty devastating had he not recalled us asking to leave. \n\nAll in all, a great time aside from the soap and maybe the re-entry rules should be clarified. \n\nI would recommend getting there around 9:45 to choose your spot (GA) and still have time to enjoy the track atmosphere. Any time later, you’ll be standing in quite a long queue and won’t have your pick of good spots. ", "publishedDate": "2018-05-14", "language": "en", "rating": 4}, {"id": 580176295, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d8820217-r580176295-F1_Spanish_Grand_Prix-Barcelona_Catalonia.html", "text": "The Spanish Grand Prix is one of the easiest European races for Brit’s to get to and so is quite popular - and for good reason too! Although I’ve been to many races before, this was my first visit to the Barcelona GP. All in all we had a fantastic weekend, but there were both good and bad points:\n\nGood:\n- As an F1 fan, the track is excellent. Weekend grand stand tickets aren’t actually very expensive and you get very good views from everywhere. I can recommend grandstand B and G lots as you can see all of turn 10 and onwards.  \n- It’s possible to walk the entire track as there is a pathway that runs all around, not something you can always do and is a good way of spending time between track sessions. \n- General admission seems very popular and I was surprised at how good the views were for the cheapest way to see the Grand Prix. \n- The track is open after the race on Sunday to walk across. Particularly fun! \n- Travel back to Barcelona seems very easy as there were lots of buses. \n\nBad:\n- There are no water facilities. If you bring water and drink it all, you CANNOT fill up a bottle anywhere. \n- If you buy any bottled drinks (coke, water etc) they take the bottle caps for ‘safety reasons’. The staff know it’s ridiculous but are forced to do it. \n- The circuit is dry and so you cannot buy any alcohol or bring it in with you. You may also not bring any cans in either, even if they’re cans of coke. \n- The security organisation was terrible. On the Friday we queued over an hour to get in because there was only one man checking bags, despite 2 people checking tickets! Plus, depending on what day and gate you entered, sometime you could keep the bottle cap to your water bottle, sometimes not. Bringing 3 2ltr bottles of water to drink all day and being told you have to lose the caps at the gate is not very enjoyable. \n- Travel anywhere north at the end of the day is much more difficult. We stayed in Granollers and ended up walking back every day. \n\nOverall we had an excellent weekend. We were happy to go without beer whilst watching the race and we’re fit enough to walk 5km home everyday. Just remember to bring lots of water and pray that you keep your bottle caps! ", "publishedDate": "2018-05-14", "language": "en", "rating": 4}, {"id": 579930399, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d8820217-r579930399-F1_Spanish_Grand_Prix-Barcelona_Catalonia.html", "text": "Of course any F1 is a great thing to see but we weee disappointed with the lack of organisation and very poor facilities.\n\nWe booked car parking in Zone C but when we arrived the Zone C car park next to tge stadium was full.We were redirected to park on an industial estate some distance away.\n\nWe noted the advice that food and drink inside was expensive so we stopped at one of the stalls outside.What shambles...poor food and over priced and litter everwhere.We spotted one portaloo.Dreadful\nNext we had to find our seats.Each area has a large number but the numbering does not appear on your ticket.We asked three officials and each one seat us to a different location involving lots of walking.\nInside the circuit there were food and drink stalls.Its possible that these will be more expensive fhan the ones outside but we wish we had eaten inside as the facilities were much better.", "publishedDate": "2018-05-13", "language": "en", "rating": 2}, {"id": 544173647, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d8820217-r544173647-F1_Spanish_Grand_Prix-Barcelona_Catalonia.html", "text": "Combining a sight-seeing trip to Barcelona with Spanish G.P., it was fantastic, the bus system from north station  very well organised, short walk to circuit, I bagged a great seat, view of pit lane and close to first corner, superb day out, with plus of the fantastic city of Barcelona, it doesn't get better (p.s.- used the tourist bus, lots of info plus hop on/ hop off wherever and whenever you want) ", "publishedDate": "2017-11-30", "language": "en", "rating": 5}, {"id": 507678277, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d8820217-r507678277-F1_Spanish_Grand_Prix-Barcelona_Catalonia.html", "text": "The tour was excellent.  Our guide spoke very good English and was knowledgeable. Glad we went to see it.  DISCLAIMER: it is not in Barcelona and public transportation will only take you so far.  Make sure you have a reliable way to get there or pay for a taxi.  ", "publishedDate": "2017-08-01", "language": "en", "rating": 5}, {"id": 506461682, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d8820217-r506461682-F1_Spanish_Grand_Prix-Barcelona_Catalonia.html", "text": "This was my first live F1 race. I went back in 2010 with my family. \n\nThe track is outside the city so you'll need to jump on a bus to get there. The walk isn't easy once you're at the grounds but it's worth the trip! Dress for warm weather and wear comfortable shoes. \n\nThis event is not to be missed, the people are amazing and the food is incredible. I highly recommend this one for any F1 fan! ", "publishedDate": "2017-07-28", "language": "en", "rating": 5}, {"id": 505971192, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d8820217-r505971192-F1_Spanish_Grand_Prix-Barcelona_Catalonia.html", "text": "We went to the Spanish Grand Prix with friends and wrapped the race around a two week vacation through Spain. We have been to other races and this Grand Prix  ranked up there with our other experiences. \n\nWe had 3-day tickets and took the bus to the circuit each day. This is the preferable means of transportation as the bus lets you out about a quarter of a mile from gates 4 and 5. The buses are well-run, air-conditioned and efficient. They have this down to a fine art. Also, if you have 3-day tickets, you can go to the Pitwalk on Thursday which is always fun. Lewis Hamilton made an appearance in his pit to sign autographs.\n\nOur seats were at the end of the front straight with views of turns 2 and 3 and they were perfect! The price for the seats was reasonable. These were seats, not bench seating as we've had at other venues. Toilets were plentiful and directly beneath the stands.\n\nWhen people tell you to bring sunscreen, they are not kidding. The sun is relentless. This year there was a constant breeze which helped. If you are bringing a hat, heed that previous statement because you will need to make sure that you can secure your hat or you will lose it. \n\nEnjoy your fellow seat mates. One of the great joys of going to a Formula One race is getting to know other fans from other countries. Talk to the people around you. We were surrounded by people from Norway, Brazil, Spain and Britain. No matter your team, everyone is happy to be there.\n\nYou've read that there is a no alcoholic beverage policy. This is true. Security literally threw away a case of beer that a guy was trying to bring in. Unless you are well skilled at hiding your stash, I wouldn't recommend that you try. I do know that some people are successful because the Kimi Raikkonen fans singing and chanting at Friday practice were well toasted. \n\nThe food is disappointing. In a region renowned for its cuisine, this doesn't make sense. Don't order the hamburger.\n\nOne final and very important warning: watch your valuables. On Friday, the line to get into the circuit was long and very crowded. People were jostling each other in close quarters. Our friend had his wallet in his camera bag and it was stolen while we were in line. Not everyone in the line was actually going to the track. Some were taking advantage of the situation. Secure your valuables!\n\nHaving said all of that, going to the Spanish Grand Prix was a bucket list item. It did not disappoint! The race was phenomenal, our seats were fantastic and I would go back again without hesitation. As long as you know the drawbacks going in, you are set for an incredible weekend!", "publishedDate": "2017-07-26", "language": "en", "rating": 5}, {"id": 501319386, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d8820217-r501319386-F1_Spanish_Grand_Prix-Barcelona_Catalonia.html", "text": "a great place to watch a grand prix, take plenty of sun cream and a hat. the only down side is no beer allowed but plenty of places outside to buy some. ", "publishedDate": "2017-07-12", "language": "en", "rating": 5}, {"id": 496153528, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d8820217-r496153528-F1_Spanish_Grand_Prix-Barcelona_Catalonia.html", "text": "Oké so, I've never been to a F1 race before so this is all based on a first experience. \n\nLet's start with the accessibility:\nWe arrived a few days before it all would happen in Barcelona. There we got tickets for the local public transport. We knew that it was somewhere on the outside of Barcelona. And that getting there with the train would be the easiest way according to the F1 site. \n\nOn the first day we ordered tickets to the village we thought we should go to since no one at the main train station of Barcelona spoke English or seemed to know where the F1 would take place. \nSo we go a 10 point ticket for 2 zones because that was what we needed according to the maps. Then we chose the train. There were around 4 different companies with each more than 5 gates to check in. It look like it at least. Finally in the train we got to the village. But it was on the northern side of the village so the tickets weren't valid and we had to go back with another train after paying extra for valid tickets. \nThan we got to a station 4 km from the track after 1,5hours of traveling.\n\nFor the next times we chose to take a F1 coach to the circuit which we heard of from some friendly British people. \n\nSo it is some terrible organisation from the F1 side to get the people from Barcelona to the circuit. They at least could have said where to find that coach directly to it and put some people at the trainstation to give instructions.(even the information desk people didn't help.)\n\nOn site:\nOnce there, we looked for our seats on the grandstand. There were 3 numbers on our tickets that should help us figure out where to sit. Though we could not make sense out of the numbers on the stand so we asked. The guy we asked directed us to the seats although he didn't speak English. \nVery nice places just past the finish line with view over the first corner. Then Thursday we had the pit lane walk. They would let a sum of people walk through the pit lane one group after the other according to the website. Once there, everyone just walked straight on and there was no one to regulate it. People even walked back when they were half way down. That was horible organising. They could have easily let just a hundred or 200 people enter and leave each time and it would have been great but they didn't.\n\nQualifying:\nOn Saturday we went for the qualifying and we knew we needed some earplugs. So we looked for them. \nWe actually expected them to be given away at each stand but no 500 euro pp for the tickets is nothing but the seat! \nSo the cheap earplugs costed us a few euros. Then the food was around 4-5 euros and you could get it at the bottom of the stand so you wouldn't have to go through the stands check-in again. Still strange that all there people spend 500 euros for a plastic seat and still have to pay for drinks and food. I would at least give some free consumption tickets to each of them. One hamburger they even forgot the actual Hamburger i think is said enough about that organisation and quality.\n\nThe racing then:\nWe had great places because we could see the pit lane the finish line and the screens. Though the balustrade was halve way the track so half of it was difficult to see. Next to that, after the finish line the track bends just enough to make the first coroner disappear behind the stand. During the race the commentary was poor, i heared almost nothing of it. And when the podium ceremony began the interviews were very quiet like nobody should hear it and you should take binoculars with you.\n\nOwh and did I mention that the guy that showed us our seat (one of the crew) directed us to the wrong seats.\n\n I mean with this amount of service and organisation it should have cost nothing more than 100 euros. It is a shame.", "publishedDate": "2017-06-26", "language": "en", "rating": 2}, {"id": 489143773, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d8820217-r489143773-F1_Spanish_Grand_Prix-Barcelona_Catalonia.html", "text": "My wife and daughter bought tickets for my birthday.The track is quite close so you can really get the atmosphere and noise close up.We did not have sit down tickets so we walked the track and got different views of the race. We managed to get on the track to see Lewis and the other winners on the podium .we had a great time and the weather was fantastic.", "publishedDate": "2017-05-30", "language": "en", "rating": 3}, {"id": 488259831, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d8820217-r488259831-F1_Spanish_Grand_Prix-Barcelona_Catalonia.html", "text": "What a fabulous place, and a great race track. We have been to Monaco twice, and Abu Dhabi, so had high expectations for Barcelona. We certainly weren't disappointed. The Circuit de Catalunya is a fantastic circuit, which gives you roaming access around the whole perimeter of the circuit. \n\nFor those with a weekend ticket, be aware that you can go to the circuit on the Thursday and have access to the pit lane and to meet some of the drivers, you will also get roaming access to any stand on the Friday, and to a lesser extent part of Saturday (FP3) but then need to be in you allocated seats for quali and the race itself.  We were also treated to a fully packed support card with F2, GP3 and the Porsche Supercup over the three day period. \n\nTransport:\nGetting to the track from central Barcelona couldn't be easier. Trains to Montmelo run regularly from Barcelona Sans and a three day pass for two will cost €14. The train ride is about half an hour. Once you get to Montmelo you have roughly a mile and a quarter walk to Gate 4 (main entrance next to the fan park and pit straight). Signs are up along the route to help direct you should you need it, however for us it was very much a case of following the crowd. We were at the circuit for 9:30 each day and getting the 8:01 train from Barcelona Sans. Best tip would be to go and get your ticket the day before though, we did and were grateful for it. \n\nGetting home was equally as easy, with only the Sunday being slightly busy. However, each day we stayed at the circuit for all support races, so had not got to battle with the huge crowds.\n\nCatering:\nLet's get this straight from the off... you are in a closed circuit, with 100,000 other folks, you are a captive audience with little other option than to pay premium prices for even the most basic of needs i.e. Water. Whilst there is plenty of choice, both to eat and to drink, nothing comes cheap. It was only on the last day we realised that you could bring food AND drink into the circuit. Therefore, rather than paying €3 for a 500ml bottle of water we paid €1 for an ice cold 1.5l bottle each and took it into the circuit. I wish we had planned this part better as we could have saved a lot of money over the three days by being prepared and taking our own stuff in.\n\nActivities:\nThere was so much to do and see over the three days, so much better than previous races we have been to. Racing simulators, pit stop challenges, gaming, TV presenting, a zip line along the main stand and getting to wave the chequered flag were just some of the activities available for you to partake in. Then throw in dance troupes, drummers, live music, DJs and the most fabulous robot, you couldn't fail to be entertained in between races. \n\nOverall:\nAfter Monaco and Abu Dhabi, I had been slightly sceptical about Barcelona, but I can guarantee this will not be our only visit there. Brilliant. Muchos Gracias ", "publishedDate": "2017-05-27", "language": "en", "rating": 5}, {"id": 487625138, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d8820217-r487625138-F1_Spanish_Grand_Prix-Barcelona_Catalonia.html", "text": "We booked through Secret Escapes and were really disappointed to be given only access to grassy areas with no seating at a cost of £130 per ticket!!! Expected more and I think you would probably do better by booking on line yourself. Well worth going to a grand prix - great days out and wonderful experience but better to have a seat. Also be mindful that in Spain there is no alcohol allowed in the stadium so if you want a drink you have to go out and come back in - not ideal. Definitely DON'T book a Spanish grand prix through Secret Escapes - they put us in a hotel miles out of Barca and I beleive conned us on the tickets", "publishedDate": "2017-05-25", "language": "en", "rating": 5}, {"id": 486083565, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d8820217-r486083565-F1_Spanish_Grand_Prix-Barcelona_Catalonia.html", "text": "We are F1 fans and we're very underwhelmed by this event. The racing was brilliant but that couldn't make up for the terrible seating, the fact there was no alcohol sold onsite only 0% beer for €11 a pint and the ridiculous taxi fares €120 each way being charged to get in and out of the event. Won't be going back. ", "publishedDate": "2017-05-21", "language": "en", "rating": 2}, {"id": 485946993, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d8820217-r485946993-F1_Spanish_Grand_Prix-Barcelona_Catalonia.html", "text": "I can only say that both my husband and I greatly enjoyed our first experience of live motor racing (having enjoyed the telly version for many years before that). We went with Thomas Cook Sport who do a fine job of organising flights, hotels and transfers. We brought our own food (Subway in the centre of Barcelona) to keep the price down, but the food there seemed genuinely reasonable. There is a village outside (food and drinks including alcohol). The walk to the circuit took a bit of time especially on race day due to all the security checks on the gate, but maximum 20 minutes from getting off the coach to getting into the circuit. The circuit itself is alcohol free which I saw as a positive thing. For the ladies there are plenty of toilets, basic but clean. The grandstands themselves are mostly open to the elements so come prepared with sun cream and/or rain macs. The atmosphere was electric, also very international, very good natured. There is also a village in the circuit with interactive things to do eg tyre change, zip wire. It is possible to access the general admission areas if you have a seated ticket, and that's also quite fun. There were good viewing spots on the grass verges. I can recommend Grandstand A - this is alongside the first corner, and we were therefore lucky enough to see all the main action there as it is also the best overtaking spot on the circuit. To anyone who is in two minds, go for it. Definitely recommended.", "publishedDate": "2017-05-20", "language": "en", "rating": 5}, {"id": 485420458, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d8820217-r485420458-F1_Spanish_Grand_Prix-Barcelona_Catalonia.html", "text": "It costs less than 10 euros by taxi to get to the bus station from virtually anywhere in Barcelona. The Sagales F1 bus was pre booked for 12 euros per person return. Really good value after seeing all the cars and taxis waiting at the toll gates. Soon as the coach doors open you could hear the roar of the older, louder F1 cars. Ohh yes, this was set to be a great weekend. It was a 5 min walk up to the circuit. There are plenty of barbecue tents on the way in and the whole event seemed very well organised. There are plenty of areas to sit in general admission ( grassy verges) and as you would would expect, the qualifying on Saturday is quieter than race day, It really is good value for money. Yes, the prices for food and drinks are more expensive but they are not extortionate and remember, you are allowed to bring your own in with you. Just don't bring alcohol as it's an alcohol free venue and better for it. The atmosphere between all the fans was good natured and everyone was there for the same reasons, To be entertained and have a good time. We left immediatley after the race to catch a flight home but next year we will stay on another day which will allow us to walk around the circuit and for the crowds to disappear. A truly fantastic experience which will be repeated. Highly recommended.", "publishedDate": "2017-05-18", "language": "en", "rating": 5}, {"id": 485246470, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d8820217-r485246470-F1_Spanish_Grand_Prix-Barcelona_Catalonia.html", "text": "Travelled independently for the F1 buying our tickets from BookingF1.com and staying in the Les Corts district of Barcelona close to the main Sants train station and travelling up to the track for the three days. Obviously qualifying and race day itself is busier than practice day but all transport is well organised and takes about half an hour and costs €10 return for two people (about £8) cheaper than the shuttle buses that also leave from Sants at €12 pp but they do drop you right outside the track so avoiding the walk through the village but also losing some of the atmosphere too.\nArriving in Montmello station, the track is well signposted through the village but just follow the caps, t-shirts and flags and you won't go far wrong. Plenty of shops and pop up bars on the way to buy refreshments including ready made baguettes. Don't try to take alcohol into the track as your bags are searched, there is a large bar and food complex outside the entrance gates. Non alcoholic beer is served inside the track but at €11 a pint it is a bit steep. All in all it's a fantastic weekend and thoroughly recommended 🏁", "publishedDate": "2017-05-18", "language": "en", "rating": 5}, {"id": 484980703, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d8820217-r484980703-F1_Spanish_Grand_Prix-Barcelona_Catalonia.html", "text": "My wife and myself love F1 racing and we went to the Spanish Grand Prix , one of the best days we have enjoyed. \nWe spent time going round all the F1 merchandise stalls it was a fabulous time and we both loved checking out all the clothing and gifts on the stalls. Lovely race track with bags of sites and stalls to make everyone happy, we spent six hours on the grass banking watching all the different races we loved it.\nI would book it again with no hesitation what a fantastic day , we were tired and exhausted but treasured every second of the day.", "publishedDate": "2017-05-17", "language": "en", "rating": 5}, {"id": 484903270, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d8820217-r484903270-F1_Spanish_Grand_Prix-Barcelona_Catalonia.html", "text": "This was my first visit to a overseas grand prix. the venue is easy to get to by bus from station nord in the city. and the return bus back again. inside the venue the sun beat down with no cover, but hey Lewis won so that does not  matter. There could be more food and drink outlets as queuing seems to be the order of the day.  - my tip take a hat and sun cream and your own picnic", "publishedDate": "2017-05-17", "language": "en", "rating": 4}, {"id": 484787836, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d8820217-r484787836-F1_Spanish_Grand_Prix-Barcelona_Catalonia.html", "text": "Attended the Spanish Grand Prix 2017 for the first time. Race day only.  We stayed in Barcelona and booked general admission (pelouse) through BookF1. Good communication from bookf1 and tickets arrived in plenty of time.  After trawling reviews decided to prebook the Sagales bus from Central Barcelona to the circuit.   In general admission there are only a couple of TVs screens to see so get there early. We got the bus around 7.45 and were seated in our place on the hill by 8.30 am. It was already quite crowded but people did keep filling the small gaps on the grass for a further couple of hours.  We had an excellent view of the TV screen between turn 8 and 9.  The whole trip was a birthday present  for my husband who is a big fan, I just tagged on so was a little worried about the amount of time we would be sitting around just waiting for the race to start!  I had plenty of time to see how the experienced pelouse fans set out their 'area' on the hill and have taken notes for next time!  The grass is prickly- take a towel to sit on, I was unable to find cheap beach towel in Barcelona on Saturday so we managed without but a towel helps, not only with comfort, but to layout your territory and without one we ended up in a very small space as the hill got busier. We did buy a beach umbrella and this provided much needed shade whilst waiting for events to begin. It was hot!  Not knowing what the catering would be like we took food and drink with us but there was a good choice of food at the circuit which I didn't think seemed too pricey although drinks were expensive and no alcohol allowed. Bags are searched on the way in. Toilet facilities plentiful and not too grim, but long queues for these and all food outlets in the couple of hours before race began. A F2 race and a Porsche race in the morning helped to pass the time and we took it in turns for a walkabout. Race was exciting (even for a non fan) but other reviewers can talk about that!  At the end of the race we made our way straight back to the main entrance for the bus back. As we sat half way round the track, and it's fair walk,  many thousands were out before us and I prepared myself for a very very  long wait for the bus. The queue Was so long it took a good few mins just to reach the end to join it, but 10 mins later we were on a bus and less than an hour after the end of the race we were back in the city centre. Excellent organisation for busses and getting traffic away from the circuit. A brilliant day out and we will return!", "publishedDate": "2017-05-16", "language": "en", "rating": 5}, {"id": 484480347, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d8820217-r484480347-F1_Spanish_Grand_Prix-Barcelona_Catalonia.html", "text": "We have been attending the Spanish Grand Prix in Barcelona for a number of years and thoroughly enjoy the experience.  The weather in May is very reliable and in the main, sunny and warm.  I'd recommend booking stand tickets - for a number of years, we booked general admission, however, in the last couple of years, the organisers have reduced the number of large screen TVs in the general admission areas which can make it difficult for race-goers to keep up with what is happening.  Also, since 2015 there has been a complete alcohol ban in the circuit - I have no idea why - which is a bit disappointing as it is always nice to have a glass of wine or beer while watching the race.  Don't be fooled when buying a pint of lager in the arena - it is priced as the alcoholic version, but is non-alcoholic.  It is possible to buy alcoholic drinks outside of the circuit which many people seem to do, before entering.  All bags are searched, so don't try to take your own drinks in with you.  Water and soft drinks in plastic bottles is allowed, but that is all.  It is possible to buy food and there is a good selection.  \n\nWe always take the bus to the race track, which takes you closer to the circuit than the train from Barcelona.  The bus service is excellent and buses leave frequently from the Stacion Nord.  The price has increased significantly in recent years too - in 2016 it was 8 euro for a return ticket and this year it increased to 12 euros.  However, it is a very good service and very convenient.  \n\nThere are lots of good viewing stands - we were in Stand J, which had excellent views and thoroughly enjoyed the experience.", "publishedDate": "2017-05-15", "language": "en", "rating": 4}, {"id": 484406397, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d8820217-r484406397-F1_Spanish_Grand_Prix-Barcelona_Catalonia.html", "text": "This track is really good for spectators.  And the track organisers do a decent job, with some inexplicable exceptions.  1. Work with Barcelona Rail so the information-vest-wearing-people DO NOT PUT YOU ON THE WRONG TRAIN.  Duh!  Then use all your experience to work out what we figured immediately - require catering stands to hire enough people, which is at least 3 x how many they have now, and insist they have a process so the food is AVAILABLE.  Honestly, it was Manuel from Fawlty Towers level, and a huge time waster.  They ought to have a maximum-10min wait metric for stall holders. Basic message: byo food, the catering is moronic.\n\nIt won't hurt to label the direction to the track from the station properly either - \"mostly\" labeled doesn't cut it.", "publishedDate": "2017-05-15", "language": "en", "rating": 4}, {"id": 484280155, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d8820217-r484280155-F1_Spanish_Grand_Prix-Barcelona_Catalonia.html", "text": "Great show great cars, good location near to Barcelona, many places to eat and drink, playground for kids, Pelouse great and not so expensive, an incredible show to be seen at least once at live. Organizations excelent.", "publishedDate": "2017-05-15", "language": "en", "rating": 5}, {"id": 484254725, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d8820217-r484254725-F1_Spanish_Grand_Prix-Barcelona_Catalonia.html", "text": "During 3 days we spent a good time à Catalunya circuit, the race is well organised.\n\nAnticipate to walk quite a lot.\n\nIf choosing camping car or camping be aware that the camp can be noisy at night depending on your emplacement.", "publishedDate": "2017-05-14", "language": "en", "rating": 4}, {"id": 445545277, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d8820217-r445545277-F1_Spanish_Grand_Prix-Barcelona_Catalonia.html", "text": "Booked trip independently. Recommend Goo tickets - got best seats on start/finish line. Aspasio apartments in Barcelona and pre-booked bus to circuit.  Best arranged bussing system ever experienced.  No need for car from Barcelona and better than long walk after train", "publishedDate": "2016-12-20", "language": "en", "rating": 5}, {"id": 409486916, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d8820217-r409486916-F1_Spanish_Grand_Prix-Barcelona_Catalonia.html", "text": "Very well organised with buses from the city direct to the stadium. Less efficient on the return journey & I think the queue for return buses was probably the longest I've ever seen. We had excellent tickets & the track is so designed that you see the track from multiple perspectives. Take a hat & sunscreen & food too. Silverstone could learn from the idea of having facilities at every block. An excellent day out although ideally without Nico & Lewis taking each other out on the second bend!", "publishedDate": "2016-08-23", "language": "en", "rating": 5}, {"id": 387819613, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d8820217-r387819613-F1_Spanish_Grand_Prix-Barcelona_Catalonia.html", "text": "Didn't think the wife would be too happy coming but she thoroughly enjoyed it.  Seat were good, paid a little extra as it was a personal treat.  Transportation was a doddle booking in advance a 12 Euro each return from the centre of Barcelona.  Drop off & pick-up very close to the track.  Love to go again :)", "publishedDate": "2016-06-30", "language": "en", "rating": 5}, {"id": 385063406, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d8820217-r385063406-F1_Spanish_Grand_Prix-Barcelona_Catalonia.html", "text": "use the bus that takes you direct to stadium run by seagals bus company very well organized as we stayed in lloret de mar only took about an hr after picked everyone up", "publishedDate": "2016-06-22", "language": "en", "rating": 5}, {"id": 380526998, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d8820217-r380526998-F1_Spanish_Grand_Prix-Barcelona_Catalonia.html", "text": "The race was fantastic and the facilities were good. The food on the Saturday was pretty ordinary and expensive - we got a cold (not sure it was even cooked) hotdog and a plain bread roll. We took our own food to the track on race day. The track is a dry track (no alcohol).  We didn't have any shade over our stand and the seats were very close together and it felt very hot - even though it was only 23 degrees. The queue at the taxi rank after the race  was disgraceful - it took us 2 hrs to get a taxi!.  There were people were pushing in, elderly standing for hours and there were staff standing around but didn't do much to take charge!  it was a total shambles.", "publishedDate": "2016-06-07", "language": "en", "rating": 4}, {"id": 380061791, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d8820217-r380061791-F1_Spanish_Grand_Prix-Barcelona_Catalonia.html", "text": "While the race was amazing and we witnessed history been made, i can't let the race influence my feelings of the circuit. I am of course, talking about the 2016 Formula 1 race. I can however base my review on my experiences at Silverstone. Positives - The F1 village was set out in a lot nicer way than at Silverstone but we didn't witness much going on. The access around the track was nice and easy to navigate and it was amazing to walk around a grand prix circuit on concrete. It was a massive shame that there was hardly any stalls around the track and they was mainly concentrated in 1 or 2 spots. Toilet facilities were great and it was amazing to be so close to the track. Now i understand this is the governments fault and not the circuits but it ruined my weekend not been able to drink at the track. I have never seen any trouble at Silverstone in 5 years due to drink so i think this law is ridiculous! And to add insult to injury, the prices for water or non alcoholic was extortionate! 8 Euros for a pint of something so horrible. Silverstones food and drink prices are a lot more reasonable. Even with this, i did enjoy the weekend but here is my biggest complain and the biggest issue! The track is not accessible if you don't have your own transport. Once you get off the train in Montmello you then have to walk through the town (20 minutes) to get to the point where you can get a bus! Obviously you pay for the bus ride only to be dropped off no where near the track! You then have a 20-30 minute walk to get inside the track! It was an insult to pay for the bus to only be taken half way! And why does't the bus go from the train station?! It really is a horrible place to get to and would cost a fortune if you got a taxi to the track! Work needs to be done to address this issue more than anything else", "publishedDate": "2016-06-05", "language": "en", "rating": 3}, {"id": 376842294, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d8820217-r376842294-F1_Spanish_Grand_Prix-Barcelona_Catalonia.html", "text": "We were pleasantly surprised with our experience of getting to & from the race track, and the race itself. We used \"bookF1\" to buy tickets for race and bus transportation. They did a great job presenting accurate information to make the experience easy. Coming from a different country and not knowing the area makes buying tickets and planning transportation overwhelming. We walked to the bus station from our Barcelona hotel. We followed the crowd and went straight to the buses taking us to the track. We boarded right away as the buses were loaded quickly. We were dropped off very close to the track (basically on the property of the track). After the race we went back to where we were dropped off. The staff was very good to point the crowd in the right direction. The bus line was extremely long. We were dreading a very long wait time to board the bus. I timed the wait. It was only 15 minutes! And the traffic was directed to make sure there were no problems. We were back in Barcelona in 30 minutes. This was the most organized race for traffic. The track did not sell alcohol, nor allow it to be brought in. Rumors were that the track lost their alcohol license. There was a lot of food choices. The stands were very dated, but were pretty comfortable. (Hard plastic chairs, very close together ). There was never a long line for restrooms.", "publishedDate": "2016-05-26", "language": "en", "rating": 5}, {"id": 375809860, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d8820217-r375809860-F1_Spanish_Grand_Prix-Barcelona_Catalonia.html", "text": "A great grand prix, with excellent views. A few hills to walk up to get to certain grandstands. This is the 3rd time we have been to the Spanish GP, and it is better value than the British Grand Prix, plus the weather is better. Easy circuit to get to from Barcelona.\nWill be back in 2017.", "publishedDate": "2016-05-23", "language": "en", "rating": 5}, {"id": 375535588, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d8820217-r375535588-F1_Spanish_Grand_Prix-Barcelona_Catalonia.html", "text": "Went to the spanish grand prix with my wife.what a trip loved every minute. Everything is so well catered for from food drink and especially the clean toilets. Went to the belgian race last year and although we had a ball a lot of the toilets were porto loo's which are disgusting.would highly recomend Travel department they sort out everything from flights transfers to race tickets.", "publishedDate": "2016-05-22", "language": "en", "rating": 5}, {"id": 375449344, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d8820217-r375449344-F1_Spanish_Grand_Prix-Barcelona_Catalonia.html", "text": "This was my first experience of F1 - it was grand.\n\nWe used the shuttle bus service promoted by F1 - it was reasonably priced and reliable.\n\nWe were sitting to the left of the main grandstand by the first corner. We had great views - we could see both sides of the track as well as the big screens.\n\nIt was a great atmosphere - very much a family day - lots of small children / families having picnics - don't know if this is typical of F1 or if it is just the Spanish knowing how to do things well!\n\nThe catering was not as expensive as I feared.\n\nF1 is much more exciting live than on TV - it is not as noisy as I was led to believe - and I think it is faster!\n\nI was amazed and delighted to get on to the track after the race - close ups of the pit lane etc. Worth the trip.", "publishedDate": "2016-05-22", "language": "en", "rating": 5}, {"id": 374307799, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d8820217-r374307799-F1_Spanish_Grand_Prix-Barcelona_Catalonia.html", "text": "Great race only matched by our great seats in the shaded grandstand - would recommend to anyone, i cannot wait to return and experience it all again.", "publishedDate": "2016-05-18", "language": "en", "rating": 5}, {"id": 373932742, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d8820217-r373932742-F1_Spanish_Grand_Prix-Barcelona_Catalonia.html", "text": "Went to the 2016 Spanish Gran Prix and was not disappointed in the weekend. Found it hard to believe that 11 euros a pint for alcohol free beer was very excessive and 3 euros for 1/2 litre of water. But hey we were on a boys weekend and brought our own to the track. One off race as we have other Gran Prix's to go to. Lots of walking is done so if you are not good at this beware and make sure you book in advance for any assistance you need.", "publishedDate": "2016-05-17", "language": "en", "rating": 5}, {"id": 373192056, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d8820217-r373192056-F1_Spanish_Grand_Prix-Barcelona_Catalonia.html", "text": "I recommend going to any GP you can, but not sure i recommend going for the Catalunya track.\nMight be a challanging track for drivers but it's also somwhat challanging for fans\n", "publishedDate": "2016-05-15", "language": "en", "rating": 4}, {"id": 372785971, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d8820217-r372785971-F1_Spanish_Grand_Prix-Barcelona_Catalonia.html", "text": "Grandstand H seat F10 great view close to toilets and food courts and souvenir shops food and drink is reasonable all round great experience ", "publishedDate": "2016-05-14", "language": "en", "rating": 5}, {"id": 363157091, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d8820217-r363157091-F1_Spanish_Grand_Prix-Barcelona_Catalonia.html", "text": "My sister and I had the privilege of attending the last day of testing 2016. What a fabulous day wee had. In the paddocks, pit lanes on the roof and a tour of the track in a minibus. Roll on june 2016", "publishedDate": "2016-04-10", "language": "en", "rating": 5}, {"id": 353143760, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d8820217-r353143760-F1_Spanish_Grand_Prix-Barcelona_Catalonia.html", "text": "Went here with family as it wasn't much dearer than going to Silverstone!! \nHad an absolutely amazing time. The noise, the smell, the people, the buzz, the whole F1 experience!!\nWell worth it.", "publishedDate": "2016-03-05", "language": "en", "rating": 5}, {"id": 217376945, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d8820217-r217376945-F1_Spanish_Grand_Prix-Barcelona_Catalonia.html", "text": "Everything was just perfect! \nSpecially that they allow everyone walk into the circuit. It was an amazing experience.", "publishedDate": "2014-07-25", "language": "en", "rating": 5}]}}]