[{"locationId": 11737112, "name": "Antigua Fabrica Estrella Damm", "placeType": "ATTRACTION", "reviewListPage": {"reviews": [{"id": 731186044, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d11737112-r731186044-Antigua_Fabrica_Estrella_Damm-Barcelona_Catalonia.html", "text": "Great building, near to the place that we were staying, with the traditional Spanish beer and huge installments and factory parts.", "publishedDate": "2019-12-07", "language": "en", "rating": 5}, {"id": 665969069, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d11737112-r665969069-Antigua_Fabrica_Estrella_Damm-Barcelona_Catalonia.html", "text": "What a fantastic guided tour by a well informed Catalonian who was proud to be from Barcelona and proud to be a member of the Estrella team. For a few Euro’s we had a brilliant tour finishing up with a sampling session which seem to just go on forever !", "publishedDate": "2019-04-13", "language": "en", "rating": 5}, {"id": 657776595, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d11737112-r657776595-Antigua_Fabrica_Estrella_Damm-Barcelona_Catalonia.html", "text": "For a few pennies one of the best 90 minutes I’ve spent in a long time. It’s a real experience, felt like we had been let in the back door for a quick nip around the place without the boss knowing by a mate on the weekend!. So we got to go around the factory after a short, informative video, viewing how the beer is made, packed and sent on its merry way to the four corners of the World. The lady conducting our tour was both proud to work there and very passionate about their products. At the end of the tour we all got four drinks to sample and discuss then mark for taste, colour etc. I reckon the cost of the tour is about a third the cost of the drinks and food at the end !. So impressed, four Brits on our tour had come straight from the airport (next door) to the tour complete with their baggage !. If you are lucky enough to be in Barcelona and have 8 euros in your pocket you must visit !", "publishedDate": "2019-03-11", "language": "en", "rating": 5}]}}]