[{"locationId": 5542130, "name": "Galeria Maxo", "placeType": "ATTRACTION", "reviewListPage": {"reviews": [{"id": 671464806, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d5542130-r671464806-Galeria_Maxo-Barcelona_Catalonia.html", "text": "The 3-D postcards are one of our favorite souvenirs. This is a cave of treasures you won't find anywhere else. Well worth a stop.", "publishedDate": "2019-05-04", "language": "en", "rating": 5}, {"id": 599565994, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d5542130-r599565994-Galeria_Maxo-Barcelona_Catalonia.html", "text": "The place is amazing! The perfect place for soul! I am in love with the art I found in there! \nI am not religious, BUT thanks God such tallented people éxist!  Got some of her art pieces and am really glad about that!", "publishedDate": "2018-07-25", "language": "en", "rating": 5}, {"id": 587497086, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d5542130-r587497086-Galeria_Maxo-Barcelona_Catalonia.html", "text": "Close to all the pieces in this shop are sloppily ripped off from well-deserving artists! The art inside is poorly made, the service was well below average, and the man  who runs the shop has made a number of threats against other artists since he wishes to profit off of their work. STAY AWAY.", "publishedDate": "2018-06-14", "language": "en", "rating": 1}, {"id": 583783427, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d5542130-r583783427-Galeria_Maxo-Barcelona_Catalonia.html", "text": "Definitely deserves a visit! Really nice place that fulfills your heart of joy! Completely loved it!", "publishedDate": "2018-05-29", "language": "en", "rating": 5}, {"id": 581973850, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d5542130-r581973850-Galeria_Maxo-Barcelona_Catalonia.html", "text": "Not only they steal art but their customer service is below awful!!! Email not working, deadlines not met, constant chance from the client to get the work done and ultimately backing out is the only option. Had to get my money back because I had to leave and it was only then I became aware of the artist stolen by them. Just browse the reviews", "publishedDate": "2018-05-22", "language": "en", "rating": 1}, {"id": 578965802, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d5542130-r578965802-Galeria_Maxo-Barcelona_Catalonia.html", "text": "Galleria Maxo steals artwork and does not credit the artists. They do not merit my patronage nor anyone else's.", "publishedDate": "2018-05-09", "language": "en", "rating": 1}, {"id": 558622417, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d5542130-r558622417-Galeria_Maxo-Barcelona_Catalonia.html", "text": "I had happened to come across the website of Galería Alea while researching for my trip in Granada, and thought it looked a different and interesting space so i made sure it was in my intinerary. I am very glad it was. Galería Alea has a bit of everything and something for everyone, from their charming vintage toys to their beautiful original art pieces. This is a must visit for anyone with a trip planned to Granada and I shall certainly be making a return visit when I am next in this stunning Andalusian city. ", "publishedDate": "2018-02-05", "language": "en", "rating": 5}, {"id": 558388962, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d5542130-r558388962-Galeria_Maxo-Barcelona_Catalonia.html", "text": "They plagiarize work from other independent artists, sign them as theirs. We have tried to flag them, sue them, but they still get profit. No art, pure business. Please don’t support this place!", "publishedDate": "2018-02-04", "language": "en", "rating": 1}, {"id": 558026770, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d5542130-r558026770-Galeria_Maxo-Barcelona_Catalonia.html", "text": "There is not a honest hair growing on this mans body. Selling artwork that other people create and then claiming that they are his. I wonder how many of the artworks that truly are his? Not  for a pleasant experience.. ", "publishedDate": "2018-02-02", "language": "en", "rating": 1}, {"id": 557875299, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d5542130-r557875299-Galeria_Maxo-Barcelona_Catalonia.html", "text": "This fake art gallery is selling stolen art from other artists. This is not original this is really pathetic!\nGo and check @elesq on Instagram for more info.\nStop plagiarism! Real artists need proper credits and respect!\n\nSTEALING ART IS NOT BEING ORIGINAL!\n", "publishedDate": "2018-02-02", "language": "en", "rating": 1}, {"id": 527920629, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d5542130-r527920629-Galeria_Maxo-Barcelona_Catalonia.html", "text": "Stumbled into this gem of an art gallery/studio on our first night in Barcelona and kept coming back. The atmosphere is magical. Just walking inside feels like you've come away with an artistic experience. I did end up purchasing a small piece on our last morning there because I just couldn't get it out of my head. Whether you decide to purchase or not, do yourself a favor and go inside!", "publishedDate": "2017-09-27", "language": "en", "rating": 5}, {"id": 497678757, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d5542130-r497678757-Galeria_Maxo-Barcelona_Catalonia.html", "text": "What a joy to have stumbled into this gallery. His artwork captures the essence of Barcelona in the details of his photography and in the uniqueness of his craft. We ended up purchasing 3 of the small pieces--all locations we had visited that day--an alleyway in the Gothic District, a coffee shop (Nomad) and the bar w here we had lunch (Cervantes). What a fun way to remember our trip to Barcelona. Staff was amazing and she packaged up our treasures in such a special way. I cannot recommend a visit to this gallery enough! Please go and support this incredible artist. You won't be disappointed.", "publishedDate": "2017-07-01", "language": "en", "rating": 5}, {"id": 494298276, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d5542130-r494298276-Galeria_Maxo-Barcelona_Catalonia.html", "text": "So dope. So many things to look at not enough time.. original pieces super friendly staff and reasonable prices chchcheck it! ", "publishedDate": "2017-06-19", "language": "en", "rating": 5}, {"id": 482159428, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d5542130-r482159428-Galeria_Maxo-Barcelona_Catalonia.html", "text": "We just happened to wander in and found this to be a very interesting and cool gallery.  The 3D Barcelona views were great to look at and relatively inexpensive.  There are two locations but we were near the Arc de Triomf.", "publishedDate": "2017-05-06", "language": "en", "rating": 5}, {"id": 420695794, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d5542130-r420695794-Galeria_Maxo-Barcelona_Catalonia.html", "text": "I was fascinated by everything I saw in the gallery. You can tell that there is a lot of creativity put into every single detail. I highly recommend the trip here if going to Barcelona. Plus, it´s located in the best neighborhood in town, so you can´t miss it!", "publishedDate": "2016-09-20", "language": "en", "rating": 5}, {"id": 420440282, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d5542130-r420440282-Galeria_Maxo-Barcelona_Catalonia.html", "text": "Stunning gallery in a beautiful part of Barcelona! The interior is something in itself with a gorgeous little train running along the ceiling of the store. Art is incredibly beautiful with a very diverse range. ", "publishedDate": "2016-09-20", "language": "en", "rating": 5}, {"id": 415456207, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d5542130-r415456207-Galeria_Maxo-Barcelona_Catalonia.html", "text": "A gorgeous little gallery/shop. The staff are wonderful and friendly. The work on display is available to buy (we did). Whole wall devoted to 3D photo collages of Barcelona - perfect for an unusual souvenir or gift. Don't forget to look at the ceiling. ", "publishedDate": "2016-09-06", "language": "en", "rating": 5}, {"id": 397286093, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d5542130-r397286093-Galeria_Maxo-Barcelona_Catalonia.html", "text": "If you're looking for an alternative souvenir that's a little different from the standard tourist tat, then this is the place for you!  Loads of hand made pictures and slightly bizarre figurines for sale, with the artist in residence.  Really helpful staff and not at all pretentious.  There's a model rail way that runs around the ceiling and lots of mini cutlery hanging from it too.  A real treasure trove of a find, if you like one-of-a-kind, and like supporting local artists then this place is a must. We picked up some rusted vintage signs for a few euros, a lovely reminder of a great city.", "publishedDate": "2016-07-26", "language": "en", "rating": 5}, {"id": 391025149, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d5542130-r391025149-Galeria_Maxo-Barcelona_Catalonia.html", "text": "Amazing place! Lots of inspiration, surprising at each glance, capture the atmosphere of the city. Worth visiting!", "publishedDate": "2016-07-10", "language": "en", "rating": 5}, {"id": 379301565, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d5542130-r379301565-Galeria_Maxo-Barcelona_Catalonia.html", "text": "Galeria Maxo presents art that appeals to locals and visitors, from multidimensional photographic shadowboxes of Barcelona scenes to abstract collages and compositions to unique prints. The shadowboxes are a cool way to commemorate your trip to Barcelona. ", "publishedDate": "2016-06-03", "language": "en", "rating": 5}, {"id": 378748856, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d5542130-r378748856-Galeria_Maxo-Barcelona_Catalonia.html", "text": "Original, beautiful pieces and ideas. Such a cute little gallery. The toy-train running along the edges of the ceiling are whimsical. The 3D photography is inspiring. The wood and paper prints are deep and mindfully expressive. The sculpture and solid pieces are controversial yet beautiful conversation starters. Staff sit behind the desk in a toy-shop laboratory tinkering away on the next artistic project.", "publishedDate": "2016-06-01", "language": "en", "rating": 4}, {"id": 366474010, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d5542130-r366474010-Galeria_Maxo-Barcelona_Catalonia.html", "text": "Like most we also stumbled on this gallery on the way back to our accommodation. The photos were presented like nothing we had seen before and we ended up purchasing 3 photos to represent our experiences in Barcelona. Worth just stopping in and taking a look, especially if  love photos and/or are looking for something different from the regular touristy purchases.", "publishedDate": "2016-04-22", "language": "en", "rating": 5}, {"id": 354971778, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d5542130-r354971778-Galeria_Maxo-Barcelona_Catalonia.html", "text": "We stumbled upon here after exploring other parts of the city and we impressed from the moment we entered. They offer a mix of more touristy collage options and more abstract collages. We picked up three small collages and are very happy we found this place. If you like art or creativity, we would  strongly recommend this place. ", "publishedDate": "2016-03-13", "language": "en", "rating": 5}, {"id": 340379304, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d5542130-r340379304-Galeria_Maxo-Barcelona_Catalonia.html", "text": "Stumbled on this interesting little gallery during a stroll through the streets of BCN. Bought a couple of beautiful pieces. Would recommend if looking for interesting and affordable art!", "publishedDate": "2016-01-15", "language": "en", "rating": 5}, {"id": 340226004, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d5542130-r340226004-Galeria_Maxo-Barcelona_Catalonia.html", "text": "If you re in Barcelona, don t miss visiting one of the 3 galleries. Really cool, unique things to see. Very good music and customer service. ", "publishedDate": "2016-01-15", "language": "en", "rating": 5}, {"id": 309773061, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d5542130-r309773061-Galeria_Maxo-Barcelona_Catalonia.html", "text": "Such a lovely and amazing gallery, full of creative and special artistic works and spirits, would love to visit again when visiting bcn next time!", "publishedDate": "2015-09-13", "language": "en", "rating": 5}, {"id": 308976798, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d5542130-r308976798-Galeria_Maxo-Barcelona_Catalonia.html", "text": "Such a huge array of incredible artwork, I definitely recommend it to everyone visiting Barcelona! Very easy to just pop in and really worth it. ", "publishedDate": "2015-09-10", "language": "en", "rating": 5}, {"id": 305120112, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d5542130-r305120112-Galeria_Maxo-Barcelona_Catalonia.html", "text": "Based just a 5 minute walk away from the Arc de Trionf, this Gallery is a must see. Maxó Renella is one of the most talented artists in Barcelona. His galleries feature a combination of amazing artwork, with retro displays and designs. \nAlso worth going into the studio to see where and how the artwork is made. ", "publishedDate": "2015-08-30", "language": "en", "rating": 5}, {"id": 292724099, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d5542130-r292724099-Galeria_Maxo-Barcelona_Catalonia.html", "text": "I decided to treat the children to a delightful holiday to Barcelona, but after a few days I needed a little Mummy time! Where better to spend it than at this small, whimsical gallery tucked in off an quintessential Spanish street. The gallery staff were warm and welcoming; in particular a young English gentleman called Michael who made me feel quite at home. The artwork within the gallery is original and unique, although some might be a tad rude! Perhaps it was better I didn't take the kids after all!", "publishedDate": "2015-07-26", "language": "en", "rating": 5}, {"id": 273798953, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d5542130-r273798953-Galeria_Maxo-Barcelona_Catalonia.html", "text": "Lovely little place! The staff are so welcoming, and it definitely is worth a visit! The prices are reasonable and the gallery itself is an interesting collection of pieces! ", "publishedDate": "2015-05-22", "language": "en", "rating": 5}, {"id": 266370765, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d5542130-r266370765-Galeria_Maxo-Barcelona_Catalonia.html", "text": "This shop was such a treasure to stumble upon! It is definitely one to be explored as it captures the creative air of Barcelona. Maxo himself is lovely and welcoming as is everyone who works there as they are more than happy to talk to you about the art work!", "publishedDate": "2015-04-18", "language": "en", "rating": 5}, {"id": 259916246, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d5542130-r259916246-Galeria_Maxo-Barcelona_Catalonia.html", "text": "When visiting Barcelona I found this amazing place, \"Galeria Maxo\". The atmosphere from the area and the street is in my opinion one of the most beautiful places in Barcelona. When I walked in the gallery I got confronted with amazing and very unique art. Not the typical art you would see everyday. A lot of different pieces but all in my opinion breathtaking. Maxo, the owner of the gallery gave me a warm welcome and explained me everything about the creation proces and the thoughts behind the art, together with a very nice Spanish coffee. I would recommend visiting the \"Galeria Maxo\" if you want to see a 'real and original' piece of Barcelona", "publishedDate": "2015-03-17", "language": "en", "rating": 5}, {"id": 246319605, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d5542130-r246319605-Galeria_Maxo-Barcelona_Catalonia.html", "text": "The mission statement of the gallery says it all -  in so many words the best gallery in BCN  to buy affordable art.  It's a great place to pick up a worthwhile souvenir in the form of some fun art that is certainly affordable.  The neighborhood is a good place for a stroll,  clearly a part of town that is in transition from a working class area to a,  dare I say,  trendy area. ", "publishedDate": "2014-12-29", "language": "en", "rating": 4}, {"id": 245179480, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d5542130-r245179480-Galeria_Maxo-Barcelona_Catalonia.html", "text": "Now, when I am in Romania, the first thing that crosses my mind when I think of Barcelona is the Maxo Gallery. It reminds me of the little narrow street that goes to the Gallery. And the outside atmosphere merges very well with the inside one. The artist who handled everything did a very good job. I also bought then a few nice souvenirs from there. My friends told me they could never pay me back for them.", "publishedDate": "2014-12-19", "language": "en", "rating": 5}, {"id": 242792685, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d5542130-r242792685-Galeria_Maxo-Barcelona_Catalonia.html", "text": "Totally loved this gallery! I even got one \"CUADRITO\" piece of art. Best choice ever! Quality art at fair price. The coolest souvenir I got across in Barcelona. As an art student , I am interested in finding places like Maxo Gallery. The gallery has an amazing variety of contemporary art. Besides this, prices are good. Very welcoming and friendly, in my next trip to Barcelona I will totally go back to Maxo!", "publishedDate": "2014-12-03", "language": "en", "rating": 5}, {"id": 242489546, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d5542130-r242489546-Galeria_Maxo-Barcelona_Catalonia.html", "text": "Le-gen-da-ry! I loved the gallery ever since I first walked inside of it. I was on a short trip with some friends and sometime during our day of walking along the great streets of Barcelona, we came across the Maxo Gallery. Initially, we didn't know what to expect, but once I saw what the inside looked like, I immediately fell in love! \nI even bought a little present for myself and now, every time I looked at it I remember one of my favourite places in the great city. :)", "publishedDate": "2014-12-02", "language": "en", "rating": 5}, {"id": 242249386, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d5542130-r242249386-Galeria_Maxo-Barcelona_Catalonia.html", "text": "Last year I was studying at the Basque Country University in Bilbao. Travelling always appealed to me so I fulfilled an old wish of visiting Barcelona. I was not disappointed! The city’s vivaciousness and energetic spirit hooked me the moment I set foot on Barcelona’s streets. Among the typical tourist attractions I also wanted to get a taste of the art world set here. I ended up visiting Galeria Maxo which had the most interesting and colorful works of art. I especially enjoyed the cahitas, which are bars and buildings of Barcelona, photographed and made in such a way that they seem three-dimensional. The gallery is definitely a must-see place!", "publishedDate": "2014-12-01", "language": "en", "rating": 5}, {"id": 242216701, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d5542130-r242216701-Galeria_Maxo-Barcelona_Catalonia.html", "text": "I was just walking on the street, being for 3 days in Barcelona. I wasn't planned to visit museums or galleries of art, because I didn't have so much time, but I saw this Gallery so I decided to have a look. It was brilliant, I couldn't decide what I like more. I'm fascinating about little things and I lost myself in front of the small images from the wall. It was like another world!", "publishedDate": "2014-12-01", "language": "en", "rating": 5}, {"id": 239786256, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d5542130-r239786256-Galeria_Maxo-Barcelona_Catalonia.html", "text": "I found this place thanks to a friend of mine, who is in Barcelona on an Erasmus scholarship. The gallery is very inspiring and full of unique works, especially because everything in the gallery is produced right there in the workshop.I found it was the perfect place to buy a souvenir that will remind me of how beautiful Barcelona is! I think it's definitely worth visiting!", "publishedDate": "2014-11-14", "language": "en", "rating": 5}, {"id": 239773082, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d5542130-r239773082-Galeria_Maxo-Barcelona_Catalonia.html", "text": "Barcelona is an interesting city for every kind of people and this gallery suits it just great! A friend of mine told me about this place and then the curiosity hit me when I visited Barcelona and I searched for this gallery too. I was very impressed, especially by its colours, its pictures and its toys, but the atmosphere there I loved the most. If you want to visit Barcelona, this is a must see and it doesn't matter if you're there with business, with your family, with your lover or solo, this is a place where you have to go if you are seeking for a good time.", "publishedDate": "2014-11-14", "language": "en", "rating": 5}, {"id": 239764148, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d5542130-r239764148-Galeria_Maxo-Barcelona_Catalonia.html", "text": "I found this gallery on a narrow street in Barcelona and I was very impressed. The artist who was responsible for all is a guy full of ideas. I recommend this place to all who arrive in Barcelona.\n\nThis gallery is a great place for those who want to buy a souvenir to remind them of barcelona, the prices are not as high as in other galleries.\n\nI would like to find more places like this. :)", "publishedDate": "2014-11-14", "language": "en", "rating": 5}, {"id": 239645234, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d5542130-r239645234-Galeria_Maxo-Barcelona_Catalonia.html", "text": "I've been visiting Barcelona last weekend, and found this gallery, just 10 minutes away from Picasso museum, very hospitable place, I've found some works that I couldn't see in another galleries. It is filled with spirit of Barcelona, and the arty breeze. I think everybody who loves all that artsy stuff should visit this place!", "publishedDate": "2014-11-13", "language": "en", "rating": 5}, {"id": 239389797, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d5542130-r239389797-Galeria_Maxo-Barcelona_Catalonia.html", "text": "I came in Barcelona with my Erasmus friends. We had a great time in this extremely beautiful city. One day we got lost with one friend in the streets of the old town. We were confused until we found by chance this awesome gallery. Being in this place, the time passed near us. I didn't know what to choose from all the beauty that was kept inside. In the end I bought a really nice 3D box, that I put on the wall in my room and it reminds me of this amazing place, because that is where these things are produced.", "publishedDate": "2014-11-11", "language": "en", "rating": 5}, {"id": 238984393, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d5542130-r238984393-Galeria_Maxo-Barcelona_Catalonia.html", "text": "I visited the Gallery in September 2014, when I was on vacation visiting my aunt who lives in Barcelona, in Spain.I've discovered the gallery while walking around the streets of Barcelona.It is a very intensive space visually.The ceiling train and the  toys with keys are wonderful attractions for children along with the  barbie dolls which surprise you because of their suddenly, unexpected appearance.Obviously the place addresses adults as well, the photographs present are very impressive and the  exploration of Tabu subjects is also a very interesting.", "publishedDate": "2014-11-09", "language": "en", "rating": 5}, {"id": 238977097, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d5542130-r238977097-Galeria_Maxo-Barcelona_Catalonia.html", "text": "I kinda stumbled into this place while visiting Barcelona, on a quiet street in the center of the city, which was a breath of fresh air! It's packed full of art objects and the people are more than happy to help you decide what you should buy, if you're into this kind of stuff. It's really an inspiring place, I left there full of fresh ideas!", "publishedDate": "2014-11-09", "language": "en", "rating": 5}, {"id": 237340567, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d5542130-r237340567-Galeria_Maxo-Barcelona_Catalonia.html", "text": "Maxo's Gallery is the ideal place to find audacious, captivating and original creations. Maxo's art reflects his strong and playful personality. Great place to enjoy amazing art!!!", "publishedDate": "2014-10-31", "language": "en", "rating": 5}, {"id": 233952775, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d5542130-r233952775-Galeria_Maxo-Barcelona_Catalonia.html", "text": "We stumbled into this place our first day in Barcelona and were warmly greeted by the artist.  He told us all the neat 3d boxes of Barcelona scenes were made right in the shop.  What I didn't understand is that these boxes are real scenes!  A month later right before we left we went back again.  I asked  the salesgirl if they had  a box of our favorite restaurant and she pulled it out!  She said the artist goes all over the city taking pictures and then creates the box.  So, find your favorite place, piece of graffiti or whatever and come here for a souvenir that you will love.", "publishedDate": "2014-10-12", "language": "en", "rating": 5}, {"id": 230313477, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d5542130-r230313477-Galeria_Maxo-Barcelona_Catalonia.html", "text": "An must see gallery in Barcelona. Just stumbled into there by accident and was taken by how much thought and effort had gone into the entire gallery not just his art. Ended up spending the whole night with Maxo and his friends was an unbelivable amount of fun!", "publishedDate": "2014-09-22", "language": "en", "rating": 5}, {"id": 227732110, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d5542130-r227732110-Galeria_Maxo-Barcelona_Catalonia.html", "text": "My wife and I came across this place by accident walking in the area one night. If you want to get something to remind you of your Barcelona visit and support a real artist at the same time, this is one of those places. His 3D prints are beautiful. You could easily spend an hour browsing the hundreds on his wall. The prices for prints are not cheap, but very reasonable for what you are getting: genuine local art as souvenir (you can get a small or a large print). He has other very interesting and delightful pieces of print/assembly art as well. The whole store interior exudes artistic passion.\nThe owner, the artist Maxo is very friendly, is willing to entertain you with information about the places in pictures. We actually visited the establishment in the picture that we bought. Very nice. If you are strolling in the Born district near Parc de la Ciutadella, put this stop on your path. You will not be disappointed.", "publishedDate": "2014-09-08", "language": "en", "rating": 5}, {"id": 224106756, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d5542130-r224106756-Galeria_Maxo-Barcelona_Catalonia.html", "text": "Otherwise unheard of this gallery is like a small dreamland of affordable art and sometimes out of this world sculptures! \nThe staff and Maxo were extremely friendly in the customer service and I was given tips on where to go during my stay in Barcelona. The gallery has a wall of 3D small wooden paintings of doorways and Classic Barcelona sights. The other side has some amazing modern pieces at affordable prices- feel like I came away with a bargain. The rest of the shop towards the rear has some unusual pieces that are definitely worth a visit for including the toy trains whizzing above near the ceiling!  ", "publishedDate": "2014-08-24", "language": "en", "rating": 5}, {"id": 222828794, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d5542130-r222828794-Galeria_Maxo-Barcelona_Catalonia.html", "text": "Wondered aimlessly into Galeria Maxo, and I'm so glad I did! Ended up buying two pieces that I love. Maxó is friendly, charming, and an inspired artist. The gallery is warm and inviting, and the art is very accessible. Maxo produces variations on themes--some original, others inspired by other modern artists. A great spot.", "publishedDate": "2014-08-19", "language": "en", "rating": 5}, {"id": 206115505, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d5542130-r206115505-Galeria_Maxo-Barcelona_Catalonia.html", "text": "We rented an AMaZING apartment directly across the street from Galeria Maxo during our stay. I only wish I got speaking to him directly during one of our multiple visits to the gallery, but was delighted to find beautiful shadow box photo pieces that depicted places we had visited during our trip to the beautiful and inspiring city of Barcelona! It was hard to narrow down our selection to only 3, but I will forever be reminded of this place every time I look at my wall where they have found a new home!", "publishedDate": "2014-05-18", "language": "en", "rating": 5}, {"id": 201799349, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d5542130-r201799349-Galeria_Maxo-Barcelona_Catalonia.html", "text": "Read the previous reviews and love art so made our way to this gallery, not for us did not find anything of any interest, but not into modern art... However did like the train! Much preferred the street artists on the Saturday morning down in the market was more our scene.", "publishedDate": "2014-04-19", "language": "en", "rating": 2}, {"id": 197439527, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d5542130-r197439527-Galeria_Maxo-Barcelona_Catalonia.html", "text": "We've been to Barcelona twice in the last few years and Maxo's is a must! Beautiful, original paintings and mixed media pieces at affordable prices in a quaint gallery. Maxo is welcoming and charming - he always takes the time to explain all of his art and will often invite you back into his work area. (If you're lucky, he'll make you a gin and tonic.) We picked up several pieces ranging from 20E to 100E and he graciously packaged and mailed them to our home in LA. He often has monthly themes, so the art changes constantly, but it's a great way to take home a piece of Barcelona.", "publishedDate": "2014-03-14", "language": "en", "rating": 5}, {"id": 195580686, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d5542130-r195580686-Galeria_Maxo-Barcelona_Catalonia.html", "text": "Beautiful gallery plenty of art and imagination. Perfect place to lose yourself and find little surprising corners of Barcelona. I recommend it  a lot!!!", "publishedDate": "2014-02-27", "language": "en", "rating": 4}, {"id": 193082580, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d5542130-r193082580-Galeria_Maxo-Barcelona_Catalonia.html", "text": "This is definitely a neat place to visit if you're looking for a souvenir that is unique and truly captures the spirit of Barcelona. As a study abroad student last fall, I probably passed this gallery a hundred times or more, but sadly didn't visit until two weeks before I left. There is a pet pug that belongs to the artist named Greta that drew me in, but the artwork and Maxo's conversation are worth staying for. In my opinion, his work is reasonably priced and is one of my favorite mementos I bought. Maxo and his staff were friendly and seemed truly interested in my friend and I's experience in Barcelona. I wish Maxo all the best in life!", "publishedDate": "2014-02-04", "language": "en", "rating": 5}, {"id": 190920334, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d5542130-r190920334-Galeria_Maxo-Barcelona_Catalonia.html", "text": "Beautiful place, there you can find a lot of heart. The great artist 'Maxo Rennella' show's the loveliness about Barcelona. His work is an awesome way to express himself. Colourful, interesting and mindblowing as well. It's definitely a place to be.\nDear Maxo,\nplease stay the way you are! Mesmerize the people with your positive attitude! One love, peace!!!!", "publishedDate": "2014-01-15", "language": "en", "rating": 5}, {"id": 189556836, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d5542130-r189556836-Galeria_Maxo-Barcelona_Catalonia.html", "text": "Maxó is an amazing artist and person, which is obvious from walking around this incredible gallery. It is a true must-see of Barcelona.", "publishedDate": "2014-01-03", "language": "en", "rating": 5}, {"id": 188693637, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d5542130-r188693637-Galeria_Maxo-Barcelona_Catalonia.html", "text": "When in El born, be sure to pass by Galeria Maxó and let his original view on art surprise you. Soak up all of the creativity and maybe even take a piece home with you so you can enjoy Barcelona a little longer!", "publishedDate": "2013-12-27", "language": "en", "rating": 5}, {"id": 188509262, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d5542130-r188509262-Galeria_Maxo-Barcelona_Catalonia.html", "text": "If you are close to Galeria Maxo you should pass by for an amazing experience in Barcelona. Maxo pieces are always very impressive.", "publishedDate": "2013-12-25", "language": "en", "rating": 5}, {"id": 188411689, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d5542130-r188411689-Galeria_Maxo-Barcelona_Catalonia.html", "text": "I stumbled into this gallery when I was studying abroad, and it immediately became the most unique experience of my semester. Maxó was genuinely interested in me and my travels, and was open and excited to tell me about his art and to get to know me. The gallery became the place I went to hang out in between classes, practice my Spanish, and learn about art. I was ALWAYS welcome to hang out in his studio. Maxó will always be a friend, we still stay in touch regularly! From talking with him and watching him create art, I can truly say that every piece of art he makes is meaningful, personal, and is influenced by every traveler that enters the gallery and gets to know him. Once I learned about how he created this gallery and studio with his bare hands, I couldn't help but be more amazed by his story. If you are looking for an unforgettable experience and person, make sure to walk in.", "publishedDate": "2013-12-23", "language": "en", "rating": 5}, {"id": 188291662, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d5542130-r188291662-Galeria_Maxo-Barcelona_Catalonia.html", "text": "A unique and friendly art gallery to be enjoyed by everyone.  From the trains traveling around the crown molding to the special pieces of Art by Maxó, and other artists that display in his studio, to interesting hand made jewelry.  Make plans to stop by on your next visit to Barcelona and pick out something for your home to remind you of the fun and beauty that is Barcelona.", "publishedDate": "2013-12-22", "language": "en", "rating": 5}, {"id": 188244917, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d5542130-r188244917-Galeria_Maxo-Barcelona_Catalonia.html", "text": "Had the chance to pass by and fell in love. I got amazed by the magic train and the workshop. Amazing ideas with the 3d pics, love it. Definitely a place to visit in Barcelone, also given the area.", "publishedDate": "2013-12-21", "language": "en", "rating": 5}, {"id": 188238933, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d5542130-r188238933-Galeria_Maxo-Barcelona_Catalonia.html", "text": "When you're walking around the Barcelona, you come across all kinds of boutiques, sights and restaurants one after another. However, every once in a while you should really stop, open your eyes and have a closer look. This is one of those places indeed. Gallery is located on a small street in the heart of El Born, which for me is one of those most true and authentic neighbourhoods of Barcelona. Gallery owner's a welcoming, easygoing character who seems to put a lot of thought in his works, so I'd say don't be afraid to introduce yourself and have a little chat :)   If your timing is right, you might just find yourself in one of the many little events there is. \n\nIf you feel like it there's plenty of authentic art for sale - so instead of those crappy \"souvenir\" scam places, what I did was purchase a few pieces of El Born with me. :)", "publishedDate": "2013-12-21", "language": "en", "rating": 5}, {"id": 187821839, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d5542130-r187821839-Galeria_Maxo-Barcelona_Catalonia.html", "text": "One of the best places to be in Barcelona! Warm, cosy, friendly, with unique, modern, and affordable pieces of art made by the most interesting person I met in the whole city during the one year I lived there, Maxó Renella. The atmosphere becomes even more special thanks to the latin american music playing, which gives a unique touch to the whole place in combination with lovely Maxó. If you visit Galería Maxó once, you will definitely want to go back. Perfect for the ones who are interested in buying unique souvenirs, which enclose the true spirit of Barcelona, instead of the common commercial ones that are sold everywhere in the city. 100% worths a visit!!!", "publishedDate": "2013-12-16", "language": "en", "rating": 5}, {"id": 187545956, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d5542130-r187545956-Galeria_Maxo-Barcelona_Catalonia.html", "text": "the most welcoming and the best collection of art pieces in the heart of Barcelona. When you step intro Maxo's gallery it is like a colorful journey into all that Barcelona has to offer. The owner of the gallery is the nicest person you will ever have the chance to meet. I am so lucky I went into his gallery.", "publishedDate": "2013-12-13", "language": "en", "rating": 5}]}}]