[{"locationId": 7008573, "name": "Font de Canaletes", "placeType": "ATTRACTION", "reviewListPage": {"reviews": [{"id": 752117782, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d7008573-r752117782-Font_de_Canaletes-Barcelona_Catalonia.html", "text": "The first stop on our Gothic Quarter tour which left from Plaza Catalunya.  The rumour is that if you drink from the fountain, you will return.  My first time drinking from it, but hey, my 3rd visit to Barcelona.  Keen as to come back, I need to see Sagrada Familia completed.", "publishedDate": "2020-03-31", "language": "en", "rating": 3}, {"id": 735570321, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d7008573-r735570321-Font_de_Canaletes-Barcelona_Catalonia.html", "text": "No history what so ever. It’s just a lamppost from the 19th century. Don’t go. Not interesting at all. Rubbish", "publishedDate": "2019-12-30", "language": "en", "rating": 1}, {"id": 720448120, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d7008573-r720448120-Font_de_Canaletes-Barcelona_Catalonia.html", "text": "Its a fountain on Las Ramblas , not sure what else you can say , has the Barca coat of arms on it and a description stating that if you drink from it you will return to Barcelona some day , the water is cold and refreshing", "publishedDate": "2019-10-22", "language": "en", "rating": 3}, {"id": 715934500, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d7008573-r715934500-Font_de_Canaletes-Barcelona_Catalonia.html", "text": "It's nothing special, just a fountain a bit different than all the rest.  Since you will definitely walk Las Ramblas if you are in Barcelona, you will fun into this.  So why not stop and get a drink at the famous fountain “Font de Canaletes”.   Legend has it that if you drink from here, you’ll fall in love with Barcelona and will come back.\n\nIn my opinion, even if you don't drink from it, you will fall in love with Barcelona!\nI have :-) and I came back (twice more!)", "publishedDate": "2019-10-06", "language": "en", "rating": 3}, {"id": 689896851, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d7008573-r689896851-Font_de_Canaletes-Barcelona_Catalonia.html", "text": "The Font de Canaletes is a fountain near the northern end of La Rambla, about 50 metres to the south of Placa de Catalunya. Not sure why this is on Tripadvisor as this is just a fountain. There are four taps  dispensing potable water, each above a drain, shaped like a round seat. The central part of the fountain looks like upside down mace.\n\nNice if you need some water, but otherwise don’t go out of the way to see it. In fact, there are several of these dotted around Barcelona, so nothing special.", "publishedDate": "2019-07-15", "language": "en", "rating": 3}, {"id": 688786339, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d7008573-r688786339-Font_de_Canaletes-Barcelona_Catalonia.html", "text": "This is kind of cool, but nothing really special. It's a nice fountain with a unique design, but not worth going out of your way for it.", "publishedDate": "2019-07-11", "language": "en", "rating": 3}, {"id": 675623305, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d7008573-r675623305-Font_de_Canaletes-Barcelona_Catalonia.html", "text": "Font de Canaletes is a nice and useful fountain and lamp post in one! Quite artistic in looks and very useful in essence. The origins of the fountain go back to the 19th century. This fountain has been in use since the 1930s and has been used by fans of the Barcelona football team, to gather round and quench their thirst. Apparently there is a news agency close by and the fans would wait for news. In any case there are at least another dozen of these fountain/lamp posts around! They are quite lovely and worth a look in.", "publishedDate": "2019-05-22", "language": "en", "rating": 4}, {"id": 660078953, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d7008573-r660078953-Font_de_Canaletes-Barcelona_Catalonia.html", "text": "This is a very nice fountain next to Las Ramblas, the pedestrian street and is worth visiting while in this area.", "publishedDate": "2019-03-21", "language": "en", "rating": 4}, {"id": 581045433, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d7008573-r581045433-Font_de_Canaletes-Barcelona_Catalonia.html", "text": "I thought it would be more impressive in real life, but it wasn't. Just pass it by on your way to La Rambla", "publishedDate": "2018-05-18", "language": "en", "rating": 3}, {"id": 579755307, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d7008573-r579755307-Font_de_Canaletes-Barcelona_Catalonia.html", "text": "I am glad I saw it because I had heard about it.  The ideal time to view it, not necessary for photography but for a buzz, would be after a Barcelona football club win.  It is on Las Ramblas and part of the whole experience,", "publishedDate": "2018-05-12", "language": "en", "rating": 4}, {"id": 540690978, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d7008573-r540690978-Font_de_Canaletes-Barcelona_Catalonia.html", "text": "If you're not a FC Barcelona fan you perfectly can skip it, no problem at all. There are several fountains like this.", "publishedDate": "2017-11-13", "language": "en", "rating": 3}, {"id": 534623948, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d7008573-r534623948-Font_de_Canaletes-Barcelona_Catalonia.html", "text": "Drinkable water tap, with history and connection to the Barcelona football club. In earlier times, before the internet, fans would gather here to await news of the football club's away games because the building behind the faucets housed a news agency", "publishedDate": "2017-10-20", "language": "en", "rating": 4}, {"id": 527871433, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d7008573-r527871433-Font_de_Canaletes-Barcelona_Catalonia.html", "text": "It is located at the top end of Las Rambles. This fountain was popular with people filling water bottles on a hot day. Was it because of the legend, or just a convenient place to get free water. We will have wait and see if we return to Barcelona.", "publishedDate": "2017-09-27", "language": "en", "rating": 3}, {"id": 505240298, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d7008573-r505240298-Font_de_Canaletes-Barcelona_Catalonia.html", "text": "I am so glad to see the fountains of Barcelona now listed as attractions and this by far is the best of them all. It has it all, great design with the elegant lights and ironwork, great location on Las Ramblas, great history as a meeting place for Barcelona FC fans after games and most importantly a great ledgend as others have said.  If you want to come back to Barcelona, drink from this fountain.  Our entire family did in 2015 and we came back in 2017. This time, I was the only one to drink so I looks like I will be going back myself. Love the story and love this fountain. I'll be coming back and you should too if you love Barcelona.", "publishedDate": "2017-07-24", "language": "en", "rating": 5}, {"id": 487261198, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d7008573-r487261198-Font_de_Canaletes-Barcelona_Catalonia.html", "text": "I didnt drink from it but its supposed to turn back to town if you drink from it. I like the narrow streets around it. so many cafes and small pubs for a beer and for snacks. ıts also good for waiting someone :)", "publishedDate": "2017-05-24", "language": "en", "rating": 4}, {"id": 473330103, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d7008573-r473330103-Font_de_Canaletes-Barcelona_Catalonia.html", "text": "So, of course you have to have a drink from it - actually the water is cool and clear, so it's a great place to refill your water bottle! It's a pretty fountain/lamp post. Will we return to Barcelona? I hope so, one day!", "publishedDate": "2017-04-07", "language": "en", "rating": 4}, {"id": 430974017, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d7008573-r430974017-Font_de_Canaletes-Barcelona_Catalonia.html", "text": "Of course we drank from it. Legend holds that taking a sip will insure your return to Barcelona, something my wife promised me we would do.", "publishedDate": "2016-10-23", "language": "en", "rating": 4}, {"id": 413904315, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d7008573-r413904315-Font_de_Canaletes-Barcelona_Catalonia.html", "text": "It is a legendarious place. People say if you drink there you will return to Barcelona. My friends did it and now we shall see if itd true. I am a little afraid of diseases so I did not drink there but I believe if its destined I return there someday then I will.", "publishedDate": "2016-09-02", "language": "en", "rating": 3}, {"id": 402274519, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d7008573-r402274519-Font_de_Canaletes-Barcelona_Catalonia.html", "text": "Canaletes Fountain is situated on tha Rambla, close to Placa de Catalunya.\nThe beautiful fountain has lamp posts on the top\nThe fountain is a symbol of Barcelona, and it is one of the most visited places.\nMany victories of FC Barcelona have been celebrated here.\nThe present fountain is from the end of the 19th century.\nThe name \"Canaletes\" goes back to the 14th century, where water chanals brought water to Barcelona.", "publishedDate": "2016-08-06", "language": "en", "rating": 4}, {"id": 385925192, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d7008573-r385925192-Font_de_Canaletes-Barcelona_Catalonia.html", "text": "if in the area walking-you can't miss it. looks neat and worth a photo. It is another neat artistic feature of this stunning city", "publishedDate": "2016-06-25", "language": "en", "rating": 4}, {"id": 340239415, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d7008573-r340239415-Font_de_Canaletes-Barcelona_Catalonia.html", "text": "The fountain, located in the part of Rambla which was named after it, is well-known as the meeting point for the Barcelona football fans after its matches. The original fountain, named after the northern wall of the city, was at the same place from the 16th century and it was replaced in 19th century with this one. There is a tradition that says that you will be back in the city if you drink its water. So, don’t miss the opportunity…", "publishedDate": "2016-01-15", "language": "en", "rating": 5}]}}]