[{"locationId": 7810574, "name": "Avinguda Diagonal", "placeType": "ATTRACTION", "reviewListPage": {"reviews": [{"id": 321052657, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d7810574-r321052657-Avinguda_Diagonal-Barcelona_Catalonia.html", "text": "We walked from the Passeig de Gracia along the Avinguda Diagonal. There are many old buildings in this area that are beautiful. There are many restaurants and interesting stores too.", "publishedDate": "2015-10-22", "language": "en", "rating": 5}, {"id": 303018571, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d7810574-r303018571-Avinguda_Diagonal-Barcelona_Catalonia.html", "text": "A long avenue of shopping and entertainment\nA long avenue with a selection of shops and restaurants for every taste.\nThere is everything for every taste. Just time and money.\nWorth visiting family.", "publishedDate": "2015-08-24", "language": "en", "rating": 5}, {"id": 279924896, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d7810574-r279924896-Avinguda_Diagonal-Barcelona_Catalonia.html", "text": "This is one of Barcelona's broadest and most important avenues. It cuts the city in two, diagonally from west to east.\n\nThere is not much to say. An interesting part in at the intersection with Passeig de Gracia, where you will find a lot of expensive shops and restaurants; another part worth seing is around the Plaça de las Glories Catalanes, where it enters a modern part in renovation.\n\nIf you drive or take a taxi, you will drive through at one point. Otherwise, it is not extremely interesting to look for it specifically.", "publishedDate": "2015-06-13", "language": "en", "rating": 3}, {"id": 259617787, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d7810574-r259617787-Avinguda_Diagonal-Barcelona_Catalonia.html", "text": "The Avinguda Diagonal is one of the most important streets in Barcelona. Running across the whole city for 11km, this street has shops, restaurants, commercial & residential & business areas. In essence this is the main backbone for travelling across Barcelona. Recommended!", "publishedDate": "2015-03-15", "language": "en", "rating": 4}]}}]