[{"locationId": 4234451, "name": "Museu Can Framis", "placeType": "ATTRACTION", "reviewListPage": {"reviews": [{"id": 720257852, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d4234451-r720257852-Museu_Can_Framis-Barcelona_Catalonia.html", "text": "This is a great place to visit - over 250 pieces in the collection plus a temporary exhibition.  We enjoyed the contemporary art work very much.  Also, check the website for hours since some Barcelona museums are closed on Mondays or Tuesdays.  A little hard to find the entrance from the street, depending on which street you are entering from!", "publishedDate": "2019-10-21", "language": "en", "rating": 5}, {"id": 697514129, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d4234451-r697514129-Museu_Can_Framis-Barcelona_Catalonia.html", "text": "This Museum is closed. There's no notification hanging out why nor an English notification on their website. 2 for the building. -3 for the poor information. ", "publishedDate": "2019-08-10", "language": "en", "rating": 2}, {"id": 551923435, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d4234451-r551923435-Museu_Can_Framis-Barcelona_Catalonia.html", "text": "This is one of the most exciting and beautiful buildings I've seen in the last couple of years. Architect Jordi Badia did an amazing job, with lots of sensibility to both the industrial heritage and the landscape. If you're an architect, then this museum is a must.", "publishedDate": "2018-01-05", "language": "en", "rating": 5}, {"id": 483389069, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d4234451-r483389069-Museu_Can_Framis-Barcelona_Catalonia.html", "text": "We visited this gallery as the Meam art museum was closed as they were changing exhibitions. This was to our benefit as this is an excellent museum of Spanish art of the 21st century. The building itself is wonderful with high ceilings and lots of life excellent for showing these wonderful paintings. As this gallery is not well know it was quiet we had the place to ourselves to take our time and enjoy the wonderful art. I would recommend if you enjoy modern art to search out this marvellous gallery.", "publishedDate": "2017-05-11", "language": "en", "rating": 5}, {"id": 433346785, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d4234451-r433346785-Museu_Can_Framis-Barcelona_Catalonia.html", "text": "This is an art museum in Poble Nou. Art is exhibited in a cool building. A contemporary building has been added to an older building. The art is exclusively spanish. I enjoyed the building and not the art so much. But if you are in the area I recommend a visit. Why not a after-beach visit! ", "publishedDate": "2016-10-31", "language": "en", "rating": 3}, {"id": 431770607, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d4234451-r431770607-Museu_Can_Framis-Barcelona_Catalonia.html", "text": "We visited the museum on a very rainy day and in truth partly to escape the weather but so glad we did  it cost five euros to get in but was worth every penny. Beautifully laid out with very thought provoking and beautiful art and sculpture. It was good to absorb the Catalonia creativity and the rain had stopped when we left (well nearly ) \n", "publishedDate": "2016-10-26", "language": "en", "rating": 5}, {"id": 332144642, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d4234451-r332144642-Museu_Can_Framis-Barcelona_Catalonia.html", "text": "A fabulous place to wander and see permanent exhibitions of great artists. Agustí Puig and many more painters.", "publishedDate": "2015-12-11", "language": "en", "rating": 5}, {"id": 296950576, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d4234451-r296950576-Museu_Can_Framis-Barcelona_Catalonia.html", "text": "The main area of the museum shows catalan art /paintings. Very interesting if you need a short introduction of the catalan history in pictures", "publishedDate": "2015-08-08", "language": "en", "rating": 4}, {"id": 275129658, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d4234451-r275129658-Museu_Can_Framis-Barcelona_Catalonia.html", "text": "We found it here at Trip Advisor at coincidence ... directly after the visit of the flee market. The building is great and how they allocated the paintings is even better. We are very lucky about that we have been there!!!! Thanks a lot!", "publishedDate": "2015-05-27", "language": "en", "rating": 5}, {"id": 274136093, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d4234451-r274136093-Museu_Can_Framis-Barcelona_Catalonia.html", "text": "Not only is this neighborhood really interesting and the repurposing of this factory for a museum creative, but the art collection is a 'don't miss'. Terrific collection of unfamiliar ( to us) artists but the work is arranged thematically as the owner idiosyncratically saw fit.  The works talk to each other and to the viewer and enrich and enhance the experience. The foundation also has small books on each artist. \nWould have been nice to have had a cafe on premise, but that's always a preference of mine!", "publishedDate": "2015-05-24", "language": "en", "rating": 5}, {"id": 257838725, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d4234451-r257838725-Museu_Can_Framis-Barcelona_Catalonia.html", "text": "By visiting Can Framis Museum you can experience the expressions of the catalan artists. Surrounded by modern buildings and old factories Can Framis is the connection between the ancient and the modern. Good starting point for discovering the artistic neighbourhood of Poblenou.", "publishedDate": "2015-03-05", "language": "en", "rating": 5}, {"id": 257831692, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d4234451-r257831692-Museu_Can_Framis-Barcelona_Catalonia.html", "text": "This is a great painting collection to know catalan contemporary art. The building  combines new and old. Very interesting area as well. ", "publishedDate": "2015-03-05", "language": "en", "rating": 5}, {"id": 199291248, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d4234451-r199291248-Museu_Can_Framis-Barcelona_Catalonia.html", "text": "A quiet pearl in Poblenou. Full of the most interesting contemporary art (all Catalan). We live in the neighbourhood but were unaware of the gem. They change the permanent exhibit once a year, so we will go there again. Spectacular art! And the building is interesting as well.", "publishedDate": "2014-03-30", "language": "en", "rating": 5}, {"id": 196931768, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d4234451-r196931768-Museu_Can_Framis-Barcelona_Catalonia.html", "text": "I went to this museum mostly because I admired the reconstruction of the factory from 18 th century, but when I entered I was surprised how big and interesting is the collection inside. You can find there around 300 works of modern and contemporary catalan paintings. And is for sure worth to visit. You can combine this visit with the dynamicaly developing surroudings of Glories.", "publishedDate": "2014-03-10", "language": "en", "rating": 5}, {"id": 195801904, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d4234451-r195801904-Museu_Can_Framis-Barcelona_Catalonia.html", "text": "The building itself is already worth it, but the collection in it makes it a must see. It makes it also a great opportunity to visit the surroundings of the touristic core of the city and get to know the Poblenou district and have a different and more realistic view of the city. Every piece of the collection exposed is an taste of the style and trends of the main contemporary Catalan painters to be enjoyed in an awesome space that emphasizes the experience at it's best. Is definitely a tasteful pick of the city, I would totally go back as the collection keeps growing and changing. Highly recommended!", "publishedDate": "2014-03-01", "language": "en", "rating": 5}, {"id": 193525190, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d4234451-r193525190-Museu_Can_Framis-Barcelona_Catalonia.html", "text": "What a beautiful museum! A very interesting and big collection of contemporary catalan art of high quality, much better than in the Macba, and a wonderful bulding, partly an old factory. Combine this with a stroll in the neighbourhood, which is very interesting and with great modern architecture. The museum is highly recomenable!!", "publishedDate": "2014-02-09", "language": "en", "rating": 5}, {"id": 190438312, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d4234451-r190438312-Museu_Can_Framis-Barcelona_Catalonia.html", "text": "Definitely worth the visit the museum in Barcelona's Poble Nou (22@) district. Not only worth the architecture around the museum, but also to get a good impression of the main Catalan contemporary painters.\n\nThe museum's attractive spaces put the works into a context that they deserve. The collection is still growing and consists of an interesting mix between realist and more abstract works. \n\nWhen we visited the museum in January this year, they were renovating the old brick chimney, but gives the site a historic touch of its industrial past.", "publishedDate": "2014-01-10", "language": "en", "rating": 5}, {"id": 187111034, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d4234451-r187111034-Museu_Can_Framis-Barcelona_Catalonia.html", "text": "The museum Can Framis is situated in the new district of Barcelona named 22@.This new area has transformed the old industrial area to a new hi-tech district. The building really deserves a visit as it combines the old factory and its restoration with the new part in an interesting way. As it concerns the exhibition, it is amazing with a numerous pieces of art and a very well curated. It is worth a visit.", "publishedDate": "2013-12-08", "language": "en", "rating": 5}, {"id": 185382606, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d4234451-r185382606-Museu_Can_Framis-Barcelona_Catalonia.html", "text": "Great way to spend a morning or afternoon in an intriguing part of the city, off the tourist radar, but easily reachable by subway (Glories).  First-rate architecture, by Studio BAAS, and good contemporary art, painting and sculpture, by Catalan artists.  You can easily spend a couple of hours here, then continue to Rambla de Poblenou to have lunch, tapas or dinner at the charming Can Recasens, for \"torrades\" toasts with ham or cheese or \"tablas\" a selection of dried meats and cheeses.", "publishedDate": "2013-11-21", "language": "en", "rating": 5}, {"id": 185213080, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d4234451-r185213080-Museu_Can_Framis-Barcelona_Catalonia.html", "text": "I will write this in short terms:\nThe building is amazing.\nThe art pieces are stunning and well curated.\nCheap entrance fee and discount for students.\nWe were (almost) the only visitors and had the museum to ourselves. (tuesday afternoon)\nA much better (modern art) museum-experience than our visit at MACBA.", "publishedDate": "2013-11-19", "language": "en", "rating": 5}, {"id": 172233432, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d4234451-r172233432-Museu_Can_Framis-Barcelona_Catalonia.html", "text": "For those who want to combine modern art and arquitecture, Can Framis is the place to go! Huge and impressive art exhibition inside a piece of art museum! Really worth it!", "publishedDate": "2013-08-14", "language": "en", "rating": 5}, {"id": 161704163, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d4234451-r161704163-Museu_Can_Framis-Barcelona_Catalonia.html", "text": "It's my 7th time in Barcelona, and I've seen some of the museums there, this time I was looking for modern art and in the tourism office I saw this museum. Not in the city center but easy to get there by metro, Can Framis museum is, by far, one of the best options if you like modern art, the visit took one hour more or less and you can see a really good collection of modern art!! I will for sure visit it again next year! Thanks for the guided tour! It was really good.", "publishedDate": "2013-05-24", "language": "en", "rating": 4}, {"id": 161384389, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d4234451-r161384389-Museu_Can_Framis-Barcelona_Catalonia.html", "text": "Amazing visit in a piece of art building, incredible paints of Tapies, Alzamora, Puig... So many great catalan artists! It is a hidden treasure in Barcelona! 100% recomendable!!!", "publishedDate": "2013-05-21", "language": "en", "rating": 5}]}}]