[{"locationId": 14287984, "name": "Passatge Sert", "placeType": "ATTRACTION", "reviewListPage": {"reviews": [{"id": 738097359, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d14287984-r738097359-Passatge_Sert-Barcelona_Catalonia.html", "text": "I have just discovered a really lovely vegetarian restaurant called Kriti in a tiny little street called Passatge Sert in downtown Barcelona. The food is gorgeous and the street itself is an oasis of calm and tranquility. Definitely worth a visit.", "publishedDate": "2020-01-09", "language": "en", "rating": 5}, {"id": 689697813, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d14287984-r689697813-Passatge_Sert-Barcelona_Catalonia.html", "text": "Passatge Sert is an alleyway in St. Pere area of Barcelona and runs through what used to be factories owned by the Sert family. Now it's mostly trendy shops, cafes and offices. Quirky, but not much to see.", "publishedDate": "2019-07-15", "language": "en", "rating": 2}, {"id": 672721876, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d14287984-r672721876-Passatge_Sert-Barcelona_Catalonia.html", "text": "Passatge de Sert is situated in the Sant Pere district and it links Carrer de Trafalgar to Carrer de Sant Pere Mes Alt. \n\nOriginally it was an interior passage in a big textile factory built in 1753 and owned by the Sert family.", "publishedDate": "2019-05-09", "language": "en", "rating": 4}, {"id": 627720099, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d14287984-r627720099-Passatge_Sert-Barcelona_Catalonia.html", "text": "Passatge Sert is a very evocative passageway that looks absolutely fantastic. \nThe passageway dates from 1753 and links Carrer De Trafalgar with Carrer Sant Pere Mes Alt, it forms the border of were the old town meets the relatively new town ( Eixample  ) .\nThis passageway makes for some great photographic opportunities and is well worth seeking out. \nEasy to locate on Carrer De Sant Pere Mes Alt De Trafalgar, a great looking passageway, well worth seeking out. ", "publishedDate": "2018-10-24", "language": "en", "rating": 5}]}}]