[{"locationId": 10230877, "name": "Playa de Llevant", "placeType": "ATTRACTION", "reviewListPage": {"reviews": [{"id": 692438247, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d10230877-r692438247-Playa_de_Llevant-Barcelona_Catalonia.html", "text": "We went to the beach to spend the day there and get into the water. We read on the reviews to watch out for thieves waiting to take your things if you’re not watching them. We didn’t realize how many people are actually pacing back and forth looking to see what you have and wait for you to leave your stuff unattended. After watching them for several hours, we figured out that they have these blankets they are selling, but it’s actually their flag to signal other people working with them that items are left unattended. They open the blanket like presenting it, but its marking their location and another individual that sells water or beer will go check it out and get real close to the items and see if he could take them. They also sell bottle water for 5 euros which is ridiculous so if you want a bigger and cheaper water, go into the restaurant. The beach itself and water were great, but having to constantly worry about these thieves takes the relaxation away from the beach. They did scatter like roaches when the police came by, but come back out when they left. I think if they had police constantly or stationed there, the beach could be really wonderful. Oh it is legal for women to go topless so just a FYI. ", "publishedDate": "2019-07-24", "language": "en", "rating": 3}, {"id": 670697144, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d10230877-r670697144-Playa_de_Llevant-Barcelona_Catalonia.html", "text": "in the middle of the city of Barcelona in its windiest days this beach is one of the best for the practice of sports related to the wind, in addition its configuration of breakwaters allows an added comfort that both athletes and visitors appreciate", "publishedDate": "2019-05-01", "language": "en", "rating": 5}, {"id": 656264245, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d10230877-r656264245-Playa_de_Llevant-Barcelona_Catalonia.html", "text": "An accessible beach in Barcelona but boy oh boy, is this a crowded, noisy and filthy place. Would recommend to go outside of Barcelona if you want to enjoy a quiet day at the beach.", "publishedDate": "2019-03-04", "language": "en", "rating": 2}, {"id": 602707600, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d10230877-r602707600-Playa_de_Llevant-Barcelona_Catalonia.html", "text": "We wandered onto this beach like typical tourists at 4.30pm. The only place to hire a sunbed and or parasol is from the Bambu Beach Bar at the far end of the beach. It costs €10 for each item. The guy hiring them kindly placed the items in just the right place advising that the cost was 'the same' for all three items. This turned out to be tri at a total of THIRTY Euros.  We had no choice as the temperature was 35 degrees.  Of we'd realised before hand it would have been cheaper to buy parasols and throw them away afterwards. Be very careful and don't get caught out like us. I even checked with other people on the beach and they'd paid the same. Complete rip off which was them made worse when the guy came around at 6.30pm to tell us he was closing at 7pm.  We along with some other unsuspecting mugs weren't happy and when we all complained he agreed to leave us the beds and only take away the parasols. The beach itself is OK but like all beaches in Barcelona is very busy and has a fair bit of rubbish, cigarette butts and the like. ", "publishedDate": "2018-08-04", "language": "en", "rating": 2}, {"id": 563922141, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d10230877-r563922141-Playa_de_Llevant-Barcelona_Catalonia.html", "text": "Very clean and busy beach. Lots going on here and very popular especially with the locals and dog walkers.", "publishedDate": "2018-03-03", "language": "en", "rating": 4}, {"id": 517959876, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d10230877-r517959876-Playa_de_Llevant-Barcelona_Catalonia.html", "text": "Only place you can take your dog in the summer, right on the corner, but still amazing. The vibe is so great, it seems that everyone there was enjoying their time with their furry friend. Be prepare for a mess, though, as the dogs sometimes get very excited. Free, but they scan the chip of the dog.", "publishedDate": "2017-08-27", "language": "en", "rating": 5}, {"id": 373304644, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d10230877-r373304644-Playa_de_Llevant-Barcelona_Catalonia.html", "text": "It is known that if you want to enjoy places with peace of mind, the best public care, the better cleaning, the safest corner, the better comfort, the better access and the better care if necessary, one has to look for places where older people go.\nOn this beach many older people have lengthen their health with magnificent swim in the clean waters and good tan in a very healthy way. This is the beach of Barcelona that combines all these advantages. \nUndoubtedly it is the best beach in Barcelona for relaxing and sunbathing. I recommend it 100%... even for surfing!", "publishedDate": "2016-05-16", "language": "en", "rating": 5}]}}]