[{"locationId": 2487738, "name": "Parroquia de la Mare de Deu de Betlem", "placeType": "ATTRACTION", "reviewListPage": {"reviews": [{"id": 381033300, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d2487738-r381033300-Parroquia_de_la_Mare_de_Deu_de_Betlem-Barcelona_Catalonia.html", "text": "Our Lady of Bethlehem Parish Church is in Las Ramblas, close to the market, and is a typical old church with many interesting features. The altar and main chapel are simple and beautifully decorated as is the line of arches along one side.", "publishedDate": "2016-06-08", "language": "en", "rating": 4}, {"id": 339537917, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d2487738-r339537917-Parroquia_de_la_Mare_de_Deu_de_Betlem-Barcelona_Catalonia.html", "text": "The church of Bethlehem, located at La Rambla, was built in the early 17th century, on the site of the old Jesuit church that was burnt down. It was then the most important church in Barcelona. Sadly, it was burnt again in 1936 during the Spanish Civil War and lot of its invaluable treasures and works of art were destroyed in the fire. But it is still a very interesting building with modest but elegant interior.", "publishedDate": "2016-01-12", "language": "en", "rating": 4}, {"id": 326327890, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d2487738-r326327890-Parroquia_de_la_Mare_de_Deu_de_Betlem-Barcelona_Catalonia.html", "text": "Esglesia de Betlem is a Baroque church situated on La Rambla. Lovely architecture. We didn't go in as it was closed.", "publishedDate": "2015-11-12", "language": "en", "rating": 5}, {"id": 316904028, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d2487738-r316904028-Parroquia_de_la_Mare_de_Deu_de_Betlem-Barcelona_Catalonia.html", "text": "In the heart of Las Ramblas, this church is a symbol of Christianity. Apparently this parish has suffered 2 fires (I had no clue about it until I read a couple of reviews). Most importantly, is that the church from the outside is amazing. The tower bell rings every hour reminding us of the time. \nThe inside of the church is simple and basic yet the serenity connects us to God.\nWe assisted a Mass on Sunday. It was in Catalan but we were able to follow the priest in his prayers.", "publishedDate": "2015-10-07", "language": "en", "rating": 5}, {"id": 316783882, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d2487738-r316783882-Parroquia_de_la_Mare_de_Deu_de_Betlem-Barcelona_Catalonia.html", "text": "This church is located just around the corner from the hotel that we were staying in whilst in Barcelona. We walked past the church on several occasions without even noticing it because of its dull, drab architecture. It is situated on a rather ordinary little square which fronts on to Las Ramblas. \nEventually our attention was drawn to the church, not by the building itself but instead by a number of homeless people who were bedding down for the night, next to it. This was rather a sad sight! We took the opportunity to pop inside the church and discovered that the interior of the church were almost as plain as the exterior.\nThis church is certainly not worth going out of your way to see it. If you happen to be passing, just take a quick look and then keep going!", "publishedDate": "2015-10-07", "language": "en", "rating": 3}, {"id": 289022134, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d2487738-r289022134-Parroquia_de_la_Mare_de_Deu_de_Betlem-Barcelona_Catalonia.html", "text": "The church of La Rambla. La Rambla was the walled street between the Gothic Quarter and the Ravel which was a newer district within the walls. As a part of the new district, it is not unusual to see this church with a more baroque style of interior and design. However, there is a clear underlying Catalan influence with is fairly plain horizontal influence. The exterior is also a more dressed up version of Santa Marie de Pi or Santa Maria del Mar. The strong horizontal influence is still there below a Baroque veneer. If you are on La Rambla stop by to see.", "publishedDate": "2015-07-14", "language": "en", "rating": 3}, {"id": 282086741, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d2487738-r282086741-Parroquia_de_la_Mare_de_Deu_de_Betlem-Barcelona_Catalonia.html", "text": "While walking back to our hotel on Las Ramblas, we found this lovely church.  We stepped into to this simple, beautiful, quiet, peaceful church and spent a few minutes enjoying a contemplative place in the midst of the chaos of the world outside.", "publishedDate": "2015-06-22", "language": "en", "rating": 4}, {"id": 277911121, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d2487738-r277911121-Parroquia_de_la_Mare_de_Deu_de_Betlem-Barcelona_Catalonia.html", "text": "This nit so big jewish church was costructed\nBetwween La Rambla and Del Carmen street approximatley in 1546 It was damaged by a fire which was caused by the different ideologies and fights between the religions at tjat time\nIt was rebuilded and is still a beautiful construction. \nInside the church there are different rooms with fugures of saints and the Virgin Mary\nWhat calls my attention is the magnificent vitral, three at the entrance of the church but you do not see it until you are at the very front of the mayor altar. A lot of gold in the details of the church\nA must see when in Las Ramblas.", "publishedDate": "2015-06-04", "language": "en", "rating": 5}, {"id": 265124674, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d2487738-r265124674-Parroquia_de_la_Mare_de_Deu_de_Betlem-Barcelona_Catalonia.html", "text": "I have a habit if walking into churches anywhere I see them. This was a cool find. Although not super decadent, it was very simple on the inside. If you have time, or are just meandering this is a cute church to pop into, but this is not a must see. ", "publishedDate": "2015-04-11", "language": "en", "rating": 3}, {"id": 216033421, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d2487738-r216033421-Parroquia_de_la_Mare_de_Deu_de_Betlem-Barcelona_Catalonia.html", "text": "We stumbled across the ‘Our Lady of Bethlehem’ parish, neither of us are religious so we quietly looked on during the mass but we both appreciated the architecture and I was engrossed in the statues.\n\nWe put a donation in the parish-box after taking a few photos.", "publishedDate": "2014-07-18", "language": "en", "rating": 4}, {"id": 213296320, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d2487738-r213296320-Parroquia_de_la_Mare_de_Deu_de_Betlem-Barcelona_Catalonia.html", "text": "Very easy to make a prayer stop here off of La Rambla.  A very well maintained Catholic Church with statues of the Birth of Jesus.  Glad we stopped!!!", "publishedDate": "2014-07-02", "language": "en", "rating": 5}, {"id": 201593784, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d2487738-r201593784-Parroquia_de_la_Mare_de_Deu_de_Betlem-Barcelona_Catalonia.html", "text": "Attended Sunday Mass.  Church and parishioners are wonderful. Spent a lot time looking at the art.  Would recommend.", "publishedDate": "2014-04-17", "language": "en", "rating": 5}, {"id": 196550750, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d2487738-r196550750-Parroquia_de_la_Mare_de_Deu_de_Betlem-Barcelona_Catalonia.html", "text": "A Baroque style Church that is dedicated to the Nativity and Holy Family.  Located on Las Ramblas, near Starbucks, Hotel 1898, and Le Meridien, houses beautiful carvings of Creche Scenes and is a favorite of Pilgrims at Christmastime when it is packed. Nice to stop in anytime just to see the side chapels.  Mass daily, free.", "publishedDate": "2014-03-07", "language": "en", "rating": 3}, {"id": 165527593, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d2487738-r165527593-Parroquia_de_la_Mare_de_Deu_de_Betlem-Barcelona_Catalonia.html", "text": "We wandered in here on a mooch up La Rambla and we were glad we did.  It is a beautiful example of a baroque church.  What I really liked is that it focuses on the joy of the birth of the saviour rather than death and sin.", "publishedDate": "2013-06-28", "language": "en", "rating": 4}, {"id": 158939046, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d2487738-r158939046-Parroquia_de_la_Mare_de_Deu_de_Betlem-Barcelona_Catalonia.html", "text": "The Bethlehem Church is a baroque church in the Rambla, Built by Jesuit between 1680 and 1729.\n\nIt has most sumptuous interior of all the churches in Barcelona until it was burned in the mid 1930s.\n\nThe front side facing the Rambla has a padding that extends to the bottom of the main facade, and has two doors, one is crowned by Jesus as a child the other has the image of St. John the Baptist as a child.", "publishedDate": "2013-04-27", "language": "en", "rating": 4}, {"id": 150049344, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d2487738-r150049344-Parroquia_de_la_Mare_de_Deu_de_Betlem-Barcelona_Catalonia.html", "text": "Its a bit peaceful - almost too quiet. Most people often miss this monument for its plain interior. What they do not know is that it was damaged by a bomb in the past and was rebuilt in a simpler style. When your visit this church, spend a moment to contemplate and have solitary moments. Some personal time on the usually bustling Las Ramblas", "publishedDate": "2013-01-19", "language": "en", "rating": 5}]}}]