[{"locationId": 190166, "name": "Basilica of the Sagrada Familia", "placeType": "ATTRACTION", "reviewListPage": {"reviews": [{"id": 757443272, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d190166-r757443272-Basilica_of_the_Sagrada_Familia-Barcelona_Catalonia.html", "text": "Good architecture. Very beautiful and has a lot of history inside. This is the place where everybody must visit in Spain.", "publishedDate": "2020-06-15", "language": "en", "rating": 4}, {"id": 757377632, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d190166-r757377632-Basilica_of_the_Sagrada_Familia-Barcelona_Catalonia.html", "text": "Beautifull Basilica . We took a audio guide which was enough for us, it is detailed tour with interesting facts about building this basilica. Must see when in Barcelona", "publishedDate": "2020-06-14", "language": "en", "rating": 5}, {"id": 757244790, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d190166-r757244790-Basilica_of_the_Sagrada_Familia-Barcelona_Catalonia.html", "text": "Did a guided tour. The outside of the church was mind blowing. The inside was nice but real crowded and didn't have as much character as the older cathedrals. ", "publishedDate": "2020-06-11", "language": "en", "rating": 5}, {"id": 757185515, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d190166-r757185515-Basilica_of_the_Sagrada_Familia-Barcelona_Catalonia.html", "text": "Sagrada Familia is a must! There's something when you step inside that makes you feel the warmth of this place and although the tickets aren't cheap it's definitely worth visiting. We chose the time just before closing when the sun lit the western stained glass windows and it was breathtaking!", "publishedDate": "2020-06-10", "language": "en", "rating": 5}, {"id": 755661738, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d190166-r755661738-Basilica_of_the_Sagrada_Familia-Barcelona_Catalonia.html", "text": "Give it 5 minutes.   You’re in Barcelona.  You can’t skip it.   Its really an architectural marvel with a great history and so much a part of Barcelona’s soul.   Don’t be too jaded, lonely planeteers 😑", "publishedDate": "2020-05-30", "language": "en", "rating": 5}, {"id": 755425370, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d190166-r755425370-Basilica_of_the_Sagrada_Familia-Barcelona_Catalonia.html", "text": "We were lucky we purchased tickets ahead of time.  Long lines otherwise.  We had an audio tour, which is so important as it explains so much about this unique and beautiful church, so that you understand all the intricate details and the \"whys\".  I was surprised how much we enjoyed this tour of this church both inside and out.  No other church like it!  ", "publishedDate": "2020-05-25", "language": "en", "rating": 5}, {"id": 755411925, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d190166-r755411925-Basilica_of_the_Sagrada_Familia-Barcelona_Catalonia.html", "text": "Visiting Barcelona for 4 days, it was necessary und indispensable to visit La Basilica de Sagrada Famlila.\nPlanned by Antoni Gaudi this momumental church just combines so many different types of architectural styles. \nYou are able to see it before beeing there. It shows up above most surrounding houses. Just standing in front of it makes you feel so tiny. All around are mass of people, taking pictures and enjoing the view.\nIf you bought your tickets online before you are able to enter the church in like 4 minutes. To get more information you can borrow a audio guide.\nThe first steps inside are so stunning. From outside it looks like overloaded but the inside is sober and calm. All people in it are silent and respectful. You can walk through the archways and hear your own steps. Looking up to the windows (mentioned below) introduces a wide spectrum of colours. If the sun is shining through the glasses you are able to see the whole basilica filled with coloured light.\nIf you have time and booked it before there is the opportunity to take the elevators and run up to some towers. Standing nearly on top of these towers you will get a beautiful sight over Barcelona looking from ocean to Parc Güell.\n\nIf you are planning to visit Barcelona, just take time for the Sagrada Familia. Please keep in mind that it will be clever to buy tickets before or you have to visit in not-seasonal months.\n\nI could just suggest everybody to stay a few days in Barcelona. Do not forget to sample some Tapas and good vines.", "publishedDate": "2020-05-25", "language": "en", "rating": 5}, {"id": 755307584, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d190166-r755307584-Basilica_of_the_Sagrada_Familia-Barcelona_Catalonia.html", "text": "When we were in Barcelona we went to see Gaudi's amazing Sagrada Familia. this was presented to us as one of the highlights of our trip to Spain and it certainly was and did not disappoint.  Although the outside of this church is spectacular the real beauty lies in the ornate inside with its spectacular cloolours and architecture. Building work has been ongoing for centuries and it is due tio be finally finished in about 5 years time. This is an unforgettabole sight and is an absolute must see experience in Barcelona.", "publishedDate": "2020-05-21", "language": "en", "rating": 5}, {"id": 755259336, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d190166-r755259336-Basilica_of_the_Sagrada_Familia-Barcelona_Catalonia.html", "text": "35.00 entry. Spent 2-h there. Most unusual but interesting church. I would not take children under 10-years old", "publishedDate": "2020-05-20", "language": "en", "rating": 4}, {"id": 753498912, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d190166-r753498912-Basilica_of_the_Sagrada_Familia-Barcelona_Catalonia.html", "text": "The Sagrada Familia impresses with its size and magnificence. Inside, you get impressed by the colorful mosaics and the high ceilings, each beautiful detail that is very worthwhile, even though I consider the amount charged too high.", "publishedDate": "2020-05-13", "language": "en", "rating": 4}, {"id": 753445285, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d190166-r753445285-Basilica_of_the_Sagrada_Familia-Barcelona_Catalonia.html", "text": "I've seen pictures of Sagrada Familia but they don't do it justice.  The walking tour is easy and you learn so much about this amazing building.  As beautiful as it is outside, inside is equally if not more.  We went in the off season and it was still pretty crowded, but it was certainly worth it.", "publishedDate": "2020-05-11", "language": "en", "rating": 5}, {"id": 753441433, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d190166-r753441433-Basilica_of_the_Sagrada_Familia-Barcelona_Catalonia.html", "text": "The Sagrada Familia is nothing short of amazing and absolutely the highlight of our Barcelona visit.", "publishedDate": "2020-05-11", "language": "en", "rating": 1}, {"id": 753081122, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d190166-r753081122-Basilica_of_the_Sagrada_Familia-Barcelona_Catalonia.html", "text": "No questions, just do it.  Never seen anything like it, and make sure you do the tower (elevator up and stairs down).", "publishedDate": "2020-05-01", "language": "en", "rating": 5}, {"id": 753025966, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d190166-r753025966-Basilica_of_the_Sagrada_Familia-Barcelona_Catalonia.html", "text": "I don't know if anyone would consider going to Barcelona and not visiting Sagrada Familia.  If you are, it's a mistake and you should absolutely go.  My husband and I were here in 2010 and did the tower tour, which was worth it.  When we visited in 2020 with our 8 year old son the tower tickets were sold out, so weren't able to go.  We were so happy to find ourselves back in this extraordinary place.  There were definite notable changes between our visits.  Our second visit was a weekday in February and was still absolutely packed.  (This was 3-4 weeks before Spain went on lockdown for Covid19.)", "publishedDate": "2020-04-29", "language": "en", "rating": 5}, {"id": 753022306, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d190166-r753022306-Basilica_of_the_Sagrada_Familia-Barcelona_Catalonia.html", "text": "Great inside and out. Very busy place for tourists. Crowded but the experience is worth it. Bring your  nice camera or missed a lot of wonderful scenes. People from all over the world. Will come back.", "publishedDate": "2020-04-29", "language": "en", "rating": 5}, {"id": 752994895, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d190166-r752994895-Basilica_of_the_Sagrada_Familia-Barcelona_Catalonia.html", "text": "I had the pleasure to visit Barcelona last year and especially to reach the basilica. I was always impressed by Antoni Gaudi as an architect and I am pleased that I have manèges to see his work. It is incomparable and it is an amazing modern art piece", "publishedDate": "2020-04-28", "language": "en", "rating": 5}, {"id": 752985550, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d190166-r752985550-Basilica_of_the_Sagrada_Familia-Barcelona_Catalonia.html", "text": "Amazing place to visit. Interesting story that follows \nconstruction. Very good spot for taking pictures :)", "publishedDate": "2020-04-28", "language": "en", "rating": 5}, {"id": 752974709, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d190166-r752974709-Basilica_of_the_Sagrada_Familia-Barcelona_Catalonia.html", "text": "Very beautiful architecture, inspirational and holy place.    \n\nStunning church with a great amount of history.  Took an official tour.\n\nWe booked in advance, which was great as we were timed for the tour we selected.   Just showed up about 20 minutes in advance to go through security.   \n\nConvenient Metro station right in front of the Basilica and lots of restaurants nearby. \n\nA very beautiful visit.", "publishedDate": "2020-04-27", "language": "en", "rating": 5}, {"id": 752862233, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d190166-r752862233-Basilica_of_the_Sagrada_Familia-Barcelona_Catalonia.html", "text": "This famous Church was designed by Gaudi. It has been under construction for more than 135 years. It is not expected to be completed until 2026.the spires and inside of the Church are spectacular. It is a must see if you go to Barcelona.", "publishedDate": "2020-04-23", "language": "en", "rating": 5}, {"id": 752792922, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d190166-r752792922-Basilica_of_the_Sagrada_Familia-Barcelona_Catalonia.html", "text": "What a brilliant piece of architecture....simply awe inspiring and jaw dropping masterpiece. Will definitely revisit once the cathedral is completed. You need an entire day to appreciate the beauty of this structure.", "publishedDate": "2020-04-20", "language": "en", "rating": 5}, {"id": 752739893, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d190166-r752739893-Basilica_of_the_Sagrada_Familia-Barcelona_Catalonia.html", "text": "We are not disappointed each time  we visit the Basilica. We saw it first in 1980 . It is much more completed today .  To describe it is to do it a disservice . Come and see it for yourself .The people of Barcelona are friendly and I know you will enjoy your stay. ", "publishedDate": "2020-04-18", "language": "en", "rating": 5}, {"id": 752738508, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d190166-r752738508-Basilica_of_the_Sagrada_Familia-Barcelona_Catalonia.html", "text": "Truely, one of the best sites in the world to visit.  Try to get a guide and if not able.  Get the head phones.\nLove, Love!  I will be back!", "publishedDate": "2020-04-18", "language": "en", "rating": 5}, {"id": 752714713, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d190166-r752714713-Basilica_of_the_Sagrada_Familia-Barcelona_Catalonia.html", "text": "I went on a solo trip in September last year, so not the busiest time of the year - shoulder season/months. \n\nI hadn’t purchased my ticket in advance. This was primarily because I didn’t want to be tied down to a specific date and time, in case I ended up doing something different miles away from there during the booked time! The other reason is that tickets aren’t available if you leave it too late, for example, even a week before you travel or visit Sagrada.\n\nThis is why I highly recommend purchasing a ticket in advance. *You will also avoid the long queues.* Luckily it wasn’t too bad - it being in September. I mean I still had to wait for a good 45 minutes if not more. I’ve heard the queues go round on the outside, stretching for God knows how long. Mine was bad enough. \n\nThe other benefit of booking in advance is that you can choose your time. If you’re buying on the spot, and want to get in ASAP, the next entry may be an hour or two away, if not more, as it was in my case. So, as you’ll have gathered by now, loads of time wasted by not buying online advance.\n\nFinally, it’s also cheaper. I could’ve bought the basic ticket (no audio guide) for €17 online, with the added advantage as stated above of instant entry, i.e. no queuing. Instead I had no option but to go for the only available ticket which was with the audio guide for twice the price - €34! All well worth it in the end though.\n\nHope this helped. Sorry to have kept it too long! :)", "publishedDate": "2020-04-17", "language": "en", "rating": 5}, {"id": 752704945, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d190166-r752704945-Basilica_of_the_Sagrada_Familia-Barcelona_Catalonia.html", "text": "When you put the location on your phone and it takes you through some streets, it doesn't look like you're going to arrive in a great place but then this beauty appears straight in your face and what an incredible piece of art and architecture it is. I walked around it at least 3 times and did not want to leave because it just amazed me so much and it was extremely beautiful. All the details, the atmosphere around it, truly amazing!", "publishedDate": "2020-04-17", "language": "en", "rating": 5}, {"id": 752622736, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d190166-r752622736-Basilica_of_the_Sagrada_Familia-Barcelona_Catalonia.html", "text": "Wonderful architecture, main must see whilst in Barcelona. Incredible building to take in, both inside and out. Museum worth a walk around too. I precooked our tickets and was glad I did. ", "publishedDate": "2020-04-14", "language": "en", "rating": 5}, {"id": 752602687, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d190166-r752602687-Basilica_of_the_Sagrada_Familia-Barcelona_Catalonia.html", "text": "La Sagrada Família is one of Gaudí's most famous works in Barcelona. It's a giant Basilica that has been under construction since 1882 (that's not a typing error) and it's not expected to be completed for another few years.  It’s a most see place if you visit the city. You will be blown away by its design and interpretation of how a Cathedral should look.  ", "publishedDate": "2020-04-13", "language": "en", "rating": 5}, {"id": 752585371, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d190166-r752585371-Basilica_of_the_Sagrada_Familia-Barcelona_Catalonia.html", "text": "Beautiful place! Sacred. Must see. Unbelievable architecture! So many elements present. Gaudi, what a genius!", "publishedDate": "2020-04-13", "language": "en", "rating": 5}, {"id": 752507236, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d190166-r752507236-Basilica_of_the_Sagrada_Familia-Barcelona_Catalonia.html", "text": "This is THE site to see in Barcelona. This breathtakingly beautiful building is located in the heart of Barcelona and can be seen from various vantage points throughout the city. My wife and I purchased timed tickets well in advance and were able to gain entrance smoothly. Even when the lines appear long, they move fairly quickly for those visitors who have purchased tickets in advance. Tickets are shown, visitors are assigned to a small group with a guide and “whisper radios are provided. A magnificent as the complex appears from the distance, see both the exterior up close with the amazing detail as well as the stunning interior is almost indescribable.\n\nThe interior has gorgeous color from the beautiful stained glass windows. The colors were particularly lively on the sunny day that I visited.\n\nDuring the tour, I learned that Antoni Gaudi, one of Catalonia’s preeminent citizens designed this masterpiece of a building. While the construction started in 1882, construction has continued since; it is anticipated that the construction will be completed in 2026.", "publishedDate": "2020-04-11", "language": "en", "rating": 5}, {"id": 752461766, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d190166-r752461766-Basilica_of_the_Sagrada_Familia-Barcelona_Catalonia.html", "text": "One of the best church-monuments I've ever visited!! Outside is not enough!! You have to see the inside as well!! Book your tickets in advance!!! Unique experience and one of its kind monument!!! Just stunning!!! ", "publishedDate": "2020-04-10", "language": "en", "rating": 5}, {"id": 752457381, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d190166-r752457381-Basilica_of_the_Sagrada_Familia-Barcelona_Catalonia.html", "text": "Unfortunately the building is still under construction but can be explored 75% inside. It’s worth paying the ticket if you’re a fan of building architectural design. Otherwise from my perspective, doesn’t worth the price until is completely done. ", "publishedDate": "2020-04-09", "language": "en", "rating": 3}, {"id": 752364418, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d190166-r752364418-Basilica_of_the_Sagrada_Familia-Barcelona_Catalonia.html", "text": "There is no question that the Basilica a must see when you visit Barcelona and there are hundreds of amazing corners, views and pieces you have to compliment, no question asked here BUT I did not feel welcome. I know that security is always a priority but every time you asked someone, the answer was very harsh. Overall you had to pay a good amount of money but there was no appreciation. Maybe something to consider.", "publishedDate": "2020-04-07", "language": "en", "rating": 4}, {"id": 752354404, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d190166-r752354404-Basilica_of_the_Sagrada_Familia-Barcelona_Catalonia.html", "text": "We booked this 2 weeks in advance on the Sagrada website so we could get one of the limited tickets into the tower (unfortunately we got there and the lift had broke down and we couldn't rebook which was really disappointing).\n\nIf you have been to Barcelona then it is impossible to miss the Sagrada Familia, from the outside I can understand people not liking its distinct style (my wife for example wasn't impressed), I personally found it captivating and found somethng to look at from every angle.\n\nWhen you get inside it's almost a total contrast to the jagged harsh outer facade, inside when the lights hit the stained glass windows you are greeted with some fantastic displays of soft light throughout the building.  \n\nIf it is completed in 2026 I will certainly come back and see it in all its glory.  At 33euro per person (including one of the towers, which we got refunded) it certainly isn't cheap and probably only for people who have a real interest in architecture or religion.\n\nA stunning building which to be fully appreciated needs to be seen inside and out and something you shouldn't miss if in Barcelona.", "publishedDate": "2020-04-07", "language": "en", "rating": 5}, {"id": 752350020, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d190166-r752350020-Basilica_of_the_Sagrada_Familia-Barcelona_Catalonia.html", "text": "Whilst not an avid visitor of churches this is a must for anyone visiting Barcelona. The story behind the building is amazing but the detail in the architecture is incredible.", "publishedDate": "2020-04-07", "language": "en", "rating": 5}, {"id": 752328256, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d190166-r752328256-Basilica_of_the_Sagrada_Familia-Barcelona_Catalonia.html", "text": "Buy your ticket in advance and get the audio guide.  The audio guide adds a tremendous amount of value to what you are seeing.  You will need to look down and look up to see all of there is in this magical Basilica.  I can't wait to return in five years when they think it will be finished.", "publishedDate": "2020-04-06", "language": "en", "rating": 5}, {"id": 752258645, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d190166-r752258645-Basilica_of_the_Sagrada_Familia-Barcelona_Catalonia.html", "text": "So we actually Reserved the tower viewing months ahead of time and the day of our visit were told the towers weren't allowing anyone due to maintenance. We were very...make that extremely disappointed because we were told this the day of and we were told we would be getting a credit for the portion of the towers, however we are still waiting on that credit. La Sagrada Familia is a beautiful cathedral and definitely a place not to miss when visiting Barcelona. We cannot wait to come back once the towers are completed by May 2026. But that is a long time away....", "publishedDate": "2020-04-04", "language": "en", "rating": 2}, {"id": 752217726, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d190166-r752217726-Basilica_of_the_Sagrada_Familia-Barcelona_Catalonia.html", "text": "We had a stellar cool November day walking around La Sagrada Familia, including strolling nearby neighborhoods, and stopping in for a vegan lunch at La T. For hours we found new and fascinating details in the surreal architecture which is constantly changing during it's 140 year construction.", "publishedDate": "2020-04-03", "language": "en", "rating": 5}, {"id": 752167711, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d190166-r752167711-Basilica_of_the_Sagrada_Familia-Barcelona_Catalonia.html", "text": "This was my second visit to the basilica, which is my favourite basilica in the world. It's just so unique and beautiful, multi-faceted and intricate. The inside is the best bit, with light reflecting from the large colourful windows and the high organic ceilings make it very special. I also paid for the highlights tour this time, which was very reasonably priced and gave me some extra insight into the meaning behind the wonderful imagery incorporated in the facades. I 100% recommend.", "publishedDate": "2020-04-02", "language": "en", "rating": 5}, {"id": 752152046, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d190166-r752152046-Basilica_of_the_Sagrada_Familia-Barcelona_Catalonia.html", "text": "Dont know what else to say...its unique and so beautiful. A must visit in Barcelona Such an amazing piece of architecture and something to be marvelled at. A nice little park opposite is a good way to soak in the atmosphere", "publishedDate": "2020-04-02", "language": "en", "rating": 5}, {"id": 752133094, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d190166-r752133094-Basilica_of_the_Sagrada_Familia-Barcelona_Catalonia.html", "text": "Simply amazing, the masterpiece of Anton Gaudí, Next time we hope to visit inside the Cathedral, Anyway, worths visit and see, if you want to go inside, buy in internet before. ", "publishedDate": "2020-04-01", "language": "en", "rating": 4}, {"id": 752042782, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d190166-r752042782-Basilica_of_the_Sagrada_Familia-Barcelona_Catalonia.html", "text": "Had a nice visit to the cathedral from a hop on hop off bus and had lunch and took a lovely photo but we couldn't look inside ", "publishedDate": "2020-03-30", "language": "en", "rating": 4}, {"id": 752023591, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d190166-r752023591-Basilica_of_the_Sagrada_Familia-Barcelona_Catalonia.html", "text": "Gosh, maybe 12 years between visits and seeing documentaries on TV in between, the ground floor is now a special and beautiful place of worship  and not a construction site as it was on my last visit. It is so hard to comprehend the difference. \nAs a Kiwi, I feel a special bond with the Basilica, because of all the involvement New Zealand Architect Burry who was instrumental in the design and build.  How proud am I to have a New Zealander so involved in this magnificent building, something I'm sure people from many countries feels.\nI did my research and we went in early evening to experience the sun light up the stained glass and we were not disappointed.  The lift to view the nativity facade and the easy 400 spiral steps down.  Last time we climed up and then down - the legs were like jelly at the bottom.\nOur visit also timed so that we could gain entry to the crypt which opens for just an hour a day to the public.  You have to leave the Sagrada Familia to enter the crypt, but we arrived in time to simply work in.  What a special place.\nMy bucket list wish is to see this magnificent place of worship once more time, completed and free of scaffold - I imagine it will be a rare occasion as maintenance will be ongoing.", "publishedDate": "2020-03-30", "language": "en", "rating": 5}, {"id": 751982447, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d190166-r751982447-Basilica_of_the_Sagrada_Familia-Barcelona_Catalonia.html", "text": "Absolutely amazing didn’t get tickets in advance as lines not that long in March but would recommend doing so during main tourist season.\nThe colours and light inside were so beautiful. Construction still ongoing could be completed by 2026/30", "publishedDate": "2020-03-29", "language": "en", "rating": 5}, {"id": 751938508, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d190166-r751938508-Basilica_of_the_Sagrada_Familia-Barcelona_Catalonia.html", "text": "Though unfinished, the temple is a Basilica with Art Nouveau architecture & 18 towers.  The Nativity facade depicts birth of Jesus.  Passion facade illustrates suffering, death & resurrection of Jesus.  Interior is 90m long, 60m high.  Decorated ceiling, stained-glass windows, apse with unusual Crucifix rendered as a canopy with lanterns are remarkable.  Open daily, 0900 - 2000 hours.  Metro stop Sagrada Familia, L2 Purple & L5 Blue lines.  The audio guide is useful to understand the symbolism details in each facade and throughout the church.  Book tickets online, in advance, to avoid spending time in queues.  The security check at the entrance is quite thorough.  Best time to go would be around 0930 hours.  Attend mass at 1800 to hear the church organ.  Ticket cost €29 including audio guide.", "publishedDate": "2020-03-28", "language": "en", "rating": 5}, {"id": 751931242, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d190166-r751931242-Basilica_of_the_Sagrada_Familia-Barcelona_Catalonia.html", "text": "My teen daughter and I visited in early March.  We did not take a tour but we did attend the International Service on a Sunday morning.  We were in queue by 8:15am and were able to get in.  The church is beautiful inside and out.  Next time I would schedule a tour following the service.  Definitely worth a visit!", "publishedDate": "2020-03-27", "language": "en", "rating": 5}, {"id": 751896074, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d190166-r751896074-Basilica_of_the_Sagrada_Familia-Barcelona_Catalonia.html", "text": "Amazing experience visiting Barcelona \nFlywebmakers are team who works hard and also travel around the world \nAll advertising what we did in Barcelona was a great impact for local businesses small and big ones \nWe see us soon here in sagrada familia ", "publishedDate": "2020-03-27", "language": "en", "rating": 5}, {"id": 751873533, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d190166-r751873533-Basilica_of_the_Sagrada_Familia-Barcelona_Catalonia.html", "text": "The epic construction should be completed by 2030?  It is 70% completed.  It is so unusual and beautiful.  Gaudi's architecture is so beautiful and he painted with light.", "publishedDate": "2020-03-26", "language": "en", "rating": 5}, {"id": 751806210, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d190166-r751806210-Basilica_of_the_Sagrada_Familia-Barcelona_Catalonia.html", "text": "I went to Barcelona for the most part to see Gaudi architecture. I’ve been very curious about his work, but I did not expect to breakdown in tears at the beauty inside the Sagrada Família. It’s like the outside of the cathedral is the religious face we present to the outside world, and the inside is our soul. It’s not a traditional sanctuary and that makes it even more touching for me. ", "publishedDate": "2020-03-25", "language": "en", "rating": 5}, {"id": 751800168, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d190166-r751800168-Basilica_of_the_Sagrada_Familia-Barcelona_Catalonia.html", "text": "If you had limitless funds and you worked for Disney, this cathedral is what you'd build.  The structure is immense, and bright, and, really, more of a sight (like the Eiffel Tour) than anything \"real.\"", "publishedDate": "2020-03-25", "language": "en", "rating": 2}, {"id": 751743256, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d190166-r751743256-Basilica_of_the_Sagrada_Familia-Barcelona_Catalonia.html", "text": "We were amazed by this beautiful building and were totally gobsmacked how wonderful it is. The surrounding area was clean and safe. Unfortunately it was closed due to the lockdown, but will visit again.", "publishedDate": "2020-03-24", "language": "en", "rating": 5}, {"id": 751706855, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d190166-r751706855-Basilica_of_the_Sagrada_Familia-Barcelona_Catalonia.html", "text": "The cornerstone of the Basilica of the Sagrada Familia was laid in 1882, but Gaudi took over the design and construction in 1883.  From 1914 until his death in 1926, he devoted all of his time to this project.  Because no government funds have been used, the church continues to be built very slowly—relying on donations.  In 2005 UNESCO declared it a “World Heritage Site,” and in 2010 Pope Benedict XVI consecrated it as a minor basilica. Apparently, Gaudi originally neglected to get a building permit, so now the church has acquired millions of dollars in fines, in addition to the continued building costs.  The entrance fees from 3,000,000 visitors each year + donations keep the project going.  Although the façade did seem like it had developed more since our last visit (over 20 years ago), we agreed that it still looks like a big mess, with cranes sticking out everywhere.  The “glory façade” (front section) does have the colorful mosaic tops and interesting tall spires characteristic of Gaudi, but the back really has no color—all muddy brown—and there are so many things going on that it is hard to focus.  We did not try to visit the inside, since there were still large crowds—even at 7:15 pm.   Despite all the criticism,  it is an awe-inspiring building, the likes of which you will not see anywhere else in the world—so definitely a must-see in Barcelona.", "publishedDate": "2020-03-23", "language": "en", "rating": 4}, {"id": 751705290, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d190166-r751705290-Basilica_of_the_Sagrada_Familia-Barcelona_Catalonia.html", "text": "This building is so different and contains so much more than one can see on a single visit. You can't help but be inspired by the scope of it, maybe its not erected to the glory of God but it sure reflects the glory of Gaudi's vision.", "publishedDate": "2020-03-23", "language": "en", "rating": 5}, {"id": 751695267, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d190166-r751695267-Basilica_of_the_Sagrada_Familia-Barcelona_Catalonia.html", "text": "This place is completely stunning - it's sheer size, the colour, the sculptures, the atmosphere are all second to none.", "publishedDate": "2020-03-23", "language": "en", "rating": 5}, {"id": 751677464, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d190166-r751677464-Basilica_of_the_Sagrada_Familia-Barcelona_Catalonia.html", "text": "I did not go in, but just went on a walking tour on the outside. It's a grand and impressive building. Each tiny detail has a story behind it. I can see why it took so long to built - Gaudi is just too brilliant and architects couldn't catch up! I hope it will be completed within my lifetime as I want to go back to see the full grand masterpiece. Nevertheless, this is still a must-see if you are in Barcelona. It can be very crowded during peak hour, so beware of your belongings while admiring the building.", "publishedDate": "2020-03-23", "language": "en", "rating": 5}, {"id": 751620560, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d190166-r751620560-Basilica_of_the_Sagrada_Familia-Barcelona_Catalonia.html", "text": "Go by Metro. Easy to get too. You walk up the steps of the Metro and you walk into the backs of legs at the top of the steps. You think why are you not getting out the way...then you turn around on the flat of the top step which is the the pavement and you look up and simply say Wow...just wow. Honestly it's beautiful. You must go. The prices for going in are set across the city. Best to buy in advance to skip queues. \n\nThe architecture of Barcelona is amazing and the metro is easy to get around. \n\nThere's a lovely park opposite too. \n\nLots of nice eateries. Best move away a bit from the site to get the cheapest prices. Closer to the tourist sites...higher the prices.", "publishedDate": "2020-03-22", "language": "en", "rating": 5}, {"id": 751614526, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d190166-r751614526-Basilica_of_the_Sagrada_Familia-Barcelona_Catalonia.html", "text": "It's hard to put into words the majestic splendor of Sagrada Familia. On a recent trip to Barcelona, we toured the Basilica and vowed to return when it is \"finished\" in 2026. The audio tour gave just the right amount of information to help us understand what went on (and what is still going on) to bring Gaudi's vision to life. ", "publishedDate": "2020-03-22", "language": "en", "rating": 5}, {"id": 751608858, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d190166-r751608858-Basilica_of_the_Sagrada_Familia-Barcelona_Catalonia.html", "text": "Lovely and worth visiting but you won’t need more than an hour to see it all. Security was quick and efficient :)", "publishedDate": "2020-03-22", "language": "en", "rating": 4}, {"id": 751599300, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d190166-r751599300-Basilica_of_the_Sagrada_Familia-Barcelona_Catalonia.html", "text": "If you are lucky, you will get in. I strongly recommend that you book a tour, otherwise, you may not be able to find tickets for the day of your visit.  ", "publishedDate": "2020-03-22", "language": "en", "rating": 5}, {"id": 751396037, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d190166-r751396037-Basilica_of_the_Sagrada_Familia-Barcelona_Catalonia.html", "text": "Inside was really mesmerising , though the crowd was crazy, and the queue going inside the cathedral is very long . ", "publishedDate": "2020-03-19", "language": "en", "rating": 4}, {"id": 751383772, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d190166-r751383772-Basilica_of_the_Sagrada_Familia-Barcelona_Catalonia.html", "text": "Every time I come to Barcelona I must visit this place. I love to sit by the pond and enjoy this masterpiece! Come and check for yourself! ", "publishedDate": "2020-03-19", "language": "en", "rating": 5}, {"id": 751367900, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d190166-r751367900-Basilica_of_the_Sagrada_Familia-Barcelona_Catalonia.html", "text": "Words can’t accurately describe it. You have to see it with your own eyes! It’s breathtaking and awe-inspiring! Go! ", "publishedDate": "2020-03-18", "language": "en", "rating": 5}, {"id": 751295334, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d190166-r751295334-Basilica_of_the_Sagrada_Familia-Barcelona_Catalonia.html", "text": "We had been there in 2007 when the inside of it was all under construction with scaffolding everywhere. So to see it completed with the sun streaming through the stained glass shining on the white pillars was amazing! Definitely a place to see as it is the only cathedral being built in modern times and gives you a perspective of how these things could have been built in ancient times without the cranes and modern equipment.  ", "publishedDate": "2020-03-18", "language": "en", "rating": 5}, {"id": 751289820, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d190166-r751289820-Basilica_of_the_Sagrada_Familia-Barcelona_Catalonia.html", "text": "A church that makes you loose your breath. Outside it is huge and really stunning. The first times I saw it I did not know so much. When the story was told it became so much more interesting. Inside Sagrada it feels like a fairytale with all fantastic colours", "publishedDate": "2020-03-18", "language": "en", "rating": 4}, {"id": 751214618, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d190166-r751214618-Basilica_of_the_Sagrada_Familia-Barcelona_Catalonia.html", "text": "It’s still under construction, stunningly beautiful!  We didn’t go inside due to too many visitors, the wait was so long..... we just admired from outside, walked around the block.", "publishedDate": "2020-03-17", "language": "en", "rating": 4}, {"id": 751211855, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d190166-r751211855-Basilica_of_the_Sagrada_Familia-Barcelona_Catalonia.html", "text": "A must see to truly appreciate the scale and architecture, easy access from the Greenline tour bus route ", "publishedDate": "2020-03-17", "language": "en", "rating": 5}, {"id": 751205546, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d190166-r751205546-Basilica_of_the_Sagrada_Familia-Barcelona_Catalonia.html", "text": "Last year they were almost finishg the details and the church is worth seeing.. amazing art around the church", "publishedDate": "2020-03-17", "language": "en", "rating": 5}, {"id": 751149217, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d190166-r751149217-Basilica_of_the_Sagrada_Familia-Barcelona_Catalonia.html", "text": "I visited Barcelona in March for the third time and this was my second visit to the sagrada Família (the first being in 2008). It is such an amazing place to visit and the number one must see in Barcelona in my opinion. It was extremely windy the day we visited and so for health and safety we were unable to visit the towers which was disappointing however the weather can not be controlled and it just means we will have to visit again! The tickets are easily purchased online outside of the venue full details are listed and I would recommend only purchasing tickets from the official website or at the ticket office as these are the cheapest! Do pay extra for the audio guide it was so worth it and we also purchased the ticket which included access into Gaudi’s house in Parc Güell, that was worth a visit if you are a gaudi fan.  ", "publishedDate": "2020-03-16", "language": "en", "rating": 5}, {"id": 751143760, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d190166-r751143760-Basilica_of_the_Sagrada_Familia-Barcelona_Catalonia.html", "text": "I hadn’t seen any pictures before walking in for the first time and it took me ten minutes to realise that I was just standing in open-mouthed awe at the spectacular interior \nEvery tourist site in Barcelona is expensive to visit however the Sagrada is well worth the money. The outside promises much and inside certainly delivers", "publishedDate": "2020-03-16", "language": "en", "rating": 5}, {"id": 751021026, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d190166-r751021026-Basilica_of_the_Sagrada_Familia-Barcelona_Catalonia.html", "text": "The Basilica is really overwhelming. To me, the most magnificent part was once you get inside: the way the light comes from the vitraux and plays with the space is unique. You feel so humble, so overwhelmed, even if you are not a catholic, you just want to seat in the praying section and just be. The size of everything is actually fulfiling its purpose: to make you feel small and insignificant in front of God.\nAlong with this, I must note the strict security check to get in - which is necessary in such places - as well as the priority and assistance for families with strollers.\nIt is a treat for architecture junkies: you can see so many things combined that it's hard to choose a favourite. My favourite however was the passion facade beeing plain and simple, carved in such a way as to resemble the bones of a skeleton. The Veil of Veronica is so engrossing that conveys the essence of the whole theme.\nDon't miss when in Barcelona!!", "publishedDate": "2020-03-15", "language": "en", "rating": 5}, {"id": 751013183, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d190166-r751013183-Basilica_of_the_Sagrada_Familia-Barcelona_Catalonia.html", "text": "A must see.  I could spend hours maybe days admiring the beauty of every corner of this composite of masterpieces", "publishedDate": "2020-03-15", "language": "en", "rating": 5}, {"id": 751008512, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d190166-r751008512-Basilica_of_the_Sagrada_Familia-Barcelona_Catalonia.html", "text": "Simply an amazing work of architecture by an amazing cultural figure in Barcelona. If you go to Barcelona and do not see Sagrada Familia, you maybe shouldn't bother going to Barcelona. ", "publishedDate": "2020-03-15", "language": "en", "rating": 5}, {"id": 751007956, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d190166-r751007956-Basilica_of_the_Sagrada_Familia-Barcelona_Catalonia.html", "text": "Must have visited this cathedral 3 times and of those two wines we’ve purchased tickets to go up the passion tower. Both times the towers have been shut, once due to winds and once due to electricity outage. Fair enough I guess but when you keep having to pay to see the cathedral you’ve already seen multiple times it gets a bit frustrating.\nThe cathedral is simply amazing. I can’t think of a more beautiful cathedral anywhere. You can easily lose a couple of hours here. Try and take it all in. There is so much to see it’s amazing ", "publishedDate": "2020-03-15", "language": "en", "rating": 5}, {"id": 750992622, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d190166-r750992622-Basilica_of_the_Sagrada_Familia-Barcelona_Catalonia.html", "text": "Beautiful nature, memorable places. We know everything about this country now. Thanks to the tour.multi-faceted, affordable vacation in this city. It was nice to learn about the sights of the area", "publishedDate": "2020-03-15", "language": "en", "rating": 5}, {"id": 750986103, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d190166-r750986103-Basilica_of_the_Sagrada_Familia-Barcelona_Catalonia.html", "text": "Couldn’t actually get inside since the meek and mild corona virus had asked for most of Spain to be shutdown. Pity really since the outside was just breathtaking.", "publishedDate": "2020-03-15", "language": "en", "rating": 5}, {"id": 750966536, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d190166-r750966536-Basilica_of_the_Sagrada_Familia-Barcelona_Catalonia.html", "text": "In love with this place! The most amazing cathedral ever seen.\nI can say it worth every penny to go thete to visit.", "publishedDate": "2020-03-15", "language": "en", "rating": 5}, {"id": 750962025, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d190166-r750962025-Basilica_of_the_Sagrada_Familia-Barcelona_Catalonia.html", "text": "... to buy a ticket to see the Basilica inside even plus visting the tower is always worth the money. This Basilica is just AMAZING.", "publishedDate": "2020-03-15", "language": "en", "rating": 5}, {"id": 750960588, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d190166-r750960588-Basilica_of_the_Sagrada_Familia-Barcelona_Catalonia.html", "text": "From outside it´s already amazing, but from inside it´s even more inspiring and of course always a MUST to visit it inside AND outside.", "publishedDate": "2020-03-15", "language": "en", "rating": 5}, {"id": 750959946, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d190166-r750959946-Basilica_of_the_Sagrada_Familia-Barcelona_Catalonia.html", "text": "What a fantastic beautiful interesting work of art, I was in awe of the many many details, the amazing colours coming through from the stained glass windows just takes your breath away, a must absolutely visit.", "publishedDate": "2020-03-15", "language": "en", "rating": 5}, {"id": 750880516, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d190166-r750880516-Basilica_of_the_Sagrada_Familia-Barcelona_Catalonia.html", "text": "Easily accessible via public transportation. Purchase tickets online to avoid waiting in long lines. ", "publishedDate": "2020-03-14", "language": "en", "rating": 5}, {"id": 750880222, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d190166-r750880222-Basilica_of_the_Sagrada_Familia-Barcelona_Catalonia.html", "text": "Don't miss this Wonder of the World. Its incrediable. Do look online to book in aadvance and investigate the different types of tickets that include tower or other attractions at Guell Park - decide if you want to include as cheaper at this point. We did'nt", "publishedDate": "2020-03-14", "language": "en", "rating": 5}, {"id": 750880053, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d190166-r750880053-Basilica_of_the_Sagrada_Familia-Barcelona_Catalonia.html", "text": "This is not to be missed. Its a wonder of the World. Plan your trip and look online and decide what ticket you want. It is cheaper to buy beforehand and then you just queue, or you can go round the otherside of the building and buy on day for a little more. Its not too much but may mean you cannot include the tower if thats what you want. We didnt include as no slots left though inside you can book tower sep but may mean a long wait for available slot. Tickets can include others attractions at Guell Park but we didnt do this so investigate what they are and whether worth it or what you want to do. The Park itself is wonderful for a long stroll around and take a picnic", "publishedDate": "2020-03-14", "language": "en", "rating": 5}, {"id": 750875966, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d190166-r750875966-Basilica_of_the_Sagrada_Familia-Barcelona_Catalonia.html", "text": "There are just some things in life that you can't believe your eyes...this was one of them for our group.  When we entered we all just stood there with tears in our eyes...need I say more ;) Enjoy your visit!", "publishedDate": "2020-03-14", "language": "en", "rating": 5}, {"id": 750868654, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d190166-r750868654-Basilica_of_the_Sagrada_Familia-Barcelona_Catalonia.html", "text": "I had purchased tickets online to tour the basilica but unfortunately we didn’t get to go inside due to safety concerns with the Coronavirus. We still went to see this fabulous structure. I did some reading online before going so appreciated each facade and tower. So incredibly beautiful.", "publishedDate": "2020-03-14", "language": "en", "rating": 5}, {"id": 750844312, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d190166-r750844312-Basilica_of_the_Sagrada_Familia-Barcelona_Catalonia.html", "text": "We loved visiting the Basilica. It was easy to access since we went during low season. We bought our tickets in advance with a set time to enter the basilica. It was worth it. Great experience. There’s great cafes and restaurants to grab a bite. You can literally spent hours in that area. ", "publishedDate": "2020-03-14", "language": "en", "rating": 5}, {"id": 750835767, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d190166-r750835767-Basilica_of_the_Sagrada_Familia-Barcelona_Catalonia.html", "text": "i recommend to book a guided tour and enjoy your visit. The building inside and outside beautiful. Read about Gaudi and Subirachs. You will love it. Online booking is important.", "publishedDate": "2020-03-14", "language": "en", "rating": 5}, {"id": 750825714, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d190166-r750825714-Basilica_of_the_Sagrada_Familia-Barcelona_Catalonia.html", "text": "It was very beautiful and historic\nIt had great architecture,The entrance to the church was 30 euros and was worth it.", "publishedDate": "2020-03-14", "language": "en", "rating": 5}, {"id": 750822681, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d190166-r750822681-Basilica_of_the_Sagrada_Familia-Barcelona_Catalonia.html", "text": "This a wierd yet wonderful building and a little mad to the size and extent. Well worth a visit even if it's only to look round the outside.\nExpensive to go in try to book on line on the official website a day or so before the visit for cheaper tickets around 23 euros bit they go very quickly. It gets very busy so keep your belongings safe unfortunately thieves and pick pockets operate all over Barcelona.don't let this put you off just be careful and enjoy", "publishedDate": "2020-03-14", "language": "en", "rating": 5}, {"id": 750773103, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d190166-r750773103-Basilica_of_the_Sagrada_Familia-Barcelona_Catalonia.html", "text": "I have never seen anything like this in my life and I doubt I ever will again. However, the entire time I was in there I couldn’t help wondering how many starving, destitute people could be helped with the money being ploughed into this endless building project. ", "publishedDate": "2020-03-13", "language": "en", "rating": 4}, {"id": 750768933, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d190166-r750768933-Basilica_of_the_Sagrada_Familia-Barcelona_Catalonia.html", "text": "Must see a giant sculpture from Gaudí. At 12:00 noon you listen a monks pray from cassette. Reserve tickets on line. \n", "publishedDate": "2020-03-13", "language": "en", "rating": 5}, {"id": 750762583, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d190166-r750762583-Basilica_of_the_Sagrada_Familia-Barcelona_Catalonia.html", "text": "Such an amazing place - such a shame that we couldn’t go in as it was on corona virus lock down. Outside is remarkable -\nSuch a beautiful place", "publishedDate": "2020-03-13", "language": "en", "rating": 5}, {"id": 750753872, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d190166-r750753872-Basilica_of_the_Sagrada_Familia-Barcelona_Catalonia.html", "text": "This a must, every where you look is spectacular. Interesting & easy to reach. Too windy to go up the towers the day we was there. Book on the day is my tip. This can be done online when you arrive. If not booked on the official site refunds are not given. Don’t use the Booths on las Ramlas they charge more.", "publishedDate": "2020-03-13", "language": "en", "rating": 5}, {"id": 750734390, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d190166-r750734390-Basilica_of_the_Sagrada_Familia-Barcelona_Catalonia.html", "text": "This was one place that we both wanted to visited in Barcelona. And we weren’t disappointed. The Basilica was a breath taking sight to behold. And that was just the outside! \n\nWe bought tickets on line and got the audio guide which I recommend is worth getting as it fully explains about the history of the building and the on going construction of the Basilica, though it’s worth getting the tickets before you visit. There is a Metro stop solely for the Basilica. Entry to the sight is through security similar to airport security.\n\nThe audio guide builds you up to the inside. And once inside words could not describe the stunning beauty and peaceful tranquility. Colours shone through the windows. Internally was bright and spacious. It was a surprise to find a crypt inside the Basilica. \n\nThe stone carvings were life like and were in different architectural styles.\n\nThis is really a do not miss sight. The only thing that surprised us was the towers aren’t as tall as you think.\n\nOne word of warning. There are numerous beggars around. The cynical part of me feels they are trying to play on some visitors religious beliefs to donate money. ", "publishedDate": "2020-03-13", "language": "en", "rating": 5}, {"id": 750732066, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d190166-r750732066-Basilica_of_the_Sagrada_Familia-Barcelona_Catalonia.html", "text": "The basilica is simply breathtaking and awe inspiring in its beauty and spiritual atmosphere. The Nativity facade is so full  symbols of joy and life while the Passion facade drives home the intensity and pain of the crucifixion.  Even with so many people around one can  actually pray and be inspired. The stained glass fills the place with light. The pillars make you feel like walking through a forest . The tower access may be difficult for some who have mobility problems , claustrophobic or have fear of heights. Going up is easy with the elevator but going down is a challenge  with circular stairs that are not always well lighted .", "publishedDate": "2020-03-13", "language": "en", "rating": 5}, {"id": 750695588, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d190166-r750695588-Basilica_of_the_Sagrada_Familia-Barcelona_Catalonia.html", "text": "I spent the day here for my birthday and boy will it be one to remember!  I had half an hour to appreciate the beautiful interior before heading up the Nativity tower. As I went up at 9.30 there was no queue. Once out of the lift I took in the beautiful views before making my way down the steps. I did the steps because I thought since I’m here I might as well but in all honesty if I could do it over I wouldn’t. If your claustrophobic and have a bit of vertigo then I definitely don’t recommend it - never the less, it all added to the experience however it was a relief when I finally got to the bottom! Please note that you are asked to put your bag in a locker before going up in the lift so try to have a €1 coin on you for this.  It might also help to remember to take your water out of your bag to bring it up with you / I forgot and really could have done with a couple of sips on the way down.\nMake sure that if you have booked a time slot to enter the church in the morning that you stay until afternoon!  My time slot was 9am however I was still there at 12pm and I’m so glad because if I’d of left earlier I would have missed the stunning colours that come through the stained glass windows - it’s magnificent and a must see!  I’m still glad I booked the early slot to avoid the crowds but if you’re short on time and can only do either morning or afternoon then it’s a no brainier, afternoon is a must to see the church lit up in all it’s beauty:-)\nAs I wanted to explore at my own leisure I chose I was happy to have the audio guide included in my ticket. It was very informative however I found that I was so overwhelmed by the different aspects of the church that I would must what was being said and found myself having to replay a let of the parts twice. If you’re not pushed for time, I would recommend exploring the church twice. First without switching the audio guide on so you can digest everything at your own free will and then second time round with the audio guide playing.  I saw a lot of people holding the guide to their ear to listen so I’m not sure if anyone realises that if you have a pair of headphones or earphones on you that you listen to your phone with you can plug those in, hang the guide around your neck and bobs your uncle your hands free!\nI would definitely recommend carrying a lot of snacks from you, maybe even bringing a packed lunch? I was there for many hours and found it came in handy and there are benches along the side of the church where you can sit if you need a break.\nAt the end of the tour there is a museum which I would say allow yourself about an hour to an hour and a half to explore. It is very very informative so do not miss this - on one hand I almost feel like it should be done first before viewing the church in order to really appreciate it and gain the background thats needed to really appreciate it.\nIt’s a truly beautiful place. Enjoy!", "publishedDate": "2020-03-13", "language": "en", "rating": 5}, {"id": 750687642, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d190166-r750687642-Basilica_of_the_Sagrada_Familia-Barcelona_Catalonia.html", "text": "A must see Catherdral that is the hot spot in Barcelona. The constuction that began on 19th March 1882 is still nearing completion while the famous architect Antonio Gaudi passed away during  this period in 1926. Also know for this reason as the unfinished cathedral, the work is still going on and is expected to be completed on the 100 th year of Antoni Gaudi's anniversary which is in the year 2026.   ", "publishedDate": "2020-03-12", "language": "en", "rating": 5}, {"id": 750646298, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d190166-r750646298-Basilica_of_the_Sagrada_Familia-Barcelona_Catalonia.html", "text": "This is a must see and the absolute highlight of Barcelona. This masterpiece of Antoni Gaudi is perhaps the most unusual Catholic Church you will ever visit. Gaudi devoted almost 40 years of his life to this cathedral and after over 140 years of construction it should be finished by 1926.  Get your tickets in advance either online or through your hotel concierge. It will save you time. Lines were short in March as tourists are traveling less. You can also get a combination ticket with Park Gruel.", "publishedDate": "2020-03-12", "language": "en", "rating": 5}, {"id": 750644364, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d190166-r750644364-Basilica_of_the_Sagrada_Familia-Barcelona_Catalonia.html", "text": "This is a place that you must visit!!!! The most beautiful temple I ve ever seen!!!! This is the temple of the temples!!!", "publishedDate": "2020-03-12", "language": "en", "rating": 5}, {"id": 750643690, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d190166-r750643690-Basilica_of_the_Sagrada_Familia-Barcelona_Catalonia.html", "text": "My experience of my visit la sagrada familia was so perfect!!! This the most beautiful temple I’ve ever visited! The temple of the temples, must see !!!", "publishedDate": "2020-03-12", "language": "en", "rating": 5}, {"id": 750599275, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d190166-r750599275-Basilica_of_the_Sagrada_Familia-Barcelona_Catalonia.html", "text": "Previous visit to Barcelona was 15 years ago returned with my son to celebrate his 40th birthday - on previous visit some years ago the Familiar Segrada was covered in scaffolding & I did not visit the interior - on this occasion the were a couple of cranes still present but no scaffolding - did the audio tour of the interior - WOW stunning! Crypt not accessible but what a WOW factor - such a visionary architect & pleased you see completion proposed for Gaudi’s 100th anniversary of his death in 2016 - do not visit without venturing inside as well - truly worth the entrance fee & will astound you!", "publishedDate": "2020-03-12", "language": "en", "rating": 5}, {"id": 750577564, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d190166-r750577564-Basilica_of_the_Sagrada_Familia-Barcelona_Catalonia.html", "text": "This place is amazing !  Go early like 830am. Lots of coffee and pastries shops all around.  Also Five Guys Burgers, McD etc  . ", "publishedDate": "2020-03-12", "language": "en", "rating": 5}, {"id": 750575249, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d190166-r750575249-Basilica_of_the_Sagrada_Familia-Barcelona_Catalonia.html", "text": "This is the most wonderful thing which I have seen in all my life. When you enter... OMG! Tears in the eyes..", "publishedDate": "2020-03-12", "language": "en", "rating": 5}, {"id": 750513920, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d190166-r750513920-Basilica_of_the_Sagrada_Familia-Barcelona_Catalonia.html", "text": "Such a beautiful church. We were in complete awe of how grand & how much detail has gone into it. Definitely check out the museum on the bottom floor. The museum was such a great way to get additional information regarding the story and background.", "publishedDate": "2020-03-11", "language": "en", "rating": 5}, {"id": 750509627, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d190166-r750509627-Basilica_of_the_Sagrada_Familia-Barcelona_Catalonia.html", "text": "I have seen many cathedrals and and basilicas but this one tops them all.  You MUST do the audio tour.  ", "publishedDate": "2020-03-11", "language": "en", "rating": 5}, {"id": 750505770, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d190166-r750505770-Basilica_of_the_Sagrada_Familia-Barcelona_Catalonia.html", "text": "What a gorgeous church.  Was glad I had the audio tour as well to provide highlights. Was there with a group of friends and we also purchased the nativity/passion tower tour.  The towers were not worth the visit though because you really couldn't see anything extra. ", "publishedDate": "2020-03-11", "language": "en", "rating": 5}, {"id": 750488171, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d190166-r750488171-Basilica_of_the_Sagrada_Familia-Barcelona_Catalonia.html", "text": "Absolutely fabulous  and magnificent in every aspect, imparts the most vivid and moving memories. A truly awe inspiring treasure, not to be missed.", "publishedDate": "2020-03-11", "language": "en", "rating": 5}, {"id": 750478579, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d190166-r750478579-Basilica_of_the_Sagrada_Familia-Barcelona_Catalonia.html", "text": "During our time in Barcelona we visited the Sagrada Familia and were overwhelmed by its beauty and uniqueness.  While it is in the final stages of construction, it's completion date is targeted for 2026, the 100th anniversary of the death of its primary architect, Antoni Gaudi. \n\nWith 18 spires and three entry facades, the exterior of this minor basilica is a marvel to see.  The interior is equally exceptional and the stained glass windows are magnificent.\n\nWhen in Barcelona, a visit to the Sagrada Familia is a must. You will not be disappointed.\n", "publishedDate": "2020-03-11", "language": "en", "rating": 5}, {"id": 750473712, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d190166-r750473712-Basilica_of_the_Sagrada_Familia-Barcelona_Catalonia.html", "text": "This was a quick yet interesting tour. I was with a bilingual tour guide and he was very knowledgeable about the historic site. ", "publishedDate": "2020-03-11", "language": "en", "rating": 5}, {"id": 750444652, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d190166-r750444652-Basilica_of_the_Sagrada_Familia-Barcelona_Catalonia.html", "text": "Do not miss this experience. The cathedral is absolutely breathtaking. I would recommend going early in the morning or at sunset to see the beauty of the light through the windows. ", "publishedDate": "2020-03-11", "language": "en", "rating": 5}, {"id": 750430655, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d190166-r750430655-Basilica_of_the_Sagrada_Familia-Barcelona_Catalonia.html", "text": "Breathtaking!!!!\nYou have to visit this church of art. \nBook your tickets on line and add the audio on your tour in order to understand what you see.\nThe area has coffee shops around ,Starbucks etc.plus a lot of shops with souvenirs.", "publishedDate": "2020-03-11", "language": "en", "rating": 4}, {"id": 750405292, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d190166-r750405292-Basilica_of_the_Sagrada_Familia-Barcelona_Catalonia.html", "text": "It is an outstanding piece of architecture when you look at it you have to take time to take it all in It’s so amazing. I can’t wait to come back and see it When it is fully refurbished.  ", "publishedDate": "2020-03-11", "language": "en", "rating": 5}, {"id": 750387068, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d190166-r750387068-Basilica_of_the_Sagrada_Familia-Barcelona_Catalonia.html", "text": "Reserved the tower viewing months ahead of time and the day of our visit were told the towers weren't allowing anyone due to maintenance. We were very disappointed because we were told this the day of and told we were told we would be getting a credit for the portion of the towers, however we are still waiting on that credit. La Sagrada Familia is a beautiful cathedral and definitely a place not to miss when visiting Barcelona. We cannot wait to come back once the towers are completed by May 2026.", "publishedDate": "2020-03-10", "language": "en", "rating": 3}, {"id": 750380177, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d190166-r750380177-Basilica_of_the_Sagrada_Familia-Barcelona_Catalonia.html", "text": "An awe inspiring construction. Fabulous windows and lots of light - what a vision. I will hope to return in 2026 when complete.", "publishedDate": "2020-03-10", "language": "en", "rating": 5}, {"id": 750378173, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d190166-r750378173-Basilica_of_the_Sagrada_Familia-Barcelona_Catalonia.html", "text": "Awsome to look at. So much bigger than we had expected. Pure art! We didn’t go in but got some incredible photos from the outside. ", "publishedDate": "2020-03-10", "language": "en", "rating": 3}, {"id": 750340281, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d190166-r750340281-Basilica_of_the_Sagrada_Familia-Barcelona_Catalonia.html", "text": "Sagrada Familia is a must see in Barcelona. It is amazing Gaudi's project as all the other projects of this man.", "publishedDate": "2020-03-10", "language": "en", "rating": 5}, {"id": 750325946, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d190166-r750325946-Basilica_of_the_Sagrada_Familia-Barcelona_Catalonia.html", "text": "Breathtaking and unbelievable how long its being built for. But makes sense once you step inside.   Definitely recommend getting a scheduled time to attend. ", "publishedDate": "2020-03-10", "language": "en", "rating": 5}, {"id": 750325110, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d190166-r750325110-Basilica_of_the_Sagrada_Familia-Barcelona_Catalonia.html", "text": "One of the most magnificent buildings I have ever seen. I was really impressed with the side that was built last and the details of it, but I was amazed when I went to the entrance and saw the \"old\" side of it - I was amazed and speechless. The last details of it was part of a picture I can not just describe. The moment I entered I was even more surprised to see how bit it is and the way the construction was made. It was a magnificient moment and I would definitely go a second time if I have the chance. \nP.S. Keep in mind that the security check up is kind of like an airport one.", "publishedDate": "2020-03-10", "language": "en", "rating": 5}, {"id": 750319149, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d190166-r750319149-Basilica_of_the_Sagrada_Familia-Barcelona_Catalonia.html", "text": "A must visit place in Barcelona. Even if the construction is not yet finished, it is a must to see. Marvelous things can be seen.", "publishedDate": "2020-03-10", "language": "en", "rating": 5}, {"id": 750318437, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d190166-r750318437-Basilica_of_the_Sagrada_Familia-Barcelona_Catalonia.html", "text": "Go to mass Sunday morning and you will not be disappointed. So beautiful. Gaudí knew what he was doing! \n", "publishedDate": "2020-03-10", "language": "en", "rating": 5}, {"id": 750293103, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d190166-r750293103-Basilica_of_the_Sagrada_Familia-Barcelona_Catalonia.html", "text": "I do not know how is possible for someone like this. I was 200% disappointed. In my opinion this is not worth any cent, also it is lost money to build this special when u hear history and inspiration the autor had . if u will see the basilica oud side it is enough  and is nothing special , but in side i totally do not recommended .In my small church where I was lived, organs and decorations was much better, and if u have audio story about this place u are much more disappointed because this what u see have nothing to inspiration what u hear about it. This Basilica it is just for me some commertial something what look good on the pictures but nothing more.U can see much better architecture in some small county.  Sorry ppl I do not recommended at all", "publishedDate": "2020-03-10", "language": "en", "rating": 2}, {"id": 750283525, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d190166-r750283525-Basilica_of_the_Sagrada_Familia-Barcelona_Catalonia.html", "text": "Sagrada Familia is the topmost tourist attraction in Barcelona - and there's a reason for that. It is an architectural masterpiece designed by Antoni Gaudi. Efforts are in motion to complete its construction by 2026 - the 100th death anniversary of Gaudi. Overall, it will take close 150 years to build, but it will be worth the wait. The church is open to visitors since 2010. The detail on the interior and exterior is exquisite. Audio-guide is recommended because it will help you appreciate the thought into detailing of each facade of the church. One can spend around 2 hours here.\n\nBook the tickets from official website beforehand to avoid very long queues. There are even some discounts for people below the age of 30 and on specific days for certain hours in evening. My ticket (including audio-guide) cost €12 - would have been about €25 without the discounts. Afternoon or evening is the best time to visit to admire the light through stained glass windows. You can hear the church organ during mass at 18:00.", "publishedDate": "2020-03-10", "language": "en", "rating": 5}, {"id": 750277237, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d190166-r750277237-Basilica_of_the_Sagrada_Familia-Barcelona_Catalonia.html", "text": "one of the greatest architectural marvel of all time. Barcelona's jewel of the Iberian Peninsula. It speaks it own language.", "publishedDate": "2020-03-10", "language": "en", "rating": 5}, {"id": 750277005, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d190166-r750277005-Basilica_of_the_Sagrada_Familia-Barcelona_Catalonia.html", "text": "This is a can't-miss attraction.  Get a guided tour so you can understand all of the intricacies. The church is set to be finished in 2026 but its already a masterpiece.", "publishedDate": "2020-03-10", "language": "en", "rating": 5}, {"id": 750267884, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d190166-r750267884-Basilica_of_the_Sagrada_Familia-Barcelona_Catalonia.html", "text": "This was a truly amazing place to visit. The ornate exterior incorporated an amazing amount on symbolism and the expansive open interior was truly impressive. It is an incredible contrast to the Barcelona Cathedral and both are well worth the time.", "publishedDate": "2020-03-10", "language": "en", "rating": 5}, {"id": 750253087, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d190166-r750253087-Basilica_of_the_Sagrada_Familia-Barcelona_Catalonia.html", "text": "If you’re going barcelona this is the crown jewel, beautiful from the outside you don’t realise how it could get any better until you step through the doors, absolutely breathe taking. Recommend the audio guide, very informative and so interesting. Must see!", "publishedDate": "2020-03-10", "language": "en", "rating": 5}, {"id": 750226919, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d190166-r750226919-Basilica_of_the_Sagrada_Familia-Barcelona_Catalonia.html", "text": "The most impressive and beautiful church I have ever been inside or outside. The results of a dedicated life's work by a genius. A must see for anyone's bucket list. ", "publishedDate": "2020-03-10", "language": "en", "rating": 5}, {"id": 750217093, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d190166-r750217093-Basilica_of_the_Sagrada_Familia-Barcelona_Catalonia.html", "text": "We’d seen plenty of pictures but the real thing is awe inspiring to say the least. When it’s eventually completed it will tower above everything else in the city. The audio tour is worth paying for, simple to use, and available in all languages. Won’t say too much more about the interior/exterior because you have to experience it for yourself, suffice to say the design, workmanship etc is unbelievable. Gaudi was certainly ahead of his time! Paying extra to ‘skip the line’ is also advised, especially during the busier summer months. Definitely a ‘must do’ experience.", "publishedDate": "2020-03-10", "language": "en", "rating": 5}, {"id": 750151160, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d190166-r750151160-Basilica_of_the_Sagrada_Familia-Barcelona_Catalonia.html", "text": "This is definitely worth a visit.  You can do a tour with or without a guide.  We booked through Julia travel before arriving though be careful as they can sell you a ticket which says you can do the towers and then at the end of the tour they say it wasn’t included.  Still trying to get my money back!  \n\nThis however didn’t diminish the impact of this building which remains under construction and is due to be completed in 2026.  I will\nHave to go back.  \n\nThe way the natural light inside is used is astounding offering you colours of the rainbow and my photos don’t do it justice.  The unique architecture by Gaudi is glorious and the place feels tactile, warm and welcoming.  It is still a place of worship and is steeped in biblical reference both inside and out and yet it doesn’t come across as being overly reserved.  The sculptures reflect Gaudi and others interpretations of his vision with their own identity enveloped within.  There is so much to take in.  Definitely worth a good couple of hours to embrace Gaudi’s genius and the extensive ambition he had. ", "publishedDate": "2020-03-09", "language": "en", "rating": 5}, {"id": 750148821, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d190166-r750148821-Basilica_of_the_Sagrada_Familia-Barcelona_Catalonia.html", "text": "Sagrada Familia was just magical and phenomenal. The work is so impressive and the history captivating. The design of the structure and the facades really capture the religion well. I enjoyed it so much. The audio guide was good too. Fair warning that it's crowded as expected.", "publishedDate": "2020-03-09", "language": "en", "rating": 5}, {"id": 750138258, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d190166-r750138258-Basilica_of_the_Sagrada_Familia-Barcelona_Catalonia.html", "text": "Went with Olga C, our tour was fantastic, so much information and history.  This was our favorite tour while in Barcelona.  Highly recommend Tours by Locals.", "publishedDate": "2020-03-09", "language": "en", "rating": 5}, {"id": 750136508, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d190166-r750136508-Basilica_of_the_Sagrada_Familia-Barcelona_Catalonia.html", "text": "What a beautiful building. You honestly must see to believe this place. It’s absolutely huge!! More grand and incredible than you’d imagine. Recommend booking in advance and get the audio guide. There’s nothing to read inside so all the info is on the phone they give you. ", "publishedDate": "2020-03-09", "language": "en", "rating": 5}, {"id": 750133847, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d190166-r750133847-Basilica_of_the_Sagrada_Familia-Barcelona_Catalonia.html", "text": "We would have given it more but although it was out with their control we were not able to venture up the tower as it was too windy.", "publishedDate": "2020-03-09", "language": "en", "rating": 4}, {"id": 750133259, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d190166-r750133259-Basilica_of_the_Sagrada_Familia-Barcelona_Catalonia.html", "text": "This Basilica is truly ethereal and so many beautiful parts. Definitely well worth the visit . Because of the Coronavirus the queues were very much reduced.", "publishedDate": "2020-03-09", "language": "en", "rating": 5}, {"id": 750109354, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d190166-r750109354-Basilica_of_the_Sagrada_Familia-Barcelona_Catalonia.html", "text": "Book in advance - it makes life much easier and guarantees entry even in early March. We did the basic tour, which was amazing, at the end of the day as the sunlight shone through the yellow and orange windows. You can't come to Barcelona and not do this  but it is a city full of beauty everywhere you go.", "publishedDate": "2020-03-09", "language": "en", "rating": 5}, {"id": 750104755, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d190166-r750104755-Basilica_of_the_Sagrada_Familia-Barcelona_Catalonia.html", "text": "Beautiful architecture and lovely small walk around the building. Lots of other tourists around and weather was great in March.", "publishedDate": "2020-03-09", "language": "en", "rating": 5}, {"id": 750102510, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d190166-r750102510-Basilica_of_the_Sagrada_Familia-Barcelona_Catalonia.html", "text": "Excellent sight but a bit expensive to see from the inside. Good to see in the evening with all the lights. A great pastry place just near by.", "publishedDate": "2020-03-09", "language": "en", "rating": 4}, {"id": 750096811, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d190166-r750096811-Basilica_of_the_Sagrada_Familia-Barcelona_Catalonia.html", "text": "The stained glass was lovely lots of it. My favourite was 12 midday and the song Ava Maria being played.  Be warned it you go up in the tower by lift you have to come down by stairs. Narrow dark and steep not pleasant. ", "publishedDate": "2020-03-09", "language": "en", "rating": 4}, {"id": 750084331, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d190166-r750084331-Basilica_of_the_Sagrada_Familia-Barcelona_Catalonia.html", "text": "In pictures it is hard to grasp the beauty of the basilica, and in person it is equally as stunning. Going in the morning you get wonderful light through the passion facade, and in the evening through the nativity facade. I can not put into words the beauty of the entire place. \n\nTravel tip: reserve your tickets online through the basilica foundation website and book the first opportunity to go in and there will be very few people with you. And get the audio guide. It’s worth it. ", "publishedDate": "2020-03-09", "language": "en", "rating": 5}, {"id": 750077853, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d190166-r750077853-Basilica_of_the_Sagrada_Familia-Barcelona_Catalonia.html", "text": "This place is an amazing piece of architecture in the middle of Barcelona. However, our experience on the day wasn't great. We bought a ticket for Tower Access in advance of our visit but after queuing for the tower for over twenty minutes, the lift broke and we were instructed to move to another queue for another lift at the other side of the building. This was frustrating because the security would not let us jump to the beginning of the next queue even though we were first in the queue for the other one. Letting just a few people ahead of the queue to make up for an inconvenience caused on their behalf was just too much for them to handle. It was a pity really because its a lovely place and we were really looking forward to it.", "publishedDate": "2020-03-09", "language": "en", "rating": 3}, {"id": 750072955, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d190166-r750072955-Basilica_of_the_Sagrada_Familia-Barcelona_Catalonia.html", "text": "A work of amazing architecture with so many things to look at including fruit. \nVery popular with tourists and the cafe across the road is ideal to sit and spot all the little foibles \n", "publishedDate": "2020-03-09", "language": "en", "rating": 5}, {"id": 750050392, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d190166-r750050392-Basilica_of_the_Sagrada_Familia-Barcelona_Catalonia.html", "text": "You can’t understand the awe and peace of the Sagrada Familia until you visit. Once inside the cost seems like pennies. Truly one of the most interesting and beautiful buildings in the world", "publishedDate": "2020-03-09", "language": "en", "rating": 5}, {"id": 750048501, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d190166-r750048501-Basilica_of_the_Sagrada_Familia-Barcelona_Catalonia.html", "text": "I think this is a definite WOW!  The outside of the building is so impressive and imposing and I think it is more interesting than the inside.  Enjoyed my visit though a must see in the city", "publishedDate": "2020-03-09", "language": "en", "rating": 5}, {"id": 750030609, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d190166-r750030609-Basilica_of_the_Sagrada_Familia-Barcelona_Catalonia.html", "text": "Last visited 15 years ago and really glad we visited again! Much has changed and you can tell the cathedral is nearing completion. Absolutely awesome. ", "publishedDate": "2020-03-09", "language": "en", "rating": 5}, {"id": 750002364, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d190166-r750002364-Basilica_of_the_Sagrada_Familia-Barcelona_Catalonia.html", "text": "The Basilica was exceptional. Amazing art work by Gaudi. It was busy when we visited the place. Need to book the tickets in advance when going there. ", "publishedDate": "2020-03-08", "language": "en", "rating": 5}, {"id": 749987085, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d190166-r749987085-Basilica_of_the_Sagrada_Familia-Barcelona_Catalonia.html", "text": "This was my second time visiting La Sagrada Familia and I enjoyed it every more on this trip. It's stunning in every detail.  Visited this time with family, including three teen boys and everyone loved it.  We did a Skip the Line Tour of this and Park Guell.  Just fantastic.", "publishedDate": "2020-03-08", "language": "en", "rating": 5}, {"id": 749963800, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d190166-r749963800-Basilica_of_the_Sagrada_Familia-Barcelona_Catalonia.html", "text": "The Church is beautiful and the tour guide did a great job. We took the English-only tour. Only one complaint. We paid extra for the 90 minute tour which included the Towers; however, were told at the end that the 10am tour did not include the Towers. There were others on the tour who experienced the same thing. Julia Travel said it must be an error in the advertisement but did not offer a refund of the difference we had paid to Trip Advisor.", "publishedDate": "2020-03-08", "language": "en", "rating": 3}, {"id": 749955895, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d190166-r749955895-Basilica_of_the_Sagrada_Familia-Barcelona_Catalonia.html", "text": "When my friends came here on vacation, we decided to go there , to come inside . We bought tickets just at Sagrada , there wes no long turn , we waited only 10-15 min ( many people buy tickets by internet, but we did it just at the place ). We came to through security- you should not have with you any glass or metal things ,,( if you have - you just live them at security and then take them back ) . Inside it’s very beautiful view , great windows , architecture and organ tool... on Sundays there take place some ceremonial cases ... with a very good church music ,,,, If you are in BCN, you have to visit Sagrada Familia inside :)) Welcome to BCN", "publishedDate": "2020-03-08", "language": "en", "rating": 5}, {"id": 749930871, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d190166-r749930871-Basilica_of_the_Sagrada_Familia-Barcelona_Catalonia.html", "text": "Absolutely incredible place and was blown away but the inside! Had no idea what it was like from the outside absolutely must see. We chose to climb the nativity tower which was quite a let down. Standard view from very small cramped area and big climb down by steps wouldnt recommend the tower but the audio or guided tour is a must ", "publishedDate": "2020-03-08", "language": "en", "rating": 5}, {"id": 749893236, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d190166-r749893236-Basilica_of_the_Sagrada_Familia-Barcelona_Catalonia.html", "text": "I didn’t know what to expect entering inside. Well, as I entered the closed space of the basilica and I looked up I felt so many emotions. \nI strongly suggest the audioguide: basic information and won’t make the visit too long. \nWe bought the ticket online just before entering the basilica and the waiting was 15 minutes in the queue.(7march 2020)", "publishedDate": "2020-03-08", "language": "en", "rating": 5}, {"id": 749884699, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d190166-r749884699-Basilica_of_the_Sagrada_Familia-Barcelona_Catalonia.html", "text": "A masterpiece. It is magnificent. wonderful, it took my breath away when I walked inside. Amazing. a must-see if you go to Barcelona. Insane, and the light is mesmerizing, wow.", "publishedDate": "2020-03-08", "language": "en", "rating": 5}, {"id": 749878883, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d190166-r749878883-Basilica_of_the_Sagrada_Familia-Barcelona_Catalonia.html", "text": "This is a must see in Barcelona but book ahead and show up on time for your tour.  Breathtaking architecture and opposite of many of the other old churches you’ve probably seen with most of the detail on the outside and getting significantly more simplistic on the inside.  So be sure to spend time taking in the carvings on the exterior and appreciating the colors and simplicity indoors.", "publishedDate": "2020-03-08", "language": "en", "rating": 5}, {"id": 749877593, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d190166-r749877593-Basilica_of_the_Sagrada_Familia-Barcelona_Catalonia.html", "text": "110+ years and still under construction 🏗.   This is something to see!   No other “Basilica” looks or behaves like La Sagrada Familia.  Get tickets 🎫 on-line ahead of time and purchase the audio guide. The tower experience WILL give you vertigo and the stairway down is not for the faint of heart.  ", "publishedDate": "2020-03-08", "language": "en", "rating": 5}, {"id": 749865169, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d190166-r749865169-Basilica_of_the_Sagrada_Familia-Barcelona_Catalonia.html", "text": "One of the most remarkable buildings in the world this shouldn’t be missed while in BCN!\nGaudi’s master piece is impressive, touching and full with intriguing symbolism.\nMy recommendation is to start with a visit of the grounds (foresee 30’), then do the inside (foresee for the ground floor a minimum of 30’ or stay as long as you want), followed by the museum, which gives very good explanations (plan about 45’), and then visit the towers (about 30’), and end with the school building which is next to the exit.\nMake reservations for the tower visit, as places on-site get booked very fast.\nYou can also go on Sunday, when there is a catholic mass, but you’ll have to waitin line before they’ll let in a limited amount of people for free.", "publishedDate": "2020-03-08", "language": "en", "rating": 5}, {"id": 749856764, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d190166-r749856764-Basilica_of_the_Sagrada_Familia-Barcelona_Catalonia.html", "text": "If you’re to visit, going inside is a must! The detail is insane, and the lighting mesmerizing. Everywhere you look you see something new. \n", "publishedDate": "2020-03-08", "language": "en", "rating": 5}, {"id": 749855353, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d190166-r749855353-Basilica_of_the_Sagrada_Familia-Barcelona_Catalonia.html", "text": "An absolutely stunning building inside and out. A gaudi masterpiece.  Well worth the entrance fee.  Recommend that you book online well in advance of your visit as it can get very busy.", "publishedDate": "2020-03-08", "language": "en", "rating": 5}, {"id": 749850613, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d190166-r749850613-Basilica_of_the_Sagrada_Familia-Barcelona_Catalonia.html", "text": "A must see on a visit to Barcelona. We booked a guided tour. Our guide was knowledgeable and entertaining. Will make a point of coming back. It is a beautiful, interesting building. ", "publishedDate": "2020-03-08", "language": "en", "rating": 5}, {"id": 749833704, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d190166-r749833704-Basilica_of_the_Sagrada_Familia-Barcelona_Catalonia.html", "text": "The cathedral, is a wonderful building, builded by the excellent architect Gaudi but... the city is a bit dangerous for tourists. Ther are a lot of thiefs, dirty streets and sometimes politycal riots in main streets of the Town.", "publishedDate": "2020-03-08", "language": "en", "rating": 2}, {"id": 749826856, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d190166-r749826856-Basilica_of_the_Sagrada_Familia-Barcelona_Catalonia.html", "text": "Absolutely stunning! Easily my favourite thing we did on the visit. The audio guide is really worth it, although worth noting the first three points are all outside we wondered in and got very confused! Such a beautiful and spiritual place I could have stayed all day! ", "publishedDate": "2020-03-08", "language": "en", "rating": 5}, {"id": 749819903, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d190166-r749819903-Basilica_of_the_Sagrada_Familia-Barcelona_Catalonia.html", "text": "What can you say. Organised trip absolutely amazing place. A must do in Barcelona.Even more inspiring in the inside well worth the visit", "publishedDate": "2020-03-08", "language": "en", "rating": 5}, {"id": 749809960, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d190166-r749809960-Basilica_of_the_Sagrada_Familia-Barcelona_Catalonia.html", "text": "Amazing to see. Looking forward to return in 2026 to visit when it is finished. Great audio guide (even in Dutch!) and suprisingly not too crowded. ", "publishedDate": "2020-03-07", "language": "en", "rating": 5}, {"id": 749798678, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d190166-r749798678-Basilica_of_the_Sagrada_Familia-Barcelona_Catalonia.html", "text": "The must do. Book in advance. We just did the guided tour and not the tower.  Fascinating architecture.  ", "publishedDate": "2020-03-07", "language": "en", "rating": 5}, {"id": 749797059, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d190166-r749797059-Basilica_of_the_Sagrada_Familia-Barcelona_Catalonia.html", "text": "Unbelievable. The exterior is already impressive but you will be blown away by the interior. Lots of details in the museum towards the exit. For my part, I went back to look at all this after the museum and it's even better! Be careful however, remember to reserve your places in advance.", "publishedDate": "2020-03-07", "language": "en", "rating": 5}, {"id": 749764757, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d190166-r749764757-Basilica_of_the_Sagrada_Familia-Barcelona_Catalonia.html", "text": "I opted to visit the Sagrada Família only from the outside. I took wonderful pics and admired the work of the outside of the building. I am satisfied with my visit and have no regrets for not going inside. ", "publishedDate": "2020-03-07", "language": "en", "rating": 4}, {"id": 749737987, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d190166-r749737987-Basilica_of_the_Sagrada_Familia-Barcelona_Catalonia.html", "text": "March 4 at 10:28 AM · \nLa Sagrada Familia...25 years since I was here and the progress is amazing. You don’t have to be Catholic to be moved by this sacred Temple and the work of Architect Gaudí ...construction began in 1882 and to be completed 2026....Went to a Catalan Mass in the crypt...which is closed  to public except for 8pm daily mass...and afforded an opportunity to view Gaudi’s grave.", "publishedDate": "2020-03-07", "language": "en", "rating": 5}, {"id": 749724345, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d190166-r749724345-Basilica_of_the_Sagrada_Familia-Barcelona_Catalonia.html", "text": "We were blown away by this place - well worth a visit. The stained windows look beautiful inside with the vivid colours. A fabulous gem by the amazing Gaudí ", "publishedDate": "2020-03-07", "language": "en", "rating": 5}, {"id": 749719364, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d190166-r749719364-Basilica_of_the_Sagrada_Familia-Barcelona_Catalonia.html", "text": "You should not miss this. Definitely a work of art! You should purchase your timed tickets on line to skip the line.", "publishedDate": "2020-03-07", "language": "en", "rating": 5}, {"id": 749718246, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d190166-r749718246-Basilica_of_the_Sagrada_Familia-Barcelona_Catalonia.html", "text": "Beautiful place to visit and have a walk around but its way to expensive to go inside and see. \nTo pay €30 I don’t think its worth it", "publishedDate": "2020-03-07", "language": "en", "rating": 5}, {"id": 749699669, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d190166-r749699669-Basilica_of_the_Sagrada_Familia-Barcelona_Catalonia.html", "text": "It’s amazing the inside of this historic building , and modern at the same time. We will definitely come back to see the final version.", "publishedDate": "2020-03-07", "language": "en", "rating": 5}, {"id": 749697219, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d190166-r749697219-Basilica_of_the_Sagrada_Familia-Barcelona_Catalonia.html", "text": "What an amazing experience! you're always recommended to skip the like and book your tickets online for a specific time and an audio guide. Book a tower access also if you can, we took the Nativity tower. lovely arial view. \nsmall Tip: DONT COME SUPER EARLY. the security will reject you. if you come 30 min early, you can visit the souvenir shop at the back of the cathedral and enter from there.", "publishedDate": "2020-03-07", "language": "en", "rating": 4}, {"id": 749695611, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d190166-r749695611-Basilica_of_the_Sagrada_Familia-Barcelona_Catalonia.html", "text": "At the sunset time all the windows explodes with different varieties of colors, the columns and arches crossed each other generating an optical illusion which gave to passengers an ipnotic experience. I have to say that this church is one of the most beautiful buildings of human kind. ", "publishedDate": "2020-03-07", "language": "en", "rating": 5}, {"id": 749687167, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d190166-r749687167-Basilica_of_the_Sagrada_Familia-Barcelona_Catalonia.html", "text": "This is a must-see attraction if you visit Barcelona. It's amazing to see a masterpiece being completed after 100+ years of work. Gaudi was definitely a genius! I went just before sunset and the light was incredible inside the Basilica! (streaming in through the beautiful, huge windows and filling the space with light in a magical way!).", "publishedDate": "2020-03-07", "language": "en", "rating": 5}, {"id": 749664804, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d190166-r749664804-Basilica_of_the_Sagrada_Familia-Barcelona_Catalonia.html", "text": "If you’re traveling to Barcelona don’t even think about omitting this beauty! The audio guide explained a lot and provided extended knowledge. Haven’t had a chance to see the towers due to weather conditions unfortunately so can’t share my opinion. Visit while sunset, the light beautifully goes through the window inside...", "publishedDate": "2020-03-07", "language": "en", "rating": 5}, {"id": 749656881, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d190166-r749656881-Basilica_of_the_Sagrada_Familia-Barcelona_Catalonia.html", "text": "This is breathtakingly beautiful. Everywhere you look there is something different from cherub to stained glass windows. You will not be disappointed. Again a must when in Barcelona ", "publishedDate": "2020-03-07", "language": "en", "rating": 5}, {"id": 749634599, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d190166-r749634599-Basilica_of_the_Sagrada_Familia-Barcelona_Catalonia.html", "text": "Lots of scaffolding and cranes but still a stunning sight.\n\nUnfortunately didn't go inside this time but definitely will when I am back. \n\nIf your visiting Barcelona it's a must see. ", "publishedDate": "2020-03-06", "language": "en", "rating": 5}, {"id": 749585395, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d190166-r749585395-Basilica_of_the_Sagrada_Familia-Barcelona_Catalonia.html", "text": "This is such an amazing building. So different to your usual church. Gaudi’s masterpiece and a must see if you’re in Barcelona. Go early or late to avoid the main crowds.", "publishedDate": "2020-03-06", "language": "en", "rating": 5}, {"id": 749571255, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d190166-r749571255-Basilica_of_the_Sagrada_Familia-Barcelona_Catalonia.html", "text": "Buy your ticket on line so you don't have surprises. You decide on the time and queue is minimal. During the high season, better book a couple of days before", "publishedDate": "2020-03-06", "language": "en", "rating": 5}, {"id": 749570669, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d190166-r749570669-Basilica_of_the_Sagrada_Familia-Barcelona_Catalonia.html", "text": "Stunning architecture and a beautiful history. Definitely a must see and book the tour ahead of time. \n", "publishedDate": "2020-03-06", "language": "en", "rating": 5}, {"id": 749512423, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d190166-r749512423-Basilica_of_the_Sagrada_Familia-Barcelona_Catalonia.html", "text": "Took a small group tour with Real Barcelona Tours and had an amazing and spiritual experience. Our tour guide was truly knowledgeable and personable. Her name was Clara Aubá Espada and I would highly recommend that you take this tour to know all about the Architects and their inspiration during this 100 + years of construction. Must See during a visit to Barcelona Spain.", "publishedDate": "2020-03-06", "language": "en", "rating": 5}, {"id": 749503940, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d190166-r749503940-Basilica_of_the_Sagrada_Familia-Barcelona_Catalonia.html", "text": "Amazing experience. Such a great and mesmerising place to visit. The audio guide was a real necessity as it gave so much information and fab facts that we would never have known had we not had it. It also allows you to go at your own pace. Definitely recommend.", "publishedDate": "2020-03-06", "language": "en", "rating": 5}, {"id": 749502681, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d190166-r749502681-Basilica_of_the_Sagrada_Familia-Barcelona_Catalonia.html", "text": "We expected to have to line up for a long while but were able to purchase our tickets for 24 eu each (senior discount) and go right in. we were able to take our on time looking around and no one tried to move us along. Fabulous inside and out", "publishedDate": "2020-03-06", "language": "en", "rating": 5}, {"id": 749501422, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d190166-r749501422-Basilica_of_the_Sagrada_Familia-Barcelona_Catalonia.html", "text": "This is such a cool place to walk around! I recommend getting the audio tour as it explains a lot. My wife and I loved this tour.", "publishedDate": "2020-03-06", "language": "en", "rating": 5}, {"id": 749472759, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d190166-r749472759-Basilica_of_the_Sagrada_Familia-Barcelona_Catalonia.html", "text": "Beautiful place to visit!  It was very warm the day we were there; be sure to have water to drink while waiting in line (it's a rip off to buy from people on the street); lovely gelato places just outside for when you're finished.", "publishedDate": "2020-03-06", "language": "en", "rating": 5}, {"id": 749464906, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d190166-r749464906-Basilica_of_the_Sagrada_Familia-Barcelona_Catalonia.html", "text": "Very different church from all the rest I have visited (including Notre Dame and Duomo). Beautiful! The entrance fee including guided tour was  about 24 € per person under the age of 30 years and it's worth it. Part of the money is used for finishing the construction work! Interesting details and information which you wouldn't pay attention to yourself!", "publishedDate": "2020-03-06", "language": "en", "rating": 5}, {"id": 749460056, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d190166-r749460056-Basilica_of_the_Sagrada_Familia-Barcelona_Catalonia.html", "text": "The Sagrada Família, is a beautiful, large unfinished Roman Catholic minor basilica in Barcelona. It is absolutely stunning. The architecture is something else. a must see if you are in Barcelona.", "publishedDate": "2020-03-06", "language": "en", "rating": 5}, {"id": 749456758, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d190166-r749456758-Basilica_of_the_Sagrada_Familia-Barcelona_Catalonia.html", "text": "I´m in love with this place, everytime I´m in Barcelona it looks a little bit different and it´s just fascinating", "publishedDate": "2020-03-06", "language": "en", "rating": 5}, {"id": 749455044, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d190166-r749455044-Basilica_of_the_Sagrada_Familia-Barcelona_Catalonia.html", "text": "Very beautiful, the architecture is amazing. Definitely go with a tour so you don’t have to wait in line which is around the building !", "publishedDate": "2020-03-06", "language": "en", "rating": 4}, {"id": 749442931, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d190166-r749442931-Basilica_of_the_Sagrada_Familia-Barcelona_Catalonia.html", "text": "I am not the person who normally visit churches. Almost finished, this basilica, temple, church, cathedral, space ship is a special experience and worth a visit. \nNumber 1 attraction in Barcelona is full with tourists (get your ticket online in advance) but you don't feel stressed. Booked a ticket with tower access but they were closed due to strong winds. Waiting for refund.", "publishedDate": "2020-03-06", "language": "en", "rating": 5}, {"id": 749434583, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d190166-r749434583-Basilica_of_the_Sagrada_Familia-Barcelona_Catalonia.html", "text": "Our two previous trips to Barcelona like this one was with P&O cruises but these didn’t involve us going here.\nThis time we were determined to see it so booked a Shore excursion  with P&O, we’d done our own thing previously, which also involved a visit to Park Guell.\nOur guide who took us to both venues was excellent and it was certainly worth having someone on hand to explain things and taking over the ticket arrangements of getting in.\nMaybe we could have done with more time but without doubt the unusual architecture  of Guadi is just amazing.Credit has also to go to the work that has taken place  since his original involvement in achieving his “ concept” with final completion planned for 2026.\nThis is one of the most amazing  and iconic “places” my wife and I have been lucky to visit and we have been fortunate to have seen a few, including the Taj Mahal,the Sydney Opera House,Alcatraz, Baha’i Gardens in Haifa  and New Delhi ,etc and we both put this amongst the best we’ve visited.\nA genuine must go if you get the chance but plan ahead to make sure you get the chance as it is certainly busy.", "publishedDate": "2020-03-05", "language": "en", "rating": 5}, {"id": 749416935, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d190166-r749416935-Basilica_of_the_Sagrada_Familia-Barcelona_Catalonia.html", "text": "Our two previous trips to Barcelona like this one was with P&O cruises but these didn’t involve us going here.\nThis time we were determined to see it so booked a Shore excursion  with P&O, we’d done our own thing previously, which also involved a visit to Park Guell.\nOur guide who took us to both venues was excellent and it was certainly worth having someone on hand to explain things and taking over the ticket arrangements of getting in.\nMaybe we could have done with more time but without doubt the unusual architecture  of Guadi is just amazing.Credit has also to go to the work that has taken place  since his original involvement in achieving his “ concept” with final completion planned for 2026.\nThis is one of the most amazing  and iconic “places” my wife and I have been lucky to visit and we have been fortunate to have seen a few, including the Taj Mahal,the Sydney Opera House,Alcatraz, Baha’i Gardens in Haifa  and New Delhi ,etc and we both put this amongst the best we’ve visited.\nA genuine must go if you get the chance but plan ahead to make sure you get the chance as it is certainly busy.", "publishedDate": "2020-03-05", "language": "en", "rating": 5}, {"id": 749400739, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d190166-r749400739-Basilica_of_the_Sagrada_Familia-Barcelona_Catalonia.html", "text": "You cannot visit Barcelona and not see Sagrada Família. I thoroughly recommend booking a guided tour in advance, it is worth every penny. We booked our tour through the Barcelona Guide Bureau, and, thanks to our excellent guide, discovered fascinating insight into the history of the ongoing creation of the basilica. \n\nEntering Sagrada Família for the first time literally took my breath away, no picture can do it justice!! The spectacular sight of the sunlight streaming through the coloured glass and reflecting on the ‘forest’ of pillars will stay with me forever.", "publishedDate": "2020-03-05", "language": "en", "rating": 5}, {"id": 749345099, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d190166-r749345099-Basilica_of_the_Sagrada_Familia-Barcelona_Catalonia.html", "text": "What an amazing church ! - Couldn't go to Barcelona and not visit. Highly recommend booking the towers as well. A lift takes you to the top - incredible views from here and then a gradual walk back down. Would love to visit again in 2026 when they hope to have it all completed.    \n\nBrilliantly organised system with little queuing or waiting", "publishedDate": "2020-03-05", "language": "en", "rating": 5}, {"id": 749339849, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d190166-r749339849-Basilica_of_the_Sagrada_Familia-Barcelona_Catalonia.html", "text": "We didn’t enter the basilica we decided to just view the outside, which is quite amazing. So many things to look at from every single angle. It is so grand, following my phones directions to find it and then all of a sudden it is towering over you! My only negative is how close they have built flats around it, such a shame they did not leave it the space it deserves.", "publishedDate": "2020-03-05", "language": "en", "rating": 5}, {"id": 749336791, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d190166-r749336791-Basilica_of_the_Sagrada_Familia-Barcelona_Catalonia.html", "text": "Not to miss.  Not to miss. Not to miss. Simple as that.\nIf only similar architecture was built today.  It about celebrating Nature and light.", "publishedDate": "2020-03-05", "language": "en", "rating": 5}, {"id": 749327689, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d190166-r749327689-Basilica_of_the_Sagrada_Familia-Barcelona_Catalonia.html", "text": "We were on a multi-stop tour and arrived at the Basilica within 10 min of our \"entry time.\"  We had heard that the \"skip-the-line\" line could be quite long (at times) and that we might miss our window.  As it turns out, there were massive lines everywhere but our line was virtually empty.  The basilica is definitely interesting but, to be honest, I found the outside more interesting compared to the inside (although Christ suspended by the alter area was a site to behold).  Definitely find your way to the basement (lower floor area) if you wish to learn more about the various design aspects of the basilica - fascinating to view.  The crowd was extreme but it was worth the effort to see it.", "publishedDate": "2020-03-05", "language": "en", "rating": 4}, {"id": 749315959, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d190166-r749315959-Basilica_of_the_Sagrada_Familia-Barcelona_Catalonia.html", "text": "This is a very special  Basilica that you should not miss.  Form the ornate trimmings to the detailed structure of hte building.  The below museum should be on your list while you are there. I would suggest a guide ; otherwise you may never know about the museum.", "publishedDate": "2020-03-05", "language": "en", "rating": 5}, {"id": 749311778, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d190166-r749311778-Basilica_of_the_Sagrada_Familia-Barcelona_Catalonia.html", "text": "Very amazing architecture, worth the trip to see.  If you go in the towers be aware that the stairs are narrow and confining, and lots of walking up and down stairs.  ", "publishedDate": "2020-03-05", "language": "en", "rating": 5}, {"id": 749291233, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d190166-r749291233-Basilica_of_the_Sagrada_Familia-Barcelona_Catalonia.html", "text": "So beautiful inside I almost cried.  Would recommend anyone pay the ticket price and go inside.  Downstairs is not very well signposted and was almost missed until I needed the loo.  Lots of helpful staff on hand but the security guards are a little rough! ", "publishedDate": "2020-03-05", "language": "en", "rating": 5}, {"id": 749280448, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d190166-r749280448-Basilica_of_the_Sagrada_Familia-Barcelona_Catalonia.html", "text": "If you are in Barcelona, you cannot miss this amazing structure!  You must get the audio tour and towers.  It explains every detail which is numbered by sections, so I only recommend this with audio. I am afraid of heights, but I went up to the tower and really enjoyed it. The views are breathtaking and you will never see a Basilica quite like it.", "publishedDate": "2020-03-05", "language": "en", "rating": 5}, {"id": 749276031, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d190166-r749276031-Basilica_of_the_Sagrada_Familia-Barcelona_Catalonia.html", "text": "This place is amazing to look at but I recommend a guided tour to explain the history and give more insight into the mind and works of Gaudi. Breathtaking!", "publishedDate": "2020-03-05", "language": "en", "rating": 5}, {"id": 749234051, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d190166-r749234051-Basilica_of_the_Sagrada_Familia-Barcelona_Catalonia.html", "text": "This place felt underrated being on the outside compared to when you walk inside! Breathtaking. Shame the towers weren't open due to wind but still a spectacular monument ", "publishedDate": "2020-03-05", "language": "en", "rating": 5}, {"id": 749233500, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d190166-r749233500-Basilica_of_the_Sagrada_Familia-Barcelona_Catalonia.html", "text": "Don't miss this attraction is a must if you visit Barcelona!\nI didn't like that the area is very crowded.\n\nThe attraction itself is stunning!", "publishedDate": "2020-03-05", "language": "en", "rating": 4}, {"id": 749169516, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d190166-r749169516-Basilica_of_the_Sagrada_Familia-Barcelona_Catalonia.html", "text": "Very interesting interior. Have been twice previously but was unable to purchase tickets. Exterior is also worth seeing. Worth a visit, especially if you are interested in architecture/art! Purchase tickets online well in advance!", "publishedDate": "2020-03-04", "language": "en", "rating": 5}]}}]