[{"locationId": 11932627, "name": "Monument to Joan Güell i Ferrer", "placeType": "ATTRACTION", "reviewListPage": {"reviews": [{"id": 689591370, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d11932627-r689591370-Monument_to_Joan_Guell_i_Ferrer-Barcelona_Catalonia.html", "text": "This monument stands in tribute to Joan Gúell, a 19th century Spanish industrialist, politician and  economist. He main legacy was the creation of an industrial conglomerate, Tous, Ascacíbar and Compañía that specialised in casting iron and the construction of heavy machinery for the textile industry. Oddly for an economist, he advocated protectionism, but maybe that’s a good thing if it’s protectionism for Catalan businesses from his point of view. Who knows.\n\nThis monument sits on the Gran Via de les Corts Catalanas, at the western end of Jardins de la Reina Victoria. The monument stands16 meters high, is crowned by a bronze sculpture of Joan Güell. The sculpture stands atop a square pedestal with relief sculptures on three sides. The front is engraved with his name and family crest. The other three sides depict sculptures representing allegories of agriculture, trade and industry.\n\nNothing amazing. Okay if you happen to be in the area. Otherwise, don’t go out of the way.", "publishedDate": "2019-07-14", "language": "en", "rating": 3}, {"id": 667680857, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d11932627-r667680857-Monument_to_Joan_Guell_i_Ferrer-Barcelona_Catalonia.html", "text": "Free \nVisit Duration: 5 minutes.\nLocation: Gran.Via de les Corts Catalanes/Rambla de CataluniaGran \n\nThe original monument from 1888 included a bronze statue on a richly decorated pedestal with allegorical statues commemorating a beloved politician, economist and industrialist. He was a very successful businessmen fighting for protectionism In 1936 the monument was destroyed. An almost identical statue of stone was made, but the pedestal was made much more simple.\n\nStone statue on a high pedestal with reliefs:\n\nTrade: Woman with caduceus and a ship in the background.\n\nIndustry: Woman with a wool spindle and a spinning wheel in the background.\n\nAgriculture: Woman with grapes and corn.", "publishedDate": "2019-04-19", "language": "en", "rating": 4}]}}]