[{"locationId": 597513, "name": "Major Synagogue", "placeType": "ATTRACTION", "reviewListPage": {"reviews": [{"id": 750029775, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d597513-r750029775-Major_Synagogue-Barcelona_Catalonia.html", "text": "Moving experience, fascinating history.If you are visiting Barcelona, highly recommended. Notice how the Synagogue is below ground after centuries of building the street above,  Notice how narrow the streets are as they date from the Middle Ages....", "publishedDate": "2020-03-09", "language": "en", "rating": 5}, {"id": 749933934, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d597513-r749933934-Major_Synagogue-Barcelona_Catalonia.html", "text": "This small synagogue is one of the oldest in all of Europe, dating back to the 3rd-4th century. While it is not currently used for services, it remains a testament to the Jewish people who were were massacred during the Inquisition that after all of these centuries, the synagogue remains and both Jews and non-Jews from around the world make a point of visiting this holy place. Inside, I listened to an informative 10-15 minute history of the synagogue presented by a pleasant young lady who works at the synagogue. The items on display are not original to the synagogue, but have been donated. One such item is a 500 year-old Torah. Be sure to see the lovely stained glass window as well as the original synagogue foundation which is visible beneath glass flooring. Allow a half-hour. Admission is 3.50.", "publishedDate": "2020-03-08", "language": "en", "rating": 4}, {"id": 729654410, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d597513-r729654410-Major_Synagogue-Barcelona_Catalonia.html", "text": "A guide gives very good explanations in at least Spanish, Hebrew, and English—perhaps other languages as well.  Interesting and historically of great value.  I think it was 3.50 euro each.", "publishedDate": "2019-11-29", "language": "en", "rating": 5}, {"id": 728788945, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d597513-r728788945-Major_Synagogue-Barcelona_Catalonia.html", "text": "We enjoyed the visit very much. However, the meeting point did not open until 11am and our ticket was timed for 10.45 am! The guide at the Synagogue , Sofia, was excellent .", "publishedDate": "2019-11-25", "language": "en", "rating": 4}, {"id": 720284733, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d597513-r720284733-Major_Synagogue-Barcelona_Catalonia.html", "text": "My mother and I enjoyed this tour. However, it was confusing as to where the 3D experience was. We first went to the MUHBA and it is NOT there. It is at a shop around the corner. Some more instructions on how to find this would be helpful.", "publishedDate": "2019-10-21", "language": "en", "rating": 4}, {"id": 716750387, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d597513-r716750387-Major_Synagogue-Barcelona_Catalonia.html", "text": "This tiny little synagogue was  very close to la ramblas where I was staying. Having a Jewish heritage I decided to go. \nThe place is only two rooms but filled with a lot of history. The two women working there were super nice and knowledgeable. I am so glad I visited it!!", "publishedDate": "2019-10-09", "language": "en", "rating": 4}, {"id": 706116842, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d597513-r706116842-Major_Synagogue-Barcelona_Catalonia.html", "text": "Its a wonderful spiritual experience ...magic place  with very high vibration!Its a must if you feel open mind spiritually!", "publishedDate": "2019-09-03", "language": "en", "rating": 5}, {"id": 702490151, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d597513-r702490151-Major_Synagogue-Barcelona_Catalonia.html", "text": "Amazing place which somehow has survived despite the violent anti-Semitism which killed off most of Barcelona’s Jews at the end of the 14th century — followed by the Inquisition and WWII. The synagogue is very sweet, small but has a tremendous history. Short but informative tour. Don’t miss it.", "publishedDate": "2019-08-24", "language": "en", "rating": 5}, {"id": 697832770, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d597513-r697832770-Major_Synagogue-Barcelona_Catalonia.html", "text": "For part of the  Jewish history in Barcelona, this is a must visit.  Its meaningful, and historic, but its really a tiny museum, not a working shul, with only 2 rooms.  But if you are interested in our history, you must go there.  We went there as part of our Jewish tour. They give a short historical history there which lasts about 15 minutes.", "publishedDate": "2019-08-11", "language": "en", "rating": 5}, {"id": 686737514, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d597513-r686737514-Major_Synagogue-Barcelona_Catalonia.html", "text": "Hidden in the Jewish Quarter you will experience a walk through history, learning about the Jewish community dating back to Roman ages, the discovery of the synagogue and its restoration. Great artifacts were brought in from different places around the world and we even learned that there are small private events are still held inside from time to time. Nora was knowledgeable and so kind showing us around.   ", "publishedDate": "2019-07-04", "language": "en", "rating": 5}, {"id": 685802897, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d597513-r685802897-Major_Synagogue-Barcelona_Catalonia.html", "text": "A little tricky to find the synagogue, but well worth it.  Very tiny.  The \"guided tour\" (there were 3 of us) made the visit more meaningful.  ", "publishedDate": "2019-07-01", "language": "en", "rating": 5}, {"id": 682247559, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d597513-r682247559-Major_Synagogue-Barcelona_Catalonia.html", "text": "The whole Call was a really neat little bit of Barcelona I had not expected to exist before researching. The synagogue was tiny and they offer short tours for very cheap.", "publishedDate": "2019-06-17", "language": "en", "rating": 4}, {"id": 658635628, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d597513-r658635628-Major_Synagogue-Barcelona_Catalonia.html", "text": "I had visited last year. The presentation of the history of the place is worth listening to. I'm so pleased that this place has been preserved.", "publishedDate": "2019-03-15", "language": "en", "rating": 4}, {"id": 644772983, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d597513-r644772983-Major_Synagogue-Barcelona_Catalonia.html", "text": "It's so fascinating to learn more about the Jewish community in Barcelona.  This synagogue was hidden for a long time after Jews were expelled in 1492 and was only recently rediscovered.  It's a small space, but well worth a visit to learn more about the community.", "publishedDate": "2019-01-09", "language": "en", "rating": 5}, {"id": 640633370, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d597513-r640633370-Major_Synagogue-Barcelona_Catalonia.html", "text": "Trying to squeeze as much in the unfortunate limited time we had, we coupled the gothic walking tour with the Jewish Quarter. We arrived to the synagogue and the two ladies in charge informed us that the place has just closed. Emphasis in “just”. My wife asked if we could take a brief peak and they became rude. We even told them we were leaving the next day. Considering that 3 other places allowed us to peak inside briefly after closing made it more disappointing. Not that it should make a difference, but we tried in English, Spanish and Hebrew to plead our case. Made us feel back in 1492, this time by our own. ", "publishedDate": "2018-12-19", "language": "en", "rating": 1}, {"id": 626201380, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d597513-r626201380-Major_Synagogue-Barcelona_Catalonia.html", "text": "This small sanctuary is interesting in still existing in some form after the Jewish citizens were expelled  in the 15th century.  The space is small, but we did enjoy the presentation by the docent about the history and how it was reclaimed.", "publishedDate": "2018-10-18", "language": "en", "rating": 5}, {"id": 623351151, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d597513-r623351151-Major_Synagogue-Barcelona_Catalonia.html", "text": "it was very interesting to find this tiny Synagogue in the middle of the Barrio Gotic and it is thought to be one of the oldest Synagogues in Europe. It was used for many other things over the years and was reopened as a museum in 2002. It is very small with only 2 rooms, and there are some artifacts that have been donated. There is an area in one of the rooms that has a glass floor, where you can see the excavation that has been done.\nThere is a docent there that will give a short tour with an explanation of the history of the Synagogue.", "publishedDate": "2018-10-08", "language": "en", "rating": 5}, {"id": 617355349, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d597513-r617355349-Major_Synagogue-Barcelona_Catalonia.html", "text": "We were looking for this temple for days and no one knew where it was but one day a street cleaner I asked and he direct us to this magnificent place in history. All of a sudden I was transported to the late 15 century before the Queen Isabela ran the jews out of Spain this is the last one left I recommend to all of the jewish faith to visit this site", "publishedDate": "2018-09-17", "language": "en", "rating": 5}, {"id": 616465253, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d597513-r616465253-Major_Synagogue-Barcelona_Catalonia.html", "text": "Visited this tiny place as the Jewish Museum was closed despite it being within advertised opening times.  However, the staff gave a short but very informative talk about the history and were quite happy for us to soak up the very ancient atmosphere in our own time.  It really is very small and there is little to see but does give a real sense of ancient Jewish Barcelona.", "publishedDate": "2018-09-14", "language": "en", "rating": 4}, {"id": 610671308, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d597513-r610671308-Major_Synagogue-Barcelona_Catalonia.html", "text": "Only three Spanish cities have synagogues remaining after the expulsion of 1492 (e.g. Segovia), but Cordoba’s is closed for renovations. I wanted to visit Barcelona’s Synagogue and saw it alone, since my husband got lost on the way from a different place (directions of Google maps do not always appear on the narrow path between ancient stone walls). The walk to the tiny old Synagogue is not hard from Placa Catalunya, and it has interesting sights along the road. Placa Nova has entertainers, outside the Cathedral beside the Gaudi exhibit centre at Carrer del Bisbe. Take the sharp turn onto Portal “de L’Angel” just past the cathedral’s rear doors, and then the El Call (narrow street) of medieval “Aljama” will lead you to one of the most ancient synagogues.  You’ll need to duck right into a hidden door to see half of the ancient original Synagogue on Carrer de Marlet. It was discovered in the 21st century under a former warehouse. A Scottish Protestant Christian, Mr. Andrew, funded the recovery of the synagogue’s contents, which fill basically 1-2 rooms of the site’s entirety. The 3rd century Roman walls are intact and continue under the Vinateria del Call next door, as seen similarly of mitzvahs (possibly late 13th c) under Caelum and Oliver cafes—visible upon request. Do not arrive a half hour before the synagogue’s closing, or you will miss the “tour” /explanations, which provide the highlight of this sacred site. The staff are bilingual (Catalon-Spanish and English), and there is a meagre gift shop facing the entrance, where you pay €2 to enter. FatTireBikeTours is facing the entrance of the Synagogue, and holes for mezuzahs can be identified on the doorposts of nearby homes. You might spend 30-45 minutes at the synagogue, and then visit the small square at El Call.", "publishedDate": "2018-08-26", "language": "en", "rating": 4}, {"id": 607751655, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d597513-r607751655-Major_Synagogue-Barcelona_Catalonia.html", "text": "As should be expected, there’s not much to see and nothing original except the rooms. Having said that, the brief presentation was worth the visit. Especially to understand the building’s history and the way the inner walls were changed to make sure the “building” faced Jerusalem. Really impactful after a visit to Sagrada... Always powerful to understand Jewish history and how it is so hard to trace and honour. Definitely worth a visit.", "publishedDate": "2018-08-18", "language": "en", "rating": 5}, {"id": 607566982, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d597513-r607566982-Major_Synagogue-Barcelona_Catalonia.html", "text": "Interesting place to visit.  It is easy to find and the presentation is very informative.  It is very inexpensive and we were happy to help with the small donation ticket.", "publishedDate": "2018-08-18", "language": "en", "rating": 5}, {"id": 604753759, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d597513-r604753759-Major_Synagogue-Barcelona_Catalonia.html", "text": "As Jews interested in Jewish history, we found this place very interesting and worthwhile.  Somewhat difficult to find and a very small space, but has an old feel and it was great to see other visitors interested, including Israelis.  Maybe less interesting for the general population.  The fee is more of a donation and there is a small gift shop as well.  We did not realize that at one point Jews made up 15% of the population of Barcelona.  Great visit that we will always remember.", "publishedDate": "2018-08-09", "language": "en", "rating": 5}, {"id": 603076028, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d597513-r603076028-Major_Synagogue-Barcelona_Catalonia.html", "text": "A disappointment! I cannot believe they charged €3.50, which they call a \"donation ticket\", for a 10 minute presentation about the synagogue. The synagogue is comprised of 2 small rooms which half is occupied by the ticket counter and souvenirs. The rest are bits and pieces  donated to the synagogue by individuals worldwide. We were there for less than 20 minutes which included the wait time for the presentation to start. They should not call the ticket a donation if I'm required to pay it and further more, the ticket should not be €3.50 for what they offered. Use that money towards a scoop of ice cream. Not recommended! ", "publishedDate": "2018-08-05", "language": "en", "rating": 2}, {"id": 595120511, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d597513-r595120511-Major_Synagogue-Barcelona_Catalonia.html", "text": "If you love history, if you love historical places, do yourself a favor and seek out this synagogue. You feel the energy the minute you walk through the small, unassuming entryway. Nice presentation given, but the real gem is just experiencing the antiquity of the place.", "publishedDate": "2018-07-10", "language": "en", "rating": 5}, {"id": 586460449, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d597513-r586460449-Major_Synagogue-Barcelona_Catalonia.html", "text": "Short and sweet, small and wonderful! Yes we had to pay 3.5Euro, but I was happy to contribute to it for the upkeep of keeping the synagogue.  What a gem to still have the building around when you think of the time that has elapsed since Jews lived in Spain and all the destruction surrounding them.  Synagogues back then could not be built larger than the smallest church. Synagogues back then could NOT be built larger than the smallest church.  hmmm, let that sink in.  It is small.", "publishedDate": "2018-06-10", "language": "en", "rating": 5}, {"id": 573184306, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d597513-r573184306-Major_Synagogue-Barcelona_Catalonia.html", "text": "Great place for history buffs or just jews trying to learn local culture. However, 4 stars because you cannot come in without paying, somewhat unsettling.", "publishedDate": "2018-04-13", "language": "en", "rating": 4}, {"id": 565271639, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d597513-r565271639-Major_Synagogue-Barcelona_Catalonia.html", "text": "Walking around the Call, understanding the Jewish roots in the economy of a thriving 10th century Barcelona is important in understanding the place of a strong Israel for Judiasm, Zionism. ", "publishedDate": "2018-03-08", "language": "en", "rating": 5}, {"id": 553223517, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d597513-r553223517-Major_Synagogue-Barcelona_Catalonia.html", "text": "The shul is small, but on a walking tour of the old quarter it is worth the stop. 10minute presentation with the more \"recent\" history of the shul and some amazing artifacts. Such rich history.", "publishedDate": "2018-01-11", "language": "en", "rating": 5}, {"id": 551673200, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d597513-r551673200-Major_Synagogue-Barcelona_Catalonia.html", "text": "The synagogue is in ruins and below the street level but is well worth seeing because of the presentation provided. It is small but has a huge history. And it’s nice to support the community in recoveri g this treasure. ", "publishedDate": "2018-01-04", "language": "en", "rating": 5}, {"id": 549481153, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d597513-r549481153-Major_Synagogue-Barcelona_Catalonia.html", "text": "Visiting this synagogue is certainly worthwhile, especially if you have a cultural connection. We received a very good explanation in Hebrew on-site and also took an additional walking tour offered by the same staff, which more insight and additional perspective on the history of the community.", "publishedDate": "2017-12-27", "language": "en", "rating": 5}, {"id": 549370377, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d597513-r549370377-Major_Synagogue-Barcelona_Catalonia.html", "text": "The synagogue. Was it nice a vibrant place now reduced to a mere two rooms  believe w street level. The population.  of  in Barcelona was  about 20 pct if  all people in the city , the exclusion drove them out in 1492 many to morocco, Middle East and further east in Europe.  The artifacts make this more a museum but I understand that small services are still held  here. Very nice ark and  Torah ornaments are here and it was nice to visit.\nA small fee to enter is needed to get in ", "publishedDate": "2017-12-26", "language": "en", "rating": 5}, {"id": 530523867, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d597513-r530523867-Major_Synagogue-Barcelona_Catalonia.html", "text": "Stopped by the synagogue today and did the 15 minute lecture and looked around. Well worth the three euros. Very few people here. Check it out", "publishedDate": "2017-10-06", "language": "en", "rating": 5}, {"id": 522429526, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d597513-r522429526-Major_Synagogue-Barcelona_Catalonia.html", "text": "a tiny, hidden almost nothing space gives the visitor a reat inside view of how a group of people were oppressed for their beliefs. It makes you think about yourself and how you treat others who seem different from you. It still exists all over the world to this minute...opression and maltreatment because people were born different.", "publishedDate": "2017-09-07", "language": "en", "rating": 4}, {"id": 518025693, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d597513-r518025693-Major_Synagogue-Barcelona_Catalonia.html", "text": "Unfortunately the synagogue was closed when we arrived on Sunday at about 4pm.\nBy luck we went around the building and found a small museum.\nWatched a short film for about 5 mins which was interesting.\nThere used to be 6 synagogues in Barcelona.\nThe museum strangely was free of charge.\nA quick 15 minute look is enough time.\nShame there was not more to see.", "publishedDate": "2017-08-27", "language": "en", "rating": 4}, {"id": 516072329, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d597513-r516072329-Major_Synagogue-Barcelona_Catalonia.html", "text": "This was a very small temple in the middle of the Jewish Quarter of Barcelona.  We made a small donation and sat for a 10-15 lecture on the history of the Jewish people in Barcelona which was very interesting.There was a small gift shop as well.  This is a must see for Jews visiting Barcelona.", "publishedDate": "2017-08-21", "language": "en", "rating": 5}, {"id": 514284959, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d597513-r514284959-Major_Synagogue-Barcelona_Catalonia.html", "text": "We found the synagogue down a small street in the old gothic quarter of town. A donation of €3.50 is expected to help with the upkeep. The talk was about 10 minutes and very interesting to hear about the Jewish history of Barca, even with it being a sad one. The tour guide spoke very good English and was welcoming. 🕍🇨🇳", "publishedDate": "2017-08-17", "language": "en", "rating": 4}, {"id": 506636829, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d597513-r506636829-Major_Synagogue-Barcelona_Catalonia.html", "text": "Highly recommended so much history in so many centuries !!! You can see one of the first Jewish community histories of Europe! Elightening! ", "publishedDate": "2017-07-28", "language": "en", "rating": 5}, {"id": 506256834, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d597513-r506256834-Major_Synagogue-Barcelona_Catalonia.html", "text": "For us it was a must see so we went out of our way to try and find this tiny spot.  It was funny to us when we entered this small doorway to be greeted by two young ladies who sold us on the tour which consisted of one room and a 10 minute talk. At first we thought we were taken advantage of but by the end of the educational session we were happy to have contributed to the cause and learned quite a bit. My only regret is that I wish they offered more information. ", "publishedDate": "2017-07-27", "language": "en", "rating": 4}, {"id": 505829297, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d597513-r505829297-Major_Synagogue-Barcelona_Catalonia.html", "text": "Fascinating and important part of the Barcelona and Spain jewish community! Worth a visit!\nTake a tour, it takes you 5 minutes, and go straight to the Chabad center, where you can get a virtual reality tour, and see how was the jewish quarter on the medieval era, the living and the leaders!", "publishedDate": "2017-07-26", "language": "en", "rating": 5}, {"id": 503453699, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d597513-r503453699-Major_Synagogue-Barcelona_Catalonia.html", "text": "Go back in time and enjoy the splendor and magic of this ancient Jewish sight in Barcelona's old Jewish quarter. Dating back to the 1300s it's a special place to visit. The tour is short (15-20 Minutes) and the synagogue is small but you can feel and live the history of the Jewish people at this very impressive place. ", "publishedDate": "2017-07-19", "language": "en", "rating": 5}, {"id": 496864239, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d597513-r496864239-Major_Synagogue-Barcelona_Catalonia.html", "text": "We like to learn about the Jewish history of places we travel.  We made the requested 3.5 Euro per person donation and received a 10 minute history of Jews in Barcelona, in general, and of the Synagogue, in particular.  Quite fortunate that the benefactor was able to obtain and somewhat restore this synagogue from seven hundred years ago.", "publishedDate": "2017-06-28", "language": "en", "rating": 4}, {"id": 478040238, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d597513-r478040238-Major_Synagogue-Barcelona_Catalonia.html", "text": "Probably the oldest Synagogue in Europe, the tiny space (barely room for 20 people) is steeped in the troubled history of the Medieval Jewish community of Barcelona. The little, basement room is no longer used for worship, but volunteers welcome visitors and, for a few Euros, give an interesting insight into this fascinating aspect of Catalonian history.", "publishedDate": "2017-04-22", "language": "en", "rating": 5}, {"id": 462433339, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d597513-r462433339-Major_Synagogue-Barcelona_Catalonia.html", "text": "We visited here while exploring the old Jewish Quarter.\nIt is a a hidden gem and well worth a visit. There are two rooms (the foyer and the main room), with a small selection of gifts and an excellent guide book (worth buying to fully appreciate the history of the Synagogue). The foyer features excavations that you can see and walk over (see through floor).\nIn the main room there is a collection of pewter and silverware used in Jewish ceremonies as well as a beautiful stained glass window and other historic items.\nA short talk (in English) is given every 20 minutes or so. This was really informative and brought the history to life for us. Questions are invited after the talk. The stakk were friendly and happy to help.\nPlease note: You are free to take photographs but NOT during the talk.\nThere are a few step steeps down into the Synagogue, so please be aware of that if anyone is mobility impaired, The rest of the site is level ground.\nHighly recommended.", "publishedDate": "2017-02-24", "language": "en", "rating": 5}, {"id": 446970385, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d597513-r446970385-Major_Synagogue-Barcelona_Catalonia.html", "text": "I love to see old historic things, but this is special to see. They have a guide who will give you a 10 minute breakdown of the history, the collections and general information about the synagogue and it's discovery. This is a very simple visit, two rooms, but enjoyed it a lot. ", "publishedDate": "2016-12-27", "language": "en", "rating": 5}, {"id": 443762482, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d597513-r443762482-Major_Synagogue-Barcelona_Catalonia.html", "text": "We tried to find medieval synagogues in Catalonia and this was the only one we found still standing with four walls and a roof!\nIt's Small as Jews were only allowed to build synagogue as big as smallest church, so  tour doesn't take very long. The woman guide is excellent, giving a thorough and Very interesting  history of the building and the medieval Jewish community. Entrance fee very inexpensive at 2.50 euro a person -- well worth it!", "publishedDate": "2016-12-12", "language": "en", "rating": 5}, {"id": 441225280, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d597513-r441225280-Major_Synagogue-Barcelona_Catalonia.html", "text": "This tiny museum, once part of the main synagogue before the expulsion of the Jews in the 13th century, is a little snippet of Barcelona's past. The brief explanation of the history is worth your time, then a short look at the structure and exhibits. This does not take up a lot of tourist time but is worth it for your overall insight into Spanish history. It is easy to find if you take Carrer Ferran off the Ramblas, then you will see the streets marked Carrer de Call.", "publishedDate": "2016-11-30", "language": "en", "rating": 4}, {"id": 441210878, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d597513-r441210878-Major_Synagogue-Barcelona_Catalonia.html", "text": "After walking through the ancient Jewish section of Barcelona I found myself outside the door of the Sinagoga Mayor or the Major Synagogue of Barcelona....A misnoma if a person expected to see a grand cathedral.....Actually it is no more than a \"cavern\" like room under the street level.  The interior was sparsely furnished except for the Ark, the Torah and the Eternal Light along with displays of Judaica that had been donated.  What made this such a wonderfully moving experience is the realization that this Synagogue represents a history going back over 1000 years in the lives of the Jews of Barcelona and those forced to convert to Christianity while secretly practicing the Jewish ritual during the Spanish Inquisition... and still functions today as a \"Shul\" for special occasions.", "publishedDate": "2016-11-30", "language": "en", "rating": 5}, {"id": 435435499, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d597513-r435435499-Major_Synagogue-Barcelona_Catalonia.html", "text": "This is a remarkable little bit of Barcelona history. Tucked away in a tiny street in the old city you enter through a low insignificant  door back in time to the expulsion of the Jews from Spain. The short talk was informative and enlightening. Visit to help preserve this piece of history.", "publishedDate": "2016-11-07", "language": "en", "rating": 5}, {"id": 428409981, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d597513-r428409981-Major_Synagogue-Barcelona_Catalonia.html", "text": "I visited this amazing space in September. I would recommend for everyone to see it as a way to understand the experiences of Sephardic Jews in Spain. They will give you a 5 minute presentation and you are free to walk around the space. It is a very small place and will probably take 20 minutes in total. It is worth visiting. It is a bit tricky to find so be on the look out for the signs. ", "publishedDate": "2016-10-16", "language": "en", "rating": 5}, {"id": 422309294, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d597513-r422309294-Major_Synagogue-Barcelona_Catalonia.html", "text": "Just two rooms in a building in a side street, and down some steep stairs - for a 2.50 euro donation you can see the excavations of the former synagogue which was on the site, and enjoy a 15-minute presentation about the history of the Jewish faith in Barcelona over the centuries.\nWorth a half hour in your schedule.", "publishedDate": "2016-09-25", "language": "en", "rating": 3}, {"id": 420122044, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d597513-r420122044-Major_Synagogue-Barcelona_Catalonia.html", "text": "We had a very informative talk from a friendly young lady here. We looked around the exhibits. There was a little shop with some great things to buy. We really enjoyed our visit and learnt a lot ", "publishedDate": "2016-09-19", "language": "en", "rating": 5}, {"id": 420023288, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d597513-r420023288-Major_Synagogue-Barcelona_Catalonia.html", "text": "It's a nice effort that they've tried to do something with this venue but there's really my a lot to see. \n\nI entered the building / shop and asked where the synagogue was before being told \"this is it\". I then had to pay 2.50€ to enter the second room which was about the same size but contains the \"temple\" where services are held. \n\nA woman gave a 5-10 minute talk about the building and we were then left to look around and take photos. \n\nNot a lot here then but I'm glad they are trying to do something interesting with the building. That being said I don't really recommend it as an essential visit. ", "publishedDate": "2016-09-18", "language": "en", "rating": 3}, {"id": 412610199, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d597513-r412610199-Major_Synagogue-Barcelona_Catalonia.html", "text": "Worth the visit. They also have a guided tour of the Jewish quarter that is excellent. We had Nora as our guide, and she was great. ", "publishedDate": "2016-08-30", "language": "en", "rating": 4}, {"id": 395938406, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d597513-r395938406-Major_Synagogue-Barcelona_Catalonia.html", "text": "I first learned about this synagogue when touring Sandman Free Walking tour, but we just passed by. So we decided to return, to learn more about its history. The synagogue is small and there are not a lot of objects inside, but the visitors are offered a 15 - 20 minutes explanation about how it was found, what hapenned to the Jewish quarters and one can learn about Barcelona Jewish community today. It is worth to hear the terrible faith of the Jews and learn about an important community of medieval donation was 2.50 Euros per person and it was worth it.", "publishedDate": "2016-07-23", "language": "en", "rating": 5}, {"id": 393086381, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d597513-r393086381-Major_Synagogue-Barcelona_Catalonia.html", "text": "This two room museum is a bit hard to find, but worth it if you are interested in experiencing the history of Judaism in Barcelona. Not tons to see or learn, more so a place to imagine the struggles of Jews as early as the sixth century. Visit and  support the charity that keeps this synagogue open within a city of churches. ", "publishedDate": "2016-07-15", "language": "en", "rating": 5}, {"id": 390543583, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d597513-r390543583-Major_Synagogue-Barcelona_Catalonia.html", "text": "I had read about this synagogue prior to our departure and I am so glad we went. It is small, only 2 rooms, but the amount of history packed into these rooms far surpasses the physical space. The curators tell you the history of the synagogue. Such an amazing feeling sitting there. All our questions were answered professionally. Look on the wall outside and lower down the alley to see Hebrew carving on the walls.", "publishedDate": "2016-07-08", "language": "en", "rating": 5}, {"id": 384657805, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d597513-r384657805-Major_Synagogue-Barcelona_Catalonia.html", "text": "Stopped in to see the former Major Synagogue (biggest) of pre-Inquisition Barcelona.\n\nEntrance is €2 and what you see is in two rooms. In the first room you can see excavations down to the original floor dating back to about the 3rd century CE. Amazing. In the second room you'll be given a short lecture by a docent covering the building's history and also how it was rediscovered and acquired. There's also a nice exhibit of Judaica. The rest of the former synagogue is owned by the neighboring restaurant so what you see is the former men's area only.\n\nIf you're interested in the history of Jews in Spain this is worth a visit. It is small, however, and a casual visitor is likely to be underwhelmed. Small gift shop as well.", "publishedDate": "2016-06-21", "language": "en", "rating": 4}, {"id": 383353575, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d597513-r383353575-Major_Synagogue-Barcelona_Catalonia.html", "text": "This visit was as extraordinary as it was unexpected. You think you will visit a small synagogue as you do in other cities but this is a braiding of archeology and social history as well as the key to the population and governmental shifts that occurred with the plague and an explanation of the inquisition (hint, it's the economy (and the usual scapegoating of the Jews, stupid...) ", "publishedDate": "2016-06-17", "language": "en", "rating": 5}, {"id": 382496413, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d597513-r382496413-Major_Synagogue-Barcelona_Catalonia.html", "text": "Felt fortunate and validated to read about and observe the factual history of the Jewish expulsion and inquisition that occurred in Spain during the 15th century. The contributions made to Spain (and the world) by these philosophers, astronomers, doctors, and religious people cannot and should not be marginalized or forgotten. The impact of this visit will resonate forever...", "publishedDate": "2016-06-14", "language": "en", "rating": 5}, {"id": 379369528, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d597513-r379369528-Major_Synagogue-Barcelona_Catalonia.html", "text": "This synagogue depicts the hardships of the Jewish religion in Spain and how it endured the roadblocks established in its day.  Although not much to see from a religion standpoint it is attempting to reflect the desire of Jews to acknowledge the longlasting ability of the religion to survive.  A few dediated families hold this Synagogue together and events do take place especially with the few families mentioned.  Hard to find but the mashgeach from the Macabee Kosher restaurant\nbrought us to the site.  Everyone should visit to be supportive of their efforts and maybe other important venues will be uncovered and repossesed.", "publishedDate": "2016-06-03", "language": "en", "rating": 5}, {"id": 379064104, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d597513-r379064104-Major_Synagogue-Barcelona_Catalonia.html", "text": "This synagogue, perhaps the oldest in all of Europe, carries with it the most interesting history. You can tour the two rooms, listen to the timeline of the synagogue, and make a purchase that will support ongoing restoration in a visit of 30 minutes or less. Your admission fee of 2,5€ goes directly to the preservation of the synagogue. It is breathtaking in its historic beauty. Do not miss this look into the medieval era of Judaism in Spain, as it appeared before the Inquisition.   ", "publishedDate": "2016-06-02", "language": "en", "rating": 5}, {"id": 378133194, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d597513-r378133194-Major_Synagogue-Barcelona_Catalonia.html", "text": "Worth finding, this is a two room , fifteen minute visit, 20 if you listen to the volunteer's spiel.  Very interesting to hear about the history of the building, nice artifacts though not from Barcelona. Most Jewish history in Spain is lost, glad this is around.", "publishedDate": "2016-05-30", "language": "en", "rating": 4}, {"id": 375675888, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d597513-r375675888-Major_Synagogue-Barcelona_Catalonia.html", "text": "Hard to find, but worth it. The ancient stones of a synagogue, the sad story with a hopeful ending is a piece of the Barcelona history puzzle", "publishedDate": "2016-05-22", "language": "en", "rating": 5}, {"id": 371338166, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d597513-r371338166-Major_Synagogue-Barcelona_Catalonia.html", "text": "Historically the presence of the Jews in Spain was quite significant. Almost all traces have been subsequently eradicated, therefore making this site one of great interest especially when contrasting this house of worship with the nearby grand Cathedrals.", "publishedDate": "2016-05-08", "language": "en", "rating": 3}, {"id": 371005381, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d597513-r371005381-Major_Synagogue-Barcelona_Catalonia.html", "text": "Tiny place... There are tours with a local guide in English and Hebrew, given pretty often (I think, there is more than one tour per hour)... ", "publishedDate": "2016-05-07", "language": "en", "rating": 4}, {"id": 368692886, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d597513-r368692886-Major_Synagogue-Barcelona_Catalonia.html", "text": "Very old synagogue, built on Roman ruins. Deserted by Jews since 1391. Rediscovered by an Argentinian Jew who came looking for it. Found the records of the building in the tax rolls kept at the cathedral. Interesting talk.", "publishedDate": "2016-04-29", "language": "en", "rating": 4}, {"id": 366010340, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d597513-r366010340-Major_Synagogue-Barcelona_Catalonia.html", "text": "The visit to the Old Main Synagogue is very moving as one of the only remnants of ancient Jewish presence in the heart of Barcelona. Please note that no prayers take place there today. You will need only about 20 minutes for the visit, but maybe more to locate the place. A recommended donation of 2.5 Euro is all the entrance costs.", "publishedDate": "2016-04-21", "language": "en", "rating": 4}, {"id": 365018926, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d597513-r365018926-Major_Synagogue-Barcelona_Catalonia.html", "text": "This little gem has its roots during Roman times which you can see in an excavated area on site.  Maybe if you're not Jewish it won't be the most memorable experience you have in Barcelona, but I still recommend it.  Jews have a rich history in Spain and though this is no longer functioning as a Jewish place of worship, the tour is informative and only a couple of euros. Leave a few extra euros in their donation box. I did tour the Sagrada Familia (a must) afterwards and the differences ate staggering!", "publishedDate": "2016-04-17", "language": "en", "rating": 5}, {"id": 364558356, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d597513-r364558356-Major_Synagogue-Barcelona_Catalonia.html", "text": "The oldest Synagogue in Europe dates back to the 3rd Century CE. It is quite small but the amount of history you can learn from it is amazing for 2.50 Euro. The synagogue is part museum part sanctuary with some very old artifacts.  It is at it's original street level which is well below the modern street so don't blink or you will miss it despite the sign that proclaims שלום (shalom) as you enter.", "publishedDate": "2016-04-16", "language": "en", "rating": 5}, {"id": 361793164, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d597513-r361793164-Major_Synagogue-Barcelona_Catalonia.html", "text": "Anyone who is aware of the tragic history of the Jews of Spain could hardly fail to be moved by this tiny synagogue - the oldest in Europe.\n\nThe friendly staff give a talk on the history fairly frequently which is very informative and thorough.\n\nThey also have a small collection of Jewish pewter (donated by a Protestant from Scotland apparently!) and a 17th century Sefer Torah donated by a Jewish guy from New York.", "publishedDate": "2016-04-05", "language": "en", "rating": 5}, {"id": 357813626, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d597513-r357813626-Major_Synagogue-Barcelona_Catalonia.html", "text": "I liked my visit to this synagogue in the Gotic Quarter. It has a story important to me as an Israelian. It is one of the oldest place of jewish warship in Europe but it lacks the atmosphere required (it is a young attraction and needs help to promote it and enrich it). The girls telling the story in hebrew are reciting fast and without enthusiasm (but with good will) and it misses the intention of such attraction. Hope it will improve.", "publishedDate": "2016-03-23", "language": "en", "rating": 3}, {"id": 357677650, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d597513-r357677650-Major_Synagogue-Barcelona_Catalonia.html", "text": "Unfortunately there are very few preserved buildings from the historic communities of Jewish Spain.  The Main Synagogue in the Ghetto used to be the seat of the Rashba.  Although there is not a lot to see and most of the display cabinets contain more recent artefacts, it is certainly worth a visit.  The small synagogue room and adjacent mikveh give a picture of life in pre-expulsion Catalonia.", "publishedDate": "2016-03-22", "language": "en", "rating": 4}, {"id": 353717672, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d597513-r353717672-Major_Synagogue-Barcelona_Catalonia.html", "text": "This tiny 2-room \"oldest synagogue in Europe\" is an important stop in Barcelona while walking through what was the Jewish quarters. If you're not paying attention you may stroll right by the door and sign that leads you into the space below street level. There is a small fee for entrance, followed by a brief explanation of what happened to the Jews in Spain. The guides are very passionate and informative on the history. It is now run as a museum; services do not take place in this location.", "publishedDate": "2016-03-07", "language": "en", "rating": 4}, {"id": 345201855, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d597513-r345201855-Major_Synagogue-Barcelona_Catalonia.html", "text": "Steep in history and almost forgotten in time. This synagogue was only discovered thanks to royal property tax records and renovation records.", "publishedDate": "2016-02-05", "language": "en", "rating": 5}, {"id": 340118720, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d597513-r340118720-Major_Synagogue-Barcelona_Catalonia.html", "text": "In the middle of the medieval quarter of old Barcelona, is an intersection with a small door and sign that points out the presence of an old, old synagogue that was forgotten for years before unearthed and now open for short tours. It consists of only two rooms (including a small shop where you can purchase books and momentos). There is a brief guided tour and you are free to take photos. The story of how the location of the synagogue was painstakingly rediscovered is fascinating.", "publishedDate": "2016-01-14", "language": "en", "rating": 4}, {"id": 335980735, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d597513-r335980735-Major_Synagogue-Barcelona_Catalonia.html", "text": "The tiny 2 room synagogue is an important stop in what was the Jewish quarter. Costs little to enter and the visit begins with a brief explanation of what happened to the Jews over the centuries, the building itself and the source of the artifacts ", "publishedDate": "2015-12-30", "language": "en", "rating": 4}, {"id": 334687567, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d597513-r334687567-Major_Synagogue-Barcelona_Catalonia.html", "text": "This is a Medieval time Synagogue reminiscence of the time before the Jews were expelled from Spain. It is run by the Jewish community as a museum. No Religious services here. you should follow the signs because it is very hard to find it. Once in the Old Jewish Quarter ask to see the other signs left from the old time and you should visit the new call museum  \"MUHBA El Call\" just check the opening hours not to miss it.", "publishedDate": "2015-12-23", "language": "en", "rating": 5}, {"id": 321876841, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d597513-r321876841-Major_Synagogue-Barcelona_Catalonia.html", "text": "This is a little gem and worth a visit even if you are not Jewish. The tiny anteroom and the slightly larger place for worship are evocative of a period of time long gone, Once you find it - that took a bit of map reading, twists and turns - viewing the site does not take more than 30 minutes. You should stick around fort the very brief English language guide, she took ten minutes max to explain the history of the synagogue. The hours are erratic -- we went one day, walked by the next by accident and it was closed despite the posted hours saying it should be open. If you are debating whether to visit, the surrounding streets are quite charming, it is near the cathedral and several very nice wine bars and restaurants, it is worth a visit.", "publishedDate": "2015-10-26", "language": "en", "rating": 5}, {"id": 321129773, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d597513-r321129773-Major_Synagogue-Barcelona_Catalonia.html", "text": "Step down and enter this unique, and ancient synagogue.  While it contains very few artifacts, some were brought back by Catalan Jews who were forcibly converted to Catholicism in the middle ages and returned sacred items. It's worth a short visit.", "publishedDate": "2015-10-23", "language": "en", "rating": 4}, {"id": 320761239, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d597513-r320761239-Major_Synagogue-Barcelona_Catalonia.html", "text": "The ancient main synagogue in Barcelona is one of the oldest in Europe.  The synagogue is tiny – two rooms below street level – disguising the fact that before the pogroms of 1391 and the expulsion of 1492, roughly 15%-20% of Barcelona’s population was Jewish.  The synagogue was lost to history until rediscovered in 1987. The synagogue is now open to the public for a small contribution (2.50 Euros per person).  It contains numerous interesting artifacts.  The docents give a short talk that is both moving and informative.  The synagogue still is not listed in many guidebooks, but it is worth a visit.", "publishedDate": "2015-10-21", "language": "en", "rating": 4}, {"id": 318685470, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d597513-r318685470-Major_Synagogue-Barcelona_Catalonia.html", "text": "My family visited the ancient synagogue site in the old Jewish Quarter in Barcelona and were profoundly moved.  The site is tiny - probably around 700 sq feet.  Walking thru the narrow streets gave me a sense of the Middle Ages and ducking into what wa since the main synagogue seemed like being present for that long ago world.  The docents gave a short presentation on the history of Barcelona's Jews of course ending in 1492.  The lack of an identifiable Jewish community in a major Western European country is startling to me.  My visit to this site gave me a sense of the history and the present.", "publishedDate": "2015-10-14", "language": "en", "rating": 5}, {"id": 316996955, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d597513-r316996955-Major_Synagogue-Barcelona_Catalonia.html", "text": "The synagogue is very small and the tour rather short, but certainly worth a visit if you're in the area. The Jewish population in Barcelona was a very significant part of the city until the 15th century. Nice to learn about this aspect between visiting all the huge cathedrals around the city.", "publishedDate": "2015-10-07", "language": "en", "rating": 5}, {"id": 316280104, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d597513-r316280104-Major_Synagogue-Barcelona_Catalonia.html", "text": "The experience is great. The guide was very passionate and the history is just fantastic.  There is sinage up so it was quite easy to find.  ", "publishedDate": "2015-10-05", "language": "en", "rating": 4}, {"id": 315383662, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d597513-r315383662-Major_Synagogue-Barcelona_Catalonia.html", "text": "A tiny, tiny underground 2 room temple... Last residue of a small part of past Jewish life. Charming and interesting to all of who love visiting Jewish temples of the world. Wonderful to see. ", "publishedDate": "2015-10-01", "language": "en", "rating": 4}, {"id": 314477691, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d597513-r314477691-Major_Synagogue-Barcelona_Catalonia.html", "text": "There is so little left of the Jews of the Iberian Peninsula. It is worth a trip to visit the little synagogue that is little more than a cave. There are some artifacts and scrolls. Please donate some euros to keep the shul open. There are also a few engraved stones on the adjoining streets.", "publishedDate": "2015-09-28", "language": "en", "rating": 4}, {"id": 312372165, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d597513-r312372165-Major_Synagogue-Barcelona_Catalonia.html", "text": "While we travel from country to country we visit as many Jewish synagogues, cemeteries and museums as we can. \n\nThis tiny GEM, is almost a walk by. Don't miss it!\n\nThis treasure was built on top of Roman ruins. \n\nThe short and informative talk answers many questions that arise after looking around.\nA nice amount of collected artifacts have been donated to this tiny synagogue. \n\nThere is an entrance fee 2.50€ well worth it!\n\nIt opens at 10:30 am.", "publishedDate": "2015-09-21", "language": "en", "rating": 5}, {"id": 309866707, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d597513-r309866707-Major_Synagogue-Barcelona_Catalonia.html", "text": "A really interesting stop in the gothic quarter in Barcelona.  For $2.5 Euros a guide will explain the history of the synagogue and the Jewish history in Spain.  It was very informative with lots of interesting artifacts and a terrific guide who answered all of our questions.  Definitely take the time for a visit - you won't be disappointed.", "publishedDate": "2015-09-13", "language": "en", "rating": 5}, {"id": 308613197, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d597513-r308613197-Major_Synagogue-Barcelona_Catalonia.html", "text": "Well worth the visit, the guide was very knowledgeable and very pleasant.  the visible Roman ruins beneath the glass floor was very impressive and nice to see.  ", "publishedDate": "2015-09-09", "language": "en", "rating": 5}, {"id": 306526474, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d597513-r306526474-Major_Synagogue-Barcelona_Catalonia.html", "text": "However busy your Barcelona  schedule may be try to  fit-in a visit to this Synagogue in the old Jewish Quarter.\n\nThe enthusiastic  curators explain how the building was re-discovered  and restored relatively recently.", "publishedDate": "2015-09-02", "language": "en", "rating": 4}, {"id": 299514978, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d597513-r299514978-Major_Synagogue-Barcelona_Catalonia.html", "text": "An interesting part of Jewish History in Spain provided by the guides who speak English and really are well versed in the history of this Synagogue as well as Jewish History in Spain. Sad to see this is all that remains in the \"Jewish Quarter\" of the Gothic city, a 2 room basement synagogue, but glad it is maintained. The largest synagogue could never be any larger than the smallest church,so that kind of says it all. A small entrance down 4-5 stone steps.", "publishedDate": "2015-08-15", "language": "en", "rating": 5}, {"id": 293282635, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d597513-r293282635-Major_Synagogue-Barcelona_Catalonia.html", "text": "It is a tiny place, tucked away on tiny street, but it has a powerful impact. The depth of its history seeps from every nook and cranny and irresistibly pulls visitors back in time. ", "publishedDate": "2015-07-28", "language": "en", "rating": 4}, {"id": 290679440, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d597513-r290679440-Major_Synagogue-Barcelona_Catalonia.html", "text": "buried below the city is the ruins of the old temple.it is still a practicing temple. there is a mini tour of the the place and a donation is asked to keep the project going. Well worth the few euros to see a piece of history.", "publishedDate": "2015-07-20", "language": "en", "rating": 5}, {"id": 288714978, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d597513-r288714978-Major_Synagogue-Barcelona_Catalonia.html", "text": "On our Gothic Quarter tour we walked by to see this piece of history. The building actually is slanted at an angle so the door faces east. Per our guide it is the oldest synagogue in Spain. However, it is also juxtaposed a troubling history in Barcelona where the Jews were thrown out and several killed. Still many places have regrettable history. It is good to see diversity supported now.", "publishedDate": "2015-07-13", "language": "en", "rating": 3}, {"id": 286614715, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d597513-r286614715-Major_Synagogue-Barcelona_Catalonia.html", "text": "A nice trip into Jewish History, guides speak spanish, english and hebrew. Very interesting facts and stories about old jewish culture in Barcelona.", "publishedDate": "2015-07-07", "language": "en", "rating": 4}, {"id": 283619092, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d597513-r283619092-Major_Synagogue-Barcelona_Catalonia.html", "text": "I went here with my Jewish wife and our 10 week old son.  It's too small rooms on an unassuming road in the Gothic quarter of Barcelona.  It does not take long to see the whole thing but thinking back to the rich history of this space it is entirely worth it.  Apparently there is evidence that this area was used as a synagogue as long ago as Roman times.  It currently houses an incomplete 18th century Torah and an even older one from ( think) the 16th century (not on regular display). There is a smattering of smaller artifacts as well as an interesting short talk on the history of the space, available in English, Catalan, and Spanish.  For 2.5 euro suggested donation a very good deal indeed!", "publishedDate": "2015-06-28", "language": "en", "rating": 5}, {"id": 281302449, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d597513-r281302449-Major_Synagogue-Barcelona_Catalonia.html", "text": "The Old Synagogue, in the Serafad neighborhood, is the best \"attraction\" we saw in Barcelona.  Two rooms were the original synagogue, currently showing a Roman wall from 300 AD that was an original, with the Gothic and current built on top to be level with the developing street line.  The short tour (in English) was astoundingly excellent, a young woman who was chockablock with historical information that explained an awful lot about what is generally known about the Jews in Spain (i.e., The Inquisition) and the absolutely fascinating historical significance of the community. Housing a wonderful donated collection of Jewish artifacts, the most amazing is a Torah that a couple (not Jewish) found in a flea market (yes, a flea market) in Morocco and donated.  This history became a new lens for being in Barcelona.  Incredible.", "publishedDate": "2015-06-19", "language": "en", "rating": 5}, {"id": 281102702, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d597513-r281102702-Major_Synagogue-Barcelona_Catalonia.html", "text": "Barcelona is rich in Jewish history. The Disputation in 1263, the Programs in 1391 and the Inquisition in 1492 all left their marks on this small Jewish community. Begin your trip at the Main Synagogue with a brief lecture by the staff. Then walk around the few blocks of small streets a short distance from the Barcelona Cathedral. If you want to know more, ask the staff at the Synagogue to arrange a private tour. Our tour guide was Andres Fajngold who speaks perfect English and told us much more about this important place in Jewish and Spanish history.", "publishedDate": "2015-06-18", "language": "en", "rating": 4}, {"id": 273536111, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d597513-r273536111-Major_Synagogue-Barcelona_Catalonia.html", "text": "travel back in time and learn and see how ancient Jewish traditions have lasted through the ages despite the hardships forced upon the Jewish population.\n\nThe Synagogue was built in Roman times and you can view the ancient foundations together with many artifacts showing numerous symbols and artifacts of the Jewish religion. you will hear a talk for about 10 minutes giving you clear and concise details of the history.\nfor 2.5 euros this is a steal and so an extra donation on your way out will be much appreciated", "publishedDate": "2015-05-21", "language": "en", "rating": 5}, {"id": 266307933, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d597513-r266307933-Major_Synagogue-Barcelona_Catalonia.html", "text": "I visit every major synagogue when I travel in foreign cities. This is particularly poignant since Jews were expelled from Spain and this is the only authentic remains as a reminder.\nIt is hard to find since the signs for it are removed at closing. Lends one to think why they are removable.\nOverheard a guide telling his group in the Jewish quarter that there is still a \"problem\" even today.\nPlease go and support this site.", "publishedDate": "2015-04-17", "language": "en", "rating": 4}]}}]