[{"locationId": 2223627, "name": "Museu Diocesà de Barcelona", "placeType": "ATTRACTION", "reviewListPage": {"reviews": [{"id": 743246487, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d2223627-r743246487-Museu_Diocesa_de_Barcelona-Barcelona_Catalonia.html", "text": "To be honest, we only went to the Gaudi wing.  We apologize for the oversight, but we only had so much time.  The Gaudi exhibit is fabulous because of the insight that it provides into the life, thinking, and engineering magic of the man.", "publishedDate": "2020-02-05", "language": "en", "rating": 5}, {"id": 719438426, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d2223627-r719438426-Museu_Diocesa_de_Barcelona-Barcelona_Catalonia.html", "text": "I found this Exhibition absolutely fascinating and informative, that Gaudi was a genius there can be no doubt but what an absolutely fascinating exhibition of his works. I found the exhibition very emotive too and learnt a lot about his life and the history of his work, it was fascinating and is well worth a visit, loved it.", "publishedDate": "2019-10-18", "language": "en", "rating": 5}, {"id": 716919653, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d2223627-r716919653-Museu_Diocesa_de_Barcelona-Barcelona_Catalonia.html", "text": "Yesterday we did a guided Gaudi walking tour. This exhibit was so much better, with good audio guide. Much bigger than expected, although a little too much focus on religious artefacts. A couple of the video exhibits weren't working.", "publishedDate": "2019-10-09", "language": "en", "rating": 4}, {"id": 688877621, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d2223627-r688877621-Museu_Diocesa_de_Barcelona-Barcelona_Catalonia.html", "text": "The Diocesan Museum in Barcelona is in a building which, despite its sober façade, can be deemed as astounding, whose main structure is in gothic style. To this original part a further wing was added in the mid-thirties of the sixteenth century, the style of this one being renaissance. It lies close to the Barcelona Cathedral.\nThe permanent exhibition consists in a collection of very interesting religious items having formerly been in some of the Barcelona parish churches and which were transferred to that Museum. There one can admire some real masterpieces in different styles and therefore from different historical periods. Among them, the mural paintings by Polinyà dating back to the 12th century, the carving of the Virgin of St. Mary de Toudell and the silver romanesque cross by Riells del Fai are outstanding.\nIn the permanent exhibition there are also objects created by the worldwide famous architect Gaudi, that one who designed extraordinarily revolutionary buildings such as the “Sagrada Familia” or “La Pedrera”. No doubt the observation of such objects helps visitors to understand the architect's creativity and the reason why he became the universal genious that he was. Among those items one can see a musical lectern and a door handle. His drawing box is also exhibited there.\nIn addition to the permanent exhibition in some rooms of the Museum concerned there is a temporary exhibition. On the day I visited that Museum this consisted in an African art collection showing the socio-religious relationship established by the missionaries of the Barcelona Diocese with the different cultures of the people in Africa. By observing the relevant items it's possible to understand how the African art had an impact on the Western art.\nThe Diocesan Museum in question is a recommendable place to visit since through a careful observation of the items concerned one may acquire some knowledge on Catalan art history, particularly in the religious field. Consequently it's advisable not to miss it while in Barcelona.", "publishedDate": "2019-07-12", "language": "en", "rating": 5}, {"id": 666222368, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d2223627-r666222368-Museu_Diocesa_de_Barcelona-Barcelona_Catalonia.html", "text": "We viewed this special exhibit the day before going to Sagrada Famila.  This exhibit made the visit to the Sagrada Familia more interesting and understandable.", "publishedDate": "2019-04-13", "language": "en", "rating": 5}, {"id": 559429802, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d2223627-r559429802-Museu_Diocesa_de_Barcelona-Barcelona_Catalonia.html", "text": "Truly excellent if you are interested in Gaudi; make this your first place to visit in Barcelona as you will understand everywhere afterwards so much better. The audioguide is most helpful and, if there is one in your native language, you will want 2-3 hours to make the most of this museum; comments here about only needing a short amount of time were mainly published before they updated the exhibition. They have cleverly integrated the religious relics which clearly used to be the main focus into an absorbing and informative display over several floors, now mainly about Gaudi. If you want to see further reviews, search Tripadvisor for ‘The Gaudi Exhibition Center’ which is the same place.", "publishedDate": "2018-02-09", "language": "en", "rating": 5}, {"id": 512496555, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d2223627-r512496555-Museu_Diocesa_de_Barcelona-Barcelona_Catalonia.html", "text": "Happened upon this Museum and thought we would have a look and so glad we did.  It is a great little museum full of interesting information about Gaudi with interactive exhibits.  Would highly recommend visiting this museum for an insight into Gaudi.", "publishedDate": "2017-08-13", "language": "en", "rating": 5}, {"id": 495943699, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d2223627-r495943699-Museu_Diocesa_de_Barcelona-Barcelona_Catalonia.html", "text": "This was right across from our hotel, and we almost didn't go in. However, they had a Gaudi exhibit, and there was no line, so we though, why not? So glad we did. It was one of our favorite museum visits. Very well done!", "publishedDate": "2017-06-25", "language": "en", "rating": 5}, {"id": 477453983, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d2223627-r477453983-Museu_Diocesa_de_Barcelona-Barcelona_Catalonia.html", "text": "A must for those interested in the life of Gaudi, the Museu Diocesa provides an audio tour of his life, inspirations and methods of working, with interesting features that kept our children interested for an afternoon - not least the virtual reality experience (well worth the extra cost)", "publishedDate": "2017-04-20", "language": "en", "rating": 5}, {"id": 464844090, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d2223627-r464844090-Museu_Diocesa_de_Barcelona-Barcelona_Catalonia.html", "text": "This museum was totally refurbished, refocussed and relaunched aprox. a year ago. Previous comments are obsolete.    \nThe museum was a surprisingly great experience i had with my kids (7+4 years) - unplanned. A charming receptionist explained TO THE KIDS what they can see in the museum, that they will have audioguides, what they will learn. that was already a surprisingly nice start for a museum visit. The kids ´paid no entrance, I got the RESIDENT discount. \n\nEACH one, including each kid got an audioguide (headphones with a Samsung smart phone with the audioguide as an app.) several languages (we used Catalan, Spanish and German). Really easy to handle and well made. - interesting information and well spoken. Some stations are synchronised with videos in the exhibition. Some numbers refer to a complete room and not only to single objects, which makes it quite easy to stroll around and observe while listening. \n\nWe have been impressed by the MODEL CONSTRUCTIONS on the upper floor. and even more when we learned that it is THANKS TO AUSTRIAN RESEARCHERS AND SPONSORS (Univeristy Innsbruck, Österreichische Nationalbank...) that original plans and models of the Church and Crypta of the Colonia Güell had been preserved and resconstructed with latest technology.\n\nFor visitors who haven`t got the chance to visit the original Cryptra at the Colonia Gúell, I recommend to pay the small extra for the Virtual Reality visit. \n\nAll in all, we spent more than 1,5h in this museum. With kids - fully entertained, with a lot of new and interesting information.", "publishedDate": "2017-03-05", "language": "en", "rating": 5}, {"id": 460856377, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d2223627-r460856377-Museu_Diocesa_de_Barcelona-Barcelona_Catalonia.html", "text": "This tiny museum, which was complimentary when we visited it, contains some works from Gaudi as well as some medieval exhibits.\nYou really don't need more than 15-30 minutes to fully explore it.", "publishedDate": "2017-02-18", "language": "en", "rating": 3}, {"id": 447156939, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d2223627-r447156939-Museu_Diocesa_de_Barcelona-Barcelona_Catalonia.html", "text": "We were invited by the staff to check the museum for free.\nThey have a wide display of paintings, accessories, sculptures, artifacts from other countries.", "publishedDate": "2016-12-28", "language": "en", "rating": 5}, {"id": 315130203, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d2223627-r315130203-Museu_Diocesa_de_Barcelona-Barcelona_Catalonia.html", "text": "Great museum about Gaudi, his ideas and inspirations. The audio tour takes you around the whole exhibition and can take a couple of hours. Very informative and enjoyable. ", "publishedDate": "2015-09-30", "language": "en", "rating": 5}, {"id": 212792992, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d2223627-r212792992-Museu_Diocesa_de_Barcelona-Barcelona_Catalonia.html", "text": "This museum is very small and will take less than an hour of your time. What it contains is quite interesting, but it does not contain much.", "publishedDate": "2014-06-30", "language": "en", "rating": 3}, {"id": 173749628, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d2223627-r173749628-Museu_Diocesa_de_Barcelona-Barcelona_Catalonia.html", "text": "I kinda meandered around slightly underwhelmed at first  - but then got sucked into the a vortext and left and an nearly two hours later.   There was a documentary on Goya - fascinating - and more insight on Gaudi - (my hero)  The art from the 14th century was excellent - a completely different aspect of religious art...  I loved it.", "publishedDate": "2013-08-24", "language": "en", "rating": 5}]}}]