[{"locationId": 257527, "name": "Museu Nacional d'Art de Catalunya - MNAC", "placeType": "ATTRACTION", "reviewListPage": {"reviews": [{"id": 755565979, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d257527-r755565979-Museu_Nacional_d_Art_de_Catalunya_MNAC-Barcelona_Catalonia.html", "text": "The National Art Museum of Catalonia is a fantastic museum inside an architecturally amazing building in the city of Barcelona, i.e. the Palau Nacional de Montjuic, which finds itself on a hill whose name is precisely “Hill of Montjuic”, from which one can enjoy one of the best views of the mentioned city. The building is a huge Italian classicist style palace whose construction was completed in 1929 under the architects Eugenio Cendoya and Enric Catà's design. The area of the Palace is nearly 50.000 square meters and its façade is quite impressive, particularly if looked at from some distance. It's therefore advisable to watch it from the nearby Plaza de España and then all the way towards the building itself while walking along the Reina Maria Cristina Avenue. In the very center of the building above the main entrance there is a large dome which reminds that of St. Peter's Basilica in the Vatican. On each side end there is a smaller one in the same style and between these and the mentioned larger one there are four towers calling up those of the Cathedral of Santiago de Compostela.\nThe art works exhibited in that Museum are of a great value. They are grouped in different collections appertaining basically to romanesque, gothic, renaissance and baroque styles respectively, arranged in divers sets of rooms in different sections of the Museum. The great number of art works displayed makes a bit hard the contemplation in one single day of all of them in a way aligned with the high artistic qualities thereof. It's thus advisable not to push oneself to that point. On my visit to that Museum in October 2019 I personally had time only to watch the artworks contained in the sections dedicated to romanesque and gothic styles and decided to visit the rest of the Museum on a future occasion.\nAs far as the romanesque art works are concerned, One is quite impressed, for example, at the sight of the frescoes particularly from small  rural churches in some valleys situated in the Pyreneees Mountains or nearby. In this regard, a scene concerning a feast with minstrels and jugglers is outstanding. It's quite surprising to find such a kind of pictorial representations in a religious context but it may perhaps refer to the celebrations linked to the temple consecration. Likewise, the Pantocrator or Almighty (Christ in Majesty) executed in the twelfh century, which used to be in the apse of a church called St. Climent de Taüll is a real masterpiece. There is also a large series dedicated to saints to which belongs the “Stoning of St. Stephen”. There it's possible to see also some altar stones like that beautiful one originated from the church of St. Marcel de Planès, behind which there is a nice little figure of Christ as he was on the cross (Crist d'Escaló) hanging on the wall. Both items date back to the second half of the twelfth century and it's worth watching them attentively. Another jewel in that section are the frescoes of the apse of the ancient monastery of St. Pere de Burgal.\nIn general, the visit to the section concerned is of the essence to learn about the Catalan romanesque style. In this sense one may realise that some religious works in that style contain bizantine elements, as those existing in the altar front part of Avià, which is a fabulous masterpiece most of whose traits show clearly the systematic use of a technique concerning the East Mediterranean art, such as the vividness and variety of colours and the pastillage décor on the background. Moreover, the majestic Virgin in the center of the retable is based upon the Greek type “Virgin Hodegetrià” (the one who shows the way). It's a great work before which one feels an indescribable sentiment. Likewise, the Oriental influence is evident in the magnificent front part of Baltraga, beautifully portraying the figure of Christ in the middle and depicting the martyrdom of St. Andrew, to whom the Baltraga church was dedicated, in one of its corners. That work is attributed to a Greek painter who signed one of his works as Master Alexander. Outstanding are also the paintings which decorated the chapterhouse of Sigena – an Aragonese nunnery which was unfortunately damaged by fire in the Spanish Civil War (1936 – 1939) – . That decoration is really imposing. Some relationship has been found between it and the mosaics made by Byzantine artists in the Palatine Chapel in Palermo and the Monrealy Cathedral (Sicily).\nIt ought to be pointed out as well that in the romanesque section concerned one can also see some samples of Copt fabrics originating from Egypt in the fifth century, such as some taffeta ligaments. It's very interesting to watch them carefully taking their great value into account.\nThe gothic artworks which can be admired in that Museum form also a gorgeous art collection appertaining to the period comprised between the end of the twelfth century and the fifteenth century. At that time Catalonia territorial power within the context of the Mediterranean Europe was at its utmost. Among the works contained in that section masterpieces by painters like Jaume Huguet, Lluís Dalmau, Bernat Martorell and Lluís Borrassà are outstanding.\nAs part of the gothic paintings, one can behold some superb murals about the conquest of Mallorca by Jaume I the Conqueror. They are dazzling and constitute one of the most relevant examples of the early Catalan gothic painting.\nAn important feature to be taken into consideration is the inclusion in the Catalan gothic painting in the second quarter of the fourteenth century of the great development of the Tuscan pictorial art, especially of that existing in Florence and Siena. Within that context the fabulous altarpiece portraying the Virgin and St. Anthony made of polychrome and gilded stone presumably in the workshop of Ferrer Bassa and his son Arnau can be inserted. Another splendid panel, a segment of a large retable, depicts the Adoration of the Shepherds. In the middle of the scene the Newborn portrayed in a peculiar way lies in a wooden manger. That scene contains likewise the images of St. Joseph and the Virgin as well as a female figure behind the latter who is supposed to be that of a midwife. Another wonderful work in that gothic section is what is thought to have been the top of a retable showing the Calvary. Particularly striking in that masterpiece is the magnificent pelican on the tree that grows from the cross.\nIn addition to the romanesque and gothic art collections to which the above statements refer one can behold in that Museum some wonderful works appertaining to the renaissance and baroque periods including some pictures from the Quattrocento and by masters of the Cinquecento, like Tiziano, as well as Spanish Golden Age paintings and rococo items. Among other paragons the Museum houses some paintings by the most reputed Spanish masters such as Diego Velázquez and Francisco de Goya, and works by great Flemish painters like Rubens and Lucas Cranach, as well as others by representatives of Modernisme (modern art collections): Antonio Gaudí and Ramón Casas, among others; and of the avant-garde movements like Picasso and Miró. Within the Modernisme style, some splendid interior design sets from exceptional architectural masterpieces, to wit Casa Amatller, Casa Lleó in Morera and Casa Batlló are also there encompassed.\nTaking the foregoing into account, it's beyond any doubt that the visit to the National Art Museum of Catalonia is higly recommended while in Barcelona for any art lover who wishes to contemplate incredible masterpieces as those displayed there, ranging from the romanesque period to the mid twentieth century. Besides, it's an excellent way to learn about Catalan  history.", "publishedDate": "2020-05-28", "language": "en", "rating": 5}, {"id": 752437397, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d257527-r752437397-Museu_Nacional_d_Art_de_Catalunya_MNAC-Barcelona_Catalonia.html", "text": "My visit to Barcelona included only a brief visit to MNAC, but it made a big impression. Since MNAC is located in Catalonia, it isn’t surprising that its exhibits feature Catalan art and design from the past 200 years among the art and designs on display. During my visit, I learned that like much of what exists near Plaza de Espana, The National Palace, the building which houses MNAC, dates back to 1929, the year of the International Exposition. The National Palace became the home of museum in 1934.\n\nMNAC is a magnificent  building both inside and out. It also offers panoramic views of Plaza de Espana from the front of the building which is why this area was so busy when I visited. Fortunately there are plenty of vantage points and no bad views.", "publishedDate": "2020-04-09", "language": "en", "rating": 4}, {"id": 751376237, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d257527-r751376237-Museu_Nacional_d_Art_de_Catalunya_MNAC-Barcelona_Catalonia.html", "text": "This is not a very busy museum. There's a short line from the entrance due to the numerous group tours entering the museum. A short walk from the parking lot. Facade of the museum is grand. Museum is huge and spacious. Clean and nice restroom. Permanent exhibits are well planned and organized. Not crowded inside the museum.", "publishedDate": "2020-03-18", "language": "en", "rating": 4}, {"id": 751313576, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d257527-r751313576-Museu_Nacional_d_Art_de_Catalunya_MNAC-Barcelona_Catalonia.html", "text": "It's a typical National Art Museum just like in other European Cities as in terms of the building architecture and style. The building itself is monumental. You must visit as you get to enjoy so many art movements and beautiful paintings , all in one place. \nI would note however a very big disadvantage as there are no subtitles in English in most of the paintings. That is really not welcoming to the guest that doesn't speak spanish.", "publishedDate": "2020-03-18", "language": "en", "rating": 4}, {"id": 750820885, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d257527-r750820885-Museu_Nacional_d_Art_de_Catalunya_MNAC-Barcelona_Catalonia.html", "text": "Sitting high on a hill overlooking the city, the Museu gives you a very in depth at artists other than Picasso, who has his own Museum in the old quarter.  This museum gives you a sense of how/where the unique and wonderful architecture of Barcelona comes from.  It also gives you a bit of a history of the city through it's art .  The view from the steps outside is excellent but there is a balcony inside the museum that is a bit more elevated and gives you an even better view.", "publishedDate": "2020-03-14", "language": "en", "rating": 4}, {"id": 748202596, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d257527-r748202596-Museu_Nacional_d_Art_de_Catalunya_MNAC-Barcelona_Catalonia.html", "text": "The art was very good, but to be honest, the memory from this place is of the beautiful building that sits high up with a commanding view of the area.\n\nWe actually walked to the museum from the Le Meridian Hotel.  Not a terribly long way, and quite fun as you bisect many Barcelona neighborhoods, and need to be attentive to a map (or your phone) to stay on course.\n\nThe museum was not busy when we visited on a weekday afternoon.  We breezed through it all in about an hour, and then wandered down to the fountain and other sites below.  \n\nThere is a nice place to get a cold drink and a snack inside the museum.  Restrooms were spotless clean.  The staff we encountered were all friendly.\n\nIf you have the time, this is a great place to visit--and make it more memorable by choosing interesting routes to get to and from there.", "publishedDate": "2020-02-28", "language": "en", "rating": 4}, {"id": 747561761, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d257527-r747561761-Museu_Nacional_d_Art_de_Catalunya_MNAC-Barcelona_Catalonia.html", "text": "We walked right in--so don't know if you need a skip the line ticket.  I think this one was free for me since I am 65.  It was medieval art, some of which was very violent.  I wouldn't think it would be very appropriate for children.", "publishedDate": "2020-02-25", "language": "en", "rating": 3}, {"id": 747071348, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d257527-r747071348-Museu_Nacional_d_Art_de_Catalunya_MNAC-Barcelona_Catalonia.html", "text": "You don’t need to book tickets before you get there.there is a family discount we paid for two adults and a child 16.8 euros with the terrace visit. Don’t skip it there is the best view of the city. The museum is established in a wonderful building and all of the collection have something to say. Unfortunately there is no info in English and if you want details I suggest you get the tour guide", "publishedDate": "2020-02-23", "language": "en", "rating": 4}, {"id": 747062342, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d257527-r747062342-Museu_Nacional_d_Art_de_Catalunya_MNAC-Barcelona_Catalonia.html", "text": "I was not initially planning to visit the Musu Nacional d'Art de Catalunya. I had already visited the Sagrada Familia, Park Güell and the Picasso Museum, and it would be too much art for a short stay. \n\nHowever, passing in front of the museum, I saw that it was free after 3 pm (check - it depends on the day and time of the year). So, I decided to visit it.\n\nI am glad I visited. A superb collection of Gothic and Romanesque Art. That type of art with so much symbolism, of which you can get the most with an audio-guide. Very impressive.", "publishedDate": "2020-02-23", "language": "en", "rating": 5}, {"id": 747037990, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d257527-r747037990-Museu_Nacional_d_Art_de_Catalunya_MNAC-Barcelona_Catalonia.html", "text": "a good place to visit an enjoy the amazing view from the top , its free in Saturdays from 3 pm , so dont miss ", "publishedDate": "2020-02-23", "language": "en", "rating": 4}, {"id": 746932061, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d257527-r746932061-Museu_Nacional_d_Art_de_Catalunya_MNAC-Barcelona_Catalonia.html", "text": "We walked up the steps and the view towards the Museum and from it were amazing. Definitely worth the walk ", "publishedDate": "2020-02-23", "language": "en", "rating": 5}, {"id": 745407991, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d257527-r745407991-Museu_Nacional_d_Art_de_Catalunya_MNAC-Barcelona_Catalonia.html", "text": "I’ve visited here many times over the years, each time as a guest at a trade convention. Our hosts often use this beautiful venue for dinner of their several thousand guests. It’s the most beautiful,   magical setting, set high up overlooking the city, magnificent views from the outside, especially when the fountains below are displaying their magic. ", "publishedDate": "2020-02-16", "language": "en", "rating": 5}, {"id": 743840857, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d257527-r743840857-Museu_Nacional_d_Art_de_Catalunya_MNAC-Barcelona_Catalonia.html", "text": "The preserved Romanesque art of Catalunha. It was very interesting to know about the  Vall de Boí. We liked very much.", "publishedDate": "2020-02-08", "language": "en", "rating": 5}, {"id": 742411173, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d257527-r742411173-Museu_Nacional_d_Art_de_Catalunya_MNAC-Barcelona_Catalonia.html", "text": "Enjoyed every moment, well worth a visit. Some beautiful and interesting art and admission reasonable. Great views of the city from the roof.\n\nRecommended 👍", "publishedDate": "2020-02-01", "language": "en", "rating": 5}, {"id": 741808152, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d257527-r741808152-Museu_Nacional_d_Art_de_Catalunya_MNAC-Barcelona_Catalonia.html", "text": "I've never seen so many frescoes displayed in a museum.  Lots of them from monasteries and churches across Cataluña and Spain, well displayed after transfer to canvas!  Well worth the visit just for this. There are a number of good paintings by old masters, too, including Ribera, Velasquez, etc., and a large collection on medieval, renaissance, baroque, and modern Cataloñian artists who aren't much recognized even though their work is reasonably good.", "publishedDate": "2020-01-28", "language": "en", "rating": 4}, {"id": 741639885, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d257527-r741639885-Museu_Nacional_d_Art_de_Catalunya_MNAC-Barcelona_Catalonia.html", "text": "Great art and gorgeous setting.  Well laid out with modern and medieval  Spanish artists. One of the highlights was lunch at the Oleum Restaurant.  It has a beautiful view of Barcelona .  Make reservations to get a table by the windows!  Food was outstanding and service was very good!", "publishedDate": "2020-01-27", "language": "en", "rating": 5}, {"id": 741442826, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d257527-r741442826-Museu_Nacional_d_Art_de_Catalunya_MNAC-Barcelona_Catalonia.html", "text": "A wonderful place to visit.  The building is very large and spacious so make sure if you’re traveling with a group you prepare a meeting place before you journey throughout the grounds.", "publishedDate": "2020-01-26", "language": "en", "rating": 4}, {"id": 741355750, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d257527-r741355750-Museu_Nacional_d_Art_de_Catalunya_MNAC-Barcelona_Catalonia.html", "text": "Glad we stopped to visit MNAC as it wasn’t a part of our original plan.  Was impressed by the views and purchased the museum tickets on site.  Opted to get the audio guide and was very glad we did - lots of information.  The exhibits were very impressive and we could have spent longer.  Staff was friendly and helpful.  Spent more than 2 hours inside and didn’t even cover the modern art area.", "publishedDate": "2020-01-26", "language": "en", "rating": 5}, {"id": 741028280, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d257527-r741028280-Museu_Nacional_d_Art_de_Catalunya_MNAC-Barcelona_Catalonia.html", "text": "We spent a lot of time out front taking pictures.  As a result, it was close to closing time when we entered the museum.\n\nWhat were able to see was impressive.  We wish we had had time to see much more.", "publishedDate": "2020-01-24", "language": "en", "rating": 4}, {"id": 738681447, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d257527-r738681447-Museu_Nacional_d_Art_de_Catalunya_MNAC-Barcelona_Catalonia.html", "text": "The National Museum is an enjoyable visit both inside and out. There is a perfect view of Placa d’Espanya from the stairs, and you can walk to the Olympic Park from the MNAC location as well.", "publishedDate": "2020-01-12", "language": "en", "rating": 4}, {"id": 738458066, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d257527-r738458066-Museu_Nacional_d_Art_de_Catalunya_MNAC-Barcelona_Catalonia.html", "text": "Fascinating place. Great structure and views. The art is interesting and goes back a long time. Worth the visit for a few hours.", "publishedDate": "2020-01-11", "language": "en", "rating": 4}, {"id": 738116837, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d257527-r738116837-Museu_Nacional_d_Art_de_Catalunya_MNAC-Barcelona_Catalonia.html", "text": "This is a huge palace like building with free access to the public. It has impressive step gardens with fountains both in front and back and evveryone mistakes it for a Royal Palace at first look. Howver - inside - it is an exhibition center - when we visited - there was nothing much going on - mostly empty. Tickets are sold separately for each exhibition. This building and surrounding areas are used as the launching pad for the pirotechnic show and fireworks for the new years celebration. So access to public is closed after 6.00 PM.", "publishedDate": "2020-01-09", "language": "en", "rating": 4}, {"id": 738000994, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d257527-r738000994-Museu_Nacional_d_Art_de_Catalunya_MNAC-Barcelona_Catalonia.html", "text": "Organized thematics,  rich content,  abudant space,  rest areas. I suggest that you get the audio guide if you don't read spanish or catalan. ", "publishedDate": "2020-01-08", "language": "en", "rating": 5}, {"id": 737646634, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d257527-r737646634-Museu_Nacional_d_Art_de_Catalunya_MNAC-Barcelona_Catalonia.html", "text": "We did not intend to stay as long as we did but enjoyed the exhibits very much! Make your way to the top floor to enjoy the roof terraces - particularly beautiful at golden hour!", "publishedDate": "2020-01-07", "language": "en", "rating": 5}, {"id": 737393335, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d257527-r737393335-Museu_Nacional_d_Art_de_Catalunya_MNAC-Barcelona_Catalonia.html", "text": "We went to the Miró museum in the morning by the funicular and then continued with the national museum in the afternoon. So we didn’t have to climb any stairs. If you come to the museum from Plaza Espana, it is a long way up. There are escalators but not everywhere, so you will need to climb a lot of stairs. \nWe found out that seniors over 65 were free provided they have a document about their age. \n\nThe museum looks majestic from the outside and there are 3 main sections: Medieval, Renaissance and Modern. We were very impressed with the first two, especially with the incredible wall paintings from small churches in the Pyrenees dating back to 1100. \nThe altar pieces were also very special and unique as were the wooden statues of Jesus Christ and Virgin Mary. \nI was exhausted after these two sections and sat the cafe by the beautiful oval hall while my husband visited  the modern section which he said was very nice with Catalan artists that we don’t know. \nWe walked down the stairs ( also some escalators going down) passed by the fountain and reached Plaza Espana. \nI would definitely recommend this museum for those who would like to get a glimpse of Catalonian history, religion and culture. ", "publishedDate": "2020-01-06", "language": "en", "rating": 5}, {"id": 737143342, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d257527-r737143342-Museu_Nacional_d_Art_de_Catalunya_MNAC-Barcelona_Catalonia.html", "text": "Museu Nacional d'Art de Catalunya (MNAC) is the 2nd most popular art museum in Barcelona (The 1st one is Picasso's museum) and it houses one of the biggest medieval art collections in the world. The museum has 2 floors and it's split into 5 sections: Medieval Romanesque Art, Medieval Gothic Art, Renaissance and Baroque, Modern Art and the Oval Hall. There are many highlight collections here but to be honest, we hadn't heard any of these artists before and we didn't find many paintings extraordinary. (A large portion of artists here were Catalan artists.) We were actually more interested in the Romanesque paintings on the cave walls and the Oval Hall due to they were special and a bit unusual.\nWhat I don't like about this museum is the language barrier and the audio guide. Many paintings descriptions were in Catalan and Spanish only and the audio guide was also too brief which we didn't find it useful at all. \nOverall, we were disappointed with this museum, or maybe it's just not our cup of tea!", "publishedDate": "2020-01-05", "language": "en", "rating": 2}, {"id": 736992684, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d257527-r736992684-Museu_Nacional_d_Art_de_Catalunya_MNAC-Barcelona_Catalonia.html", "text": "If you are using the hop on bus this is one of the stops and a great place to take some amazing  photos from the top looking down to the magic fountains below. Walk around and explore the location before heading down. Also close walking distance is the “Pueblo Espanol” which is a replica of a Spanish village which is also a nice place to visit and the next stop on the hop on bus. ", "publishedDate": "2020-01-05", "language": "en", "rating": 5}, {"id": 735117333, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d257527-r735117333-Museu_Nacional_d_Art_de_Catalunya_MNAC-Barcelona_Catalonia.html", "text": "Wonderfull building which contains a multitude of art from all genres , we were there in Oct 2019 and they had closed off the 1st floor for some work so we couldnt access the modernist area but the rest of the museum was full of interesting stuff like the temporary exhibition of a local celebrity photographers shots from his career of over 50 years of pics which was worth the entrtance fee alone.\nThe building is impressive inside and out and the cafe on the entrance steps must have one of the best views as you enjoy your cappuccino anywhere in Barcelona", "publishedDate": "2019-12-28", "language": "en", "rating": 5}, {"id": 734775229, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d257527-r734775229-Museu_Nacional_d_Art_de_Catalunya_MNAC-Barcelona_Catalonia.html", "text": "You can't miss it in your visit in Barcelona. The building itself is outstanding and the  catalunian art  is unique. Observing it from the teleferic it stood out!  The fact that the artifacts were described only in the catalunian language is the reason for the four stars in my review.", "publishedDate": "2019-12-26", "language": "en", "rating": 4}, {"id": 734771236, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d257527-r734771236-Museu_Nacional_d_Art_de_Catalunya_MNAC-Barcelona_Catalonia.html", "text": "I consider it disrespectful for such a wonderful museum to have description on its artifacts only in catalans. What about the rest of the world?", "publishedDate": "2019-12-26", "language": "en", "rating": 3}, {"id": 733181806, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d257527-r733181806-Museu_Nacional_d_Art_de_Catalunya_MNAC-Barcelona_Catalonia.html", "text": "Hey if you are into the genre check it out - a bit hard to get to and not a must see -The nearby Miro Museum is ", "publishedDate": "2019-12-17", "language": "en", "rating": 3}, {"id": 732902185, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d257527-r732902185-Museu_Nacional_d_Art_de_Catalunya_MNAC-Barcelona_Catalonia.html", "text": "If you are like me and not a very big museum person, you will throughly enjoy the view from up there. You can sit with some Cava or beer, meats and cheese from the food stand at the top. Beautiful view with great ambiance of music from street performers. ", "publishedDate": "2019-12-15", "language": "en", "rating": 4}, {"id": 732267113, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d257527-r732267113-Museu_Nacional_d_Art_de_Catalunya_MNAC-Barcelona_Catalonia.html", "text": "This museum features Catalonian and Spanish art as its forte.  We did not go inside to see art.  Instead, we visited the Montjuic area for the visual impact of the beautiful structures and buildings. This imposing building occupies the top of the hill above the Magic Fountain in the Montjuic area of Barcelona.  There are incredibly good photo ops of the Museum, the Magic Fountain, and the Espanya Plaza at the foot of the hill, because they are all in a direct line to each other.  I can’t speak to the quality of the art inside, but the visual impact and the wonderful photos you can take make this a 4 STAR attraction.", "publishedDate": "2019-12-12", "language": "en", "rating": 4}, {"id": 730641570, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d257527-r730641570-Museu_Nacional_d_Art_de_Catalunya_MNAC-Barcelona_Catalonia.html", "text": "Super venue for art: organized and displayed with aplomb. \nGreat news: Oval Ball is spectacular. El Greco, Goya, a few Picassos, Miro wall art, early Salvador Dali, and of course the my favourite Roman Casa and Pere Romeu in Tandem on a Bicycle (4 Gats for breakfast was worthwhile.). \nQ-Trip: The modernista section with Gaudi’s furniture \n              and doors is spectacular. \nWARNING: English is sparse on the descriptions unlike \n                    the Picasso Museum and others. We skipped \n                    the audio since there’s tons to see ... \nQ-Trip: We walked from the Joan Miro; HORRIBLE directions \n             in park. Did I say HORRIBLE. Montjuic is fantastic \n             to get lost in BUT not on a rainy day. \nWARNING: Museu will NOT phone for cab. SO you have to \n                    walk out by the Magic Fountain which is \n                    brilliant BUT not on a rainy day. \n                    Bodega Biarritz 1883 opens at 5 for a nice \n                    repose from Museums on a rainy day. ", "publishedDate": "2019-12-04", "language": "en", "rating": 4}, {"id": 729499793, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d257527-r729499793-Museu_Nacional_d_Art_de_Catalunya_MNAC-Barcelona_Catalonia.html", "text": "The climb up may have been steep, but the view was beautiful and the fountain is lovely. I hear at 8pm certain nights there is a fountain show. Then we got into the art and mostly saw all the Modern art. Fabulous pieces and variety. We went right up to the roof - make sure you don't miss it!! The view was even more spectacular with the sun setting!", "publishedDate": "2019-11-28", "language": "en", "rating": 5}, {"id": 728935644, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d257527-r728935644-Museu_Nacional_d_Art_de_Catalunya_MNAC-Barcelona_Catalonia.html", "text": "Free for seniors, our favorite museum in town as there is so much excellent cultural art from the region, lots of unique pieces all set in a splendid interior.  We keep coming back, so much to see.", "publishedDate": "2019-11-25", "language": "en", "rating": 5}, {"id": 728628138, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d257527-r728628138-Museu_Nacional_d_Art_de_Catalunya_MNAC-Barcelona_Catalonia.html", "text": "Amazing mixture of art in an amazing building. Beautiful views from the top of the steps outside the building right across to Las arenas and Montjuic", "publishedDate": "2019-11-24", "language": "en", "rating": 5}, {"id": 728614341, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d257527-r728614341-Museu_Nacional_d_Art_de_Catalunya_MNAC-Barcelona_Catalonia.html", "text": "Not only the are is fantastic but also the museum! One visit is definitely not enough to cherish the tresure of art it has!", "publishedDate": "2019-11-24", "language": "en", "rating": 4}, {"id": 727340040, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d257527-r727340040-Museu_Nacional_d_Art_de_Catalunya_MNAC-Barcelona_Catalonia.html", "text": "The Museum is well worth a visit to see all the beautiful works of art from all eras. The collection is quite easy to walk through and could be done in around 2 hours altogether. Lots of the original pieces have been taken directly from the churches which is quite interesting.  The museum itself is over looking the city of Barcelona and is nice area to sit out on.", "publishedDate": "2019-11-18", "language": "en", "rating": 5}, {"id": 727065470, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d257527-r727065470-Museu_Nacional_d_Art_de_Catalunya_MNAC-Barcelona_Catalonia.html", "text": "This is a wonderful museum with a great collection. The lighting and general presentation is also excellent. Hugely impressed that it was free of charge for seniors too.\n\nI am, however, still in two minds about the extraordinary Romanesque collection. Whilst I feel certain that stripping these works out of the churches for which they were painted will have ensured their survival, I did find it strange to see the work outside its original context. Such work was created to inspire faith and, set in the sterile setting of a gallery, whilst you could marvel at the artistry, it did little to lift the soul. But perhaps I am just a heathen! I would have liked to visit the churches from which there works had been raped and pillaged and just hope that they had been left with perhaps more modest artworks.", "publishedDate": "2019-11-17", "language": "en", "rating": 4}, {"id": 725962415, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d257527-r725962415-Museu_Nacional_d_Art_de_Catalunya_MNAC-Barcelona_Catalonia.html", "text": "This is a marvellous building over-looking Barcelona, so it's worth going up there just for the view. The main fountain has a son et lumiere in the evening which is also definitely worth a look. Ticket price is not too excessive but later afternoon Saturday it's free, so try going then. Lots of Catalan/local art and the interior of the building is also interesting. A good couple of hours plus time seeing the view.", "publishedDate": "2019-11-12", "language": "en", "rating": 5}, {"id": 724739399, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d257527-r724739399-Museu_Nacional_d_Art_de_Catalunya_MNAC-Barcelona_Catalonia.html", "text": "This eclectic collection of medieval, renaissance, Catalonian art during the period of Franco and Byzantine frescos is truly excellently displayed and annotated.  It was a revelation to us since we knew very little about the museum prior to our visit.", "publishedDate": "2019-11-07", "language": "en", "rating": 5}, {"id": 724523407, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d257527-r724523407-Museu_Nacional_d_Art_de_Catalunya_MNAC-Barcelona_Catalonia.html", "text": "I love this museum. If you want to know Catalonia and it's cultural background as well as it's modern character, you should definitely go there. I have visited it several times. Normally you'll need an hour or two, depends on your style of visiting. Besides the area is beautiful itself and the view is amazing to take pictures, to eat something or just smoke a cigarette admiring the beauty of Barcelona. ", "publishedDate": "2019-11-06", "language": "en", "rating": 5}, {"id": 724076410, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d257527-r724076410-Museu_Nacional_d_Art_de_Catalunya_MNAC-Barcelona_Catalonia.html", "text": "The collection of artwork spanned from Gothic all the way to modern artwork. The paintings taken from churches in the Pyrenees were incredible to witness. Some of the romanesque paintings were more intense than any I'd seen before, but I enjoyed them thoroughly.\n \nI would have to say that the modern work collection was my favorite, although I enjoyed the museum as a whole.", "publishedDate": "2019-11-05", "language": "en", "rating": 5}, {"id": 723868114, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d257527-r723868114-Museu_Nacional_d_Art_de_Catalunya_MNAC-Barcelona_Catalonia.html", "text": "It was the first Sunday of November so we got in free. Hurray! Huge place so in spite of the crowds, it did not feel congested. Managed to pick out 2-3 key Picasso’s including the iconic “Woman in Hat and Fur Collar”. \n\nLoved the curation and how the galleries were laid out. But for us, the Romanesque and Medieval sections stood out most especially the recreation of the churches, chapels and monasteries to house the ancient frescoes. Really dramatic and so well done. The gift shop is equally huge and can definitely make a dent in your wallet if you’re not careful. ", "publishedDate": "2019-11-04", "language": "en", "rating": 5}, {"id": 723565730, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d257527-r723565730-Museu_Nacional_d_Art_de_Catalunya_MNAC-Barcelona_Catalonia.html", "text": "Not the easiest to get to if walking...so...take a bus.  But know that this is a very large museum with an overwhelming number of exhibits.", "publishedDate": "2019-11-03", "language": "en", "rating": 5}, {"id": 723225463, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d257527-r723225463-Museu_Nacional_d_Art_de_Catalunya_MNAC-Barcelona_Catalonia.html", "text": "Spending the morning around the Montjuic area, so as not to be overwhelmed decided to miss out the ground floor gallery and focus on the first floor gallery.  This worked really well, there is plenty to see, as well as painings a range of furniture and glass panels.  The building itself is spectacular.  Lovely views, cafe and restrooms.", "publishedDate": "2019-11-02", "language": "en", "rating": 4}, {"id": 722844612, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d257527-r722844612-Museu_Nacional_d_Art_de_Catalunya_MNAC-Barcelona_Catalonia.html", "text": "We were amazed. The first time we liked - and here loved - Renaissance art. True masterworks. The place is large, so 2 hours minimum. Amazing views of the city from up here also. ", "publishedDate": "2019-10-31", "language": "en", "rating": 5}, {"id": 722835984, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d257527-r722835984-Museu_Nacional_d_Art_de_Catalunya_MNAC-Barcelona_Catalonia.html", "text": "We kept it simple and just moved about the museum on our own.  So much to take in and the quality of the exhibits impressive. The building was equally impressive and shrouded easy to access exhibition rooms.  Nice gift shop if you were to look to bring a gift back home for someone.", "publishedDate": "2019-10-31", "language": "en", "rating": 4}, {"id": 722422655, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d257527-r722422655-Museu_Nacional_d_Art_de_Catalunya_MNAC-Barcelona_Catalonia.html", "text": "Huge building, we did only the art mentioned in title.It is all from the Catalunyan region. Nice cafeteria. for lunch. Free for those over 65.", "publishedDate": "2019-10-29", "language": "en", "rating": 5}, {"id": 721749978, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d257527-r721749978-Museu_Nacional_d_Art_de_Catalunya_MNAC-Barcelona_Catalonia.html", "text": "This rich area of history is one you do not want to miss.  Take the stairs or elevators to the top and you will have an awesome view.  Then visit the museum", "publishedDate": "2019-10-27", "language": "en", "rating": 5}, {"id": 721735329, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d257527-r721735329-Museu_Nacional_d_Art_de_Catalunya_MNAC-Barcelona_Catalonia.html", "text": "Didn't go in (not enough time) but the building and surrounding area is beautiful. Well worth a visit.", "publishedDate": "2019-10-27", "language": "en", "rating": 4}, {"id": 721499887, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d257527-r721499887-Museu_Nacional_d_Art_de_Catalunya_MNAC-Barcelona_Catalonia.html", "text": "An absolute must for any visitor, if not just for the amazing art but the great views of the city.\nIt has frescoes of art taken from churches across Spain dating back up to 1,000 years displayed as they would have been seen in the Church. Then it has another section of Gothic art , which I promise will not disappoint.\nOutside there is a terrace affording panoramic views of the city. A word of warning if you use the funicular railway to ascend to the Museum we saw a decidedly dodgy character offering travellers help at the ticket machine, then he was closely looking over their shoulder if at his encouragement to view their Pin. He was also begging for money quite aggressively.\nYou do not need the Funicular as there are escalators at the steps in front of the Museum", "publishedDate": "2019-10-26", "language": "en", "rating": 5}, {"id": 719122516, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d257527-r719122516-Museu_Nacional_d_Art_de_Catalunya_MNAC-Barcelona_Catalonia.html", "text": "The national Museum of Catalonia is an interesting place, Because I love art, and painting in the first place, then, of course, could not go to this Museum, which is also located in such a picturesque place. Loved it, we were gone all day, I recommend)", "publishedDate": "2019-10-17", "language": "en", "rating": 5}, {"id": 719113312, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d257527-r719113312-Museu_Nacional_d_Art_de_Catalunya_MNAC-Barcelona_Catalonia.html", "text": "Beautiful art collection sorted in a fine order. This really is a massive collection of art from all periods. I liked the medieval reconstructions of wall paintings from various rural monasteries and churches, not something seen anywhere else. Make sure you have at least half a day saved in advance to check it out fully or if you have plenty of time best to keep coming back and do a bit at a time.", "publishedDate": "2019-10-17", "language": "en", "rating": 5}, {"id": 718651581, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d257527-r718651581-Museu_Nacional_d_Art_de_Catalunya_MNAC-Barcelona_Catalonia.html", "text": "We went because of the romanesque art, which totally blew us away with it's fantastic quality. I have never before seen such a beautiful collection of frescoes and all in excellent preservation. They are shown so that they resemble the way they would have looked in their original churches.\nThe cafe food was expensive and distinctly average.\nAfter lunch the modern collection was interesting, many fine examples of Catalonian art, including early, artistic photographs.  All 5 of us (aged 63 - 23) enjoyed this visit.", "publishedDate": "2019-10-15", "language": "en", "rating": 5}, {"id": 718477960, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d257527-r718477960-Museu_Nacional_d_Art_de_Catalunya_MNAC-Barcelona_Catalonia.html", "text": "Not only does this museum have really beautiful exhibits of all sorts, but it's situated at the top of the hill in the city with an extraordinary view!  People spend hours just waiting for the sunset from that point.  Sadly, I didn't have that luxury, but I did go to the rooftop of the museum to see the city from all angles, and it was quite spectacular.  Do this!", "publishedDate": "2019-10-15", "language": "en", "rating": 5}, {"id": 718044640, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d257527-r718044640-Museu_Nacional_d_Art_de_Catalunya_MNAC-Barcelona_Catalonia.html", "text": "It was a bigger and original sight of the Plaza de Espana from Rome.  We are in Spain so the name fits the place.  The place is worth the price paid on the sight-seeing bus in order to arrive effortlessly at the top where the museum is located.  A beautiful place to take a photo or a selfie with the entire city in the background. I think it's best to wait for the sunset and the evening there because they show the waterworks from maybe 8 pm and on.", "publishedDate": "2019-10-13", "language": "en", "rating": 5}, {"id": 717856132, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d257527-r717856132-Museu_Nacional_d_Art_de_Catalunya_MNAC-Barcelona_Catalonia.html", "text": "This museum takes you through art from medieval times up through modern. An expansive collection that gives you a great overview without being overwhelming. I particularly enjoyed the sections on Art Nouveau and Belle Époque. The museum has furniture and room settings that I always find interesting to see. You can also climb up to the roof in nice weather and walk around to get a 360 panoramic view of the city. I highly recommend this museum.", "publishedDate": "2019-10-12", "language": "en", "rating": 5}, {"id": 717780041, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d257527-r717780041-Museu_Nacional_d_Art_de_Catalunya_MNAC-Barcelona_Catalonia.html", "text": "The Catalonian art gallery is located in an impressive domed building atop a hill, at the end of the Avinguda de la Reina Maria Cristina.\nI am not an art buff, but still enjoyed my visit and felt €12 was a reasonable price (it includes a second visit within the month if you want one). Went on a Friday in October and there were not many people there. \nWe were under a time pressure so my friend and I agreed we would walk round everything (except the coin section) but at quite a fast pace. We achieved both floors, some photo stops, the roof and a café stop in about 2.5 hours.\nThe best part was walking around this gorgeous building including the huge central auditorium. There is a posh restaurant with city views up the top, which would have been very special to eat in if time had allowed.\nOh and yes, the art! Well, it is VERY spacious in the display rooms and easy to follow the numbered rooms in sequence. Downstairs was all Romanesque art (11th century) which I found very interesting and colourful. Upstairs is ‘modern’ stuff, but that means anything from the 11th to 20th centuries, so don’t expect it to be all contemporary. It includes some Gaudí furniture and also one Picasso painting.", "publishedDate": "2019-10-12", "language": "en", "rating": 4}, {"id": 717256772, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d257527-r717256772-Museu_Nacional_d_Art_de_Catalunya_MNAC-Barcelona_Catalonia.html", "text": "Assistance, people, very nice. \nDid not have an opportunity to complete. Enjoyed Renaissance and Medieval very much.\nThe rented guide could be better for easier use.\n ", "publishedDate": "2019-10-11", "language": "en", "rating": 4}, {"id": 717182187, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d257527-r717182187-Museu_Nacional_d_Art_de_Catalunya_MNAC-Barcelona_Catalonia.html", "text": "The views were stunning. Did not happen to go into the museum, but was at the grounds. It gives you a super view of the city", "publishedDate": "2019-10-10", "language": "en", "rating": 3}, {"id": 716335828, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d257527-r716335828-Museu_Nacional_d_Art_de_Catalunya_MNAC-Barcelona_Catalonia.html", "text": "Was a little disappointed by the museum itself but surrounding area was so lovely for a stroll.  They did have a few pieces in the collection that were lovely!!!", "publishedDate": "2019-10-08", "language": "en", "rating": 5}, {"id": 716011255, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d257527-r716011255-Museu_Nacional_d_Art_de_Catalunya_MNAC-Barcelona_Catalonia.html", "text": "You can reach most of the way by escalators which may not be obvious.  Also look for days/times (Saturday after 3PM) when entrance is free.  Huge place so you may want to concentrate on special exhibit or one of the halls.  Go up to the terrace (elevator and steps) for great views.  The museum is behind the Magic Fountain and by the Plaza de Espana.", "publishedDate": "2019-10-07", "language": "en", "rating": 5}, {"id": 715874668, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d257527-r715874668-Museu_Nacional_d_Art_de_Catalunya_MNAC-Barcelona_Catalonia.html", "text": "Be mindful of the hours as they chnage seasonally on Sundays.  We were only there for a couple fo hours which was not enough time.  The museum is awesome and provides a great overview of not only the art but the politics of Catalunya and Spain in general.  Very interesting place...definitley in my top 5 of the museums I visited while in the area.", "publishedDate": "2019-10-06", "language": "en", "rating": 4}, {"id": 715765442, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d257527-r715765442-Museu_Nacional_d_Art_de_Catalunya_MNAC-Barcelona_Catalonia.html", "text": "We came here on a Friday afternoon at around 1pm. It was so easy to get to and the view from the front entrance was amazing. There is a huge collection of art inside the museum and it wasn’t crowded at all. I really enjoyed the visit. We spent about 2-3 hours here. ", "publishedDate": "2019-10-06", "language": "en", "rating": 5}, {"id": 715525423, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d257527-r715525423-Museu_Nacional_d_Art_de_Catalunya_MNAC-Barcelona_Catalonia.html", "text": "3 years ago it rained the night we were going to go to the National Museum area to see the Magic Fountain and then last month, on our second visit to Barcelona, we made it.  Although it rained again, it stopped just in time for the amazing fountain and music show.  Check out the fountain on Youtube.  But at the entrance area by Placa Espana, is the arena building and go to the top floor for a great meal at the Bistro and then take in the view - really neat.", "publishedDate": "2019-10-05", "language": "en", "rating": 5}, {"id": 715014384, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d257527-r715014384-Museu_Nacional_d_Art_de_Catalunya_MNAC-Barcelona_Catalonia.html", "text": "Great museum on Romanesque and Gothic art, and an incredible spectacle of fountain pools and gardens down the mountain to the plaza.  We liked the outside as much as the art on the inside.", "publishedDate": "2019-10-03", "language": "en", "rating": 5}, {"id": 714901014, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d257527-r714901014-Museu_Nacional_d_Art_de_Catalunya_MNAC-Barcelona_Catalonia.html", "text": "One of the few sites that actually had escalators running on the exterior of this multi-level attraction, although there are a few steps to climb to reach the museum level. It's an impressive site with fountains, waterfalls, Egyptian columns, with the museum at the very top of Palau Nacional.  The collection of Catalonian & Romanesque art are stunning. The Hop On Hop Off bus also stops on the side, at the level of the museum so you are able to avoid steps. If you go to the top of the domed area, there is a great view of  the plaza below. You can even see the Sagrada Familia in the distance. ", "publishedDate": "2019-10-02", "language": "en", "rating": 5}, {"id": 713157736, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d257527-r713157736-Museu_Nacional_d_Art_de_Catalunya_MNAC-Barcelona_Catalonia.html", "text": "a must visit....it stands towering over the city and the views from the top are spectacular ..the evening light show is worth watching i am told...unfortunately could not see it.", "publishedDate": "2019-09-26", "language": "en", "rating": 5}, {"id": 713080102, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d257527-r713080102-Museu_Nacional_d_Art_de_Catalunya_MNAC-Barcelona_Catalonia.html", "text": "With 2 floors and 81 galleries this really is a massive collection of art from all periods.\nIf you have plenty of time then probably best to keep coming back and do a bit at a time.  I really liked the medieval reconstructions of wall paintings from various rural monasteries and churches.  Not something I have seen anywhere else.\nVery well laid out with a logical route form one gallery to the next. Not at all crowded when we visited.  A very impressive building from the outside and a huge collection of art.", "publishedDate": "2019-09-26", "language": "en", "rating": 5}, {"id": 709605295, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d257527-r709605295-Museu_Nacional_d_Art_de_Catalunya_MNAC-Barcelona_Catalonia.html", "text": "Today we visited the modern art collection of this museum. It was very quiet on Saturday morning. Everything is very bad signposted so you have to find your own way. It is all a. It neglected as is the surrounding area. ", "publishedDate": "2019-09-14", "language": "en", "rating": 4}, {"id": 709576966, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d257527-r709576966-Museu_Nacional_d_Art_de_Catalunya_MNAC-Barcelona_Catalonia.html", "text": "with little time, I went to the medieval areas on ground floor. The collection of Roman and Christian art is impressive. I wish i had more time to look at each piece in detail. I have never seen a picture of Peter crucified upside down. Brilliant.", "publishedDate": "2019-09-14", "language": "en", "rating": 4}, {"id": 709479580, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d257527-r709479580-Museu_Nacional_d_Art_de_Catalunya_MNAC-Barcelona_Catalonia.html", "text": "It’s definitely a must see if you happen to visit Barcelona. Beautiful art collection sorted in a fine order, which makes your journey a top notch one. Make sure you have a couple of hours saved in advance to check it out fully. ", "publishedDate": "2019-09-13", "language": "en", "rating": 5}, {"id": 709467151, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d257527-r709467151-Museu_Nacional_d_Art_de_Catalunya_MNAC-Barcelona_Catalonia.html", "text": "This was one of those places I fell in love with from the first moment we entered the Romanesque section. It’s somewhere on my list to return to as the location and contents are worthy of more time there.\n\nA wonderful experience", "publishedDate": "2019-09-13", "language": "en", "rating": 5}, {"id": 709355906, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d257527-r709355906-Museu_Nacional_d_Art_de_Catalunya_MNAC-Barcelona_Catalonia.html", "text": "Display of the art collection is simply amazing and well organised. Very comprehensive. There were section on medieval art, gothic era and modern art.", "publishedDate": "2019-09-13", "language": "en", "rating": 5}, {"id": 709297769, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d257527-r709297769-Museu_Nacional_d_Art_de_Catalunya_MNAC-Barcelona_Catalonia.html", "text": "The museum is so big that I didn’t have enough time too see it all. I recommend spending at least  three hours here. It is a must for anyone who likes art. From romanesque through to modern times, there is history to be seen", "publishedDate": "2019-09-12", "language": "en", "rating": 5}, {"id": 708903331, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d257527-r708903331-Museu_Nacional_d_Art_de_Catalunya_MNAC-Barcelona_Catalonia.html", "text": "Very romantic feel in the night. There’s lots of activity at night because of the magic fountain and this works well for tourists looking for that aaaaaawwwww moment.", "publishedDate": "2019-09-11", "language": "en", "rating": 4}, {"id": 708747365, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d257527-r708747365-Museu_Nacional_d_Art_de_Catalunya_MNAC-Barcelona_Catalonia.html", "text": "Buy the audio tour to fully enjoy this great museum . The exhibits are organized by major categories and take about an hour each to walk thru. You are led from 1300s to present modern art exhibits . Certainly a world class collection and very interesting insight into Catalonian arts. Plan about 4-5 hours to see the museum and I suggest you reserve a lunch at Oleum restaurant if you want to have an exceptional meal located in the second level of the museum.", "publishedDate": "2019-09-11", "language": "en", "rating": 5}, {"id": 708145706, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d257527-r708145706-Museu_Nacional_d_Art_de_Catalunya_MNAC-Barcelona_Catalonia.html", "text": "This is the third time we visited this museum. The section of Catalan Romanesque Art is truly amazing. There are many types of works, paintings, sculpture and frescos. Many frescos have been removed from the original church using them so that the can be protected and conserved. The museum is huge and so it is better to select parts of it rather than try to see the lot. There is a great walkway across the top of the building (unless you suffer from vertigo - the walkways are narrow and very high). The views from the front of the museum over Barcelona are great in their own right.", "publishedDate": "2019-09-09", "language": "en", "rating": 5}, {"id": 708110884, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d257527-r708110884-Museu_Nacional_d_Art_de_Catalunya_MNAC-Barcelona_Catalonia.html", "text": "The best art museum in the city above the meam. The environment of the museum is enviable. I recommend spending two or three hours.", "publishedDate": "2019-09-09", "language": "en", "rating": 5}, {"id": 708017206, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d257527-r708017206-Museu_Nacional_d_Art_de_Catalunya_MNAC-Barcelona_Catalonia.html", "text": "Five star is for the night show water fountain for the museum.\n\nIt is better than the magic fountain show in my opinion.\n\nPostcard worthy!", "publishedDate": "2019-09-08", "language": "en", "rating": 5}, {"id": 706831998, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d257527-r706831998-Museu_Nacional_d_Art_de_Catalunya_MNAC-Barcelona_Catalonia.html", "text": "A really good experience. The price for the main collection is 12 Eur, ant it is worth it, because the collection is really big. The museum is really well planned, so you cannot get lost and you walk from the oldest pieces of art to the newest. We went after 3 pm, and there were only a few visitors so it was really nice to enjoy the art. Also they have an amazing terrace on the roof where the view of Barcelona is really nice. Recommend :)", "publishedDate": "2019-09-05", "language": "en", "rating": 5}, {"id": 706790086, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d257527-r706790086-Museu_Nacional_d_Art_de_Catalunya_MNAC-Barcelona_Catalonia.html", "text": "I highly recommend if you have time or love art to visit this museum.  Catalonia has a unique history and they show this off with their art as well.  The meuesum has art from the medieval (Gothic and Romanesque) up to the modern time. \n\nBy far my favorite sections were the Romanesque and the section of modern art that displayed the civil war period.  The Romanesque section does a fantastic way of displaying the art.  They actively reconstructed the displays to resemble the churches much of the art had been taken from, and they have fantastic murals and frescos to observe. The civil war section showed various propoganda posters which illustrate art deco style as well as photo graphs and even a news real of the period.\n\nWell worth the admission!!", "publishedDate": "2019-09-05", "language": "en", "rating": 5}, {"id": 706355434, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d257527-r706355434-Museu_Nacional_d_Art_de_Catalunya_MNAC-Barcelona_Catalonia.html", "text": "We spend 5 hous in this museum and it could have been more. To walk up there along the fountains and the waterfuls ist also already great", "publishedDate": "2019-09-04", "language": "en", "rating": 5}, {"id": 706179609, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d257527-r706179609-Museu_Nacional_d_Art_de_Catalunya_MNAC-Barcelona_Catalonia.html", "text": "The selection of art included Romanesque through to modern. There was so much to see I want to return. The building and the gardens were fantastic as well.", "publishedDate": "2019-09-03", "language": "en", "rating": 5}, {"id": 705946269, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d257527-r705946269-Museu_Nacional_d_Art_de_Catalunya_MNAC-Barcelona_Catalonia.html", "text": "Stopped here on the hop on hop off bus and it was an impressive facade to photograph. Also had great views of the city. If I came again would go inside but we got there pretty late and were tired from walking all day.", "publishedDate": "2019-09-03", "language": "en", "rating": 5}, {"id": 702938004, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d257527-r702938004-Museu_Nacional_d_Art_de_Catalunya_MNAC-Barcelona_Catalonia.html", "text": "My husband and I bought the Museum pass, which worked great for us, because we were interested in 4 out of the 5 museums the pass gave us entrance to.  We visited before noon, there were no lines and the museum is so large one never has to contend with corwded spaces. Much of the time we were there, we had the art piece we were looking at to ourselves.  We enjoyed the modern art sections, the explanations are in English too, so that was great for us.  We also went to the special exhibit of the photographers, which was very interesting and well presented in a chronological manner.  We ended our time at the museum with a visit to the roof top viewing areas, this was great and is part of your ticket price.  There is a walkway that takes you to both sides of the terrace.  It was a wonderful place to view the fountains in action and get an understanding of the cities neighborhoods.  There is a cafe in the big hall on the lower level, we had light lunch and coffee, which was a good break.", "publishedDate": "2019-08-25", "language": "en", "rating": 5}, {"id": 701892066, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d257527-r701892066-Museu_Nacional_d_Art_de_Catalunya_MNAC-Barcelona_Catalonia.html", "text": "If the views and steps outside the museum itself weren't enough, the inside of the museum houses a vast collection of Catalonian artwork from various historical periods. The admission ticket is good for two days, so you could spend the hot afternoons inside over a couple of days. We did not have the time to take advantage of that, but would have. The collection of Romanic Gothic art is impressive and some built into the museum to give you something close to the experience of being in an old Catalonian church. The Gothic and Renaissance exhibits show a clear evolution of the art, and the modern exhibits upstairs are fantastic as well, often showing influence from other regions. Highly recommend for art and history lovers.", "publishedDate": "2019-08-22", "language": "en", "rating": 5}, {"id": 700726638, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d257527-r700726638-Museu_Nacional_d_Art_de_Catalunya_MNAC-Barcelona_Catalonia.html", "text": "A must visit place in Barcelona with its own history and amazing views. A great place to simply sit ( in the shade) and watch life pass you by.", "publishedDate": "2019-08-19", "language": "en", "rating": 4}, {"id": 699021577, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d257527-r699021577-Museu_Nacional_d_Art_de_Catalunya_MNAC-Barcelona_Catalonia.html", "text": "A must see. Fantastic building in itself. Viewed the medieval and gothic Middle Ages sections and was so impressed. It’s well set out. Easy to navigate around. A cafe for lunch. Very reasonable entry prices. One of the best art galleries I’ve seen. Would recommend. ", "publishedDate": "2019-08-14", "language": "en", "rating": 5}, {"id": 698943987, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d257527-r698943987-Museu_Nacional_d_Art_de_Catalunya_MNAC-Barcelona_Catalonia.html", "text": "Impresssive monument facing Plaza Espagna. One of the most beautiful building in Barcelona. Built for the world\"s fair.", "publishedDate": "2019-08-14", "language": "en", "rating": 5}, {"id": 698432679, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d257527-r698432679-Museu_Nacional_d_Art_de_Catalunya_MNAC-Barcelona_Catalonia.html", "text": "My friend and I were not planning on going but we were walking and saw the museum up on a hill so decided to check it out and we are so happy we did.\nThe infinity fountains are amazing and the museum had a lot of cool art from contemporary to medieval to renaissance..just about everything!", "publishedDate": "2019-08-13", "language": "en", "rating": 5}, {"id": 698183985, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d257527-r698183985-Museu_Nacional_d_Art_de_Catalunya_MNAC-Barcelona_Catalonia.html", "text": "Always one of my favourite places to go. A great view from the top looking back down onto the square. Great for photos and access to the fountain when it’s on.", "publishedDate": "2019-08-12", "language": "en", "rating": 5}, {"id": 697859448, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d257527-r697859448-Museu_Nacional_d_Art_de_Catalunya_MNAC-Barcelona_Catalonia.html", "text": "We walked there in the morning before we go to the castle and the Teleférico and it was a free entrance for that day we enjoyed the art pieces inside the view from the top \n", "publishedDate": "2019-08-11", "language": "en", "rating": 5}, {"id": 697205182, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d257527-r697205182-Museu_Nacional_d_Art_de_Catalunya_MNAC-Barcelona_Catalonia.html", "text": "Visited this museum at Plaza  de Espanya where we had been the previous evening to watch Magic Fountains. It is a huge place with different sections housing various art styles. It is located on top of a hill and has a commanding view. At the bottom of the hill is the Magic Fountain. Great sight. Worth visiting.", "publishedDate": "2019-08-09", "language": "en", "rating": 4}, {"id": 696402603, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d257527-r696402603-Museu_Nacional_d_Art_de_Catalunya_MNAC-Barcelona_Catalonia.html", "text": "This museum focuses on Catalunyan artists.  There are some surprisingly interesting pieces.  If you like art this is worth a visit.", "publishedDate": "2019-08-06", "language": "en", "rating": 5}, {"id": 696337304, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d257527-r696337304-Museu_Nacional_d_Art_de_Catalunya_MNAC-Barcelona_Catalonia.html", "text": "Start from the avenue below the museum and RIDE THE ESCALATORS up to the museum!  You'll pass by fantastic fountains, pools, and waterfalls.  And the view from the top is spectacular.  Oh, and the museum is pretty damned good too!  The collections are extensive, and well displayed.  In the summer of 2019 there was a truly odd \"white bouncy castle\" exhibit in their largest room.  Modern art you can bounce on?", "publishedDate": "2019-08-06", "language": "en", "rating": 4}, {"id": 695399791, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d257527-r695399791-Museu_Nacional_d_Art_de_Catalunya_MNAC-Barcelona_Catalonia.html", "text": "Very large museum with plenty of space and a lovely interior. The interactive bouncy castle is an interesting touch, situated in a vast auditorium with a huge organ. Lovely walk from the top floor around it. Very interesting gothic collection and a very interesting and eclectic modern collection. Go and see!", "publishedDate": "2019-08-04", "language": "en", "rating": 5}, {"id": 695111388, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d257527-r695111388-Museu_Nacional_d_Art_de_Catalunya_MNAC-Barcelona_Catalonia.html", "text": "It’s mainly paintings .. for me and I always go to museums in every country I visit , it was boring ,boring,boring.", "publishedDate": "2019-08-03", "language": "en", "rating": 2}, {"id": 693173886, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d257527-r693173886-Museu_Nacional_d_Art_de_Catalunya_MNAC-Barcelona_Catalonia.html", "text": "Lies somewhat out of the center. Nice panorama over Barcelona.\nGreat collection Gothic art and modernism.", "publishedDate": "2019-07-27", "language": "en", "rating": 5}, {"id": 692329481, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d257527-r692329481-Museu_Nacional_d_Art_de_Catalunya_MNAC-Barcelona_Catalonia.html", "text": "I can't say my wife & I are real art buffs but can appreciate it in it's simplest form. I can however say that if you are more appreciative of art then you will be more than happy spending a good few hours taking in all the museum has to offer.", "publishedDate": "2019-07-24", "language": "en", "rating": 4}, {"id": 692251971, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d257527-r692251971-Museu_Nacional_d_Art_de_Catalunya_MNAC-Barcelona_Catalonia.html", "text": "The museum is very interesting and big, unfortunately it closes very early in the afternoon and it's difficult to visit it just in a few hours.", "publishedDate": "2019-07-24", "language": "en", "rating": 5}, {"id": 691028318, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d257527-r691028318-Museu_Nacional_d_Art_de_Catalunya_MNAC-Barcelona_Catalonia.html", "text": "This museum is worth a visit just for the view over Barcelona.\nBut the art works are brilliant as well.\nGothic,Romanesque,Renaissance as well as 19th and 20th century collections", "publishedDate": "2019-07-19", "language": "en", "rating": 4}, {"id": 690350117, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d257527-r690350117-Museu_Nacional_d_Art_de_Catalunya_MNAC-Barcelona_Catalonia.html", "text": "The National Art Museum in Barcelona houses an amazing collection of Romanesque, Gothic, Renaissance and Baroque art alongside it's collections of fine arts from 19th and 20th century. Some of the most outstanding items are in the religious art collection such as the Romanesque \"Apse of Sant Climent de Taüll\", a fresco from Church of St. Climent de Taüll and \"Resurrection and Descent of Christ into Limbo\" in the Gothic collection.\n\nNot to be missed in Barcelona. Don't forget, entry is free every Saturday after three.", "publishedDate": "2019-07-17", "language": "en", "rating": 5}, {"id": 689470302, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d257527-r689470302-Museu_Nacional_d_Art_de_Catalunya_MNAC-Barcelona_Catalonia.html", "text": "The entire area around the museum and the Espania Plaza can be done together. I recommend purchasing the ticket online, and checking if the museum is open before you visit. The place is excellent for pictures.", "publishedDate": "2019-07-14", "language": "en", "rating": 4}, {"id": 689396248, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d257527-r689396248-Museu_Nacional_d_Art_de_Catalunya_MNAC-Barcelona_Catalonia.html", "text": "The Museu Nacional was not high on our list of tourist type places, but it turned out to be one of the most enjoyable. The building itself is impressive. The view from the roof is fun, although not so much different from the Cathedral and Basilica roofs. But the best is inside. We visited on free Saturday afternoon, but for Barcelona in summer, the crowd was not a problem, at least at 4 or so.\nAmazing range of installations. My wife and I were mesmerized by the eyes of the Romanesque pieces from a millennium ago; I didn’t think I dug that style, but I really dig it. \nIn the same museum we got to bounce on the worlds largest bouncy castle. ", "publishedDate": "2019-07-14", "language": "en", "rating": 5}, {"id": 689309413, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d257527-r689309413-Museu_Nacional_d_Art_de_Catalunya_MNAC-Barcelona_Catalonia.html", "text": "This probably doesn't get the attention it deserves - but so well worth visiting.  You can go for free after 1500 on the last Saturday of the month - but it is still worth paying for and they do have senior discounts.\nIt is spectacular to see the building itself from many venues in Barcelona, sitting on the bluff on Montjuic.  We approached from the Placa d'Espana, and past the fountains and up the many stairs.  Stunning viewing area just outside the entrance to the museum.\nPlenty of art to see from many different periods - and absolutely interesting and a bit overwhelming it was so large inside.  Beautiful architecture as well.  Wish we'd had more time.  Don't miss this gem.", "publishedDate": "2019-07-13", "language": "en", "rating": 5}, {"id": 688926817, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d257527-r688926817-Museu_Nacional_d_Art_de_Catalunya_MNAC-Barcelona_Catalonia.html", "text": "he Art Museum building sits on the side of the hill overlooking Espania Plaza.  From the metro stop on the plaza, you walk along the broad parkway up multiple levels to reach the museum itself.  If you are lucky you get to make this walk when the fountains are active (they are not active all the time) and then the feel is like approaching a magnificent palace.  \n   There are escalators along the way taking you from terrace level to terrace level so the walk is not exhausting.  Those in wheelchairs or with physicial limitation should consider the extra expense of taxi or tourbus, although it would be a great shame to miss the fountains and waterfalls.\n  The building is massive with vaulting high ceilings which are important to the displays.  There are only 4 permanent displays in the building - Romanesque, Medieval, Classical, and Modern which means that each exhibit has a great deal of space (I was in the Hermitage once and everything was so jammed together you saw nothing, really).\nIt was the Romanesque exhibit that blew me away.  I went in expecting dull exhibits with sections of mosaics and frescos.  Instead, the incredible spaciousness allows the museum to recreate entire Naves, Apses, and Grottos and place the art in the architecture the way it would have been seen 800 -900 years ago.  \n  The result is more than impressive, it is awe inspiring.  Well worth the trip up even if you don't see the other exibits.\nAudioguides in multiple languages are available and well worth the expense (do not tour Romanesque without it).\nSeniors over 65 are free admission and a discount on the audioguide.", "publishedDate": "2019-07-12", "language": "en", "rating": 5}, {"id": 688481513, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d257527-r688481513-Museu_Nacional_d_Art_de_Catalunya_MNAC-Barcelona_Catalonia.html", "text": "We went here in the evening.it was the best place we went to in Barcelona.couldn't recommend this place enough  ", "publishedDate": "2019-07-10", "language": "en", "rating": 5}, {"id": 688296678, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d257527-r688296678-Museu_Nacional_d_Art_de_Catalunya_MNAC-Barcelona_Catalonia.html", "text": "Starting from the way up to get there, a tiny park, escalators, the building itself, continuing the opportunity to climb to the roof for the most spectacular views of the city, walk around on the roof to enjoy various perspectives, and then, enjoy the wonderful exhibitions of paintings, art details, and antique furniture. Honestly, one of my favourite museums in the city!", "publishedDate": "2019-07-09", "language": "en", "rating": 5}, {"id": 687313233, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d257527-r687313233-Museu_Nacional_d_Art_de_Catalunya_MNAC-Barcelona_Catalonia.html", "text": "I gasped as I turned the corner onto this stunning property. Then the inside allows you to view the classic paintings that you learn about in your youth. I was awestruck at all the Masters I was fortunate enough to see. Then the outside of the building is majestic as you climb down to the fountain show. ", "publishedDate": "2019-07-06", "language": "en", "rating": 5}, {"id": 687182789, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d257527-r687182789-Museu_Nacional_d_Art_de_Catalunya_MNAC-Barcelona_Catalonia.html", "text": "In a city like Barcelona, this museum is probably not at the top of most visitors' list of things-to-see, but my visit here was a fantastic experience. I never thought that I could walk through a museum packed with frescos for over an hour, without getting bored. But these frescos in the Romanesque Art section are just stunning. The lively colors, the symbolism, the craftsmanship. It blows my mind when I imagine these frescos in their original setting, in small churches in the Pyrenees up to a 1000 years ago. \nAlso enjoyed how spacious and relatively uncrowded this place is. When you need a break from the (equally amazing) modernist art in Barcelona, give this place a go!", "publishedDate": "2019-07-06", "language": "en", "rating": 5}, {"id": 686645452, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d257527-r686645452-Museu_Nacional_d_Art_de_Catalunya_MNAC-Barcelona_Catalonia.html", "text": "We visited the museum on the last Saturday of the month, when the entrance after 15:00 is free, but it is worth paying for this museum. A very rich collection of modern art.", "publishedDate": "2019-07-04", "language": "en", "rating": 5}, {"id": 686371786, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d257527-r686371786-Museu_Nacional_d_Art_de_Catalunya_MNAC-Barcelona_Catalonia.html", "text": "It is near to exhibition center, after our visit finish, we visit this place. You can use moving staircase until top of the museu, otherwise it is difficult to climb all stair under sun.", "publishedDate": "2019-07-03", "language": "en", "rating": 5}, {"id": 686283194, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d257527-r686283194-Museu_Nacional_d_Art_de_Catalunya_MNAC-Barcelona_Catalonia.html", "text": "Best to visit this site in the early evening, when the street performers put on a show and show their wares. The fountain is absolutely mesmerising and this was the highlight of my Barcelona experience.", "publishedDate": "2019-07-02", "language": "en", "rating": 5}, {"id": 686188276, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d257527-r686188276-Museu_Nacional_d_Art_de_Catalunya_MNAC-Barcelona_Catalonia.html", "text": "A beautiful walk from the Barcelona metro along an esplanade looking up a hill with a beautiful waterfall and fountain ⛲️ you then see the museum on top with beautiful stone columns and inside a huge variety of modern and ancient art works. A lovely day out.", "publishedDate": "2019-07-02", "language": "en", "rating": 5}, {"id": 686134591, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d257527-r686134591-Museu_Nacional_d_Art_de_Catalunya_MNAC-Barcelona_Catalonia.html", "text": "Superb views from the landing down to Plaza Espagna.  The building is impressive with a huge auditorium in the center flanked by the galleries.  Superb collection of Roman art as well as a selection of art up until contemporary.  We went at 10:00 am and had much of the space to ourselves.  It started filling up around 1:00.", "publishedDate": "2019-07-02", "language": "en", "rating": 5}, {"id": 685194592, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d257527-r685194592-Museu_Nacional_d_Art_de_Catalunya_MNAC-Barcelona_Catalonia.html", "text": "The entrance is free on Saturday afternoons. Take advantage of this. The art is amazing and also the high ceilings and huge rooms are mind blowing.", "publishedDate": "2019-06-29", "language": "en", "rating": 4}, {"id": 685168214, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d257527-r685168214-Museu_Nacional_d_Art_de_Catalunya_MNAC-Barcelona_Catalonia.html", "text": "After a few days visiting Barcelona, we decided to climb the Montjuic to explore the national museum. Took the funicular at Para-lel station to reach the museum instead of climbing via Placa Espanya. It is a different way to reach it and quite pleasant if we walk thru the gardens along the way.\n\nThe museum is divided in four sections, easily identified. Each can be visited separately depending on your interests or time you have. Well presented, you can easily wander in all the rooms at your own rhythm.\n\nThe second floor sections appealed more to me than the other two who are mostly religiously focused.\n\nIf you are looking into visiting the Montjuic attractions stopping at the MNAC should added to your list.", "publishedDate": "2019-06-29", "language": "en", "rating": 4}, {"id": 685038008, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d257527-r685038008-Museu_Nacional_d_Art_de_Catalunya_MNAC-Barcelona_Catalonia.html", "text": "I only saw this from the outside but i love the architecture!  It makes for a great photo background with the waterfalls when the magic fountain show is happening. ", "publishedDate": "2019-06-28", "language": "en", "rating": 5}, {"id": 684839238, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d257527-r684839238-Museu_Nacional_d_Art_de_Catalunya_MNAC-Barcelona_Catalonia.html", "text": "Really enjoyed this Museum, had experienced a bunch teenager were on a school outing and never heard a peep!", "publishedDate": "2019-06-27", "language": "en", "rating": 5}, {"id": 684768582, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d257527-r684768582-Museu_Nacional_d_Art_de_Catalunya_MNAC-Barcelona_Catalonia.html", "text": "First off, the site and building are beautiful. The approach from the Plaza de Espanya is dramatic, with a series of \"waterfall\" fountains cascading down the hill away from the museum, a former palace. The views of the city below from the building's steps is terrific. Approaching from the side, you can take a winding path through the park de Montjuic, which is also a nice stroll. The collection is unique, and the interpretation contemporary. I loved the presentation of the Romanesque church art - they built arches and domes to display the frescoes and murals in the configuration for which they were intended. The lighting of the sculptures in these spaces was also beautifully done, and highlighted the characteristic, attenuated forms common for the period. The collection of paintings were presented thematically (rather than chronologically, or focusing on the biggest marquee names), which I found interesting and challenging. The collection is very strong in Catalan modernism, both painting and decorative arts, which is unique, and anyone who is not a specialist will likely see something new and fresh. They also had a few spaces dedicated to graphic arts and film during the civil war, which were new to me and very interesting.", "publishedDate": "2019-06-27", "language": "en", "rating": 5}, {"id": 684612007, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d257527-r684612007-Museu_Nacional_d_Art_de_Catalunya_MNAC-Barcelona_Catalonia.html", "text": "Spent couple hours here and enjoyed Catalunyan art, saw bunch middle school kids here on outing never heard a peep from them wow!!", "publishedDate": "2019-06-26", "language": "en", "rating": 5}, {"id": 684610252, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d257527-r684610252-Museu_Nacional_d_Art_de_Catalunya_MNAC-Barcelona_Catalonia.html", "text": "We just enjoyed strolling through Museu Nacional D Art De Catalunya and admiring all the art work done. There was bunch of middle school kids and strolling through and never heard them make a noise.\nAt 2100 at night have light display show outside.", "publishedDate": "2019-06-26", "language": "en", "rating": 5}, {"id": 684106092, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d257527-r684106092-Museu_Nacional_d_Art_de_Catalunya_MNAC-Barcelona_Catalonia.html", "text": "Decided to visit MNAC as we had a day of inclement weather which limited our ability to sight-see outdoors. The museum is in a wonderful position perched on Montjuic with fabulous views across the city.\nThe collection is focused on local Catalonian art but the breadth of the collection is breathtaking. Of particular was the artwork that had been rescued from a large number of Catalonian churches and chapels. \nThe frescoes had been restored but then displayed in a manner that enabled you to imagine how they had looked when they were in situ. Most of the churches and chapels that the artwork had been rescued from had fallen into disrepair or destroyed completely so the work to rescue the artwork had enabled it to be available for posterity.\nThere was also a large collection of more modern art with works by Picasso and Jean Miro of particular interest\nReally well worth a visit. the audioguide is available in a number of languages and really adds to the experience of the visit.", "publishedDate": "2019-06-24", "language": "en", "rating": 5}, {"id": 683371314, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d257527-r683371314-Museu_Nacional_d_Art_de_Catalunya_MNAC-Barcelona_Catalonia.html", "text": "Excellent Museum displaying a historic narrative of culture and art of Catalunya. The displayed  works of art were were some of the best and divided into various ages. The rooftop provides a stunning view of city. ", "publishedDate": "2019-06-22", "language": "en", "rating": 5}, {"id": 682947282, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d257527-r682947282-Museu_Nacional_d_Art_de_Catalunya_MNAC-Barcelona_Catalonia.html", "text": "Amazing building, an oasis in Barcelona, peace and quiet, great architecture, art on show, nice indoor cafe, climb the tower for fantastic views of the city, barely anyone in there! It’s like a Riad in Marrakesh, step inside and you leave the hectic city behind. One of our new favourite Barca places.", "publishedDate": "2019-06-20", "language": "en", "rating": 5}, {"id": 682657231, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d257527-r682657231-Museu_Nacional_d_Art_de_Catalunya_MNAC-Barcelona_Catalonia.html", "text": "You can't miss this. It's all about the Cataluna district. Art at its best and also wandering around is relaxing and part of the experience.", "publishedDate": "2019-06-19", "language": "en", "rating": 5}, {"id": 682343801, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d257527-r682343801-Museu_Nacional_d_Art_de_Catalunya_MNAC-Barcelona_Catalonia.html", "text": "The building is stunning and the approach through the fountains etc is incredible however entrance is quite expensive.", "publishedDate": "2019-06-18", "language": "en", "rating": 4}, {"id": 682252815, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d257527-r682252815-Museu_Nacional_d_Art_de_Catalunya_MNAC-Barcelona_Catalonia.html", "text": "The art on display was a little too... classic... for me. The building and grounds were incredible though.", "publishedDate": "2019-06-17", "language": "en", "rating": 3}, {"id": 681905124, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d257527-r681905124-Museu_Nacional_d_Art_de_Catalunya_MNAC-Barcelona_Catalonia.html", "text": "The building is impressive in itself and the location on top of the hill overlooking Barcelona provides great views. The art gallery has the most Impressive collection of Medieval Romanico and Gothic art I have seen. I also booked the viewing gallery at the top of the building and ate in the restaurant there. The food was good. The views were fabulous the best I found in Barcelona. Getting there was easy I took the number 55 bus from the city centre. Going back to the city I walked to Placa D’Espanya and got the bus back into the city. The used google to choose busses and  and which stops to get on and off at. I would not want to walk it in the heat so June was perfect with a hat sunblock and good shoes. ", "publishedDate": "2019-06-16", "language": "en", "rating": 4}, {"id": 681832338, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d257527-r681832338-Museu_Nacional_d_Art_de_Catalunya_MNAC-Barcelona_Catalonia.html", "text": "I took photos from every part! \nInside this museum was a bit complicated to us, we went wrong way and in the end were tired of looking for the correct signs.\nI recommend to wait until the evening for the Magic fountain.", "publishedDate": "2019-06-16", "language": "en", "rating": 5}, {"id": 681372985, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d257527-r681372985-Museu_Nacional_d_Art_de_Catalunya_MNAC-Barcelona_Catalonia.html", "text": "The building itself is worth a visit and the views over the city. Admission to the museum is free however you do have to pay to view any special exhibitions. There is a restaurant on the first floor with floor to ceiling windows making the most of the views. There is a snack bar outside the front with seating . When we were there a guy was busking with an electric guitar which added to the atmosphere. Only downside was the dozens of Lucky men selling tat . We used the City Tours bus which stops right outside.", "publishedDate": "2019-06-13", "language": "en", "rating": 5}, {"id": 681290397, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d257527-r681290397-Museu_Nacional_d_Art_de_Catalunya_MNAC-Barcelona_Catalonia.html", "text": "We spent about 2.5h inside and everything was amazing. All the expositions were interesting either for adults or the children. You can also buy souvenirs and also there are some options to eat in case the visiting has consumed all your energy. The view from the terraces and from the roof is wonderful. Near the museum there are also a lot of other sightseeing to visit. Easy reachable per subway. A must have while in Barcelona. Clearly a 5 stars sightseeing !Enjoy !", "publishedDate": "2019-06-13", "language": "en", "rating": 5}, {"id": 681277739, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d257527-r681277739-Museu_Nacional_d_Art_de_Catalunya_MNAC-Barcelona_Catalonia.html", "text": "This collection is housed in the beautiful palace/castle of Catalunya. Worth the trip. Make sure you go early and return for the Magic Fountain in the evening.", "publishedDate": "2019-06-13", "language": "en", "rating": 4}, {"id": 681056614, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d257527-r681056614-Museu_Nacional_d_Art_de_Catalunya_MNAC-Barcelona_Catalonia.html", "text": "We spent the day at this museum and plan to go back for a second day.  The collection in romanesque art is one of the best in the world.  It is worth a trip to Barcelona just to see the frescoes rescued from churches in the Pyrenees.  But the modern art holdings are also rich and presented in an excellent, educational way.", "publishedDate": "2019-06-12", "language": "en", "rating": 5}, {"id": 680384909, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d257527-r680384909-Museu_Nacional_d_Art_de_Catalunya_MNAC-Barcelona_Catalonia.html", "text": "The museum is split into different section: the renaissance and the gothic area. there are amazing piece of art that are a must to see. and to miss to check out the park from outside", "publishedDate": "2019-06-10", "language": "en", "rating": 4}, {"id": 680213802, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d257527-r680213802-Museu_Nacional_d_Art_de_Catalunya_MNAC-Barcelona_Catalonia.html", "text": "Great museum with stunning views and world class art, cave paintings, medieval statues, furniture etc.\nEnormous mix of things to see in a wonderful building.\nTicket also allows you to return for free, with seniors getting in free.\nBeautifully laid out, good English explanations and art you may not see anywhere else.\nBring a picnic and have lunch on the outside steps. Just fabulous. ", "publishedDate": "2019-06-09", "language": "en", "rating": 5}, {"id": 678930715, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d257527-r678930715-Museu_Nacional_d_Art_de_Catalunya_MNAC-Barcelona_Catalonia.html", "text": "Impressive building and grounds.  It's going to be crowded so be aware.  Best view is from the top of building. Take elevator to the left of entry into building and up stairs.  Fountain falls were awesome and best picture at the bottom looking up.  Security everywhere so very safe.  Lots of street vendors pushing merchandise.  ", "publishedDate": "2019-06-04", "language": "en", "rating": 5}, {"id": 678851146, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d257527-r678851146-Museu_Nacional_d_Art_de_Catalunya_MNAC-Barcelona_Catalonia.html", "text": "Set in lovely grounds with magnificent views over Barcelona.  Collection is good but best of all includes a Picasso which is “more famous” than anything we saw in the Picasso gallery the previous day! Nice bar outside too, can get beers and snacks. Definitely recommend.", "publishedDate": "2019-06-04", "language": "en", "rating": 4}, {"id": 678749526, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d257527-r678749526-Museu_Nacional_d_Art_de_Catalunya_MNAC-Barcelona_Catalonia.html", "text": "we came here to fill some time before catching the flight home. Free entry on the first Sunday of the month so was a bargain. lots to see and will take a few hours to get around. the cafe has some gluten free muffins to have with a coffee so that was a bonus. we were able to lock up the small suitcases in the cloakroom area so we could walk around unhindered.", "publishedDate": "2019-06-04", "language": "en", "rating": 4}, {"id": 678002893, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d257527-r678002893-Museu_Nacional_d_Art_de_Catalunya_MNAC-Barcelona_Catalonia.html", "text": "Unfortunately due to time constraints we didn’t get the chance to go inside but a great view point for the city.", "publishedDate": "2019-06-01", "language": "en", "rating": 4}, {"id": 677895896, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d257527-r677895896-Museu_Nacional_d_Art_de_Catalunya_MNAC-Barcelona_Catalonia.html", "text": "Our visit to this art gallery was one of the true highlights of our one week visit to Barcelona. The collection was solid and engaging, with an especially strong emphasis on the Catalunya culture. ", "publishedDate": "2019-05-31", "language": "en", "rating": 5}, {"id": 677740628, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d257527-r677740628-Museu_Nacional_d_Art_de_Catalunya_MNAC-Barcelona_Catalonia.html", "text": "Since you get a lovely view of down-town Barcelona from the Main Building there is always a crowd there. There are people just lounging around at the coffee shops outside the entrance and always some people playing some live music on some instruments. All in all, a very interesting place !", "publishedDate": "2019-05-30", "language": "en", "rating": 5}, {"id": 677559818, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d257527-r677559818-Museu_Nacional_d_Art_de_Catalunya_MNAC-Barcelona_Catalonia.html", "text": "if you appreciate art you'll like this, if not then give it a miss\n\nworth visiting to see the park outside if nothing else", "publishedDate": "2019-05-30", "language": "en", "rating": 4}, {"id": 677135920, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d257527-r677135920-Museu_Nacional_d_Art_de_Catalunya_MNAC-Barcelona_Catalonia.html", "text": "Very nice collection of medieval and Renaissance art. The frescoes and religious artifacts recovered from old churches in the region that date from the 12th and 13th centuries have been very effectively preserved and beautifully displayed to give the visitor an idea of how they appeared in their origins nap location. Just this gallery alone was worth the visit.", "publishedDate": "2019-05-28", "language": "en", "rating": 5}, {"id": 677134330, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d257527-r677134330-Museu_Nacional_d_Art_de_Catalunya_MNAC-Barcelona_Catalonia.html", "text": "Great vistas.. gorgeous architecture.. a joy to see! Nice to go on off hours.. less tourists.. and definitely on a nice weather day... q", "publishedDate": "2019-05-28", "language": "en", "rating": 5}, {"id": 676974924, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d257527-r676974924-Museu_Nacional_d_Art_de_Catalunya_MNAC-Barcelona_Catalonia.html", "text": "A beautiful building with one of the best views of Barcelona you can find. Well worth a visit and if you are over 65 it's free.", "publishedDate": "2019-05-27", "language": "en", "rating": 5}, {"id": 676869534, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d257527-r676869534-Museu_Nacional_d_Art_de_Catalunya_MNAC-Barcelona_Catalonia.html", "text": "Murals are the highlight. As is the location of the bldg and its interior. Unfortunately we missed the info about an upper level viewing area.", "publishedDate": "2019-05-27", "language": "en", "rating": 4}, {"id": 676807670, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d257527-r676807670-Museu_Nacional_d_Art_de_Catalunya_MNAC-Barcelona_Catalonia.html", "text": "The Museum and its grounds/fountain are pretty stunning from the outside.  We deliberately visited inside when it was free entry (Saturday after 3pm). You could spend a whole day viewing all the exhibits, but as we were time limited, we spent around 3 hours strolling through as much as we could.", "publishedDate": "2019-05-27", "language": "en", "rating": 4}, {"id": 676644436, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d257527-r676644436-Museu_Nacional_d_Art_de_Catalunya_MNAC-Barcelona_Catalonia.html", "text": "The museum was the perfect size for a rainy morning--interesting but not overwhelming. We especially enjoyed the Romanesque wing with the frescos form churches. A video was very interesting in showing how the frescos were removed from the churches and installed in the museum. There are also Gaudi exhibits that complement the Gaudi architecture found throughout Barcelona. ", "publishedDate": "2019-05-26", "language": "en", "rating": 5}, {"id": 676350863, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d257527-r676350863-Museu_Nacional_d_Art_de_Catalunya_MNAC-Barcelona_Catalonia.html", "text": "This is a beautiful museum with the best Romanesque, Renaissance and Gothic Art.  They also have Modern Art.  Lots of places to sit in the main areas.  The terrace views on approach from the side of the Palau are great with jazz music being played by street performer.  Upon entering the Palau, We were delighted to find entrance is free to Seniors.  We had lunch at the Oleum Restuarant which has great views with its large glass windows.  The walked up to the rooftop for some really great views.  Don't miss the views.  ", "publishedDate": "2019-05-25", "language": "en", "rating": 4}, {"id": 676219587, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d257527-r676219587-Museu_Nacional_d_Art_de_Catalunya_MNAC-Barcelona_Catalonia.html", "text": "The Museum has a rich collection of paintings, sculptures and decorative arts from the 11th century to the present. Especially impressive are the frescoes of the Romanesque period, collected from abandoned temples of Catalonia", "publishedDate": "2019-05-24", "language": "en", "rating": 5}, {"id": 675991920, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d257527-r675991920-Museu_Nacional_d_Art_de_Catalunya_MNAC-Barcelona_Catalonia.html", "text": "This is a famous building on the hill of Monjuic, with a beautiful panoramic view of the city. underneath it is the magical fountain, and behind it botanical gardens and the Olympic park.\n\nThere are escalators that can take you up from fountain to museum.", "publishedDate": "2019-05-23", "language": "en", "rating": 4}, {"id": 675886775, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d257527-r675886775-Museu_Nacional_d_Art_de_Catalunya_MNAC-Barcelona_Catalonia.html", "text": "The place is on the hill of Montjuïc, dominates the monumental halls and the fountainfilled avenue built for the 1929 International Exhibition. It now houses the Museu Nacional d’Art de Cata lunya, with an exceptional collection of medieval art, rich in Romanesque frescoes.", "publishedDate": "2019-05-23", "language": "en", "rating": 4}, {"id": 675723912, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d257527-r675723912-Museu_Nacional_d_Art_de_Catalunya_MNAC-Barcelona_Catalonia.html", "text": "A lot of variety, any art lover will love this museum. Different expositions from different kinds of artists, and they change during the year. Very well organized and very helpful staff. You can also come here with a guide.", "publishedDate": "2019-05-22", "language": "en", "rating": 5}, {"id": 675594787, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d257527-r675594787-Museu_Nacional_d_Art_de_Catalunya_MNAC-Barcelona_Catalonia.html", "text": "Really nice and lovely atmosphere. You can enjoy evenings just enjoying the sunset over Barcelona. In museum you can find a lot os unique artworks. ", "publishedDate": "2019-05-21", "language": "en", "rating": 5}, {"id": 675312265, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d257527-r675312265-Museu_Nacional_d_Art_de_Catalunya_MNAC-Barcelona_Catalonia.html", "text": "Impressive building, with one of the best views over the city.   Not crowded (at least in a weekday).  You can ask questions to the personnel in the rooms and get meaningful (and interesting) answers.   And same as many other attractions in the city, easy public transportation.", "publishedDate": "2019-05-20", "language": "en", "rating": 5}, {"id": 675088783, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d257527-r675088783-Museu_Nacional_d_Art_de_Catalunya_MNAC-Barcelona_Catalonia.html", "text": "Really enjoyed the museum with some interesting Catalan art and wonderful view. Would take the bus from the metros station - do not take the cable car, it goes to the top of the hill and not to the museum.", "publishedDate": "2019-05-19", "language": "en", "rating": 5}, {"id": 675041057, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d257527-r675041057-Museu_Nacional_d_Art_de_Catalunya_MNAC-Barcelona_Catalonia.html", "text": "Most of the contents originate from Catalonia, but there are a few surprises, Sisley, Burne-Jones, Munch, Cranach for example. There is some great stuff in the 80 or so rooms, but two things stand out for me. First is the building itself, especially the Oval room, one of the largest public spaces in Europe and secondly the quality of the displays, especially the Romanesque section. \nThis is one of the great, but relatively unknown museums in Europe and it was so good we went twice, which your entry ticket allows.", "publishedDate": "2019-05-19", "language": "en", "rating": 5}, {"id": 674509826, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d257527-r674509826-Museu_Nacional_d_Art_de_Catalunya_MNAC-Barcelona_Catalonia.html", "text": "We always find an art museum.  A wide variety of art is available to view and their is a lovely cafe.  The entry ticket is only 12 Euros and is good for two days.  We saw everything!  Worth the climb up to it.", "publishedDate": "2019-05-16", "language": "en", "rating": 5}, {"id": 674103960, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d257527-r674103960-Museu_Nacional_d_Art_de_Catalunya_MNAC-Barcelona_Catalonia.html", "text": "we enjoy it from outside because the weather was very nice. a beautiful building. from the balcony was also a beautiful view of center of Barcelona", "publishedDate": "2019-05-15", "language": "en", "rating": 3}, {"id": 674054282, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d257527-r674054282-Museu_Nacional_d_Art_de_Catalunya_MNAC-Barcelona_Catalonia.html", "text": "Beautiful building constructed for 1929 Barcelona Exposition.Good views of city from rooftop!\nArt work not very extensive.", "publishedDate": "2019-05-14", "language": "en", "rating": 4}, {"id": 673445353, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d257527-r673445353-Museu_Nacional_d_Art_de_Catalunya_MNAC-Barcelona_Catalonia.html", "text": "What a surprise to discover that over 65’s were admitted free. We would happily have paid to visit as the art work from across the centuries is set out in an excellent way in a fantastic setting.", "publishedDate": "2019-05-12", "language": "en", "rating": 5}, {"id": 673286567, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d257527-r673286567-Museu_Nacional_d_Art_de_Catalunya_MNAC-Barcelona_Catalonia.html", "text": "Not a MAJOR museum like La Prada that have whole rooms full of a singe famous artist,  this museum had one Picasso, two Dali's, one Goya, etc., but the collection as a whole was very attractive. The architecture of the building was stunning. Although pricey, the sit-down restaurant served excellent food while overlooking one of the most stunning views of the whole of downtown Barcelona. And the admission price for seniors was free. Having been to most of the major attractions in Barcelona, this place was a very nice complement to round out our Barcelona experience. Highly recommended.", "publishedDate": "2019-05-11", "language": "en", "rating": 4}, {"id": 672948925, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d257527-r672948925-Museu_Nacional_d_Art_de_Catalunya_MNAC-Barcelona_Catalonia.html", "text": "well worth a visit, the collection is very nice. We had a Barcelona card so the 12 E admission was \"free\" to us. Start upstairs at \"modern\" 1  for less crowds and art covering a wide range of period/style. ", "publishedDate": "2019-05-10", "language": "en", "rating": 5}, {"id": 672933838, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d257527-r672933838-Museu_Nacional_d_Art_de_Catalunya_MNAC-Barcelona_Catalonia.html", "text": "Definitely a must have when visiting Barcelona. It offers wonderful views of Barcelona, it's near to many other sightseeing (e.g. Poble Espanol, Arena, Caixa Forum, Fertility gate, Olympic stadium), easy reachable by subway or bus. The entrance ticket is one of the cheapest in Barcelona (and this is very important as most of the museum can be visited with 15 - 20 Euro....which is a lot comparing with other big cities) and there are some time-frames where it is even gratis. The children entered without paying any ticket. The expositions are really nice, the internal architecture is wonderful (there is also an internal arena like hall for concerts and other events), and the view from the roof is breath-taking. It's worth every penny or minute invested in this museum ! Go for it !", "publishedDate": "2019-05-09", "language": "en", "rating": 5}, {"id": 672838105, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d257527-r672838105-Museu_Nacional_d_Art_de_Catalunya_MNAC-Barcelona_Catalonia.html", "text": "My favorite spot in Barcelona. High on the hill away from the chaos of the city. The views alone are incredible. We really enjoyed lounging on the steps in front of the museum with a glass of wine from the outdoor cafe & listening to the musician play while gazing at the incredible views of the fountain & city. We went on a Sunday & were pleasantly surprised with free entry into the museum. Bit of a stair climb with an escalator for only part of the way. The museum itself is a grand beautiful building C 1929 & houses art that spans over 1000 years. The Romanesque murals on the first floor & the mural by Joan Miro on the second floor are incredible to see. There is also Modern, Gothic, Renaissance & Baroque Art. The museum is beautiful & spacious with the art thoughtfully displayed. There is a indoor/outdoor cafe,restaurant & gift shop. ", "publishedDate": "2019-05-09", "language": "en", "rating": 5}, {"id": 672803007, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d257527-r672803007-Museu_Nacional_d_Art_de_Catalunya_MNAC-Barcelona_Catalonia.html", "text": "This museum is one of the largest museums in Spain. It is situated on Montjuïc hill at the end of Avinguda de la Reina Maria Cristina, near Plaça d'Espanya. \n\nThere is a steep climb to the museum. Luckily part of it can be made by escalators. On the way, you can see the Venetian Towers, the Magic Fountain, and the Four Columns.\n\nThe museum is housed in the Palau Nacional, which is a huge Italian-style palace dating to 1929. You can still climb to the roof where you have the best views.\n\nThe building itself with a beautiful dome and a stunning Oval Hall is worth to see.\n\nThe art exhibitions are located on the ground and the first floors. \n\nThere is an outstanding collection of Romanesque church paintings and Catalan art and design from the late 19th and early 20th centuries, including Catalan modernism and noucentism.", "publishedDate": "2019-05-09", "language": "en", "rating": 5}, {"id": 672585677, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d257527-r672585677-Museu_Nacional_d_Art_de_Catalunya_MNAC-Barcelona_Catalonia.html", "text": "Amazing location, beautiful gardens and fountains. Walking distance to Institute of Physical Education and Barcelona stadium", "publishedDate": "2019-05-08", "language": "en", "rating": 5}, {"id": 671989055, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d257527-r671989055-Museu_Nacional_d_Art_de_Catalunya_MNAC-Barcelona_Catalonia.html", "text": "You can visit this museum and Miro the same day. The two are a short walk apart. The collection in the museum is wonderful and the restaurant is great. The views are stunning. ", "publishedDate": "2019-05-06", "language": "en", "rating": 5}, {"id": 670894330, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d257527-r670894330-Museu_Nacional_d_Art_de_Catalunya_MNAC-Barcelona_Catalonia.html", "text": "The long walk from the subway to the museum was tiring, but totally worth it! This museum has a wonderful art collection spanning from the Dark Ages on into the modern era. I especially loved the latter, and you really need a full day to take it all in. There is a performing  arts space somewhere around the Renaissance collection, where you will also find a small cafe. We were just in time to see some folks rehearsing while we ate lunch. If you are eligible for senior fare, bring your passport. They ask for this to apply the discount. The museum is also a somewhat hilly (but not terribly far) wall to the Juan Miro museum, which is also beautiful (and overlooks the mountains). Check the events schedule. They had a Red Bull bike completion setting up when we went, so it was quite crowded on the walk out and up to the museum.", "publishedDate": "2019-05-02", "language": "en", "rating": 5}, {"id": 670819921, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d257527-r670819921-Museu_Nacional_d_Art_de_Catalunya_MNAC-Barcelona_Catalonia.html", "text": "This museum contains some seriously good art. You will enjoy it if you are an art enthusiast and you will definitely like it no matter what. Besides, it is at the top of the hill, above the \"Magic Fountain\". The Museum building is a beautiful architectural wonder, inside and outside. Entry is free in late afternoon, and after spending an hour or more inside, then you can go outside to see the stunning spectacle of the Magic Fountain Show. You will absolutely love it!", "publishedDate": "2019-05-01", "language": "en", "rating": 4}, {"id": 670786487, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d257527-r670786487-Museu_Nacional_d_Art_de_Catalunya_MNAC-Barcelona_Catalonia.html", "text": "Worth the time to visit this location.  Amazing art and great views of the city.  The frescos were the highlight of the visit. Amazing religious art.", "publishedDate": "2019-05-01", "language": "en", "rating": 5}, {"id": 670261719, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d257527-r670261719-Museu_Nacional_d_Art_de_Catalunya_MNAC-Barcelona_Catalonia.html", "text": "I was in Barcelona for 4 days in 2013. I visited most of the art museums and Gaudi buildings but I didn’t get to see the Romanesque paintings because they weren’t on view. I promised myself I would return, and I did so this April. I spent two whole days in the museum and really enjoyed what I saw.  I recommend the Stoning of St. Stephen fresco! I confined myself to the Romanesque, the Gothic and the Renaissance/Baroque sections, and one temporary exhibition of 15th century Bermejo paintings. This museum complements the Prado in Madrid which is largely based on Royal collections. If you enjoy looking at the art of the past, I recommend this museum. Look, and read up about the Romanesque before you go, or when you get home. The Barcelona Romanesque gallery is the best in the world! \nOther good things about the museum. Free for over 65s with EU document/passport. The location on Mont Juic is wonderful. I took a taxi there and walked down.  Good places to eat in the museum. Use the room plan you are given to navigate the various sections. Not crowded when I was there.", "publishedDate": "2019-04-29", "language": "en", "rating": 5}, {"id": 669127546, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d257527-r669127546-Museu_Nacional_d_Art_de_Catalunya_MNAC-Barcelona_Catalonia.html", "text": "Saturdays 3-6pm Free Admission!\nAbsolutely loved this museum. Would need few days to see all the exhibits. Beautiful works of art, well presesented.\nWe only had few hours so we focused on the oldest works. So grateful I got to see such treasures. The building itself is well positioned and with lovely water features. Would love to come back and see more!", "publishedDate": "2019-04-25", "language": "en", "rating": 5}, {"id": 668919258, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d257527-r668919258-Museu_Nacional_d_Art_de_Catalunya_MNAC-Barcelona_Catalonia.html", "text": "A stunning walk from the Arena, up to the Museum.\nPast the fountains, buskers, and hawkers. Sadly, we only had time for the Medieval and Gothic exhibitions, as we were quite late arriving, and it closes at 15.00 on a Sunday. The exhibitions have been supported by many benefactors, and the quality and quantity of exhibits is incredible. The video of how murals are removed was interesting too. I'd like to see the modern exhibitions, so I'll need to go again!", "publishedDate": "2019-04-24", "language": "en", "rating": 5}, {"id": 668486374, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d257527-r668486374-Museu_Nacional_d_Art_de_Catalunya_MNAC-Barcelona_Catalonia.html", "text": "Walking up to the building is awe-inspiring! It is just stunning! There are huge fountains right in from of the museum that really give the building an enchanting look. The museum itself is well organized and has a good variety of art. It also has some beautiful ceilings and a very grand hall! While the museum is big it is also very manageable and you can get through the whole museum and still have half a day left to do other things. You do have to climb lots of stairs to get up to the museum but there are escalators and the view from the top is so worth it! ", "publishedDate": "2019-04-22", "language": "en", "rating": 5}, {"id": 667854097, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d257527-r667854097-Museu_Nacional_d_Art_de_Catalunya_MNAC-Barcelona_Catalonia.html", "text": "A beautiful set of buildings, gardens and vistas and also great within.\n\nA really nice place to visit, we really enjoyed it here and the buildings themselves and the gardens really are impressive.", "publishedDate": "2019-04-20", "language": "en", "rating": 5}, {"id": 667651578, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d257527-r667651578-Museu_Nacional_d_Art_de_Catalunya_MNAC-Barcelona_Catalonia.html", "text": "Highly recommend a 2-3 hour visit to this unique museum. The early frescoes are beautifully displayed, and a highlight of the museum. Audio guide is very helpful. And don’t miss the view!", "publishedDate": "2019-04-19", "language": "en", "rating": 5}, {"id": 667176757, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d257527-r667176757-Museu_Nacional_d_Art_de_Catalunya_MNAC-Barcelona_Catalonia.html", "text": "I made my way here after visiting the olympic village without having any idea that this jewel was perched on top of a hill with a view of Barcelona that is breathtaking.  The art of course is wonderful, especially if you're into medieval religious artwork but the best piece of art is the rooftop area that gives you one of the most beautiful views of the city.  ", "publishedDate": "2019-04-17", "language": "en", "rating": 5}, {"id": 667096786, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d257527-r667096786-Museu_Nacional_d_Art_de_Catalunya_MNAC-Barcelona_Catalonia.html", "text": "The building is so beautiful and the surroundings are mesmerizing. The view is great. I did not get to visit it because it was closed on Monday.", "publishedDate": "2019-04-16", "language": "en", "rating": 4}, {"id": 666740728, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d257527-r666740728-Museu_Nacional_d_Art_de_Catalunya_MNAC-Barcelona_Catalonia.html", "text": "I loved the building for starters. Stunning in and out. Then the collection. My favorites were the artists self portraits. Interesting perspectives. Then the art nouveau stuff was divine only-in-Europe grouping.  Its a must see for art museum lovers. ", "publishedDate": "2019-04-15", "language": "en", "rating": 5}, {"id": 665110296, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d257527-r665110296-Museu_Nacional_d_Art_de_Catalunya_MNAC-Barcelona_Catalonia.html", "text": "The Museu National d‘ Art de Catalunya is one of my favourites in Barcelona. Inside full of fantastics monuments , a great restaurant to dine with clients and friends and a breathtaking view on Barcelona", "publishedDate": "2019-04-09", "language": "en", "rating": 5}, {"id": 664951154, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d257527-r664951154-Museu_Nacional_d_Art_de_Catalunya_MNAC-Barcelona_Catalonia.html", "text": "Amazing building and situation, fountains and water features out side and views are tremendous. Inside the baroque, medieval and modern art are well worth a visit. The range of art and artists from the Catalan area was simply fantastic.", "publishedDate": "2019-04-09", "language": "en", "rating": 5}, {"id": 664376364, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d257527-r664376364-Museu_Nacional_d_Art_de_Catalunya_MNAC-Barcelona_Catalonia.html", "text": "     The museum is in the 1929 exposition building high in the hill near Montjuic Park overlooking the Magic Fountain and the city. Escalators are available if needed. Free Saturday afternoon after 3pm. About a 30 minute walk from Plaça de Catalunya: check your favorite map app for directions: shortest route is down San Anton, past inside market (pick up fruit drink if hot), to Manso, cross Ave Parallel to Ricat which curves to right after 3 blocks up gentle incline, cross de Lleida, 1 block then left Guarda Urbana, take a right and one block toward stairs to Museum).\n     The museum has three main sections (and a large central area with an ornate ceiling and large pipe organ where you may catch excellent singers, as we did): Romanesque (best in world), Gothic, Modern. The reason to go is the medieval collections: Romanesque and Gothic. You can read details elsewhere, but they are most impressive. As you walk you’ll eventually transition to the Renaissance, with commentary (audioguide available) occasionally in English on walls pointing out transitions in the art such as beginning the use of perspective and landscape. The third walkway option is toward the two modern art sections, which have selected pieces by well known artists and a fairly extensive section on resistance art in the Spanish civil war and under Franco.\n    Certainly worth 2-4 hours, and can be paired with a Thursday, Friday, or Saturday evening Magic Fountains view at 8:30PM. Lots of restaurants nearby.", "publishedDate": "2019-04-06", "language": "en", "rating": 5}, {"id": 664009619, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d257527-r664009619-Museu_Nacional_d_Art_de_Catalunya_MNAC-Barcelona_Catalonia.html", "text": "A wonderful gallery. Free to over 65s if EU citizens. \nThe Romanesque paintings, which we had thought may be boring, have been wonderfully conserved and presented. Don't miss the small video about their removal process. \nBeing allowed to take photos (no flash) is a bonus so we'll continue to enjoy many of the huge selection of paintings and sculpture to suit every taste. Could have spent an entire day here and not done it justice. \nThe restaurant was rather pricey but the cafe in the huge, beautiful central hall serves good snacks and a simple lunch menu. \nYou can go up onto the roof though I wouldn't take children. Views are amazing over the city but some parapets are fairly low.", "publishedDate": "2019-04-05", "language": "en", "rating": 5}, {"id": 662771471, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d257527-r662771471-Museu_Nacional_d_Art_de_Catalunya_MNAC-Barcelona_Catalonia.html", "text": "We arrived too late to go inside even though we had \"Articket\" passes (with the hours in smallish print ;>)). So it will be one of the reasons to return to Barcelona. I assumed it would be open at least until shortly before the Magic Fountains began (at 8:00) but it closed at 6:00. We were far from the only ones to walk up, read the hours sign, and slink off in disappointment. To be clear it was my fault for not checking more details about open hours but in a City with so much to see we saved it for the late afternoon to be nearby for the Magic Fountains later. Views were still great from up at the site and a small 'pop up' gift shop was open but if I had just researched a little more we could have went there first and then other sites like the Fort up on top later before the fountain started.", "publishedDate": "2019-04-01", "language": "en", "rating": 3}, {"id": 662728642, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d257527-r662728642-Museu_Nacional_d_Art_de_Catalunya_MNAC-Barcelona_Catalonia.html", "text": "Having visited the Prado in Madrid a week earlier, this collection compares well. The modern art collection is better. It can be something of a hike to get up here, but it keeps the crowds down, the building is amazing and is worth it for the view. This was a surpreise free bonus with the Barcelona card.", "publishedDate": "2019-04-01", "language": "en", "rating": 5}, {"id": 662706801, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d257527-r662706801-Museu_Nacional_d_Art_de_Catalunya_MNAC-Barcelona_Catalonia.html", "text": "With so many overcrowded attractions this was such a blissful quite wander through every aspect of Catalunya art. The district certainly ‘punches above its weight’ when it comes to artistic accomplishment and innovation.  ", "publishedDate": "2019-04-01", "language": "en", "rating": 5}, {"id": 662274709, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d257527-r662274709-Museu_Nacional_d_Art_de_Catalunya_MNAC-Barcelona_Catalonia.html", "text": "Great display of arts from different periods  including modern. It includes paintings, sculptures, furniture, glass and coins.\nThe meusum is free on Saturday afternoons from 3 p.m. but it is way too crowded at that time that's why I suggest using a Barcelona card to get free access to this meusum and many more of other cultural places.", "publishedDate": "2019-03-30", "language": "en", "rating": 5}, {"id": 661966054, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d257527-r661966054-Museu_Nacional_d_Art_de_Catalunya_MNAC-Barcelona_Catalonia.html", "text": "A great display of art of various genre''s.  Spent a wonderful e hours wandering around and loved every minute of it", "publishedDate": "2019-03-28", "language": "en", "rating": 5}, {"id": 661620564, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d257527-r661620564-Museu_Nacional_d_Art_de_Catalunya_MNAC-Barcelona_Catalonia.html", "text": "Another must see whilst in Barcelona.  All the attractions are easily reached by Metro, and well worth visiting.", "publishedDate": "2019-03-27", "language": "en", "rating": 5}, {"id": 661030239, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d257527-r661030239-Museu_Nacional_d_Art_de_Catalunya_MNAC-Barcelona_Catalonia.html", "text": "We enjoyed looking at the beautiful art in the Museum! We also enjoyed hanging out side in front of the museum. There are many beautiful fountains and many people just hang out outside! ", "publishedDate": "2019-03-25", "language": "en", "rating": 4}, {"id": 660883646, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d257527-r660883646-Museu_Nacional_d_Art_de_Catalunya_MNAC-Barcelona_Catalonia.html", "text": "Visited with my partner and we were both surprised by the range of material on show here. The collection is well grouped with the audio guide giving a lot of additional information.\n\nThe modern art collection on the top floor is just as large as the downstairs older works, but has much less information. The lack of information, even in the audio guide, may not be good, but as I prefer the older art this wasn't a problem.", "publishedDate": "2019-03-24", "language": "en", "rating": 5}, {"id": 660475686, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d257527-r660475686-Museu_Nacional_d_Art_de_Catalunya_MNAC-Barcelona_Catalonia.html", "text": "We spent almost two hours here. we didn't even understand majority of those art pieces. However they were beautiful. All the ceiling top looked unreal.\nAnother site worth the visit!", "publishedDate": "2019-03-23", "language": "en", "rating": 4}, {"id": 660365346, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d257527-r660365346-Museu_Nacional_d_Art_de_Catalunya_MNAC-Barcelona_Catalonia.html", "text": "Interesting collection of Catalan art dating back to the past 10 centuries.\n\nEncountered a rude female staff in the Renaissance & Baroque Art gallery - ended the visit on a sour note. Beware those who pass through 🧜‍♂️", "publishedDate": "2019-03-22", "language": "en", "rating": 4}, {"id": 660024236, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d257527-r660024236-Museu_Nacional_d_Art_de_Catalunya_MNAC-Barcelona_Catalonia.html", "text": "Varied pieces from ancient to modern.  Most unusual were the frescoes that were removed from crumbling old churches and recreated in the museum - I've never seen anything like that in a museum.", "publishedDate": "2019-03-20", "language": "en", "rating": 4}, {"id": 659669603, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d257527-r659669603-Museu_Nacional_d_Art_de_Catalunya_MNAC-Barcelona_Catalonia.html", "text": "We spent 2 hours in the museum and it was not enough. Amazing view from the roof on the Espanya Plaza. Also, world class paintings on loan from Madrid. Highly recommend.", "publishedDate": "2019-03-19", "language": "en", "rating": 5}]}}]