[{"locationId": 11930464, "name": "Dona amb angel", "placeType": "ATTRACTION", "reviewListPage": {"reviews": [{"id": 689877312, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d11930464-r689877312-Dona_amb_angel-Barcelona_Catalonia.html", "text": "The Dona amb angel is a sculpture that adorns the entranceway on the eastern side of the Placa de Catalunya, located behind the statue of Hercules, on the same pillar. This sculpture was created by Vincenc Navarro in the Art Deco style and features a woman with an angel on her left shoulder. \n\nOne of the more attractive statues in the plaza.", "publishedDate": "2019-07-15", "language": "en", "rating": 4}, {"id": 676772750, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d11930464-r676772750-Dona_amb_angel-Barcelona_Catalonia.html", "text": "Dona amb angel is the lovely bronze statue of a woman carrying the small statue of an angel. Both pieces are beautiful. They are worth a visit. And Plaza de Catalunya is a perfect spot for a walk and a bit of time to sit down and relax.", "publishedDate": "2019-05-27", "language": "en", "rating": 4}, {"id": 624955076, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d11930464-r624955076-Dona_amb_angel-Barcelona_Catalonia.html", "text": "Donna Amb Angel ( Women With Angel ) is a great work of art by Vincenc Navarro that has stood on Plaça De Catalunya since 1928,it depicts a women holding an angel and in an area of grand architecture is a lovely little sculpure that really catches the eye. \nI saw many similar statues when I visited Rome in 2017 and this splended almost art deco designed statue and monument made for some great photographic opportunities. \nIt's location in Plaça De Catalunya is superb ,its in an area with some amazing architecture, a beautiful fountain and many fine statues.\nMost definitely well worth checking out.  ", "publishedDate": "2018-10-15", "language": "en", "rating": 5}, {"id": 584031803, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d11930464-r584031803-Dona_amb_angel-Barcelona_Catalonia.html", "text": "This sculpture sits on a pedestal and is recessed in the structure behind. It depicts a near naked lady, lightly gowned below waistline, and holding a small statue of an angel in her left hand, at head height, while her right hand is steadying the statue from the rear.", "publishedDate": "2018-05-30", "language": "en", "rating": 4}, {"id": 529941655, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d11930464-r529941655-Dona_amb_angel-Barcelona_Catalonia.html", "text": "This statue is on one of the 2 columns on one of the entrances into Plaza de Catalunya.\nI really liked this plaza with the statues and fountains (Which look good at night by the way!)", "publishedDate": "2017-10-04", "language": "en", "rating": 4}, {"id": 455047808, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d11930464-r455047808-Dona_amb_angel-Barcelona_Catalonia.html", "text": "On the northeast side of Plaza de Cataluna there is an entrance surrounded by two columns.\nOn the left column there are two sculptures.\nOne of them is Dona amb angel.\nDona amb angel means Woman with angel.\nDona amb angel is a bronze sculpture made by Vincenc Navarro in 1928.", "publishedDate": "2017-01-26", "language": "en", "rating": 3}]}}]