[{"locationId": 9882566, "name": "Parque del Guinardo", "placeType": "ATTRACTION", "reviewListPage": {"reviews": [{"id": 609039601, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d9882566-r609039601-Parque_del_Guinardo-Barcelona_Catalonia.html", "text": "A rain storm cut our hike short but the views were worth all the steps we took to get there.  There was a parking lot at the base of the park so you can drive and park.  Wear good shoes because the ground and paths are uneven.", "publishedDate": "2018-08-21", "language": "en", "rating": 4}, {"id": 605697252, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d9882566-r605697252-Parque_del_Guinardo-Barcelona_Catalonia.html", "text": "I didn't see this recommended much when I was looking at things to visit in Barcelona but I would STRONGLY recommend it. It's beautiful and you get amazing views. You can easily tie this into a visit to Parc Guell too.", "publishedDate": "2018-08-12", "language": "en", "rating": 5}, {"id": 554618018, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d9882566-r554618018-Parque_del_Guinardo-Barcelona_Catalonia.html", "text": "Excellent place to walk, run or just enjoy nature. Very few people, gorgeous view of Bcn (360 degrees)", "publishedDate": "2018-01-18", "language": "en", "rating": 5}, {"id": 491033748, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d9882566-r491033748-Parque_del_Guinardo-Barcelona_Catalonia.html", "text": "This lovely park is a hidden gem, not packed with tourists unlike Parc Guell or Ciutadella and surprisingly, full of locals jogging in the early hours of the morning, families hiking and walking their dogs. We even heard a percussion ensemble, who were practicing deep in the woods, spreading tribal beats through the lush vegetation.", "publishedDate": "2017-06-06", "language": "en", "rating": 5}, {"id": 485263934, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d9882566-r485263934-Parque_del_Guinardo-Barcelona_Catalonia.html", "text": "We found this parc totally by accident on a walk to the carmen bunker, really nice place, great views and very quiet, a complete contrast to the gaudi park we visited later that day! worth a visit if you want to get away from the hustle and bustle.", "publishedDate": "2017-05-18", "language": "en", "rating": 4}, {"id": 475737283, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d9882566-r475737283-Parque_del_Guinardo-Barcelona_Catalonia.html", "text": "Want a great aerial view of Barcelona without the mounds of tourists at Parque Guell?  This park offers an excellent spot for hiking and relaxing with panoramic views of the city and very few tourists in sight.  There are various paths you can take to get to the top, and while steep, it is an easily doable hike for anyone in somewhat decent shape.  I would also suggest rambling through the hilly cobblestone streets around the base of the park; this residential area is full of beautiful buildings and is significantly quieter than the rest of the city.", "publishedDate": "2017-04-15", "language": "en", "rating": 4}, {"id": 439187272, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d9882566-r439187272-Parque_del_Guinardo-Barcelona_Catalonia.html", "text": "I ran here lots during my stay near Guinardo hospital. Lovely trails. I like hill running so this suited me and takes you off the traffic on the roads. Did a nice run between here and Park Gull too.", "publishedDate": "2016-11-21", "language": "en", "rating": 4}, {"id": 341846273, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d9882566-r341846273-Parque_del_Guinardo-Barcelona_Catalonia.html", "text": "This city park is situated on top of a hill over looking the city, WONDERFUL views. It is filled with trees and trails, and is a great place to escape the hustle and bustle of the city. There is also an old air defence bunker in the centre. \n\nA nice bonus is the municipal funiculars that run up the hill to the park along Carrer de Sales i Ferré.", "publishedDate": "2016-01-22", "language": "en", "rating": 5}]}}]