[{"locationId": 10023525, "name": "Castle of the Three Dragons", "placeType": "ATTRACTION", "reviewListPage": {"reviews": [{"id": 730865793, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d10023525-r730865793-Castle_of_the_Three_Dragons-Barcelona_Catalonia.html", "text": "Since the interior of the building was not open I can not speak to that portion. The exterior is really unusual architecturally. If you find yourself in the Parc it is worth a look.", "publishedDate": "2019-12-05", "language": "en", "rating": 4}, {"id": 723868941, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d10023525-r723868941-Castle_of_the_Three_Dragons-Barcelona_Catalonia.html", "text": "It seems as though the work on this magnificent and unique building will never be done.  But the splendid roof sculptures have been revealed and so much more.  It's a landmark.", "publishedDate": "2019-11-04", "language": "en", "rating": 4}, {"id": 722613285, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d10023525-r722613285-Castle_of_the_Three_Dragons-Barcelona_Catalonia.html", "text": "I love the name of this building Castle of the Three Dragons. A quick wiki informed me and the family that it was built between 1887-1888 as a Café-Restaurant for the 1888 Barcelona World Fair which was hosted on the site which is now the park.", "publishedDate": "2019-10-30", "language": "en", "rating": 4}, {"id": 722302048, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d10023525-r722302048-Castle_of_the_Three_Dragons-Barcelona_Catalonia.html", "text": "The Castle of the three dragons is the popular name given to the building at the entrance to the park. Built between 1887-1888 as a Café-Restaurant for the 1888 Barcelona world fair.", "publishedDate": "2019-10-29", "language": "en", "rating": 4}, {"id": 712670903, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d10023525-r712670903-Castle_of_the_Three_Dragons-Barcelona_Catalonia.html", "text": "Very nice small castle that is on the corner of the park, when we were there it was not possible to enter because some manifestation being held inside", "publishedDate": "2019-09-24", "language": "en", "rating": 4}, {"id": 690463049, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d10023525-r690463049-Castle_of_the_Three_Dragons-Barcelona_Catalonia.html", "text": "The Castell de Tres Dragons is a modernist building designed by Lluís Domènech i Montaner for the Universal Exhibition of 1888 but despite having begun its works in 1887 it was not completed for the event. Nevertheless, it's a wonderful example of this architectural style. It is located in the Parc de la Ciudadela. It appears to be in a state of refurbishment and sadly can only be seen outside.", "publishedDate": "2019-07-17", "language": "en", "rating": 4}, {"id": 672736037, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d10023525-r672736037-Castle_of_the_Three_Dragons-Barcelona_Catalonia.html", "text": "The Castle of the Three Dragons is a Modernisme building. \n\nIt was built for the 1888 Barcelona Universal Exposition to be a Café-Restaurant.\n\nFrom 1920 to 2010 it hosted the Zoology Museum of Barcelona.\n\nAt the moment the building is closed for renovations and covered.", "publishedDate": "2019-05-09", "language": "en", "rating": 3}, {"id": 667194560, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d10023525-r667194560-Castle_of_the_Three_Dragons-Barcelona_Catalonia.html", "text": "BEWARE NOT OPEN TO THE PUBLIC!!\nNOT OPEN TO PUBLIC!\n\nGoogle map keeps sending me to places and when I get there people are baffled. Arrived walked the outside and it looks like it's being remodeled or closed. I ask a worker if open or closed? Open & gave directions. Entered bldg approached desk and said I'm here to see the museum. Guard replies museum no museum, Google Maps said museum. No it's moved (see photo for address).\nTo look at the exterior of the bldg is okay. It's beautiful, would love to have one in my home state. \nIt's a governmental bldg for employees..\n", "publishedDate": "2019-04-17", "language": "en", "rating": 3}, {"id": 613894630, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d10023525-r613894630-Castle_of_the_Three_Dragons-Barcelona_Catalonia.html", "text": "The castle is located within Parc de Ciutadella, however it was closed when we visited at the end of August 2018.  It looks really nice from outside but is currently under renovation", "publishedDate": "2018-09-04", "language": "en", "rating": 3}, {"id": 585379805, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d10023525-r585379805-Castle_of_the_Three_Dragons-Barcelona_Catalonia.html", "text": "It is quite interesting to see a castle-like structure in an urban park. This building, along with the surrounding complex, was the venue of the 1888 Universal Exhibition. Unfortunately the other structures are in disrepair.", "publishedDate": "2018-06-05", "language": "en", "rating": 4}, {"id": 583553130, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d10023525-r583553130-Castle_of_the_Three_Dragons-Barcelona_Catalonia.html", "text": "This structure is on the opposite side of the park, a short stroll from the Cascada Monumental. This building dates to 1888 and started life as a cafeteria/restaurant for the Universal Exhibition. The exterior walls are mostly brick construction and the upper sections are similar to castle battlements with four towers. Another notable feature is the various coats of arms that adorn the top of the walls.", "publishedDate": "2018-05-29", "language": "en", "rating": 4}, {"id": 581044761, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d10023525-r581044761-Castle_of_the_Three_Dragons-Barcelona_Catalonia.html", "text": "Near the PArk de la Ciutadela stands this beautiful building. We only saw it from outside. They are renovating it now", "publishedDate": "2018-05-18", "language": "en", "rating": 3}, {"id": 564128870, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d10023525-r564128870-Castle_of_the_Three_Dragons-Barcelona_Catalonia.html", "text": "Unfortunately the castle structure was closed and under internal refurbishment.  Apparently it was most recently used by the zoo assumingly to hold reptiles for display, since it's called the Castle of the 3 Dragons.\n\nThe building itself is fantastic to look at from the outside anyway and the pond in front which has giant chameleons (see pic) as a fence surrounding the water is enjoyable to see. \n\nThe castle was once used as a cafe too but not for a long time now.  I guess funding is difficult and therefore progress has haulted, but it would be cool if it housed reptiles again and charged an entrance fee to see them.\n\nThe street outside lining the entry to this part of the Parc de la Ciutadella is really pretty, with deep water trough and little fountain lining the walking path (see pics).", "publishedDate": "2018-03-03", "language": "en", "rating": 4}, {"id": 558649635, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d10023525-r558649635-Castle_of_the_Three_Dragons-Barcelona_Catalonia.html", "text": "Despite its intriguing look, the building was closed shut during our second visit of it.\nThis time, it was totally closed shut, which was a shame.\nDon't miss the lovely chameleon in the nearby pond.", "publishedDate": "2018-02-05", "language": "en", "rating": 3}, {"id": 508473499, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d10023525-r508473499-Castle_of_the_Three_Dragons-Barcelona_Catalonia.html", "text": "Made for the international fair by a contemporary architect of gaudi. It is made in the modernist style and is reasonable but not amazing. If you are visiting the park it's worth a look but I would not go out of my way to visit as there aren't more impressive in Barcelona \n", "publishedDate": "2017-08-03", "language": "en", "rating": 3}, {"id": 507705053, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d10023525-r507705053-Castle_of_the_Three_Dragons-Barcelona_Catalonia.html", "text": "The castle right at the entrance of the parc de La cuitadella is one of the many more or less impressive buildings in the area. \nIn Front of the castle is a nice little lake and it is a good place to find some Rest. \nAnd due to the Name it is Fun for all Fans of Game of Thrones;)", "publishedDate": "2017-08-01", "language": "en", "rating": 5}, {"id": 482118922, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d10023525-r482118922-Castle_of_the_Three_Dragons-Barcelona_Catalonia.html", "text": "One of the cult buildings of modernists in Barcelona. Located in the city park. It is very impressive and looks like a castle from fairy tales.", "publishedDate": "2017-05-06", "language": "en", "rating": 4}, {"id": 475325217, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d10023525-r475325217-Castle_of_the_Three_Dragons-Barcelona_Catalonia.html", "text": "It was a shame that it had some covering on it, (presumably due to some repair work). This only covered part of it and it and it is a very impressive looking building that ads a lovely backdrop at the corner of this wonderful park", "publishedDate": "2017-04-13", "language": "en", "rating": 4}, {"id": 460868651, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d10023525-r460868651-Castle_of_the_Three_Dragons-Barcelona_Catalonia.html", "text": "This late 19th century building (originally built for the Exposition of Barcelona in the late 1880's) might look like a castle, but it is not, nor was it possible to visit inside it during our visit (other than to have a cup of coffee, that is).\nStill, it provides a lovely photo-op before or after visiting the Ciutadella park.", "publishedDate": "2017-02-18", "language": "en", "rating": 4}, {"id": 422816305, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d10023525-r422816305-Castle_of_the_Three_Dragons-Barcelona_Catalonia.html", "text": "A very curious building, it was built for the 1888 Universal Exhibition of Barcelona to serve as cafe-restaurant. Until recently it served as zoological museum, now undergoing restoration. It is a very inspiring architectural piece, modernist school; inspired to a fairy tale, it could be seen as the catalan Hogwarts! Worth taking a good look at when visiting the Parc de la Ciutadella.", "publishedDate": "2016-09-27", "language": "en", "rating": 4}, {"id": 399514164, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d10023525-r399514164-Castle_of_the_Three_Dragons-Barcelona_Catalonia.html", "text": "Castell de Tres Dragons was built i 1887-88 to the World Exhibition.\nIt was designed by Lluis Domenec i Montaner.\nCastell de Tres Dragons is an impressive building.\nIt is located in Ciutadella Park, where the World Exhibition had its center.", "publishedDate": "2016-07-31", "language": "en", "rating": 4}, {"id": 396108797, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d10023525-r396108797-Castle_of_the_Three_Dragons-Barcelona_Catalonia.html", "text": "This castle is inside one of the greatest free parks in Barcelona, Parc de la Ciutadella. It's nearly impossible not to be seen as it's by the main entrance at the right.\n\nThe attraction itself cannot be visited from the inside, but no one's forbidden to take great photos from the outside.", "publishedDate": "2016-07-24", "language": "en", "rating": 5}]}}]