[{"locationId": 6417067, "name": "El Born Centre de Cultura i Memoria", "placeType": "ATTRACTION", "reviewListPage": {"reviews": [{"id": 629794741, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d6417067-r629794741-El_Born_Centre_de_Cultura_i_Memoria-Barcelona_Catalonia.html", "text": "Perfect place to connect past times with your present moment for catalans. Perfect place to approach to the Cathedral of the People-Sta.Maria del Mar.", "publishedDate": "2018-10-31", "language": "en", "rating": 5}, {"id": 626642063, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d6417067-r626642063-El_Born_Centre_de_Cultura_i_Memoria-Barcelona_Catalonia.html", "text": "This historical place has been developed with a concept of history and entertainment. The site has a ramp where one can stand and look over the ruins of history. On the other hand party can be organised on the ramp which adds to the fun.", "publishedDate": "2018-10-19", "language": "en", "rating": 4}, {"id": 623031191, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d6417067-r623031191-El_Born_Centre_de_Cultura_i_Memoria-Barcelona_Catalonia.html", "text": "Excellent snap shot into the 17th century.  The exhibition is very detailed with some excellent exhibits and interesting videos.  The audio guide does a great job of bring it all to life.", "publishedDate": "2018-10-07", "language": "en", "rating": 4}, {"id": 622709819, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d6417067-r622709819-El_Born_Centre_de_Cultura_i_Memoria-Barcelona_Catalonia.html", "text": "This is a nice archaeological site, housed within a 19th former market building.\nWe enjoyed a slow-paced stroll through the archeological excavation site. It gives a very good impression of a part of the history of the city. Definitely worthwhile visiting if you're in the neighborhood. ", "publishedDate": "2018-10-06", "language": "en", "rating": 4}, {"id": 622192902, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d6417067-r622192902-El_Born_Centre_de_Cultura_i_Memoria-Barcelona_Catalonia.html", "text": "What a find!!! Stumbled across this place while lost in the alleyways of the area.\n\nCame back the following day and booked the guided tour of the 18th century remains of the area.\n\nThe guide was well worth the money and brought the area to life PLUS you get to actually walk amongst the ruins rather than view from above.\n\nWell worth the visit.  Highly recommend it.", "publishedDate": "2018-10-04", "language": "en", "rating": 5}, {"id": 613998389, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d6417067-r613998389-El_Born_Centre_de_Cultura_i_Memoria-Barcelona_Catalonia.html", "text": "A great way to learn about the history of Barcelona and life in the 1700’s in Barcelona. This archaeological site is well worth a visit. An unexpected gem in a beautiful area.", "publishedDate": "2018-09-05", "language": "en", "rating": 4}, {"id": 613678776, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d6417067-r613678776-El_Born_Centre_de_Cultura_i_Memoria-Barcelona_Catalonia.html", "text": "This is a beautiful and elaborate market building built in 1876. When preparing to convert it to a new use a few decades ago they discovered archeological remains of 1700’s-era Barcelona, from around the time of the siege of 1714. There are clear walls and bricks, and demarcations of houses and streets. The site takes up much of the interior of the large building. It is an impressive site that is well preserved, well presented and open to the public for free. \n\nThere are quite a few signs around the dig site in Spanish, Catalan and English. They provide a lot of context of Catalonia before and after the War of Spanish Succession. The archeological remains are fascinating and the whole experience provides much information about the history of Catalonia. Central location in La Ribera makes it easily accessible. Well worth visiting. ", "publishedDate": "2018-09-03", "language": "en", "rating": 4}, {"id": 612918412, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d6417067-r612918412-El_Born_Centre_de_Cultura_i_Memoria-Barcelona_Catalonia.html", "text": "Found this attraction completely by accident when out walking.  A Beautiful example of architecture covering an amazing archaeological dig inside, and even better - it is FREE!\n\nThere are sideline exhibitions inside that you have to pay for, but you can lose a lot of time wandering around marveling at the dig below your feet", "publishedDate": "2018-09-01", "language": "en", "rating": 5}, {"id": 603963011, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d6417067-r603963011-El_Born_Centre_de_Cultura_i_Memoria-Barcelona_Catalonia.html", "text": "This was an old market hall and best of all made of cast iron. It is a stunning building and so brilliantly restored. The castings should be carefully studied as the workmanship is wonderful. When the market became disused it became an archaelogical site and what a site. I am not sure I have ever seen anything quite so extensive. The presentataions are brilliant explaining in 3 languages what went on and what you are looking at. This place is splendid and the archaeologists etc should be complemented on doing such a superb job    It is FREE", "publishedDate": "2018-08-07", "language": "en", "rating": 5}, {"id": 601787017, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d6417067-r601787017-El_Born_Centre_de_Cultura_i_Memoria-Barcelona_Catalonia.html", "text": "Beautiful building, inside it has  restaurants and shops but also interesting excavations of the old El Born. Very interesting history. Nice to stay here for a wile. Very quiet. ", "publishedDate": "2018-08-01", "language": "en", "rating": 5}, {"id": 598653008, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d6417067-r598653008-El_Born_Centre_de_Cultura_i_Memoria-Barcelona_Catalonia.html", "text": "If you're nearby, it's worth a quick stop in this beautiful building. There are quite a few signs that explain the significance of the ruins (in English, Spanish, and Catalan), and the airy, quiet, shaded space is nice on a hot day of touring.\nFor a fee, there are also tours available and exhibition rooms.", "publishedDate": "2018-07-22", "language": "en", "rating": 4}, {"id": 589904897, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d6417067-r589904897-El_Born_Centre_de_Cultura_i_Memoria-Barcelona_Catalonia.html", "text": "History and politics - not easy to keep them apart when visiting this place that was hidden for so long after the defeat of Barcelona. A guide is needed - but very much worth it. Just eat afterwards (or before) in the annex restaurant!", "publishedDate": "2018-06-23", "language": "en", "rating": 5}, {"id": 585378175, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d6417067-r585378175-El_Born_Centre_de_Cultura_i_Memoria-Barcelona_Catalonia.html", "text": "We came on a Monday and thus did not have the chance to enter this museum. However the impressive facade of this former market already worth a visit. It is a very pleasant stroll from Basilica de Santa Maria del Mar.", "publishedDate": "2018-06-05", "language": "en", "rating": 5}, {"id": 584553434, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d6417067-r584553434-El_Born_Centre_de_Cultura_i_Memoria-Barcelona_Catalonia.html", "text": "Decent archaeological site and entry was free. Within the building there is also a restaurant and toilets so a good place for a stop.", "publishedDate": "2018-06-02", "language": "en", "rating": 4}, {"id": 581038498, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d6417067-r581038498-El_Born_Centre_de_Cultura_i_Memoria-Barcelona_Catalonia.html", "text": "We tumbles across this place by accident. This is a cultural center, with archeological remains of Barcelona from the 17th century/. Entrance is free, clean toilets. The staff doesn't speak good English", "publishedDate": "2018-05-18", "language": "en", "rating": 3}, {"id": 579983261, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d6417067-r579983261-El_Born_Centre_de_Cultura_i_Memoria-Barcelona_Catalonia.html", "text": "El Born was built as a market hall in the second half of the 18th century.\nThe typical structure consisted of stone, steel and glass amd is an wonderful example for the architecture during this area.\nAfter the recent restauration, the market hall was transformed into an exhibition and memorial center.\nPreserved archaeological remains from 1700 of the district of Vilanova de Mar are exhibited in the hall,\nEntrance is free.", "publishedDate": "2018-05-13", "language": "en", "rating": 5}, {"id": 577284407, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d6417067-r577284407-El_Born_Centre_de_Cultura_i_Memoria-Barcelona_Catalonia.html", "text": "It was surprising place to visit. It was just on the way from Ciutadelle park to the city center. Exhibition is free of charge and reminds something of ancient Rome. It was great to look at the history of Barcelona from that angle", "publishedDate": "2018-05-01", "language": "en", "rating": 5}, {"id": 576476570, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d6417067-r576476570-El_Born_Centre_de_Cultura_i_Memoria-Barcelona_Catalonia.html", "text": "As we had rented a apartment for a week across the road from the Centre de Cultura we we’re querulous an went in. So glad we did the ruins were so interesting an the history also. From the 1700 the beginning of the Catalan culture. There are different types of tours you can take with different budgets. So worth it. ", "publishedDate": "2018-04-29", "language": "en", "rating": 5}, {"id": 575002678, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d6417067-r575002678-El_Born_Centre_de_Cultura_i_Memoria-Barcelona_Catalonia.html", "text": "It's been several years that I visit Barcelona, and passing in front of this place but it was always closed. I finally could get in and it was interesting to see the ruins. Recommended.", "publishedDate": "2018-04-22", "language": "en", "rating": 4}, {"id": 573816475, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d6417067-r573816475-El_Born_Centre_de_Cultura_i_Memoria-Barcelona_Catalonia.html", "text": "This place is supposedly a 1.714 battle museum  , but it is actually a separatist propaganda center devoted to cheat tourists about this piece of Barcelona's history.", "publishedDate": "2018-04-16", "language": "en", "rating": 1}, {"id": 572192250, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d6417067-r572192250-El_Born_Centre_de_Cultura_i_Memoria-Barcelona_Catalonia.html", "text": "Did a quick walk around the site. Very interesting to see the ruins from the 1700’s within the busy and active centre of El Born. Barcelona is a city filled with so many amazing historical sites and breathtaking architecture. Everywhere you go is an adventure and a journey into the past. ", "publishedDate": "2018-04-09", "language": "en", "rating": 4}, {"id": 571830489, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d6417067-r571830489-El_Born_Centre_de_Cultura_i_Memoria-Barcelona_Catalonia.html", "text": "Wanted to go on the tour but found out that they don't do tours during the day, but only started at 4.30pm. This is because they are busy with school group visits. So we looked at the Montserrat Roig exhibition which was free, and then returned in the afternoon for the guided tour of the archaeological site.  It wasn't busy in the afternoon and the tour was interesting, \n\nYou can't take rucksacks throughout the site so there are plenty of lockers, which takes 1euro but you do get it back once key returned.", "publishedDate": "2018-04-08", "language": "en", "rating": 4}, {"id": 559589158, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d6417067-r559589158-El_Born_Centre_de_Cultura_i_Memoria-Barcelona_Catalonia.html", "text": "This is a lovely archaeological site, housed within a modern building, which allows everyone to enjoy the dig in all weather and keep the site itself safe.\nWe literally passed through the site going back to our hotel, but enjoyed a slow-paced stroll through it, nonetheless.", "publishedDate": "2018-02-10", "language": "en", "rating": 4}, {"id": 558888821, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d6417067-r558888821-El_Born_Centre_de_Cultura_i_Memoria-Barcelona_Catalonia.html", "text": "To enter the archeological site you don’t have to pay, it’s free. It’s nice to see what they found but it isn’t exceptional.", "publishedDate": "2018-02-06", "language": "en", "rating": 3}, {"id": 558139403, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d6417067-r558139403-El_Born_Centre_de_Cultura_i_Memoria-Barcelona_Catalonia.html", "text": "Nicely preserved ruins of old Barcelona inside stylish iron and glass construction. Everything with description so you know the function of the building and the entrance is for free!", "publishedDate": "2018-02-03", "language": "en", "rating": 4}, {"id": 548634987, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d6417067-r548634987-El_Born_Centre_de_Cultura_i_Memoria-Barcelona_Catalonia.html", "text": "We had a free day on the last day of our trip. Wanted to do something more casual, visited the centre and had a nice look at the ruins and a simple history of Barcelona and the development of the market place. Good place to then start a walk towards the port area.  Centre staff were helpful and spoke good English.  The English speaking guided tour is at 4.30pm. Great choice of tapas places round the centre.  Picasso museum nearby and good range of eclectic shops, definitely a great place to wander.", "publishedDate": "2017-12-22", "language": "en", "rating": 4}, {"id": 544013611, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d6417067-r544013611-El_Born_Centre_de_Cultura_i_Memoria-Barcelona_Catalonia.html", "text": "A great place with a lot of history that we stumbled upon by chance. The building fully covers the ruins of the 17th century city destroyed by the war. It's free to enter and provides lots of information. Suitable for the disabled and buggies and toilet facilities are available.", "publishedDate": "2017-11-29", "language": "en", "rating": 5}, {"id": 543787405, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d6417067-r543787405-El_Born_Centre_de_Cultura_i_Memoria-Barcelona_Catalonia.html", "text": "Great archeological dig in the city plus a story about the market that used to be here when Barcelona was smaller.", "publishedDate": "2017-11-28", "language": "en", "rating": 4}, {"id": 541801971, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d6417067-r541801971-El_Born_Centre_de_Cultura_i_Memoria-Barcelona_Catalonia.html", "text": "We walked here and enjoyed seeing the excavation of ruins.  \nFor history buffs, there are displays explaining what you are seeing. The space is bright, clean and has a good information booth.  There are benches for resting and regrouping for your next venture.  A restaurant is attached as well as a bookstore \nWorth the visit. ", "publishedDate": "2017-11-18", "language": "en", "rating": 5}, {"id": 540690574, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d6417067-r540690574-El_Born_Centre_de_Cultura_i_Memoria-Barcelona_Catalonia.html", "text": "It seems not necesary to do it, but I strongly recommend you to go directly there and book a visit (less than an hour). You'll discover a part off the city that was erased by political reasons 300 years ago. If you thinks that only viewing it from above, you're totally wrong", "publishedDate": "2017-11-13", "language": "en", "rating": 4}, {"id": 537297825, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d6417067-r537297825-El_Born_Centre_de_Cultura_i_Memoria-Barcelona_Catalonia.html", "text": "Museum and cultural centre. Situated in Barcelona's older part of the city.\nFormerly a food market built in the late 1880's, archaeological remains were later found under the markets dating back to the 1700's.\nThese ruins are on permanent display within the old market building. The museum is also worth a visit and audio guides are available at a minimum cost.\nWell worth a visit.", "publishedDate": "2017-10-30", "language": "en", "rating": 4}, {"id": 534701502, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d6417067-r534701502-El_Born_Centre_de_Cultura_i_Memoria-Barcelona_Catalonia.html", "text": "This is a beautifully and very expensively restored old market which is free to visit. In fact it contains the excavated ruins of the underlying 1700s village which you can examine from above. There are some displays giving information, a large number of ceramic artefacts and a cafe. The attraction however is in the scale of the steel framework restoration. I don’t know who funded it but it appears that the space is being marketed for exhibitions. If you are in the area it is worth dropping in for 20-30 minutes especially as there is no entrance charge. ", "publishedDate": "2017-10-20", "language": "en", "rating": 4}, {"id": 534552229, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d6417067-r534552229-El_Born_Centre_de_Cultura_i_Memoria-Barcelona_Catalonia.html", "text": "Came here with friends and was very coloring this historic area. Wonderful exhibit if the home story if the market over more than three centuries. Noticed a some older  children having lectures here as well.  A great spot to visit", "publishedDate": "2017-10-20", "language": "en", "rating": 5}, {"id": 527635071, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d6417067-r527635071-El_Born_Centre_de_Cultura_i_Memoria-Barcelona_Catalonia.html", "text": "I love it! We just happened to walk past this building and was wowed by the fact El Born used to be an old derelict market place in Barcelona. It’s free to pop in and it’s lovely to wonder around reading information about the 300 year old excavated town beneath the marketplace. And there are beautiful old images from the 20th century right up to the 70s of the market place.\n\nEl Born has plenty of natural light. It’s quiet to visit during the weekday. There are stylish and hip restaurants and cafes to eat if you’re hungry. \n\nI would highly recommend it for those who love old towns and ruins :)\n\nMore fun travel stories on\nInstagram - @hellomissmay\nBlog - Hellomissmay.com\n\n", "publishedDate": "2017-09-26", "language": "en", "rating": 5}, {"id": 526648261, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d6417067-r526648261-El_Born_Centre_de_Cultura_i_Memoria-Barcelona_Catalonia.html", "text": "This big market hall often has good exhibits and is located in a beautiful and interesting neighborhood.  Worth a short visit.", "publishedDate": "2017-09-22", "language": "en", "rating": 4}, {"id": 523414708, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d6417067-r523414708-El_Born_Centre_de_Cultura_i_Memoria-Barcelona_Catalonia.html", "text": "Interesting excavation site but not really that impressive when you compare it to the many other options across Europe. There are far better options of how to spend time in Barcelona", "publishedDate": "2017-09-11", "language": "en", "rating": 2}, {"id": 521819867, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d6417067-r521819867-El_Born_Centre_de_Cultura_i_Memoria-Barcelona_Catalonia.html", "text": "It's also a cool place to be in the heat of summer, away from all the hipsters!\nDon't bother buying a ticket. I've now visited four years running and enjoyed discovering new findings each time.\nThis huge former market place was being renovated, when 300 years of history was uncovered, recorded and left for us to see. It's still being opened up. As you walk round the gallery, descriptions are posted, explaining and commenting on the uncovered buildings, passageways and even the stream which ran through here. Decent café, bar and shop, too. Oh, even very good loos!", "publishedDate": "2017-09-06", "language": "en", "rating": 5}, {"id": 518140218, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d6417067-r518140218-El_Born_Centre_de_Cultura_i_Memoria-Barcelona_Catalonia.html", "text": "I wouldn't go out of my way, but if you are in the area, it's worth spending a few minutes in this building. The place is huge and gives you a glimpse of what Barcelona looked like back in the day. There's a souvenir shop/bookstore, as well as a restaurant within the building. ", "publishedDate": "2017-08-27", "language": "en", "rating": 4}, {"id": 516033948, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d6417067-r516033948-El_Born_Centre_de_Cultura_i_Memoria-Barcelona_Catalonia.html", "text": "My friend and I visited for free with the Barcelona Card. It is a beautiful structure where the ground inside have been excavated to reveal Barcelona 's old residential area. The building was originally a market place. I would recommend the audio guides as they gave us plenty of information around the museum. However, if you do want an audio guide make sure you have your ID (passport/driving license) as they will exchange that for a guide. It was secure and the staff were very friendly. Better to visit in the morning/midday as it can get busy.", "publishedDate": "2017-08-21", "language": "en", "rating": 5}, {"id": 512225370, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d6417067-r512225370-El_Born_Centre_de_Cultura_i_Memoria-Barcelona_Catalonia.html", "text": "Our hotel was just round the corner from this former market place, which has been very well restored and established as a cultural centre. The middle of the building is taken up with archeological findings of the old streets that were demolished to make way for the citadel which was built following the surrender of Barcelona. Boards in several languages explain the history of Catalonia and of Barcelona - I learnt so much in the short time I was there. The centre sensitively pays homage to the original merchant hall, which was saved from demolition in the 1970s at the wish of the local people. There is a restaurant in the centre which offers a five star breakfast, lunch or dinner - our first taste of true Catalan food. The centre is free to enter and open until 8pm, although the restaurant is open until late. Recommended!", "publishedDate": "2017-08-13", "language": "en", "rating": 5}, {"id": 506668025, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d6417067-r506668025-El_Born_Centre_de_Cultura_i_Memoria-Barcelona_Catalonia.html", "text": "An old commercial market that has been transformed in to an amazing exhibition of old Barcelona. It is also the home of a live archeological dig, which was facsinating to observe from this brilliant bhuilding. Why dont more peopple visitv this amazing site!", "publishedDate": "2017-07-28", "language": "en", "rating": 5}, {"id": 506005220, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d6417067-r506005220-El_Born_Centre_de_Cultura_i_Memoria-Barcelona_Catalonia.html", "text": "This imposing building holds many surprises.  The building was built over the area where people held their markets many years ago and when built it was one of the 'new' wonders of iron and glass.  The market finished operating 1878 and is the largest covered square in Europe (?)  It was restored in 1981 and in 2002 while excavation work was being done to convert it into a library a medieval city ruins were found underneath!  Hours can be spent here exploring the different areas and learning about the history.", "publishedDate": "2017-07-26", "language": "en", "rating": 5}, {"id": 497870588, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d6417067-r497870588-El_Born_Centre_de_Cultura_i_Memoria-Barcelona_Catalonia.html", "text": "Well presented free exhibition. Gives a real flavour of the Born area of Barcelona's history. Just fascinating, especially, if like us, you don't know much about the local history.  Well worth a visit.", "publishedDate": "2017-07-02", "language": "en", "rating": 4}, {"id": 495822739, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d6417067-r495822739-El_Born_Centre_de_Cultura_i_Memoria-Barcelona_Catalonia.html", "text": "This old market building is a great place to stop on a hot day and the archeological exhibition is really interesting. Great free attraction.  Nice looking restaurant inside.  Lovely clean toilets. ", "publishedDate": "2017-06-25", "language": "en", "rating": 4}, {"id": 495083610, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d6417067-r495083610-El_Born_Centre_de_Cultura_i_Memoria-Barcelona_Catalonia.html", "text": "We visited this museum in 2016 during our trip to Barcelona.  The old market place was destined for an upgrade into a Library precinct but during the initial reconstruction stage it was found to be an historic feature dating back to the 1700's when they unearthed evidence of building foundations.  It is now controlled by the archaeological society as they continue with excavations and new findings of habitation of Old Barcelona in the 17th century.  Well worth seeing during a visit to Barcelona a city steeped in history where some areas reference back to Roman influences.", "publishedDate": "2017-06-22", "language": "en", "rating": 5}, {"id": 490139842, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d6417067-r490139842-El_Born_Centre_de_Cultura_i_Memoria-Barcelona_Catalonia.html", "text": "I have to say that the place is really nice, but don't take guide service. My guide explained some version of the of the Austrian Succession, that did not match with reallity ( I'm Doctor in History). They are using an european succesion war to explain the defeat of Catalan rights. Was very strange politicized version for tourists. Anyway the place is really nice. ", "publishedDate": "2017-06-03", "language": "en", "rating": 2}, {"id": 489931382, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d6417067-r489931382-El_Born_Centre_de_Cultura_i_Memoria-Barcelona_Catalonia.html", "text": "I love history and finding out about what places used to be like! I'm also the person who reads every piece of information and then regurgitates the facts at a later date. So for me this was a lovely visit. Not so much for my husband and teenage kids who whizzed round looked at the archeological dig and then sat on a bench and waited for me to finish! I found it fascinating seeing what had been uncovered and finding out about the water way which used to run through the city and the way in which different trades built up around certain areas and streets. It's free to go in, the building itself is nice to look at and the uncovered old town on display below ground level is worth a look even if history is not your thing. If like me you love the history, there's lots to learn here and you could be here some time!!", "publishedDate": "2017-06-02", "language": "en", "rating": 4}, {"id": 488990727, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d6417067-r488990727-El_Born_Centre_de_Cultura_i_Memoria-Barcelona_Catalonia.html", "text": "Closed on mondays, I returned on Tuesday bc I thought there were cute shops inside. Shopping in Barcelona is so frustrating bc it's not really clear when independent stores are open and when they are closed, they pull down metal covers so you can't even window shop so I was excited to bring back some cool treasures that represented the creativity of Barcelona. Well, this place has no shopping. It's an exhibition space with relics and some avant-garde places that you need to buy tickets\n\nSave your time for the Picasso museum which is beyond. ", "publishedDate": "2017-05-30", "language": "en", "rating": 3}, {"id": 488227472, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d6417067-r488227472-El_Born_Centre_de_Cultura_i_Memoria-Barcelona_Catalonia.html", "text": "Very well laid out exhibition of the excavated 18th century houses, uncovered during the proposed redevelopment of the old market hall. A couple of other exhibitions, a large restaurant and it's all under cover, perfect to get into the shade or out of the rain..recommended.", "publishedDate": "2017-05-27", "language": "en", "rating": 5}, {"id": 487709138, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d6417067-r487709138-El_Born_Centre_de_Cultura_i_Memoria-Barcelona_Catalonia.html", "text": "The complementary museum offers an insight into centuries back in Barcelona.  There are signs and information about the history with the option of renting ear sets to hear more history about the site.  There are also other areas of the museum accessible for patrons who purchase tickets.\n\nThe visit is worthwhile whether the visit is quick or extended.", "publishedDate": "2017-05-25", "language": "en", "rating": 4}, {"id": 484660554, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d6417067-r484660554-El_Born_Centre_de_Cultura_i_Memoria-Barcelona_Catalonia.html", "text": "A free archaeological site that you can tour in about an hour. There are about 20 placards that you can read to learn about the history of El Borne, the war of Secession of Catalonia, the siege of Barcelona and the growth of the city since 1714.", "publishedDate": "2017-05-16", "language": "en", "rating": 4}, {"id": 483699904, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d6417067-r483699904-El_Born_Centre_de_Cultura_i_Memoria-Barcelona_Catalonia.html", "text": "I really enjoyed my visit here. You have to pay €7 to be able to access the exhibits. It comes with an audio guide. The history of El Born, especially, gave me more insight as to Barcelona's past compared to the other touristy activities I've had. I mean, I've done the Turistic bus tour but I didn't hear much about why the ciutadella was built and unbuilt, what happened to El\nBorn market, etc.\n\nThere's also a bookshop and a cafe inside the building.", "publishedDate": "2017-05-12", "language": "en", "rating": 4}, {"id": 482894308, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d6417067-r482894308-El_Born_Centre_de_Cultura_i_Memoria-Barcelona_Catalonia.html", "text": "The harsh reality is it won't be for anyone with a short attention span but for those with an interest in history and archaeology then it a must.  \n\nI did the free side of the museum only so it is largely a series of small walls, but you get a real sense of the history complete with informative descriptions (although you get the feeling a little bit of poetic licence may have been used).  \n\nThe view is unobscured and very photogenic and well worth the trip, it was also surprising quiet when I went so I was able to meander around at my own pace in a very pleasant and hassle free environment.", "publishedDate": "2017-05-09", "language": "en", "rating": 4}, {"id": 479790262, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d6417067-r479790262-El_Born_Centre_de_Cultura_i_Memoria-Barcelona_Catalonia.html", "text": "The old El Born Market building has been repurposed to display the history of the city.  Interesting displays and archaeological site.", "publishedDate": "2017-04-28", "language": "en", "rating": 4}, {"id": 476609094, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d6417067-r476609094-El_Born_Centre_de_Cultura_i_Memoria-Barcelona_Catalonia.html", "text": "A must visit for those who loved historical sites. The Spaniard had done a great job in restoring this site found in 1993 & opened in 2013 for the benefits of future generations.", "publishedDate": "2017-04-17", "language": "en", "rating": 5}, {"id": 475333533, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d6417067-r475333533-El_Born_Centre_de_Cultura_i_Memoria-Barcelona_Catalonia.html", "text": "What a surprising find! The building contained the remains of the lower levels of many homes that are of a similar size and layout to those in the alley ways outside, but what struck me was that after 1714 the homeowners were required to demolish their houses themselves to build a fort! The structure we see covering the remains was at risk of demolision itself but was saved by being suggested as a library. Amazingly the work to create the library unearthed the remains and the plan for the library were cancelled and it ended up as it is !!!! Wow!", "publishedDate": "2017-04-13", "language": "en", "rating": 5}, {"id": 472325905, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d6417067-r472325905-El_Born_Centre_de_Cultura_i_Memoria-Barcelona_Catalonia.html", "text": "There were a couple of exhibitions within in the Centre which were free, but when I tried to enter, the staff at the barrier told me I had to go back to the entrance and get a free ticket. The staff didn't appear that friendly and I didn't want to go back to the entrance so I gave up and left. There were not many visitors within the Centre.", "publishedDate": "2017-04-03", "language": "en", "rating": 2}, {"id": 470994306, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d6417067-r470994306-El_Born_Centre_de_Cultura_i_Memoria-Barcelona_Catalonia.html", "text": "I strolled into El Born Cultural Centre after going to the market with my 18 yr old daughter, expecting nothing really. What a surprise to see such a site--we spent an hour taking it in. ", "publishedDate": "2017-03-28", "language": "en", "rating": 4}, {"id": 470353926, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d6417067-r470353926-El_Born_Centre_de_Cultura_i_Memoria-Barcelona_Catalonia.html", "text": "We were lucky, as we toured the building there was great piano music playing.  Live music always improves an experience, and this was no exception.  We looked round the market museum and got a free orange.  We had a beer in the cafe.  All good, but the piano music made it.", "publishedDate": "2017-03-26", "language": "en", "rating": 4}, {"id": 469629904, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d6417067-r469629904-El_Born_Centre_de_Cultura_i_Memoria-Barcelona_Catalonia.html", "text": "Came across this by accident, interesting excavations and notes about the city's past,  some shops, cafe and museum.", "publishedDate": "2017-03-23", "language": "en", "rating": 3}, {"id": 468465832, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d6417067-r468465832-El_Born_Centre_de_Cultura_i_Memoria-Barcelona_Catalonia.html", "text": "It's free, but it's average. There is an archaeological site there, but that's really it. The Borne CCM did not grab my attention at all.", "publishedDate": "2017-03-19", "language": "en", "rating": 3}, {"id": 467359590, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d6417067-r467359590-El_Born_Centre_de_Cultura_i_Memoria-Barcelona_Catalonia.html", "text": "This excavation of 18th century Barcelona is beautifully done.  We thoroughly enjoyed walking around the exhibit, which is done in three languages.  We did not have time to do the attached museum, but we think it would have been nice.  We spent about an hour at this exhibit (including a few minutes in the store), and everything about it was first-class - including very clean restrooms!", "publishedDate": "2017-03-14", "language": "en", "rating": 5}, {"id": 462875414, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d6417067-r462875414-El_Born_Centre_de_Cultura_i_Memoria-Barcelona_Catalonia.html", "text": "Originally opened as a market, the El Born centre has been fully restores and transformed into a museum and cultural centre.\nIt is free to get in to the main hall. The permanent exhibition (which is fascinating) is well worth a visit and is free on a Sunday afternoon.\nWalkways take you above the excavated remains of 18th Century Barcelona (with excellent info/interpretation boards). \nThere is a shop and a cafe/bar on site (excellent cold beer).\nWe had visited it on Saturday night as part of the Barcelona Lights Festival and the two installations were stunning.\nWell worth a visit.", "publishedDate": "2017-02-26", "language": "en", "rating": 5}, {"id": 460866816, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d6417067-r460866816-El_Born_Centre_de_Cultura_i_Memoria-Barcelona_Catalonia.html", "text": "Despite the somehow misleading name, this is, in fact, an archaeological site.\nSome of the digs regions on the site were covered while we were there (probably due to the fact there was still an ongoing excavation there), but the entire place was nice for a 10-minute visit.", "publishedDate": "2017-02-18", "language": "en", "rating": 3}, {"id": 460609532, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d6417067-r460609532-El_Born_Centre_de_Cultura_i_Memoria-Barcelona_Catalonia.html", "text": "If you are in El Born District pop your head inside and have a look, it's free. You get to see an archeaological dig site of old Barcelona\nWe were lucky enough to be in Barcelona during the Feste de Santa Eulalia and the centre was used for 6 light installations for the Llum 2017 festival, so we saw it in a whole different light. The medieval dig area as illuminated to music, there were dancing cranes with lazers and so much more. The imposing industrial building really came to life, but it's worth 30 minutes of your time on an average day in El Born.", "publishedDate": "2017-02-17", "language": "en", "rating": 4}, {"id": 460469384, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d6417067-r460469384-El_Born_Centre_de_Cultura_i_Memoria-Barcelona_Catalonia.html", "text": "Don't let the name fool you: this isn't another public market - it hasn't been since the early 1970s. What makes the Mercat del Born awesome is precisely the archaeological findings they made when the city tried to demolish it in the past.", "publishedDate": "2017-02-16", "language": "en", "rating": 5}, {"id": 460361144, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d6417067-r460361144-El_Born_Centre_de_Cultura_i_Memoria-Barcelona_Catalonia.html", "text": "Wandering the streets of El Born you're likely to stumble across this old covered market building.  What you may not realize is that it houses a recent archeological dig site that was discovered in the 1990's when new work was to be done on the location.  Entering, for free, you get to experience what the dig site looks like and read a multitude of informative displays about the history and fall of the Catalonian people at the hands of the Bourbons in 1714.  There are some exhibits and tours you can pay for, but at least stop in for 30 minutes to gain a greater appreciation for the history of the area and Catalonia. ", "publishedDate": "2017-02-16", "language": "en", "rating": 5}, {"id": 455296180, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d6417067-r455296180-El_Born_Centre_de_Cultura_i_Memoria-Barcelona_Catalonia.html", "text": "My wife & I were exploring the area when we stumbled across this building. It didn't attract us to go inside though as it looked deserted and empty. There were also no signs or directions to point you inside or show what they were displaying, so we moved on quite quickly to our next stop.", "publishedDate": "2017-01-27", "language": "en", "rating": 3}, {"id": 448049476, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d6417067-r448049476-El_Born_Centre_de_Cultura_i_Memoria-Barcelona_Catalonia.html", "text": "Like many others, stumbled upon this amazing museum whilst wandering around the Barrio Gotico. A fascinating and humbling introduction to the history of Catalunya, impressively laid out. Recommended for those with an interest in learning about insights into the Catalan character and mindset.", "publishedDate": "2016-12-31", "language": "en", "rating": 5}, {"id": 447126375, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d6417067-r447126375-El_Born_Centre_de_Cultura_i_Memoria-Barcelona_Catalonia.html", "text": "War, blood, torture. Moving depictions of the brutal treat ent of the poor Catalans not least during rather recent history. ", "publishedDate": "2016-12-28", "language": "en", "rating": 3}, {"id": 446637278, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d6417067-r446637278-El_Born_Centre_de_Cultura_i_Memoria-Barcelona_Catalonia.html", "text": "Stumbled upon this while out exploring and had not read about it in any of the guides. Defiantly worth a visit for History buffs and with Kids.   Easy to find once you know it exists and you get a sense of Old Barcelona.", "publishedDate": "2016-12-25", "language": "en", "rating": 5}, {"id": 446091651, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d6417067-r446091651-El_Born_Centre_de_Cultura_i_Memoria-Barcelona_Catalonia.html", "text": "Free entry to see old foundations before the Spanish succession War. Definitely worth a visit to understand the Catalan history. Took about  30-45mins to walk the ground. You can certainly sense the catalan pride at this place. ", "publishedDate": "2016-12-22", "language": "en", "rating": 4}, {"id": 443321419, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d6417067-r443321419-El_Born_Centre_de_Cultura_i_Memoria-Barcelona_Catalonia.html", "text": "There are so many things to do and places to see in Barcelona, but El Born cultural center should be on your list. The building itself is beautiful - originally intended to be a market - and the archeological digs inside are fascinating..  showing early Barcelona. This is a great rainy day free activity for the whole family (on the rare rainy day).", "publishedDate": "2016-12-10", "language": "en", "rating": 5}, {"id": 438165397, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d6417067-r438165397-El_Born_Centre_de_Cultura_i_Memoria-Barcelona_Catalonia.html", "text": "First of all, the building is worth seeing.  It is the former 19th century cast-iron covered marketplace used until 1971.  Be prepared for a treasure trove of artifacts including the remains  of buildings from a very hard time in Barcelona history: when Barcelona fell to the Bourbon troops, and the area was demolished.  It is possible to either look at the ruins from above or take a walk-through tour of the remains of the buildings.  Extensive records were found among the ruins, and the permanent exhibition shows what day to day life was like in Barcelona.  The ruins are so well maintained, and the exhibition is first rate. A great way to introduce children to archeology.", "publishedDate": "2016-11-17", "language": "en", "rating": 5}, {"id": 436911110, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d6417067-r436911110-El_Born_Centre_de_Cultura_i_Memoria-Barcelona_Catalonia.html", "text": "A genial double history solution. The hall it self was build in 1876 as a market place with the French halls as inspiration. The architecture using Cast Iron and glass was introduced by the build of Covent Garden in 1854.\nThe hall was not used anymore and was planned to be the residence of a university library. During this preparation a part of the city ruins was excavated. The leftovers was a part of the city which was demolished by the bourbons, but carried out by the owners then selves.\nThe exhibition is unique, and a must-see event. ", "publishedDate": "2016-11-13", "language": "en", "rating": 5}, {"id": 435109931, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d6417067-r435109931-El_Born_Centre_de_Cultura_i_Memoria-Barcelona_Catalonia.html", "text": "Here you can learn about the history of Catalunia and the relationship with Spain so you can understand why the want independence", "publishedDate": "2016-11-06", "language": "en", "rating": 4}, {"id": 432166483, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d6417067-r432166483-El_Born_Centre_de_Cultura_i_Memoria-Barcelona_Catalonia.html", "text": "Beautifully presented remains of Barcelona from the early 1700s discovered during renovation of the old iron and glass 1900s market building. Raised walkways allow you to look down on the archeological dig area and signboards give you info and explanation in English as well as Spanish and Catalan. Free to enter this central area, paying entry to temporary exhibitions in surrounding rooms. Nice surrounding square with open spaces and tempting cafes.", "publishedDate": "2016-10-27", "language": "en", "rating": 5}, {"id": 431451412, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d6417067-r431451412-El_Born_Centre_de_Cultura_i_Memoria-Barcelona_Catalonia.html", "text": "While my sisters trooped off to the queues at the cathedral I explored this little gem, which was just behind our hotel. It's located in an old covered market and doesn't look much from the outside, but inside is a really well laid out archaeological view of Barcelona back to ancient times. The story of the area is really well told and interesting. There are a number of artefacts in glass cases, again not the British Museum but some really high quality exhibits and enough to tell a story. Over and above the fact that this is really well presented and fascinating, this little museum should serve as a model for what all other local museums should be. Well worth a visit, IMO.", "publishedDate": "2016-10-25", "language": "en", "rating": 4}, {"id": 429674662, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d6417067-r429674662-El_Born_Centre_de_Cultura_i_Memoria-Barcelona_Catalonia.html", "text": "Inside the building you can find ruins of old Barcelona which is buried under El Born and Gothic. Entrance is free. There are also some temporal exhibitions (not necessary free ones). ", "publishedDate": "2016-10-19", "language": "en", "rating": 4}, {"id": 429543609, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d6417067-r429543609-El_Born_Centre_de_Cultura_i_Memoria-Barcelona_Catalonia.html", "text": "No so far under your feet, lies ruins of streets and houses. It's visually great to see a large piece of the old Barcelona in the old city centre.\nThe entire area was simply destroyed following and expropriation of the entire neighbourhood for military reason 250 years ago.\nArchives of the city can identify each houses, roles and owners.\nA blast for the past !", "publishedDate": "2016-10-18", "language": "en", "rating": 5}]}}]