[{"locationId": 240504, "name": "Desconsol", "placeType": "ATTRACTION", "reviewListPage": {"reviews": [{"id": 727371241, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d240504-r727371241-Desconsol-Barcelona_Catalonia.html", "text": "I saw this while running through the park one morning. There are several other statues in the park as well, but I would say this is the main one.", "publishedDate": "2019-11-18", "language": "en", "rating": 4}, {"id": 722350591, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d240504-r722350591-Desconsol-Barcelona_Catalonia.html", "text": "Strolling through the park we happened upon this after visiting the Catalonian Parliament building. The sculpture is just lovely. Spend a while taking in the form.", "publishedDate": "2019-10-29", "language": "en", "rating": 5}, {"id": 690589035, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d240504-r690589035-Desconsol-Barcelona_Catalonia.html", "text": "The Desconsol is a sculpture that sits in a fountain, opposite the Parliament of Catalonia. The sculpture depicts an unknown woman, her arms flung over a boulder, hiding her face as if trying to bury her face into the rock. You can almost feel her grief and inconsolable despair.", "publishedDate": "2019-07-18", "language": "en", "rating": 5}, {"id": 643353814, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d240504-r643353814-Desconsol-Barcelona_Catalonia.html", "text": "This is a nice little statue and Barcelona's answer to Copenhagen's Little Mermaid. It is set within the grounds of the Parc de la Ciutadella and in it's own oval shaped pond in front of the Catalan Parliament building.", "publishedDate": "2019-01-03", "language": "en", "rating": 3}, {"id": 606955996, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d240504-r606955996-Desconsol-Barcelona_Catalonia.html", "text": "If you're visiting Parc de la Ciutadella, this famous statue should be part of your list of things to photograph.\nBeautiful place.", "publishedDate": "2018-08-16", "language": "en", "rating": 4}, {"id": 563770011, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d240504-r563770011-Desconsol-Barcelona_Catalonia.html", "text": "Reading through the previous reviews it seems most people have got it wrong as to what this actually is.  To clarify, there is a park called \"Parc de la Ciutadella\" and within that park are several monuments, statues, a very large lake and a stand out fountain which is NOT called El Desconsol despite so many people reviewing it here!  That fountain is called Cascada Monument.\n\nWithin the park is also the parliament building and in front of that is the pond with the actual sculpture called El Desconsol.  It is hauntingly beautiful (see pic) and translates to \"I Despair\" with a female kneeling in a physically deflated position, her face covered by her hair and feeling so sad she cannot be consoled.  Despite this sadness, it is strangely a popular area for romantics who bring their partners to sit on the benches surrounding the pond, enjoying the beauty while holding hands and kissing.", "publishedDate": "2018-03-02", "language": "en", "rating": 4}, {"id": 558649058, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d240504-r558649058-Desconsol-Barcelona_Catalonia.html", "text": "This is a beautiful replica of a famous sculpture, located in the middle of a pond in a tranquil area of the park.\nThe figure is both provocative and innocent at the same time, which makes for a gorgeous photo-op.", "publishedDate": "2018-02-05", "language": "en", "rating": 4}, {"id": 475769706, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d240504-r475769706-Desconsol-Barcelona_Catalonia.html", "text": "Visited in April with my friends.  Nice park. Perfect for small walk or just to sit around and enjoy the sun.  Sit back relax and enjoy ...", "publishedDate": "2017-04-15", "language": "en", "rating": 5}, {"id": 460858069, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d240504-r460858069-Desconsol-Barcelona_Catalonia.html", "text": "This is a replica of the original beautiful sculpture (which can now be seen at the MNAC).\nThe sculpture is located in the center of the pond in the Ciutadella‬ park and portrays a naked woman weeping on a coffin.\nThe sculpture provides a wonderful photo-op at the park.", "publishedDate": "2017-02-18", "language": "en", "rating": 4}, {"id": 420131482, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d240504-r420131482-Desconsol-Barcelona_Catalonia.html", "text": "Beatifull park with some pieces of culture.  You can have lunch in the centre of the park . The only thing bit dirty around with some rubbish . ", "publishedDate": "2016-09-19", "language": "en", "rating": 5}, {"id": 401867414, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d240504-r401867414-Desconsol-Barcelona_Catalonia.html", "text": "If you are around you can stop by, but do not move just to see it. It's a small park, quite and beautiful. The Catalan parliament is just around so it's 2x1. I like how different it is from the Ciutadella park which is full of people and tourist. The sculpture in the fountain is worth seeing. ", "publishedDate": "2016-08-05", "language": "en", "rating": 3}, {"id": 391947117, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d240504-r391947117-Desconsol-Barcelona_Catalonia.html", "text": "The park is great for morning walks/running, and has a lot of nice plants and buildings. Located close to the beach, the park offers peace and quiet.", "publishedDate": "2016-07-12", "language": "en", "rating": 5}, {"id": 365496062, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d240504-r365496062-Desconsol-Barcelona_Catalonia.html", "text": "The El Desconsol is a feature within Parc de la Ciutadella - approximate walking time is about 15-20 minutes to reach and you will be well rewarded with many great photos. There is a lot of area for children to play in and many places to bring a packed picnic for a warm weekend afternoon. I would highly recommend a stop around the area if your visiting the Parc de la Ciutadella. Expect to spend an hour in the overall park if your just walking through.", "publishedDate": "2016-04-19", "language": "en", "rating": 4}, {"id": 355276971, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d240504-r355276971-Desconsol-Barcelona_Catalonia.html", "text": "I wish all parks had something like this. This structure has many valuable uses. It's easy to meet someone because it's easy to find, it looks good on the pictures, it's a good place to go up and look around and it's a good way to burn some energy by running up and down. Also, it's pretty and impressive at the same time. So if you happened to be in the park or nearby - surely, check it out!", "publishedDate": "2016-03-14", "language": "en", "rating": 5}, {"id": 340473576, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d240504-r340473576-Desconsol-Barcelona_Catalonia.html", "text": "It is a huge and gorgeous water fountain at Parc de la Ciutadella, a medium-sized park in the city. This fountain is definitely a highlight there; it is located near the main entrance to the left. It is one of the most beautiful fountains I’ve ever seen; it is really worth going. You can climb the steps all the way up and admire the beautiful details from up close. To my surprise, when I reached the top, there were some street vendors on the upper part of the fountain, which was weird and made it a bit tight. A monument like this shouldn’t be used for this kind of activity – it kind of spoiled it a bit.", "publishedDate": "2016-01-16", "language": "en", "rating": 5}, {"id": 339629804, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d240504-r339629804-Desconsol-Barcelona_Catalonia.html", "text": "Desolation is a famous sculpture by Josep Llimona, from 1907, now the part of the collection of the National Art Museum of Catalonia. The author also produced several replicas using diverse materials. A marble replica, bigger than the original is the centerpiece of a pond in front of Parliament of Catalonia. Well, it is actually a plaster replica, because the sculpture was damaged over time and replaced by this one.", "publishedDate": "2016-01-13", "language": "en", "rating": 5}, {"id": 313124236, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d240504-r313124236-Desconsol-Barcelona_Catalonia.html", "text": "It is a thing that makes a stunning park look even more beautiful! Fountain looks amazing. It really is special! You must see it and get on top of it! ", "publishedDate": "2015-09-23", "language": "en", "rating": 5}, {"id": 310894236, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d240504-r310894236-Desconsol-Barcelona_Catalonia.html", "text": "Even more impressive than the Trevi fountain and a nice cool place to hang out on a hot day. I haven't climbed the stairs to the top yet because I have the baby in the stroller, but it looks like fun.", "publishedDate": "2015-09-16", "language": "en", "rating": 5}, {"id": 259824892, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d240504-r259824892-Desconsol-Barcelona_Catalonia.html", "text": "This is a very nice park near arc de triumph and just above barcelona zoo.. Trees,  flowers,  lakes and an extraordinary fountain.  Olympic park and Barceloneta beach are also in walking distance. Must visit!! ", "publishedDate": "2015-03-16", "language": "en", "rating": 4}, {"id": 245882053, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d240504-r245882053-Desconsol-Barcelona_Catalonia.html", "text": "After walking down the ARC de Triomf you enter the park. Such a lovely park with beautiful water falls and lake", "publishedDate": "2014-12-25", "language": "en", "rating": 5}, {"id": 235261637, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d240504-r235261637-Desconsol-Barcelona_Catalonia.html", "text": "These beautiful baroque fountains are located in the park Ciudadella, not far from the Port. While still a young student, the famous Catalan architect Gaudi worked on them. The park also contains the Catalan parliament building, a triumphal arch, some noteworthy statues, and a lake with boats to rent.", "publishedDate": "2014-10-19", "language": "en", "rating": 4}, {"id": 233358241, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d240504-r233358241-Desconsol-Barcelona_Catalonia.html", "text": "Nice park with impressive water features, plenty of shade to rest in. A good place to pass the time if you're waiting for a train in the the nearby station.", "publishedDate": "2014-10-08", "language": "en", "rating": 5}, {"id": 215195094, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d240504-r215195094-Desconsol-Barcelona_Catalonia.html", "text": "Nice park for a stroll with your nearest. Rowing boats for hire if you are interested of that. The usual souvernirs/trinkets salesmen but not to pushy. A kiosk to buy refreshments close to the big pond.", "publishedDate": "2014-07-13", "language": "en", "rating": 4}]}}]