[{"locationId": 523834, "name": "Parque de la España Industrial", "placeType": "ATTRACTION", "reviewListPage": {"reviews": [{"id": 740493774, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d523834-r740493774-Parque_de_la_Espana_Industrial-Barcelona_Catalonia.html", "text": "Don’t go if it’s not on your way somewhere. With all the beautiful and amazing places in Barcelona, this is definitely nor an attraction.", "publishedDate": "2020-01-21", "language": "en", "rating": 1}, {"id": 722089622, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d523834-r722089622-Parque_de_la_Espana_Industrial-Barcelona_Catalonia.html", "text": "We visited on a sunny October Saturday, the children’s playground and basket ball courts were busy with locals having a good time. They playground had a good range of equipment to entertain a 2 and a 5 year old.\n\nThe rest of the park however was quite tired and needs a bit of up keep. There were benches but the surrounding area was grubby and some of the grass areas had dog mess on.\n\nThe dragon slide also had a steep drop and not much of a soft landing so we did not let our kids go on it.\n\nOverall it filled time and for the young ones it was a welcome space to blow off some energy. However I would not describe it as anything worth going out of your way to visit.", "publishedDate": "2019-10-28", "language": "en", "rating": 3}, {"id": 613281317, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d523834-r613281317-Parque_de_la_Espana_Industrial-Barcelona_Catalonia.html", "text": "Very nice park to just relax and chill, with various basketball courts and a big sports hall that was used for the Olympic Games in 1992.\nHowever, I would not recommend visiting it at night, as it is not situated in a great area.", "publishedDate": "2018-09-02", "language": "en", "rating": 4}, {"id": 606585405, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d523834-r606585405-Parque_de_la_Espana_Industrial-Barcelona_Catalonia.html", "text": "Our drive through Barcelona streets in the late evening brought us to this site of an old textile mill which now houses an Industrial centre by the name parc de l'Espanya Industrial and the citys first \"hard square\" called the placa dels Paisos Catalans. Located hear is the Barcelona Sants station which was indeed eye catching in its design and functionality lined with restaurants and shops for the weary traveller and tourists alike. Nearby is the boating lake, lighthouse style structures with steps leading to the lake and a massive structure used as a slide ! With a artistically designed and illuminated structure resembling a Xmas tree the area looked serene and beautiful in the almost dark hours after the setting sun !", "publishedDate": "2018-08-14", "language": "en", "rating": 3}, {"id": 581026085, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d523834-r581026085-Parque_de_la_Espana_Industrial-Barcelona_Catalonia.html", "text": "Beautiful park for adult and children,great children’s play area plenty of places to sit.\nLocated over the road from sant station and expo hotel.clean and well maintained", "publishedDate": "2018-05-18", "language": "en", "rating": 5}, {"id": 579582208, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d523834-r579582208-Parque_de_la_Espana_Industrial-Barcelona_Catalonia.html", "text": "When looking for things to see in \"off-the-beaten-path\" Barcelona, this park came up. It is definitely off the beaten path, and the pictures online make it look better than it really is. It is used by locals and definitely not touristy, if that is what you're looking for. The dragon sculpture/slide is interesting.", "publishedDate": "2018-05-11", "language": "en", "rating": 3}, {"id": 543440647, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d523834-r543440647-Parque_de_la_Espana_Industrial-Barcelona_Catalonia.html", "text": "Sometimes stagnant green waters other time full of trash. Take your pick either horrible or disgusting you can can chose. A great idea in theory in practice a complete disaster. Once in 15 years I came and it wasn’t stomach turning. ", "publishedDate": "2017-11-26", "language": "en", "rating": 1}, {"id": 524095509, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d523834-r524095509-Parque_de_la_Espana_Industrial-Barcelona_Catalonia.html", "text": "An odd little park behind the main railway station, built on the site of an old factory, hence it's name. Stagnant looking green water, odd lighthouse looking structures, a dragons slide kids were playing on, seating for thousands to watch what? But it's treed and we saw lots exercising dogs, sitting in the sun, playing basketball and waiting for trains to come maybe. It's quite photogenic.", "publishedDate": "2017-09-13", "language": "en", "rating": 3}, {"id": 505297958, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d523834-r505297958-Parque_de_la_Espana_Industrial-Barcelona_Catalonia.html", "text": "We had a chance to see the park twice when leaving and arriving at the train station. Had a chance to see the dragon playground as well as the towers lining to park. If I lived here it would be a great amenity.", "publishedDate": "2017-07-24", "language": "en", "rating": 3}, {"id": 502743040, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d523834-r502743040-Parque_de_la_Espana_Industrial-Barcelona_Catalonia.html", "text": "Lovely area to pass the afternoon ... the little lake and trees offer a pleasant shade from the sun ... people walking there dogs ... people playing basketball etc .... ", "publishedDate": "2017-07-17", "language": "en", "rating": 5}, {"id": 474862037, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d523834-r474862037-Parque_de_la_Espana_Industrial-Barcelona_Catalonia.html", "text": "It's a nice neighbourhood's park, dogs, basketball, a library. But nothing else. For that reason is a place to go if you have to take a train at Sants, and have plenty of time ahead of you. It's enough good to have picnic. Try not to go in the evenings...", "publishedDate": "2017-04-11", "language": "en", "rating": 3}, {"id": 470934948, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d523834-r470934948-Parque_de_la_Espana_Industrial-Barcelona_Catalonia.html", "text": "This is a strange park in Barcelona. It's different than Park Guell, the Laberint Park, and Ciutadella Park. This park is in the industrial area of Sants. The towers give the park a different and new flavour. There are mostly just locals at this park, and you won't find a single tourist here. There's a metal dragon sculpture, which has a slide for kids, but it's really dirty. The water is sedentary and just dirty. It's a cool place to go if you want to see the \"real Barcelona,\" and take time away from all the glam of the tourist attractions. It is definitely different and strange. If you have time to kill, go see the park. If not, you haven't really missed anything.", "publishedDate": "2017-03-28", "language": "en", "rating": 3}, {"id": 454347063, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d523834-r454347063-Parque_de_la_Espana_Industrial-Barcelona_Catalonia.html", "text": "The park is just another park that can be seen in many European great cities. The towers at its end might give it some different flavor than others. The pond and the lawns are fine, but there is nothing much to them. It is nevertheless a fine green place near the train station.", "publishedDate": "2017-01-23", "language": "en", "rating": 3}, {"id": 430972284, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d523834-r430972284-Parque_de_la_Espana_Industrial-Barcelona_Catalonia.html", "text": "I see in this modest public park adjacent to the Sants train station and our hotel, a reflection of Barcelona's commitment to visual excellence. Cutting edge beauty where least expected.", "publishedDate": "2016-10-23", "language": "en", "rating": 4}, {"id": 414874741, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d523834-r414874741-Parque_de_la_Espana_Industrial-Barcelona_Catalonia.html", "text": "Our hotel was immediately next to this small park. There is a small lake and greenery which is welcome in a largely industrial area. Unfortunately there are fairground attractions (which did not seem to be used) immediately next to the park. This cheapens the area and spoils the atmosphere. On one of the nights we were there there was a firework display.", "publishedDate": "2016-09-05", "language": "en", "rating": 3}, {"id": 372851839, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d523834-r372851839-Parque_de_la_Espana_Industrial-Barcelona_Catalonia.html", "text": "We passed by daily along our path from hotel to Sants station. Many families strolling in the park in the  evening. It's more of a modern design park with dragon sculpture (as a playground for kids) & fountains. Nothing demands one's attention to divert their route to visit this park IMHO. ", "publishedDate": "2016-05-14", "language": "en", "rating": 3}, {"id": 358361853, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d523834-r358361853-Parque_de_la_Espana_Industrial-Barcelona_Catalonia.html", "text": "A perfect place for children to play and adults to walk or just soak the sun. The parque has a basket ball court, football area, table tennis, swimming pool, gym which are all free to access. ", "publishedDate": "2016-03-25", "language": "en", "rating": 5}, {"id": 340390923, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d523834-r340390923-Parque_de_la_Espana_Industrial-Barcelona_Catalonia.html", "text": "Dedicated to the industrial strength of the region, this park was constructed at the site of the old textile factory. The park was opened in 1985, designed by the Basque architect Luis Pena Ganchegui. Another Basque artist, Andres Nagel, is the author of a giant metal dragon, the largest among many sculptures in the park. The central attraction is a boating lake surrounded by the nine tall towers designed as lighthouses. Very interesting and unusual park!", "publishedDate": "2016-01-16", "language": "en", "rating": 4}, {"id": 309186252, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d523834-r309186252-Parque_de_la_Espana_Industrial-Barcelona_Catalonia.html", "text": "This park is right next to the Sants train station and has some unusual modern art and sculptures. Nice change from the norm ", "publishedDate": "2015-09-11", "language": "en", "rating": 4}, {"id": 274717928, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d523834-r274717928-Parque_de_la_Espana_Industrial-Barcelona_Catalonia.html", "text": "The Parque de la Espana Industrial is an odd place.  There's a large metal \"sculpture\" of a dragon which serves as a slide for children (but it's pretty filthy).  There's what could be a lovely duck pond, but the water is sedentary and foul.  There are interesting towers (too large to be street lights, too small to be lighthouses,...what were they for?) lining the pond.  And there are grounds filled with trees and paths.  It must have been lovely at one time, and it still is attractive to look at from the 23rd floor Visual Restaurant at the top of the Gran Hotel Torres Catalunya.  But you'll probably enjoy it more from a distance.", "publishedDate": "2015-05-26", "language": "en", "rating": 3}, {"id": 254307950, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d523834-r254307950-Parque_de_la_Espana_Industrial-Barcelona_Catalonia.html", "text": "One of the dirtiest places I've ever been to. The dragon slides were filled with urine and trash.  The water had garbage in it. Fountains weren't working.  Needed a shower after walking thru park. Several homeless sleeping there. ", "publishedDate": "2015-02-15", "language": "en", "rating": 1}, {"id": 230903196, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d523834-r230903196-Parque_de_la_Espana_Industrial-Barcelona_Catalonia.html", "text": "Very nice park, the fountains are lovely and add a little touch to the park. The park isn't too big, but is nice too just sit down and enjoy the views.\n\nRight next to bants train station so easy to reach.", "publishedDate": "2014-09-25", "language": "en", "rating": 3}, {"id": 225650680, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d523834-r225650680-Parque_de_la_Espana_Industrial-Barcelona_Catalonia.html", "text": "Some great pieces of sculpture and design work including swimming pools and fountains. A giant slide that resembles a dragon for kids to play on. Well all those things are there but; the slide is used by people as a public toilet, so if you do go up the stairs for a slide down, the smell is unbearable and you certainly wont want to sit  for the ride down but retract quickly back down the stairs. Such a pity. If you then wander around the pool there is a shelf, where the homeless bed down for the night. We were there quite early in the morning so quite a few were still there. The rubbish around and cardboard boxes makes it far from homely. On the other side of the pool is grass where you can sit but; when we were there, there were many dogs. The dogs use the swimming pool and although there is a park keeper and he told the owners that dogs are not allowed in the pool, well, they just didn't seem to care. Thre is also plenty of rubbish in the water so I wouldn't dip my toes in that soup. It's such a pity because the park itself with its architecture and sculptures would be so enjoyable. As it is, take a gas mask with you and turn a blind eye to the waste products and you will enjoy it.", "publishedDate": "2014-08-31", "language": "en", "rating": 2}, {"id": 220561338, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d523834-r220561338-Parque_de_la_Espana_Industrial-Barcelona_Catalonia.html", "text": "We had a little extra time at the end of a wonderful Barcelona day and decided to head out to this park. We had read about the dragon slide and wanted to check it out. We were immediately met with a disappointment in that the lake had been completely drained leaving only cement in its place. We found the dragon slide, but there were feces and urine all over it, including the top of the main slide. In other parts of the structure, there was various trash and some soiled undergarments. It's really a shame, as this could have been a really enjoyable place. Perhaps it will be cleaned up some time and return to a state of usability. Until then, I would advise that you stay away.", "publishedDate": "2014-08-08", "language": "en", "rating": 2}, {"id": 200835043, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d523834-r200835043-Parque_de_la_Espana_Industrial-Barcelona_Catalonia.html", "text": "Quite pleasant - not as big as I had expected, steps very steep and a bit smelly in places, nice sitting in sun listening to water fountain.", "publishedDate": "2014-04-12", "language": "en", "rating": 3}, {"id": 192905841, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d523834-r192905841-Parque_de_la_Espana_Industrial-Barcelona_Catalonia.html", "text": "I had a four-hour layover in Barcelona, so I decided to get on the Metro and have myself a little adventure.  I randomly chose the Sants station, and probably would have chosen something else had I known it was such a bustling train depot.  But a few steps from the station is the Parc De L'Espanya Industrial, and what a great surprise it was!  Strikingly beautiful and incredibly quiet.  I was happy to see school children playing group sports and older people enjoying a nice sit.  There are some really impressive playground features, too.  \n\nThat said, the park was more of a nice slice of luck for me than a destination.  And some dark corners smelled like piss.", "publishedDate": "2014-02-02", "language": "en", "rating": 3}, {"id": 159615974, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d523834-r159615974-Parque_de_la_Espana_Industrial-Barcelona_Catalonia.html", "text": "Next to Sants station. Beautiful, well crafted park with wonderful water feature and waterfalls. An oasis of calm and tranquillity. Worth checking out for some peace and quiet in a bustling city.", "publishedDate": "2013-05-04", "language": "en", "rating": 4}, {"id": 158437612, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d523834-r158437612-Parque_de_la_Espana_Industrial-Barcelona_Catalonia.html", "text": "This is an old industrial site-cum-park. The Town hall has preserved the old factory, turning it into a municipal activities building. A lake has been built in surrounded by green and a tall, wide staircase, kind of a forum, where to sit and have a drink or just take the sun. In the lower part of the park there are children's games and a small terrace café (\"chiringuito\"), as well as ping-pong tables, a basketball court and a court wall to play raquetball. You often find groups of young people rehearsing gym sequences or dance choreographies. The park is safe and clean, although it may be a bit lonely at night. There are ramps for wheelchairs and baby strollers. Maybe not worth crossing the city to visit, but if you are in the area think about having a picnic or coffee at the Parc de la Espanya Industrial", "publishedDate": "2013-04-21", "language": "en", "rating": 4}, {"id": 154552931, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d523834-r154552931-Parque_de_la_Espana_Industrial-Barcelona_Catalonia.html", "text": "I was on my way to Placa Espanya and my friend had told me about this park so I detoured. Green water when I went. Lovely stop to sit, rest and to NOT listen to traffic. Not a must see, but definitely a delight. No, not prison towers, just lights. I'm visiting from Riverside California USA.", "publishedDate": "2013-03-14", "language": "en", "rating": 5}, {"id": 144883942, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d523834-r144883942-Parque_de_la_Espana_Industrial-Barcelona_Catalonia.html", "text": "What a wonderful and much needed surprise! This oasis of calm and beauty is such an amazing and out of the ordinary place to visit.  I would consider this an attraction to visit especially if you have to visit this part of the city, it really makes up for the hustle and bustle of a business area. Right outside the main train station it is even more of a surprise and even better, its not full of drunks or druggies, just art students and people looking for a slice of calm and quiet.", "publishedDate": "2012-11-07", "language": "en", "rating": 5}, {"id": 144679010, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d523834-r144679010-Parque_de_la_Espana_Industrial-Barcelona_Catalonia.html", "text": "Basically a Cement park with a lake inside, not worth visitintg at all, it is well mantained, but that is all.\nAlso far away.\n", "publishedDate": "2012-11-05", "language": "en", "rating": 1}, {"id": 142459611, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d523834-r142459611-Parque_de_la_Espana_Industrial-Barcelona_Catalonia.html", "text": "This park was beside our hotel and our favourite thing to do was to go to the bakery every morning for warm pastries and croissants, and a take-out coffee and go sit in this park in the morning sun and enjoy our breakfast.  The lake was filled during our visit - but looked more like a swimming pool - we couldnt figure out whether that was its intention or not.  Seemed like a strange set up - a fake lake with arena seating - odd!\n\nThe huge giant Dragon slide gave my 29 year old boyfriend his entertainment for the morning - big kid!!  He loved it; but was disappointed one morning to not be able to have a go as there was a homeless man sheltering in it.  not so kid-friendly all the time!!\n\nAlways very quiet and peaceful in the mornings with the occasional runner out.  visit it :)", "publishedDate": "2012-10-10", "language": "en", "rating": 5}, {"id": 141811663, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d523834-r141811663-Parque_de_la_Espana_Industrial-Barcelona_Catalonia.html", "text": "I think that is is somehow interesting but if you don't have time, you can skip it. One of it's advantages is that it is not that much turistic, so you can relax for a while away from the crowds.", "publishedDate": "2012-10-02", "language": "en", "rating": 3}, {"id": 139421985, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d523834-r139421985-Parque_de_la_Espana_Industrial-Barcelona_Catalonia.html", "text": "This little park was over the road from our hotel and right next to the train station were we came into the city and we visited every day during our stay. On the face of it, it's nothing special but that's one of the great things about Barcelona's parks. On our first visit the lake was empty but over the next few days or was slowly refilled. One evening there was an orchestra playing a free concert, another day we sat with a beer watching the world go by and you can also pick up the free Wi-Fi passing through!", "publishedDate": "2012-09-04", "language": "en", "rating": 5}, {"id": 138216346, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d523834-r138216346-Parque_de_la_Espana_Industrial-Barcelona_Catalonia.html", "text": "I think that there was supposed to be a small lake but it was dry. Lots of local families with children and dogs.", "publishedDate": "2012-08-24", "language": "en", "rating": 3}, {"id": 129853001, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d523834-r129853001-Parque_de_la_Espana_Industrial-Barcelona_Catalonia.html", "text": "Close to Sants station. Beautiful park with wonderful water feature and waterfalls. A great dragon sculpture for kids to play on", "publishedDate": "2012-05-13", "language": "en", "rating": 5}, {"id": 128198603, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d523834-r128198603-Parque_de_la_Espana_Industrial-Barcelona_Catalonia.html", "text": "A good sized park with a lot of options and a beautiful sculpture/child slide at the train station entrance.", "publishedDate": "2012-04-19", "language": "en", "rating": 4}]}}]