[{"locationId": 1809020, "name": "MUHBA Temple d'August", "placeType": "ATTRACTION", "reviewListPage": {"reviews": [{"id": 752431484, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d1809020-r752431484-MUHBA_Temple_d_August-Barcelona_Catalonia.html", "text": "With a few hours to kill before heading to the airport we had a walk around and somehow ended up in here for a brief distraction.  There isn't a lot to see ouside of the pillars and some information about them, it's just strange to go through a doorway and look to your right and see a small part of the Roman Forum.\n\nIf you are in the area or have an interest in Rome then definitely seek it out, it wont take long and you might just find it interesting.", "publishedDate": "2020-04-09", "language": "en", "rating": 4}, {"id": 732906461, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d1809020-r732906461-MUHBA_Temple_d_August-Barcelona_Catalonia.html", "text": "These are very cool very old Roman columns still standing. Heck, it’s free to get in too. Very close to everything else in the area so don’t miss out on some old good historical pieces!", "publishedDate": "2019-12-15", "language": "en", "rating": 5}, {"id": 729663451, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d1809020-r729663451-MUHBA_Temple_d_August-Barcelona_Catalonia.html", "text": "The Centre Excursionista de Catalunya is where you can see the Roman Forum columns from the Temple of Augustus.  This is considered km 0 of Barcelona.   Good signage of the columns, but hard to find otherwise.  A lot of school groups come here.  Free.", "publishedDate": "2019-11-29", "language": "en", "rating": 4}, {"id": 726396228, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d1809020-r726396228-MUHBA_Temple_d_August-Barcelona_Catalonia.html", "text": "This place is tucked away without much in the way of markings.  It is incredible to think about how old these artifacts are.  Of particular interest there is a stone block that has a Roman era inscription.  Plus - it is free admission so the price is right.", "publishedDate": "2019-11-14", "language": "en", "rating": 5}, {"id": 718885744, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d1809020-r718885744-MUHBA_Temple_d_August-Barcelona_Catalonia.html", "text": "There's not a lot to this - the podium and a few columns from the Temple of Augustus that faced on to the forum of the Roman city, but it's a remarkable survival (thanks to it having been encased in a medieval building) and the display boards give good explanations.", "publishedDate": "2019-10-16", "language": "en", "rating": 4}, {"id": 713713446, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d1809020-r713713446-MUHBA_Temple_d_August-Barcelona_Catalonia.html", "text": "It's quite literally just a preserved set of Roman columns inside a building that is tucked away and free to enter. However it proved a perfect spot to sit for 5 mins and escape the rain, and would be just as good for a spot of shade. A few people sit here just to relax for a few mins, there's some info to read but that's it", "publishedDate": "2019-09-28", "language": "en", "rating": 5}, {"id": 712527596, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d1809020-r712527596-MUHBA_Temple_d_August-Barcelona_Catalonia.html", "text": "There are not many visible Roman remains in Barcelona (compared to Tarragona e.g.). This temple of August is a beautiful exception. Four corynthian columns in a house refurbished by Puig i Cadafalch. If there aren't any other groups around, a quiet and peaceful place in the heart of the city.", "publishedDate": "2019-09-24", "language": "en", "rating": 4}, {"id": 707245185, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d1809020-r707245185-MUHBA_Temple_d_August-Barcelona_Catalonia.html", "text": "Yes! In Barcelona!! A very small free exhibit of the old Roman Temple. Walking through Paradis street, there is an ancient sign that announces the August Temple.", "publishedDate": "2019-09-06", "language": "en", "rating": 4}, {"id": 680753038, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d1809020-r680753038-MUHBA_Temple_d_August-Barcelona_Catalonia.html", "text": "Tucked away, this is off the beaten path for many. When I arrived, there was no one there for about 15-20 minutes. It was an incredibly peaceful experience.", "publishedDate": "2019-06-11", "language": "en", "rating": 5}, {"id": 672758138, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d1809020-r672758138-MUHBA_Temple_d_August-Barcelona_Catalonia.html", "text": "MUHBA Temple d'August is Roman history coming to life, in Barcelona! This is what remains of the original temple to Augustus. There are only four huge columns surviving, along with a few other objects,  and they are now enclosed in a medieval building.  So there isn't a great deal left. However quite often the few remains of an ancient buildings tell us a lot about the time they come from. It's very intriguing and if you are a history buff or lover, like us, then you will probably enjoy a visit to this temple.", "publishedDate": "2019-05-09", "language": "en", "rating": 4}, {"id": 662584958, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d1809020-r662584958-MUHBA_Temple_d_August-Barcelona_Catalonia.html", "text": "Like others have said - a 'hidden gem'  You really gotta work on finding this place.  I'm the history buff in the family and my wife was nice enough to spend the time to dig through the Gothic quarter to find its location.  Our GPS was a fail and we were using a paper map - so retro - to find this places location.  \n\nNOTE - if you end up trying to enter the church grounds there is something to see there but you have to wait in line for it.  The pillars are located in a different location.\n\nSo totally worth a visit.  My wife's first trip to Europe and she kinda started figuring out that she was looking at something that is like 2000 years old.    \n\nAlso there are a couple of other Roman site to see in the gothic quarter.", "publishedDate": "2019-03-31", "language": "en", "rating": 5}, {"id": 658647790, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d1809020-r658647790-MUHBA_Temple_d_August-Barcelona_Catalonia.html", "text": "Hidden away off Las Ramblas is the Temple d’August.  A small doorway leads to a small viewing area where you can see three / four ancient Roman Pillars, which were part of a Roman meeting place.  The pillars are upright and reconstructed.  Gets very busy with guided tours.  ", "publishedDate": "2019-03-15", "language": "en", "rating": 3}, {"id": 657244663, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d1809020-r657244663-MUHBA_Temple_d_August-Barcelona_Catalonia.html", "text": "We stumbled across this whilst walking around the Gothic Quarter of Barcelona. It only requires a 10 minute visit, however, it's interesting to see how they built a building around the temple to keep it in tact. \n\nFree to enter.", "publishedDate": "2019-03-08", "language": "en", "rating": 5}, {"id": 651173706, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d1809020-r651173706-MUHBA_Temple_d_August-Barcelona_Catalonia.html", "text": "We were lucky to walk around with a local who brought us to this place hidden in a small alley. Beautiful and surprising", "publishedDate": "2019-02-09", "language": "en", "rating": 5}, {"id": 650547157, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d1809020-r650547157-MUHBA_Temple_d_August-Barcelona_Catalonia.html", "text": "Great landmark to visit with Roman columns at the Temple d'August.  The original cornerstone and columns are found here with very helpful photographs and recreations of the original landmark thousands of years ago. For the history buff, this is a location to not miss.", "publishedDate": "2019-02-06", "language": "en", "rating": 5}, {"id": 642667274, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d1809020-r642667274-MUHBA_Temple_d_August-Barcelona_Catalonia.html", "text": "These four pillars are all that remain of a Roman temple dating back to the first century and are quite magnificent to see. They are housed within the confines of a back alley within the Gothic Quarter and are quite hard to find back worth searching for.", "publishedDate": "2018-12-31", "language": "en", "rating": 4}, {"id": 636512027, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d1809020-r636512027-MUHBA_Temple_d_August-Barcelona_Catalonia.html", "text": "Do you want to have a story that you can tell to other people who have been to Barcelona won't know about? Check this hidden ruin out. It is down a winding street in the Gothic Quarter and worth seeking out. You can visit it in 20-30 minutes and leave you with a sense of awe from the 1st century BC. ", "publishedDate": "2018-11-29", "language": "en", "rating": 5}, {"id": 636511532, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d1809020-r636511532-MUHBA_Temple_d_August-Barcelona_Catalonia.html", "text": "This small set of ruins dates back to 1st century BC. It was awe inspiring to see something that historic. It's not a huge area and the location is tucked away, but it's a great site if you are interested in seeing ancient ruins. ", "publishedDate": "2018-11-29", "language": "en", "rating": 5}, {"id": 636339752, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d1809020-r636339752-MUHBA_Temple_d_August-Barcelona_Catalonia.html", "text": "I had noted that the Temple of Augustus was behind the Barcelona Cathedral and was interested in seeing this structure that was built in the late 1st century BC.  It is inside a building and a little hard to find.  But when you do, it is very cool. There are hardly any tourists.  There is a bench for you to sit and take in what is before you. There is no fee.", "publishedDate": "2018-11-28", "language": "en", "rating": 5}, {"id": 633827695, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d1809020-r633827695-MUHBA_Temple_d_August-Barcelona_Catalonia.html", "text": "MUHBA''s Temple d'August is a hidden gem located in the Gothic District of Barcelona and it's free. The remains of this 4th century temple consist of a set columns located down a narrow passage way. This is truly a hidden gem. Jolly Chriss.", "publishedDate": "2018-11-16", "language": "en", "rating": 5}, {"id": 515327724, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d1809020-r515327724-MUHBA_Temple_d_August-Barcelona_Catalonia.html", "text": "Located in the Gothic quarter of Barcelona, the temple dates back to Roman times and was built for Emperor Augustus.\n\nThe temple is surrounded by modern buildings and four towers on a raised platform and a pedestal are the only parts of the original structure which have survived. The fact that the columns are still standing is a testament to the skill of Roman engineers.\n\nThe ruins are over two thousand years old and give an idea of the size and scale of the temple.\n\nDefinitely worth a short visit.", "publishedDate": "2017-08-19", "language": "en", "rating": 4}, {"id": 491953998, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d1809020-r491953998-MUHBA_Temple_d_August-Barcelona_Catalonia.html", "text": "The Temple of Augustus was a Roman temple built during the Imperial period as a place of worship for Emperor Augustus. The remaining columns are quite hard to find, even with a guide, so take a detailed city map with you. \n\nThis small place is sometimes crowded with groups, but it's worth to wait a bit to visit it.", "publishedDate": "2017-06-10", "language": "en", "rating": 4}, {"id": 488214458, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d1809020-r488214458-MUHBA_Temple_d_August-Barcelona_Catalonia.html", "text": "On arrival the small room was taken up by a coach tour that appeared to have been there for sometime, with more groups waiting to get in. So a very very very busy and free attraction. Was glad to escape the masses. Only 5 minutes required.", "publishedDate": "2017-05-27", "language": "en", "rating": 3}, {"id": 487560477, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d1809020-r487560477-MUHBA_Temple_d_August-Barcelona_Catalonia.html", "text": "Having decided not to go inside the cathedral, we elected to explore the surround the surrounding alleys.\n\nWhile I knew of Roman ruins in Barcelona, I had not done much research so it was a pleasant surprise to find this site. Pretty much buried under later construction the space was crammed with a tour group, but I managed a hasty phone pic.\n\nThe aqueduct remains, albeit looking to be re-constructed, jutting out of ancient stone walls incorporated into later structures, are much easier to spot.", "publishedDate": "2017-05-24", "language": "en", "rating": 4}, {"id": 482106991, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d1809020-r482106991-MUHBA_Temple_d_August-Barcelona_Catalonia.html", "text": "Interesting place to stop by for a few minutes if you happen to be in the neighborhood otherwise do not bother....", "publishedDate": "2017-05-06", "language": "en", "rating": 3}, {"id": 477147844, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d1809020-r477147844-MUHBA_Temple_d_August-Barcelona_Catalonia.html", "text": "Small bit unique. In the heart of the gothic area.  Worth finding if in the area but not worth going out of way to see. ", "publishedDate": "2017-04-19", "language": "en", "rating": 3}, {"id": 472997980, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d1809020-r472997980-MUHBA_Temple_d_August-Barcelona_Catalonia.html", "text": "Tucked away, by the side of Barcelona Cathedral, you will find the ruins of ancient Rome - the Temple of Augustus. As ahistory geek, I was very excited to see this and to see how Barcelona was occupied (thought the Gothic Quarter, evidence of Roman occupation can be seen). There are just a few columns left, but there are pictures and explanations on what it would have looked like. It is free to get in and it is worth seeing.", "publishedDate": "2017-04-05", "language": "en", "rating": 4}, {"id": 468008876, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d1809020-r468008876-MUHBA_Temple_d_August-Barcelona_Catalonia.html", "text": "Persevere to find this amazing hidden courtyard with the remnants of what was a stunning roman temple. No entrance fee.", "publishedDate": "2017-03-17", "language": "en", "rating": 5}, {"id": 467391333, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d1809020-r467391333-MUHBA_Temple_d_August-Barcelona_Catalonia.html", "text": "I you are like me and are always impressed when you see things built by men 2 thousand years ago, you should go. A free experience if you can find your way in the small streets behind the Cathedral in Barri Gothic.", "publishedDate": "2017-03-14", "language": "en", "rating": 5}, {"id": 463138750, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d1809020-r463138750-MUHBA_Temple_d_August-Barcelona_Catalonia.html", "text": "These columns (and a honorary stone pedestal) are tucked away in a lovely courtyard surrounded by a medieval palace. A really interesting set of information boards relate the history of the remains.\nThe columns are very impressive and formed part of the temple within the forum complex.\nWell worth a visit.\nNote: There are some steps into the area so those with limited mobility should be aware of this.", "publishedDate": "2017-02-27", "language": "en", "rating": 5}, {"id": 445881007, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d1809020-r445881007-MUHBA_Temple_d_August-Barcelona_Catalonia.html", "text": "Where else can you find enormous Roman columns inside of a courtyard restored by a famous modernist architect inside of a medieval palace?  The columns are impressive, the setting, peaceful, the descriptions, interesting and informative.  Sit for a while and contemplate the sweep of history.  Admission is free.  I stumbled across this historical treasure completely by surprise, attempting to escape the massive crowd in Placa Sant Jaume during the Merce Festival (which, by the way, should not be missed).  The street, Carrer de Paradis, is to the right of the Palau de la Generalitat, between Bisbe and Freneria.  Follow the hard right turn and walk straight into the building now owned by the Centre Excursionista de Catalunya. Or go the other way, from behind the cathedral.", "publishedDate": "2016-12-21", "language": "en", "rating": 4}, {"id": 441285156, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d1809020-r441285156-MUHBA_Temple_d_August-Barcelona_Catalonia.html", "text": "The 3 remaining pillars of the temple of Augustus would have overlooked the forum, now the Placa St Jaume. It is not to hard to find if you locate the Placa St Jaume and work towards Placa del Rei. Free to visit, it is worth a few minutes to read the information and ponder its age.Then visit the rest of the Roman city that is under your feet in the Museum of History. This gives you a better overall view of the importance of this temple .", "publishedDate": "2016-12-01", "language": "en", "rating": 4}, {"id": 429885894, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d1809020-r429885894-MUHBA_Temple_d_August-Barcelona_Catalonia.html", "text": "It's nice to see some ancient Roman Ruins preserved. They've built modern buildings all around it, but nice to see it preserved. We spent 10 minutes just sitting and absorbing it. People came and went taking a picture and going, but it's nice to sit and absorb. 5 minutes is fine.  It's right behind the Cathedral of Barcelona.", "publishedDate": "2016-10-19", "language": "en", "rating": 5}, {"id": 410881613, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d1809020-r410881613-MUHBA_Temple_d_August-Barcelona_Catalonia.html", "text": "The remains of the temple are contained in a small corner off a narrow alley in the barri gotic area. The information boards are very good and briefly sketch the history of the temple to its present state including pictures of the temple remains when incorporated into a building. Free to visit and well worth a short detour.", "publishedDate": "2016-08-26", "language": "en", "rating": 4}, {"id": 408869072, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d1809020-r408869072-MUHBA_Temple_d_August-Barcelona_Catalonia.html", "text": "Although not very easy to find, it is worth seeking out this little piece of history. It is at Carrer del Paradís 10, close to Placa del Rei.  Built for Emperor Augustus in the 1st century BC, only 4 columns remain.  It's interesting the way the ancient Roman columns are surrounded by buildings.", "publishedDate": "2016-08-22", "language": "en", "rating": 4}, {"id": 407481520, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d1809020-r407481520-MUHBA_Temple_d_August-Barcelona_Catalonia.html", "text": "Hidden wonder of Barcelona. Very close to other attractions in the Gothic Quarter. Do not miss this. ", "publishedDate": "2016-08-19", "language": "en", "rating": 5}, {"id": 380354253, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d1809020-r380354253-MUHBA_Temple_d_August-Barcelona_Catalonia.html", "text": "The Temple of Augustus is a little Roman treasure amidst the Gothic Quarter. To access it, I would recommend using the Plaza de Sant Jaume as your reference point. The temple is left of the plaza if you entered via Ramblas and then onto Carrer de Ferran. Look for the beautiful gothic bridge between two buildings off of the Plaza Sant Jaume; that street (Carrer Bisbe) will take you to the Barcelona cathedral. But to find the temple, take the street right of the bridge street. The street is Carrer de Paradis but possibly no street name will be visible, so just choose the street right of the bridge street. Before you enter the street, you will see that it is short before bending right. Take the street, bend right, and straight ahead of you will be a building, in which is the Temple of Augustus. The Roman temple has been enclosed by medieval apartments—a fascinating sight. The temple is free but well-maintained, so don’t be afraid to enter it even if it’s a little neglected by the main tourist crowd that tends to take Carrer Bisbe instead of this tiny neighboring side street. Once you leave the temple, you can continue along this small street which will wind to the back of the cathedral. Once you see the massive structure, you will know that you are not lost. Still, in imagination, it is easy to get lost in these sights—a Roman temple placed inside medieval walls. It’s quite a remarkable idea and its preservation is testimony to Barcelona’s great care towards history.", "publishedDate": "2016-06-06", "language": "en", "rating": 4}, {"id": 379364750, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d1809020-r379364750-MUHBA_Temple_d_August-Barcelona_Catalonia.html", "text": "What remains of the ancient temple of Augustus is hidden away in a courtyard of a medieval house located in a small dark alley.  Fortunately there is a sign that marks the entrance, otherwise noone would ever be  able to find the place. What you will see upon entering the courtyard is not very impressive, three columns and a lintel on top of a partially reconstructed base. Even though the site is not particularly awe inspiring, it is well preserved and maintained and there is an english language plaque that explains the history of the place. Worthy of a visit if you have the spare time.", "publishedDate": "2016-06-03", "language": "en", "rating": 3}, {"id": 371653022, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d1809020-r371653022-MUHBA_Temple_d_August-Barcelona_Catalonia.html", "text": "Typically lost in a hole in the wall type of Roman ruin\nApartments on either side\nMinimal signs \nA few descriptions\nGreen background doesn't do it any favours \nStill very impressive ", "publishedDate": "2016-05-09", "language": "en", "rating": 5}, {"id": 351093132, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d1809020-r351093132-MUHBA_Temple_d_August-Barcelona_Catalonia.html", "text": "This is a quick visit to see three Roman Temple columns that have been covered inside a small spot.  It is one of the few Roman sites preserved in the city.  ", "publishedDate": "2016-02-26", "language": "en", "rating": 3}, {"id": 349071127, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d1809020-r349071127-MUHBA_Temple_d_August-Barcelona_Catalonia.html", "text": "We visited here as part of our guided tour. It was interesting to hear about the ancient columns and how they existed in people's dwellings. Very popular so movement is limited however worth a visit.", "publishedDate": "2016-02-19", "language": "en", "rating": 4}, {"id": 338059292, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d1809020-r338059292-MUHBA_Temple_d_August-Barcelona_Catalonia.html", "text": "We where wondering about Barcelona and we come across the MUHBA temple, once again we are blown away with how many great places there are to see in Barcalona.", "publishedDate": "2016-01-06", "language": "en", "rating": 5}, {"id": 337337822, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d1809020-r337337822-MUHBA_Temple_d_August-Barcelona_Catalonia.html", "text": "Off the side of the road in an alley in the Gotic are of Barcelona, you can walk in and see ancient Roman columns! Very cool! Easy to get to.", "publishedDate": "2016-01-04", "language": "en", "rating": 5}, {"id": 310717568, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d1809020-r310717568-MUHBA_Temple_d_August-Barcelona_Catalonia.html", "text": "I hadn't told my husband about this small piece of Roman history that remains in Barcelona and we decided to do a quick visit.  Amazing to see!", "publishedDate": "2015-09-15", "language": "en", "rating": 5}, {"id": 307549299, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d1809020-r307549299-MUHBA_Temple_d_August-Barcelona_Catalonia.html", "text": "for the historians out there, this is a great little detour! a little hard to find but well worth it. \n", "publishedDate": "2015-09-06", "language": "en", "rating": 5}, {"id": 296169155, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d1809020-r296169155-MUHBA_Temple_d_August-Barcelona_Catalonia.html", "text": "This was not a major attraction but neat to see it amongst the modern structures of the city.  You definitely could miss the signage if you blinked!", "publishedDate": "2015-08-05", "language": "en", "rating": 3}, {"id": 295925979, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d1809020-r295925979-MUHBA_Temple_d_August-Barcelona_Catalonia.html", "text": "The remains of a first BC century Roman Temple dedicated to Augustus are worth to take a look at. In the shadow and calm of the surrounding buildings these Corinthian style columns let you take a look in the Roman History of Barcino (Roman name). I enjoyed the atmosphere of this spot, one of the few which you can visit for free. It's easy to find it when you know where the hell it is located. On the Sant Jaume Square, when you look at the beginning of Carrer del Bisbe (the street with the \"Bridge of Sighs\", you will see on your right side a very small alley with the name Carrer del Paradis. Follow this street and you will find it (there is even a sign on the wall to guide you).", "publishedDate": "2015-08-05", "language": "en", "rating": 4}, {"id": 288628879, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d1809020-r288628879-MUHBA_Temple_d_August-Barcelona_Catalonia.html", "text": "I will admit I probably would not have found this without our Gothic Quarter tour. This is such a cool find to see actual remnants of the city's 2,000 year Roman history. However if you don't know what you are looking for you probably will not find it because this temple like so much of the roman history has been incorporated into the surviving buildings. Still this was great to see the Roman ruins and columns that were a part of a temple that covered the highest point in the city. It was also incredible to hear how these ruins were simply incorporated into medieval buildings. You probably would have never realized this about Barcelona and history before coming. The Roman city beneath it.", "publishedDate": "2015-07-13", "language": "en", "rating": 5}, {"id": 282264625, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d1809020-r282264625-MUHBA_Temple_d_August-Barcelona_Catalonia.html", "text": "remnants of roman ruins..its uniqueness lies around the fact that columns are in the courtyards of houses as the city has grown around the ruins", "publishedDate": "2015-06-22", "language": "en", "rating": 3}, {"id": 277931656, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d1809020-r277931656-MUHBA_Temple_d_August-Barcelona_Catalonia.html", "text": "We hadn't gone to the MUHBA museum yet, but we saw the signs to the Temple of Augustus, which sounded pretty cool. It takes just a few minutes to look at it. We stayed and gazed at it for several more, although there is no good seating for that. The pictures posted is all there is. But, I'm going to post mine anyway.", "publishedDate": "2015-06-04", "language": "en", "rating": 5}, {"id": 263616086, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d1809020-r263616086-MUHBA_Temple_d_August-Barcelona_Catalonia.html", "text": "A bit tricky to find but once you are there it is a sanctuary of cool! What an incredible structure it must have been.\n\nVisitors come and go, so if you sit for a few minutes you can get the small space to yourselves! It is awesome...\n\nA highly recommended treat in the Cuitat Vella...", "publishedDate": "2015-04-04", "language": "en", "rating": 5}, {"id": 259869725, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d1809020-r259869725-MUHBA_Temple_d_August-Barcelona_Catalonia.html", "text": "If you are nearby, you can stop here for a few minutes to appreciate the 4 columns that remain of a roman temple that was built at the site 2 millenia ago. The entrance is through a courtyard opening from a small street behind the cathedral.", "publishedDate": "2015-03-16", "language": "en", "rating": 5}, {"id": 255774671, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d1809020-r255774671-MUHBA_Temple_d_August-Barcelona_Catalonia.html", "text": "It is a bit tricky to find the spot, but it is worth. It represents how the Roman heritage still lives next to the nowadays Barcelona. Check online the schedules so you do not lose your time finding it closed.", "publishedDate": "2015-02-22", "language": "en", "rating": 4}, {"id": 254096717, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d1809020-r254096717-MUHBA_Temple_d_August-Barcelona_Catalonia.html", "text": "To find the columns of a Roman temple hidden away in a backwater of Barcelona was quite a surprise.  We had to track down the location as it's not immediately obvious unless you are on guided tour.  However, we're pleased that we found this, and although 4 columns isn't a lot to see, they were bigger and more impressive than we had expected, and the location so close to more modern buildings was very unexpected.  There are noticeboards showing what the original building and location were like, to help your understanding.  Worth spending a few minutes finding if you are in the Gothic quarter.", "publishedDate": "2015-02-14", "language": "en", "rating": 4}, {"id": 251324649, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d1809020-r251324649-MUHBA_Temple_d_August-Barcelona_Catalonia.html", "text": "To be honest, half the fun of going to this place is finding your way round the back of the cathedral at night in the dark and wandering about the streets. There's not that much to see really, apart from the columns and you do have to use a lot of imagination to conjure up what it might have looked like back in Roman times. It's a reasonable place to sit down and rest your feet, but it can become crowded with other, slightly disappointed, visitors. \n\nThere is little explanation offered and this is a pity when you consider the Roman history of Barcelona on offer elsewhere. It's free to visit  - and it should be, given what little there is to see. So, I would go if you want to visit the complete the set of Roman attractions, but only for that reason.", "publishedDate": "2015-01-27", "language": "en", "rating": 3}, {"id": 246586160, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d1809020-r246586160-MUHBA_Temple_d_August-Barcelona_Catalonia.html", "text": "I love the way the remains were left and protected. It shows great value for history. There was not much to look at though.", "publishedDate": "2014-12-30", "language": "en", "rating": 4}, {"id": 237096935, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d1809020-r237096935-MUHBA_Temple_d_August-Barcelona_Catalonia.html", "text": "This place was a surprise.  It was on my map and I had time so I swung by.  I walked in to this building and followed the signs and was amazed at what was inside.  It is a small room and the pillars are really tall.  Almost too tall to get a picture of...", "publishedDate": "2014-10-30", "language": "en", "rating": 4}, {"id": 235266815, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d1809020-r235266815-MUHBA_Temple_d_August-Barcelona_Catalonia.html", "text": "I was on my way to meet a friend for dinner, managed to get myself turned around a bit, walked around a corner and out of the blue there were these Roman columns, surrounded by newer buildings. No explanation as to how it was they were there.", "publishedDate": "2014-10-19", "language": "en", "rating": 4}, {"id": 220404224, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d1809020-r220404224-MUHBA_Temple_d_August-Barcelona_Catalonia.html", "text": "Roman temple columns in the Gothic quarter of Barcelona. Spot it on you map and check them if you'll be near. Nice place to sit and rest your legs for few minutes.", "publishedDate": "2014-08-08", "language": "en", "rating": 3}, {"id": 212904017, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d1809020-r212904017-MUHBA_Temple_d_August-Barcelona_Catalonia.html", "text": "Incredible to see these Roman ruins here in Barcelona. Thank goodness we were led toi this spot by our tour guides. I could see this little gem overlooked!", "publishedDate": "2014-06-30", "language": "en", "rating": 5}, {"id": 177978872, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d1809020-r177978872-MUHBA_Temple_d_August-Barcelona_Catalonia.html", "text": "Try and find it! If you do, just enjoy, and try to imagine how a roman temple has been incorporated into the houses you see around it. Or are the houses incorporated into the roman temple? See for yourself and be the judge of it.", "publishedDate": "2013-09-21", "language": "en", "rating": 5}, {"id": 162632979, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d1809020-r162632979-MUHBA_Temple_d_August-Barcelona_Catalonia.html", "text": "I would never find this on my own, but the discover walks tour stopped off here. I would love to have gone back to read more about it. A nice gem.", "publishedDate": "2013-06-01", "language": "en", "rating": 5}, {"id": 155011247, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d1809020-r155011247-MUHBA_Temple_d_August-Barcelona_Catalonia.html", "text": "There really is just a few columns to look at and its a pain to find, but well worth a visit if  you're into archaeology. The columns are quite superb to behold. Probably not worth a long journey to find, but definitely pop in if you're nearby.", "publishedDate": "2013-03-18", "language": "en", "rating": 4}, {"id": 126440627, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d1809020-r126440627-MUHBA_Temple_d_August-Barcelona_Catalonia.html", "text": "You will pass it regularly so stop and read all about the temple, and its history.  Would have loved to read more about its history", "publishedDate": "2012-03-21", "language": "en", "rating": 4}, {"id": 118246871, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d1809020-r118246871-MUHBA_Temple_d_August-Barcelona_Catalonia.html", "text": "If you go behind the Barcelona Cathedral you will find the Temple of Agustus. Be careful we felt we were being followed down the little alley by pick pocketers. Check your times for openings. When we finally found it the sight was not opened.", "publishedDate": "2011-09-17", "language": "en", "rating": 5}, {"id": 68063763, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d1809020-r68063763-MUHBA_Temple_d_August-Barcelona_Catalonia.html", "text": "Barcelona is with no doubt a city full of surprises. Some of them very evident and some of them very hidden. Like Augustus Temple Ruins, in the heart of the City.\n\nThis is a wonderful discovery since it mixes the ancient and contemporary face of Barcelona and as it is so hidden, comes out as a wonderful thing. This is one of the many sites the Barcelona City History museum has taken care of and the whole history and information about it is available on the site.\n\nWe discovered this place, walking Barcelona with a with a very creative group, who were learning about depth of field and other benefits of A (aperture) mode  in their cameras.\n\nThis was a perfect place to understand light, DOF and how it works. I had to take these pictures  with my mobile phone…cameras were busy learning and enjoying.", "publishedDate": "2010-06-20", "language": "en", "rating": 5}]}}]