[{"locationId": 190824, "name": "Palace of Catalan Music", "placeType": "ATTRACTION", "reviewListPage": {"reviews": [{"id": 752157827, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d190824-r752157827-Palace_of_Catalan_Music-Barcelona_Catalonia.html", "text": "We only visited this building as part of a tour of Barcelona and didn't see a concert inside (although if we had more time then I would have) just the external and the\nmain entrance way.\n\nThere are many spectacular buildings in Barcelona and this is one of them, seeing the pictures of the stage and performance area makes me want to go back and take in a concert in those amazing surroundings.\n\nA passing visit to take in the sites, but if you get a chance to take in a concert why wouldn't you.", "publishedDate": "2020-04-02", "language": "en", "rating": 4}, {"id": 751705059, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d190824-r751705059-Palace_of_Catalan_Music-Barcelona_Catalonia.html", "text": "The tour was well presented, the guide had an excellent command of English and a great sense of humour. What an edifice! And to think it was nearly knocked  down. ", "publishedDate": "2020-03-23", "language": "en", "rating": 5}, {"id": 751293782, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d190824-r751293782-Palace_of_Catalan_Music-Barcelona_Catalonia.html", "text": "Joined the tour of the Palace of Catalan music and it was quite informative. As introduced, this represented Catalan modernism which preferred curves, dynamic shapes and rich decoration that emphasizes floral and other organic motifs. The guide will bring you following the rose path which showed the rose motif are embedded everywhere in the theater. The tour also allowed to attend for a short while a rehearsal (to show off the theater design that allows sound to travel well to the audience, which was supposed to be top technology during the time this was built). A nice tour, but quite expensive. If you want, you can buy ticket to a concert/performance at the theater which also give you view of the main hall and is cheaper than the tour alone. Highly recommend to go for Flamenco performance here - the superb passionate dances/songs will surely pull your heart string and make your feet tap along.", "publishedDate": "2020-03-18", "language": "en", "rating": 4}, {"id": 750499019, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d190824-r750499019-Palace_of_Catalan_Music-Barcelona_Catalonia.html", "text": "Having heard a recommendation to visit here just to see the building, we decided to take our group of nine friends to a concert there tonight. Neither the architecture nor the music disappointed. A true high point in our two-week trip with many spectacular high points. Perhaps the most beautiful and pleasing concert hall I've ever been in. This is well worth your time both to see and hear.", "publishedDate": "2020-03-11", "language": "en", "rating": 5}, {"id": 750498025, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d190824-r750498025-Palace_of_Catalan_Music-Barcelona_Catalonia.html", "text": "Having heard a recommendation to visit here just to see the building, we decided to take our group of nine friends to a concert there tonight. Neither the architecture nor the music disappointed. A true high point in our two-week trip with many spectacular high points. Perhaps the most beautiful and pleasing concert hall I've ever been in. This is well worth your time both to see and hear.", "publishedDate": "2020-03-11", "language": "en", "rating": 5}, {"id": 749942222, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d190824-r749942222-Palace_of_Catalan_Music-Barcelona_Catalonia.html", "text": "We went to the Palacio to listen to the Jazz at Lincoln Center Orchestra.for their one-night performance in town.\nWhile the repertoire itself did not win us over, the venue itself is a glittering gem of architecture mixing modern features with more traditional aspects of barcelonian tradition.\nThe only con I may have is related to the access and poor staff guidance, which led to a rather chaotic episode when the outgoing audience had to brush against the incoming mass of newcomers.\nThat felt amateur and sub-standard for a venue of this caliber.\nEverything else was just pure bliss.", "publishedDate": "2020-03-08", "language": "en", "rating": 4}, {"id": 749894383, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d190824-r749894383-Palace_of_Catalan_Music-Barcelona_Catalonia.html", "text": "I went to a concert by Wynton Marsalis and the Lincoln Center Jazz Orchestra, which was a wonderful experience beyond my expectations. But no matter what kind of music you're there to listen to, this concert hall is a must in Barcelona. Designed by the modernist architect Lluís Domènech i Muntaner as the home for a grassroots popular choir, this building is one of the most beautiful examples of modernist architecture. It's worth visiting even if there is no concert going on.", "publishedDate": "2020-03-08", "language": "en", "rating": 5}, {"id": 749797144, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d190824-r749797144-Palace_of_Catalan_Music-Barcelona_Catalonia.html", "text": "To have ! And certainly attend a concert to appreciate the acoustics! Book several months before for the concerts.\n45-minute guided tour ... Good but expensive!", "publishedDate": "2020-03-07", "language": "en", "rating": 5}, {"id": 749401234, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d190824-r749401234-Palace_of_Catalan_Music-Barcelona_Catalonia.html", "text": "My partner and I went to the \"Homenatge a Paco de Lucía\" concert. The combination of the guitarrists with the dancers makes the time go by super fast. I am not a big fan of concerts or theatre...and I REALLY enjoyed this \"concert-dancing performance\". \n\nThe building is also amazing. So if you don't have enough money to pay for a ticket, I recommend to just visit the building itself.", "publishedDate": "2020-03-05", "language": "en", "rating": 5}, {"id": 748345604, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d190824-r748345604-Palace_of_Catalan_Music-Barcelona_Catalonia.html", "text": "I went to my first concert at Musica Palau Barcelona and it was incredible. I've seen Wynton Marsalis several times before and he never ceases to amaze with a great band,  stories and history of jazz music as well as being an excellent musician himself. But this venue was truly the icing on the cake. It is spectacular. And while they give tours, try to see a concert there. The whole vibe is just wonderful.", "publishedDate": "2020-02-29", "language": "en", "rating": 5}, {"id": 747969722, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d190824-r747969722-Palace_of_Catalan_Music-Barcelona_Catalonia.html", "text": "Beautiful place!!! Excellent brio from friend to come here and attend a concert. It was amazing! Trio of guitar and dance. The place is magnificent. Check their website for tickets and buy online prior to your trip. Really worth it!! ", "publishedDate": "2020-02-27", "language": "en", "rating": 5}, {"id": 747433844, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d190824-r747433844-Palace_of_Catalan_Music-Barcelona_Catalonia.html", "text": "We planned to visit the Liceu only to discover at the main entrance that it was closed for renovation. Determined to see the local theatre, we headed for Catalana and it was definitely not a mistake.\n\nEverything in there is mesmerising and enchanting is an understatement. The detailed architecture, facade has their own story. You need to go on the tour to learn about the Music Hall and to experience the sound of live opera in it. (They even tried with one of the tourists).\n\nThe balcony area is also worth taking a photo at, and the hundreds-years old chandelier just going out to the balcony. \n\nMake sure to see the details of the architecture and drawings on each pillar in the building. \n\nA place worth going even if you;re not into music. Catalana Musica Palace is an enchanting palace on its own. ", "publishedDate": "2020-02-24", "language": "en", "rating": 5}, {"id": 747401685, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d190824-r747401685-Palace_of_Catalan_Music-Barcelona_Catalonia.html", "text": "Beautiful building, seats slightly uncomfortable but not to dissimilar to those in the UK, worth it for the music.", "publishedDate": "2020-02-24", "language": "en", "rating": 5}, {"id": 747279507, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d190824-r747279507-Palace_of_Catalan_Music-Barcelona_Catalonia.html", "text": "It is a music auditorium that was inaugurated on February 9, 1908, it was a project of the Orfeón Catalán to build a building destined to locate its headquarters.\nOutside sculptural elements are mixed, which allude to the world of music, with architectural and decorative elements of modernist and baroque character. Inside the architect masterfully combined the various building materials with ceramics and glass, the stage is framed by spectacular sculptural illustrations, allegories of cult music and popular music.\nIt is a music auditorium that was inaugurated on February 9, 1908, it was a project of the Orfeón Catalán to build a building destined to locate its headquarters.\nOutside sculptural elements are mixed, which allude to the world of music, with architectural and decorative elements of modernist and baroque character. Inside the architect masterfully combined the various building materials with ceramics and glass, the stage is framed by spectacular sculptural illustrations, allegories of cult music and popular music.\nIt is a music auditorium that was inaugurated on February 9, 1908, it was a project of the Orfeón Catalán to build a building destined to locate its headquarters.\nOutside sculptural elements are mixed, which allude to the world of music, with architectural and decorative elements of modernist and baroque character. Inside the architect masterfully combined the various building materials with ceramics and glass, the stage is framed by spectacular sculptural illustrations, allegories of cult music and popular music.\nIt is a music auditorium that was inaugurated on February 9, 1908, it was a project of the Orfeón Catalán to build a building destined to locate its headquarters.\nOutside sculptural elements are mixed, which allude to the world of music, with architectural and decorative elements of modernist and baroque character. Inside the architect masterfully combined the various building materials with ceramics and glass, the stage is framed by spectacular sculptural illustrations, allegories of cult music and popular music.\nIt is a unique work of art, worth the visit.", "publishedDate": "2020-02-24", "language": "en", "rating": 5}, {"id": 747085336, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d190824-r747085336-Palace_of_Catalan_Music-Barcelona_Catalonia.html", "text": "You have to visit this place. There is no excuse. I don’t recommend tours. Just buy a ticket for a performance. If you buy  tickets online in advance you will be able to afford it even if your budget is limited. ", "publishedDate": "2020-02-23", "language": "en", "rating": 5}, {"id": 746911731, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d190824-r746911731-Palace_of_Catalan_Music-Barcelona_Catalonia.html", "text": "We had never heard about this building, but when we were walking by, we wanted to see it. We didn't do a tour, but went to see a Guitar and Flamenco show, which we enjoyed very much. It was fantastic to see the different light effects and the glass ceiling is stunning.", "publishedDate": "2020-02-23", "language": "en", "rating": 5}, {"id": 746508873, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d190824-r746508873-Palace_of_Catalan_Music-Barcelona_Catalonia.html", "text": "We took a guided tour in English and were very fortunate to be able to listen in to a Beethoven concert for children. The tour was well presented and most interesting but experiencing live music in such a beautiful hall with wonderful accoustics was an absolute joy. ", "publishedDate": "2020-02-21", "language": "en", "rating": 5}, {"id": 746503941, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d190824-r746503941-Palace_of_Catalan_Music-Barcelona_Catalonia.html", "text": "We went on the English tour, guided by Gemma.\nThis is a stunning building, Gemma was knowledgeable, interesting and funny.\nWell worth the entrance fee.", "publishedDate": "2020-02-21", "language": "en", "rating": 5}, {"id": 746331288, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d190824-r746331288-Palace_of_Catalan_Music-Barcelona_Catalonia.html", "text": "Beautiful gem in this city. Visual feast for your eyes. Exceptional tour guide (Gemma) enriched the experience. Do not miss! Like a giant Fabrege egg...exquisite in its details, patterns & materials. Worthy of your time. ", "publishedDate": "2020-02-20", "language": "en", "rating": 5}, {"id": 746302815, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d190824-r746302815-Palace_of_Catalan_Music-Barcelona_Catalonia.html", "text": "Must do in your Stay!I would definitely recommend the guided tour of the palace, during day light to enjoy the beautiful colors of it! We had a great tour guide, Gemma, super friendly and with very interesting knowledge! Price for students 11€ and adults 20€, really worth it!", "publishedDate": "2020-02-20", "language": "en", "rating": 5}, {"id": 746269789, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d190824-r746269789-Palace_of_Catalan_Music-Barcelona_Catalonia.html", "text": "This place is not to be missed. The building is so colourful outside and in. The glass ceiling is magnificent. We were lucky enough to see a rehearsal while we visited which was great. The architecture and decoration is fabulous and the guide was informative and gives you plenty of time to appreciate it. (Although one could sit and look all day!)", "publishedDate": "2020-02-20", "language": "en", "rating": 5}, {"id": 746185940, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d190824-r746185940-Palace_of_Catalan_Music-Barcelona_Catalonia.html", "text": "The Palau de la Música Catalana is a concert hall in Barcelona, Catalonia, Spain. Designed in the Catalan modernista style by the architect Lluís Domènech i Montaner, it was built in 1905.\n\nI have been to several concerts at this location and the acoustics are phenomenal. \nNow we decided to do the guided tour. It is available in several languages and the duration is approximately one hour. Costs 22 Euros per person. \nStarts with a short video with he history of the building and then the guide walks you through the different floors and areas of the theater giving detailed explanations. \nYou have enough time to take pictures. They don't rush you at all so you can really enjoy and \"absorb\" the beauty of the building. \nWe enjoyed it very much and, if you have a chance, see a performance too. It's kind of a \"must do\" thing in Barcelona...", "publishedDate": "2020-02-19", "language": "en", "rating": 5}, {"id": 745694035, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d190824-r745694035-Palace_of_Catalan_Music-Barcelona_Catalonia.html", "text": "I loved this place, really recommended if you visit Barcelona.\nWe share a lovely mometwith my wife...", "publishedDate": "2020-02-17", "language": "en", "rating": 5}, {"id": 745477750, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d190824-r745477750-Palace_of_Catalan_Music-Barcelona_Catalonia.html", "text": "We added this last minute to our itinerary and was glad we did. The building is beautiful and the stained glass is spectacular. I can imagine seeing a performance here would be amazing.", "publishedDate": "2020-02-16", "language": "en", "rating": 5}, {"id": 745307909, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d190824-r745307909-Palace_of_Catalan_Music-Barcelona_Catalonia.html", "text": "10/14/19. First, the building is absolutely stunning. We saw Barcelona Guitar Trio & Dance. The three guitarists were incrediblly talented, and their show was also funny and entertaining. The two dancers were out of this world, and crazy talented. The sound engineer deserves some props as well as it sounded fabulous. What an incredible venue for anything. Go see whatever's available while in Barcelona. Awesome!", "publishedDate": "2020-02-15", "language": "en", "rating": 5}, {"id": 745055793, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d190824-r745055793-Palace_of_Catalan_Music-Barcelona_Catalonia.html", "text": "Place to visit if you go in Barcelona, we enjoyed a lot with my girlfriend... Really romantic en lovely place...", "publishedDate": "2020-02-14", "language": "en", "rating": 5}, {"id": 744844606, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d190824-r744844606-Palace_of_Catalan_Music-Barcelona_Catalonia.html", "text": "Interesting building and forniture from modernist age.\nImpresionante ceilings.\nAnd good acoustic.\nThe made more classic music but also modern sometimes.", "publishedDate": "2020-02-13", "language": "en", "rating": 5}, {"id": 744676989, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d190824-r744676989-Palace_of_Catalan_Music-Barcelona_Catalonia.html", "text": "We went twice. 1st for a concert to experience music in this beautiful setting. 2nd time for a tour. Both were well worth it but if I could pick only one, I'd pick the concert. If you do go to a concert, make sure you pick the main concert hall as there is a small venue in the same location. If you do the tour, I suggest the 1st one in the morning as its the least busy of all the tours.\nStunning details to this building. The stained glass ceiling is a masterpiece.", "publishedDate": "2020-02-12", "language": "en", "rating": 5}, {"id": 744139517, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d190824-r744139517-Palace_of_Catalan_Music-Barcelona_Catalonia.html", "text": "We had a guided tour of this beautiful building on a Monday afternoon and were so impressed we booked concert tickets for Wednesday evening . A memorable occasion.", "publishedDate": "2020-02-10", "language": "en", "rating": 5}, {"id": 743609696, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d190824-r743609696-Palace_of_Catalan_Music-Barcelona_Catalonia.html", "text": "This is a guided tour, and our guide was very good. It starts with a very short film then you are led up to the gorgeous balcony (you can see it from the outside-impossible to miss) and finally to the theater. The whole place is beautiful but the last stop is bar far the greatest. The entire theater is a work of art. \n\nOur group was sort of small compared to how many of the theater seats were filled, which was about 1/3. So the duration may change with a larger group to allow people to see everything. Ours lasted an hour or so. Also, getting photos from all the angles you want without people in them might be an issue depending on crowd size, especially on the balcony. The place isn’t very big. But it wasn’t an issue for us and the whole experience was great, especially when the (now automated) organ was played for us in the theater as we sat in the balcony. \n\nThe outside is also very cool of course, and worth a couple minutes minimum to just view and appreciate. ", "publishedDate": "2020-02-07", "language": "en", "rating": 4}, {"id": 743543006, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d190824-r743543006-Palace_of_Catalan_Music-Barcelona_Catalonia.html", "text": "Go inside! There are tours to visit the inside and they are worth it! Amazing from the inside and the outside!", "publishedDate": "2020-02-07", "language": "en", "rating": 5}, {"id": 743228257, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d190824-r743228257-Palace_of_Catalan_Music-Barcelona_Catalonia.html", "text": "I wasn't sure whether to go to the Palau, but it was one of my absolute favorite places in Barcelona.  The decor (even in the cafe!) is breathtaking and very original.  I wish I had been able to schedule a concert while I was there.", "publishedDate": "2020-02-05", "language": "en", "rating": 5}, {"id": 742951928, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d190824-r742951928-Palace_of_Catalan_Music-Barcelona_Catalonia.html", "text": "A fantastic caladiscope of color, design and sculpture of the art decor epoque all masterly done in remarkably three yeears, A must see when in Barcelona!", "publishedDate": "2020-02-03", "language": "en", "rating": 5}, {"id": 742782352, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d190824-r742782352-Palace_of_Catalan_Music-Barcelona_Catalonia.html", "text": "Absolutely beautiful and well worth a guided tour and a coffee or snack in their cafe before or after.", "publishedDate": "2020-02-03", "language": "en", "rating": 5}, {"id": 742450218, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d190824-r742450218-Palace_of_Catalan_Music-Barcelona_Catalonia.html", "text": "Whatever you do don't walk past this place! That would be easy to do as it's tucked away in the Gothic quarter but you'd be missing a real gem.\n\nTake the 1hr guided tour for the full background on the Palau. Enthusiastic and knowledgeable guides and, if you're very lucky, you may catch part of a concert so you can experience the fabulous acoustics for yourself.\n\nThe Palau also proves there were other Modernism architects at work in Barcelona, not just Gaudi!", "publishedDate": "2020-02-01", "language": "en", "rating": 5}, {"id": 742270289, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d190824-r742270289-Palace_of_Catalan_Music-Barcelona_Catalonia.html", "text": "Caterina Is full of energy and fun and friendly. The Palau becomes your home If she's your guide. Highly recommended.", "publishedDate": "2020-01-31", "language": "en", "rating": 5}, {"id": 742095047, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d190824-r742095047-Palace_of_Catalan_Music-Barcelona_Catalonia.html", "text": "The place is not very well advertised on all tourists sites and tour books. It is very easy to miss it all together. It is very beautiful place. The architecture is unique and it was not designed  by Antoni Gaudi  for a change. The place offers daily tours in English and it's open on Mondays. So many places are closed on Mondays.", "publishedDate": "2020-01-30", "language": "en", "rating": 5}, {"id": 741014229, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d190824-r741014229-Palace_of_Catalan_Music-Barcelona_Catalonia.html", "text": "Truly a beautiful music venue.  Enjoyed the short tour, and wish we could have seen a concert there.  I would definitely recommend this as a must-see in Barcelona.", "publishedDate": "2020-01-24", "language": "en", "rating": 4}, {"id": 741000420, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d190824-r741000420-Palace_of_Catalan_Music-Barcelona_Catalonia.html", "text": "from the minute we walked it, it was clear it’s a magical place. the guided tour was pricy( 20 euros), but it was worth every penny!!!! also, if you find a concert there you like definitely go it’s a unique experience!!!", "publishedDate": "2020-01-24", "language": "en", "rating": 5}, {"id": 740821177, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d190824-r740821177-Palace_of_Catalan_Music-Barcelona_Catalonia.html", "text": "First, before anything, be SURE you have selected a tour timeslot that will be presented in YOUR language.  I simply selected a timeslot but found out later it would be presented in Spanish.  I could've selected an English slot for 30 minutes later but I didn't notice what language went with what slot.  I tried to have it exchanged but they told me it would be a 12 Euro fee to do so.  So, I just went along with the Spanish group.\n\nThat aside, the place is amazing.  I performed there with a group over 20 years ago and I thought the place was magical then.  The mosaics, stained glass, acoustics, etc are just jaw dropping.  \n\nThe tour starts off with a 10 minute video presentation where many past artists talked about their experience in that theater.  After the tour, there's a very nice restaurant in the heart of the theater.\n\nThe only negative is that it's difficult to get a good photo of the exterior design because the street is so narrow you can't get far enough way to get a good shot.\n\nDon't miss this treasure!", "publishedDate": "2020-01-23", "language": "en", "rating": 5}, {"id": 740633783, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d190824-r740633783-Palace_of_Catalan_Music-Barcelona_Catalonia.html", "text": "Sooo pretty! Unfortunately we did not see a concert there, but took a tour. One of the highlights of our visit to Barcelona. Don't miss it!", "publishedDate": "2020-01-22", "language": "en", "rating": 5}, {"id": 740515929, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d190824-r740515929-Palace_of_Catalan_Music-Barcelona_Catalonia.html", "text": "Amaia, our English speaking tour guide, provided an in-depth history of this fascinating building. She explained the myriad architectural elements and their place in Catalan history. Because of the smaller size of our group, we were able to step out on the balcony and see the beautiful columns. The Palau de la Musica is an iconic example of Catalonia architecture and should not be missed. The professionalism and knowledge shared by Amaia our tour guide made this time well spent in a city with many attractions.", "publishedDate": "2020-01-21", "language": "en", "rating": 5}, {"id": 740253712, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d190824-r740253712-Palace_of_Catalan_Music-Barcelona_Catalonia.html", "text": "This concert hall was built over 100 years ago and was well ahead of its time! The use of natural light was awe inspiring. The workmanship was immaculate and the acoustics were fantastic. It is not a large concert hall and thus it is able to highlight all types of music. The 1 hour tour was well worth it and was very informative. ", "publishedDate": "2020-01-20", "language": "en", "rating": 5}, {"id": 739990326, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d190824-r739990326-Palace_of_Catalan_Music-Barcelona_Catalonia.html", "text": "We went to listen to Herbie Hancock concert at the Jazz festival. the acustic is great,. the style of the theatre a bit too much but overall a great experience", "publishedDate": "2020-01-19", "language": "en", "rating": 4}, {"id": 739611091, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d190824-r739611091-Palace_of_Catalan_Music-Barcelona_Catalonia.html", "text": "Representative monument, nice tour and presentation.\nWith on-line reservation more then OK.\nThe accoustic and architecture amazing.\nNext time I'll try to go to a concert, I'm waiting for....", "publishedDate": "2020-01-17", "language": "en", "rating": 5}, {"id": 739537372, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d190824-r739537372-Palace_of_Catalan_Music-Barcelona_Catalonia.html", "text": "The design and details of the concert hall is impressive although not as big as I have imagined. If you are lucky you might meet with the rehearsing performers and be able to experience the sound effects of the concert hall.", "publishedDate": "2020-01-16", "language": "en", "rating": 3}, {"id": 739503817, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d190824-r739503817-Palace_of_Catalan_Music-Barcelona_Catalonia.html", "text": "The Palau de La Música Catalana, or Palace of Catalan Music, is a jewel in the heart of Barcelona. I left this place for last on my list of places to see when I visited Barcelona. Had I known it was so beautiful, I would have gone there much sooner.\n\nIt is a concert hall that was built in the early 1900's in the Modernista style (Catalan Modernism). It has since been added to the list of UNESCO World Heritage Sites. The facade has Arabic & Spanish elements. The skylight is the star of this show, which is made of stained glass and has an inverted center dome. It was so striking in person, that I just stood there and stared at it for a long while. Some of the most famous soloists, conductors, orchestras and singers have performed here, like... The NY Philharmonic, Pablo Casals, Ella Fitzgerald, Duke Ellington, and Juanes to name a few. If you are in Barcelona, this is a MUST SEE!!!", "publishedDate": "2020-01-16", "language": "en", "rating": 5}, {"id": 739219782, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d190824-r739219782-Palace_of_Catalan_Music-Barcelona_Catalonia.html", "text": "Nicely done beautiful music hall , also located short walk from Barcelona Plaza, some tours leaves from that location.", "publishedDate": "2020-01-14", "language": "en", "rating": 5}, {"id": 739122578, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d190824-r739122578-Palace_of_Catalan_Music-Barcelona_Catalonia.html", "text": "This beautiful museum has so much to see.  The architecture alone was worth the visit.  Might be a little boring for very young kids, unless they're really into music; LOTS of stairs, and some of the members of our group were unable to see everything due to mobility issues.", "publishedDate": "2020-01-14", "language": "en", "rating": 5}, {"id": 738529798, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d190824-r738529798-Palace_of_Catalan_Music-Barcelona_Catalonia.html", "text": "We went to see this magnificent building built by the famous architects of the city (after Gaudi), Domenech and Montaner, during the day and then attended a wonderful new year concert in the evening. The interior was even more fascinating and interesting than the outside. You can spend hours looking at each detail. Everything is very unusual, yet very esthetic. It is the second most beautiful thing to see in Barcelona after Sagrada Família. A concert here is really a must if it can be arranged. ", "publishedDate": "2020-01-11", "language": "en", "rating": 5}, {"id": 738432619, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d190824-r738432619-Palace_of_Catalan_Music-Barcelona_Catalonia.html", "text": "Amazing building outside and manifique inside.\nCome here for Flamenco show and buy a good tickets don’t buy cheap once because you will see nothing with cheap tickets.\nOr buy a tour to see how the palace looks inside it’s really beautiful.", "publishedDate": "2020-01-11", "language": "en", "rating": 5}, {"id": 738390413, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d190824-r738390413-Palace_of_Catalan_Music-Barcelona_Catalonia.html", "text": "We enjoyed a beautiful rendition of Spanish guitar. Stunning venue. We really like our box seats. Just a little pricey that’s all.", "publishedDate": "2020-01-10", "language": "en", "rating": 4}, {"id": 738314459, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d190824-r738314459-Palace_of_Catalan_Music-Barcelona_Catalonia.html", "text": "We got tickets at flamenco concert. The concert was wonderful, professional and bright at provided us with an amazing experience during our first visit to Spain. The palace itself is a beautiful masterpiece, we enjoyed a lot. We definitely recommend.", "publishedDate": "2020-01-10", "language": "en", "rating": 5}, {"id": 738082326, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d190824-r738082326-Palace_of_Catalan_Music-Barcelona_Catalonia.html", "text": "This ticket gets you a group tour (ours was about 20-25 people) led by a staff member, starting with a short film.  Tours visit the main auditorium and a reception room, and if you’re lucky, there will be a rehearsal or sound check in the auditorium.  The guides are good, and able to answer most questions.", "publishedDate": "2020-01-09", "language": "en", "rating": 5}, {"id": 737982459, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d190824-r737982459-Palace_of_Catalan_Music-Barcelona_Catalonia.html", "text": "Worth the visit even though tickets can be pricy at 20€ when compared to other attractions. Learned a lot about the Catalan music history ", "publishedDate": "2020-01-08", "language": "en", "rating": 5}, {"id": 737949304, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d190824-r737949304-Palace_of_Catalan_Music-Barcelona_Catalonia.html", "text": "We watched the Spanish Guitar Trio with 2 Flamenco dancers. It was an excellent polished and very enjoyable performance. We picked the box seats and were pleased with our seats. It was a great way to spend a couple hours just relaxing and listening to music, enjoying the culture, interiors and architecture of this historic building. You're not allowed to take videos or photos during the show, but you can take photos before and after the show.", "publishedDate": "2020-01-08", "language": "en", "rating": 5}, {"id": 737766583, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d190824-r737766583-Palace_of_Catalan_Music-Barcelona_Catalonia.html", "text": "A phantasy and top place to visit, either as a touristic site or as a concert/music hall. Obligatory to know Barcelona City.", "publishedDate": "2020-01-08", "language": "en", "rating": 5}, {"id": 737608570, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d190824-r737608570-Palace_of_Catalan_Music-Barcelona_Catalonia.html", "text": "The Palau de la Musica Catalana is in one word, Impressive!!!  The symphony was to begin at 8 pm and doors opened at 7:30 pm.  Beautiful facility!", "publishedDate": "2020-01-07", "language": "en", "rating": 5}, {"id": 737383198, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d190824-r737383198-Palace_of_Catalan_Music-Barcelona_Catalonia.html", "text": "We attended the Gran Gala Flamenco performance and the theater was fully booked on the ground and first floors. Finding seats only on the second floor, the view was not optimal, but the performance was magnificent. We would recommend it to almost anyone. The show lasts a little over one hour.", "publishedDate": "2020-01-06", "language": "en", "rating": 5}, {"id": 737364068, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d190824-r737364068-Palace_of_Catalan_Music-Barcelona_Catalonia.html", "text": "We bought the standard guided tour in English from the Palau website. Our guide Andres was funny, engaging and open to questions. The tour included a brief organ performance, which was grand and made the auditorium come to life!  I inquired about upgrading to add a 20 minute concert, and that is only available in the summer. The building itself is magnificent, unique, and breathtaking. It’s no wonder it is a UNESCO world heritage site.", "publishedDate": "2020-01-06", "language": "en", "rating": 5}, {"id": 737337368, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d190824-r737337368-Palace_of_Catalan_Music-Barcelona_Catalonia.html", "text": "The tour was difficult to hear at times and perhaps could have been of slightly more substance but just having the chance to be inside this stunning, light filled space was worth every cent. Buy tickets online so as not to be disappointed as purchase on the day may not be available.", "publishedDate": "2020-01-06", "language": "en", "rating": 5}, {"id": 737212551, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d190824-r737212551-Palace_of_Catalan_Music-Barcelona_Catalonia.html", "text": "The Palau is a must on your list. The architecture is breathtaking. Especially the interior design is hard to find somewhere else. The highlight is the chandelier. I do t no details about entrance fees, cause I visited a concert there, which I can absolutely advise. Just take a cheap ticket on the 2nd balcony. You will have a nice view of the whole concert hall. Come early and you have enough time for pics.", "publishedDate": "2020-01-05", "language": "en", "rating": 5}, {"id": 737122735, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d190824-r737122735-Palace_of_Catalan_Music-Barcelona_Catalonia.html", "text": "Lovely building near Plaza Catalunya.  Worth visting the cafe even if you are not attending a musical event.  Despite the title it is not ony Catalan music on offer.  Prices reasonabe and tickets seem easily available but it mays to check. ", "publishedDate": "2020-01-05", "language": "en", "rating": 5}, {"id": 736982429, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d190824-r736982429-Palace_of_Catalan_Music-Barcelona_Catalonia.html", "text": "I think the Palau de la Música Catalana I think the Palau de la Música Catalana is one of the most representative monuments of the city It was built between 1905 and 1908 by the architect Lluis Domènech i Montaner. The building was declared a World Heritage Site by UNESCO in 1997. It is a fantastic sample of Barcelona Catalan modernism. The stainglass and decoratioms are fabulous! The tour includes a short video at the beginning that is very well done and explains the history of the theater. The guided tour was in 2019 €20 per person. However, you can do a self guided tour early in the morning.", "publishedDate": "2020-01-05", "language": "en", "rating": 5}, {"id": 736830067, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d190824-r736830067-Palace_of_Catalan_Music-Barcelona_Catalonia.html", "text": "We went for a flamenco show during our stay and while the show was great, the palace itself is beautiful enough to see itself.  Strongly recommend seeing a show or concert at the palace when visiting", "publishedDate": "2020-01-04", "language": "en", "rating": 5}, {"id": 736317687, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d190824-r736317687-Palace_of_Catalan_Music-Barcelona_Catalonia.html", "text": "The building is beautiful and the show was uplifting and spectacular! Talented guitarists, and gifted dancers, made this a captivating show. There was humour, a fantastic play of classic songs.", "publishedDate": "2020-01-02", "language": "en", "rating": 5}, {"id": 736240470, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d190824-r736240470-Palace_of_Catalan_Music-Barcelona_Catalonia.html", "text": "We popped in to the Palau de la Musica during a recent visit and were blown away by the whole experience.  Make sure you join one of the tours offered in the venue, as it shows you exactly how the building was constructed, as well as giving you an insight into the designs behind this absolutely stunning space.  Well worth a visit!", "publishedDate": "2020-01-02", "language": "en", "rating": 5}, {"id": 736057704, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d190824-r736057704-Palace_of_Catalan_Music-Barcelona_Catalonia.html", "text": "Was lucky enough to go see the Barcelona guitar trio and dance between Christmas and New Year. What a magical experience, the venue is just fantastic, not being to big, means you can see brilliantly, not like some venues. \nThe performances were just magical and really made our break over Christmas. Well worth the effort of booking in advance.", "publishedDate": "2020-01-01", "language": "en", "rating": 5}, {"id": 735971945, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d190824-r735971945-Palace_of_Catalan_Music-Barcelona_Catalonia.html", "text": "The building is stunning inside and out, the only way to visit is with a tour or watch a performance, the tour takes approximately 1 hour and starts with a short video. Towards the end you get to listen the magnificent organ. It was cheaper to pre book your tickets online.", "publishedDate": "2019-12-31", "language": "en", "rating": 5}, {"id": 735931868, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d190824-r735931868-Palace_of_Catalan_Music-Barcelona_Catalonia.html", "text": "We weren't able to schedule a tour of this beautiful building but enjoyed seeing it from the outside and taking a quick look at the public areas. We enjoyed what we saw and wished we'd been able to see more.", "publishedDate": "2019-12-31", "language": "en", "rating": 4}, {"id": 735907965, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d190824-r735907965-Palace_of_Catalan_Music-Barcelona_Catalonia.html", "text": "The concert hall is absolutely gorgeous, so be there earlier before the concert starts. The director Mikhail Shecherbakov is just amazing to conduct the orchestra and invite the audience to be part of the concert. The ballet dancers’ beautiful dance makes the concert more enjoyable. My family felt as we were invited to a beautiful ballroom. If time is allowed, I highly recommend this concert.", "publishedDate": "2019-12-31", "language": "en", "rating": 5}, {"id": 735840650, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d190824-r735840650-Palace_of_Catalan_Music-Barcelona_Catalonia.html", "text": "Most interesting and comprehensive guided tour in this Modernista building. Good and knowledgeable guide, but he should have used some sort of \" loudspeaker\".  His voice was sometimes difficult to hear.", "publishedDate": "2019-12-31", "language": "en", "rating": 5}, {"id": 735509693, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d190824-r735509693-Palace_of_Catalan_Music-Barcelona_Catalonia.html", "text": "I visited this place in April 2019. I was walking down in the centre when I saw the building. There is a guided tour in English. We could see the entire building.Totally recommended!", "publishedDate": "2019-12-29", "language": "en", "rating": 5}, {"id": 735384371, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d190824-r735384371-Palace_of_Catalan_Music-Barcelona_Catalonia.html", "text": "We visited “Palau de la Música Catalana” (Main Hall), in occassion of many simfonic and chamber concerts. Guided tours are available.\nThe only concert hall in the world, listed as World Heritage Site by UNESCO (1977).\nBuilt in 1905-1908, is a masterpiece of the architect Lluís Domènech i Montaner.\n\nNotice that some chamber concerts take place in a smaller and modern concert hall.", "publishedDate": "2019-12-29", "language": "en", "rating": 4}, {"id": 735141846, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d190824-r735141846-Palace_of_Catalan_Music-Barcelona_Catalonia.html", "text": "We have had a fabulous time in may tours of Barcelona this week but the tour of the Palace was beyond  disappointing. Let me count the ways. Because of the size of the group we were split into 2 groups with two guides who wound up talking over each other so you could not hear your own guide. At the same time while the stage was also being set up for a concert with banging and moving of equipment. When we complained they said they would repeat everything a second time. Not helpful. Save your money -- this tour is  waste of money and I suspect nothing will change.", "publishedDate": "2019-12-28", "language": "en", "rating": 1}, {"id": 734982675, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d190824-r734982675-Palace_of_Catalan_Music-Barcelona_Catalonia.html", "text": "Place is nice and beautiful but it was very small tour and ticket price 20 euro doesn't justify specially when this has other income from concert as well, visiting saint pau for 20 euro I feel more worth", "publishedDate": "2019-12-27", "language": "en", "rating": 3}, {"id": 734822924, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d190824-r734822924-Palace_of_Catalan_Music-Barcelona_Catalonia.html", "text": "This was an impressive building, both inside and out.  We were lucky to be there when a children's choir was rehearsing and could witness the great acoustics.  You can only see the building via a tour.  There are limited tours in English, so you may need to book ahead of time.  It is worth a visit.", "publishedDate": "2019-12-26", "language": "en", "rating": 5}, {"id": 734782799, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d190824-r734782799-Palace_of_Catalan_Music-Barcelona_Catalonia.html", "text": "This palace was designed by  Lluís Domènech i Montaner, one of Gaudi's professors! We went in late Sept. and just walked up and bought tickets. No lines! There's an excellent cafe as well. We were lucky enough to be present during one of the featured organist's recitals, so got a preview of his performance. The architecture - and tour - are stunning. This is a must see in Barcelona", "publishedDate": "2019-12-26", "language": "en", "rating": 5}, {"id": 734745507, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d190824-r734745507-Palace_of_Catalan_Music-Barcelona_Catalonia.html", "text": "We visit this place last week and booked a Christmas concert in the evening. No formal dress needed and you can book online for the tickets, print them out and brought with you on the trip. It was magnificent inside and nice treat sitting there enjoy the music. Highly recommeneded!", "publishedDate": "2019-12-26", "language": "en", "rating": 5}, {"id": 734450110, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d190824-r734450110-Palace_of_Catalan_Music-Barcelona_Catalonia.html", "text": "This gorgeous palace/music hall is worth a leisurely stroll so you can absorb every detail.  It's a UNESCO Heritage Site and has so many beautiful details that it deserves the UNESCO designation.  Take a guided tour to get the history and significance of the place.  Please do try to come to a concert here, the acoustics are beautiful and the music is wonderful.  They also have Spanish guitar performances with flamenco, which are also very special.", "publishedDate": "2019-12-24", "language": "en", "rating": 5}, {"id": 734350433, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d190824-r734350433-Palace_of_Catalan_Music-Barcelona_Catalonia.html", "text": "We recently took a tour of Spain, and the Palau de la Musica Catalana was one of the best experiences of our trip. This concert hall, built in 1908 is amazing. A great example of Art Nouveau architecture that challenges the best of Gaudi. While on a tour of the building, a pianist walked to the piano on stage and played several pieces. Great! A must visit, and if you have time and there is a concert - go to it.", "publishedDate": "2019-12-23", "language": "en", "rating": 5}, {"id": 734200966, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d190824-r734200966-Palace_of_Catalan_Music-Barcelona_Catalonia.html", "text": "Whether you live in Barcelona or are visiting as a tourist, treat yourself to a concert here and astound your eyes and ears.\n\nTickets: Check out the schedule online and see if there are concerts during your visit. Easy to buy online and there may be special discounts so see if you qualify for any reduced price tickets. I bought a higher seated ticket along the balcony railing so it’s a little bit of an obstructed view but not enough to impact my enjoyment of the concert. Worth the few bucks it saved me.\n\nLocation: 5 minute walk from the Placa and safe neighborhood to walk to and from at night.\n\nAmenities: bathroom, cafe\n\nPalace: Decorated as such. Stained glass windows indoor and outdoor, chandeliers, mosaic pillars, sculptures, murals, this place has all kinds of beautiful art. Arrive early and wander the auditorium to check out the art.\n\nI highly recommend seeing a concert here if you are between picking a concert and the tour. A tour has a set time limit while if you arrive early for a concert you can take your time strolling. You get to HEAR the acoustics, the reason for which this place was built, to honor and showcase music. $22 bucks for 2 hrs of musical entertainment plus seeing the building? Awesome.\n\nSpecial note: Pay attention to WHERE your concert takes place. There is a smaller concert hall that is not the one featured in photos and you don’t want to mistakenly buy a ticket for that if your intention is to see the main hall.\n\nBonus: I heard Beatrice Rana and they allowed her to give 3 encores. Afterwards, she signed autographs in the lobby and you did not need to buy a CD for the signing. \n\nGreat experience!", "publishedDate": "2019-12-22", "language": "en", "rating": 5}, {"id": 733402730, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d190824-r733402730-Palace_of_Catalan_Music-Barcelona_Catalonia.html", "text": "Today visited Palau de la Música ( English tour), outstanding building with amazing tour guide Marco. Highly recommend to everyone to come and explore more of the treasures of UNESCO heritage. \n\nMany thanks to all who is sponsoring and supporting to this building upkeep.  \n\nWarm Regards \nJ", "publishedDate": "2019-12-18", "language": "en", "rating": 5}, {"id": 733375343, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d190824-r733375343-Palace_of_Catalan_Music-Barcelona_Catalonia.html", "text": "spectacular monument, well organized with the advance purchase of the entrance. although I suggest going on weekdays and not on the weekend", "publishedDate": "2019-12-18", "language": "en", "rating": 5}, {"id": 733086045, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d190824-r733086045-Palace_of_Catalan_Music-Barcelona_Catalonia.html", "text": "The visit is one hour seeing the most beautiful corners of the building. The tour was in English and very pleasant", "publishedDate": "2019-12-16", "language": "en", "rating": 5}, {"id": 732879774, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d190824-r732879774-Palace_of_Catalan_Music-Barcelona_Catalonia.html", "text": "Impressive architecture, as the stained glass windows & ceiling. Surprisingly, excellent acoustic place.", "publishedDate": "2019-12-15", "language": "en", "rating": 5}, {"id": 732420224, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d190824-r732420224-Palace_of_Catalan_Music-Barcelona_Catalonia.html", "text": "I went with my husband on a guided tour in Italian to Palau de la Musica. Would recommend book the tour in advance so that you don't have to rush to buy tickets. Was amazed by the beauty of this Art Deco building with well-preserved interiors.Guided tour lasts approximately 50 mins, and is available in English, Spanish, Catalan and Italian at scheduled times of the day.", "publishedDate": "2019-12-13", "language": "en", "rating": 5}, {"id": 732342727, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d190824-r732342727-Palace_of_Catalan_Music-Barcelona_Catalonia.html", "text": "My husband and I attended the English tour. Starts with a short video in one of the auditoriums, then tour guide walks you through the building while explaining the meaning of the architecture and design. ", "publishedDate": "2019-12-12", "language": "en", "rating": 5}, {"id": 732285599, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d190824-r732285599-Palace_of_Catalan_Music-Barcelona_Catalonia.html", "text": "The big saloon was very excellent. Especially glass ceiling like as a sun. Colors are very beautiful. Sound system was very well designated.", "publishedDate": "2019-12-12", "language": "en", "rating": 5}, {"id": 732261133, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d190824-r732261133-Palace_of_Catalan_Music-Barcelona_Catalonia.html", "text": "The Music Palace is a Catalonian Art Nouveau Architectural Masterpiece.  It is the only Art Nouveau concert hall in the world to be listed as a UNESCO World Heritage site. This is an essential Must See for anyone who appreciates architecture.  It is unique and words fail to describe the beauty and innovation of the place.\nTIP: We booked an evening Flamenco Performance for the main Concert Hall (39 Euros).  We arrived 40 minutes early and we were able to go everywhere and take pictures.  We have also done the daytime guided tour (20 Euros), which allows access to the same areas.  Either option will give you an incredible photo opportunity experience.\n", "publishedDate": "2019-12-12", "language": "en", "rating": 5}, {"id": 732078480, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d190824-r732078480-Palace_of_Catalan_Music-Barcelona_Catalonia.html", "text": "The modernist structure of the Palau is interesting but \"over the top\" decorated. Colorful, but too saturated with ornamentation  for my taste. However, the acoustics of the concert hall were quite good and it was a great venue to see Bizet's Carmen opera. It is worth going to see this unique theatre, even if you don't like decoration that is excessively exuberant", "publishedDate": "2019-12-11", "language": "en", "rating": 4}, {"id": 732000819, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d190824-r732000819-Palace_of_Catalan_Music-Barcelona_Catalonia.html", "text": "This is a good stopping off point in a walking tour of the city. Organised trips are available around the house. it boasts very interesting  architectural style", "publishedDate": "2019-12-11", "language": "en", "rating": 4}, {"id": 731642066, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d190824-r731642066-Palace_of_Catalan_Music-Barcelona_Catalonia.html", "text": "We did the self guided tour of the concert hall and it was wonderful.  We did not learn the history, but we were able to see the venue, sit, reflect and just imagine the acoustics.  I wish we could have attended a concert, but it did not work into our schedule.  I encourage a visit and if possible a concert.   For sure, though, go it is well worth the time.", "publishedDate": "2019-12-09", "language": "en", "rating": 5}, {"id": 731627528, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d190824-r731627528-Palace_of_Catalan_Music-Barcelona_Catalonia.html", "text": "You must go to this historical and beautiful architecture venue! choose a good concert and enjoy it!", "publishedDate": "2019-12-09", "language": "en", "rating": 5}, {"id": 731610971, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d190824-r731610971-Palace_of_Catalan_Music-Barcelona_Catalonia.html", "text": "This is not just a tourist attraction. This is located in an ornate theater made for the performing arts. The program not only features Flamenco Dancing but also exquisite guitar players. The performance and the performers are well worth the evening.", "publishedDate": "2019-12-09", "language": "en", "rating": 5}, {"id": 731576561, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d190824-r731576561-Palace_of_Catalan_Music-Barcelona_Catalonia.html", "text": "we saw a show that combined flamenco with opera. the musicians, singers and dancers were all fabulous. you'll get a true taste of spain.", "publishedDate": "2019-12-09", "language": "en", "rating": 5}, {"id": 731415495, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d190824-r731415495-Palace_of_Catalan_Music-Barcelona_Catalonia.html", "text": "Recently went to a concert of Spanish guitar with flamenco. The splendor of this venue is something any visitor to Barcelona should experience.", "publishedDate": "2019-12-08", "language": "en", "rating": 5}, {"id": 731087648, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d190824-r731087648-Palace_of_Catalan_Music-Barcelona_Catalonia.html", "text": "The Palau de la Música was so beautiful. We took a tour (delivered in French with a Spanish accent) which added to the overall wow factor of the experience. The architecture is amazing and the use of glass, ceramics, mosaics and sculpture is unbelievable. The roses on the ceiling are now utilised as aircon vents. We were lucky enough to hear an artist singing in this amazing opera house. Well worth the visit and buying the tickets online.", "publishedDate": "2019-12-06", "language": "en", "rating": 5}, {"id": 730936247, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d190824-r730936247-Palace_of_Catalan_Music-Barcelona_Catalonia.html", "text": "Decided to take in a Masters of the Guitar tribute to flamenco composer Paco de Lucía at the Palua de la Musica Catalona. Had some initial doubts because it sounded a bit cliched and touristy, but wanted to see the Palau and reviews of the show were exceptionally high.  It turns out my doubts had no basis and it all went swimmingly.  We walked up for tickets a couple of hours before the show and were able to score aisle seats in the seventh row.  Had time to fit in tapas and a glass of wine at a restaurant just across the street. The musicians were superb and droll as well.  Classical flamenco and  jazz pieces were the main fare, but a few rock licks managed to work there way in.  For the first encore, the three guitarists and drummer amazingly played Billie Jean ensemble on a single guitar to the delight of the audience. The dancers were gorgeous, mesmerising and really seemed to enjoy themselves.  The show earned a standing ovation.  The Palau was really another show in itself. A work of Art Nouveau and a UNESCO declared world heritage site, it was the most incredible music venue I have ever had the good luck to experience.  The evening was a feast for the senses.", "publishedDate": "2019-12-05", "language": "en", "rating": 5}, {"id": 730871876, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d190824-r730871876-Palace_of_Catalan_Music-Barcelona_Catalonia.html", "text": "This was my personal favorite of all the beautiful buildings that I saw in Barcelona. The colors were like being placed inside of a jewel box. The tour was informative as well. We had the last tour of the day and one of the musical acts was warming up so we received a free mini concert. The entire building is just gorgeous. The colors produced by the stained glass windows and ceiling are just gorgeous.", "publishedDate": "2019-12-05", "language": "en", "rating": 5}, {"id": 730561754, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d190824-r730561754-Palace_of_Catalan_Music-Barcelona_Catalonia.html", "text": "The architecture is amazing. instead of buying a 18e ticket for a guided tour, I bought a concert ticket with for 14e, enjoyed 1.5 hour music and decor.", "publishedDate": "2019-12-04", "language": "en", "rating": 5}, {"id": 730461867, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d190824-r730461867-Palace_of_Catalan_Music-Barcelona_Catalonia.html", "text": "The theater is small. Only about 2000 seats. But the architecture is amazing. It is the most beautiful theater I have seen. Must see", "publishedDate": "2019-12-03", "language": "en", "rating": 5}, {"id": 730378852, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d190824-r730378852-Palace_of_Catalan_Music-Barcelona_Catalonia.html", "text": "We upgraded the seats.\nThe orchestra hall was worth seeing with beautiful interior and exterior decor.\nThe concert was also superb. We enjoyed the music very much.\nThe artists played music for the entire time with great passion and vigor. \nEvery part of music was great and enjoyable.\nMust visit place in Barcelona.", "publishedDate": "2019-12-02", "language": "en", "rating": 5}, {"id": 730332242, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d190824-r730332242-Palace_of_Catalan_Music-Barcelona_Catalonia.html", "text": "The tour is worth every penny if you're into beaux arts era stuff and architecture. The entire place is like a little jewel box, with gorgeous lines and finish work everywhere.  It was definitely one of the highlights of our visit, and something you can't see anywhere else.", "publishedDate": "2019-12-02", "language": "en", "rating": 5}, {"id": 730325001, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d190824-r730325001-Palace_of_Catalan_Music-Barcelona_Catalonia.html", "text": "We had the opportunity to watch an award-winning Spanish Dance show at this place during the 3 days trip in Barcelona. The theater was incredibly grand and vibrant.  So glad we get to visit this place, a must see!", "publishedDate": "2019-12-02", "language": "en", "rating": 5}, {"id": 730280094, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d190824-r730280094-Palace_of_Catalan_Music-Barcelona_Catalonia.html", "text": "Well worth a trip to this amazing building.  If you enjoy music or the history of music, then even better.  The tour is well worth doing and there are plenty of discount tickets giving 20% off the price. Well worth seeing if you enjoy modernista architecture. ", "publishedDate": "2019-12-02", "language": "en", "rating": 5}, {"id": 730242470, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d190824-r730242470-Palace_of_Catalan_Music-Barcelona_Catalonia.html", "text": "It's one of those places worth to visit if you can combine it with a music event/concert as there's quite an interesting offer, and paying the entrance just to visit it it's not worth enough in my opinion.", "publishedDate": "2019-12-02", "language": "en", "rating": 3}, {"id": 730118172, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d190824-r730118172-Palace_of_Catalan_Music-Barcelona_Catalonia.html", "text": "The hall is quite beautiful and not overly large, so if you are seeing a show there, most of the seats will be good. We got the first row on the top level and were quite happy with the seats. The flamenco show was outstanding too! Just get there early enough...it was slow getting our tickets from will call and finding the bathrooms etc. so give yourself a few extra minutes. You will enjoy just looking at the beautiful building!", "publishedDate": "2019-12-01", "language": "en", "rating": 5}, {"id": 730073664, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d190824-r730073664-Palace_of_Catalan_Music-Barcelona_Catalonia.html", "text": "If you want a break from seeing all the Gaudi then head to this place especially if there is music on tap for that night.  This is one of the grand music venues in the World, the acoustics are perfect and every seat is good.  Belle Epoch is the style of the building but it is way more and the artistry of construction will blow you away.  There are some gorgeous buildings in Barcelona and tons of history but for sure do not miss this place it is worth the effort and money.", "publishedDate": "2019-12-01", "language": "en", "rating": 5}, {"id": 729835653, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d190824-r729835653-Palace_of_Catalan_Music-Barcelona_Catalonia.html", "text": "My family attended a Flamenco show which also featured Spanish guitar. The musicians, vocalists and dancers were superb.  A must to experience Spanish culture.", "publishedDate": "2019-11-30", "language": "en", "rating": 5}, {"id": 729791163, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d190824-r729791163-Palace_of_Catalan_Music-Barcelona_Catalonia.html", "text": "So much to see. A stunning venue you will want to take tones of photos of. We saw a traditional Flamenco and Opera show, it was beautiful and entertaining! Don't miss the performance art and theatre of Barcelona!", "publishedDate": "2019-11-30", "language": "en", "rating": 5}, {"id": 729761502, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d190824-r729761502-Palace_of_Catalan_Music-Barcelona_Catalonia.html", "text": "During our recent visit to Barcelona my wife and I had the pleasure of attending an evening of flamenco dancing at the architecturally impressive Palau de la Musica. The show entitled “Gran Gala Flamenco” featured four flamenco dancers accompanied by live music both instrumental and vocal. The performance captured the sensuality and passion of flamenco. It was one of the highlights of our trip.", "publishedDate": "2019-11-30", "language": "en", "rating": 5}, {"id": 729455245, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d190824-r729455245-Palace_of_Catalan_Music-Barcelona_Catalonia.html", "text": "The tour was a great way to learn more about the history, see the stunning details of the concert hall and sit and absorb some of the magic of the space.", "publishedDate": "2019-11-28", "language": "en", "rating": 5}, {"id": 729222987, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d190824-r729222987-Palace_of_Catalan_Music-Barcelona_Catalonia.html", "text": "Take a tour.  Worth the 50 minutes to get to learn and see.  Also, take in a show.  Any show in this venue is worth seeing. ", "publishedDate": "2019-11-27", "language": "en", "rating": 5}, {"id": 729148749, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d190824-r729148749-Palace_of_Catalan_Music-Barcelona_Catalonia.html", "text": "Its really an amazing place...a very nice experience..highly recommended....if u have a child u will have a hard time but its worth it", "publishedDate": "2019-11-26", "language": "en", "rating": 5}, {"id": 729073538, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d190824-r729073538-Palace_of_Catalan_Music-Barcelona_Catalonia.html", "text": "We are awestruck, dumbfounded and slack jawed by the intense beauty that is the Palau de Musica. Every detail of this place is gorgeous and we are fortunate to have great seats in front for the Bolero Performance. Once the dancers, singers and musicians arrive, the show begins and we are all blown away by the magnificence of the Balero. It was a panoply of human emotion set to unusual singing, beautiful music and magnificent dancing that reminded me of river dance and the tango, yet unique to itself. The grace and athleticism of the dancers was remarkable and it was 99+ minutes of pure joy.", "publishedDate": "2019-11-26", "language": "en", "rating": 5}, {"id": 728718674, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d190824-r728718674-Palace_of_Catalan_Music-Barcelona_Catalonia.html", "text": "Words cannot describe the beauty, the technology, the ambiance and architecture of this place. Barcelona was lucky to have had such geniuses and the right conditions to create such treasures.", "publishedDate": "2019-11-24", "language": "en", "rating": 5}, {"id": 728589420, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d190824-r728589420-Palace_of_Catalan_Music-Barcelona_Catalonia.html", "text": "We never made it to this performance and cancelled with the tour operator more time than 48 hours in advanceund as promised!  If you ever have to cancel your plans beware with this tour company!!!", "publishedDate": "2019-11-24", "language": "en", "rating": 1}, {"id": 728341504, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d190824-r728341504-Palace_of_Catalan_Music-Barcelona_Catalonia.html", "text": "i took a tour that well worth time and money, really enjoy our tour guide narration, looking forward to go there again for concert.", "publishedDate": "2019-11-23", "language": "en", "rating": 5}, {"id": 728208155, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d190824-r728208155-Palace_of_Catalan_Music-Barcelona_Catalonia.html", "text": "Brilliant to see and such a well known lin Barcelona. The Architecture is great and its very picturesque And it’s also located in centre. If you get a chance listen to the old musics and you can see magnificent views in this place!", "publishedDate": "2019-11-22", "language": "en", "rating": 5}, {"id": 728061099, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d190824-r728061099-Palace_of_Catalan_Music-Barcelona_Catalonia.html", "text": "The theater was a few block s from our hotel so it was an easy walk.  The theater has been beautifully restore.  We didn’t go to an activity but walked around - beautiful.  It was on a street that our daughter lived when she was studying in Barcelona.  It also has a tapas restaurant across the street that you must try.  EL BITXO.  You’ll need a reservation because it’s small, maybe 15 people. Outstanding!", "publishedDate": "2019-11-21", "language": "en", "rating": 5}, {"id": 728036730, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d190824-r728036730-Palace_of_Catalan_Music-Barcelona_Catalonia.html", "text": "We didn't know much about this place but we were glad that we could see it. Unfortunately, we couldn't see a concert there but we had a tour and it was amazing, the mosaics are just spectacular, so if you are an art fun is a must-go place. They only have guided tours but is worth it.", "publishedDate": "2019-11-21", "language": "en", "rating": 5}, {"id": 727784895, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d190824-r727784895-Palace_of_Catalan_Music-Barcelona_Catalonia.html", "text": "What a surprising delight!  Book tour and enjoy   very delightful place and walk to and from hotel.   Resaurant inside nice for interior views and more spacious than one across street, ", "publishedDate": "2019-11-20", "language": "en", "rating": 5}, {"id": 727710915, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d190824-r727710915-Palace_of_Catalan_Music-Barcelona_Catalonia.html", "text": "It is not deaf friendly!  No virtual video and printed English for deaf travelers who appreciate architectural designs by Antonio Gaudi that the guide spent lots of time explaining the information that we missed out the entire time of visiting. We could only took pictures and left in 15-30 minutes", "publishedDate": "2019-11-20", "language": "en", "rating": 1}, {"id": 727574875, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d190824-r727574875-Palace_of_Catalan_Music-Barcelona_Catalonia.html", "text": "Unfortunately we didn’t have time to take the tour and see the concert hall from the inside but we did admire this jewel of architecture and design from outside and on the first floor inside! Truly a magical sight! Highly recommend to stop by. ", "publishedDate": "2019-11-19", "language": "en", "rating": 5}, {"id": 727393470, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d190824-r727393470-Palace_of_Catalan_Music-Barcelona_Catalonia.html", "text": "The Palau de Música is a magical place. You will not be able to resist taking photo after photo. Such an awesome musical hall. Wish we could have attended a performance in this wonderful music hall.", "publishedDate": "2019-11-18", "language": "en", "rating": 5}, {"id": 727379820, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d190824-r727379820-Palace_of_Catalan_Music-Barcelona_Catalonia.html", "text": "I especially loved the exterior of the building, and the entrance.  It is a beautiful place, and relatively easy to find.  The neighborhood is safe for walking early morning and evening.  It is fun to walk through the gothic quarter to get there, as we did, from our hotel near the Rambla", "publishedDate": "2019-11-18", "language": "en", "rating": 4}, {"id": 727379637, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d190824-r727379637-Palace_of_Catalan_Music-Barcelona_Catalonia.html", "text": "Best way to experience this fabulous concert hall is by enjoying a concert. Architecture is amazing and acoustics great. Tickets are sold on site and online. If you don’t have time for a concert, they offer guided tours of the building all day and in all languages.", "publishedDate": "2019-11-18", "language": "en", "rating": 5}, {"id": 727345779, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d190824-r727345779-Palace_of_Catalan_Music-Barcelona_Catalonia.html", "text": "This is truly one of the great buildings in the world. The exotic, sensuous ebb and flow of the place stagger the imagination that man could not only dream up such a structure but bring it to reality. Beautifully restored and lovingly cared for this is a \"must see\" in Barcelona. ", "publishedDate": "2019-11-18", "language": "en", "rating": 5}, {"id": 727137145, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d190824-r727137145-Palace_of_Catalan_Music-Barcelona_Catalonia.html", "text": "We came to visit the Palau with friends on their first trip to Barcelona for just 3 days and they are so glad that they did so as the Palau is simply unique and is centrally located. Probably even the fact that it is located in a narrow street and hardly noticeable , although just a corner away, from such a busy road as Via Laietana, adds onto the surprise of arriving there.", "publishedDate": "2019-11-17", "language": "en", "rating": 5}, {"id": 727113005, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d190824-r727113005-Palace_of_Catalan_Music-Barcelona_Catalonia.html", "text": "I attended a tribute to John Williams which was amazing, and the setting was splendid!  Was a great value!", "publishedDate": "2019-11-17", "language": "en", "rating": 5}, {"id": 727103027, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d190824-r727103027-Palace_of_Catalan_Music-Barcelona_Catalonia.html", "text": "This is a truly beautiful building. The Palau is tucked away on a narrow street that is easy to miss. It is very ornate seating over 2000 people. The concert hall uses only natural light during daylight hours. A tour for 16E available in various languages. Tickets can be bought at the box office orc by booking ahead. We found the Palau so beautiful we were grateful not to have missed this Barcelona gem.", "publishedDate": "2019-11-17", "language": "en", "rating": 5}, {"id": 726676632, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d190824-r726676632-Palace_of_Catalan_Music-Barcelona_Catalonia.html", "text": "We got tickets to an orchestra while visiting Barcelona for a week. The venue is amazing, so beautiful and the acoustics were just wonderful. ", "publishedDate": "2019-11-15", "language": "en", "rating": 4}, {"id": 726595216, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d190824-r726595216-Palace_of_Catalan_Music-Barcelona_Catalonia.html", "text": "Beautiful place!  Great tour...I wold love to hear a concert there!  The architecture was awesome.  A mirage inside of Barcelona!", "publishedDate": "2019-11-15", "language": "en", "rating": 5}, {"id": 726477468, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d190824-r726477468-Palace_of_Catalan_Music-Barcelona_Catalonia.html", "text": "The building was beautiful and the tour takes you to places you would not normally be able to enter e.g. the balcony with mosaic pillars.  However, it was a short tour (50 minutes) and there was not enough time inside the actual concert hall, where a performance for children was being held.  The guide spoke English with a thick Spanish accent and a soft voice so she was difficult to hear.  After she shooed us all out of the concert hall, she stood us all in front of a poster in the foyer and carried on talking about the building but her voice was drowned out by the sound of the live performance in the hall and the sound of a vacuum cleaner running close by.  Why she didn't halt the tour and ask the cleaner to stop vacuuming, I don't know.  In my opinion, the tour is overpriced at 20 euro pp. especially since the guide was difficult to hear and understand and you weren't given enough time inside the concert hall.", "publishedDate": "2019-11-14", "language": "en", "rating": 4}, {"id": 726441827, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d190824-r726441827-Palace_of_Catalan_Music-Barcelona_Catalonia.html", "text": "Even if you cant attend a concert, be sure to stop at the cafe (which is open to the public) and take a tour of the building. The small bite selection is great and the atmosphere/architechture wonderful. A local recommended this to me as the spot not to miss in Barcelona.  I am really glad I listened to that advice.", "publishedDate": "2019-11-14", "language": "en", "rating": 5}, {"id": 726436772, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d190824-r726436772-Palace_of_Catalan_Music-Barcelona_Catalonia.html", "text": "Inspired to visit by a tour guide from another event, we felt lucky we'd be able to make the final tour of the day, at 3:30 - nowhere did anyone tell us (not online, not even the ticket seller!) that the 3:30 tour was only in Spanish... Annoying, but we muddled our way through, and it was fine - such a beautiful place, we were mostly happy just to see it. But then, at the end, as we were all (about 30 of us) still in the lobby trying to figure out which door to use/say goodbye to the guide, etc., a security guard began shouting at us all to leave. \"NOW! IT'S OVER!!! GET OUT!!!\" Super harsh. It had JUST finished! There was one door! What were we to do, trample each other getting out? I'm not even sure the guide was finished talking. It left a bad taste, for sure. Pretty much the ONLY rudeness experienced in an entire week in Barcelona. That's not an image a \"concert hall of the people\" can be proud of.", "publishedDate": "2019-11-14", "language": "en", "rating": 3}, {"id": 726399667, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d190824-r726399667-Palace_of_Catalan_Music-Barcelona_Catalonia.html", "text": "This is an amazing place.  It is most definitely worth visiting. Taking the tour is also well worth it at 16€ for seniors.  By taking the tour, you get to learn quite a bit on the history and building of the theater.  Most importantly, you get to visit inside which is absolutely beautiful.  At the ticket office, the tour times for each language is posted.  The stain-glass, architecture and art in the theater is impressive.  There is also a nice cafe and a restaurant as well.  We did not see a performance, but they do provide a recording which gives you a good perspective of the remarkable acoustics.  There is so much to see in Barcelona, and this theater should be one you don’t miss.\n\n", "publishedDate": "2019-11-14", "language": "en", "rating": 5}, {"id": 726376690, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d190824-r726376690-Palace_of_Catalan_Music-Barcelona_Catalonia.html", "text": "It was kind of expensive but still worth the tour as I think the money goes to fund the private venue and related local artists.  I enjoyed hearing the history of place.  One thing that struck me as odd was that Herbie Hancock was pointed out as a featured artist over the years.", "publishedDate": "2019-11-14", "language": "en", "rating": 5}, {"id": 726373740, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d190824-r726373740-Palace_of_Catalan_Music-Barcelona_Catalonia.html", "text": "It was at the end of what was our leisurely walk along the EL BORN neighborhood and we were amazed by this lovely building. We went inside but unfortunately, didn't catch up the last ENGLISH guided tour. Too bad - we would have wanted to see the interiors of the building. I bet just as stunning as the exteriors. I hope to be able to watch a concert,  an opera or a flamenco performance here next time. Wish to be back. Perhaps, I will try to check their schedules and book early.", "publishedDate": "2019-11-14", "language": "en", "rating": 4}, {"id": 726298440, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d190824-r726298440-Palace_of_Catalan_Music-Barcelona_Catalonia.html", "text": "excellent performance of both flamenco and spanish guitar - very entertaining and in the most magical of music hall . every trip to barcelona should include this nigh out. affordable at 39 euro", "publishedDate": "2019-11-13", "language": "en", "rating": 5}, {"id": 726275537, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d190824-r726275537-Palace_of_Catalan_Music-Barcelona_Catalonia.html", "text": "With all the hype i was expecting something great, tour started 10 mins late, herded into a viewing area. Watched a film which you couldnt see to read the translations as it was on the floor, if you a few rows back your view is restricted. The tour guide was hard to hear, as a few of us struggled. Then herded up to another room she was quite informative and knew a few well rehearsed lines. The concert hall itself was very beautifully decorated, im not taking anything away from that, it had the wow factor, then ushered up to the top stalls. Same view, when it was over people were asking where to next as they were as astonished as us, well we were laughing, that was roughly 30mins for 20euros.  GO to a concert you'll see the building and a concert, wish we had.", "publishedDate": "2019-11-13", "language": "en", "rating": 2}, {"id": 726251865, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d190824-r726251865-Palace_of_Catalan_Music-Barcelona_Catalonia.html", "text": "My husband and I are so glad that we took the official guided tour of this hidden gem designed by Lluis Domenech i Montaner. Tucked away amongst the narrow streets of La Ribera, it was quite a treat to come across the Palau de la Musica Catalana for the first time and see its facade of beautifully detailed sculptures and intricate mosaics. Once we went inside and saw the interior, especially the concert hall itself, we were even more impressed. Our guide did a masterful job of providing the history and explaining the details of the building including, the ironwork, mosaics, stunning stained glass windows and skylight, and the ornate sculptures. As part of the tour, we had the opportunity to sit back and listen to the organist play. Not only was the concert hall gorgeous, the acoustics were amazing too. Our only regret was not being able to see a performance at the concert hall during our stay in Barcelona.\n\nWe highly recommend booking this one hour guided tour. It must be booked on the official website in advance as spots are limited and it often sells out. If you book 21 days in advance, there is a small saving of 4 euros per ticket off of the standard rate of 20 euros.", "publishedDate": "2019-11-13", "language": "en", "rating": 5}, {"id": 726150314, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d190824-r726150314-Palace_of_Catalan_Music-Barcelona_Catalonia.html", "text": "While not a Gaudi designed building, it was designed by a disciple of his. This building is elegantly beautiful in a very different way from La Sagrada Familia. The ceramic tile work, the stone work, the gilded areas all combine to provide a unique and ethereal experience. Do not miss this, really, do not miss this.", "publishedDate": "2019-11-13", "language": "en", "rating": 5}, {"id": 725967078, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d190824-r725967078-Palace_of_Catalan_Music-Barcelona_Catalonia.html", "text": "We purchased tickets in adance to an evening of opera in this beautiful building. If you come early they have a bar where you can eat and wait for your evening performance. ", "publishedDate": "2019-11-12", "language": "en", "rating": 5}, {"id": 725716941, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d190824-r725716941-Palace_of_Catalan_Music-Barcelona_Catalonia.html", "text": "I found out about this place on Trip Advisor, and would likely have never sought it out otherwise.  It is well worth the trip, and the tour guide James was fantastic.  You learn about the history of the building and those that have performed there.  It is a breathtaking gorgeous interior, and they played the organ while we were there and the acoustics are outstanding.  You can easily see this after seeing the Cathedral in the Gothic Quarter, only a short walking distance.  I would certainly return to see a performance there in the future.", "publishedDate": "2019-11-11", "language": "en", "rating": 5}, {"id": 725678240, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d190824-r725678240-Palace_of_Catalan_Music-Barcelona_Catalonia.html", "text": "We took a guided tour. Begins with an introductory 10 minute video on a drop down screen in a seated rehearsal/training studio space.\nThe building is beautiful to see, amazing, but for us the real enjoyment of the visit was hearing from the excellent guide about the history of the creation of the building and the Orfeo choir. The detailed explanations of the architecture and features of the building greatly enhance the enjoyment of what you are looking at. The meanings of the Muses around the stage, the symbolism in the architecture, how everything comes together to suggest the universality of music, the common bond yet also meeting in the centre with Catalan heritage. You don't necessarily have to understand beauty to appreciate it, but the tour guide's excellent explanations certainly opened our eyes to this fabulous building. The Palau is not a museum but very much a living building, home of world famous choir school and venue for all kinds of musical perfomance. The only slight negative of the visit was some folks treating it as a jostle, just grab photos, selfies and move on experience as opposed to listening, but I suppose that's not uncommon for tours these days and we all enjoy things in our own way.\nWe even had a blast from the beautiful and very large German pipe organ while sitting in the auditorium.\nExtremely interesting tour, superb English language tour guide and of course the gorgeous building.", "publishedDate": "2019-11-11", "language": "en", "rating": 5}, {"id": 725545461, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d190824-r725545461-Palace_of_Catalan_Music-Barcelona_Catalonia.html", "text": "Palau de la Musica or the concert hall is another architectural wonder and a UNESCO heritage building built more than 100 years back. Located in a cramped street, it is just not possible to photograph the beautiful frontage. It is possibly the most striking structure including interiors in Barcelona that is not designed by Gaudi. This building too is built from funds donated by Barcelona’s citizens.\n\nThe main concert hall has possibly the most beautiful interiors I have seen anywhere. The stained glass skylight with an inverted dome is simply breathtaking. In fact, concerts held during the daytime are illuminated by natural light alone! Also, each wooden step is gently lit by point-sized red lamps so that one does not stumble in dark.\n\nOne-hour guided tour was fully worth it. We were also lucky to be allowed to be in audience while a choir practice session was going on.", "publishedDate": "2019-11-10", "language": "en", "rating": 5}, {"id": 725416196, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d190824-r725416196-Palace_of_Catalan_Music-Barcelona_Catalonia.html", "text": "A magnificent architectural music hall built by architect Montanar at the beginning of 20th century.\nit is highly recommend for architecture, art, creativity and innovation fans to take a guided tour inside the building. it is one of  UNESCO heritage sites and landmarks in Barcelona.", "publishedDate": "2019-11-10", "language": "en", "rating": 5}, {"id": 725236478, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d190824-r725236478-Palace_of_Catalan_Music-Barcelona_Catalonia.html", "text": "We had the last tour of the day. Our guide was again James Andrew. We heard the history and saw the magic of the inside of the theatre. Also heard a sample of the organ music and the piano being tuned. Lovely building amazing light", "publishedDate": "2019-11-09", "language": "en", "rating": 4}, {"id": 725220729, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d190824-r725220729-Palace_of_Catalan_Music-Barcelona_Catalonia.html", "text": "Walking through the street we came to this amazing concert palace. it wasn't open at the time to view inside so I captured views from outside. Amazing architecture of this building and vivid colours.", "publishedDate": "2019-11-09", "language": "en", "rating": 4}, {"id": 725092409, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d190824-r725092409-Palace_of_Catalan_Music-Barcelona_Catalonia.html", "text": "The Palau de la Musica Catalana is a must see when in Barcelona\nThis magnificent building is stunning to see and even better the experince a concert there..", "publishedDate": "2019-11-08", "language": "en", "rating": 5}, {"id": 725042921, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d190824-r725042921-Palace_of_Catalan_Music-Barcelona_Catalonia.html", "text": "This is a wonderful building.  Take the tour.  It is worth it just to get a chance to hear the organ play.  ", "publishedDate": "2019-11-08", "language": "en", "rating": 5}, {"id": 724966885, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d190824-r724966885-Palace_of_Catalan_Music-Barcelona_Catalonia.html", "text": "This was my favorite!  Stunningly gorgeous with glass walls, unparalleled acoustics, and astounding ceramics and workmanship.  Next time I will go to a concert.", "publishedDate": "2019-11-08", "language": "en", "rating": 5}, {"id": 724633511, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d190824-r724633511-Palace_of_Catalan_Music-Barcelona_Catalonia.html", "text": "This palace is really worth a visit! Go at 2 in the afternoon, if it’s sunny the light inside is amazing!", "publishedDate": "2019-11-06", "language": "en", "rating": 5}, {"id": 724524271, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d190824-r724524271-Palace_of_Catalan_Music-Barcelona_Catalonia.html", "text": "We got to hear and see a remarkable concert in this splendid theatre space.  The detailing of the architecture, the use of colour, textures and stain glass is incredibly beautiful.  We were told the best way to see the theatre was to attend a concert - and we were not disappointed.  It's its own miracle.", "publishedDate": "2019-11-06", "language": "en", "rating": 5}, {"id": 724385616, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d190824-r724385616-Palace_of_Catalan_Music-Barcelona_Catalonia.html", "text": "beautiful building terrible production.....the concert hall is fabulous and very ornate and the acoustics are excellent. We didn't have any drinks or food so I cannot comment of them, but sadly the production of Carmen was awful. A with rate production which felt very amateur. Terrible costume sets etc and patchy cast", "publishedDate": "2019-11-06", "language": "en", "rating": 3}, {"id": 724381566, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d190824-r724381566-Palace_of_Catalan_Music-Barcelona_Catalonia.html", "text": "Is one of the Jewels of Catalan Belle Epoque Architecture, it is worth a visit, even if you are not attending a concert. ", "publishedDate": "2019-11-06", "language": "en", "rating": 5}, {"id": 724378306, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d190824-r724378306-Palace_of_Catalan_Music-Barcelona_Catalonia.html", "text": "I had the opportunity to drink a coffee in inside this music palace and to visit it.\nIt is a truly great building that you cannot miss!\nThe design is a mix of modern and classic styles, full of colors, with a very good service level for tourists.", "publishedDate": "2019-11-06", "language": "en", "rating": 5}, {"id": 724327139, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d190824-r724327139-Palace_of_Catalan_Music-Barcelona_Catalonia.html", "text": "We had a choice to take the tour or see a how in the evening.  I had some the latter about five years ago and the show was good.  This time, we saw three classical guitarists accompanied by a couple of flamenco dancers and totally enjoyed ourselves.  We purchased the least expensive tickets available and found ourselves alone half up in the upper balcony.  The theater is historic and beautiful and attending a performance provides the chance to e perience a slice of local non-touristic culture.", "publishedDate": "2019-11-05", "language": "en", "rating": 5}, {"id": 724292077, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d190824-r724292077-Palace_of_Catalan_Music-Barcelona_Catalonia.html", "text": "We went for a concert, which was wonderful- but fell in love with the architecture and the history in this place!  It is worth the visit regardless, however, if you have time to take in a show do it!  you wont be disappointed!", "publishedDate": "2019-11-05", "language": "en", "rating": 5}, {"id": 724135825, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d190824-r724135825-Palace_of_Catalan_Music-Barcelona_Catalonia.html", "text": "We had a guided tour in french and were only 5 people so almost a private visit. after a 10 minutes firlm about the history of the Palau we went through the building from the balcony to the front of the stage and then to the second floor. The building is just amazing and if i have the opportunity to come back i will return for a show", "publishedDate": "2019-11-05", "language": "en", "rating": 5}, {"id": 723948892, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d190824-r723948892-Palace_of_Catalan_Music-Barcelona_Catalonia.html", "text": "One of our favorite places in the world.  We have attended concerts on multiple trips to Barcelona.  This music venue offers behind the scenes historical tours.  It is not a Gaudi creation, but nevertheless influenced by him.  The stained glass in the roof is absolutely stunning.  A \"must see\" in Barcelona. ", "publishedDate": "2019-11-04", "language": "en", "rating": 5}, {"id": 723864922, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d190824-r723864922-Palace_of_Catalan_Music-Barcelona_Catalonia.html", "text": "Amazing place full of lights, colours and symbolism. Definitely worth a visit when in Barcelona, one of my favorite attractions in Barcelona.\n\nDon't let the 20 EUR admission fee scare you, definitely worth the money, this place is unique.", "publishedDate": "2019-11-04", "language": "en", "rating": 5}, {"id": 723563071, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d190824-r723563071-Palace_of_Catalan_Music-Barcelona_Catalonia.html", "text": "We enjoyed a piano caocert and loved the building overall.  Take the guilded tour to really appreciate this palace.", "publishedDate": "2019-11-03", "language": "en", "rating": 5}, {"id": 723521042, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d190824-r723521042-Palace_of_Catalan_Music-Barcelona_Catalonia.html", "text": "The exterior is a work of art and definitely on your list of places to see.  But you really must see the inside as well and the way to do that is to attend an event here.  Fabulous design, unique in the world.", "publishedDate": "2019-11-03", "language": "en", "rating": 5}, {"id": 723440324, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d190824-r723440324-Palace_of_Catalan_Music-Barcelona_Catalonia.html", "text": "We went here twice while in Barcelona, once for the Flaminco dancing the other for the opera. Don't think I've ever been in a theater quite like this. It's really something to see! The shows were great too!", "publishedDate": "2019-11-03", "language": "en", "rating": 5}, {"id": 723364297, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d190824-r723364297-Palace_of_Catalan_Music-Barcelona_Catalonia.html", "text": "We attended an evening Flamenco show in the Palau and thoroughly enjoyed both the location and the experience. We'd previously passed by the outside during the day time and enjoyed taking pictures and appreciating the detailed exterior. The interior was even more beautiful, especially the amazing central ceiling. Our seats ended up being right over the stage, an interesting perspective that was fine for flamenco and also gave us a nice close-up look of the mosaic three-dimensional women/muses on the walls of the stage. Overall this was a wonderful experience and a great environment in which to experience flamenco.", "publishedDate": "2019-11-02", "language": "en", "rating": 5}, {"id": 723158017, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d190824-r723158017-Palace_of_Catalan_Music-Barcelona_Catalonia.html", "text": "Words cannot describe how amazing and special this concert hall is.  It was designed by one of Gaudi's contemporaries, who was extremely talented. The stained glass is incredible and the acoustics are amazing.  It is a must see when visiting Barcelona!", "publishedDate": "2019-11-01", "language": "en", "rating": 5}, {"id": 723001662, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d190824-r723001662-Palace_of_Catalan_Music-Barcelona_Catalonia.html", "text": "We went to a Flamenco Guitar & Dance performance, which was superb.  Such a lovely building, with a nice bar/cafe too.", "publishedDate": "2019-11-01", "language": "en", "rating": 5}, {"id": 722889193, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d190824-r722889193-Palace_of_Catalan_Music-Barcelona_Catalonia.html", "text": "Amazing place and seeing a concert really shows you what the building can do. Worth it to be close the ceilings and decorations.", "publishedDate": "2019-10-31", "language": "en", "rating": 5}, {"id": 722858153, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d190824-r722858153-Palace_of_Catalan_Music-Barcelona_Catalonia.html", "text": "Instead of a tour, we bought tickets for a performance at this Music Hall and enjoyed the beauty of the building as well as the experience of a wonderful acoustic guitar performance.", "publishedDate": "2019-10-31", "language": "en", "rating": 5}, {"id": 722675559, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d190824-r722675559-Palace_of_Catalan_Music-Barcelona_Catalonia.html", "text": "Our last night in Barcelona, before the cruise, we went to a concert at the Palau de la Musica.  \n\nNext year will be the 250th birthday of Beethoven and everybody is getting into celebrating.  This concert was a joint effort of the Symphony Orchestra of the Valleys and the Youth Choir of Orfeo Catala.  \n\nThe Palace of Catalan Music was built between 1905 and 1908.  While it was restored in the 1980's it is still one of the strangest concert hall I have been in.  It has windows on both sides of the hall.  We walked up but found an elevator to ride down.  It is a very large concert hall and most all the seats were filled.  \n\nThe program was the Egmont Overture, Cantata in the death of Emperor Joseph II, and the Fifth Symphony.\n\nThe Cantata was a huge work, five movements.  There were four soloists and a big choir.\n\nI don't think the orchestra was particularly good.  One oddity was the extreme display of exertion by the concertmaster, a blonde women.  I was worried that she was going to get whiplash.  \n\nThis is the second time I have heard the Fifth Symphony in Barcelona.  Both times I noted the languid pace.  To me, Beethoven's music is in your face.  If one does not feel pushed then something is missing.  \n\nAfter the concert we walked back to the hotel but the street was taken up by a huge block party.  There were trucks spewing fireworks in the air and there was a thousand snare drums playing.  Teresa talked to some policemen who said it was a week-long, city-wide party.  As we wound our way back to the hotel we stopped for xiao lung bao, our tapas for the night.", "publishedDate": "2019-10-30", "language": "en", "rating": 5}, {"id": 722672127, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d190824-r722672127-Palace_of_Catalan_Music-Barcelona_Catalonia.html", "text": "Despite warnings of protest, police precedence, we powered through to a packed house and enjoyed a most amazing cultural event. A cross between gypsy kings and classical opera set to powerful dance is how I would describe this not to be missed cultural experience. \n\nAll six adults in our party were impressed. The venue is almost as stunning as the show. If you are serious about wanting to experience Spanish culture, this is a not to be missed experience!\n\nBook in advance and arrive a little early. You won’t be sorry. Enjoy tapas and drinks after as you ll be energized by the evenings performance. \n\nBrava!", "publishedDate": "2019-10-30", "language": "en", "rating": 5}, {"id": 722612730, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d190824-r722612730-Palace_of_Catalan_Music-Barcelona_Catalonia.html", "text": "Wildly beautiful and delightful exterior and interior. We enjoyed a lovely concert there in this unique setting.", "publishedDate": "2019-10-30", "language": "en", "rating": 5}, {"id": 722590719, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d190824-r722590719-Palace_of_Catalan_Music-Barcelona_Catalonia.html", "text": "The Palau de Música is a must when in Barcelona.  The pictures do not do justice and seeing the outside of the building does not even come close to the beauty of the inside!  Don’t hesitate, go! :-)", "publishedDate": "2019-10-30", "language": "en", "rating": 5}, {"id": 722522007, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d190824-r722522007-Palace_of_Catalan_Music-Barcelona_Catalonia.html", "text": "This building is well worth a trip to see it.  We did a tour and early evening concert with two young musicians, not a full on concert.  It was the perfect mix of tour and music.  The stained glass in the concert hall is beautiful as are the columns on the upper terrace.  Once must see the inside!  And the combo tour and short format concert with younger musicians is a great option if one does not want to attend a full concert in the main theater.", "publishedDate": "2019-10-30", "language": "en", "rating": 5}, {"id": 722327256, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d190824-r722327256-Palace_of_Catalan_Music-Barcelona_Catalonia.html", "text": "We were staying close by and happened to walk by this building. The location is quite interesting. It’s amongst a bunch of small stores. We didn’t get to go inside. It was closed when we were there.", "publishedDate": "2019-10-29", "language": "en", "rating": 4}, {"id": 722308626, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d190824-r722308626-Palace_of_Catalan_Music-Barcelona_Catalonia.html", "text": "Herbie Hancock at the Barcelona Jazz Festival!! Full house … such a beautiful and intimate venue for musicians and fans!", "publishedDate": "2019-10-29", "language": "en", "rating": 5}, {"id": 721849780, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d190824-r721849780-Palace_of_Catalan_Music-Barcelona_Catalonia.html", "text": "We read about this beautiful theater, and while they offer tours of just the building, we opted to see a performance there. The place has gorgeous artwork, carvings, stained glass, just beautiful.\nThe flamenco show featured four dancers, two singers an musicians. It was our first time seeing flamenco, I enjoyed the dancing, the singing not quite so much.\nDefinitely worth seeing the theater by whichever method. Ate at Tosca Palau just across the way and it was excellent.", "publishedDate": "2019-10-27", "language": "en", "rating": 5}, {"id": 721763722, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d190824-r721763722-Palace_of_Catalan_Music-Barcelona_Catalonia.html", "text": "What a wonderful Catalan modernist architecture. Located in Sant Pere. Super emblematic build! It’s a must!", "publishedDate": "2019-10-27", "language": "en", "rating": 5}, {"id": 721740664, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d190824-r721740664-Palace_of_Catalan_Music-Barcelona_Catalonia.html", "text": "If you’re in Barcelona, reserve a ticket and set aside a little over an hour to see this monument to design and music. The style and colors are fantastic. \n\nThe tour is informative and includes a short organ performance on the recently rebuilt organ that digitally records live performances for replay. \n\nTaking in a concert would be best but ours was cancelled due to protests during our first visit to the city. But when we returned to the city a week later we bought tickets for a tour so all was not lost. Absolutely worth the effort and time to see this historically important concert hall. Cheers!", "publishedDate": "2019-10-27", "language": "en", "rating": 5}, {"id": 721589125, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d190824-r721589125-Palace_of_Catalan_Music-Barcelona_Catalonia.html", "text": "As a professional choral Director, I was very excited to visit the Palau.  I was NOT disappointed.  Our guide, James Andrew, was well-informed and made it a wonderful experience.  He gave us all of the pertinent details without being boring.  The stories he told were entertaining, enhanced his presentation, and were well-received. The Palau is a building of great beauty, however, having a great tour guide brings it to life.  Book with Viator and try to get James!", "publishedDate": "2019-10-26", "language": "en", "rating": 5}, {"id": 721576547, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d190824-r721576547-Palace_of_Catalan_Music-Barcelona_Catalonia.html", "text": "Designed in the Catalan modernist style by Luis Domenech i Montaner in 1905-08.  Beautiful exterior.  I can only imagine how it looks like inside.  We happened to be meeting here for our tour group.  I would have loved to see a performance here.", "publishedDate": "2019-10-26", "language": "en", "rating": 4}, {"id": 721534113, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d190824-r721534113-Palace_of_Catalan_Music-Barcelona_Catalonia.html", "text": "We were able to go inside & take photos & no charge to go in. We were amazed at this beautiful building & all the artwork. It’s really worth it to check it out. You could not go upstairs but what you are allowed is really worth it.", "publishedDate": "2019-10-26", "language": "en", "rating": 5}, {"id": 720798781, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d190824-r720798781-Palace_of_Catalan_Music-Barcelona_Catalonia.html", "text": "We dildnt take the tour, instead we bought tickets to a guitar concert.   We were blown away by the acoustics and we were sitting on the side.  The music palace is worth the visit, it’s just a beautiful example of modernism/ art nouveau.  Take a tour ( get tickets in advance) or go to a performance, but don’t miss it.", "publishedDate": "2019-10-23", "language": "en", "rating": 5}, {"id": 720790503, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d190824-r720790503-Palace_of_Catalan_Music-Barcelona_Catalonia.html", "text": "The Palau de la Musica is a beautiful venue and well worth visiting, just not on this tour.  We waited ten minutes past start time in the wrong area along with a dozen others yet not one of the staff members said a word to us. When we were admitted, we were sent to watch a movie which was already underway.  After that we were herded into a large room and told to wait there for 10 minutes. The guide then returned and spoke about the building for 5-10 min. and we were herded to another area with a picture of the theatre.  Construction was underway in that space making it difficult to listen as she spoke a bit more about the picture of the theater.  Ultimately, we were admitted to the theater for about 10 minutes to listen to and watch a performance for local school children.  We enjoyed these last 10 minutes in the theater, but that is about it.  I recommend visiting, but go to a performance rather than this overpriced tour.", "publishedDate": "2019-10-23", "language": "en", "rating": 2}, {"id": 720732963, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d190824-r720732963-Palace_of_Catalan_Music-Barcelona_Catalonia.html", "text": "We took the tour as the show times were not convenient for us. Still was worth the price.  We did have a demonstration of the pipe organ which was very nice.  There was something to be seen every where you looked.", "publishedDate": "2019-10-23", "language": "en", "rating": 5}, {"id": 720549392, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d190824-r720549392-Palace_of_Catalan_Music-Barcelona_Catalonia.html", "text": "Make time to visit, beautiful construction, magnificent interior. We were lucky to listen to an amazing chorus that was recording a show for European television. ", "publishedDate": "2019-10-22", "language": "en", "rating": 5}, {"id": 720504849, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d190824-r720504849-Palace_of_Catalan_Music-Barcelona_Catalonia.html", "text": "You have to take a walk inside the building and check out this place.  There is a small bar that sells food on the one end of it.  The exterior is also something wonderful to see !", "publishedDate": "2019-10-22", "language": "en", "rating": 5}, {"id": 720272651, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d190824-r720272651-Palace_of_Catalan_Music-Barcelona_Catalonia.html", "text": "Make sure you book a ticket for a musical performance at this work of art!  One of the wonders of the world!", "publishedDate": "2019-10-21", "language": "en", "rating": 5}, {"id": 720177175, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d190824-r720177175-Palace_of_Catalan_Music-Barcelona_Catalonia.html", "text": "We accidentally discovered this on a wander to the gotic area. Took the tour in the afternoon when everything was glistening. Heard choirs practicing for a competition and we were amazed but the acoustics. What a magical place.", "publishedDate": "2019-10-21", "language": "en", "rating": 5}, {"id": 720149866, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d190824-r720149866-Palace_of_Catalan_Music-Barcelona_Catalonia.html", "text": "The building is beautiful and the stained glass ceiling alone is worth the price of admission, but the tour we went on was a little dry.  My recomendation is to go to a show there and admire the architecture and beatiful ceiling while you enjoy the show.\nIn either case, you can't not visit here.  Unless architecture and music arent your thing.  In which case, save your money and go have some nice tapas.  ", "publishedDate": "2019-10-21", "language": "en", "rating": 4}, {"id": 719832094, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d190824-r719832094-Palace_of_Catalan_Music-Barcelona_Catalonia.html", "text": "We had a great guide, Marco. The Palau is very beautiful and the best part was that there was a choir practicing while we were there. They sang incredible harmonies a cappella.", "publishedDate": "2019-10-20", "language": "en", "rating": 5}, {"id": 719826093, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d190824-r719826093-Palace_of_Catalan_Music-Barcelona_Catalonia.html", "text": "Failing to get into La Sagrada Familia again, we opted instead to check out this wonderful gem of a building instead. We took the guided tour which included a short film about the origins of the Music Palace and the Orfeo Catalan choir. Fascinating to see old footage of Barcelona and uplifting to hear about the ethos of music for all combining with the craziness of Modernism/Art Nouveau. And the building is a gem. Fabulous and wild glassworks, ceramics and architecture. It shouldn't work but it does! The architect -Lluís Domènech i Montaner - was a mentor of Gaudì's and his design was full of imagination and social consideration. We went to a concert of film music that night. Not the greatest format, but wonderful nevertheless to experience the building in action. I thoroughly recommend a visit.", "publishedDate": "2019-10-20", "language": "en", "rating": 5}, {"id": 719722091, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d190824-r719722091-Palace_of_Catalan_Music-Barcelona_Catalonia.html", "text": "Great theatre inside and out, well worth attending a concert here. PRO TIP: they don't open the doors until the time listed on ticket, but come 30mins - an hour early in order to take some nice pictures in the lobby", "publishedDate": "2019-10-19", "language": "en", "rating": 4}, {"id": 719479737, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d190824-r719479737-Palace_of_Catalan_Music-Barcelona_Catalonia.html", "text": "We didn't get to attend a concert but did get tickets for the English tour.  Introductory film is great with all the old photos.  This is a wonder of a place.", "publishedDate": "2019-10-18", "language": "en", "rating": 5}, {"id": 719477267, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d190824-r719477267-Palace_of_Catalan_Music-Barcelona_Catalonia.html", "text": "The dancing is incredible!  I was stunned at the beauty of it - paraticularly the female roll, the shawl dance... she WAS the music!  spectacular!", "publishedDate": "2019-10-18", "language": "en", "rating": 5}, {"id": 719270266, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d190824-r719270266-Palace_of_Catalan_Music-Barcelona_Catalonia.html", "text": "The main chamber is impressive. The design is very elegant and focus on acoustics . When we were there a youth group was practicing for a competition that evening.\nSuggest check the schedule to buy tickets for a concert. They were sold out when we tried.", "publishedDate": "2019-10-17", "language": "en", "rating": 5}, {"id": 719221374, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d190824-r719221374-Palace_of_Catalan_Music-Barcelona_Catalonia.html", "text": "The architecture of this building is spectacular.  The tour is lovely. but what makes this tour special is being able to experience a performance after the tour.  When you book your tour be sure to see if your tour includes a performance afterwards.  Well worth your time.", "publishedDate": "2019-10-17", "language": "en", "rating": 5}]}}]