[{"locationId": 12661256, "name": "Plaja de Sant Sebastian", "placeType": "ATTRACTION", "reviewListPage": {"reviews": [{"id": 737567931, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d12661256-r737567931-Plaja_de_Sant_Sebastian-Barcelona_Catalonia.html", "text": "Quite a nice beach even in winters, having water cleaning facility, sand is thick, drys off quickly. Lot of food places near by. ", "publishedDate": "2020-01-07", "language": "en", "rating": 4}, {"id": 727403521, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d12661256-r727403521-Plaja_de_Sant_Sebastian-Barcelona_Catalonia.html", "text": "We had a little time our last evening, and decided to take a stroll at the Platja de Sant Sebastiá.  It was clean, not too crowded, and just right for us to toss our shoes and go for a little barefoot stroll in the shallow surf.  It was a great way to end our days in Barcelona.  ", "publishedDate": "2019-11-18", "language": "en", "rating": 5}, {"id": 722025114, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d12661256-r722025114-Plaja_de_Sant_Sebastian-Barcelona_Catalonia.html", "text": "A lovely morning stroll along here on our way to the Telefonica. Spotted some sea glass so paused for a while to try and sift some nice colours. The views toward the W hotel and along to the Olympic area are lovely too.\n\nIt was nice and quiet when we visited.", "publishedDate": "2019-10-28", "language": "en", "rating": 4}, {"id": 714439136, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d12661256-r714439136-Plaja_de_Sant_Sebastian-Barcelona_Catalonia.html", "text": "This is a very nice beach in the city of Barcelona however the amount of northern Africans and asian people selling beers, pareos, Mojito‘s and water Drive you totally nuts. Every minute and sometimes even Sooner they pass by and they are very pushy. So in the end you really get fed up.", "publishedDate": "2019-10-01", "language": "en", "rating": 3}, {"id": 691816905, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d12661256-r691816905-Plaja_de_Sant_Sebastian-Barcelona_Catalonia.html", "text": "Walked here from the Gothic area which takes about 20-30 mins. We popped into a supermarket to get some snacks and drinks but there are many people walking up and down the beach who will sell you a can of drink for €2 if you can’t be bothered to go back! We got 2 sun beds and an umbrella for €45, a single bed and umbrella was €30. We spent all day there so felt we got value for money. Good facilities there, plenty of loos, showers to rinse off. Just watch your possessions. We had an amazing massage from a Chinese lady €10 for 15mins, it was excellent.", "publishedDate": "2019-07-22", "language": "en", "rating": 5}, {"id": 656754273, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d12661256-r656754273-Plaja_de_Sant_Sebastian-Barcelona_Catalonia.html", "text": "Another part of the beach area along the coast it seems to get busier the further along you walk towards Port Vell with restaurants and bars to enjoy.", "publishedDate": "2019-03-06", "language": "en", "rating": 4}, {"id": 634039862, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d12661256-r634039862-Plaja_de_Sant_Sebastian-Barcelona_Catalonia.html", "text": "We enjoyed walking down the boardwalk along this beach as it was peaceful and calm that day. Only one person came up to us asking for money, so that's not bad, all things considered. All the shops and businesses were closed that day, I don't know why, but I can see it being a pretty happening place in the summer when it's warmer out.", "publishedDate": "2018-11-17", "language": "en", "rating": 4}, {"id": 602585420, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d12661256-r602585420-Plaja_de_Sant_Sebastian-Barcelona_Catalonia.html", "text": "Close to the city. 15 minutes walk from Barcelonetta metro station. Lifeguard, discreet beach bar, clean toilets, first aid station and tourist information help desk.", "publishedDate": "2018-08-04", "language": "en", "rating": 5}, {"id": 578800495, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d12661256-r578800495-Plaja_de_Sant_Sebastian-Barcelona_Catalonia.html", "text": "This is the main beach on the Eastern side of the cathedral promontory but the larger expanse of beach is to the West along the promenade. This is however a nice enough beach and has a number of good  bars and restaurants immediately behind it. In addition to the flat promenade walk to the West there is a shorter. hilly walk to the East to the Marina. (Port on maps). Along this walk you will pass another beach below the cliffs. Do not lookdown! This is the main nudist beach.", "publishedDate": "2018-05-08", "language": "en", "rating": 5}, {"id": 568135476, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d12661256-r568135476-Plaja_de_Sant_Sebastian-Barcelona_Catalonia.html", "text": "The beach was busy - but I still really enjoyed having a relaxing afternoon here at Platja San Sebastian after a full day of exploring the city. Stayed until dusk, and felt safe walking back to my accommodation (which was a 30min-walk away).", "publishedDate": "2018-03-22", "language": "en", "rating": 4}]}}]