[{"locationId": 8398821, "name": "Antic Hospital de la Santa Creu", "placeType": "ATTRACTION", "reviewListPage": {"reviews": [{"id": 751867240, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d8398821-r751867240-Antic_Hospital_de_la_Santa_Creu-Barcelona_Catalonia.html", "text": "Lots to see not too much walking so the kids wouldn't be bored; quite a few steps, which might be a problem for the mobile impaired.", "publishedDate": "2020-03-26", "language": "en", "rating": 4}, {"id": 728614834, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d8398821-r728614834-Antic_Hospital_de_la_Santa_Creu-Barcelona_Catalonia.html", "text": "This museum is absolutely fabulous! Explore it and succumb to the beauty they created for the patiens!", "publishedDate": "2019-11-24", "language": "en", "rating": 4}, {"id": 726389038, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d8398821-r726389038-Antic_Hospital_de_la_Santa_Creu-Barcelona_Catalonia.html", "text": "This was a highlight of our short visit to Barcelona. Just be careful to follow the map they give you as the audio guide can be misleading.", "publishedDate": "2019-11-14", "language": "en", "rating": 5}, {"id": 725732950, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d8398821-r725732950-Antic_Hospital_de_la_Santa_Creu-Barcelona_Catalonia.html", "text": "This hospital system was wonderful.  It is too bad all hospitals are not built with this philosophy in mind.", "publishedDate": "2019-11-11", "language": "en", "rating": 5}, {"id": 724525390, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d8398821-r724525390-Antic_Hospital_de_la_Santa_Creu-Barcelona_Catalonia.html", "text": "If we had hospitals like this in North America, we would be truly blessed.  The concept of healing, the gardens, the dormitories, the surgery - the entire atmosphere and environment of this hospital is astonishing.", "publishedDate": "2019-11-06", "language": "en", "rating": 5}, {"id": 719337012, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d8398821-r719337012-Antic_Hospital_de_la_Santa_Creu-Barcelona_Catalonia.html", "text": "What a beautiful hospital!  The tile work and detail is so amazing.  I took the audio guided tour and spent a couple hours wandering through the campus and buildings.  So beautiful and not at all crowded.  Well worth a visit!", "publishedDate": "2019-10-18", "language": "en", "rating": 5}, {"id": 715727169, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d8398821-r715727169-Antic_Hospital_de_la_Santa_Creu-Barcelona_Catalonia.html", "text": "We visited this place without the kids as they wanted time to explore the city before our planned visit to Sagrada Familia.\nSo glad I found this place whilst researching Barcelona. After Parc Guell (a bit disappointing because so much of it is out of bounds for renovation) we walked down from the free bus stop and we were amazed at the beauty of these old hospital buildings right in the heart of the city.\nThe stories told and the images show some great pieces of architecture. It is an oasis of calmness in the mad place that is Barcelona. It is tranquil and worth a trip for an hour or so. Great exhibits and it is being carefully restored to show what it was like when originally used as a hospital.\n\nGo now before it gets busy!", "publishedDate": "2019-10-06", "language": "en", "rating": 5}, {"id": 706358048, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d8398821-r706358048-Antic_Hospital_de_la_Santa_Creu-Barcelona_Catalonia.html", "text": "It you are looking from the outside you can not imagine how amazing it is from the inside. For me it is a must to see. We spent there the whole day", "publishedDate": "2019-09-04", "language": "en", "rating": 5}, {"id": 705679644, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d8398821-r705679644-Antic_Hospital_de_la_Santa_Creu-Barcelona_Catalonia.html", "text": "We arranged a private tour of both the Segrada Familia and the Antic Hospital.  The Antic was fascinating.  The restoration was impeccable.  The tile work and mosaics were amazing to me.  The Antic was a working hospital through the last decade until it was replaced by a new hospital nearby.  The hospital was built for the poor by a wealthy banker (of course) and his vanity was obvious given the opulence of the structure.  For those interested in history and the history of science of medicine, this is a must see.", "publishedDate": "2019-09-02", "language": "en", "rating": 4}, {"id": 704005260, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d8398821-r704005260-Antic_Hospital_de_la_Santa_Creu-Barcelona_Catalonia.html", "text": "Until a few years ago a working hospital. Lots of history. Highly recommended place to visit. Guided there by a doctor that used to work there", "publishedDate": "2019-08-28", "language": "en", "rating": 5}, {"id": 696079596, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d8398821-r696079596-Antic_Hospital_de_la_Santa_Creu-Barcelona_Catalonia.html", "text": "If you are visiting Sagrada Familia, you should definitely make the extra journey up the road to see this place. Amazing old building part of the modernist architecture movement.", "publishedDate": "2019-08-06", "language": "en", "rating": 5}, {"id": 684973270, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d8398821-r684973270-Antic_Hospital_de_la_Santa_Creu-Barcelona_Catalonia.html", "text": "This is a rambly old hospital complex in Raval, famously the place where Gaudi breathed his last after being struck by an buw while crossing the road. It is a very old complex with the attendant charming architecture. It may be charming to look at but I imagine that it would have been less charming back in the day to be a patient there. For me, the real star of the show is El Jardi, a gorgeous garden café on the quadrangle of the hospital complex, where you can sit among the raised garden and eat delicious food. I loved my visit here where I had a lovely simple tomato salad with hummus and a divine glass of Rose. Do look out for this place, it's really lovely and well worth a visit.", "publishedDate": "2019-06-28", "language": "en", "rating": 5}, {"id": 673695181, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d8398821-r673695181-Antic_Hospital_de_la_Santa_Creu-Barcelona_Catalonia.html", "text": "We just happened on to this place waiting for our tour os Sagrada Familia.  We loved it, gorgeous buildings that are not completely renovated.  Well worth a tour.", "publishedDate": "2019-05-13", "language": "en", "rating": 5}, {"id": 672949302, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d8398821-r672949302-Antic_Hospital_de_la_Santa_Creu-Barcelona_Catalonia.html", "text": "Beautiful and well worth the visit. Make the effort to see this building and the well preserved details inside", "publishedDate": "2019-05-10", "language": "en", "rating": 5}, {"id": 660383815, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d8398821-r660383815-Antic_Hospital_de_la_Santa_Creu-Barcelona_Catalonia.html", "text": "Many pictures and reviews are from Recinte Modernista de Sant Pau, Barcelona. But this is not that hospital. It is much less attractive. The restaurant is good. If you walk by, then check it out, but the other old hospital is the must see gem of Barcelona, and not this one.", "publishedDate": "2019-03-22", "language": "en", "rating": 3}, {"id": 646889823, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d8398821-r646889823-Antic_Hospital_de_la_Santa_Creu-Barcelona_Catalonia.html", "text": "It was hot but I hopped off at this Hospital - because I am a doctor Perhaps - But was so happy I did. These guys who built it had a amazing vision - as they say a Palace as a Hospital for the poor ! - so well planned and executed - with beautiful gardens and building - well ventilated and with natural light - with a underground connecting tunnel . Was Awed ! If you have even a bit of interest in architecture or medicine a must visit.", "publishedDate": "2019-01-18", "language": "en", "rating": 5}, {"id": 644975553, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d8398821-r644975553-Antic_Hospital_de_la_Santa_Creu-Barcelona_Catalonia.html", "text": "The architecture was interesting at the Antic Hospital de la Santa Creu, but I would return for the restaurant in the complex. It had a great atmosphere. Nestled in the central patio, you get a taste of history just sitting there.", "publishedDate": "2019-01-10", "language": "en", "rating": 5}, {"id": 637095010, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d8398821-r637095010-Antic_Hospital_de_la_Santa_Creu-Barcelona_Catalonia.html", "text": "A must see with the audio guide. Incredible hospital ideas and execution. Beautiful buildings decorations. Great views.", "publishedDate": "2018-12-02", "language": "en", "rating": 5}, {"id": 625118175, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d8398821-r625118175-Antic_Hospital_de_la_Santa_Creu-Barcelona_Catalonia.html", "text": "The magnificency of catalan empire during midle age is shown in the civil buildings, hospital, palaces, drassanes", "publishedDate": "2018-10-15", "language": "en", "rating": 5}, {"id": 620568900, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d8398821-r620568900-Antic_Hospital_de_la_Santa_Creu-Barcelona_Catalonia.html", "text": "Dont mix this place up with the other hospital near the Sagrada Familia. This beautiful ancient complex  is located near the market behind the Ramblas. Check for special times (only two days a week)  when you can reserve a tour to visit the ancient Pharmacy and the autopsy table amphitheater as well as other interesting rooms in this complex. Tours can be done in English if requested, also provided are taped earphone guides to listen to as well.  These are relatively new areas just opened to the public at this old hospital complex (where Gaudi died). Friendly staff of knowledgeable people. Tour includes two different locations in this complex- the ancient pharmacy building as well as the amphitheater building area. (both close to each other in the complex) Worth a visit.", "publishedDate": "2018-09-29", "language": "en", "rating": 5}, {"id": 613370548, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d8398821-r613370548-Antic_Hospital_de_la_Santa_Creu-Barcelona_Catalonia.html", "text": "It is a group of old building in a courtyard located in the  city center. Other buildings are the library and the official building of the State of Catalonya. There is a cafe bar in the complex. In the summer time, it  is a very cool place to sit and visit. The garden is decorated by ponds and fountains. Due to the restoration work, I couldn't visit the whole area.", "publishedDate": "2018-09-03", "language": "en", "rating": 5}, {"id": 609120020, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d8398821-r609120020-Antic_Hospital_de_la_Santa_Creu-Barcelona_Catalonia.html", "text": "Not to be confused with Hospital de la Santa Creu i Sant Pau (Recinte Modernista de Sant Pau), which is about 1km north of La Sagrada Familia.\n\nI visited this place since my hotel is nearby. Building is unassuming. When I was there, the entire place was quiet  with only a few  visitors. It is OK to drop by if you are in this area, but not worth to make a special trip here.", "publishedDate": "2018-08-22", "language": "en", "rating": 3}, {"id": 606415808, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d8398821-r606415808-Antic_Hospital_de_la_Santa_Creu-Barcelona_Catalonia.html", "text": "it's nice for some coffee in a hot evening, but don't expect to see something spectacular. The food is quite good too", "publishedDate": "2018-08-14", "language": "en", "rating": 3}, {"id": 605603996, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d8398821-r605603996-Antic_Hospital_de_la_Santa_Creu-Barcelona_Catalonia.html", "text": "I enjoyed visiting this old hospital. It was strange as I originally has not wanted to visit but on the insistence of a family memory, I relented.\n\nI was glad afterwards as it was an amazing place to visit. It has some nice gardens and shows how a patient could relax during his phase of recuperation.\n\nWell worth a visit.", "publishedDate": "2018-08-12", "language": "en", "rating": 5}, {"id": 594598669, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d8398821-r594598669-Antic_Hospital_de_la_Santa_Creu-Barcelona_Catalonia.html", "text": "It's good to have a look at it before you see the new Hospital de la Santa Creu and Sant Pau.\nLots of homeless people there in the evening...", "publishedDate": "2018-07-09", "language": "en", "rating": 4}, {"id": 584951584, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d8398821-r584951584-Antic_Hospital_de_la_Santa_Creu-Barcelona_Catalonia.html", "text": "This place is near the market and La Rambla, not another former hospital near La Sagrada Familia. It is just a huge stone building without many things to offer. One may even pass by without realizing this structure.", "publishedDate": "2018-06-03", "language": "en", "rating": 3}, {"id": 573431237, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d8398821-r573431237-Antic_Hospital_de_la_Santa_Creu-Barcelona_Catalonia.html", "text": "At the very city center, just in front of the so called Teatre Romea. Acces to the square and enjoy the calmed ambiance, take a seat at the restaurant (if you are lucky today), and let time go by.\n\nA book would be a very nice partner", "publishedDate": "2018-04-15", "language": "en", "rating": 4}, {"id": 505526824, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d8398821-r505526824-Antic_Hospital_de_la_Santa_Creu-Barcelona_Catalonia.html", "text": "As the last person has said, this site is the 600 year old hospital in El Raval, not the Domenech design near Sagrada Familia.  Both are great visits but totally different.  This is amazing to realize Barcelona was solving health care 600 years ago when they created a massive complex in the El Raval (see jardins Rubio i Lluch) neighborhood which had just been incorporated in the new walls of the time.  Visiting this gothic structure was great stop.  Those of you who have also been to Sant Pau Recinte will also recognize the cross statue that has been replicated in the middle of that site.  The current site house part of the Library of Catalonia as well as the Gardens of Rubio and Lluch.  \n\nIt is also the former site indigent hospital that occupied the buildings after the hospital moved.  The indigent hospital for the city's poor in the heart of the city is where Gaudi died after being struck by a car.", "publishedDate": "2017-07-25", "language": "en", "rating": 4}, {"id": 487515444, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d8398821-r487515444-Antic_Hospital_de_la_Santa_Creu-Barcelona_Catalonia.html", "text": "There are two sites in Barcelona with similar sounding names, and they are two very different places!  Most of the reviews, photos and even the TripAdvisor location map on this webpage actually relate to a place called Sant Pau Recinte Modernista, or in some guidebooks called Recinte Modernista de Sant Pau.  It is located within walking distance of the Sagrada Familia, at Carrer Sant Antoni Maria Claret 167.  It is a very worthwhile visit, with elaborate art-deco style architecture, and has its own TripAdvisor webpage with reviews.  One of the buildings at the Sant Pau Recinte Modernista used to be a hospital, resulting in the confusion.  \nThe Antic Hospital de la Santa Creu i Sant Pau is a low-key collection of ancient buildings with gothic architecture and some of which date back to the 15th century.  It is located near The Rambla, at Carrer Hospital 56. The buildings surround a dusty courtyard, a small fountain and a statue.  Not much to see here.  I understand there is a museum in one of the buildings which is open on Wednesday mornings.", "publishedDate": "2017-05-24", "language": "en", "rating": 2}, {"id": 481903828, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d8398821-r481903828-Antic_Hospital_de_la_Santa_Creu-Barcelona_Catalonia.html", "text": "Extremely interesting place, it was a hospital built by an architect modernist. It is currently a museum, I strongly recommend it.", "publishedDate": "2017-05-05", "language": "en", "rating": 5}, {"id": 472516006, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d8398821-r472516006-Antic_Hospital_de_la_Santa_Creu-Barcelona_Catalonia.html", "text": "Such a beautiful set of buildings and history of medicine can be found at this site. It is a hidden gem of Barcelona and it seemed to us that it had not yet been discovered as we were able to walk around with ease (unlike the Guadi sites).\n\nTe detail of old azulejos (tiles) and the detail being put into restoration is incredible.  One can only imagine having been a patient hundreds of years ago and having such a calm place to seek.\n\nDefinitely go out of your way to visit.  You will not be dissapointed.", "publishedDate": "2017-04-03", "language": "en", "rating": 5}, {"id": 468061652, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d8398821-r468061652-Antic_Hospital_de_la_Santa_Creu-Barcelona_Catalonia.html", "text": "It is the oldest hospital in Barcelona. But you can find more other interesting building in Barcelona. There was only small square opened.\nProbably not lepton schedule best.", "publishedDate": "2017-03-17", "language": "en", "rating": 3}, {"id": 463248521, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d8398821-r463248521-Antic_Hospital_de_la_Santa_Creu-Barcelona_Catalonia.html", "text": "It is a pity that this is not one of the most visited places in Barcelona.  I was left speechless from its beauty, the details of every room and hall and its history.  You DO NOT want to miss this when in Barcelona.", "publishedDate": "2017-02-27", "language": "en", "rating": 5}, {"id": 462967218, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d8398821-r462967218-Antic_Hospital_de_la_Santa_Creu-Barcelona_Catalonia.html", "text": "Move away from the Sagrada Familia onto the Avenida Gaudi towards this amazing 'old hospital' premises. Clean and very beautiful buildings explaining the history of this hospital in Barcelona. Very nice and clean gardens around the buildings with lot's of tranquil places to sit outside. One of the new best kept secrets, not so touristy yet (a must see for frequent BCN travelers looking for something new!)", "publishedDate": "2017-02-26", "language": "en", "rating": 5}, {"id": 460686109, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d8398821-r460686109-Antic_Hospital_de_la_Santa_Creu-Barcelona_Catalonia.html", "text": "We made the walk from the Sagrada familia (by the Avenida de Gaudi) which is in itself a nice stroll (many people enjoying the sun on wooden benches). First you discover the beautiful art deco main building (many details) and after coming in, it appears to be quite a big terrain, with many buildings, a beautiful garden with orange trees etc. And the most striking was: hardly any tourist to be seen! An oasis in the hectic city.", "publishedDate": "2017-02-17", "language": "en", "rating": 5}, {"id": 405887972, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d8398821-r405887972-Antic_Hospital_de_la_Santa_Creu-Barcelona_Catalonia.html", "text": "Want a place to get away from the tourist crowds on the Ramblas? Come here to the courtyard. Free admission. Bring your sandwich and sit in the porticos or at the small tables in the yard. It's shaded, quiet, and attractive to the eye. Local workers go there to have their lunches and/or to rest under the colonades. There's also a little place to purchase food and drink. But the marvel of the place is it's peace. The courtyard feels undiscovered.", "publishedDate": "2016-08-15", "language": "en", "rating": 4}, {"id": 377657284, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d8398821-r377657284-Antic_Hospital_de_la_Santa_Creu-Barcelona_Catalonia.html", "text": "It's close to Sagrada Familia Church, so as you finish your tour at the famous church go to check this. Go on Mondays, it's free of charge. You can walk and see the buildings inside. Great architecture, well decorated and rich in details. Don't be worried in case you see a queue. It will take 5 minutes to get inside, it's worth waiting for.", "publishedDate": "2016-05-29", "language": "en", "rating": 4}, {"id": 359758144, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d8398821-r359758144-Antic_Hospital_de_la_Santa_Creu-Barcelona_Catalonia.html", "text": "This complex of Modernist buildings is an architectural gem. Visiting in March, there were many orange trees with fruit in the courtyard. The ornate mosaics, murals, and statuary are spectacular. Entrance fees include discounts for various age groups and free admission for teachers.", "publishedDate": "2016-03-29", "language": "en", "rating": 5}, {"id": 328163751, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d8398821-r328163751-Antic_Hospital_de_la_Santa_Creu-Barcelona_Catalonia.html", "text": "It's only a matter of time until tourists discover what a gem this old, beautifully renovated hospital is. Visit while it is not yet horribly overcrowded like most Barcelona sights. I personally enjoyed it much more than e.g. Park Guell. Lots of interesting information and fascinating to learn more about the concept of building hospital where patience are not only healed by (at the time) modern treatment, but harmonious surroundings and art.", "publishedDate": "2015-11-21", "language": "en", "rating": 5}, {"id": 326339621, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d8398821-r326339621-Antic_Hospital_de_la_Santa_Creu-Barcelona_Catalonia.html", "text": "This is an amazing place from a historical and architectural perspective.  You first of all have to get your mind around the fact this hospital was started in 1401 with a complete underground tunnel system for transporting patients and supplies, and above ground an architectural masterpiece that served as a hospital into the 20th century!", "publishedDate": "2015-11-12", "language": "en", "rating": 5}, {"id": 325570150, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d8398821-r325570150-Antic_Hospital_de_la_Santa_Creu-Barcelona_Catalonia.html", "text": "Very nice facility - in former times a Hospital - which is absolute worth to visit. Very impressive construction inside and as well outside. I was invited for a excellent aperitivo and tapas dinner - great atmosphere and great service.", "publishedDate": "2015-11-09", "language": "en", "rating": 5}, {"id": 312392336, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d8398821-r312392336-Antic_Hospital_de_la_Santa_Creu-Barcelona_Catalonia.html", "text": "Another must see. Easily reached and beautifully designed in a playful manner it shows what can be done if a significant percentage of the build cost goes in decoration! Many photo opportunities.", "publishedDate": "2015-09-21", "language": "en", "rating": 5}, {"id": 309775309, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d8398821-r309775309-Antic_Hospital_de_la_Santa_Creu-Barcelona_Catalonia.html", "text": "I must begin by saying we were here in an appalling thunderstorm, so we were unable to take advantage of the gardens. We did visit the 3 buildings open and admired the architecture and work done on restoring them. They are impressive, but then we find they have closed 1 wing of the admin building, which strangely does not get mentioned when you pay for the tickets! So you lose one star.\nIts worth going to see, but there is not a lot there.", "publishedDate": "2015-09-13", "language": "en", "rating": 4}, {"id": 302996951, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d8398821-r302996951-Antic_Hospital_de_la_Santa_Creu-Barcelona_Catalonia.html", "text": "I liked it here as away from the packed tourist area of around La Sagrada Familia it seemed less people knew about this. Was about 5euros to get in and was well worth it! Really pretty buildings and nice to walk around.", "publishedDate": "2015-08-24", "language": "en", "rating": 5}]}}]