[{"locationId": 3480069, "name": "Villa del Arte Galleries", "placeType": "ATTRACTION", "reviewListPage": {"reviews": [{"id": 673619011, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d3480069-r673619011-Villa_del_Arte_Galleries-Barcelona_Catalonia.html", "text": "This gallery and the second in Barcelona and also their gallery in Amsterdam are brilliant. The art is magnificent and different the people are knowledgable and friendly especially their new guy in Amsterdam. A brilliant retail gallery of the highest quality.", "publishedDate": "2019-05-13", "language": "en", "rating": 5}, {"id": 601301855, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d3480069-r601301855-Villa_del_Arte_Galleries-Barcelona_Catalonia.html", "text": "It’s a small gallery that is selling Gaudi gifts and souvenirs. I enjoyed going, but it isn’t extra special. If you are looking for specifIc Guadi treasure to take home this is the place to go. ", "publishedDate": "2018-07-30", "language": "en", "rating": 3}, {"id": 578969681, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d3480069-r578969681-Villa_del_Arte_Galleries-Barcelona_Catalonia.html", "text": "While We were exploring the narrow streets of Gothic Quarter we discovered this fantastic art gallery. The owners are very polite people, they invited us inside which turned out to be a great idea.. You need to see this gallery if you are in Barcelona", "publishedDate": "2018-05-09", "language": "en", "rating": 5}, {"id": 553928154, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d3480069-r553928154-Villa_del_Arte_Galleries-Barcelona_Catalonia.html", "text": "Really enjoyed coming back to this gallery after 4 years. Though it is small, the artists exhibited are always a delight and there is always someone friendly and attentive to answer any questions (and be patient with my poor Spanish). Will certainly be back again!", "publishedDate": "2018-01-15", "language": "en", "rating": 5}, {"id": 399693347, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d3480069-r399693347-Villa_del_Arte_Galleries-Barcelona_Catalonia.html", "text": "Very colorful and eye-catching experience, it is very romantic and suitable for a date. Will definitely visit this gallery again.", "publishedDate": "2016-07-31", "language": "en", "rating": 5}, {"id": 388426938, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d3480069-r388426938-Villa_del_Arte_Galleries-Barcelona_Catalonia.html", "text": "I really enjoyed the paintings there., and the lady working there was so helpful, and gave me lots of information about the paintings, keeping a happy smile on her face. I liked it so much", "publishedDate": "2016-07-02", "language": "en", "rating": 5}, {"id": 373022184, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d3480069-r373022184-Villa_del_Arte_Galleries-Barcelona_Catalonia.html", "text": "This little place is just besides the huge cathedral. It takes just a couple of minutes to check it out, it's free of charge, and I found there a couple of works I really liked ", "publishedDate": "2016-05-15", "language": "en", "rating": 4}, {"id": 299301840, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d3480069-r299301840-Villa_del_Arte_Galleries-Barcelona_Catalonia.html", "text": "A beautiful gallery, cool artists, amazing works, free entrance. When I visited they had a mixed show with paintings, photos and sculptures by contemporary artists from Spain and from all over the world. A very cool sculpture garden with large scale stainless steel sculptures by Julio Nieto. The vibrant paintings by Francoise Nielly with their striking colors, together with the crazy hyperphotos of Jean-Francois Rauzier, truely a wonderful experience.", "publishedDate": "2015-08-14", "language": "en", "rating": 5}, {"id": 272619086, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d3480069-r272619086-Villa_del_Arte_Galleries-Barcelona_Catalonia.html", "text": "Great location next to Catedral Barcelona, this small but airy and pretty well lit gallery had a nice display of magnificent works from local artists.", "publishedDate": "2015-05-17", "language": "en", "rating": 5}, {"id": 213573978, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d3480069-r213573978-Villa_del_Arte_Galleries-Barcelona_Catalonia.html", "text": "A true gem in the heart of gothic Barcelona!\nBeautiful exhibition of the French photographer Jean Francois Rauzier\nI found them because I was \"lured\" in by the sculptures in their garden, amazing!\nInside, not big, a friendly woman greeted me and asked if I needed info on the works.\nI was happy she spoke english.. my Spanish is not existing..\nThe space has a backwall that is the old Roman city wall of Barcino!\nGreat contrast to see these big modern pieces on such a historical site!!\n\nCongratulations, and hope to come by soon!!", "publishedDate": "2014-07-04", "language": "en", "rating": 5}]}}]