[{"locationId": 9465523, "name": "Monumento Al Doctor Andreu", "placeType": "ATTRACTION", "reviewListPage": {"reviews": [{"id": 689531795, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d9465523-r689531795-Monumento_Al_Doctor_Andreu-Barcelona_Catalonia.html", "text": "This monument stands in tribute to Bartholomew Robert, a Spanish doctor and Catalan Nationalist. His chief legacy seems to have been simply service to the city of Barcelona having served as mayor of the city as well as being a representative of the Corte Generales, or simply the bicameral legislative assembly of Spain.\n \nThis monument is located in Plaça de Tetuan and features a tree like base supporting a sculptural group of individual surrounding the bust of Bartholomew Robert. The surrounding sculptures represent abstractions different groups across the socio-economic strata, such as peasants and workers, politicians, intellectuals and clergymen. The latter appears to be draped in a Catalan flag. At the centre of the monument is aforementioned bust which is being embraced by a woman, weeping at the death of the Catalan.\n\nIt’s a very elaborate sculpture in keeping with the Catalan Modernism in which it was created. If you visit, note the tree-like base is very similar to the “tree” like pillars in Sagrada Familia.\n\nI wouldn’t go out of the way unless you happen to be Catalan or in the area, but it’s a good sculpture.", "publishedDate": "2019-07-14", "language": "en", "rating": 5}, {"id": 628050401, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d9465523-r628050401-Monumento_Al_Doctor_Andreu-Barcelona_Catalonia.html", "text": "We chanced upon Placa De Tetuán as we were wandering around this part of town and couldn't resist visiting this nice little place and view the stunning monument. \nSculpured  by Josef Llimona,it's dedicated to the great man, a leading professor of internal pathology at the University Of Barcelona, he was also mayor of Barcelona in 1899 and elected to the Spanish Parliament in 1901.\nThe statue is well detailed and there's some nice bench seating to take in the great looking monument, surprisingly it's in the middle of a roundabout but it's really tranquil. \nEasy to locate on Plaça De Tetuán and if your in the area well worth checking out. ", "publishedDate": "2018-10-25", "language": "en", "rating": 5}]}}]