[{"locationId": 246168, "name": "Mirador de Colom", "placeType": "ATTRACTION", "reviewListPage": {"reviews": [{"id": 751416487, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d246168-r751416487-Mirador_de_Colom-Barcelona_Catalonia.html", "text": "This is a plaza with an imposing monument in honour to Christopher Columbus with a beautiful view of the coast of Barcelona, being close to either Las Ramblas (right at the end of this avenue) or Barceloneta, with the beach and the marina. It is worth the visit to know the place and take good photos.", "publishedDate": "2020-03-19", "language": "en", "rating": 4}, {"id": 751292147, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d246168-r751292147-Mirador_de_Colom-Barcelona_Catalonia.html", "text": "If you are at Las Ramblas then try your best to walk all the way to the end toward the sea and pay homage to Christoper Colombus. The Columbus monument was beautiful constructed with Columbus pointing at the sea. His journey finding Americas was depicted in difference scenes at the base. You could even go up to the top of the monument to have a a bird eye view of the coast (I didn't go up as there's a queue there that day and it was moving really slow). Continue to walk toward the sea and take in the beautiful & peaceful scene. This is a good place to watch sunset too.", "publishedDate": "2020-03-18", "language": "en", "rating": 4}, {"id": 751236571, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d246168-r751236571-Mirador_de_Colom-Barcelona_Catalonia.html", "text": "The tower is located in a nice part of the city, near the marina and one end of La Rambla. There are lots of restaurants and a shopping mall if you walk along the pier.. We went to the top of tower (there is a fast but small lift - have to wait in busy times) and there is good view of the city from there (but you get a better view from the Montjuic castle grounds)  Not worth the money and time we spent, in my opinion.", "publishedDate": "2020-03-17", "language": "en", "rating": 3}, {"id": 744452179, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d246168-r744452179-Mirador_de_Colom-Barcelona_Catalonia.html", "text": "This statue of Columbus is located at the bottom of Las Ramblas at a very busy intersection. Can't miss it if you are walking around town. Not easy to take good pictures since the statue is very tall.", "publishedDate": "2020-02-11", "language": "en", "rating": 4}, {"id": 744141035, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d246168-r744141035-Mirador_de_Colom-Barcelona_Catalonia.html", "text": "Initially dismissed this attraction as just another place to view the city but used a 2-4-1 tourist voucher and took advantage of the wine cellar offer so only cost 8 euros for the two of us. \nA speedy lift took us to the top and there's a circular viewing area to walk around to get panoramic views of the city and along the coast. If you're not good with heights (like me) then it does feel claustrophobic but luckily we were only ones there.\nSpecial mention to Clooney (hope got his name right) for pointing out the sights and being really friendly. Gave us the challenge of finding Superman on the rooftops!!\nOnly gripe is the viewing windows could do with a clean for better views.\nDefinitely recommend visiting if in the area.", "publishedDate": "2020-02-10", "language": "en", "rating": 4}, {"id": 739262944, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d246168-r739262944-Mirador_de_Colom-Barcelona_Catalonia.html", "text": "This 60m, 19th century monument has lift to platform at 51m that offers great view of Barcelona. At top there is statue od explorer", "publishedDate": "2020-01-15", "language": "en", "rating": 5}, {"id": 738971120, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d246168-r738971120-Mirador_de_Colom-Barcelona_Catalonia.html", "text": "Classic Barcelona sights, you shouldn't miss it when visiting the capital. Don’t hesitage visit this place.", "publishedDate": "2020-01-13", "language": "en", "rating": 5}, {"id": 738686342, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d246168-r738686342-Mirador_de_Colom-Barcelona_Catalonia.html", "text": "The statue of Christopher Columbus at this location is worth passing by if you are in the area of Port Vell.", "publishedDate": "2020-01-12", "language": "en", "rating": 3}, {"id": 737535694, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d246168-r737535694-Mirador_de_Colom-Barcelona_Catalonia.html", "text": "It's just like any other round about but with a tall statue in between with some Lions on the side. Nothing much to see or do there, beach is near by, so good for a  beach. Don't buy any skip the line ticket or anything, u will be wasting money anyways. U can walk down here from La rambla and can see in city bus tour. Nothing special ", "publishedDate": "2020-01-07", "language": "en", "rating": 3}, {"id": 735337244, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d246168-r735337244-Mirador_de_Colom-Barcelona_Catalonia.html", "text": "Love it!!!!!!!!! Christopher Columbus, just fantabulous. Adore this huge statue in a fantastic location.", "publishedDate": "2019-12-29", "language": "en", "rating": 5}, {"id": 735335556, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d246168-r735335556-Mirador_de_Colom-Barcelona_Catalonia.html", "text": "Quite an intimidating stair of the absolutely fantastic Christopher Columbus. It is bigger than you think.", "publishedDate": "2019-12-29", "language": "en", "rating": 5}, {"id": 734422601, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d246168-r734422601-Mirador_de_Colom-Barcelona_Catalonia.html", "text": "Location: South of Las Ramblas, you can't miss it. \nPrice: 6E for adults. \n\nThe price gives you access to a lift, which takes you straight up to the dome. It's not a huge dome but gives you a southern view of the city and harbour/pier. Turo de la Rovia in the north offers a free and better view.", "publishedDate": "2019-12-24", "language": "en", "rating": 4}, {"id": 733133749, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d246168-r733133749-Mirador_de_Colom-Barcelona_Catalonia.html", "text": "Mirador de Colom Barcelona on the beginning of the La Rambla street ,take some pictures there with friends or family.", "publishedDate": "2019-12-16", "language": "en", "rating": 5}, {"id": 732821537, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d246168-r732821537-Mirador_de_Colom-Barcelona_Catalonia.html", "text": "On the way to the sea, you will be on this placa and you will see the big statue of Colombus showing the New World.", "publishedDate": "2019-12-15", "language": "en", "rating": 5}, {"id": 729987681, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d246168-r729987681-Mirador_de_Colom-Barcelona_Catalonia.html", "text": "A plaza at the end of Las Ramblas, wasn't really anything special, not really a destination more something to plan to go through whilst walking around. A nice square with an interesting column.", "publishedDate": "2019-12-01", "language": "en", "rating": 3}, {"id": 728888127, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d246168-r728888127-Mirador_de_Colom-Barcelona_Catalonia.html", "text": "Statue of Christopher Columbus (Barcelona Mirador de Colom) is a 200-foot column near the cruise port looking out at the waterfront at the foot of the main drag of Las Ramblas.  Theoretically this is the place where Columbus set ashore in 1493 after discovering the New World.  Many people make fun of the statue, because Columbus holding a scroll is pointing not to the New World as might be expected, but depending on who you ask it is pointing to Mallorca or to Libya.  There is a tourist information office in its base.  I did not find them nice or helpful.", "publishedDate": "2019-11-25", "language": "en", "rating": 3}, {"id": 727404006, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d246168-r727404006-Mirador_de_Colom-Barcelona_Catalonia.html", "text": "This plaza is at the bottom of the Rambla, has an easy access point to the metro, and is the hub of activity as you enter the Gothic Quarter.  There are several people selling things, any folks coming and going, so requires a little bit of care in getting around.  We found a fairly quiet place to sit down for a short rest and snack.  It is not the best place for that in Barcelona, but is an important place to contemplate Cristobal Colon’s adventures.", "publishedDate": "2019-11-18", "language": "en", "rating": 4}, {"id": 727361649, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d246168-r727361649-Mirador_de_Colom-Barcelona_Catalonia.html", "text": "This tall Columbus monument is close to the bay area. I didn't knew you could go up to the top inside it, so I didn't do it.", "publishedDate": "2019-11-18", "language": "en", "rating": 4}, {"id": 724577114, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d246168-r724577114-Mirador_de_Colom-Barcelona_Catalonia.html", "text": "The statue  is right across the bay. Iwe sat down  with ice cream and enjoyed the beautiful scenery.  It is a really neat statue.  The hop on and off bus stops here or you can walk along the Ramblas street.  So many things to see along the street.  ", "publishedDate": "2019-11-06", "language": "en", "rating": 5}, {"id": 723579335, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d246168-r723579335-Mirador_de_Colom-Barcelona_Catalonia.html", "text": "This open square is near the port and is the heart of much of the tourism of this bustling city.  All the cruise ship people pass through here several times and the restaurants near here cater to them.", "publishedDate": "2019-11-03", "language": "en", "rating": 4}, {"id": 723062325, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d246168-r723062325-Mirador_de_Colom-Barcelona_Catalonia.html", "text": "Don't miss a very inexpensive way to see beautiful Barcelona. First go down the stairs by the base of the monument.... and enjoy a glass of wine! After take the elevator up to the top. It is small, not a large walkway but beautiful.", "publishedDate": "2019-11-01", "language": "en", "rating": 5}, {"id": 722616028, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d246168-r722616028-Mirador_de_Colom-Barcelona_Catalonia.html", "text": "After riding the cable car, the height nervous in the family had had enough. As I understand it you can go up the column to see the views of the city from within the Christopher Columbus monument. \nWe contented ourselves with looking at the lovely sculpture and monument of the explorer pointing out to sea.", "publishedDate": "2019-10-30", "language": "en", "rating": 5}, {"id": 722613681, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d246168-r722613681-Mirador_de_Colom-Barcelona_Catalonia.html", "text": "The plaza is at the bottom of the Ramblas and leads to port Vell and Barceloneta. In the centre is the monument to Columbus, pointing out to sea.", "publishedDate": "2019-10-30", "language": "en", "rating": 5}, {"id": 721819489, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d246168-r721819489-Mirador_de_Colom-Barcelona_Catalonia.html", "text": "It dominates the lower reaches of Las Ramblas and is easily seen from all parts of the harbour yet the Columbus statue doesnt seem to generate the same amount of tourist interest yet I found the statue diverting enough to want to climb to the top but I would pick the day the operaters were on general strike due to the local demonstrations , oh well next time.", "publishedDate": "2019-10-27", "language": "en", "rating": 4}, {"id": 721265777, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d246168-r721265777-Mirador_de_Colom-Barcelona_Catalonia.html", "text": "Also known as Mirador De Colom Barcelona in Spanish. It is situated at the Port Vell marina. (End of La Rambla Street). There is a statue of Columbus at the top of the 60m column. I wondered who Columbus is pointing to and I googled, let me answer for you \"Columbus is often thought to be pointing his right hand towards the New World while holding a map in the left. His hand is pointing east towards Columbus's home city of Genoa.\"\n\nThe Columbus monument was built to honor the 400th anniversary of the discovery of America. Columbus presented his findings to the Catholic monarchs of Spain, Queen Isabella of Castile and King Ferdinand of Aragon, after discovering the Americas. \n\nColumbus stands on a globe with the inscription 'Tierra' which means earth. The base on the column you can find scenes from Columbus' first voyage to the Americas.\n\nThe Gothic Quarter is where Christopher Columbus was received by the Catholic Monarchs after his first voyage to the New World.\n\nWhile visiting La Rambla, you can check out this too.", "publishedDate": "2019-10-25", "language": "en", "rating": 3}, {"id": 720222778, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d246168-r720222778-Mirador_de_Colom-Barcelona_Catalonia.html", "text": "Looking at this skinny monument you wonder, how am I getting to the top of it.  The smallest elevator squeezes up the center of this narrow column to the top where you get out on a narrow landing that has a great view of the city.  It is very old and I swore the thing was toppeling over while we were up there, but it was definitely fun and very worth it.  The staff was very informative and friendly.  \nI'm curious what will become of this monument if Catalonians' views on Columbus change as some Americans' have.  Moving it would not be an easy option.", "publishedDate": "2019-10-21", "language": "en", "rating": 4}, {"id": 717295863, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d246168-r717295863-Mirador_de_Colom-Barcelona_Catalonia.html", "text": "Visited this lesser known attraction the last time I was in Barcelona (I've been to Barcelona at least 15 times and only found out about it fairly recently). The lookout itself was nothing to write home about: a bit cramped and views were somewhat obstructed by the structure. That said, paying a mere 6 euros for the views (especially of La Rambla) was worth it. The type of place that you spend 5 minutes and get some good photos.", "publishedDate": "2019-10-11", "language": "en", "rating": 4}, {"id": 716041100, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d246168-r716041100-Mirador_de_Colom-Barcelona_Catalonia.html", "text": "This monument is at the end of Las Ramblas near the marina. There is a place on the base where you can go in and buy tickets to go up and look out. It’s open MON-SUN. 8:30 am - 8:30pm. Last ride up at 8pm. Adults 6 € and kids 4€  and and groups of 15 or more are 4€ each. They also have an option of view and wine tasting for 8 €\nSo I’m a little afraid of heights so maybe it wasn’t the best idea for me to go up but hey how bad could it be.  Well is was a little cloudy,windy and wet so the tower was swaying a bit and the floor is on a slant and it’s not very roomy ,2 people can not walk side by side. only 2 people in the elevator at a time. But is was a great view.", "publishedDate": "2019-10-07", "language": "en", "rating": 4}, {"id": 714015549, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d246168-r714015549-Mirador_de_Colom-Barcelona_Catalonia.html", "text": "Bigger and more impressive than I expected, it sits at the bottom of Las Ramblas so you may as well have a quick look. Area is full of traffic and tourists though", "publishedDate": "2019-09-29", "language": "en", "rating": 4}, {"id": 711748189, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d246168-r711748189-Mirador_de_Colom-Barcelona_Catalonia.html", "text": "Although there is nothing particularly special about this statue at the tip of Las Ramblas, it can come in handy as a \"landmark\" while walking as a tourist, because it is so tall. Best yet for cruisers, it is close enough to the port for you to hop on a port-destination bus for about 3 euros. For this price, you can save a lot of walking to the cruise ship parts of the port, especially if you have to carry heavy luggage.", "publishedDate": "2019-09-21", "language": "en", "rating": 4}, {"id": 710147956, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d246168-r710147956-Mirador_de_Colom-Barcelona_Catalonia.html", "text": "This is a landmark at harbour end of Las Ramblas.Has underground shop  and wine tasting area.Quiet and cool away from crowds above. 6 euros to go up in lift.We used 2 for 1 voucher given to us whilst on hop on hop off bus so cant beat the price.Quaint tiny lift.Tight squeeze at top as small area.Great views.No queues when we visited  in middle of day.Glad we visited this.", "publishedDate": "2019-09-16", "language": "en", "rating": 5}, {"id": 709360950, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d246168-r709360950-Mirador_de_Colom-Barcelona_Catalonia.html", "text": "A large plaza near the base of las ramble. Beautiful column and statue on top. Pretty crowded to find a good place for a picture.", "publishedDate": "2019-09-13", "language": "en", "rating": 5}, {"id": 707700921, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d246168-r707700921-Mirador_de_Colom-Barcelona_Catalonia.html", "text": "Nice statue of Columbus located at the end of Rambla street, near the sea. Worth a look if you are in the area. \nYou can also go up from here in a tiny lift to see a nice panorama view of the city. ", "publishedDate": "2019-09-08", "language": "en", "rating": 4}, {"id": 707242196, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d246168-r707242196-Mirador_de_Colom-Barcelona_Catalonia.html", "text": "Here marks the end of Las Ramblas. It's a great monument of Christopher Columbus pointing! It's easier to take a picture of his back because we always had the sun when we tried to photograph the front!\nCost is 6€ to go up. We chose not to go up.", "publishedDate": "2019-09-06", "language": "en", "rating": 4}, {"id": 699900041, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d246168-r699900041-Mirador_de_Colom-Barcelona_Catalonia.html", "text": "This does what it says: you ride up the column in a tiny lift that takes no more than three and from the top there are views of the city. However the space at the top is tiny - enough for only 10-12 - and so it is a quick and cramped experience. ", "publishedDate": "2019-08-17", "language": "en", "rating": 3}, {"id": 699711783, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d246168-r699711783-Mirador_de_Colom-Barcelona_Catalonia.html", "text": "For just €6 you get a great view over the port and Barcelona. It's also the main Tourist Info office so you can book anything else you need there.", "publishedDate": "2019-08-16", "language": "en", "rating": 4}, {"id": 697432767, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d246168-r697432767-Mirador_de_Colom-Barcelona_Catalonia.html", "text": "It's a great place to cherish Christopher Columbus, just by the sea. There is a museum under the statue which I did not visit.", "publishedDate": "2019-08-10", "language": "en", "rating": 4}, {"id": 690501283, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d246168-r690501283-Mirador_de_Colom-Barcelona_Catalonia.html", "text": "This is the start of Las Ramblas - or the end - whichever you see fit. To us it was the start as we started here after getting off our cruise ship.  After we completed our day wandering Las Ramblas, we used this as our market to head back to our ship. Lots to do in this area.", "publishedDate": "2019-07-17", "language": "en", "rating": 4}, {"id": 690178202, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d246168-r690178202-Mirador_de_Colom-Barcelona_Catalonia.html", "text": "The Plaza de Colon is the public square that surrounds the Columbus statue, which is itself worth visiting and climbing up the elevator to get magnificent views of Barcelona and the coast. This place is actually a huge road roundabout and not a traditional public square with cafes and restaurants. Around the Columbus column are a couple of lion statues which are also nice to look at.\n\nPlaza de Colon is on the southern end of La Rambla and a nice way to end a walk on the entire length of the famous street.", "publishedDate": "2019-07-16", "language": "en", "rating": 4}, {"id": 688701266, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d246168-r688701266-Mirador_de_Colom-Barcelona_Catalonia.html", "text": "You can visit the top of the monument if you want, the views are quite good. The area in general is quite good, a good photo stop, on your way to the port. This is located at the port-end of La Ramblas.", "publishedDate": "2019-07-11", "language": "en", "rating": 4}, {"id": 686370846, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d246168-r686370846-Mirador_de_Colom-Barcelona_Catalonia.html", "text": "This monument is just at the bottom of la rambla next to the port. We really didn't believe you could take a lift all the way up as it looks to narrow but you can! Cluny 'drove' us up there and gave us some great tips and to do whilst we were in Barca.\n\nVery quick ride up and could spend as long as we wanted up there and was really nice as we were on our own for a good amount of time. It is narrow up there so getting past people is a bit funny but other than that the views are amazing and lots of information.\n\nMust do!", "publishedDate": "2019-07-03", "language": "en", "rating": 5}, {"id": 683165369, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d246168-r683165369-Mirador_de_Colom-Barcelona_Catalonia.html", "text": "My wife and I wanted to see and do as much as we could while visiting Barcelona for the first time. The beginning of our two week trip we spent about five days visiting sights and doing as much as possible....\n\nWe walked down La Rambla and took in all the sights, shops, etc....and wound up at the Mirador de Colom. It is a tall cylindrical monument that you take a elevator to the top where there is a circular viewing area. The elevator is real small and only fits about three people comfortably.\n\nOnce you reach the top the views are fantastic....You have unobstructed views in all directions... Making for nice photo opportunities. Once you return to the bottom of the monument there is a great giftshop, wine tasting bar, and historical information about the Mirador de Colom...And the entry fee is real inexpensive....\n\nDon't pass up this excellent monument run by the Barcelona Tourism....It is a great choice when visiting this beautiful city.....", "publishedDate": "2019-06-21", "language": "en", "rating": 5}, {"id": 681819753, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d246168-r681819753-Mirador_de_Colom-Barcelona_Catalonia.html", "text": "At the end of the Las Ramblas is the Mirador de Colom a tribute to Colombus. This monument you have to see.", "publishedDate": "2019-06-16", "language": "en", "rating": 4}, {"id": 680244610, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d246168-r680244610-Mirador_de_Colom-Barcelona_Catalonia.html", "text": "We got a cupons from Bus turistico and we had discouts to get in (50% off) and instead of 6 euros we payed 3 euro. For that price you can go to the elevator (the first elavator in Barcelona) and go to the top of Columbus column.\nThere is only one elevator and it fits maximum 4 adults (there is also a man who “drives” you up) so only three adulst beside him. Its a bit narrow so be aware if you dont like narrow spaces. \nThe column is 60 m high, and the other surprise is when you het out of the elevator its a bit more scary since you are in very narrow space with maximum 10 people and it can swing a bit if there is wind. I actually dont like hights but I was ok, but I saw some people a bit uncomfortable. But still I would recommend you do it. \nYou can be up as much as you like and then preds the button when you want to come down. The views are breathtaking.\nAfter it have a glass of wine for 2 euros (dicounted price for those with tickets, we even had it for 1 euro with coupons). The blond lady who works there is amazing - one of the best services in Barcelona. Thank you so much for the information, great service and feeling welcome. \nAlso there is an offical touristic shop (also 10 % discounts with bus cupons) with good offer. \nJust do it! Dont think about it much. Look at my photos..:)\n", "publishedDate": "2019-06-09", "language": "en", "rating": 5}, {"id": 677773371, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d246168-r677773371-Mirador_de_Colom-Barcelona_Catalonia.html", "text": "I would recommend spending the 6 euro per person to take the lift inside the column up to the viewing platform.\n\nThe views are great, it's not the highest point you can get to in Barcelona but you get great close up views of the city. \n\nThe lift is quite small, don't try it if you're not good with small spaces. Once at the top space is limited too and it could get crowded easily, but you can stay as long as you like.\n\nBe warned the the whole monument does sway in the wind, and the floor of the viewing platform slopes a bit too. It you're not good with heights it can be a bit worrying.", "publishedDate": "2019-05-31", "language": "en", "rating": 4}, {"id": 677723685, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d246168-r677723685-Mirador_de_Colom-Barcelona_Catalonia.html", "text": "At the foot of Las Ramblas (approaching the waterfront), you will see the 60 meter Columbus Column. The statue of Christopher Columbus is holding a navigational chart in his left hand, pointing to the route to America with his right (out to sea). You will see lots of symbolic sculptures at the base, with 4 lions seeming to guard the column. There were a lot of people at the foot of the column taking photograph and children climbing on numerous lions. \n\nAdmire the sculptural ensemble around the base of the magnificent Corinthian-style iron column which has a lift inside that takes you all the way up to the viewing gallery at the top at a price (adult 6 Euro, Senior and child 4 Euro, discount 10% if you buy on line). Very small canister elevator (carries 4 people along with attendant) takes you to the viewing platform that holds 8-10 people max. 360 degree views and points of interest shown above. Windows a little hazy, scratched, etc. You can stay as long as you like, but realize there is very limited room in the tower and the elevator only takes one trip up or down at a time. If you come to the morning ( 8.30 to 10 am), you will be upstairs alone and be able to take pictures and admire the views of the sea, Rambla and the surrounding neighbourhood of Barcelona. I couldn`t say that the view is so spectacular, but definitely worth the symbolic money spent.\n\nGift shop, wine tasting, and historic info, are also available under the base of monument.", "publishedDate": "2019-05-30", "language": "en", "rating": 4}, {"id": 675604006, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d246168-r675604006-Mirador_de_Colom-Barcelona_Catalonia.html", "text": "Large statue in tribute to Columbus.  Was built for a world exhibition.  Very ornate column well worth visiting. ", "publishedDate": "2019-05-21", "language": "en", "rating": 4}, {"id": 675346405, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d246168-r675346405-Mirador_de_Colom-Barcelona_Catalonia.html", "text": "My husband and I had decided on 7/19/2018 to take the metro to the waterfront area where the Christopher Columbus monument was located.  Got off at stop Drassanes.  Short walk from there to the monument.\n\nDesigned by Galeta Buhigas.  Constructed  in 1888 for the Universal Exposition in Barcelona.  It's 200' and honors Christopher Columbus who came to Barcelona in 1493 after his journey to America and reported to Queen Isabella and King Ferdinand.  Located at the southern end of the Ramblas.  \n\nStatues and reliefs.  At the top of the monument is a 24' tall bronze statue of Columbus.  This statue was sculptured by Rafael Atche and is said to show Columbus pointing towards the sea with his right hand while holding a scroll in his left hand.  Supposed to have amazing views of the city and Port Bell.  \n\nThe column stands on a base showing 4 winged victories-the 4 corners of the world.  Each winged victory is above a pair of griffins.  Then there's 4 buttresses that have medallions that depict persons related to Columbus.  Then we have 4 figures that represent the 4 realms of Spain-Catalonia, Leon, Aragon, and Castile.  Last are 4 more statues.  Base-has 4 staircases each flanked by 2 lions.   \n\nOfficial Tourism Information in the base of the monument.  You can take an elevator to the top of the column.  There's covered observation area with views over the city.  Unfortunately we were told that this access elevator was closed to visitors as work was being done on the monument.  Very disappointing.  There's also a gift shop here where I bought a postcard.  It's quite a neat monument and you can walk around it taking in the story it tells.  I bet this would be excellent if we could have taken an elevator to the top for the views.", "publishedDate": "2019-05-20", "language": "en", "rating": 4}, {"id": 674375805, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d246168-r674375805-Mirador_de_Colom-Barcelona_Catalonia.html", "text": "Plaza de Colon is a very busy roundabout. A lot of traffic passes by this spot, including vehicles as well as pedestrians. In the centre of the roundabout is a monument to that great explorer, Christopher Columbus. There is a large elaborate base with reliefs and inscriptions about Columbus, and on it stands a beautiful Corinthian style tall column and on top of that is a tall statue of Columbus. The great man's right hand is pointing to the far distance, and it is meant to be the New World which he discovered. The Plaza is quite a nice spot, and it is always full of visitors, milling around the Columbus column for a photo opportunity, at least this was the case when we visited. Also the area is frequented by street sellers who are selling a variety of cheap things to tourists. Beware! This Plaza marks one end of one of the most well known streets in Barcelona, the La Rambla! Opposite this spot is the water, the port, and unlimited views over the horizon! The area a little further down is full of boats, and on the waterfront there are shops, cafes, restaurants and a life or relaxation. A great place to visit.", "publishedDate": "2019-05-16", "language": "en", "rating": 5}, {"id": 673195589, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d246168-r673195589-Mirador_de_Colom-Barcelona_Catalonia.html", "text": "This 60-meter tall monument stands at the end of La Rambla, near the sea.\n\nIt was completed in 1888 for the Universal Exhibition held in Barcelona and to honor the Columbus' first voyage to the Americas.\n\nYou can take the lift inside the column to the viewing gallery at the top, where you can enjoy panoramic views of the city and the port.", "publishedDate": "2019-05-11", "language": "en", "rating": 4}, {"id": 673193721, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d246168-r673193721-Mirador_de_Colom-Barcelona_Catalonia.html", "text": "This square is located at the end of Las Ramblas. The 60-meter high Columbus Monument is located in the middle.", "publishedDate": "2019-05-11", "language": "en", "rating": 4}, {"id": 672457010, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d246168-r672457010-Mirador_de_Colom-Barcelona_Catalonia.html", "text": "If you are in the  Ramblas area of Barcelona then this is inexpensive tourist attraction is definitely worth a visit.The monument sits proudly at the bottom of this famous avenue overlooking the sea.It is possible to catch an elevator to the top of this monument.Space is very cramped up there as there is limited space.Its's a 360 degree view that is nice but somewhat spoiled by the metal plates that encase part of the tower as the obstruct part of your view from the glass panels at the top.The interior of the top of the tower is full of graffiti as well,defacing a fine monument.\nYou have to wait at the top for somebody to collect you when you are ready to come down,the lift has just a 3 person capacity.\nThe tickets cost me 6 Euros apiece,which was worth it to visit the top.A more expensive ticket is available with a glass of wine thrown in.It is worth noting that you are not allowed to use the toilet facilties at this tourist attraction unless you buy the more expensive entry ticket.", "publishedDate": "2019-05-08", "language": "en", "rating": 4}, {"id": 670779217, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d246168-r670779217-Mirador_de_Colom-Barcelona_Catalonia.html", "text": "The monument is very nice and well made but only for a quick look, if you’re passing by, you can go and check it out, but I certainly don’t recommend you to go all the way the area just to see it.", "publishedDate": "2019-05-01", "language": "en", "rating": 5}, {"id": 667747448, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d246168-r667747448-Mirador_de_Colom-Barcelona_Catalonia.html", "text": "Free.\nVisit Duration: 30 minutes.\n\nA huge roundabout marking one end of  la Ramblas. The most famous attraction there is the fascinating Columbus Monument. \nFrom this plaza you get the access to another beautiful area: The Port of Barcelona.", "publishedDate": "2019-04-19", "language": "en", "rating": 4}, {"id": 666436356, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d246168-r666436356-Mirador_de_Colom-Barcelona_Catalonia.html", "text": "Going up this monument is a cheap and unique way to see the city! We stumbled upon it and decided to go up. At the top, its definitely a tight fit, so keep in mind that you'll be a bit squished, but we thought it was worth it for the unique view of the city. I would recommend going up just before sunset like we did!", "publishedDate": "2019-04-14", "language": "en", "rating": 4}, {"id": 665349092, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d246168-r665349092-Mirador_de_Colom-Barcelona_Catalonia.html", "text": "We did not pay to go to the top, nor did we even climb on the lions, but you might as well walk to it if walking Las Ramblas.", "publishedDate": "2019-04-10", "language": "en", "rating": 4}, {"id": 665298458, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d246168-r665298458-Mirador_de_Colom-Barcelona_Catalonia.html", "text": "Free unless you want to go up.\nVisit Duration: 45 minutes.\n\nThe 60m tall monument, built in honor of Columbus' first voyage to the Americas, is located at the site where Columbus returned to Spain after his first voyage to the Americas. \n\nAt the very top of the monument stands a 7.2 m  tall bronze statue atop a 40 m  tall Corinthian column. Columbus is pointing towards the New World with his right hand, while holding a scroll in the left. \n\nThe canted octagonal plinth is inset with eight bronze bas-relief panels depict important scenes in Columbus's first voyage to the Americas:\n\nAlternating with the bas-reliefs are eight coats-of-arms representing locations that Columbus visited: Huelva, Córdoba, Salamanca, Santa Fe, Moguer, Puerto Rico, Cuba, Barcelona.\n\nThe base of the monument is a 20 m (66 ft) wide circle, with four staircases. Each staircase is flanked by two lions.\n\nElevator to the top of the Monument a Colom ticket at 5.50€", "publishedDate": "2019-04-10", "language": "en", "rating": 5}, {"id": 664982758, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d246168-r664982758-Mirador_de_Colom-Barcelona_Catalonia.html", "text": "We walked over to the monument to start our journey up to La Boqueria Market. There are some very nice spots to take pictures. We decided to take the elevator to the top. The ticket is a little steep but it comes with a glass of delicious cava which actually made it a great value. The bartender was extremely nice and helpful as well. ", "publishedDate": "2019-04-09", "language": "en", "rating": 5}, {"id": 664930985, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d246168-r664930985-Mirador_de_Colom-Barcelona_Catalonia.html", "text": "Situated at the end of Ramblas near the marina it is a large statue. \nFree cost. Plenty of photo opportunities as lots of lion statues at bottom of it.", "publishedDate": "2019-04-08", "language": "en", "rating": 4}, {"id": 664064781, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d246168-r664064781-Mirador_de_Colom-Barcelona_Catalonia.html", "text": "It was just a monument. It was really nothing special. Do not go out of your way to see this. Not worth the trip", "publishedDate": "2019-04-05", "language": "en", "rating": 3}, {"id": 663531270, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d246168-r663531270-Mirador_de_Colom-Barcelona_Catalonia.html", "text": "This is a nice statue near the harbour, at the end of the Rambla. It's worth to walk there and see it. It's a great monument of a famous historic man, the well-known explorer. We took lots of photos. If you want you can go to the top of the monument and have  a lovely view.", "publishedDate": "2019-04-03", "language": "en", "rating": 4}, {"id": 661421291, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d246168-r661421291-Mirador_de_Colom-Barcelona_Catalonia.html", "text": "Brilliant way to learn more about this imposing column and fascinating man. We decided to add the wine tasting to the ticket price - only 8 euros total. You get to choose one glass of wine from several options and sit for a while in the wine cellar. The sommelier was friendly and the chilled dessert red I chose \"Dolc Mattaro\" was absolutely delicious. Information available about the vineyards adds to the experience. Then, we had a trip to the top of the tower with an escort in a very slim elevator (not for the claustrophobic). At the top you get the fantastic 360 degree view and you simply ring the bell for the elevator to come back when you're done. Scrumptious wine and fascinating history - what's not to like?! ", "publishedDate": "2019-03-26", "language": "en", "rating": 5}, {"id": 660079618, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d246168-r660079618-Mirador_de_Colom-Barcelona_Catalonia.html", "text": "The monument, dedicated to Christopher Columbus, is a very good sculpture/monument and worth seeing while in this area.", "publishedDate": "2019-03-21", "language": "en", "rating": 4}, {"id": 658062193, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d246168-r658062193-Mirador_de_Colom-Barcelona_Catalonia.html", "text": "This plaza is right close to the waterfront. There is a statue of Christopher Columbus high atop that can be seen from higher up in the city. This is a good landmark to see and be in.", "publishedDate": "2019-03-12", "language": "en", "rating": 5}, {"id": 656914825, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d246168-r656914825-Mirador_de_Colom-Barcelona_Catalonia.html", "text": "Monument dedicated to Columbus who must be the worlds most well known explorer, you can get a birds eye view of this monument if you ride the cable car from the port.", "publishedDate": "2019-03-06", "language": "en", "rating": 4}, {"id": 654548832, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d246168-r654548832-Mirador_de_Colom-Barcelona_Catalonia.html", "text": "The spit is nice and this is a nice piece of architecture at the harbor in the end of Rambla. Well worth some nice photos.", "publishedDate": "2019-02-24", "language": "en", "rating": 4}, {"id": 646965513, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d246168-r646965513-Mirador_de_Colom-Barcelona_Catalonia.html", "text": "You can't really miss this monument near the Port Well area. However the pollution is beginning to take its toll on the stone work, and is very much in need of some TLC.", "publishedDate": "2019-01-19", "language": "en", "rating": 3}, {"id": 646938902, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d246168-r646938902-Mirador_de_Colom-Barcelona_Catalonia.html", "text": "The Column is located at the port end of Las Ramblas, and definitely a location to include on a visit to the city, you can go up the column which provides a great view of the port.\n\nIt is surrounded at the bottom by large Lion Statues", "publishedDate": "2019-01-19", "language": "en", "rating": 4}, {"id": 642065411, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d246168-r642065411-Mirador_de_Colom-Barcelona_Catalonia.html", "text": "This monument to Christopher Columbus is fabulously intricate with superb attention to detail with many sculptures and smaller monuments upon it. You can also ride up it in a lift for a fee which I didn't do.", "publishedDate": "2018-12-28", "language": "en", "rating": 4}, {"id": 640972859, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d246168-r640972859-Mirador_de_Colom-Barcelona_Catalonia.html", "text": "This is almost at the port end of the Rambla, and it's well worth strolling down the Rambla to the port and seeing it as both the Rambla and the port area are not to be missed.  You can take the elevator up for a good view.", "publishedDate": "2018-12-22", "language": "en", "rating": 4}, {"id": 640070684, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d246168-r640070684-Mirador_de_Colom-Barcelona_Catalonia.html", "text": "This is a large column in the city, it is near the water and it is worth having a look at. It is a bit of a walk from the main area, but it is worth taking the time to come and explore the greater area.", "publishedDate": "2018-12-17", "language": "en", "rating": 4}, {"id": 637138637, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d246168-r637138637-Mirador_de_Colom-Barcelona_Catalonia.html", "text": "One of the bus turistic red line stops, and they have a two for one coupon. It was the first elevator in Spain.  Old hydraulic one took four minutes, yikes. New electric one, takes only 35 seconds, better. Very small canister elevator takes you to the viewing platform that holds 8-10 people max. 360 degree views and points of interest shown above. Windows a little hazy, scratched, etc. Gift shop, wine tasting, and historic info, are also available under the base of monument. \n\nBuilt for the Exposicion' Universal de Barcelona (1888). It marks the port of return of Christopher columbus, back from the first new world voyage. You will see lots of symbolic sculptures at the base, very ornate, with 4 lions seeming to guard the 60 meter tower. Good lighting in the AM hours, use the cross walks to get to pedestrian area, as this heavily trafficked area at one end of the famous \"La Rambla\".", "publishedDate": "2018-12-02", "language": "en", "rating": 5}, {"id": 636306680, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d246168-r636306680-Mirador_de_Colom-Barcelona_Catalonia.html", "text": "This is in honor of Christopher Columbus and close to the harbor.  We had to walk Las Ramblas all the way south to the Monument.", "publishedDate": "2018-11-28", "language": "en", "rating": 5}, {"id": 636195879, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d246168-r636195879-Mirador_de_Colom-Barcelona_Catalonia.html", "text": "Colombus has been perched at the top of  this column since the late 1880s and is still looking ahead... It's a magnificent work. It's quite big, in a big road intersection, near the harbour. There is a lift inside taking you to the top so you can enjoy really panoramic views!", "publishedDate": "2018-11-27", "language": "en", "rating": 5}, {"id": 635428585, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d246168-r635428585-Mirador_de_Colom-Barcelona_Catalonia.html", "text": "Plaza De Colon is a nice plaza, housing the column of columbus. The plaza is the meeting point of La Rambla and Port Vell. The Maritime Museum is located next to the plaza.", "publishedDate": "2018-11-24", "language": "en", "rating": 4}, {"id": 635426507, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d246168-r635426507-Mirador_de_Colom-Barcelona_Catalonia.html", "text": "The Columbus Monument is located at the lower end of La Rambla. It was constructed in honor of Columbus' first voyage to the Americas. \nThe column and pedestal are hollow. You can access the monument, an elevator brings you to a platform from where you have an excellent view over the Rambla and Port Vell", "publishedDate": "2018-11-24", "language": "en", "rating": 4}, {"id": 635106487, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d246168-r635106487-Mirador_de_Colom-Barcelona_Catalonia.html", "text": "This monument is in honor of Christopher Columbus and is at the end of the Ramblas down by the harbor.", "publishedDate": "2018-11-22", "language": "en", "rating": 4}, {"id": 634657728, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d246168-r634657728-Mirador_de_Colom-Barcelona_Catalonia.html", "text": "The Columbus Monument (Mirador de Colom) is a memorial to the explorer Christopher Columbus. Built in 1988 this 197 foot monument is located at the foot of the Ramblas. For a small fee you can ride a elevator to top of this monument and enjoy amazing views of Barcelona, for an additional couple of euros you can add a glass of wine in the wine room. This a hidden gem. Jolly Chriss.", "publishedDate": "2018-11-20", "language": "en", "rating": 5}, {"id": 633790090, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d246168-r633790090-Mirador_de_Colom-Barcelona_Catalonia.html", "text": "We didn't even know that there was an elevator inside the column until we read these reviews. Our tour of Barcelona included this attraction and therefore  the tour guide got us off the bus, made us do a walk of about a kilometer and brought us here. It's on a roundabout and we were shown it from the side walk. Just a photo opportunity. Other than that we might as well have just seen it from the bus while driving around it", "publishedDate": "2018-11-16", "language": "en", "rating": 3}, {"id": 632599694, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d246168-r632599694-Mirador_de_Colom-Barcelona_Catalonia.html", "text": "I liked it a lot. I only do not remember why the statue is dark without any light. But the place is very nice", "publishedDate": "2018-11-11", "language": "en", "rating": 5}]}}]