[{"locationId": 2321733, "name": "Torre de Collserola", "placeType": "ATTRACTION", "reviewListPage": {"reviews": [{"id": 642072067, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d2321733-r642072067-Torre_de_Collserola-Barcelona_Catalonia.html", "text": "There is no need to pay to visit the observation deck at this tower as the views from the nearby Sagrat Cor are the same height and are free. This is an enormous structure but I'm not sure I'd like to live in the houses down the road from it as it's a bit of an eyesore. It's just a 5 minute stroll from the cathedral and the best way to get photos of it are from the viewing platforms at the cathedral as you are a nice distance away from it.", "publishedDate": "2018-12-28", "language": "en", "rating": 3}, {"id": 619405778, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d2321733-r619405778-Torre_de_Collserola-Barcelona_Catalonia.html", "text": "We finally found the easy way to get to La Torre de Collserola. Before you had to combine metro, rail, funicular railway and finally a bus to arrive at the tower, normally after all that to find it closed.  \n\nNow you can join a self-drive,  guided tour with the company TOURISIMO.es  They take you on a tour of the hills of Collserola and you drive a fully electric Renault Twizy, \ntwo-seater micro car following a guide. From their Base near Park Güell you head for the hills and when the tower is open you can ascend to observation deck,  560meters a.s.l.\n\nThe best views in BCN and the easiest and most fun way to get there. \n\nI highly recommend a visit to the tower and Tourisimo is the way to get there.", "publishedDate": "2018-09-25", "language": "en", "rating": 5}, {"id": 607711599, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d2321733-r607711599-Torre_de_Collserola-Barcelona_Catalonia.html", "text": "It's a bird's eye view overlooking Barcelona and its hinterland, and on a clear day you can see for miles 360°.  If you suffer slightly from Vertigo, like I sometimes do, then this place will give you a bearable buzz, but it's worth it for the pics.  The kids will enjoy it.  Get the 111 bus and get off at the first stop after Tibidabo Amusement Park", "publishedDate": "2018-08-18", "language": "en", "rating": 4}, {"id": 607537901, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d2321733-r607537901-Torre_de_Collserola-Barcelona_Catalonia.html", "text": "Tripadvisor could do with a 'Good' rating but I am rating this experience up to Very Good due to the friendly and helpful staff at the tower. They are lacking visitors unfortunately and I am surprised as the view from the top of the tower of Barcelona is fantastic. You can go up the tower for €5.60. The opening hours on this page are really misleading; throughout most of August 2018 the tower is closed on Monday and Tuesday but open 12:00-13:45 and 15:30-19:45 all other days. You should check the opening times on the tower website before going. Take the 111 bus all the way to the Tibidabo amusement park and walk down to the tower or stay on the 111 bus back down the hill and get off at the dedicated stop Torre de Collserola.", "publishedDate": "2018-08-17", "language": "en", "rating": 4}, {"id": 491620637, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d2321733-r491620637-Torre_de_Collserola-Barcelona_Catalonia.html", "text": "The Torre de Collserola is Barcelona's main television tower, with an observation deck, located back in the hills behind Barcelona. You can get up into the hills the tourist way by taking the Metro L7 to Avinguda Tibidabo at Kennedy Plaza, then the heritage Tramvia Blau (Blue Streetcar, 5.50 euros one way), then the Tibidabo Funicular (7.70 euros one way), and finally the Minibus 111. A cheaper option is taking the commuter train S1 or S2 to Peu del Funicular, then the Vallvidrera Funicular, and finally the Minibus 111 in the other direction (all with regular transit tickets like the T10). \n\nFrom the bus stop it's a short walk down a path away from the mountain road. It leads past the subterranean entrance to the tower. You buy a ticket and wait for a spell for more visitors to arrive and a guard to take the group up by glass elevator (not for anyone with no head for heights). \n\nThe views from the observation deck stretch across Barcelona to the Mediterranean and in the other direction to Montserrat. The only problem is that there is a gap between the deck and the facade (with a balustrade, of course), so you can't get close to the windows and always have window frames in your photos. \n\nAll in all probably the best panorama of Barcelona, if a little off the tourist path. At that point, a half-hour or an hour before closing time, there were only two or three visitors up there. But if you have some time left, it's well worth doing. You can combine it with visits to the Sagrat Cor and the Tibidabo Amusement Park (via Minibus 111).", "publishedDate": "2017-06-08", "language": "en", "rating": 5}, {"id": 478042071, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d2321733-r478042071-Torre_de_Collserola-Barcelona_Catalonia.html", "text": "This communications tower dominates the landscape of this beautiful city. There is an observation deck which is as high as visitors can get. Worth a visit if you have the time.\n", "publishedDate": "2017-04-22", "language": "en", "rating": 4}, {"id": 427836194, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d2321733-r427836194-Torre_de_Collserola-Barcelona_Catalonia.html", "text": "If you want to see Barcelona from up in the sky,that's the place!Placed in the neighborhood of Tibidabo amusement park.There's a bus(111 if I remember well) that let you close to the tower.", "publishedDate": "2016-10-14", "language": "en", "rating": 4}, {"id": 408469981, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d2321733-r408469981-Torre_de_Collserola-Barcelona_Catalonia.html", "text": "This place is a hidden Barcelona Gem and a must see place.\n\nExcellent place for couples or family as they have a theme park o top of the mountain.\n\nBoth couples and family can enjoy this place.", "publishedDate": "2016-08-21", "language": "en", "rating": 5}, {"id": 407819213, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d2321733-r407819213-Torre_de_Collserola-Barcelona_Catalonia.html", "text": "The highest point of Barcelona. Everything looks a bit faraway but it's the only point where you can see the city at 360 degrees and enjoy the full experience with sea and mountain views.", "publishedDate": "2016-08-20", "language": "en", "rating": 4}, {"id": 388187251, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d2321733-r388187251-Torre_de_Collserola-Barcelona_Catalonia.html", "text": "After a bit of trouble finding the right way in (definitely worth sticking with!), I went up the glass lift, to find the glass tower at the top beautifully air conditioned so you can enjoy the incredible views in absolute comfort. It also has little pictures that help you work out where all the attractions in Barcelona are in relation to you. Really worth it to help you orient yourself and get ideas for what else to do!\n\nAs long as you check the opening hours on the website, you won't have to worry about turning up to find it closed, because it's open most of the time, contrary to what one of the reviews says!", "publishedDate": "2016-07-01", "language": "en", "rating": 5}, {"id": 358140079, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d2321733-r358140079-Torre_de_Collserola-Barcelona_Catalonia.html", "text": "The tower itself is closed most days, however it is lovely to walk around the Parc de Collserola, there are great views from the hillside and the Tibidabo church tower is open more of the time if you want to get up a bit higher for better views. Also at €3 the Tibidabo church tower is much better value than the Collserola tower anyway.", "publishedDate": "2016-03-24", "language": "en", "rating": 3}, {"id": 333875277, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d2321733-r333875277-Torre_de_Collserola-Barcelona_Catalonia.html", "text": "I’m also scared of heights, but I was so absorbed by the way it was built that I hardly cared about being so far up. The view is incredible though.", "publishedDate": "2015-12-19", "language": "en", "rating": 5}, {"id": 331074777, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d2321733-r331074777-Torre_de_Collserola-Barcelona_Catalonia.html", "text": "Incredible view, and a nice elevator ride on the outside of the tower, with glass-doors. Not for the faint hearted. Didn't get 5 stars from me, because it was foggy, so I wasn't able to see the full view, especially to the north/west.", "publishedDate": "2015-12-06", "language": "en", "rating": 4}, {"id": 330013816, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d2321733-r330013816-Torre_de_Collserola-Barcelona_Catalonia.html", "text": "I walked up the damn mountain to get to this only for it to be closed, with no real indication of when it would be open!,  great vIews though anyway from mountain", "publishedDate": "2015-11-30", "language": "en", "rating": 3}, {"id": 248256100, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d2321733-r248256100-Torre_de_Collserola-Barcelona_Catalonia.html", "text": "this was built for the Olympics, you can go on top of the tower and enjoy the view. However if you have already been", "publishedDate": "2015-01-08", "language": "en", "rating": 3}, {"id": 247433937, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d2321733-r247433937-Torre_de_Collserola-Barcelona_Catalonia.html", "text": "My daughter was insistant that we make the effort to travel out of the city to visit the Torre de Collerola tower, designed by British architect Norman Foster.  There are probably arranged tours out there, but we found our own way using buses up the tibidabo hill, and then walking.  It not until you get really close that you realise how tall, imposing and so absolutely impressive it really is.\nWe went at christmas time to celebrate my daughter's 21st birthday. \nFantastic.  A glass lift zooms up to the observation floor, where some of the floor is glass, so fantastic view down, and then the views out of the 360 degree windows, from the top of the tower, and the top of the mountain - you can see over the whole city of Barcelona and out to sea - simply breathtaking.   \nTake your time, it is definitely value for money, the visit is not timed, a really fantastic British piece of fabulous architecture, which many British tourists would not bother to visit, or even know that it existed!", "publishedDate": "2015-01-04", "language": "en", "rating": 5}, {"id": 237498057, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d2321733-r237498057-Torre_de_Collserola-Barcelona_Catalonia.html", "text": "This tower has an observation deck on the 10th floor, to which there is a transparent(!) elevator. I have a fear of heights so I decided to challenge myself. The ride is definitely not for the faint of heart (the tower shakes and moves!) but the view was very much worth it.", "publishedDate": "2014-11-01", "language": "en", "rating": 5}, {"id": 222471965, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d2321733-r222471965-Torre_de_Collserola-Barcelona_Catalonia.html", "text": "The best view and what a masterpiece of design and engineering. The lift takes you to the 10th floor viewing gallery, with 360 views of Barcelona and the mountains. Spotlessly clean and very peaceful.", "publishedDate": "2014-08-17", "language": "en", "rating": 4}, {"id": 205637752, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d2321733-r205637752-Torre_de_Collserola-Barcelona_Catalonia.html", "text": "you climb really a step away from heaven.\nThe transparent elevator rises up to the sky and, just off the base of the tower, it opens a breathtaking view. All Cataluna is below you. Admire the coast of the sea in the distance, Tibidabo is not far from you but it seems small, almost a toy. After a few minutes you enter in the circular room with panoramic views. Everywhere around you is Cataluna at 360 degrees.\nFrom each side, if it is a clear day, you can see till 50 miles away and more. You also see the Monastery of Montserrat . \nFrom here you really  see how big is Barcellona. \nEntry costs 5.60 EUR . Unlimited time for the visit in the panoramic room  .\nFrom the city center, take the metro to the stop \" Catalunya \", then S2 until stop \"Vallvidrera inferior\". Go upstairs and take the funicular by the same station,  direction \" Vallvidrera Superior\" . Exit to the right and take the small bus number 111 to Colònia Tibidabo. Get off at the 4th stop and walk  to  the tower ( 400 meters) or come to  it from the main Tibidabo square ( 10 minutes walking).", "publishedDate": "2014-05-15", "language": "en", "rating": 5}, {"id": 177090644, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d2321733-r177090644-Torre_de_Collserola-Barcelona_Catalonia.html", "text": "My friend and I seem to be attracted to communication towers and have visited a few now in different cities.  We had wanted to visit this one on our visit to Barcelona and were certainly not disappointed.  We got here from Tibidabo.  We had taken the funicular and walked from the amusement park.  This is quite a challenging walk for anyone who is not very mobile like myself, but well worth the effort.  A shuttle service from the amusement park would be  useful but none was available. (A business opportunity for someone perhaps?)\nWe were the only two visitors when we got there and the guide said it had been quiet as there had been rain in the morning.  This was fine with us as we had the place to ourselves and were allowed to take as long as we wanted.  The lift to the top was tremendous and the lift is glass fronted and on the outside of the tower.  Once on the observation deck, the views are spectacular.  We had purchased a Barcelona Card on arrival in the city and this gave us free entry.   We would not have missed this even if we had had to pay.", "publishedDate": "2013-09-14", "language": "en", "rating": 5}, {"id": 177042809, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d2321733-r177042809-Torre_de_Collserola-Barcelona_Catalonia.html", "text": "My friend and I went on a short break to Barcelona and this was on our list of must sees. We got to Tibidabo  park using the Funicular Railway (a treat in itself), then walked over to the Torre de Collserola.It is a bit of a hike, but so worth it. We went quite late (about 6.30) and were the only two there, so had a private trip! The staff were lovely and told us to stay as long as we liked. The views are spectacular and well worth the trip. Just one word of warning, the lift is glass on all sides but the floor and is on the outside of the building. If you are a bit scared of heights, this may not be for you, but if you can overcome your fear you will be well rewarded.\nThe cost is around 6 Euros, but we went free with our Barcelona Cards.", "publishedDate": "2013-09-13", "language": "en", "rating": 5}, {"id": 173061643, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d2321733-r173061643-Torre_de_Collserola-Barcelona_Catalonia.html", "text": "If you want to see Barcelona and its surroundings in a 360º view, this is the right place. In clear days you can see also Mallorca. In a regular day  the sea and the large buildings like the Mapfre and Agba Tower, as well as Sagrada Família can be seen. The Tibidabo, with the church and park is very near in the top of the hill. One can get there by car or by bus.", "publishedDate": "2013-08-19", "language": "en", "rating": 5}, {"id": 144679550, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d2321733-r144679550-Torre_de_Collserola-Barcelona_Catalonia.html", "text": "This tower was buildt by Sir Norman Foster for the 1992 olympics, there is an elevator that you cna take and enjoy beautifull views of Barcenola, need to go by car.", "publishedDate": "2012-11-05", "language": "en", "rating": 3}, {"id": 128527672, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d2321733-r128527672-Torre_de_Collserola-Barcelona_Catalonia.html", "text": "this is the highest point from where you can view Barcelona and his surroundings. From the sea till Montserrat you can view everything.", "publishedDate": "2012-04-24", "language": "en", "rating": 5}, {"id": 124947440, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d2321733-r124947440-Torre_de_Collserola-Barcelona_Catalonia.html", "text": "This is an special icone of Barcelona. It is interesting when you visit the nearby suburbs and you can still see the Torre and locate Barcelona.", "publishedDate": "2012-02-20", "language": "en", "rating": 4}]}}]