[{"locationId": 4660265, "name": "Mercat De Sant Antoni", "placeType": "ATTRACTION", "reviewListPage": {"reviews": [{"id": 614337136, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d4660265-r614337136-Mercat_De_Sant_Antoni-Barcelona_Catalonia.html", "text": "This place just re opened..Buy the food from stall #114-119 BEST Local food ever!  A must  the bean salad ..The Paella & Arroz dish too!", "publishedDate": "2018-09-06", "language": "en", "rating": 5}, {"id": 614133783, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d4660265-r614133783-Mercat_De_Sant_Antoni-Barcelona_Catalonia.html", "text": "Mercat Sant Antoni opened not too long ago after its refurbishment.  We rented an apartment near the market. Its the opposite of the Boqueria Market off the ramblas. Very clean and modern although i must say the Boqueria has that 'old school'and 'haphazard' charm about it.  At sant antoni you must go to a premade food stall that seems to be run by two sisters.  You will find an array of great food to go.  We had paella at several restaurants and this was the best. The white beans with parsely and tomatoes was great.  We bought a few containers of food and some great fruit , picked up a bottle of wine (5€) and a bottle of Cava(3€) at Condis (chain grocery store) and had a superb meal back at the apartment. Most of the people shopping here seem to be locals with few tourists. Very few owners spoke english but you can point and use hand signals and they serve you. They are not catering to tourists. So visit several markets around barcelona, they all have their unique charm....but be up to date on the hours of operation.", "publishedDate": "2018-09-05", "language": "en", "rating": 4}, {"id": 594907144, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d4660265-r594907144-Mercat_De_Sant_Antoni-Barcelona_Catalonia.html", "text": "Those expecting a typical market experience should look elsewhere. Beyond your fruit and vegetable stalls are fresh eggs, seafood, legs of ham, cheeses and even clothing stalls. It’s a great place to wander through, and, especially if you’re staying at an apartment in the area, a great place to buy some delicious, fresh foods.", "publishedDate": "2018-07-10", "language": "en", "rating": 4}, {"id": 593602084, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d4660265-r593602084-Mercat_De_Sant_Antoni-Barcelona_Catalonia.html", "text": "First visit since reopening after a five year refurbishment. Added a lidl under the market. The usual stalls fresh fish, fruit, fish, meat veg and eggs to name a few. Worth a visit ", "publishedDate": "2018-07-06", "language": "en", "rating": 4}, {"id": 593021400, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d4660265-r593021400-Mercat_De_Sant_Antoni-Barcelona_Catalonia.html", "text": "It was good to go back and see the refurbishment  complete.\nThey have now dug below the old market and a new lidls is below.\nThe old stalls are above now in a refurbished setting. Great mixture of old and new.", "publishedDate": "2018-07-04", "language": "en", "rating": 5}, {"id": 585719104, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d4660265-r585719104-Mercat_De_Sant_Antoni-Barcelona_Catalonia.html", "text": "Perhaps my expectations were too high especially having been wowed by Mercat La Boqueria. This one was a disappointment.  It was small, cramped and felt like a tourist trap. Walking to and from the place was not enjoyable either. I kept seeing prostitutes and drug addicts...and this was 11 am on a Wednesday morning! Disappointing.", "publishedDate": "2018-06-07", "language": "en", "rating": 2}, {"id": 583280004, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d4660265-r583280004-Mercat_De_Sant_Antoni-Barcelona_Catalonia.html", "text": "This Mercado is not only food. There are shops and artesans works. The food is exellent. This is Different by far from Boqueria.", "publishedDate": "2018-05-28", "language": "en", "rating": 5}, {"id": 549049609, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d4660265-r549049609-Mercat_De_Sant_Antoni-Barcelona_Catalonia.html", "text": "We visited the market before christmas and it was packed with people and food. There's meat, fish, fruit, veggies and sweets. Even bars and a few pop-up restaurants. If you don't want to shop you should just wander around and admire the produce. ", "publishedDate": "2017-12-24", "language": "en", "rating": 4}, {"id": 543102439, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d4660265-r543102439-Mercat_De_Sant_Antoni-Barcelona_Catalonia.html", "text": "Building works are running behind schedule (this is Spain) but the market is looking beautiful. Would like to come back and see this full of people.", "publishedDate": "2017-11-24", "language": "en", "rating": 4}, {"id": 537892750, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d4660265-r537892750-Mercat_De_Sant_Antoni-Barcelona_Catalonia.html", "text": "We walked through this market and were disappointed. Prices are high and you cannot see any locals here...", "publishedDate": "2017-11-02", "language": "en", "rating": 3}, {"id": 532259775, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d4660265-r532259775-Mercat_De_Sant_Antoni-Barcelona_Catalonia.html", "text": "It really is a must do visit if you are in Barcelona. You can try the tapas, have a beer, have a wine or simply enjoy the atmosphere.", "publishedDate": "2017-10-12", "language": "en", "rating": 4}, {"id": 508964173, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d4660265-r508964173-Mercat_De_Sant_Antoni-Barcelona_Catalonia.html", "text": "When I visit a new city, the first stop is the local Mercado. The Mercado de San Antonio is the best in Barcelona. We stopped by one of the seafood restaurant stalls and you pick the fresh fish you want to eat and they cook for you right there. Enough said.  ", "publishedDate": "2017-08-05", "language": "en", "rating": 5}, {"id": 506642719, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d4660265-r506642719-Mercat_De_Sant_Antoni-Barcelona_Catalonia.html", "text": "Housed under canvas while the actual market continues to be renovated, this market has a tremendous range of victuals and a separate garment and fabric section. A couple of cafés are also within.\nA cheaper and excellent alternative to La Boqueria. Highly recommended ", "publishedDate": "2017-07-28", "language": "en", "rating": 5}, {"id": 496175807, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d4660265-r496175807-Mercat_De_Sant_Antoni-Barcelona_Catalonia.html", "text": "It is rather small compared to similar farmers markets. It looks very colorful and a variety of options for food and fruits. However when we tried to buy calamari from a stand it turned out it is from frozen calamari cooked probably a few days ago and tasteless. Then we got fruits for kids in a shaker. They were really bad. I do not understand the place is for freshness. You can use ingredients from next neighbor which looks good. It is really a pity. ", "publishedDate": "2017-06-26", "language": "en", "rating": 2}, {"id": 492598036, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d4660265-r492598036-Mercat_De_Sant_Antoni-Barcelona_Catalonia.html", "text": "Mercat San Antoni, on the edge of Raval district, is great even in its temp sheds, next to its classic building being rehabbed.", "publishedDate": "2017-06-12", "language": "en", "rating": 5}, {"id": 491082317, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d4660265-r491082317-Mercat_De_Sant_Antoni-Barcelona_Catalonia.html", "text": "This market is a must stop.\n\nSo much to choose from. Fresh fruit, meat cuts, fish, processed meats and so much more.\n\nA lot of different things to try and to buy.\n\n", "publishedDate": "2017-06-06", "language": "en", "rating": 5}, {"id": 478641372, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d4660265-r478641372-Mercat_De_Sant_Antoni-Barcelona_Catalonia.html", "text": "Visited the place twice during my stay in Barcelona and wouldn't mind visiting more. A great place to try some good treats. Enjoyed the wide variety of juices and fruits  and grabbed a quick falafel sandwich for lunch which was delicious. If you are in Barcelona don't miss visiting this place ", "publishedDate": "2017-04-24", "language": "en", "rating": 5}, {"id": 475338993, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d4660265-r475338993-Mercat_De_Sant_Antoni-Barcelona_Catalonia.html", "text": "As I had my family in tow, we seemed to find ourselves back here quite a lot of times. We never seemed to leave without some food. Coming from England, there were a lot of interesting foods on the stalls that aren't so typical back home. Some were different due to the nature of the food an others because of how it was presented. If you are looking for variety and something different then this is your place.", "publishedDate": "2017-04-13", "language": "en", "rating": 4}, {"id": 459724551, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d4660265-r459724551-Mercat_De_Sant_Antoni-Barcelona_Catalonia.html", "text": "Unfortunately, the market was closed for renovation but it looks impressive from the outside, especially the architecture and the style. Worth to visit when it will open on October 2017.", "publishedDate": "2017-02-14", "language": "en", "rating": 3}, {"id": 459158521, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d4660265-r459158521-Mercat_De_Sant_Antoni-Barcelona_Catalonia.html", "text": "a huge and amazing building, this market is unfortunately closed for reconstruction until October 2017. For the time being, you can look it only from outside. If you plan a visit to Barcelona later this year, make sure to include it in your circuit.", "publishedDate": "2017-02-13", "language": "en", "rating": 4}, {"id": 452459662, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d4660265-r452459662-Mercat_De_Sant_Antoni-Barcelona_Catalonia.html", "text": "The market hall is currently being upgraded and has been for some time. There are a few stalls in the surrounding streets and a temporary food market nearby. The old building itself is quite beautiful and will be well worth a visit when completed.", "publishedDate": "2017-01-16", "language": "en", "rating": 1}, {"id": 442284261, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d4660265-r442284261-Mercat_De_Sant_Antoni-Barcelona_Catalonia.html", "text": "This was the first place we went in Barcelona after getting off the plane. It was hopping with people and the food stalls were amazing, got to try a little bit of everything. Had our kids with us and they loved trying all of the little bites. I was somewhat surprised with the amount of food and diversity of it. There was a ton to choose from. I would have went back again but closed on Sunday.", "publishedDate": "2016-12-05", "language": "en", "rating": 5}, {"id": 435074001, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d4660265-r435074001-Mercat_De_Sant_Antoni-Barcelona_Catalonia.html", "text": "We went to see the market as we were staying only a few hundred metres away. It is currently undergoing a major refurbishment so has bee housed in another area next door. The food on display is mouthwatering. We did some of our own. Catering but had we had better. Facilities this market would provide all we wanted in the. Way of meat,fish, vegetables,fruit etc.\n", "publishedDate": "2016-11-06", "language": "en", "rating": 4}, {"id": 427493686, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d4660265-r427493686-Mercat_De_Sant_Antoni-Barcelona_Catalonia.html", "text": "This huge and very fine market building looks very interesting from outside, but it is still under reconstruction in October 2016.", "publishedDate": "2016-10-12", "language": "en", "rating": 3}, {"id": 426847262, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d4660265-r426847262-Mercat_De_Sant_Antoni-Barcelona_Catalonia.html", "text": "Visited the food market on a Saturday.\nThe market is currently housed in temporary accommodation whilst the original building is being restored.\nI must admit, I did not realise that this was a market. I saw people going into the temporary buildings and decided to have a look.\nThere is a café in the building we visited, which was mainly fish stalls.", "publishedDate": "2016-10-10", "language": "en", "rating": 4}, {"id": 426666315, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d4660265-r426666315-Mercat_De_Sant_Antoni-Barcelona_Catalonia.html", "text": "This is definitely a must when visiting Barcelona!\n\nTry the fresh fruit juice being sold there, they literally sell every flavor you can imagine! Great value for money and everything is fresh. Situated just off Las Ramblas so really easy access.", "publishedDate": "2016-10-10", "language": "en", "rating": 5}, {"id": 425235728, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d4660265-r425235728-Mercat_De_Sant_Antoni-Barcelona_Catalonia.html", "text": "This is just off the Ramblas and well worth a visit. This is a typical Spanish market with colourful fruit and vegetables carefully displayed, stalls with an amazing arrange of fish, Charcuterias and placed to have tapas or a drink.", "publishedDate": "2016-10-05", "language": "en", "rating": 5}, {"id": 410618094, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d4660265-r410618094-Mercat_De_Sant_Antoni-Barcelona_Catalonia.html", "text": "It is closed due to renovation, don't know for how long.\nWhat a let down, had so looked forward to visit this market, especially since it is beautiful.", "publishedDate": "2016-08-25", "language": "en", "rating": 1}, {"id": 403165313, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d4660265-r403165313-Mercat_De_Sant_Antoni-Barcelona_Catalonia.html", "text": "Great neighborhood market. Currently in temporary quarters under a big tent in the middle of the street. Know for having clothes as well as food. Plus, a Sunday books and coins market.Not too crowded during my last visit. Easy access with the Metro or bus at Sant Antoni stop. Original structure is beautiful and bring removed the right way. Wonderful detail in old iron design. Daily clothes market across the street.", "publishedDate": "2016-08-09", "language": "en", "rating": 4}, {"id": 398977150, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d4660265-r398977150-Mercat_De_Sant_Antoni-Barcelona_Catalonia.html", "text": "The market of the San Antonio is a great place to visit because of the beautiful  building itself and as well because of the quality and variety of the products offered: fish of all sorts, beautifully vegetables and fruits, nuts, local food , meat and Spanish charcuterie . The products are of high quality and the price us very reasonable compared to the Boqueria Mercado along the Rambla. \nWe stayed in this neighborhood and shopping our fresh ingredients every days in the San Antonio and in some organic shops .\nA long the Carrer Dell compte Urgell there are plenty of bars , shops, restaurants to hang out.\nIf you like ice cream one of the best is : Sirvent homemade and qualitative products with various flavors. They serve also amazing healthy fresh juices !\nIn the Carrer Del parlement pkrnty if bars and restaurants to go out full of young local people a very nice place to walk in the evening. We tried el dynamic and Domo restaurants , delicious food, in an enjoyable place .\nWe had dinner also in the typical Can Luis restaurant (Carrera de la Cera) see my review on this! There is also Cera23, top culinary food in a strange street for a nice price...\nAnd many other nice places we liked in this neighborhood every evening we went out.\n\nEnjoy!\n", "publishedDate": "2016-07-29", "language": "en", "rating": 5}, {"id": 398677631, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d4660265-r398677631-Mercat_De_Sant_Antoni-Barcelona_Catalonia.html", "text": "A vibrant place to visit and enjoy !!! A great choice of attractive meals cooked in front of you especially those including various tasty seafood and tapas!!", "publishedDate": "2016-07-28", "language": "en", "rating": 4}, {"id": 396105132, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d4660265-r396105132-Mercat_De_Sant_Antoni-Barcelona_Catalonia.html", "text": "It might be strange to go to a market not to buy things but this one deserves the visit. It has many stores and places to eat.\n\nBe aware that the market is very crowded and therefore it can look like a tight place. It might not be a suitable place to go with little children.", "publishedDate": "2016-07-24", "language": "en", "rating": 5}, {"id": 392560410, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d4660265-r392560410-Mercat_De_Sant_Antoni-Barcelona_Catalonia.html", "text": "This place is very busy and tight quarters (so zip your purse and be aware!) If you go towards the back there are very good tapas places, less crowds, and places to sit. Friendly staff at the main bar in the back. Look around before you decide what to eat.\nThe gelato is slightly better on the street though.", "publishedDate": "2016-07-14", "language": "en", "rating": 4}, {"id": 385921553, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d4660265-r385921553-Mercat_De_Sant_Antoni-Barcelona_Catalonia.html", "text": "Many reviewers suppose, that Mercado Sant Antoni is located close to the Rambla.\nBut that's not right.\nThis market is located in West-Raval.\nMercado Sant Antoni is an impressive big market. Most for locals. Very few tourists.\nYou can see a big selection of food, and the market have several tapas-bars", "publishedDate": "2016-06-25", "language": "en", "rating": 4}, {"id": 379354957, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d4660265-r379354957-Mercat_De_Sant_Antoni-Barcelona_Catalonia.html", "text": "This WILL be a great market. Currently, it's under construction (as it has been for the past 2.5 years). It will be restored to its past glory, and from the way it now looks, it's going to be spectacular. Now, there are just a few shops and groceries waiting for then place. The Sant Antoni area is one of the most charming in the city, and the area abounds with good eateries and small shops.", "publishedDate": "2016-06-03", "language": "en", "rating": 3}, {"id": 377454383, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d4660265-r377454383-Mercat_De_Sant_Antoni-Barcelona_Catalonia.html", "text": "Everyone who visits Barcelona should definitely check out these markets. Great selection of produce (meat, fish, vegetables) as well as cheeses, sweets, spices, oils and so much more. Quite a few tourists but many locals as well stocking up. Has a few little cafés to stop for a bite and a drink during your shopping. ", "publishedDate": "2016-05-28", "language": "en", "rating": 5}, {"id": 376656086, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d4660265-r376656086-Mercat_De_Sant_Antoni-Barcelona_Catalonia.html", "text": "If you like browsing for cheap clothing and such, this is a place to try, open most days but not Sundays", "publishedDate": "2016-05-26", "language": "en", "rating": 4}, {"id": 376548754, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d4660265-r376548754-Mercat_De_Sant_Antoni-Barcelona_Catalonia.html", "text": "Colorful and well displayed food. Very attractive and crowded . I had the impression that I would never get out of the market because of too many temptations.", "publishedDate": "2016-05-25", "language": "en", "rating": 4}, {"id": 371500686, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d4660265-r371500686-Mercat_De_Sant_Antoni-Barcelona_Catalonia.html", "text": "We came across the market walking to dinner on La Rambla. \n\nThis has to be one of the largest fresh food markets we've every been to and even at 6pm with many stalls closed for the day there was still a crush of people around many of the stalls. \n\nWe bought some fresh olives and could have bought much more except that we are only spending the day here. ", "publishedDate": "2016-05-09", "language": "en", "rating": 5}, {"id": 369948773, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d4660265-r369948773-Mercat_De_Sant_Antoni-Barcelona_Catalonia.html", "text": "This is a crazy place with as many people taking pictures as buying fruit. Real crush to get in off Las Rambles, but well worth it. Visually this place is just stunning. There are amazing places to sit and eat the freshest seafood and just about anything else.\nIt goes back a long way and you can escape through the back. Take a camera but try all the samples of food as you make your way around.", "publishedDate": "2016-05-03", "language": "en", "rating": 4}, {"id": 367830704, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d4660265-r367830704-Mercat_De_Sant_Antoni-Barcelona_Catalonia.html", "text": "This market is located on La Rambla street, on the right side, if you are going from Placa de Catalunya to the port.\nIt's always packed with locals and tourists.\nGreat selection of fresh fruit and veg, fish, meat and so on\nA Couple of restaurants can be found all around the market.\nGreat atmosphere, so much energy and noise...in a good way ;)", "publishedDate": "2016-04-26", "language": "en", "rating": 4}, {"id": 363806893, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d4660265-r363806893-Mercat_De_Sant_Antoni-Barcelona_Catalonia.html", "text": "The market just off las ramblas is just great. An unrivalled array of fresh fruit and veg, dried fruit, baked goods and pastries, fresh fish and meats and cheeses etc line the multiple stalls. \n\nLots of delicious food on offer, some good prices my only criticism is the repetition as a lot of the stalls overlap in their product offering. But 100% worth going to!\n", "publishedDate": "2016-04-13", "language": "en", "rating": 4}, {"id": 363023008, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d4660265-r363023008-Mercat_De_Sant_Antoni-Barcelona_Catalonia.html", "text": "If you have been to Seattle's Pike Place or Philadelphia's Reading Market you'll feel like you've seen markets like this before, but with an emphasis on fresh seafood and nice seafood tapas places.\n\nYes about 20% higher than other places you can find candied nuts and dried fruit and chocolate confections, so you've been warned. We didn't buy anything, it was tempting to sit down at one of the several busy seafood tapas places but settled for a nice roasted octopus snack, just the thing to tide us over until a proper dinner.", "publishedDate": "2016-04-10", "language": "en", "rating": 4}, {"id": 360383244, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d4660265-r360383244-Mercat_De_Sant_Antoni-Barcelona_Catalonia.html", "text": "This market is so authentic and quiet compared to the tourist trap just off the Ramblas. Our son's office is acorss the street and that is how we discovered this location. Purchased my olive oils to take home here in 2014. Less English here, but food is a common language and you will do fine.", "publishedDate": "2016-03-31", "language": "en", "rating": 5}, {"id": 357621818, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d4660265-r357621818-Mercat_De_Sant_Antoni-Barcelona_Catalonia.html", "text": "In a handsome structure you can find a masterpiece of food market, clean peacefull aestetic and full of goodies bringing up your appetite. It is currentely in renovation so the market moved to nearby street but soon enough it will open again. The clothes market is less impressive but worth the visit.", "publishedDate": "2016-03-22", "language": "en", "rating": 5}, {"id": 357010988, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d4660265-r357010988-Mercat_De_Sant_Antoni-Barcelona_Catalonia.html", "text": "The main market building is being renovated but there are large under cover areas set up as an interim. If you are into Spanish books, comics, collectibles, football cards, Lego, computer games, dvd's then this is the place for you. If you aren't into these things then there are certainly a number of bars, cafes and restaurants in the area to cater for the market goers. ", "publishedDate": "2016-03-20", "language": "en", "rating": 4}, {"id": 354070447, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d4660265-r354070447-Mercat_De_Sant_Antoni-Barcelona_Catalonia.html", "text": "A bit touristy but good overall. Fish section is good in particular. Prices are 20% higher than in other markets further from the center.\nOffers several good spots to have a quick lunch.", "publishedDate": "2016-03-09", "language": "en", "rating": 4}, {"id": 346219451, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d4660265-r346219451-Mercat_De_Sant_Antoni-Barcelona_Catalonia.html", "text": "Noisy, colourful, great local food.  Great to see so many different varieties of fresh food, fish, meat, vegetables, local specialities.\n\nThere are also quite a few small cafes, to sit and just people watch.", "publishedDate": "2016-02-09", "language": "en", "rating": 5}, {"id": 345196813, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d4660265-r345196813-Mercat_De_Sant_Antoni-Barcelona_Catalonia.html", "text": "I r8 8/8 m8. Recommended to anyone. You can buy local food and experience a fun adventure.\nThus is a must if visiting the area.", "publishedDate": "2016-02-05", "language": "en", "rating": 5}, {"id": 343767470, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d4660265-r343767470-Mercat_De_Sant_Antoni-Barcelona_Catalonia.html", "text": "The beautiful old building of this market is currently being renovated; the market has been moved to two big tents in the meanwhile. But it is still an excellent place to buy good fruit, vegetables, other groceries, and clothes at a reasonable price, and to experience a real neighbourhood market in Catalonia, especially on a Saturday (it is closed on Sundays). There is a bar in one of the tents for a coffee or a light lunch.", "publishedDate": "2016-01-30", "language": "en", "rating": 4}, {"id": 343391155, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d4660265-r343391155-Mercat_De_Sant_Antoni-Barcelona_Catalonia.html", "text": "This is great market and a must see if your visiting Barcelona. Everything is nice and fresh. There's a lovely shop that sells handmade chocolates which are amazing but a little expensive. ", "publishedDate": "2016-01-28", "language": "en", "rating": 5}, {"id": 343115082, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d4660265-r343115082-Mercat_De_Sant_Antoni-Barcelona_Catalonia.html", "text": "The dried meat is worth the try! Only in spain!\n\nFresh fruit juices everywhere!\n\nYou cn hve lunch here but beware, chairs are hard to find!", "publishedDate": "2016-01-27", "language": "en", "rating": 5}, {"id": 342081047, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d4660265-r342081047-Mercat_De_Sant_Antoni-Barcelona_Catalonia.html", "text": "Markets are my favorite destination in any city and Barcelona has no shortage of them. This one is located in the beautiful building designed in 1882 by Antoni Rovira i Trias and it has maintained the charm and liveliness through the years.", "publishedDate": "2016-01-23", "language": "en", "rating": 5}, {"id": 338734736, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d4660265-r338734736-Mercat_De_Sant_Antoni-Barcelona_Catalonia.html", "text": "Fantastic. We saw fruit and vegetables, seafood and delicacies we have never seen before. Great place for breakfast and better food than McDonalds or KFC.", "publishedDate": "2016-01-09", "language": "en", "rating": 5}, {"id": 338420145, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d4660265-r338420145-Mercat_De_Sant_Antoni-Barcelona_Catalonia.html", "text": "whether you go to eat, shop or just to look this place is a must. you also need to time it right to get a seat at the various tapas counters - something that i did not! The selection of food is amazing and there is a lot of seafood naturally.", "publishedDate": "2016-01-08", "language": "en", "rating": 4}, {"id": 336281134, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d4660265-r336281134-Mercat_De_Sant_Antoni-Barcelona_Catalonia.html", "text": "Worth a trip to walk around but keep your bag close to you, it gets crowded. Don't buy the first thing you see either, the vendors aren't all about quality, some are quantity. Having said this there are some great things to see and buy. It is a piece of the local culture and a great place to walk through.", "publishedDate": "2015-12-31", "language": "en", "rating": 4}, {"id": 326864538, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d4660265-r326864538-Mercat_De_Sant_Antoni-Barcelona_Catalonia.html", "text": "Like to visit the local markets when on holiday, like the atmosphere of local and tourists mixing, like the fresh fruit, veg and fish on display, everything so fresh, worth a visit ", "publishedDate": "2015-11-15", "language": "en", "rating": 4}, {"id": 323956348, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d4660265-r323956348-Mercat_De_Sant_Antoni-Barcelona_Catalonia.html", "text": "Wonderful sights and smells. Fruit, fish, loads of other food stalls, snack stalls and drinks.   Some of the prices very high though.", "publishedDate": "2015-11-02", "language": "en", "rating": 4}, {"id": 323920078, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d4660265-r323920078-Mercat_De_Sant_Antoni-Barcelona_Catalonia.html", "text": "Great to walk round and see the locals barter and buy their daily provisions. Some great fishmongers and  great to see all the fresh produce. ", "publishedDate": "2015-11-02", "language": "en", "rating": 4}, {"id": 319875681, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d4660265-r319875681-Mercat_De_Sant_Antoni-Barcelona_Catalonia.html", "text": "they have recently changed location but is even better bigger and nicer! it is more or less same experience as mercatd e la boqueria but less museum-alike and more affordable!", "publishedDate": "2015-10-18", "language": "en", "rating": 4}, {"id": 316282893, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d4660265-r316282893-Mercat_De_Sant_Antoni-Barcelona_Catalonia.html", "text": "This market is buzzing with life, colour and smells. We had a fun time wandering this huge market and tasting some delicious foods. Be prepared to bump and grind with others as the market is really busy. ", "publishedDate": "2015-10-05", "language": "en", "rating": 4}, {"id": 313578599, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d4660265-r313578599-Mercat_De_Sant_Antoni-Barcelona_Catalonia.html", "text": "This place was so much fun to walk through, even with the massive crowds. Your senses will be on overload!", "publishedDate": "2015-09-25", "language": "en", "rating": 5}, {"id": 309543030, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d4660265-r309543030-Mercat_De_Sant_Antoni-Barcelona_Catalonia.html", "text": "Apparently this place is being refurbished which is a shame as the guide showed pictures of a gorgeous brick/iron building which housed the mercat de sant antoni.\n\nThere clearly is a lack of tourists here and the market is filled with the locals and grannies with their shopping buggies. The market is now in the plastic white makeshift tent or marquee. The market is vast as there isn't a single giant large white marquee but a few of them! It is separated out into sections and several marquees and fills entire narrow streets.\n\nIt is definitely bigger than la bouqeria and I'm so glad I visited this place. It can be a pain to find as one of the sign posts points you in completely the wrong direction. We had to go into a pharmacy and ask where to go as we were completely lost even though we had a map.\n\nNot only does it have lots of olive oil, turron, cheese, jamon, seafood, meat, vegetables, fruit, sweets, patisseries, cakes, bakeries. It also had clothing stalls. It is very interesting watching the locals haggle over what I would describe as 'long curtains'. There were trinkets too like watches etc. It offers much more variety than bouqeria market.\n\nIt is definitely worth a visit on a Sunday! Maybe I will come here again on a Sunday next time I visit BCN.", "publishedDate": "2015-09-12", "language": "en", "rating": 5}, {"id": 309126170, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d4660265-r309126170-Mercat_De_Sant_Antoni-Barcelona_Catalonia.html", "text": "The real market is currently under repairs and a smaller number of stalls are housed nearby on the street in a large white roofed section. The place closed down early afternoon. ", "publishedDate": "2015-09-10", "language": "en", "rating": 3}, {"id": 308633594, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d4660265-r308633594-Mercat_De_Sant_Antoni-Barcelona_Catalonia.html", "text": "This is a busy market with a lot of hustle and bustle. Beware there are a lot of pickpockets about so keep your valuables close. The fish market is worth the trip. ", "publishedDate": "2015-09-09", "language": "en", "rating": 4}, {"id": 305388646, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d4660265-r305388646-Mercat_De_Sant_Antoni-Barcelona_Catalonia.html", "text": "small, but all you need\nvery high quality tuna fish for a fair price.\nvegetables also fine, although they are cheaper in the supermarket. but for fish i can totally recommend this market", "publishedDate": "2015-08-31", "language": "en", "rating": 5}, {"id": 304798538, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d4660265-r304798538-Mercat_De_Sant_Antoni-Barcelona_Catalonia.html", "text": "It has basically every thing from fruit to eggs to fish.defeinitly worth going there.olives were very very large variety ", "publishedDate": "2015-08-29", "language": "en", "rating": 5}, {"id": 304793007, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d4660265-r304793007-Mercat_De_Sant_Antoni-Barcelona_Catalonia.html", "text": "We were family of 5 mid afternoon, looking to top up on an underwhelming lunch earlier.  It looked impossible to get a seat in one of the bars (despite the time), for 5 of us, but walking around the stalls we found snacks that made everyone happy, good mix of sweet and savoury, hot and cold, fruit, meat cheese and fish.  Worth a detour, try to time for when you will want to eat as well, but if more than 1 or 2 you may need to eat as you walk around.", "publishedDate": "2015-08-29", "language": "en", "rating": 4}, {"id": 301515221, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d4660265-r301515221-Mercat_De_Sant_Antoni-Barcelona_Catalonia.html", "text": "With all of the eye candy walking La Rambla (people watching,shops restaurants,activity) you could easily walk by the Barcelona Mercado . Look for it and stop in. More candy, meats, coffees,wines, fruits and veggies than you can shake your wallet at.\nDon't go inside if you're hungry. You'll never make it back out!!", "publishedDate": "2015-08-20", "language": "en", "rating": 5}, {"id": 299012140, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d4660265-r299012140-Mercat_De_Sant_Antoni-Barcelona_Catalonia.html", "text": "We really enjoyed this market. It had so many things to see. From the fresh fruits, fish, meats and foods to the little cafes. It was just a lot of fun. We stayed right on Las Ramblas and ate breakfast in there twice, lunch in there twice and bought food to have a light dinner back in our room. The bakery inside was really good. We don't have anything like this fresh local market at home. Can be a little crowded at mid day.", "publishedDate": "2015-08-13", "language": "en", "rating": 5}, {"id": 296464477, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d4660265-r296464477-Mercat_De_Sant_Antoni-Barcelona_Catalonia.html", "text": "The array of different fresh fruits, vegetables, meats, seafood and other items was overwhelming to this prairie girl.  We found wonderful things to taste, wonderful things to look at and an opportunity to see Spanish people doing their own shopping.  Very very worthwhile stop!", "publishedDate": "2015-08-06", "language": "en", "rating": 5}, {"id": 287280272, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d4660265-r287280272-Mercat_De_Sant_Antoni-Barcelona_Catalonia.html", "text": "Set in an old area of the city here you will find the freshest seafood of every kind,be sure to try the booth shucking fresh oysters,giant shrimp every type of fish as fresh as the days catch,vegetables in vivid color and everything else you can imagine,fine local cheese and spices from around the world,almost everywhere fruits and fresh juices,plenty of places to eat and try and a very interesting place to visit with excellent chances for photography.The stand holders are multi lingual and very friendly.", "publishedDate": "2015-07-09", "language": "en", "rating": 4}, {"id": 286816513, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d4660265-r286816513-Mercat_De_Sant_Antoni-Barcelona_Catalonia.html", "text": "You mingle with the locals, it's a big book market, antique and old, mostly in Spanish , the quarterone is also very nice!", "publishedDate": "2015-07-08", "language": "en", "rating": 4}, {"id": 286614969, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d4660265-r286614969-Mercat_De_Sant_Antoni-Barcelona_Catalonia.html", "text": "We stayed very close so why here to get produce- excellent and fresh. The stall holders are friendly and even offered for my mother to come behind the counter and have a photo with them :) ", "publishedDate": "2015-07-07", "language": "en", "rating": 4}, {"id": 286496013, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d4660265-r286496013-Mercat_De_Sant_Antoni-Barcelona_Catalonia.html", "text": "I loved this place - all the good food and drink of a proper Barcelona market with none of the huge price increases and tourist traps of some of the others.  Spent every morning here buying food for the day and sampling some of the best Barcelona had to offer.  Everyone was so friendly as well - a welcome relief to some of the more well known markets", "publishedDate": "2015-07-07", "language": "en", "rating": 5}, {"id": 286495866, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d4660265-r286495866-Mercat_De_Sant_Antoni-Barcelona_Catalonia.html", "text": "Mercado Sant Antoni is located near the Liceu metro. Fantastic place to check out fresh fruits, cured meat, fresh seafood and more. The vibrant display of the fruits upon entering the market sends your vision into sensory overload. So bright, so colourful, almost surreal. So if you love fruits, you will like this place alot. Around the outside of the market you have a few tapas eateries, some of them are actually pretty decent. ", "publishedDate": "2015-07-07", "language": "en", "rating": 4}, {"id": 283393209, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d4660265-r283393209-Mercat_De_Sant_Antoni-Barcelona_Catalonia.html", "text": "Staying just around the corner we have been going here for breakfast everyday, there is plenty of fresh fruit available to purchase in ready to eat cups or in bulk if you want to have some for later on. \n\nThere is an amazing selection of cured meats available, which are carved fresh when you order or then can come in pre-vacuum sealed packs on display, they vary in price depending on the cut and ageing time of the meat so be a little careful before you let your taste buds get a little too expensive.\n\nThere are also a handful of specialty stores ranging from Mexican to Spice & Nut Stores to Coffee Shops, so take your time and wonder around and see whats on offer.\n\nWould recommend this place to everyone as its on the main strip and is a brilliant place to get some great fresh local food and a little culture as well.\n\nJust be weary it can be a little crowded if thats not your thing.", "publishedDate": "2015-06-27", "language": "en", "rating": 5}, {"id": 283157071, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d4660265-r283157071-Mercat_De_Sant_Antoni-Barcelona_Catalonia.html", "text": "Everything you would expect ata a great market and more.  Fantastic pasties, fresh juices & fruit. Did I mention meats of all kinds? Jamon serrano for breakfast is a must.  Good coffee at most of the cafes surrounding the market.  ", "publishedDate": "2015-06-26", "language": "en", "rating": 5}, {"id": 282853743, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d4660265-r282853743-Mercat_De_Sant_Antoni-Barcelona_Catalonia.html", "text": "Went on Monday so Fish side of things was v low key but otherwise everything else was as expected! A collage of produce and atmosphere that is quintessentially Iberian or Catalan to be more precise!\nHad sum v tasty baby pulpo🐙 washed down with a nice ice cold Estrella! ", "publishedDate": "2015-06-25", "language": "en", "rating": 5}, {"id": 282218697, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d4660265-r282218697-Mercat_De_Sant_Antoni-Barcelona_Catalonia.html", "text": "Great open-air market used by both locals (for cuts of meat and fish) and tourists (for fresh fruits, juices and snack-sized treats, also a few tapas kiosks). Sometimes it can be quite busy and confusing, but there seem to be a few ways to get the maximum enjoyment. What we discovered:\n\n-The main hallway/avenue is full of people, so if you get to one of the other aisles, it is less crazy. \n-Near the entrance they charge 2€ for a freshly-squeezed juice, but as low as 1€ a few steps elsewhere, which makes for a great treat, esp for kids.\n-If going elsewhere, grab a bocadillo to go.\n-Vendors take pride in their stalls and there are lots of great photo ops, but check to see if vendors have signs saying no photos first. \n-The place is busy, so vendors are not too chatty. Make your order and move!", "publishedDate": "2015-06-22", "language": "en", "rating": 5}]}}]