[{"locationId": 12847550, "name": "Retro Auto Moto Museo", "placeType": "ATTRACTION", "reviewListPage": {"reviews": [{"id": 723509454, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d12847550-r723509454-Retro_Auto_Moto_Museo-Barcelona_Catalonia.html", "text": "An excellent collection of unusual mostly European antique vehicles, a lot of brands that I had never heard of.  Most in excellent condition.  Takes about an hour to see it all.  Perfect for those who love antique cars.", "publishedDate": "2019-11-03", "language": "en", "rating": 4}, {"id": 721255312, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d12847550-r721255312-Retro_Auto_Moto_Museo-Barcelona_Catalonia.html", "text": "Such a small place on the street front but inside there are three floors with great exhibits - can't imagine how they got all the cars in there in the first place! Nice museum to while away an hour.", "publishedDate": "2019-10-25", "language": "en", "rating": 4}, {"id": 692425606, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d12847550-r692425606-Retro_Auto_Moto_Museo-Barcelona_Catalonia.html", "text": "Extremely interesting very rare cars.  I loved it\nJust 8 euro to get in \n\nGreat access to cars and bikes many marque's I had never seen before in lovely condition \n\nCurator friendly and knowledgable\n\nVery easy to get to well served by public transport.   Leave train at l'arc de triumphe station and then 5 min s walk\n\n5 0f 5 stars", "publishedDate": "2019-07-24", "language": "en", "rating": 5}, {"id": 669918119, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d12847550-r669918119-Retro_Auto_Moto_Museo-Barcelona_Catalonia.html", "text": "It was a good surprise to visit this Vintage car museum.\nRelatively small, there are no incredible cars (racing cars, unique models etc...). BUT many cars u are not used to see including few ones coming from Eastern Europe and Russia. \nCars and Motorbikes are well maintained.\nIt does include a bizarre scenery of a supposed bike accident which took place a long time ago:  a skeleton is still riding the bike!!!\n", "publishedDate": "2019-04-28", "language": "en", "rating": 4}, {"id": 658852063, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d12847550-r658852063-Retro_Auto_Moto_Museo-Barcelona_Catalonia.html", "text": "I spent about an hour here and enjoyed seeing the collection whilst my wife explored nearby clothes shops - 8 euros entry which I felt was good value for money.", "publishedDate": "2019-03-16", "language": "en", "rating": 5}, {"id": 631126688, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d12847550-r631126688-Retro_Auto_Moto_Museo-Barcelona_Catalonia.html", "text": "This museum is by the waterfront of Barcelona, a little tough to find but has an interesting selection of automobiles and motorcycles from around the world. Whereas other Auto museums tend to cater to the upper end automobiles this one has a wide variety of automobiles from the working class, it has very few Spanish made automobiles or motorcycles I didn't see a single Hispano-Suiza or Kapi but I did see lots of french, german and english cars and motorcycles including some brass era vehicles and some turn of the century motorcycles. \nIt was around 10 Euro to get in and covers 3 levels - not sure if elevators were available.", "publishedDate": "2018-11-05", "language": "en", "rating": 5}, {"id": 630250333, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d12847550-r630250333-Retro_Auto_Moto_Museo-Barcelona_Catalonia.html", "text": "This was a bit hard to find on the map.  Coming through the park to the arc de triumph, go left onto Trafalgar.  When you come across the museum, you are at the back. Looking at the museum, go left around block. It cost €8 cash or visa.  There are two floors of cars and motorcycles, and the third has motorcycles and motorized bicycles.\nThere are over fifty cars from various European countries, USA, Russia; ranging from 1890s to 1960s..I also liked the easy listening background music.  It as a Sunday morning and at opening.  We were the only one’s in the museum through our stay.  There was a good description on the details of each car in Spanish and English.  On the way out, you get to select a postcard.", "publishedDate": "2018-11-02", "language": "en", "rating": 4}, {"id": 623600052, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d12847550-r623600052-Retro_Auto_Moto_Museo-Barcelona_Catalonia.html", "text": "The museum hosts vintage cars, motorcycles and bicycles. There is a fee €8? To get in with 2 free postcards on the way out. \nIt is interesting and well laid out with many of the exhibits in a restored condition....except for the person in the hole!!!  \n", "publishedDate": "2018-10-09", "language": "en", "rating": 5}, {"id": 623133802, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d12847550-r623133802-Retro_Auto_Moto_Museo-Barcelona_Catalonia.html", "text": "My wife and I were walking through Barceloneta on our way to Parc de la Ciutadella when she quickly spotted several antique cars on display in a building. It turns out we were on the back-end of Retro Auto Moto Museo, which didn't pop up in any of our Barcelona research. \n\nWe easily found the front entrance to the museum and spent over an hour looking at the well over 100 cars and motorcycles. They were all in very good (not pristine) shape and their origins spanned a wide variety of countries, including the former GDR and Soviet Union. The irony is that there wasn't a single car or motorcycle of Spanish manufacture.\n\nAs we walked through the museum, I thanked my wife profusely for her observant eye, as she knows my passion for antique cars and bikes. And I'm still thanking her as I write this review.", "publishedDate": "2018-10-08", "language": "en", "rating": 5}, {"id": 607049381, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d12847550-r607049381-Retro_Auto_Moto_Museo-Barcelona_Catalonia.html", "text": "A highly advisable place to visit to see with kids. Many unknown brands of retro cars. Good and helpful personnel. ", "publishedDate": "2018-08-16", "language": "en", "rating": 5}, {"id": 603906728, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d12847550-r603906728-Retro_Auto_Moto_Museo-Barcelona_Catalonia.html", "text": "A real gem of a place.  Three floors of classic cars and motorcycles beautifully arranged so visitors can walk around most of the exhibits.  Cars from 1895 to 1960's from all over the world.  Anyone who has an interest in cars must take an hour to visit this wonderful addition to the attractions in the city.", "publishedDate": "2018-08-07", "language": "en", "rating": 5}, {"id": 567199250, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d12847550-r567199250-Retro_Auto_Moto_Museo-Barcelona_Catalonia.html", "text": "A wonderful find, so many different cars that not seen before. You can get up close and look inside all the cars. Loved it !\nGreat building, peaceful, cool, toilets and cars brilliantly exhibited.\nJust  a great collection well displayed, well done !", "publishedDate": "2018-03-18", "language": "en", "rating": 5}, {"id": 538435053, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d12847550-r538435053-Retro_Auto_Moto_Museo-Barcelona_Catalonia.html", "text": "I found the Retro Auto Moto Museum (Retro Auto Moto Museo) purely by accident while wandering the streets in the El Gotica area one evening. Having made a note of its location I returned the next for a visit during its opening times. \nWhat a wonderful surprise. Despite the slightly shabby outlook once you get inside (and the 8 Euro entrance fee is cheap enough) the museum spreads out over three floors. The two lower levels are dedicated to cars and the top level is given over to motorcycles and motorised bicycles. The selection of vehicles is very comprehensive with many makes of car that I'd never heard of before. \nThe great thing about this museum is that you can get up close to the cars, there're no barriers so if you want a close look at a car's interior you can simply walk up to the cat and take a good look through the window. \nThe Museum also houses a wide selection of auto memorabilia, include a range of old car and motorcycle magazine available to buy. \nThis is a great place to go for any petrolhead in Barcelona.", "publishedDate": "2017-11-05", "language": "en", "rating": 5}]}}]