[{"locationId": 244194, "name": "Casa Amatller", "placeType": "ATTRACTION", "reviewListPage": {"reviews": [{"id": 753498728, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d244194-r753498728-Casa_Amatller-Barcelona_Catalonia.html", "text": "After visiting Casa Batlló, we ended up entering the building next door, as we saw that there was a Café and we were freezing in the cold wind. They say that the Amatller Museum is wonderful, but unfortunately we didn't have time and just stayed at the cafe. I chose a combo, which was a jamon sandwich and hot chocolate - one of the best I've ever had in my life!", "publishedDate": "2020-05-13", "language": "en", "rating": 5}, {"id": 751677960, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d244194-r751677960-Casa_Amatller-Barcelona_Catalonia.html", "text": "We did not go into Casa Amatller, but we had breakfast at their cafe while waiting for Casa Batlo to be open. The teacups and porcelain is so pretty. The crossaints are fresh and hot chocolate is creamy & rich. Do give it a try if you are nearby", "publishedDate": "2020-03-23", "language": "en", "rating": 4}, {"id": 748928486, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d244194-r748928486-Casa_Amatller-Barcelona_Catalonia.html", "text": "Casa Amatller is another beautiful example of modernism in Barcelona. I admit, if this building were somewhere else, I would have probably given this a 5-star rating. Unfortunately, I think Barcelona has more to offer and, if I had to make a short selection of things not to miss in this stunning city, Casa Amatller wouldn't be on the top of the list.\nFirst of all, I think the exterior is more fascinating than the interiors so it is easy to walk in with too high expectations. Second, you can only visit the 1st floor and the visit is only 45 minutes so it doesn't feel like a full experience given the ticket price. Third, the format of the visit is a mix between a guided tour and self-guided visit with a tablet while at that point I would have preferred just to stick with the guide the whole time.\nThese are my reasons not to give the 5 stars but I want to highlight that this is still a very interesting experience and I am happy I had the chance to visit it. If you have spare time in Barcelona or you are back for a second visit and you are looking for something non-Gaudi style then give this place a go.", "publishedDate": "2020-03-03", "language": "en", "rating": 4}, {"id": 747523039, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d244194-r747523039-Casa_Amatller-Barcelona_Catalonia.html", "text": "One of the best place in Barcelona, where you can feel the atmosphere of the beginning of the 20th century. Gorgeous interiors with interesting details and flavourus chocolate in the cafe on the ground floor. Special thanks to Julien for the fascinating excursion.", "publishedDate": "2020-02-25", "language": "en", "rating": 5}, {"id": 744122270, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d244194-r744122270-Casa_Amatller-Barcelona_Catalonia.html", "text": "A quiet building over shadowed by the neighbour Casa Battlo, the building comes alive as our tour guide Helena brilliantly illuminated the lives of the owners, the rivalries with their neighbours and the rich design legacy they left behind. Delicious chocolate and toast in the cafe!", "publishedDate": "2020-02-10", "language": "en", "rating": 5}, {"id": 738074473, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d244194-r738074473-Casa_Amatller-Barcelona_Catalonia.html", "text": "We did not get the chance to go inside the building but we passed in front of it and this way we got a chance to see the building. Casa Amatller is a very beautiful house right next to casa Batlló and I would like to see the inside one day ", "publishedDate": "2020-01-09", "language": "en", "rating": 5}, {"id": 738067600, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d244194-r738067600-Casa_Amatller-Barcelona_Catalonia.html", "text": "Overlooked this one on previous visits to Barcelona in favour of Casa Batlló and La Pedrera but it is well worth visiting.  We were shown round by an excellent guide who really brought the place to life and provided a lot of information about the growth of the bourgeoisie and their passion for conspicuous consumption that led them to patronise the Modernista movement.  The chocolate at the end of the tour was divine.", "publishedDate": "2020-01-09", "language": "en", "rating": 5}, {"id": 729104489, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d244194-r729104489-Casa_Amatller-Barcelona_Catalonia.html", "text": "The house seemed to be overshadowed by it’s famous neighbour! However, this house has so much more to offer! \nA wonderful gem as if it stood still in time! Well worth the 45 minutes guided tour to admire the by gone era! A complimentary hot chocolate accompanied by the most delicious soft warm bread to conclude the visit! ", "publishedDate": "2019-11-26", "language": "en", "rating": 5}, {"id": 726360103, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d244194-r726360103-Casa_Amatller-Barcelona_Catalonia.html", "text": "When time is limited, Casa Amatller is not essential. But it offers some terrific insight into Gaudi's idea of comfortable living. One can tour the first floor apartment which is a museum and very interesting. ", "publishedDate": "2019-11-14", "language": "en", "rating": 4}, {"id": 724653961, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d244194-r724653961-Casa_Amatller-Barcelona_Catalonia.html", "text": "Saw it just from the outside, didn't have the time to go inside. The exterior architecture is nice though as nice as those of the other two buildings. The surrounding is very beautiful though.", "publishedDate": "2019-11-06", "language": "en", "rating": 4}, {"id": 723367500, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d244194-r723367500-Casa_Amatller-Barcelona_Catalonia.html", "text": "We didn't take a tour of this building, but we enjoyed seeing and photographing the exterior facade, which is also right next to the unique Casa Batllo. Even without a tour, you can enter the ground floor, where there is a delicious chocolate shop, and see a little bit of the interior. It was worth the 10 minutes we took to pop inside as we were walking by.", "publishedDate": "2019-11-02", "language": "en", "rating": 4}, {"id": 722294950, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d244194-r722294950-Casa_Amatller-Barcelona_Catalonia.html", "text": "This is a nice building right next door to Casa Batllo.  It has nice photo opportunities.  Not as busy as Casa Batllo, and Casa Mila.", "publishedDate": "2019-10-29", "language": "en", "rating": 3}, {"id": 720031395, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d244194-r720031395-Casa_Amatller-Barcelona_Catalonia.html", "text": "Found this place by accident as we were walking down the Passieg de Gracia past Gaudi's Casa Batllo.  The interesting facade offered a nice counterpoint to the Gaudi facade right next door.   The museum offers an audio/video tour in small groups at set times throughout the day.  At the start of the tour, you're given surgical shoe covers to protect the floors of the historical residence and a tablet and headphones that guides you through the house.  The guide is available in a variety of languages, is informative and well done, the group is small enough to be manageable and the docents are accommodating and helpful.  At the end of the tour, you're given a cup of Amatller hot chocolate which was out of this world.  Experiencing the residence first hand gives a view into another world and time which I enjoyed immensely.", "publishedDate": "2019-10-20", "language": "en", "rating": 5}, {"id": 719903482, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d244194-r719903482-Casa_Amatller-Barcelona_Catalonia.html", "text": "We shared a small group tour with just five others.  It was a priviledge to see the well preserved details of this home.  The designs are unique, the guide was warm and patient with us and very informative.  The chocolate treat at the end was a yummy surprise.", "publishedDate": "2019-10-20", "language": "en", "rating": 5}, {"id": 719200757, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d244194-r719200757-Casa_Amatller-Barcelona_Catalonia.html", "text": "Casa Amatller  is a building in the Modernisme style in Barcelona, designed by Josep Puig i Cadafalch.  The building was originally designed as a residence for chocolatier Antoni Amatller and was constructed between 1898 and 1900. It's very easy to overlook it, because being right next door to one of Gaudi’s most famous works, Casa Batllo. Usually you see the crowd going toward Casa Batlló, but this one  has  far shorter queues to get in. You can also take a guided tour of the house, however slots are limited.  Today you can still buy Amatller chocolates in the shop on the ground floor that’s open to the public. Behind the shop is a cafe that serves up light lunches and coffees. The coffee and hot chocolate are very good. This house is really worthy to visit.  Highly recommend.", "publishedDate": "2019-10-17", "language": "en", "rating": 5}, {"id": 719123744, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d244194-r719123744-Casa_Amatller-Barcelona_Catalonia.html", "text": "Very beautiful, excellent, wonderful!!!! The pretentiousness of Gaudi's architectural lines with light. bright colors makes it possible to remember it forever)", "publishedDate": "2019-10-17", "language": "en", "rating": 5}, {"id": 715663878, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d244194-r715663878-Casa_Amatller-Barcelona_Catalonia.html", "text": "Visited Sat Oct 5 at 330. Casa Amatller  A special experience for us. Different than Casa Batio but still equally a treasure.\nOur tour guide a taller girl, forgot her name, was a kind and knowledgeable guide..\nYummy hot chocolate at end.\nNot to be missed.", "publishedDate": "2019-10-05", "language": "en", "rating": 5}, {"id": 713653752, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d244194-r713653752-Casa_Amatller-Barcelona_Catalonia.html", "text": "See it from the outside (it's right next to the wonderful Casa Battlo) but don't forget to go inside the ground floor. There's a chocolate shop in here which sells very nice souvenirs. You can also get these same souvenirs all over Barcelona but it's worth it to get the best prices here and try to samples", "publishedDate": "2019-09-28", "language": "en", "rating": 5}, {"id": 713189135, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d244194-r713189135-Casa_Amatller-Barcelona_Catalonia.html", "text": "No it's not Gaudí , and it's nothing like Gaudí,but it's right next door to Casa Batilo and for my money it's much more of a \"home' than it's neighbour. The Amatller family were and still are Chocolatiers and entrance to their mansion today includes a finishing treat : a cup of delicious hot chocolate!  \nThe apartment itself is a \"work in progress\" and the careful guides will take you around armed with tablet guide! These are really lovely rooms tastefully decorated and furnished.\nIt's beautiful!", "publishedDate": "2019-09-26", "language": "en", "rating": 5}, {"id": 713173869, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d244194-r713173869-Casa_Amatller-Barcelona_Catalonia.html", "text": "Bought tickets online with a discount 2 days in advance.  It included a video guide. The furniture, stained glass windows, and chandeliers were beautiful.  I wished they allowed more time to look around the furnished rooms, because there was much to see and appreciate.  I felt rushed as they herded us from one room impatiently to the next and there wasn't even that many people.  We also could not see one of the rooms and only heard the audio about it because there was a special small group tour at the same time we had ours.  I feel for the price, they should have allowed us to see the room even briefly.  They said is was a plain room, but the audio describes a lovely ceiling etc. We enjoyed the chocolate and bread at the end, but they sat us on the long table in the hallway instead of sitting in the round cafe tables by the stairs where we could have enjoyed the stained glass ceiling above.  3 ladies were allowed to sit there.", "publishedDate": "2019-09-26", "language": "en", "rating": 4}, {"id": 712316945, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d244194-r712316945-Casa_Amatller-Barcelona_Catalonia.html", "text": "Not sure why this tour is not better attended because it was wonderful.  Great to see a house intact from the period.  Being able to enjoy the chocolate and bread after was a bonus.  Very beautiful and interesting", "publishedDate": "2019-09-23", "language": "en", "rating": 5}, {"id": 711501120, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d244194-r711501120-Casa_Amatller-Barcelona_Catalonia.html", "text": "The house shows lots of history. But the best thing was the hot chocolate served with a piece of bread on the first floor cafeteria. The tasty thick chocolate you are not going to forget. Trust me. I had two.", "publishedDate": "2019-09-20", "language": "en", "rating": 4}, {"id": 706831460, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d244194-r706831460-Casa_Amatller-Barcelona_Catalonia.html", "text": "A beautiful old piece of modernist architecture. The city is full of these amazing buildings and this is one of the best!", "publishedDate": "2019-09-05", "language": "en", "rating": 5}, {"id": 706551829, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d244194-r706551829-Casa_Amatller-Barcelona_Catalonia.html", "text": "We admired the exterior and the entry way, as well.  Nice place to have some premium chocolate and coffee", "publishedDate": "2019-09-04", "language": "en", "rating": 5}, {"id": 706356307, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d244194-r706356307-Casa_Amatller-Barcelona_Catalonia.html", "text": "The Café and the chocolate shop are amazing. This is already worth a trip to go there. The museum part I havent seen  ", "publishedDate": "2019-09-04", "language": "en", "rating": 4}, {"id": 702694402, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d244194-r702694402-Casa_Amatller-Barcelona_Catalonia.html", "text": "Actually chocolate was to invented here, but it could have!  We had a guided tour by an awesome host.  ", "publishedDate": "2019-08-24", "language": "en", "rating": 5}, {"id": 702638737, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d244194-r702638737-Casa_Amatller-Barcelona_Catalonia.html", "text": "We had a guided tour this morning and our guide was amazing! \nShe said she was nervous but her English was perfect. We had looked at Casa Batllo but the queue was enormous so popped in here- no reservation required. \n\nThey whizzed us up to the tour and the guide answered many questions about this house. \n\nAt the end of the tour we had a thick chocolate sauce and three pieces of bread as a great snack- linked to the family heritage of chocolate making. \n\nThe shop is also a good area to get a gift- well worth the trip. ", "publishedDate": "2019-08-24", "language": "en", "rating": 5}, {"id": 702210494, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d244194-r702210494-Casa_Amatller-Barcelona_Catalonia.html", "text": "We stopped for a coffee and croissant for breakfast in this very pleasant cafe which is part of the museum.  Definitely not as busy as Casa Batllo next door, but worth a look as the decoration is really special.  Built around 1900 it has all the various influences of the time, with a unique Catalan twist.  We were too early to see the museum, but would be worth a look on another visit.", "publishedDate": "2019-08-23", "language": "en", "rating": 4}, {"id": 700963740, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d244194-r700963740-Casa_Amatller-Barcelona_Catalonia.html", "text": "This building has been obscured for years because of its famous neighbor: Antoni Gaudì Casa Battlò. This Building anyway is just ridiculously beautiful! Originally bought buy Mr Amatller a Chocolate producer, has been rebuilt and restyled by architect Puig y Cadafalch who gave the astonishing present look to the building. The place is absolutely well preserved and you can visit it having a guided 60 minutes tour and a pleasant chocolate cup.", "publishedDate": "2019-08-20", "language": "en", "rating": 5}, {"id": 697110679, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d244194-r697110679-Casa_Amatller-Barcelona_Catalonia.html", "text": "Great place to get your chocolates and try coffee and shakes. Casa Battlo is literally next door.  Lots of tourists everytime.", "publishedDate": "2019-08-08", "language": "en", "rating": 5}, {"id": 697066042, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d244194-r697066042-Casa_Amatller-Barcelona_Catalonia.html", "text": "Personally this has a limited appeal, credit to Gaudi for the design but more to the builders, this can't have been easy.", "publishedDate": "2019-08-08", "language": "en", "rating": 3}, {"id": 696878862, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d244194-r696878862-Casa_Amatller-Barcelona_Catalonia.html", "text": "I came across this place which is next door to Casa Batllo.  I was lucky to be the only person on this tour which you get a tablet audio guide with a member of staff.  You have to slip on the blue shower caps on your shoes to protect the flooring.  The home itself was gorgeous.  So much texture, pattern, colour, and detail.  Very sumptuous.  After the tour you get a free hot chocolate with toasted bread and a free sample of chocolate to taste in the shop downstairs.  Yum.", "publishedDate": "2019-08-08", "language": "en", "rating": 5}, {"id": 695229316, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d244194-r695229316-Casa_Amatller-Barcelona_Catalonia.html", "text": "Next to one of Gaudi's major designs, it give you the chance to see and appreciate something \"none Gaudi\". It is more interesting inside than outside. ", "publishedDate": "2019-08-03", "language": "en", "rating": 4}, {"id": 692133951, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d244194-r692133951-Casa_Amatller-Barcelona_Catalonia.html", "text": "A short guided apartment tour. You will also get a tablet with audio-guide. On the way out you go through chocolate shop and finally park yourself at very small cafe with hot chocolate served for the museum visitors.", "publishedDate": "2019-07-23", "language": "en", "rating": 4}, {"id": 690997969, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d244194-r690997969-Casa_Amatller-Barcelona_Catalonia.html", "text": "This is not a Gaudi structure. Next door to Casa Batllo and just beautiful. Unique and charming and a different take on modernism.", "publishedDate": "2019-07-19", "language": "en", "rating": 5}, {"id": 690437586, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d244194-r690437586-Casa_Amatller-Barcelona_Catalonia.html", "text": "Casa Amatller (Josep Puig i Cadafalch) is located on the Passeig de Gràcia in the Eixample district. It forms part of a row of houses known as the Illa de la Discòrdia (the \"Block of Discord\"), which consists of five buildings by noted Modernista architects (Josep Puig i Cadafalch, Antoni Gaudi, Lluís Domènech i Montaner, Enric Sagnier & Marceliano Coquillat + Jaume Brossa) of Barcelona. The building was originally designed as a residence for chocolatier Antoni Amatller and was constructed between 1898 and 1900. This building combines the neo-Gothic style with a ridged façade inspired by houses in the Netherlands and incorporated Germanic elements. The Germanic element is the bold ridged cornice, highlighted with ceramic tiles, which makes this building standout.  Another sight not to be missed.", "publishedDate": "2019-07-17", "language": "en", "rating": 4}, {"id": 690101161, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d244194-r690101161-Casa_Amatller-Barcelona_Catalonia.html", "text": "We went in used the bathroom and bought snacks and coffee at the coffee shop.\nWalking through the lobby you do get a peek into the architecture of the building.\nWe didn't do this 2yrs ago but glad we did this time.\nAll the buildings on the Block of Discord are worth seeing and this one is no exception.", "publishedDate": "2019-07-16", "language": "en", "rating": 5}, {"id": 689585100, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d244194-r689585100-Casa_Amatller-Barcelona_Catalonia.html", "text": "The Casa Amatller is a building on Passeig de Gracia. Designed by Josep Puig i Cadafalch, it one of the finest examples of Catalan Modernism in Barcelona and adjacent to Casa Batllo, the better known and masterpiece of said architectural style. If you’ve already been to the Casa Batllo, then expect pretty much the same, unless your architectural knowledge is at the level of an expert and the subtle differences would not escape you. There are some interesting differences that are more obvious such as more Gothic influences that make it a nice complementary visit alongside Casa Batllo. The facade is especially stunning with it’s dark yellow sgraffito floral motifs. The upper facade is especially stunning as it looks like so opulent with like fairytale like multi-coloured tiles, not unlike something you’d see on an especially colourful gingerbread house.\n\nAlong wtht Casa Batllo and Casa Lleo Morera, they make beautiful building triplet, though I would not suffer the fate of Paris by choosing one over the other.", "publishedDate": "2019-07-14", "language": "en", "rating": 5}, {"id": 686616684, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d244194-r686616684-Casa_Amatller-Barcelona_Catalonia.html", "text": "I visited this house, after visting Casa Batllo and I was impressed by its modern architecture and interior design. It is well worth a visit. And afterwards you can try some nice choc. I have taken the guided tour which is partially made via technology, partially by a person as I prefer also to find out things about the place aad put things into context.", "publishedDate": "2019-07-03", "language": "en", "rating": 5}, {"id": 686474686, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d244194-r686474686-Casa_Amatller-Barcelona_Catalonia.html", "text": "Lovely restoration/preservation of a family residence.  Get the audio tour for less money than the guided one.  The attendant comes with you on the audio tour so you can ask as many questions as you want without the upcharge.  Incredible chocolate fondue at the end included in the price, skip breakfast and eat that instead,  nice shop to buy chocolate at reasonable prices as well as a café.", "publishedDate": "2019-07-03", "language": "en", "rating": 5}, {"id": 686461463, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d244194-r686461463-Casa_Amatller-Barcelona_Catalonia.html", "text": "We took a guided tour of this building which is right next to Casa Battlo (We had seen Battlo on an earlier trip). While there were long lines for Casa Battlo we got right in here and had an excellent tour with Elena who took just the two of us through the whole house. She gave us many details that we never would have learned otherwise and we felt like we really got to know the Amatler family and what their life was like here. Of particular interest is that the house is nearly identical to how it appeared when they lived here as a result of the fact that they took many pictures of the rooms and that the house passed directly from the family to the foundation that now runs it  Even the furniture is almost entirely original and as it was designed by the architect who designed the house, it is an important aspect of the experience. All in all it was a better tour than the Battlo house and topped off with two cups of excellent drinking chocolate.", "publishedDate": "2019-07-03", "language": "en", "rating": 5}, {"id": 686420064, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d244194-r686420064-Casa_Amatller-Barcelona_Catalonia.html", "text": "I only found out about this place after visiting its neighbouring building, Casa Batllo. And its just as amazing. ", "publishedDate": "2019-07-03", "language": "en", "rating": 5}, {"id": 686152287, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d244194-r686152287-Casa_Amatller-Barcelona_Catalonia.html", "text": "One of the wonder-buildings of Barcelona one must walk along this famous street, Passeig de Gracia Where you can find the other well-kniwn buildings like Casa Battlo, or Casa Mila.", "publishedDate": "2019-07-02", "language": "en", "rating": 5}, {"id": 685756661, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d244194-r685756661-Casa_Amatller-Barcelona_Catalonia.html", "text": "As we visited the Sagrada Familia , Caso Batllo, Casa Milà, Park Guell, we only observed this building from the outside. Would have love to go inside but it really gets expensive when you want to visit all Gaudi’s buildings.", "publishedDate": "2019-07-01", "language": "en", "rating": 4}, {"id": 685430980, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d244194-r685430980-Casa_Amatller-Barcelona_Catalonia.html", "text": "This buildings architecture is a little different the Gaudis other buildings. You can take a look around the base floor then go visit the chocolate shop. Amazing selection of chocolates and a cafe as well. ", "publishedDate": "2019-06-30", "language": "en", "rating": 5}, {"id": 682067787, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d244194-r682067787-Casa_Amatller-Barcelona_Catalonia.html", "text": "If you are staying in the area you will most likely walk past this building anyway and it is worth a few moments to take in the facade.", "publishedDate": "2019-06-16", "language": "en", "rating": 4}, {"id": 680526852, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d244194-r680526852-Casa_Amatller-Barcelona_Catalonia.html", "text": "It was great! Beautiful, very detailed, ancient. Loved it. We will definitely come back as soon as possible to visit it again and to see more of it.", "publishedDate": "2019-06-10", "language": "en", "rating": 5}, {"id": 680092349, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d244194-r680092349-Casa_Amatller-Barcelona_Catalonia.html", "text": "If you're planning to visit Casa Batlló, Casa Amatller is just next door and although it isn't by Gaudi, this modernist architecture was truly amazing with hints of gothic styles. It was absolutely breathtaking and worth the visit!", "publishedDate": "2019-06-08", "language": "en", "rating": 5}, {"id": 677937704, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d244194-r677937704-Casa_Amatller-Barcelona_Catalonia.html", "text": "Casa Amatller is an amazing architecture jewel in Barcelona. Almost everything is restored to the original status, and the house itself is breathtaking. Highly recommend.", "publishedDate": "2019-05-31", "language": "en", "rating": 5}, {"id": 677656692, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d244194-r677656692-Casa_Amatller-Barcelona_Catalonia.html", "text": "Taking the Barcelona Walking Tours - Modernism was such a treat.\nFirst off, we were only two with a guide which was unexpected by all. But Alex, our guide, was not only well read but also an excellent speaker towards Modernism. It helps as I have more than a passing interest and knowledge in Barcelona’s architectural legacy, but Alex brought such a solid voice to the subject I thought he’d written the book!\nCasa Amatller is the epitome of the Modernism era. It’s all about chocolate because of the Belgium aristocracy but the building has been so well preserved it was to walk through history this day. And please try the chocolate samples - yikes, good!", "publishedDate": "2019-05-30", "language": "en", "rating": 5}, {"id": 677578496, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d244194-r677578496-Casa_Amatller-Barcelona_Catalonia.html", "text": "Casa Amatller is an amazing building. one of the best examples of the modernist style of architecture. Casa Amatller, Casa Batlló and Casa Lleó-Morera, make up the three most important buildings in Barcelona's famous Illa de la Discòrdia or \"Block of Discord\", which is famous for its unique modernist buildings. This is a must see!", "publishedDate": "2019-05-30", "language": "en", "rating": 5}, {"id": 677441696, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d244194-r677441696-Casa_Amatller-Barcelona_Catalonia.html", "text": "We only did this tour because we arrived at Casa Batllo next door an hour before our ticket time - and they wouldn't let us in early. But what a treat!!!!  The technology assisted tour was great - exactly the right length at about 45 minutes - and the house itself is an underappreciated gem that is outshone by its more famous next door neighbour. Don't choose between them - make sure you do both!!", "publishedDate": "2019-05-29", "language": "en", "rating": 5}, {"id": 676426162, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d244194-r676426162-Casa_Amatller-Barcelona_Catalonia.html", "text": "This building was constructed for the owner around 1905 and bequeathed to a not-for-profit foundation by his daughter and only heir in 1945. It is untouched by time and a fascinating look at the singular architectural vision of its owner, combining Catalan, Moorish and Art Nouveau influences into something entirely different than the more famous building next door (Casa Batllo). The associated Amatiler cafe and chocolate shop at street level (free admittance) is an excellent choice for either breakfast or lunch.", "publishedDate": "2019-05-25", "language": "en", "rating": 5}, {"id": 675447148, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d244194-r675447148-Casa_Amatller-Barcelona_Catalonia.html", "text": "Fantastic architecture of the building with a very decorative stairs, doors, windows and pillars. Rich owner and an imaginative architect have created this masterpiece. Its a must to visit in Barcelona.", "publishedDate": "2019-05-21", "language": "en", "rating": 5}, {"id": 675053264, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d244194-r675053264-Casa_Amatller-Barcelona_Catalonia.html", "text": "A highlight of my visit, Casa Amatller did not disappoint. The house is spectacular. I was lucky enough to attend a tour led by Isabel whose enthusiasm and appreciation for the house and its history were contagious!", "publishedDate": "2019-05-19", "language": "en", "rating": 5}, {"id": 674459617, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d244194-r674459617-Casa_Amatller-Barcelona_Catalonia.html", "text": "While everyone is next door in line to see Casa Batilo, make sure to see this exquisite house next door. I saved 15% booking directly online. Amatller was a chocolatier who built the for him and his daughter. Beautiful furnitureand  stained glass. And a cup of hot chocolate with bread from the chocolate shop on ground floor included. Loved every part of it. Better than Gaudí  1 hour", "publishedDate": "2019-05-16", "language": "en", "rating": 5}, {"id": 673395282, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d244194-r673395282-Casa_Amatller-Barcelona_Catalonia.html", "text": "After a day walking around to check out Gaudi’s work, I took a respite and check works of different Masters. Casa Amatller did not disappoint.\n\nAnd having chocolate after the tour is just cherry on top ❤️", "publishedDate": "2019-05-12", "language": "en", "rating": 5}, {"id": 673275353, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d244194-r673275353-Casa_Amatller-Barcelona_Catalonia.html", "text": "The tour guide, Nuria, was amazing! The tour is detailed, in the history of the House, the family, and the architect. The house is beautiful, with the original decoration and furniture, continuously being renovated. \nA jewel of Barcelona and an awesome tour, with chocolate at the end :)", "publishedDate": "2019-05-11", "language": "en", "rating": 5}, {"id": 671555112, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d244194-r671555112-Casa_Amatller-Barcelona_Catalonia.html", "text": "Although we didn't do the tour of Casa Amatller as I was not aware of a tour we did stop in to visit their chocolate shop.  We stopped because we were immediately next door doing a tour of Casa Batlló and we had heard that this building was the house of a chocolatier.  Casa Amatller was the home of famed chocolatier, Antoni Amatller Costa (1851-1910) and is one of Barcelona's most mind-boggling buildings. Spot the dragons, knights, and other mythical characters on the facade, and explore one of architect Cadafalch's most incredible works. Best of all, you'll get to sample the legendary chocolate at the end! The thick hot chocolate that we ordered was a huge surprise as it was the best chocolate I have ever had hands down! The scale for comparison is going to be hard to beat.", "publishedDate": "2019-05-05", "language": "en", "rating": 5}, {"id": 668655097, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d244194-r668655097-Casa_Amatller-Barcelona_Catalonia.html", "text": "Casa Amatler is right next to Casa Batilo, but not as a famous. This made it easier to get in and we took a guided tour, which was really nice. The house is amazing inside and well preserved. At the end of the tour you get a taste of the amazing chocolate made by the chocolatier home owner, Mr. Amatler. Highly recommend it.", "publishedDate": "2019-04-23", "language": "en", "rating": 5}, {"id": 668588127, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d244194-r668588127-Casa_Amatller-Barcelona_Catalonia.html", "text": "we enjoyed main places here where local food is near to it which is very main thing to spend long time here", "publishedDate": "2019-04-23", "language": "en", "rating": 4}, {"id": 664199299, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d244194-r664199299-Casa_Amatller-Barcelona_Catalonia.html", "text": "Beautiful well kept house - amazing architecture and glass work. The hot chocolate is a must. Delicious.", "publishedDate": "2019-04-06", "language": "en", "rating": 5}, {"id": 663229979, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d244194-r663229979-Casa_Amatller-Barcelona_Catalonia.html", "text": "We did not see Casa Batlio because it was under extensive renovation and everyone said not worth full admission price for what you would see (even the guide at Casa Milà). We went next door instead. Delightful guide and very different architecture. Tile work incredible and best part was that the house was owned and renovated by a master chocolatier so you get a cup on incredible chocolate and biscotti at the end. ", "publishedDate": "2019-04-02", "language": "en", "rating": 5}, {"id": 662738309, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d244194-r662738309-Casa_Amatller-Barcelona_Catalonia.html", "text": "Fun visit without the huge crowds nearby at Casa Batllo and La Pedrera. Well worth a visit. Highly recommend. ", "publishedDate": "2019-04-01", "language": "en", "rating": 5}, {"id": 662502167, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d244194-r662502167-Casa_Amatller-Barcelona_Catalonia.html", "text": "Loved the visit to this house, nice history and family memories. All original rooms and well instructed guides. Was a great surprise to discover at this discreet entreance right beside Casa Battlo museum.", "publishedDate": "2019-03-31", "language": "en", "rating": 5}, {"id": 661226637, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d244194-r661226637-Casa_Amatller-Barcelona_Catalonia.html", "text": "We recently decided to take the tour of the Casa Amatller, despite the hefty entrance cost  (but it was slightly less expensive than the cost of getting into a Gaudí apartment such as Casa Mila or Casa Batló)\n\nThe \"Casa\" consists essentially of most of the first floor of the building, which constitutes the residence of the owner of a locally well-known chocolate company and his unmarried daughter who continued to reside in the apartment for a couple of decades after her father's death.\n\nThe home is quite beautiful, in that early 20th century way.  It is not a Gaudí home, but is in a sort of Moorish-Gothic Arts & Crafts style.  Interesting and unique.\n\nThe group was quite small (6 in total) and the tour guide was pleasant, engaging and spoke excellent English.  Much of the information was delivered to us via a tablet + headphones.  Interesting way to do it, and not without its little glitchy moments when we pressed wrong buttons.  \n\nAfter the tour we were treated to complimentary hot chocolate and lovely toasted bread served in the atrium on the ground floor.  Very nice touch.\n\nI am glad we decided to take the tour as it was an interesting and beautiful home, and a change of pace from Gaudí.", "publishedDate": "2019-03-25", "language": "en", "rating": 4}, {"id": 660966050, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d244194-r660966050-Casa_Amatller-Barcelona_Catalonia.html", "text": "It's not a house of chocolates (well they do have a store and cafe inside), but it's much more known for its exterior designed Moorish and neo-Gothic exterior patterns and architecture.  On the \"block of discord\" along with Casa Batllo, it's clearly distinctive and non-Gaudi-ish.  With that, you should admire the exterior for its unique features.  \n\nThen, walk inside and check out the lobby area.  You can schedule a tour of some of the interior areas, but we did not do that due to time constraints.  I'm not sure if we would return for a tour though.  It was more interesting to us from the outside.", "publishedDate": "2019-03-24", "language": "en", "rating": 4}, {"id": 654510022, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d244194-r654510022-Casa_Amatller-Barcelona_Catalonia.html", "text": "A gem of modernisme, this apartment once belonged to a wealthy chocolatier. It has been restored to it's original opulence and will be of interest to anyone interested in architecture (or chocolate! Best hot chocolate ever is part of the tour). our guide was knowledgeable and friendly and clearly loves this house. Don't miss this one.", "publishedDate": "2019-02-24", "language": "en", "rating": 5}, {"id": 649804592, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d244194-r649804592-Casa_Amatller-Barcelona_Catalonia.html", "text": "A great visit, a travel to the XIX Barcelona. The modernist style will conquer you. After the visit a true hot chocolate in the coffee bar downstairs is obligated!", "publishedDate": "2019-02-03", "language": "en", "rating": 5}, {"id": 649002783, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d244194-r649002783-Casa_Amatller-Barcelona_Catalonia.html", "text": "Casa Battlo gets more attention, but this is an equally cool building. Full disclosure, we only saw it from the outside but it was a nice stop and we got some good pictures.", "publishedDate": "2019-01-29", "language": "en", "rating": 5}, {"id": 648092011, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d244194-r648092011-Casa_Amatller-Barcelona_Catalonia.html", "text": "Although right next-door to Casa Batllo, or perhaps precisely because of this, Casa Amatller is often bypassed by tourists. Which was great because we didn't have to wait in line to buy tickets. But it would be an undeserved disservice not to recommend a visit to it in the highest possible terms. The simple truth is that Casa Amatller is a jewel of Catalan Modernisme, impressive in every respect. The accompanying audio guide is informative and helpful. The house has been lovingly restored and, with original furnishings, is an eloquent testament of the life of the bourgeoisie in the 19th century. The visit includes a cup of delicious chocolate. ", "publishedDate": "2019-01-24", "language": "en", "rating": 5}, {"id": 646962553, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d244194-r646962553-Casa_Amatller-Barcelona_Catalonia.html", "text": "I only saw Casa Amatller from the outside when walking along the Passieg de Gracia. It is next door to Casa Batilo, and has a different architectural style.", "publishedDate": "2019-01-19", "language": "en", "rating": 4}, {"id": 646730488, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d244194-r646730488-Casa_Amatller-Barcelona_Catalonia.html", "text": "modernist house built by Puig i Cadafalch arquitect. Belonged to a Chocolate factory family. It's a must if you visit bcn", "publishedDate": "2019-01-17", "language": "en", "rating": 5}, {"id": 646113613, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d244194-r646113613-Casa_Amatller-Barcelona_Catalonia.html", "text": "The Amatller House was originally built by Antoni Robert in 1875. Surrounded by two other buildings, it did not stand out from anything else. It was bought in March 1898 by chocolate maker Antoni Amatller i Costa. Josep Puig and Cadafalch were the architect who changed this house in the spirit of Modernism but also combining Gothic elements. The original furniture and art collections are preserved inside the house. is a very beautiful house that lives in the shade of the bathlo house. do not miss it. it is worth this visit that ends with a warm chocolate serving. in the house's store, chocolate is sold with hundreds of years old recipes. if you purchased a city bus there is also a discount that you can use to buy the ticket.", "publishedDate": "2019-01-15", "language": "en", "rating": 5}, {"id": 645722601, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d244194-r645722601-Casa_Amatller-Barcelona_Catalonia.html", "text": "This was an interesting House Museum sitting next to one of the Gaudi Blockbuster houses. You need to book your tours most likely in advance as small groups of people are escorted through a large number of rooms that have been kept together as a house as it was most of the 1900s. The person who accompanied our group spoke excellent English and Spanish. You listen to dialogue about the rooms on a handheld device you carry with you that provides information in a range of languages. This was a pleasant tour that ended in the chocolate shop on the main floor. Why a chocolate shop? Well the owners of the building and property also own the chocolate company. After tasting a nice traditional chocolate we also had a cup of excellent hot chocolate while sitting in the stairs at the entry to the house. This house is well worth seeing.", "publishedDate": "2019-01-14", "language": "en", "rating": 5}, {"id": 642723727, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d244194-r642723727-Casa_Amatller-Barcelona_Catalonia.html", "text": "This building is next door to the more famous Casa Batlló and thus pales in comparison initially but there is an elegance and beauty present which I found lacking in the more audacious Casa Batlló", "publishedDate": "2018-12-31", "language": "en", "rating": 4}, {"id": 642688584, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d244194-r642688584-Casa_Amatller-Barcelona_Catalonia.html", "text": "The building is exception on the exterior. You go inside and take the tour you find that the interior in about as beautiful. After the tour we had a chocolate sample and you have to buy some of the chocolate in the store your standing in. A hot chocolate you are also given is exceptional.", "publishedDate": "2018-12-31", "language": "en", "rating": 5}, {"id": 641802313, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d244194-r641802313-Casa_Amatller-Barcelona_Catalonia.html", "text": "There's no doubt that this is a lovely building and some say it has more to offer than Casa Batllo. However, as it stands in the shadow of Casa Batllo next door it sort of loses it's appeal when looking at them both together as Casa Batllo is the more impressive.", "publishedDate": "2018-12-27", "language": "en", "rating": 4}, {"id": 636828715, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d244194-r636828715-Casa_Amatller-Barcelona_Catalonia.html", "text": "I've lived in the city for two years and this was my first visit to the house. It is a wonderful experience!   \nThe house is so well maintained:   You even have to wear little booties on your shoes during the tour to protect the floor.  \nAfterwards we had a cup of hot chocolate and warm bread for dipping.  Delicious!", "publishedDate": "2018-12-01", "language": "en", "rating": 5}, {"id": 635420546, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d244194-r635420546-Casa_Amatller-Barcelona_Catalonia.html", "text": "Casa Amatller is a building in the Modernisme style in Barcelona. Along with Casa Batlo and Casa Lleo-Morera, it makes up the three most important buildings in Barcelona's famous Illa de la Discordia (\"Block of Discord\"), noted for its unique modernist buildings.", "publishedDate": "2018-11-24", "language": "en", "rating": 4}, {"id": 635102536, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d244194-r635102536-Casa_Amatller-Barcelona_Catalonia.html", "text": "At first I thought that this was part of The Casa but found out that it isn't. It is a separate place and doesn't have the crowds but there is amazing architecture and my wife loved the chocolate. Beautiful furnishings and stained glass just amazing.", "publishedDate": "2018-11-22", "language": "en", "rating": 4}, {"id": 631518231, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d244194-r631518231-Casa_Amatller-Barcelona_Catalonia.html", "text": "This building is next to and overshadowed by Casa Batlló. It was designed by a famous Catalan architect, Josep Puig i Cadafalch and built in 1900 for a chocolatier Antoni Amatller.  \n\nIt was designed in Modernism style but inside there is a mixture of Gothic and other style. The English guided tour (lasting around 1 hour) gives you a detailed account of its history and ended with a yummy hot or cold chocolate drink. It is relatively well-preserved as it has miraculously and mysteriously survived the Spanish civil war. Antoni Amatller was also very keen on foreign travel photography and collecting rare items. The house gives you a good idea of a rich man’s life around early 20th century.\n\nToday Antoni Amatller’s chocolate factory no longer exists though Amatller’s brand of chocolate (made by another chocolatier) is sold in the gift shop. There is a nice coffee shop right behind the entrance hall you can get in without requiring any entrance ticket to the house.", "publishedDate": "2018-11-06", "language": "en", "rating": 4}, {"id": 631401644, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d244194-r631401644-Casa_Amatller-Barcelona_Catalonia.html", "text": "We didn't go in but we enjoyed visiting the Casa.  It's a very interesting building from an architectural perspective.", "publishedDate": "2018-11-06", "language": "en", "rating": 4}, {"id": 630082076, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d244194-r630082076-Casa_Amatller-Barcelona_Catalonia.html", "text": "Beautiful home filled with stained glass next door to Casa Battló.  Small group tours with video guides and no crowds.  Loved this place.  Highly recommend.", "publishedDate": "2018-11-01", "language": "en", "rating": 5}, {"id": 629471874, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d244194-r629471874-Casa_Amatller-Barcelona_Catalonia.html", "text": "For reasons that I assume have to do with Gaudi's greater name recognition, there is constantly a very long line waiting to enter the Casa Battlo, suggesting a packed interior as well, but not a single person waiting to see Puig i Cadafalch's stunning Casa Amatller right next door.  We skipped the former and enjoyed what was essentially a private tour of the latter--the only two visitors to the building at the time.  And it's a gorgeous structure well worth seeing, all the more so since there is less chance you will have to contend with a crowd.", "publishedDate": "2018-10-29", "language": "en", "rating": 5}, {"id": 628787114, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d244194-r628787114-Casa_Amatller-Barcelona_Catalonia.html", "text": "Guys, best choc drink in spain (possibly the world)!  Period!  Maybe except for Laderach Choc of Swiss but they dont do drinks.  PAY & VISIT the museum upstairs!  More interesting & decorative than Casa Batllo.  Yes yes yes Gaudi is more famous but really do yourself a favor & check it out after you finish Casa Batllo.", "publishedDate": "2018-10-27", "language": "en", "rating": 5}, {"id": 626726912, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d244194-r626726912-Casa_Amatller-Barcelona_Catalonia.html", "text": "Another historic architectural land Mark that is worth seeing from the street. Lots of tourists taking pictures.  ", "publishedDate": "2018-10-20", "language": "en", "rating": 4}, {"id": 626590788, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d244194-r626590788-Casa_Amatller-Barcelona_Catalonia.html", "text": "This house has no such fame as the houses of Gaudi. But it is no less beautiful and deserves your visit. Mansion maintained in perfect condition. The rooms are fully furnished. There are chandeliers, paintings, books and other interior items. There is even a bathroom and toilet. What gives the sensation of the presence of its inhabitants. In addition, there is a great service. Tourists can only take place in small groups, giving extra comfort. The last pleasur is a cup of delicious hot chocolate.", "publishedDate": "2018-10-19", "language": "en", "rating": 5}, {"id": 625734285, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d244194-r625734285-Casa_Amatller-Barcelona_Catalonia.html", "text": "This place is a must visit. A beautiful house kept in amazing condition with very interesting history on Puig and the chocolatier family who lived here. Taking the tour also allows visitors to try some of the exquisite chocolate on offer - recommend the thick, hot chocolate served with bread at the end rather than the milkshake chocolate option. \n\nThe staff were very willing to answer questions and the audioguide itself was thoroughly informative. ", "publishedDate": "2018-10-17", "language": "en", "rating": 5}, {"id": 624855900, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d244194-r624855900-Casa_Amatller-Barcelona_Catalonia.html", "text": "We went right after Casa Batllo and loved it. We were the only ones on our tour, which included chocolate at the end. It was an unexpected highlight of our trip, with a lot of the original furniture.", "publishedDate": "2018-10-14", "language": "en", "rating": 5}, {"id": 623004164, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d244194-r623004164-Casa_Amatller-Barcelona_Catalonia.html", "text": "If you like unusual architecture, this is the place to see. The surroundings are beautiful and each building has its own architectural story to tell. A very popular touristic place so you might want to check when is the best time to go. We went in early evening and it was not as busy at that time..", "publishedDate": "2018-10-07", "language": "en", "rating": 5}, {"id": 622673181, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d244194-r622673181-Casa_Amatller-Barcelona_Catalonia.html", "text": "...you've had the amazing Barcelona hot chocolate! One of the better place to have it is Chocolate Amatller, right in the Casa Amatller.  To call it thick would be quite an understatement.  It almost has the consistency of hot pudding. It is served in an espresso cup with some toasted bread.  Oh, so good!", "publishedDate": "2018-10-06", "language": "en", "rating": 5}, {"id": 618763511, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d244194-r618763511-Casa_Amatller-Barcelona_Catalonia.html", "text": "There is so much mathematics here. It is just mindboggling the shapes, symmetry and a building belonging in a fairytale. It struck me again how many hundreds of years the architectures were ahead of their time. It is super intelligent the way it is done. Kids can try to re produce it with lego blocks. You must go and sree it in Barcelona and kids must visit it.", "publishedDate": "2018-09-22", "language": "en", "rating": 5}, {"id": 616740161, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d244194-r616740161-Casa_Amatller-Barcelona_Catalonia.html", "text": "The outside of this building is very decorative, and is situated adjacent to Casa Batllo.\nI can highly recommend the Bakery/Cafe which is situated by passing through this building.", "publishedDate": "2018-09-15", "language": "en", "rating": 3}, {"id": 615882095, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d244194-r615882095-Casa_Amatller-Barcelona_Catalonia.html", "text": "Relly nice to see. great coffee place inside, with very good chocolate to buy. I took a lot of it with me :)", "publishedDate": "2018-09-12", "language": "en", "rating": 5}, {"id": 614532090, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d244194-r614532090-Casa_Amatller-Barcelona_Catalonia.html", "text": "Really nice surprise, this house conserves all the real decoration and furniture so you can really see how it was used. every single step you make you discover something more extravagant or curious. The 40 min tour is a little short if you really want to appreciate all the details from every single room. Don t miss the hot chocolate at the end it's amazing!!!", "publishedDate": "2018-09-07", "language": "en", "rating": 5}, {"id": 610771133, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d244194-r610771133-Casa_Amatller-Barcelona_Catalonia.html", "text": "Being huge architecture fans and having visited all the Gaudi properties in Barcelona, some more than once, we suddenly noticed this beautiful house next door to the heaving (but stunning and must see!) Casa Batllo. The modernist house has beautifully preserved furniture, mosaic floors and wall coverings etc and my daughter and I enjoyed being the only people in the building with plenty of time to examine all the details and take photos. The multimedia guide was brief but perfectly pitched and contained all the right detail. After the tour you are then taken to the chocolate shop and given a cup of complimentary chocolate caliente to enjoy in a private area in the entrance hallway. A thoroughly enjoyable way to spend an hour and a half on Passeig de Gracia. ", "publishedDate": "2018-08-27", "language": "en", "rating": 5}, {"id": 608416150, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d244194-r608416150-Casa_Amatller-Barcelona_Catalonia.html", "text": "We did not take a tour.  Stopped and bought candy.  Actually if you want candy I would suggest going to one of the candy shops on the sidestreets where it is not prepackaged", "publishedDate": "2018-08-20", "language": "en", "rating": 3}, {"id": 606992769, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d244194-r606992769-Casa_Amatller-Barcelona_Catalonia.html", "text": "Since Casa Amatller was not a Gaudi’s project and also has casa Battlo as a neighbor, it is a way less popular destination for tourists. It is in a way unfortunate, because this mansion is incredible, but at the same time it is good as there are no queues and the entrance ticket is cheaper. The insides are marvelous and offer a visitor all the splendor of the modernism touch on Gothic style. As the original owner had a chocolate business, the ground floor of the museum has a chocolate shop and a cafe, where you will enjoy a cup of delicious hot chocolate included in the price at the end of your visit. The stuff is friendly and helpful. If you are into modernism, this visit is a must!", "publishedDate": "2018-08-16", "language": "en", "rating": 5}, {"id": 606601917, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d244194-r606601917-Casa_Amatller-Barcelona_Catalonia.html", "text": "Unlike the popular Casa Batllo with long queues, this museum was quiet with no queue at all. I needed to deposit backpack in locker and wore shoe covers to protect the flooring. Visitors must join guided tour every 1 hour apart. For my group, there were only 4 of us. We were first issued audio headset of preferred languages. Staff basically brought us to different rooms and gave us ample time to listen to audio commentaries and take photos. I enjoyed visiting the various rooms & its exhibits - beautifully designed and well maintained. At the end of the tour, I was given 1 piece of chocolate and a hot chocolate drink, which was included in my ticket. \n\nRecommend to visit if you have about an hour to spare. Else suggest to visit the more popular Casa Batllo instead.", "publishedDate": "2018-08-15", "language": "en", "rating": 5}]}}]