[{"locationId": 1893220, "name": "Museu del Modernisme", "placeType": "ATTRACTION", "reviewListPage": {"reviews": [{"id": 741809081, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d1893220-r741809081-Museu_del_Modernisme-Barcelona_Catalonia.html", "text": "This museum shows how wealthy Barcelonians would have furnished their homes during the period 1890-1920 or so.  There is a good collection of art nouveau furniture, several pianos, stained glass, a stunning mosaic elevator shaft, and some interesting pieces designed by Gaudi.", "publishedDate": "2020-01-28", "language": "en", "rating": 4}, {"id": 734503946, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d1893220-r734503946-Museu_del_Modernisme-Barcelona_Catalonia.html", "text": "We enjoyed this reallly nice smaller museum. it contains many painting, furnishing, etc. of the moderisme period.  We reallly enjoyed it and were sorry to see that so few people were visiting.  I promised to post something about it for that reason.", "publishedDate": "2019-12-24", "language": "en", "rating": 5}, {"id": 718296589, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d1893220-r718296589-Museu_del_Modernisme-Barcelona_Catalonia.html", "text": "Fantastic place, a collection of beautiful pieces, upstairs is mostly furniture in art nouveau style as interpreted by Catalonian artists. There are some exquisite pieces in dark woods inlaid with lighter woods to accentuate the design.\n Downstairs there is the collection of painting and sculpture- again very beautiful.\nWe visited immediately after the Casa Batllo and were interested to see Gaudi furniture immediately after that.\nHighly recommended!", "publishedDate": "2019-10-14", "language": "en", "rating": 5}, {"id": 708228114, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d1893220-r708228114-Museu_del_Modernisme-Barcelona_Catalonia.html", "text": "Every little corner has information, history, detail. Vale la pena ir! All the city itself is magical, something to enjoy and remember...", "publishedDate": "2019-09-09", "language": "en", "rating": 5}, {"id": 701152251, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d1893220-r701152251-Museu_del_Modernisme-Barcelona_Catalonia.html", "text": "Short and sweet lots of military history for some reason when we went. A good museum nice displays and interesting furniture too...", "publishedDate": "2019-08-20", "language": "en", "rating": 4}, {"id": 695398635, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d1893220-r695398635-Museu_del_Modernisme-Barcelona_Catalonia.html", "text": "A very pleasant, quiet, museum on two floors. Nothing in itself was amazing but the total effect was well received and, at times, amusing. Definitely worth a visit.", "publishedDate": "2019-08-04", "language": "en", "rating": 4}, {"id": 682293190, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d1893220-r682293190-Museu_del_Modernisme-Barcelona_Catalonia.html", "text": "This small museum of furniture and decorative items is a real treat for fans of modernismo/art nouveau. It also has a small but interesting gift shop.", "publishedDate": "2019-06-17", "language": "en", "rating": 4}, {"id": 677915058, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d1893220-r677915058-Museu_del_Modernisme-Barcelona_Catalonia.html", "text": "It wasn't quite what we were expecting and is a small museum, more like a personal collection of items.  Nicely done but perhaps we were just 'museumed out'.  Seemed expensive for what we saw.  Old fashioned laminated explanation sheets available in different languages.  DIY coffee available.", "publishedDate": "2019-05-31", "language": "en", "rating": 3}, {"id": 674416102, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d1893220-r674416102-Museu_del_Modernisme-Barcelona_Catalonia.html", "text": "A fairly small museum with lots of varied exhibits, furniture, ceramics, paintings sculptures etc. Some of them are beautiful, but I do find some rather over ornate and self indulgent. Still its well worth a visit and will take a pleasant hour or so to look round. Free with the Barcelona card, and as you wander you can contemplate why young ladies seem only to display emotions for sculptures while naked.", "publishedDate": "2019-05-16", "language": "en", "rating": 4}, {"id": 662698040, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d1893220-r662698040-Museu_del_Modernisme-Barcelona_Catalonia.html", "text": "We arrived early and had wonderfull experience being able to just wander around by ourselves and see some of the best examples of Gaudi’s furniture as well as pieces by his contemporaries. Being able to see the fine marquetry and lead light and decorative arts up close without being jostled or pushed or hurried was a real treat. I also have to say that their gift shop was great and the prices were well bellow the prices in the gift shops in the Gaudi houses", "publishedDate": "2019-04-01", "language": "en", "rating": 5}, {"id": 662697061, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d1893220-r662697061-Museu_del_Modernisme-Barcelona_Catalonia.html", "text": "Close to Casa Bartilo, this was a wonderful unexpected find visited free with a Barcelona Card, but I will pay to visit this collection again. Turn of the century furniture is a passion of mine, and this is the finest collection I've seen in 50 years of travel. Even the locals know little of it as the museum has no advertising budget. There is a nice collection of Ramon Casas paintings downstairs and original Gaudi furniture upstairs (more than Casa Bartilo!), but the other furniture, silver, stained glass and terracotta busts are the stars here. This is a small museum, but filled two hours and, if furniture and design is your thing, you will return. The gift shop souvenirs were also of a much higher quality and cheaper than elsewhere in Barcelona. It is worth a trip too.", "publishedDate": "2019-04-01", "language": "en", "rating": 5}, {"id": 661519963, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d1893220-r661519963-Museu_del_Modernisme-Barcelona_Catalonia.html", "text": "This is a small museum, it is not worth a detour, but if you are around why not? For me the highlight was some of the furniture from the catalan modernism, especially the pieces that Gaudi designed and were originally placed in some of his buildings. There is also some paintings and sculptures that I did not find very interesting.", "publishedDate": "2019-03-26", "language": "en", "rating": 3}, {"id": 661219030, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d1893220-r661219030-Museu_del_Modernisme-Barcelona_Catalonia.html", "text": "I was born and raised in Barcelona, currently living abroad. I have visited this Museum for the first time this year: A true little gem! Excellent artwork, excellent space with an unusual, intimate make-your-own coffee area plus a unique little library/shop with well selected books and gifts. The service and attention provided by the young lady at the entrance was also perfect. Can't wait to be back!", "publishedDate": "2019-03-25", "language": "en", "rating": 5}, {"id": 658302419, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d1893220-r658302419-Museu_del_Modernisme-Barcelona_Catalonia.html", "text": "Boy, did I enjoy this museum and would like to see it again.  It has some beautiful pieces of furniture and stained glass.  It's a small museum so I only spent around 60 to 90 minutes there but they were a very enjoyable 60 to 90 minutes.  And it was pleasantly uncrowded.", "publishedDate": "2019-03-13", "language": "en", "rating": 5}, {"id": 654513533, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d1893220-r654513533-Museu_del_Modernisme-Barcelona_Catalonia.html", "text": "We stumbled upon this little museum because we were looking for a bookstore and this museu was on our way. So glad we found it. We discovered modernist architects beyond GaudI (and liked some of them better). This was not listed in any of our guidebooks, but it is well worth a visit. It's small, so you can cover the 2 floors in about 45 minutes. Furniture and stained glass to admire (and covet) as well as paintings and sculpture. A must for all fans of modernisme.", "publishedDate": "2019-02-24", "language": "en", "rating": 5}, {"id": 653750116, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d1893220-r653750116-Museu_del_Modernisme-Barcelona_Catalonia.html", "text": "Small but perfectly formed, lovely quiet contrast to the busy high profile attractions with some beautiful art nouveau furniture, stained glass and paintings. Don’t miss if this period floats your boat.", "publishedDate": "2019-02-20", "language": "en", "rating": 5}, {"id": 647857226, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d1893220-r647857226-Museu_del_Modernisme-Barcelona_Catalonia.html", "text": "This is a beautiful collection of Catalan art nouveau, it includes paintings, sculpture and furniture from what began as a private collection in the 1970s. The museum is housed in a historic building on two floors, the layout of the collection and the quality of the exhibits are unique. It is not big and certainly not overcrowded, a bit off the beaten track. One of the best art  experiences we had in Barcelona, it contributed to our understanding of the way Catalan identity developed and was represented both in public and in private spaces. \nVery friendly atmosphere, informative texts and helpful staff.", "publishedDate": "2019-01-23", "language": "en", "rating": 5}, {"id": 647111569, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d1893220-r647111569-Museu_del_Modernisme-Barcelona_Catalonia.html", "text": "Quite a small museum but well worth a visite if you enjoy art nouveau. There are both furniture, sculptures and paintings - and even some lovely stained glass windows which I really loved.\nWe came just when they opened so we had the place to ourselves which was enjoyable.", "publishedDate": "2019-01-20", "language": "en", "rating": 5}, {"id": 645487035, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d1893220-r645487035-Museu_del_Modernisme-Barcelona_Catalonia.html", "text": "I was very impressed by the beautiful artifacts that survived demolition and is presented in this fine museum. My favorite period of the century, such fine art, such beautiful materials, wow. ", "publishedDate": "2019-01-13", "language": "en", "rating": 5}, {"id": 644752794, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d1893220-r644752794-Museu_del_Modernisme-Barcelona_Catalonia.html", "text": "A museum created from art dealers treasures highlighting the Barcelona modernism of the 1900’s of Gaudi & his crew. Wonderful furniture, sculpture, paintings, stained glass etc, really unmissable", "publishedDate": "2019-01-09", "language": "en", "rating": 5}, {"id": 639217821, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d1893220-r639217821-Museu_del_Modernisme-Barcelona_Catalonia.html", "text": "One of the most intimate, beautiful and creative collections of modernism and art nouveau I have ever seen in one place. You'll learn so much more about Gaudi, among other artists, that you never knew before!", "publishedDate": "2018-12-12", "language": "en", "rating": 5}, {"id": 635263943, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d1893220-r635263943-Museu_del_Modernisme-Barcelona_Catalonia.html", "text": "This museum is more for art lovers that enjoy the history behind a masterpiece. It shows amazing furniture pieces all in excellent shape. It also has very nice paintings and sculptures of other artists contemporary with Gaudi, and the movement of modernism during that time. I really enjoyed it and definitely recommend it.", "publishedDate": "2018-11-23", "language": "en", "rating": 5}, {"id": 583545411, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d1893220-r583545411-Museu_del_Modernisme-Barcelona_Catalonia.html", "text": "The selection of works is very good and you can see furniture, paintings, sculptures, stained glass and other objects that from Modernisme, Catalan Art Nouveau", "publishedDate": "2018-05-29", "language": "en", "rating": 4}, {"id": 578091093, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d1893220-r578091093-Museu_del_Modernisme-Barcelona_Catalonia.html", "text": "If you're in the neighborhood, have a Barcelona Museum Art Ticket, and enjoy modernism furniture and art then it's worth popping your head in. It's pretty small so you can finish it in 30 minutes or so. I woudln't pay for it if I didn't have the Art Ticket.", "publishedDate": "2018-05-05", "language": "en", "rating": 3}, {"id": 577449797, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d1893220-r577449797-Museu_del_Modernisme-Barcelona_Catalonia.html", "text": "We went to this museum to see a variety of art from Catalonia.  It included furniture, sculpture, paintings and stained glass.  I thought it was wonderful.  In the basement is some art that was probably risqué at the time.  Four women, each representing a season.  Across from this is the art by the “defender of the church”.  I’m sure the church was scandalized by some of the art.  The church defender also did sculptures of women, but they all suffered in some way, because of their sin I guess.  Upstairs was furniture by a family of upholsters and cabinet makers.  Absolutely exquisite.", "publishedDate": "2018-05-02", "language": "en", "rating": 5}, {"id": 577444299, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d1893220-r577444299-Museu_del_Modernisme-Barcelona_Catalonia.html", "text": "I am into modern furniture and it was really an art nouveau exhibit- things from around the 1900. Furniture was the highlight. It was an ok museum. If it was 3€ maybe but think it’s €10 to get in.", "publishedDate": "2018-05-02", "language": "en", "rating": 3}, {"id": 574952317, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d1893220-r574952317-Museu_del_Modernisme-Barcelona_Catalonia.html", "text": "I loved this museum mostly because of its wonderful collection of Arte Moderne furniture and stained glass work.  Not as impressed with paintings and sculpture, but still worth a visit.", "publishedDate": "2018-04-22", "language": "en", "rating": 4}, {"id": 573943059, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d1893220-r573943059-Museu_del_Modernisme-Barcelona_Catalonia.html", "text": "if you have the Barcelonacard the enterance to the museum is free. \nStained glasses are magnificent. \nIt would be great choice spending one or two hours in this museum", "publishedDate": "2018-04-17", "language": "en", "rating": 5}, {"id": 568622654, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d1893220-r568622654-Museu_del_Modernisme-Barcelona_Catalonia.html", "text": "After reading some negative reviews on this museum on the internet, I decided to check it out and see it for myself. It is a private museum housed in a Catalan modernista building (formerly a textile factory), showcasing the collection of Catalan modernista furniture/paintings/stained glass of the owner. The museum occupies a ground floor and basement (with an elevator). On the ground floor, there are lovely furniture/stained glass panels with intricate designs, by Catalan furniture designers which I don't know before. The ones that I do know are Puig i Cadafalch and Gaudi but there are only a few of their works here. Therefore, it is not a place for showcasing Gaudi's design or a full range of decorative arts objects as some visitors think. \nIn the basement, there is an exhibition on paintings/sculptures/stained glass panels of the same period, plus a short video showing the life of people in Barcelona and the background which engendered the development of the modernista style.\nI think the displays are well laid out and worth a visit. \n\nJust don't mistake that it is a museum of all the decorative arts of the Catalan modernista period.", "publishedDate": "2018-03-25", "language": "en", "rating": 4}, {"id": 554570525, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d1893220-r554570525-Museu_del_Modernisme-Barcelona_Catalonia.html", "text": "Beautiful collection in a nice and peaceful building at the centre of Barcelona! 100% recommended, won't regret it", "publishedDate": "2018-01-18", "language": "en", "rating": 5}, {"id": 543779859, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d1893220-r543779859-Museu_del_Modernisme-Barcelona_Catalonia.html", "text": "Think stained glass and fluently designed furniture from a century ago. Nice display. Relatively small, concise museum.", "publishedDate": "2017-11-28", "language": "en", "rating": 4}, {"id": 478854276, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d1893220-r478854276-Museu_del_Modernisme-Barcelona_Catalonia.html", "text": "As others have mentioned it contains a relatively small collection of works, mainly furniture, sculpture and paintings. There are no ceramics, glass works apart from panels of stained glass, metal work or jewellery. It is on two floors but the artifacts are well displayed despite the limited space. Brief notes in English are available on cards.\nThere is only one person who mans the ticket office and the shop with a rather casual attitude. We waited about ten minutes to try and pay for a book we purchased from the shop but she was too busy talking to a young man about a piece of jewellery he brought,  so we left without making the purchase.", "publishedDate": "2017-04-25", "language": "en", "rating": 4}, {"id": 464218583, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d1893220-r464218583-Museu_del_Modernisme-Barcelona_Catalonia.html", "text": "Too expensive for such a modest collection. Just 20 minutes would be enough for this place. Some paintings, furniture, sculptures. If you have free money, come there. But if you are tight on budget, better skip this place ", "publishedDate": "2017-03-03", "language": "en", "rating": 3}, {"id": 462581699, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d1893220-r462581699-Museu_del_Modernisme-Barcelona_Catalonia.html", "text": "If you are interested in Art Nouveau and want to see something other than Gaudi then this is the place. They have some amazing and beautifully made furniture, truly exquisite. Many are not suitable for the average house due to their size. The intricacies of the decoration is fantastic. In the basement, which has a lift to get, there is a display of paintings of the period. There is an audio visual display in various languages. You could go round quite quickly, but I think it is really worth taking your time if you are interested in the art work of this period.", "publishedDate": "2017-02-24", "language": "en", "rating": 5}, {"id": 461198121, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d1893220-r461198121-Museu_del_Modernisme-Barcelona_Catalonia.html", "text": "We were pleasantly surprised at the sheer variety of furniture and other items on display at this small compact museum. Downstairs there was a short 8 minute film on the art nouveau movement in the city together with some wonderful paintings and stained glass windows and tiles from a bygone age. If you are in the area it's worth a visit. ", "publishedDate": "2017-02-19", "language": "en", "rating": 4}, {"id": 457713279, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d1893220-r457713279-Museu_del_Modernisme-Barcelona_Catalonia.html", "text": "i love this era of Art nouveau so i was very happy to see all these pieces of furniture from Catalan artists. Maybe not for everyone but i enjoyed what i saw, the museum is small but it has very nice pieces of furniture from Gaudi and other less known craftmen of the Modernisme era in Catalunya.", "publishedDate": "2017-02-06", "language": "en", "rating": 4}, {"id": 427410062, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d1893220-r427410062-Museu_del_Modernisme-Barcelona_Catalonia.html", "text": "My partner and I visited this museum as we had a couple of hours to kill before our booked time slot at Park Güell (€7 entry by the way).\nWe pretty much covered the museum in 25 minutes, and that was with me taking 5 minutes out to use the bathroom. \nThere were some nice pieces of furniture here but unfortunately not enough to warrant the €10 entry fee. On the way out I asked the lady on reception if it was just 2 floors to which she said yes. Shame really, the building would have you believe there was more on offer! Disappointed!!!", "publishedDate": "2016-10-12", "language": "en", "rating": 2}, {"id": 395476338, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d1893220-r395476338-Museu_del_Modernisme-Barcelona_Catalonia.html", "text": "The Museu del Modernisme Catala is a rather small museum located in a side street off Passeig de Gracia, more or less just around the corner from Casa Battlò. I found this museum to be very interesting, as I am a lot into modernisme art. There are just two floors (ground floor and basement) but the exhibits are quite superb and give you a good overview of this style of art in its Catalan variety. They feature some of Gaudi's works too. The only negative point that I can say about this museum is that you are not allowed to take pictures. But is is still one of my favorite museums in Barcelona. Seeing all the exhibits takes about an hour, as it is rather small museum.", "publishedDate": "2016-07-22", "language": "en", "rating": 5}, {"id": 390803273, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d1893220-r390803273-Museu_del_Modernisme-Barcelona_Catalonia.html", "text": "Situated in the area of Barcelona where much of the architecture of the Modernisme (Art Nouveau) period is located, it is a perfect complement to a stroll through that place and time. It was not something we knew about in advance, but after walking past several buildings with interesting relief sculptures that we recognized as being from the period, we did a bit of investigating and found out about this museum. Filled with mostly furniture and a few architectural pieces, at the time we visited there was also a temporary exhibit of paintings from the period.", "publishedDate": "2016-07-09", "language": "en", "rating": 4}, {"id": 389617882, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d1893220-r389617882-Museu_del_Modernisme-Barcelona_Catalonia.html", "text": "A small museum, very manageable, where you get a good overview of Catalan Art Nouveau, specially painting and interior design. There are some sculptures as well.", "publishedDate": "2016-07-05", "language": "en", "rating": 5}, {"id": 384629863, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d1893220-r384629863-Museu_del_Modernisme-Barcelona_Catalonia.html", "text": "Fantastic little museum! The permanent collection is fantastic, great pieces of incredible furniture. The temporary exibition (running until July 3rd, 2016) is outstanding. Entrance price: 10 € (june 2016)  You need about 2 hours for a very torough visit", "publishedDate": "2016-06-21", "language": "en", "rating": 4}, {"id": 376080986, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d1893220-r376080986-Museu_del_Modernisme-Barcelona_Catalonia.html", "text": "We have been a little surprised by some of the reviews of this 'museum', in so far as comments about the size of it, or the price of entrance. Without getting too pedantic about the definition of its title, perhaps you could call it an 'exhibition' rather than a museum, but even so, if you are a true enthusiast of this period, you won't be disappointed. If you are expecting to 'kill' an hour or two, then yes, you will find the entrance fee expensive, especially if you're not students or pensioners and can get a discount.\nAs in all Spanish museums, the area of display is light and airy; the exhibits, well documented, in several languages; and during our visit, it wasn't crowded or noisy. It was a real joy to be allowed so close to such magnificent pieces of furniture and be able to study the intricacy of the craftsmanship. Paintings and stained-glass work are such subjective art forms, but as I said, if you are a real enthusiast of this era, this museum is not to be missed. We spent almost two hours in there and would definitely visit it again, the next time we are in Barcelona.", "publishedDate": "2016-05-24", "language": "en", "rating": 5}, {"id": 368994623, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d1893220-r368994623-Museu_del_Modernisme-Barcelona_Catalonia.html", "text": "This was an interesting museum but very small and expensive for what you get; only for those who are really keen on art of the period.", "publishedDate": "2016-04-30", "language": "en", "rating": 4}, {"id": 364391907, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d1893220-r364391907-Museu_del_Modernisme-Barcelona_Catalonia.html", "text": "This museum simply doesn't have enough space, or an extensive-enough collection, to adequately cover Art Nouveau or as it is called here, the Modernista style, even for just Catalunya.\n\nThere are some lovely pieces of furniture, a few uninspired stained-glass windows, some sculpture from the period (but nothing that looks especially Modernista), and a few dozen oil paintings (generally Impressionist, not much that would appeal strongly to a non-Catalan). There was a temporary display of magazine illustrations that look like Toulouse-Lautrec's work, but not as striking.\n\nArchitecture and interior design, which are the main areas for which Modernismo is known, were hardly touched at all, except for the few pieces of moveable furniture.\n\nIf you are hard up for something to do, this is near the heart of tourist Barcelona, and is worth about 30 minutes. Admission is 10 euro.", "publishedDate": "2016-04-15", "language": "en", "rating": 3}, {"id": 352088048, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d1893220-r352088048-Museu_del_Modernisme-Barcelona_Catalonia.html", "text": "The main floor was the only one open when we visited - so they cut the price by nearly a half.  We were able to look at various pieces of furniture, etc.  Many were done by Gaudi.  We thought it was interesting.  Info is available in English.", "publishedDate": "2016-03-01", "language": "en", "rating": 4}, {"id": 349498390, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d1893220-r349498390-Museu_del_Modernisme-Barcelona_Catalonia.html", "text": "This museum has a surprisingly comprehensive colleciton considering its modest size. You'll find furniture, sculptures, woodwork, glass work as well as a fascinating collection of paintings here. For me, the paintings in the basement were the highlights of my visit. There were very few other visitors, so I could walk around at ease. \n\nFor a modernist morning or afternoon, I recommend combining your visit here with a visit to the Casa Batllo and the la Pedrera building, both of which are in walking distance.", "publishedDate": "2016-02-20", "language": "en", "rating": 4}, {"id": 348645208, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d1893220-r348645208-Museu_del_Modernisme-Barcelona_Catalonia.html", "text": "Very pleasantly surprised by this museum with Modernist paintings, sculptures and furniture. Limited collection on 2 small floors, but definitely still worth a visit. There truly is some beautiful art to see here. Try to get a discount voucher somewhere though, because the entrance fee of € 10 is still a bit steep, I think.", "publishedDate": "2016-02-17", "language": "en", "rating": 4}, {"id": 348065475, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d1893220-r348065475-Museu_del_Modernisme-Barcelona_Catalonia.html", "text": "Wunderful, small and clearly arranged museum\nVery friendly staff\nHistorical building\nIt's permitted to take pictures\nMust see", "publishedDate": "2016-02-15", "language": "en", "rating": 5}, {"id": 347376138, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d1893220-r347376138-Museu_del_Modernisme-Barcelona_Catalonia.html", "text": "Well worth a visit if you like art nouveau, you will ooh and aah with wonder and envy at the furniture and wish you could go back in time (but only if you were rich and could afford said furniture).  Not a huge museum so worth squeezing in if you are in the area, an hour should be ample.", "publishedDate": "2016-02-13", "language": "en", "rating": 5}, {"id": 346748072, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d1893220-r346748072-Museu_del_Modernisme-Barcelona_Catalonia.html", "text": "Reading the reviews of some they may not appreciate the craftsmanship that has gone into this museum.It gives a taste of the artists from Spain who created furniture,glass,sculpture and paintings with a certain style.I enjoyed this museum as it is probably my favourite period of art history.It has a small version of casa batllo .\n\n", "publishedDate": "2016-02-10", "language": "en", "rating": 5}, {"id": 345367379, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d1893220-r345367379-Museu_del_Modernisme-Barcelona_Catalonia.html", "text": "When touring the local house museums  the rooms are empty of furniture and accessories, the decorative arts, with only an occasional blurry photo of what was there when they were occupied. This museum has the furniture and objects that might have filled the empty rooms. Too bad you can't see the items in situ.", "publishedDate": "2016-02-06", "language": "en", "rating": 5}, {"id": 337270581, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d1893220-r337270581-Museu_del_Modernisme-Barcelona_Catalonia.html", "text": "I loved this place. If you love modernist art/art nouveau, this is the place for you. It's a small museum, but lovely. Lots of beautiful stained glass works and furniture to see. Don's miss this lovely place. One of my favorite places so far to see in Barcelona.", "publishedDate": "2016-01-04", "language": "en", "rating": 5}, {"id": 330178152, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d1893220-r330178152-Museu_del_Modernisme-Barcelona_Catalonia.html", "text": "The homes for the most part are bare of furniture.  At this museum you will see the stuff that filled the Catalan Modernist homes.  Beautiful work, numerous stained glass pieces too.  We really enjoyed this place as it gave a whole different dimension to the Gaudi story.", "publishedDate": "2015-12-01", "language": "en", "rating": 5}, {"id": 329739362, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d1893220-r329739362-Museu_del_Modernisme-Barcelona_Catalonia.html", "text": "This is a small museum, but has some excellent modernist work, primarily by lesser-known artists. There are several striking stained glass works, sculptures, paintings, and furniture, as well as smaller decorative elements for furniture. \n\nFor ten euros, as of November, 2015, it is rather expensive for a small collection, so I'd recommend mostly to those who really love the style in decorative arts. If you're more curious about the how modernism played out in fine or decorative art, you might consider the National Museum of Catalan Art instead as a venue to see these kinds of works, since there you also get the rest of the museum. But if you want to see more fine works in this distinctive style, then this museum is a wonderful complement to the larger one. \n\nIt has a very good bookstore with several books about modernism and art nouveau not available at other museums.", "publishedDate": "2015-11-29", "language": "en", "rating": 4}, {"id": 322991400, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d1893220-r322991400-Museu_del_Modernisme-Barcelona_Catalonia.html", "text": "If you have any interest in the modernista movement then this is a totally worthwhile visit. The two floors are a wonderful space. There are beautiful pieces of furniture all around. Wonderful art and very interesting photos with a video. Good explanations. Very few people and a very cute coffee room that is also original. It is a fantastic visit that we really enjoyed. ", "publishedDate": "2015-10-29", "language": "en", "rating": 5}, {"id": 321974651, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d1893220-r321974651-Museu_del_Modernisme-Barcelona_Catalonia.html", "text": "The best, small museum in Barcelona, with excellent exhibition of catalan \"art nouveau\". I recommend!", "publishedDate": "2015-10-26", "language": "en", "rating": 5}, {"id": 321645446, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d1893220-r321645446-Museu_del_Modernisme-Barcelona_Catalonia.html", "text": "We found this museum extremely interesting and would recommend it to anyone who enjoys skilful craftsmanship. It was a great find even though it was a small museum it had fabulous pieces on display.", "publishedDate": "2015-10-25", "language": "en", "rating": 5}, {"id": 320205185, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d1893220-r320205185-Museu_del_Modernisme-Barcelona_Catalonia.html", "text": "This is a small museum on a street parallel to the main road, but walking there from Casa Battilo gives sites of many modernist buildings, pause by open doorways to see private hallways there are many fabulous ones we saw and probable many more that we did not. \nThe museum itself is in a lovely building and the pieces are spread out inside, there is a selection of wonderful furniture, and the strained glass panels downstairs are  something to behold.\nIf you liked the modernism of Casa Batilo etc this a good place to go to get a good look at things without the crush of people that are in the main attractions.", "publishedDate": "2015-10-19", "language": "en", "rating": 4}, {"id": 317746313, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d1893220-r317746313-Museu_del_Modernisme-Barcelona_Catalonia.html", "text": "This is a tiny museum and well worth a visit.  It is located not far from Passeig de Gracia.  \n\nIn addition to some paintings and sculpture, the museum contains some wonderful home furnishings (chairs, hat racks, tables, etc.) from the Modernisme period, including some Gaudi pieces.  It is possible to closely examine the craftsmanship of the pieces from that area. \n\nThe museum can easily be seen in 30 minutes or less.", "publishedDate": "2015-10-11", "language": "en", "rating": 5}, {"id": 315185169, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d1893220-r315185169-Museu_del_Modernisme-Barcelona_Catalonia.html", "text": "This museum is in a good location - not far from some landmark Modernisme buildings.  The collection is very striking.  Anyone who appreciates Art Nouveau should go to the museum.  The best pieces are perhaps the furniture, but they are good representations of paintings, ceramics and glass.", "publishedDate": "2015-09-30", "language": "en", "rating": 4}, {"id": 310126771, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d1893220-r310126771-Museu_del_Modernisme-Barcelona_Catalonia.html", "text": "This is a small museum which saved me from being overwhelmed by choice - and wearied by traipsing miles of corridors! \n\nWhat is on display gives a great flavour of the distinctive style and superb craftsmanship of Barcelona's modernisme movement.\n\nNot expensive and easy to reach from Plaça de Catalunya.", "publishedDate": "2015-09-14", "language": "en", "rating": 5}, {"id": 304950797, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d1893220-r304950797-Museu_del_Modernisme-Barcelona_Catalonia.html", "text": "This museum could've been much more of an experience if it had been housed in a more suitable building. When you see the building from outside you think - wow! But the actual museum is only on the ground floor and basement. Although there are a lot of ítems on display, the furniture would have had a lot more impact in an actual apartment setting (real or imagined) rather than just as exhibits. And it would've been nice to have had more information about where the pieces came from to give more context. The best part is the lift but that seems to have restricted use. Disappointing but still interesting.", "publishedDate": "2015-08-30", "language": "en", "rating": 3}, {"id": 298295813, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d1893220-r298295813-Museu_del_Modernisme-Barcelona_Catalonia.html", "text": "If you like the Modern Stile (Modernisme, Jugendstil) this museum is your place. Sculptures, furniture, paintings - all of the best, all of Catalunya. With two floors this museum is not very big, but to watch all you will need at least one hour, better reserve two. It is definitely worthwhile to visit this place which is just 5 minutes to go from the metro station Universitat.\n\nSi te gusta el modernismo (Modern Stile, Jugendstil) este museo es tu sitio. Esculturas, muebles, pinturas - todo del mejor, todo de Catalunya. Con dos pisos este museo no es tan grande, pero para visitar todo te tomará por lo menos una hora, mejor reserves dos. Visitar este sitio definitivamente vale la pena, situado solo cinco minutos andando deste la estación del metro de Universitat.", "publishedDate": "2015-08-12", "language": "en", "rating": 5}, {"id": 292750383, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d1893220-r292750383-Museu_del_Modernisme-Barcelona_Catalonia.html", "text": "I don't like \"design\", so you normally wouldn't find me in a museum full of chairs and tables and cupboards, but be it the whole Modernist atmosphere of Barcelona or be it the actual magnificence of the objects displayed there, I was fascinated with the exhibition of this museum. You can find many \"design\" objects, including some by Gaudí, and discover some amazing artists like Joan Busquets i Jané whom I did not know. Most of these pieces are surprising and so richly decorated that it takes your breath away. Also, the museum is very quiet because there aren't many visitors, so it feels incredibly relaxing to walk through the two rooms that make up the exhibition. There's also a video room where a video about the urban change Barcelona went through in the early XX century is displayed, which is very interesting and the benches down there are extremely comfortable (for this reason I watched the video three times).", "publishedDate": "2015-07-26", "language": "en", "rating": 5}, {"id": 292285890, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d1893220-r292285890-Museu_del_Modernisme-Barcelona_Catalonia.html", "text": "we just dropped in by chance and found out that the museum was gratis on our barcelona card - wonderful examples of the moderisme, furniture and jewelry - just like our jugendstil in germany. I loved it and we were nearly the only visitors - it was late afternoon. ", "publishedDate": "2015-07-25", "language": "en", "rating": 5}, {"id": 290570450, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d1893220-r290570450-Museu_del_Modernisme-Barcelona_Catalonia.html", "text": "The museum has an excellent collection of Modernist furniture and household items. It also has some reasonable collection of paintings and sculpture. Several important modernism figures are well represented with their work. Small, no crowds, self-service coffee. Provides good understanding of modernisme as a movement.", "publishedDate": "2015-07-19", "language": "en", "rating": 5}, {"id": 282552960, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d1893220-r282552960-Museu_del_Modernisme-Barcelona_Catalonia.html", "text": "A better way to get close to Gaudi and his contemporaries than the usual tours. You can really see the styles and how they work. The details are hard to see at the big sites so this is really helpful in understanding the shapes and forms.", "publishedDate": "2015-06-24", "language": "en", "rating": 5}, {"id": 281446943, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d1893220-r281446943-Museu_del_Modernisme-Barcelona_Catalonia.html", "text": "This is a small, specialised and very worthwhile museum. I loved the furniture that was displayed, and seeing Gaudi's work. There were also several very interesting paintings. It was  really nice to be able to look closely  without crowds of people milling around. So one of the attractions of this museum might be undermined by writing good reviews that could attract more visitors. However it deserves to be praised and if you do visit you will be rewarded if you are looking for something beyond the usual.", "publishedDate": "2015-06-19", "language": "en", "rating": 4}, {"id": 279861671, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d1893220-r279861671-Museu_del_Modernisme-Barcelona_Catalonia.html", "text": "It is a small, but very well organized Art Nouveau museum. There are a lot of art pieces from the best artists of the \"modernism\". We liked it very much.", "publishedDate": "2015-06-13", "language": "en", "rating": 5}, {"id": 275919319, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d1893220-r275919319-Museu_del_Modernisme-Barcelona_Catalonia.html", "text": "Not very big so you don't get much for your money BUT the exhibits were well worth seeing and it did buy me some time while waiting for my tour at Casa Lleo,", "publishedDate": "2015-05-31", "language": "en", "rating": 4}, {"id": 269987096, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d1893220-r269987096-Museu_del_Modernisme-Barcelona_Catalonia.html", "text": "I definitely recommend this museum \"round\".\nFrom the location, in full expansion, through the building in which it is (Enric Sagnier), fantastically restored including the content. Furniture, paintings, sculptures, stained glass, key authors of the Catalan modernism Gaudi, Joaquin Mir, Santiago Rusiñol, Llimona. it has a Relaxed and personal atmosphere, very friendly. Totally recommended; small, but a must for lovers of modernism.", "publishedDate": "2015-05-04", "language": "en", "rating": 5}, {"id": 229138027, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d1893220-r229138027-Museu_del_Modernisme-Barcelona_Catalonia.html", "text": "The Museu del Modernime Catala is a wonderful museum. It has plenty of Art Nouveau furniture that was made by master craftsmen and artists. There is some very impressive stained glass also at the bottom floor. Two of them were made by the Maumejean Brothers, a famous firm that makes wonderful stained glass. The sculptures are also very good. This is the place to see if you are interested in Art Nouveau.", "publishedDate": "2014-09-15", "language": "en", "rating": 5}, {"id": 224758659, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d1893220-r224758659-Museu_del_Modernisme-Barcelona_Catalonia.html", "text": "It might be that the previous rave reviews have set my expectations too high, but the Modernism Museum was a disappointment. It grew out of a vintage furniture trading business and this is basically what it is, a glorified antiques shop. Granted, they have quite a few crafty furniture pieces and you can only admire the amount of work that went into their fabrication. However, for all their impressive looks, they are not museum-quality pieces. The paintings in the basement do not have much artistic value either. Truth to be told, the basement part is plain boring. \n\nGive this museum a miss, save your time and money and head instead to the MNAC, the National Museum of Catalan Art, you will be awed by its collection.", "publishedDate": "2014-08-27", "language": "en", "rating": 2}, {"id": 224108878, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d1893220-r224108878-Museu_del_Modernisme-Barcelona_Catalonia.html", "text": "The museum cost €10 to enter and contains some real extraordinary pieces of furniture from back in the days of over the top grandure. The downstairs section really caught my eye with its simple yet beautiful sculptures by Daudi. Even the columns in this section are a piece of art with the mosaic decoration. ", "publishedDate": "2014-08-24", "language": "en", "rating": 3}, {"id": 224028404, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d1893220-r224028404-Museu_del_Modernisme-Barcelona_Catalonia.html", "text": "This  museum  could  be  visited  if  you  have  a  Barcelona  Card  and  you  have  thirty  minutes  to  spare.  There  are  some  impressive  pieces  of  furniture  on  display  --  eg.  a  writing  desk  you  would  like  to  own.", "publishedDate": "2014-08-24", "language": "en", "rating": 3}, {"id": 222387339, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d1893220-r222387339-Museu_del_Modernisme-Barcelona_Catalonia.html", "text": "Not much promotion for this museum, close to Plaça Catalunya.Yet so much beauty: woodwork, ceramics, ironwork, furniture  from the famous Catalan Modernisme era. I really enjoyed my visit! The museum is not very \"lively\", but still, the objects speak for themselves", "publishedDate": "2014-08-17", "language": "en", "rating": 4}, {"id": 221775817, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d1893220-r221775817-Museu_del_Modernisme-Barcelona_Catalonia.html", "text": "Just a few short blocks from Casa Battlo (and also near Plaza Catalunya if you are getting a bus there) lies this hidden gem - without the crowds, waiting or high price! The works displayed on the museum's two floors are a gorgeous representation of the varied forms - painting, sculpture, stained glass and furniture - of the Modernisme movement in Barcelona. They offer plastic-coated sheets with translations of the artwork captions in English, French, German and a few other languages (what is posted on the wall is in Catalan and Spanish) near the front door, but staff are also knowledgeable and willing to explain if you ask. Well worth the visit!", "publishedDate": "2014-08-14", "language": "en", "rating": 5}, {"id": 219974522, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d1893220-r219974522-Museu_del_Modernisme-Barcelona_Catalonia.html", "text": "Thanks to a fellow reviewer, we found this lovely museum in a quiet area of the city. Uncrowded and cool, we could savor the exhibits at a leisurely pace. I knew little about Spanish modernism as it applied to furniture, painting, stained glass, and sculpture. Thank you for this introduction.", "publishedDate": "2014-08-06", "language": "en", "rating": 5}, {"id": 219005166, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d1893220-r219005166-Museu_del_Modernisme-Barcelona_Catalonia.html", "text": "We had a great time here. A little tricky to find but once you do an excellent experience. Very knowledgeable and helpful staff. Some absolutely delightful displays and pieces. Not to be missed in my book.\nMake sure you use the lift to see the mural on the lift shaft.", "publishedDate": "2014-08-02", "language": "en", "rating": 5}, {"id": 213464029, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d1893220-r213464029-Museu_del_Modernisme-Barcelona_Catalonia.html", "text": "Beautiful art nouveau furniture, paintings, stained glass and sculptural works over two levels. Part of a collection by dealers who then made it into a museum. Unfortunately some pieces have no English translations - that could be improved - otherwise an impressive collection.", "publishedDate": "2014-07-03", "language": "en", "rating": 5}, {"id": 213369534, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d1893220-r213369534-Museu_del_Modernisme-Barcelona_Catalonia.html", "text": "We kind of chanced upon this little museum, but Im really glad we got to see it. It was full of beautiful furniture, paintings, sculptures, and stained glass. They had informative English translations on almost everything. Also it was almost empty which was a great break from the crowds everywhere else and we got to take our time looking at everything.", "publishedDate": "2014-07-02", "language": "en", "rating": 5}, {"id": 211491475, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d1893220-r211491475-Museu_del_Modernisme-Barcelona_Catalonia.html", "text": "After the mandatory tourist visit to Casa Batllo in the neighborhood, make sure not to miss the Museu del Modernisme Catala, located only a few streets away.\n\nIt was a bit tricky for us to find, as there were no street signs pointing to it, and none of the locals we stopped to ask for directions had ever heard of it, so we ended up walking in circles, as we *knew* it had to be close by, according to our map.\n\nHaving finally managed to spot the large red banners at the entrance, I must say that I was glad we hadn't given up on it.\n\nIt's a small, lesser known museum that offers the advantage of not having to wait in line at all, as you'd most likely end up doing in any of the larger tourist attractions in Barcelona. This meant that, during the afternoon we visited it, we were the only ones inside, only to later be joined by another couple.\n\nYou can easily spend about an hour in here, as, despite only having two (relatively small) levels, the museum offers various types of arts to be admired - from Art Nouveau furniture, large mirrors, stained glass, to paintings and statues - so there's a bit of everything in it, to suit all tastes.\n\nFor the 10 Euro entrance, you can get away from the hustle and bustle of busy Barcelona, take a seat on one of the benches in the basement and admire the beautiful artwork, getting a chance to relax before heading off to any of the other major sites of interest in the area.", "publishedDate": "2014-06-22", "language": "en", "rating": 5}, {"id": 206738820, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d1893220-r206738820-Museu_del_Modernisme-Barcelona_Catalonia.html", "text": "I have never seen anything like this before. Awesome wooden cabinets and furniture sets and many more)", "publishedDate": "2014-05-23", "language": "en", "rating": 5}, {"id": 202082619, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d1893220-r202082619-Museu_del_Modernisme-Barcelona_Catalonia.html", "text": "I loved this museum: the entrance price was quite cheap and it was really quiet, especially compared to tourist attractions like Casa Batllo.\n\nIt's a pretty small museum, but all the exposed pieces are wonderful and really showcase the best of Catalan modernisme.", "publishedDate": "2014-04-21", "language": "en", "rating": 5}, {"id": 200133027, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d1893220-r200133027-Museu_del_Modernisme-Barcelona_Catalonia.html", "text": "This museum was real surprise, especially basement floor is having amazing atmosphere, you can sit on benches and gaze at amazing art works accompanied by music. We visited museum on Monday morning so there were only two of us. After busy Ramblas you dive into totally different world and different century. Museum will be especially interesting to people truly interested in modernism. If it is your first visit to Barcelona I would suggest better to concentrate on famous landmarks.", "publishedDate": "2014-04-06", "language": "en", "rating": 5}, {"id": 189839383, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d1893220-r189839383-Museu_del_Modernisme-Barcelona_Catalonia.html", "text": "My wife and I had a great time in this little two level museum. There are only about 125 pieces in the museum, but you can stand and admire the works as long as you want since there is no rush of people and there is plenty of space to move around and enjoy the pieces that you want to focus on. Furniture, paintings, stain glass, sculptures, and fabrics are all on display here for a modest price.", "publishedDate": "2014-01-06", "language": "en", "rating": 5}, {"id": 184176975, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d1893220-r184176975-Museu_del_Modernisme-Barcelona_Catalonia.html", "text": "This museum was a real pleasant little stop between lots of major tourist spots.  It's very manageable within 90 minutes and they have some pieces that I thought were really stunning.  Also like how it's a nice mix of artwork, sculpture & furniture.  Definitely worth the stop if you have an interest in Modernism/Decorative Arts/Art Nouveau.", "publishedDate": "2013-11-09", "language": "en", "rating": 5}, {"id": 182909419, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d1893220-r182909419-Museu_del_Modernisme-Barcelona_Catalonia.html", "text": "I enjoyed the exhibits but there was a trail of ants on the floor that kind of distracted me.The museum is small but have some interesting pieces worth seeing.", "publishedDate": "2013-10-30", "language": "en", "rating": 4}, {"id": 176472061, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d1893220-r176472061-Museu_del_Modernisme-Barcelona_Catalonia.html", "text": "if it is your taste you will love it. especially the painting on the lower floor which are great examples of that the taste of that era. not everyone is a fan of that period, but i was very pleased to find such a place.", "publishedDate": "2013-09-09", "language": "en", "rating": 4}, {"id": 176230664, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d1893220-r176230664-Museu_del_Modernisme-Barcelona_Catalonia.html", "text": "Small but complete museum (furniture, sculpture, paintings, tainted-glass) that is less crowded than most popular ones in Barcelona. If you like even just a little bit Modernism, this is a must-see in Barcelona. Lovely and inspiring.", "publishedDate": "2013-09-07", "language": "en", "rating": 5}, {"id": 160183707, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d1893220-r160183707-Museu_del_Modernisme-Barcelona_Catalonia.html", "text": "A small museum on two floors, however every piece was worth seeing. Worth a visit if you're into the modernist style of even if you're just interested. ", "publishedDate": "2013-05-09", "language": "en", "rating": 4}, {"id": 153864524, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d1893220-r153864524-Museu_del_Modernisme-Barcelona_Catalonia.html", "text": "This is a small museum with plenty of beautiful wood furnishings, from Gaudi and others. Really, the inlays are remarkable. Downstairs are beautiful paintings and sculptures. The is a gem of a museum. Elsewhere in the city there are numerous examples of Gaudi, particularly his mosaic talents, but this museum also displays his woodwork. I snapped these four photos, then asked if I could take photos. No, was the answer, although they said I could keep the photos I had already taken.", "publishedDate": "2013-03-06", "language": "en", "rating": 5}, {"id": 152095081, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d1893220-r152095081-Museu_del_Modernisme-Barcelona_Catalonia.html", "text": "And  I  say this not only I love so much  Antoni Gaudi, the most representative artist of Catalan modernism but because in only 1000 mp surface, in two  floors, we  can see, in exclusively,   a lot of masterpieces, works by famous creative Catalan artists, in this  modernist building deigned  by Enric Sagnier, between 1902 - 1984. The Furniture SEction, from the first flour,, in neighborhood masterpieces by Joan Basquetes and Gaspar Homar,  us an area dedicated  to Gaudi, emblematic pieces feom his genius and also designs resulted from  his  collaboration with another famous Catalan  artist Jujol.The Painting and  Sculpture section, in the lower floor, hosts, in a more intimate setting , the works  from Ramon Casas, Santiago Rusinol, Juaquim Mir, Josep Limona,  And also, works by  Eusebi Arnau, the sculptor which labored  on the decoration  of very famous   Palau de la Musica Catalana, a  building with the faacade  as  a huge, rich  jewelery and with an acoustic sale with  flying horses! The strong  feelings to be  in middle of so many  genius works , make this Museum  unique and unforgetabil, even  Barcelona has hundred museums! EvaChiser", "publishedDate": "2013-02-14", "language": "en", "rating": 5}, {"id": 146908362, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d1893220-r146908362-Museu_del_Modernisme-Barcelona_Catalonia.html", "text": "The displays here help to see Gaudi in a broader context of work by his contemporaries. They include some spectacular furniture, interesting sculptures and indifferent paintings, with a helpful video introducing the artists, most of them very unfamiliar. Conveniently located a few minutes from the Casa Battlo, and worth an hour's visit.", "publishedDate": "2012-12-06", "language": "en", "rating": 5}, {"id": 144680030, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d1893220-r144680030-Museu_del_Modernisme-Barcelona_Catalonia.html", "text": "The intention is good, but the collection very limited and the price not worth it, the building is a regular building, nothing special.", "publishedDate": "2012-11-05", "language": "en", "rating": 2}, {"id": 144411857, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d1893220-r144411857-Museu_del_Modernisme-Barcelona_Catalonia.html", "text": "This museum is the latest addition to the constellation of excellent museums in Barcelona. It is  unique in being dedicated exclusively to the brilliant movement in the city's history known as Modernism. It makes an excellent complement to the well-trodden tourist itinerary of Modernist buildings, since it collects some of the best pieces of furniture and interior decoration from that period. \n\nThe building itself, in the Eixample neighborhood, is a modernist work itself, having been designed by Eric Sagnier between 1902 and 1904. The first floor (there are only two) houses furniture by Gaudi, Bosquests and Gaspar Homar. Interestingly, they show Gaudi to be most \"abstract\" of the artists working in that period. The design and workmanship are simply stunning, and leave one wondering how these sideboards, hallway stands, personal altars could ever have been used as household goods in everyday life, and the wealth of the clients who could afford such objects.\n\nThe lower floor hosts the painting and sculpture section and is more mainstream than the upstairs. Still, if you enjoyed the Palau de la Musica or the Hospital de la Santa Creu i Sant Pau, you will appreciate the work of the sculptor Arnau who contributed heavily to those buildings.\n\nHighly recommended for the lovers of that period.", "publishedDate": "2012-11-03", "language": "en", "rating": 5}, {"id": 143808574, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d1893220-r143808574-Museu_del_Modernisme-Barcelona_Catalonia.html", "text": "We enjoy the Modernisme Movement art, both archetecture and decorative. This museum has great examples of the decorative art. It is not jammed full so you can appreciate each piece. They obviously went for the quality vs. quantity.", "publishedDate": "2012-10-26", "language": "en", "rating": 4}, {"id": 128212968, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d1893220-r128212968-Museu_del_Modernisme-Barcelona_Catalonia.html", "text": "They turned an old factory into a museum and put interesting modern pieces in it. There are only Catalan artists works (Gaudi, Homar, Josep Llimona, Joaquim Mir...) Paintings and sculptures. Museu d'Art Contemporani de Barcelona - MACBA is better than this one but the building is worth seeing if this is your second or third visit to the city.", "publishedDate": "2012-04-20", "language": "en", "rating": 3}, {"id": 120580392, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d1893220-r120580392-Museu_del_Modernisme-Barcelona_Catalonia.html", "text": "gives a good background to the modernist buildings and thier contents, very peaceful and not toolarge a collection so does not over whelm", "publishedDate": "2011-11-14", "language": "en", "rating": 3}, {"id": 120096957, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d1893220-r120096957-Museu_del_Modernisme-Barcelona_Catalonia.html", "text": "A day before we went to Barcelona, I looked at the web to find a museum we had not seen yet and found this museum, located at Calle Balmes, 48. The museum opened in March, 2011. The museum is installed in a building designed by the Modernist architect Enric Sagnier in 1904. When we entered the museum we found that it had two floors with a space of 1000 square meters. At once we were overwhelmed by the art we found in the museum, Modernist art at its best. On the ground floor there was the furniture section with furniture designed by Gaudi, Gaspar Homar and Joan Busquets. There was furniture that used the art of marquetry, many using 40 different types of wood. The marquetry designs on the furniture looked like paintings, because so many types of wood were used, each with its own color. There were beautiful mirrors with spectacular designs. The furniture included cabinets, dining tables, and office furniture, all looking like art objects. The furniture designed by Gaudi was meant to be used at Casa Mila, Casa Battlo, and Casa Calvet.\nDownstairs was the section of painting and sculpture with work by Ramon Casas, Santiago Rusiñol, Joaquim Mir, Josep Limona and Eusebi Arnau. Arnau was a sculptor who worked on the decoration of the wonderful Palau de la Musica and the Hospital de la Santa Creu I Sant Pau. There were stained glass panels created by Maumejean that were spectacular. Joaquim Mir created a trio of stained glass panels with flowers and wildlife that were simply beautiful. Antoni Rigalt I Blanch has two stained glass panels, one of the Virgin of Montserrat and another of Sant Jordi. This is the only museum dedicated solely to  Catalan Modernism. There are more than 350 works of art designed by 42 artists.", "publishedDate": "2011-11-02", "language": "en", "rating": 5}]}}]