[{"locationId": 10264171, "name": "Parque de la Barceloneta", "placeType": "ATTRACTION", "reviewListPage": {"reviews": [{"id": 722508053, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d10264171-r722508053-Parque_de_la_Barceloneta-Barcelona_Catalonia.html", "text": "We decided to walk as much of Barcelona as we could rather than use the metro and this park was a welcome stop for a rest. Nice little park just beside Barceloneta beach with a few play areas for the kids. Peaceful and scenic, nice way to spend a bit of time in a busy city.", "publishedDate": "2019-10-30", "language": "en", "rating": 5}, {"id": 712554548, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d10264171-r712554548-Parque_de_la_Barceloneta-Barcelona_Catalonia.html", "text": "We walked through Parque de la Barceloneta for a short time, but did not really have the time to spend looking through, so we have a limited experience of it. It seemed to have some interesting water and other features and it was large enough for visitors to find a good spot  to sit and relax for extended periods. It is in the city where space, generally, is rather limited, so it is great to have a space like that to escape from the usual noises of a busy city. It is probably not something you have to seek out, so only go if you have nothing better to do.", "publishedDate": "2019-09-24", "language": "en", "rating": 4}, {"id": 703842864, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d10264171-r703842864-Parque_de_la_Barceloneta-Barcelona_Catalonia.html", "text": "The park is free to enter. Lots of places to sit. Close to the zoo, restaurants, museums, malls and shore. Bathrooms are very hard to find, so go before you enter the area.", "publishedDate": "2019-08-28", "language": "en", "rating": 4}, {"id": 532291885, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d10264171-r532291885-Parque_de_la_Barceloneta-Barcelona_Catalonia.html", "text": "A big park in the middle of the city with small animals, a pod and fountains. Very nice scenery for your eyes and helps you to relax and enjoy God's creations!", "publishedDate": "2017-10-12", "language": "en", "rating": 5}, {"id": 447143901, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d10264171-r447143901-Parque_de_la_Barceloneta-Barcelona_Catalonia.html", "text": "Quite a busy place with lots of young people walk or on bikes, I used it to get to the sea front, I would imagine in the summer is very busy", "publishedDate": "2016-12-28", "language": "en", "rating": 3}, {"id": 384200068, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d10264171-r384200068-Parque_de_la_Barceloneta-Barcelona_Catalonia.html", "text": "Barcelona is a metropolitan, but in the center there are many cosy squares and green oasis.\nParque de la Barceloneta is a green oasis in the north end of Barceloneta and close to the beach.\nIt is a wonderful place for rest, playing, activities, etc..", "publishedDate": "2016-06-20", "language": "en", "rating": 4}]}}]