[{"locationId": 14142348, "name": "Sabiduria", "placeType": "ATTRACTION", "reviewListPage": {"reviews": [{"id": 689873387, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d14142348-r689873387-Sabiduria-Barcelona_Catalonia.html", "text": "This sculpture title “Sabiduria\" is the Spanish word for wisdom.  The sculpture depicts Minerva the title of the sculpture alludes to her status as the Goddess of Wisdom. The sculpture depicts Minerva holding the bridles of a horse with her left hand. The horse reacts in a gesture of defiance, it’s front two legs raised. In her right hand, she holds a sphere and I think a Corinthian Helmut. \n\nI like the sculpture for the way it contracts the calm demeanour of Minerva against the agitated defiance of the horse.", "publishedDate": "2019-07-15", "language": "en", "rating": 4}, {"id": 677335088, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d14142348-r677335088-Sabiduria-Barcelona_Catalonia.html", "text": "Sabiduria is a beautiful equestrian sculpture. It depicts a woman wearing an apron on her chest and dressed in a tunic. She is Minerva, the Roman Goddess of Wisdom. In ancient Greek History she is Athena, the Goddess of Wisdom. With one hand she is holding the bridles of a horse while with the other hand she holds a helmet. The horse has its two front legs raised.  Note that there is a snake on the ground which probably causes the horse to be frightened. A stunning sculpture.", "publishedDate": "2019-05-29", "language": "en", "rating": 5}, {"id": 668654444, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d14142348-r668654444-Sabiduria-Barcelona_Catalonia.html", "text": "Free\n24/7\nVisit Duration: 5 minutes\nPlaza Cataluna \n\nThis bronze statue representing a man with a horse. the horse is  standing on his back legs with his horsman standing next to him and holding a hammer with his left hand and the horse with his right hand  the worker has a Laurel crown in his head.\nThis beautiful statue means \"Work\".\n", "publishedDate": "2019-04-23", "language": "en", "rating": 4}, {"id": 584047158, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d14142348-r584047158-Sabiduria-Barcelona_Catalonia.html", "text": "This sculpture is mounted on a pedestal on Plaza de Catalunya. \nIt is a sculpture by Miguel Oslé Sáenz de Medrano  and is of a lady holding the bridle of a horse that is rearing in terror from snake located on the ground under the horse' s forelegs. It was installed in 1929. The translation of Sabiduría  is Wisdom.", "publishedDate": "2018-05-31", "language": "en", "rating": 4}]}}]