[{"locationId": 531612, "name": "Casa Comalat", "placeType": "ATTRACTION", "reviewListPage": {"reviews": [{"id": 714220485, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d531612-r714220485-Casa_Comalat-Barcelona_Catalonia.html", "text": "Casa Comalat is one of the most original examples of art nouveau in Barcelona.  This building  has been designed by Catalan architect architect Salvador Valeri i Pupurull. It has two distinct façades. The main façade, which overlooks Barcelona's Avinguda Diagonal, is made of stone and is more symmetrical and regular in shape. Colour  dominates the rear façade of the building which overlooks Carrer Rosselló.  Be sure not to miss the other side. Both the sides are spectacular. Even if you cannot visit the interior,  it's still worth a visit just to admire it from the outside. The architecture and the interior are stunning. One of my  favourite houses  in Barcelona. Highly recommend.", "publishedDate": "2019-09-30", "language": "en", "rating": 5}, {"id": 689541180, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d531612-r689541180-Casa_Comalat-Barcelona_Catalonia.html", "text": "Casa Comalat is a building on Avinguda Diagonal and one of many examples of Catalan Modernism on the same street, especially the stone grills over the entrances and windows, bar grills over the bay windows, the elaborate decorations on the facade especially underneath the roof cornice. Sadly, the building is a private residence and I had to just make do with admiring it fro the outside.\n\nWorth a look if on Avinguda Diagonal.", "publishedDate": "2019-07-14", "language": "en", "rating": 4}, {"id": 674680545, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d531612-r674680545-Casa_Comalat-Barcelona_Catalonia.html", "text": "Casa Comalat is amazing architecture at work! This is wonderful work at its best. The influence of Gaudi is very evident in this building. The facade of the building is art personified!", "publishedDate": "2019-05-17", "language": "en", "rating": 4}, {"id": 657055690, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d531612-r657055690-Casa_Comalat-Barcelona_Catalonia.html", "text": "The exterior is charming modernist style.  Unfortunately one cannot go inside.  The exterior is worth going by.  He sure to see both sides of the building, however.", "publishedDate": "2019-03-07", "language": "en", "rating": 5}, {"id": 623489551, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d531612-r623489551-Casa_Comalat-Barcelona_Catalonia.html", "text": "Although not designed by Catalan architect Antoni Gaudi it is clearly influenced by this genius. \nThe facade looks awesome, a wonderful looking building, very photogenic but unfortunately you cannot gain access to this building. \nWe found it as we were wandering around this part of town and made a brief stop off to take some great photos of this building. \nEasy to locate Carrer De Corsega in the wonderful vibrant and exciting  Gracia neighbourhood. \nWell worth checking out. ", "publishedDate": "2018-10-09", "language": "en", "rating": 5}, {"id": 558642918, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d531612-r558642918-Casa_Comalat-Barcelona_Catalonia.html", "text": "No tourist around and off the beaten track. A perfect representation of the genius of Gaudi. Loved it!!!", "publishedDate": "2018-02-05", "language": "en", "rating": 5}, {"id": 517197702, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d531612-r517197702-Casa_Comalat-Barcelona_Catalonia.html", "text": "You can't really go inside so you can only view the building from the sidewalk. If you've seen Park Guell or Casa Batllo, then this would pretty much be the same thing. I wouldn't go out of my way, but if you're in the area, maybe worth a quick detour.", "publishedDate": "2017-08-24", "language": "en", "rating": 3}, {"id": 463948131, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d531612-r463948131-Casa_Comalat-Barcelona_Catalonia.html", "text": "Although it is not estqa permitted by the owners in tourist guides to be visited. A shame because the stairs, ascersor and roof are precious and have been visit quietly to see details. It can be visited from the outside. It has rear facade with beautiful balconies.", "publishedDate": "2017-03-01", "language": "en", "rating": 3}, {"id": 436309126, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d531612-r436309126-Casa_Comalat-Barcelona_Catalonia.html", "text": "We found in on the way from Sagrada Familia to Passeign de Graciaand casa Pedrero. Strange, it's not Gaudi's work, as it looks absolutely his! Anyway, colourful splendid house with no sharp lines ans generously decorated- it forces everyone to stop. Sad we didn't dare to come inside...", "publishedDate": "2016-11-11", "language": "en", "rating": 5}, {"id": 414406650, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d531612-r414406650-Casa_Comalat-Barcelona_Catalonia.html", "text": "My favorite building in Barcelona, it's absolutely fabulous, but the doorman/guard is very rude. I tried to have a look at the incredible vestibule, but the doorman immediately kicked me out in a very rude way : I entered and politely asked him if I could just take a quick picture of the entrance, he said no and then closed the massive door on my foot ! ..... Be carefull !", "publishedDate": "2016-09-03", "language": "en", "rating": 2}, {"id": 342068576, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d531612-r342068576-Casa_Comalat-Barcelona_Catalonia.html", "text": "Another modernist house on Avinguda Diagonal, this one was designed by the architect Salvador Valeri i Pupurull in 1906. He was obviously influenced by Gaudi’s work, which is greatly visible in the curves which are comprised on both facades (one facing the Avinguda Diagonal and the other facing Carrer de Corsega) of the building. It is a real hidden jewel of the area!", "publishedDate": "2016-01-23", "language": "en", "rating": 5}, {"id": 210080608, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d531612-r210080608-Casa_Comalat-Barcelona_Catalonia.html", "text": "You won’t find crowds around this one, but it is just as lovely as Casa Battlo. It is on the corner of the street, perfectly hidden away from a major road. Gorgeous balconies, lovely windows and the colors, the colors! Very much worth a short side trip to check it out.", "publishedDate": "2014-06-12", "language": "en", "rating": 4}, {"id": 208316543, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d531612-r208316543-Casa_Comalat-Barcelona_Catalonia.html", "text": "On seeing of this colorful building I followed directions and sped down the Diagonal to find it - only to be confronted with this dull, anaemic, achromatic building...\nI'm thinking - perhaps they stripped the paint to restore it or something??\nAnyway fast forward I'm walking down Carrer Còrsega and I'm blinded by this incredibly bizarre  psychedelic building! It looked as if a pink and turquoise cake had dropped out of the sky and squashed another building beneath it, it's gooey icing oozing off the sides and onto the sidewalk! Mesmerized I searched for its name - because there was no way that that building on the opposite side of the block bore the same identity. \nYou MUST find the happier persona of Casa Comalat - and it's close to Casa de les Punxes which is a great-see as well. ", "publishedDate": "2014-06-01", "language": "en", "rating": 5}, {"id": 202335096, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d531612-r202335096-Casa_Comalat-Barcelona_Catalonia.html", "text": "Would not go out of your path to see it but if you are in the area it is worth to take a look. The front facade is intriguing and highly elaborated following the modernist style. The back facade is just as interesting with an emphasis on colors.\nCould take a quick look at the entrance hall while chatting with doorman (restricted access) and you are simply submerged by colorful ceramics and ceiling paintings, wow ! The project of hotel mentioned in another comment is no longer existing so guess visitors would have to do with the external facades.", "publishedDate": "2014-04-22", "language": "en", "rating": 4}, {"id": 180803140, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d531612-r180803140-Casa_Comalat-Barcelona_Catalonia.html", "text": "We saw the Casa Comalat while driving along the Avinguda Diagonal. The building is a beautiful piece of arcitecture which looks even more beautiful because of the coloured and intricately designed facade walls. Unfortunately we did not go in and see the building in detail, but the facade was worth the stop.", "publishedDate": "2013-10-13", "language": "en", "rating": 4}, {"id": 160867806, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d531612-r160867806-Casa_Comalat-Barcelona_Catalonia.html", "text": "I wish l could have gone inside but the outside was incredible l love Gaudi and all his influences the man was a genius still worth g oing and seeing the outside", "publishedDate": "2013-05-16", "language": "en", "rating": 5}, {"id": 157917965, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d531612-r157917965-Casa_Comalat-Barcelona_Catalonia.html", "text": "At the bottom of Gràcia between the Diagonal and Carrer Còrsega, this often overlooked Moderniste house built in 1911 is a must see in a visit to Barcelona. The reason such an outstanding piece of architecture is not on everyone's priority list is probably because it is not open to the public, contrary to what happens to the nearby La Pedrera and Casa Batlló. You have to limit yourself to admire its two splendid (and very different) façades from the outside.  For a look at the most inventive side of this lower Gràcia Art Nouveau gem, cut down past Casa Fuster at the bottom of Gran de Gràcia, take a left on Bonavista, then a right on Santa Teresa down to Casa Comalat just across Carrer Còrsega. This Salvador Valeri i Pupurull creation is one of Barcelona's most interesting Moderniste houses, especially this side of it, with its bulging polychrome ceramic balconies and its melted wax-like underpinnings.", "publishedDate": "2013-04-16", "language": "en", "rating": 5}, {"id": 6597099, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d531612-r6597099-Casa_Comalat-Barcelona_Catalonia.html", "text": "Casa Comalat is a gorgeous building. You can definitely see the influences of Gaudi but with a twist. If you can get inside the lobby, it's worth a peak at the ceramic work and beautifully painted walls and celings. I hear they're putting a little hotel in on the first floor. I can't wait to stay there!\n", "publishedDate": "2007-01-14", "language": "en", "rating": 5}]}}]