[{"locationId": 9805865, "name": "Barts", "placeType": "ATTRACTION", "reviewListPage": {"reviews": [{"id": 581942649, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d9805865-r581942649-Barts-Barcelona_Catalonia.html", "text": "we saw the German group The Baseballs here in April 2018, what a brilliant night, the band are great they sound just like their records but better, go and see them, we had great seats in boxes on balcony and had plenty of room for a dance, definitely recommend this place for a night out, really easy to find and nearby to plenty of bars and restaurants, car parking is nearby behind theatre quite expensive but secure.", "publishedDate": "2018-05-22", "language": "en", "rating": 5}, {"id": 542129569, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d9805865-r542129569-Barts-Barcelona_Catalonia.html", "text": "Just the right size for a small concert and there are no bad seats in this place. Sound is excellent, not resonant, and the balconies offer a great view of the stage. ", "publishedDate": "2017-11-19", "language": "en", "rating": 5}, {"id": 481439409, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d9805865-r481439409-Barts-Barcelona_Catalonia.html", "text": "Saw Rick Astley there and the whole show was great, aided by the extra atmosphere created by the largely standing audience. Sensibly priced drinks, great views and very helpful staff. Super sound quality and general experience. Easy to get to and from, even if not the biggest venue around", "publishedDate": "2017-05-03", "language": "en", "rating": 5}, {"id": 371017118, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d9805865-r371017118-Barts-Barcelona_Catalonia.html", "text": "Just come back from a great concert at Barts. This concert hall has several rooms. The biggest one host the most known artists and we were lucky to go to the first floor in a second concert hall (but also dance-floor) very close to the artist. It was a magical moment of sharing with a great blues man, Jack Broadbent. Very good music, great voice and lot of humour share by the artist.\nA very good place to discover talents.", "publishedDate": "2016-05-07", "language": "en", "rating": 5}]}}]