[{"locationId": 2223604, "name": "Museu de la Musica", "placeType": "ATTRACTION", "reviewListPage": {"reviews": [{"id": 740646882, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d2223604-r740646882-Museu_de_la_Musica-Barcelona_Catalonia.html", "text": "An amazing collection of instruments. Covering centuries and with items from all over the world. The room full of guitars was my favorite!", "publishedDate": "2020-01-22", "language": "en", "rating": 5}, {"id": 689529242, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d2223604-r689529242-Museu_de_la_Musica-Barcelona_Catalonia.html", "text": "Incredible collection of instruments, many of which you will not find anywhere else.  Can easily allow 90 minutes to move through the large space.  Displays are very well set up.  Admission is free with the Barcelona Card. Otherwise, it is 6 Euro entrance fee and well worth it.", "publishedDate": "2019-07-14", "language": "en", "rating": 5}, {"id": 671673943, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d2223604-r671673943-Museu_de_la_Musica-Barcelona_Catalonia.html", "text": "This place is good for spending an easy hour on a Sunday. The place has a great variety of music instruments and you can hear them playing as you move along the museum path. At the end you have some instruments you can  play with. Fun experience for kids and the kids in hearts.", "publishedDate": "2019-05-05", "language": "en", "rating": 5}, {"id": 622965166, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d2223604-r622965166-Museu_de_la_Musica-Barcelona_Catalonia.html", "text": "While not a bad place it can be boring unless you are really into musical instruments. I guess for me, while I like music I found the overall experience a bit boring and sped through it. Now I do not want to detract from it being a lovely museum which is pleasantly laid out and does host a large collection of instruments but as said, unless you like seeing various instruments it's not an ideal cup of tea. And for a music museum it was awfully quiet! Maybe some more atmosphere would have made it better. It is off the usual tourist track so no crowds which is a pleasure in itself.", "publishedDate": "2018-10-07", "language": "en", "rating": 3}, {"id": 620471112, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d2223604-r620471112-Museu_de_la_Musica-Barcelona_Catalonia.html", "text": "Off the beaten path in Barcelona, this is definitely worth a visit if you have any interest in music.  The instruments were beautiful and the setting was thoughtful.  It's a great quiet place for a visit since it seems that not too many people know about it.", "publishedDate": "2018-09-29", "language": "en", "rating": 5}, {"id": 615783945, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d2223604-r615783945-Museu_de_la_Musica-Barcelona_Catalonia.html", "text": "We enjoyed this museum very much. It was nice, compact, interesting and well-presented. Our 9 year old enjoyed the room where one can touch instruments (classical guitar, electric guitar, cello, and some basic organ).", "publishedDate": "2018-09-11", "language": "en", "rating": 5}, {"id": 586570944, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d2223604-r586570944-Museu_de_la_Musica-Barcelona_Catalonia.html", "text": "The Flamenco performance was truly breathtaking. Where the 1 hour went by we didn't realise. highly recommend.", "publishedDate": "2018-06-10", "language": "en", "rating": 4}, {"id": 583396794, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d2223604-r583396794-Museu_de_la_Musica-Barcelona_Catalonia.html", "text": "This is a very interesting and beautifully displayed museum.  When we were there very few people were also there at that time so it was easy to see all of the displayed items.  It's the perfect size and you can easily do the entire museum in about an hour to two.  Because we also had purchased a Barcelona One card for our trip--which I highly recommend, the cost to enter the museum was nothing, it's included in the Barcelona One card.", "publishedDate": "2018-05-28", "language": "en", "rating": 5}, {"id": 569610863, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d2223604-r569610863-Museu_de_la_Musica-Barcelona_Catalonia.html", "text": "This museum celebrating the musical tradition of Barcelona is slightly off the beaten track but well worth the visit. If you are staying centrally in the city you can take the Metro to Arc de Triomf and then walk (its approximately a 10-15 minutes walk). The Museum is next to the National Theatre and The Flea Market and accessible by stairs or lift (it's on the second floor).\n\nWhen I visited the audio guides were not working which was a shame but the signage and layout of the museum is easy to navigate with plenty of audio-visual experiences to perfectly illustrate the instruments and musical tradition of Catalonia.\n\nIn addition to the main exhibits the museum also has space for some rotating exhibitions. During my visit it had an exhibition about Granados and also one devoted to Korean Musical Theatre.\n\nEntry is free to this museum if you have bought the Barcelona Card (which is also well worth the purchase).", "publishedDate": "2018-03-30", "language": "en", "rating": 4}, {"id": 553822183, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d2223604-r553822183-Museu_de_la_Musica-Barcelona_Catalonia.html", "text": "The building architecture is simple but commands your attention. The exhibits are top notch and the blog is worth the time to read.", "publishedDate": "2018-01-14", "language": "en", "rating": 5}, {"id": 525731757, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d2223604-r525731757-Museu_de_la_Musica-Barcelona_Catalonia.html", "text": "This museum is part of the building complex also housing the concert hall (Auditorio) and next to the Catalan National Theatre. You can experience more than 500 instruments, old and new from all over the world. Eleven areas has audio-visuals each lasting around four minutes. You can also try five instruments yourself, among other an electric guitar, a harp, a small organ and a cello. That was great fun.", "publishedDate": "2017-09-19", "language": "en", "rating": 4}, {"id": 493337106, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d2223604-r493337106-Museu_de_la_Musica-Barcelona_Catalonia.html", "text": "Very nice experience. Well organized visit in an extremely beautiful building. In the ticket price is included a small music show.  ", "publishedDate": "2017-06-15", "language": "en", "rating": 4}, {"id": 457502816, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d2223604-r457502816-Museu_de_la_Musica-Barcelona_Catalonia.html", "text": "It was great. The collection is very fine. There are recognizable orchestra instruments, instruments in chronological sequence, instruments from around the world and experimental modern instruments looking really weird. The glass cases let you see them from any angle (and take some great pictures), but the names are printed in small white letters on glass, which make them a bit difficult to find and read. However, you can practice guessing and then checking whether you're right or not. \nThe 1-st-Sunday-of-the-month tickets were free. We didn't quite enjoy the touch-and-play room, because you can't hear yourself, if someone is playing the electric guitar - unless it is yourself. ", "publishedDate": "2017-02-05", "language": "en", "rating": 5}, {"id": 436848457, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d2223604-r436848457-Museu_de_la_Musica-Barcelona_Catalonia.html", "text": "As the title implies, I've visited a number (around 6 at last count) of Musical Instrument Museums globally over the years, and I must say, the Museu de la Musica in Barcelona was definitely one of the best, if not the best that I have visited in the last 20 years.\n\nDistinguishing points:\n\n* Covers a really wide chronological range of Musical Instrument development from very early times right up to the 21st century. \n\n* Covers a reasonable representation of musical instruments from many different cultures around the world. (Of course, instruments from the Western areas are in the ascendency but a good chunk of space is also provided for a good collection from the Orient, Asia, the Middle East, Africa and even the Oceanic areas).  \n\n* When I visit Musical Instrument Museums, I always look out for instruments which I have never seen before.  The Museu de la Musica did not disappoint - there were two or three instruments which I had never seen before, much less contemplated before actually seeing them.  \n\n* The layout is logical in terms of chronology as well as categorisation of musical instrumentation type (e.g. Brass vs Strings, 15C versus 19C)\n\n* Very well done was the added accompaniment of instrument and era specific recordings of the instruments in the various areas - nice work!\n\n* Also fascinating (to a music geek like me) was a parallel collection of works/examples showing the development of both how music was recorded and captured for posterity.  Trust me - music was captured a long way before the cassette tape or vinyl records - and this museum really well shows and demonstrates that.  Awesome. \n\n* Equally fascinating was the exhibition showing the development and presentation of how music was written out (working from simple monophonic scores right up to the far out representations on paper required to communicate 21st century compositions.\n\n* The location was handy and central\n\n* The layout was great - a lot was covered in a reasonably sized space.\n\nI will unquestionably visit again in the future.  If you have an interest in music - then I'd recommend this place to your attention should you happen to find yourself in Barcelona.\n\n9/10", "publishedDate": "2016-11-13", "language": "en", "rating": 5}, {"id": 386791706, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d2223604-r386791706-Museu_de_la_Musica-Barcelona_Catalonia.html", "text": "We visited the museum because it was free and we were nearby. It was way better than expected. The exhibits traced the history of music from before written notes to modern Catalonia rock. Not something we would usually enjoy but the presentation was excellent and they even had instruments to try.", "publishedDate": "2016-06-27", "language": "en", "rating": 5}, {"id": 386791663, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d2223604-r386791663-Museu_de_la_Musica-Barcelona_Catalonia.html", "text": "We decided to stop here because the museum was free on that particular day and we were blown away by the museum. It was very interesting and they had a room full of instruments you could try out for yourself. It was a great way to get out of the sun for a little and we really liked it.", "publishedDate": "2016-06-27", "language": "en", "rating": 5}, {"id": 362690565, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d2223604-r362690565-Museu_de_la_Musica-Barcelona_Catalonia.html", "text": "We always try to visit the local music museum in every city we visit and Barcelona was no different. We took the tram and got off at the stop for Auditori Teatre Nacional however the Marina & Glories metro stations are also nearby. For €5, admission is an absolute bargain. The museum wasnt particularly busy so we were able to relax and enjoy a wander around viewing the collection. At the end of the collection there is a room with an electric guitar, viola and piano which you can play. I think there is an audio tour which you can take however we werent offered same at reception so unsure as to cost etc. My only other complaint is that I found it difficult to read the description of some instruments due to a combination of the lighting and colour of the writing on the display cases. ", "publishedDate": "2016-04-08", "language": "en", "rating": 4}, {"id": 352405166, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d2223604-r352405166-Museu_de_la_Musica-Barcelona_Catalonia.html", "text": "The museum was set up to show the history of music - and it was quite successful.  It also had sound displays for various time periods / genres - which added to the interest of the museum.  We especially liked the displays on the organs - that had some hands on displays.  At the end they also let you play some instruments (including harp, cello and electric guitar).  Quite wonderful. We spent over two hours here - thoroughly enjoying ourselves - and learning a lot.  Seniors get in for 4 euros each.", "publishedDate": "2016-03-02", "language": "en", "rating": 5}, {"id": 347381228, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d2223604-r347381228-Museu_de_la_Musica-Barcelona_Catalonia.html", "text": "I sighed a deep sigh and said oh ok when my guitar playing hub wanted to visit here but I thoroughly enjoyed it.  The actual  history of music I skimmed through but there is a huge range of fascinating instruments on display and I am pleased we visited.  There are some amazing objects there on which music can be played.  I would recommend it if you are in the area - not much in the way of bars or restaurants nearby but there is a café attached for a quick refuel.  ", "publishedDate": "2016-02-13", "language": "en", "rating": 4}, {"id": 325185788, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d2223604-r325185788-Museu_de_la_Musica-Barcelona_Catalonia.html", "text": "Nice display of classic musical instruments. Wouldn't go out of my way unless you are classical music lover but if you're in the area with time, and you love music, it's worth going.", "publishedDate": "2015-11-07", "language": "en", "rating": 4}, {"id": 319101532, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d2223604-r319101532-Museu_de_la_Musica-Barcelona_Catalonia.html", "text": "Me and my dad visited this museum. I am very interested in music, he's not at all but we both found the museum very interesting and special. ", "publishedDate": "2015-10-15", "language": "en", "rating": 5}, {"id": 317606142, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d2223604-r317606142-Museu_de_la_Musica-Barcelona_Catalonia.html", "text": "This museum is a delight.  On the afternoon we visited we were the only people there, so this was a gem of an experience away from the tourist crowds. This is a well planned space with, unusually for a museum, very plush and calming surroundings, with deep carpet and plenty of seating for pausing to listen to the soundtracks. The displays are simply arranged to give a history of the development of musical instruments and recording, and an overview of world music.  The text and slideshows accompanying the exhibits give just enough social and technical info for a non-musician to grasp and enjoy. My musician husband was itching to play something, and got his wish granted when he reached the end of the exhibition and found the keyboard and cello plus a couple of other instruments set up to have a go on. There's also a café next to the museum where you can enjoy a coffee amongst the music students.", "publishedDate": "2015-10-10", "language": "en", "rating": 5}, {"id": 315642149, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d2223604-r315642149-Museu_de_la_Musica-Barcelona_Catalonia.html", "text": "Very well done, comprehensive museum. Not too Spain/Barcelona centric. Lots of great displays with multi-language descriptions, and not surprisingly a very large collection of guitars ☺. Highly recommended, & very good value at just 5 euros.", "publishedDate": "2015-10-02", "language": "en", "rating": 5}, {"id": 300324010, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d2223604-r300324010-Museu_de_la_Musica-Barcelona_Catalonia.html", "text": "I really didn't know what to expect from the Flamenco show, and was rather sceptical thinking it might be a very touristy attraction and make me cringe.   However, it did not disappoint, the show was truly amazing.  The building itself takes your breath away.  The dancing & singing was raw, passionate and everything you would expect and more from a real flamenco dance show. \n\nWe sat on the top tier, left hand side when looking at the stage.  I would recommend the next level down or in the main front section.  It was very strange, when the show just began, EVERYONE from the cheap seats at the back, got up moved to the more expensive seats at the front! No-one seemed to care.", "publishedDate": "2015-08-17", "language": "en", "rating": 5}, {"id": 297239397, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d2223604-r297239397-Museu_de_la_Musica-Barcelona_Catalonia.html", "text": "We impulsively visited this on the return to our hotel (as it was a free thing with our BC5 cards.....turns out it's free anyway ). We're very glad we did. A very interesting collection of old guitars and pianos. Definitely one for the muso's. ", "publishedDate": "2015-08-09", "language": "en", "rating": 4}, {"id": 292747115, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d2223604-r292747115-Museu_de_la_Musica-Barcelona_Catalonia.html", "text": "One week in Barcelona and this was the top experience of the whole great week. We visited on Monday and we were the only guests - amazing... What beautiful instruments - really recommend to visit !!!", "publishedDate": "2015-07-26", "language": "en", "rating": 5}, {"id": 277676754, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d2223604-r277676754-Museu_de_la_Musica-Barcelona_Catalonia.html", "text": "If you are a musician or into classical music, this is the place for you. Beautifully displayed instruments cover centuries of music. Excellent/modern museum though not near the center of the city.", "publishedDate": "2015-06-03", "language": "en", "rating": 4}, {"id": 262840813, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d2223604-r262840813-Museu_de_la_Musica-Barcelona_Catalonia.html", "text": "This quiet and relatively hidden museum is filled with wonderful examples of western and non-western instruments dating back hundreds of years, set out so you can explore their evolution. Most hand-holdable instruments were presented in such a way that they would be viewed from many angles. Perhaps it would be less appealing to non-musicians, but for me this place left me with many smiles and much fascination satisfied.", "publishedDate": "2015-03-31", "language": "en", "rating": 5}, {"id": 257342133, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d2223604-r257342133-Museu_de_la_Musica-Barcelona_Catalonia.html", "text": "This was one of the high lights of the city visit. Its just amazing in side and be sure to book onto a guided tour as your see so much more and learn about its history.", "publishedDate": "2015-03-02", "language": "en", "rating": 5}, {"id": 255296452, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d2223604-r255296452-Museu_de_la_Musica-Barcelona_Catalonia.html", "text": "We had a guided tour in this fantastic building/conserthall. Everywhere in this building you can fond wonderful artwork. On the walls, the ceilings and the columns. Wonderful acustic also. A \"MUST SEE\"!", "publishedDate": "2015-02-19", "language": "en", "rating": 5}, {"id": 250215774, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d2223604-r250215774-Museu_de_la_Musica-Barcelona_Catalonia.html", "text": "You don't need to be a theatre goer to appreciate how incredible this building is.   It is fun to make the comparison between this and the theatres you would attend in your own country.   Somehow it makes them seem very average.    Fascinating history, wonderful guide, a must do.", "publishedDate": "2015-01-20", "language": "en", "rating": 5}, {"id": 249606452, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d2223604-r249606452-Museu_de_la_Musica-Barcelona_Catalonia.html", "text": "The detailing of the ceilings is beautiful and the stairways are very elegant.  We could not find the elevators at first but when we finally did they were out of order!", "publishedDate": "2015-01-16", "language": "en", "rating": 4}, {"id": 246132671, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d2223604-r246132671-Museu_de_la_Musica-Barcelona_Catalonia.html", "text": "The building itself does not give any indication of the incredible collection it holds.  I'm sure if more people/ tourists were aware of this treasure trove, they would flock there. It is a bit out of the way but we enjoyed going out to the 'burbs to see a different Barcelona.  I'm not a great music fan (but my husband is) and I chose this after finding it on Trip Advisor. We paid for a guided tour which was for only 4 ( by one guide) in English and Portuguese.  To be frank, I was not interested in the detail at all but the music lovers were rapt. I think the guitar tour went for an hour.  After this, we were joined by 2 others and the 6 of us had a private concert by a wonderful guitar player for 30 mins.  We could then spend whatever time we wanted to explore further in Museum but by then I needed a break. All of this for only Euro 10 each.  Marvellous find- even for people with only a passing interest in music.", "publishedDate": "2014-12-27", "language": "en", "rating": 5}, {"id": 243207860, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d2223604-r243207860-Museu_de_la_Musica-Barcelona_Catalonia.html", "text": "Architect Liuis Domenech i Montaner's masterpiece. Take the tour, which enables you to sit in the richly decorated concert hall. Classy gift shop too.", "publishedDate": "2014-12-06", "language": "en", "rating": 5}, {"id": 242939065, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d2223604-r242939065-Museu_de_la_Musica-Barcelona_Catalonia.html", "text": "If you are into music, music histroy or music instruments, this place will be highly intersting to you and worth a visit, where else can you see close by more than 100 different guitars?\n\nIf on the other hand you are not really into the matter, you will probably get bored looking at more than 100 different guitars (and thousands of other instruments) and would probably enjoy more visiting a different attraction. By this i mean, this is a \"serious music\" museum indeed.\n\nThe abolute highlight is the room at the end of the museum where you (and your kids) can try out different instruments!", "publishedDate": "2014-12-04", "language": "en", "rating": 4}, {"id": 236779834, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d2223604-r236779834-Museu_de_la_Musica-Barcelona_Catalonia.html", "text": "This is not an obligatory place to visit for the standard Barcelona tourist. If you are, however, interested in musical instruments, this is the right place for you. The museum shows a large collection of musical instruments from ancient and tribal ones to contemporary instruments from all over the world. They explain the development of music through the ages. Unfortunately many explaining texts are directly written on the glass windows that protect the instruments and are therefore often hard to read due to the lighting situation. ", "publishedDate": "2014-10-28", "language": "en", "rating": 4}, {"id": 236564460, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d2223604-r236564460-Museu_de_la_Musica-Barcelona_Catalonia.html", "text": "We thoroughly enjoyed the guided tour through the guitars and all the history described by our very knowledgeable guide. Wonderful collection of many types of instruments in general and interesting history of evolution of musical instruments. We enjoyed a private guitar concert by Jacob, who was a very accomplished musician. It was a very well spent two hours and I would highly recommend it to anyone visiting Barcelona.", "publishedDate": "2014-10-27", "language": "en", "rating": 5}, {"id": 221514504, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d2223604-r221514504-Museu_de_la_Musica-Barcelona_Catalonia.html", "text": "The collection of instruments here is incredible, it is large enough to spend over an hour reading and experiencing all this place has to offer.\n\nEven for non-musicians it is well worth a visit.", "publishedDate": "2014-08-13", "language": "en", "rating": 5}, {"id": 219820897, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d2223604-r219820897-Museu_de_la_Musica-Barcelona_Catalonia.html", "text": "I really enjoyed myself in the great collection of musical instruments. The panels are informative with the history of music and the evolution involved. You can listen to the \"concert\" easily from the exhibition area. The temporary exhibition is also very nice with audios.", "publishedDate": "2014-08-05", "language": "en", "rating": 4}, {"id": 214915651, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d2223604-r214915651-Museu_de_la_Musica-Barcelona_Catalonia.html", "text": "It will be wonderful if you could attend a concert inside this very artistic work of art!  But if time is not allowed, just go in for an hour of guided tour, you won't be disappointed!", "publishedDate": "2014-07-11", "language": "en", "rating": 4}, {"id": 178374011, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d2223604-r178374011-Museu_de_la_Musica-Barcelona_Catalonia.html", "text": "After seeing a lot of Gaudi architecture and the Miro museum, the museu de la Musica was a real treat!  There was a wonderful exhibition about the history of \"recording\" music, starting with the creation of musical notation.  As an American, it was also a treat to see so many old European instruments, particularly pianos and organs.  The funny thing for my musician husband and I was that there was such a shortage of electric guitars (2??).  Good spanish guitar collection too.", "publishedDate": "2013-09-23", "language": "en", "rating": 5}, {"id": 174589856, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d2223604-r174589856-Museu_de_la_Musica-Barcelona_Catalonia.html", "text": "If you are in Barcelona and are even mildly interested in musical instruments you must visit the Museu de la Musica.\nIt is ultra-modern and has the most wonderful collection of instruments you will ever find. You will, without question, see instruments you never knew existed. It is divided into percussion, string, wind, etc. sections, all divided off by floor to ceiling glass walls. As you walk into a section a recording of a musical instrument pertaining to that section will start playing.\nTo get there, you will find a tram terminus at the zoo entrance. Get off the tram at the Glories stop. You will see a beautiful white building which is the National Theatre of Catalonia. This is just your landmark. Across the road is the L'Auditori de Barcelona and the museum is in this building.", "publishedDate": "2013-08-28", "language": "en", "rating": 5}, {"id": 174589779, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d2223604-r174589779-Museu_de_la_Musica-Barcelona_Catalonia.html", "text": "If you are in Barcelona and are even mildly interested in musical instruments you must visit the Museu de la Musica.\nIt is ultra-modern and has the most wonderful collection of instruments you will ever find. You will, without question, see instruments you never knew existed. It is divided into percussion, string, wind, etc. sections, all divided off by floor to ceiling glass walls. As you walk into a section a recording of a musical instrument pertaining to that section will start playing.\nTo get there, you will find a tram terminus at the zoo entrance. Get off the tram at the Glories stop. You will see a beautiful white building which is the National Theatre of Catalonia. This is just your landmark. Across the road is the L'Auditori de Barcelona and the museum is in this building.", "publishedDate": "2013-08-28", "language": "en", "rating": 5}, {"id": 170597713, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d2223604-r170597713-Museu_de_la_Musica-Barcelona_Catalonia.html", "text": "Spent 2 hrs on a Saturday afternoon. Very interesting collection. Many pieces are extremely detailed - lovely craftsmanship.  We were 4 in our group and found ourselves alone in the museum - there were 4 employees also. We paid the basic entry fee only - at 4 pm there was a concert by a classical guitarist - but the staff insisted that we pay the 15euro nonetheless - we felt that this was curious as there were no other visitors.  We decided to skip the concert. ", "publishedDate": "2013-08-03", "language": "en", "rating": 3}, {"id": 169076649, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d2223604-r169076649-Museu_de_la_Musica-Barcelona_Catalonia.html", "text": "Beauty unrestrained in the smallest Opera house i know ... just another ingenious architectural treasure of Barcelonal!", "publishedDate": "2013-07-25", "language": "en", "rating": 5}, {"id": 167568197, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d2223604-r167568197-Museu_de_la_Musica-Barcelona_Catalonia.html", "text": "We spent one hour here looking at the incredible array of different instruments from all over the world - many of which we'd never heard of. There are interesting captions about the instruments and a room where you can try play the instruments; including a harp, electric guitar, cello, organ etc. Some children would probably find it boring because there's more looking and listening than hands-on activities. It cost us €4 each and was a great place to stop on a hot day. Two metro stops are close by - 5 mins walk.", "publishedDate": "2013-07-14", "language": "en", "rating": 4}, {"id": 154915608, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d2223604-r154915608-Museu_de_la_Musica-Barcelona_Catalonia.html", "text": "This music is quiet because it is not that close to the major tourism area, but well worth the visit, you get to learn the ancient music instruments of catalunya and many other countries and listen to the music of barloque and you can even play some instruments, I leant a lot for this visit.", "publishedDate": "2013-03-17", "language": "en", "rating": 5}, {"id": 137356650, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d2223604-r137356650-Museu_de_la_Musica-Barcelona_Catalonia.html", "text": "The museum is nice and it owns a big collection of ancient and less common instruments. It's really a nice atmosphere. Unfortunately there are no satisfying explanations, but some really long and boring tables. The audioguide has no comments and it only allows you to listen to some instrument (the normal ones particularly). The idea is good it shoul be improved. Ticket 5 euro.", "publishedDate": "2012-08-16", "language": "en", "rating": 3}, {"id": 136991732, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d2223604-r136991732-Museu_de_la_Musica-Barcelona_Catalonia.html", "text": "Beautiful museum, a must for music lovers. Free entrance on sundays (as for august 2012), and an interactive show room at the end of the visit, where you can measure your abilities on the guitar, harp, and cello.", "publishedDate": "2012-08-12", "language": "en", "rating": 5}, {"id": 131152038, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d2223604-r131152038-Museu_de_la_Musica-Barcelona_Catalonia.html", "text": "This museum is mostly missed by most travelers.  its located not in the center of Barcelona and takes a little time walking distance from the Metro.\nIts in a music school that looks VERY ugly from the outside but whats on theinside that counts.\nThere are a lot of musical instruments from many different eras and places around the world. Very well presented and explained in Spanish Catalan and English.\nAt the end you can play the harp/electric guitar and some other musical instruments.\nLoved it...", "publishedDate": "2012-06-02", "language": "en", "rating": 5}, {"id": 123484876, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d2223604-r123484876-Museu_de_la_Musica-Barcelona_Catalonia.html", "text": "This is quite a small museum but houses a very good collection with a special section on Spanish guitars.  Of note there is an original Torres guitar (who invented the modern Spanish guitar) owned by the renowned guitarist Miguel Llobet.  There are also a great selection of keyboard instruments and even a room where you can try some instruments too.  It's a very interesting museum and well worth the small admission fee.", "publishedDate": "2012-01-23", "language": "en", "rating": 4}]}}]