[{"locationId": 8598951, "name": "Mirador del Poble Sec", "placeType": "ATTRACTION", "reviewListPage": {"reviews": [{"id": 598592417, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d8598951-r598592417-Mirador_del_Poble_Sec-Barcelona_Catalonia.html", "text": "I have been and seen so many castles already, so I was not impressed by this particular one. There is a nice view over the city though, but the castle itself didn’t have much to offer. If you don’t mind to spend an hour to get there for a nice view- you should go. For me- I’d prefer to see the city with gorgeous art nouveau building. ", "publishedDate": "2018-07-22", "language": "en", "rating": 3}, {"id": 582548783, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d8598951-r582548783-Mirador_del_Poble_Sec-Barcelona_Catalonia.html", "text": "The view speaks for itself.  Well worth the visit.\n\nUnfortunately the very well situated, and nicely presented restaurant is a disappointment.  The staff were rude and disinterested - the scruffy, dog eared and dirty menus were thrown (accurately it has to be said) on to our table as the waiter walked past, and then we had to wait another 15 minutes before he bothered to return.\n\nIt wasn’t busy.  This was evidenced by the various empty tables stacked with empty glasses from previous guests, whilst the staff had a good chat.", "publishedDate": "2018-05-24", "language": "en", "rating": 2}, {"id": 571696068, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d8598951-r571696068-Mirador_del_Poble_Sec-Barcelona_Catalonia.html", "text": "Okay, maybe it is not so secret especially to the locals but when we were there, it certainly felt like a secret. \n\nWe stumbled on the park by accident on our way to Castell de Montjuïc (which is in another review) as we stopped 1 stop too early via the Barcelona Hop On/Off bus but I am glad we did. The view from the park of Barcelona city and the Barcelona Port was brilliant! Clear views and it was such a peaceful park barely anybody (i.e. tourists) but locals who were walking their dogs or jogging through. \n\nIt is great for a short photo stop and there IS one hotel there, i.e. Miramar Hotel. There is also a cafe there though we didn't try it. \n\nYou can probably take a taxi up there or walk from somewhere from the Barcelona Port area if you are not taking the bus.", "publishedDate": "2018-04-07", "language": "en", "rating": 5}, {"id": 570954267, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d8598951-r570954267-Mirador_del_Poble_Sec-Barcelona_Catalonia.html", "text": "You can walk up to this park and viewpoint from the Marina. You get good views from here and there's a café if you need refreshment.", "publishedDate": "2018-04-04", "language": "en", "rating": 3}, {"id": 555755327, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d8598951-r555755327-Mirador_del_Poble_Sec-Barcelona_Catalonia.html", "text": "Great views but cafe a bit scruffy and the food overpriced and poorly presented. The waiter who served us however was polite and efficient not like the barman who only seemed to have any interest in using his mobile phone   ", "publishedDate": "2018-01-22", "language": "en", "rating": 3}, {"id": 529053462, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d8598951-r529053462-Mirador_del_Poble_Sec-Barcelona_Catalonia.html", "text": "We walked up and sat on the terrace with fabulous views over the city.\nThe service wasn't very efficient or friendly and I don't think I would want to eat there.", "publishedDate": "2017-10-02", "language": "en", "rating": 3}, {"id": 469398122, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d8598951-r469398122-Mirador_del_Poble_Sec-Barcelona_Catalonia.html", "text": "Climb to Mirador del Poble Sec from Pg. de Colom was steep but not too long. It was worth the view from the top. ", "publishedDate": "2017-03-22", "language": "en", "rating": 5}, {"id": 450508184, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d8598951-r450508184-Mirador_del_Poble_Sec-Barcelona_Catalonia.html", "text": "We hiked up from the Poble Sec metro stop, and it was a steep, but pleasant climb. The views we got at the top were worth it! Great views of the city and the Mediterranean.", "publishedDate": "2017-01-08", "language": "en", "rating": 4}, {"id": 427897673, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d8598951-r427897673-Mirador_del_Poble_Sec-Barcelona_Catalonia.html", "text": "One of the vantage points that offers best views of Barcelona.In a clear,sunny day you can admire from here the entire town,the port and the sea.A perfect place!", "publishedDate": "2016-10-14", "language": "en", "rating": 4}, {"id": 305672415, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d8598951-r305672415-Mirador_del_Poble_Sec-Barcelona_Catalonia.html", "text": "I think this is a very nice place to enjoy a sunset in Barcelona. Romantic gardens, 360º views. If it is a clear day you can see all the coast line. Also it is a good place to enjoy fireworks specially on Sant Joan's festive night. There are some benches, so it's really comfortable to bring a snack and just contemplate the ocean and the city.", "publishedDate": "2015-09-01", "language": "en", "rating": 5}]}}]