[{"locationId": 2235343, "name": "Museu de Ciencies Naturals de Barcelona", "placeType": "ATTRACTION", "reviewListPage": {"reviews": [{"id": 749876064, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d2235343-r749876064-Museu_de_Ciencies_Naturals_de_Barcelona-Barcelona_Catalonia.html", "text": "Good natural history museum, lots of interactive things for the kids. Would definitely recommend the Primates exhibit which is on at the minute very interesting and lots for the kids to do.\nThe main part has a lot about geology which may not interest everyone.", "publishedDate": "2020-03-08", "language": "en", "rating": 4}, {"id": 741813652, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d2235343-r741813652-Museu_de_Ciencies_Naturals_de_Barcelona-Barcelona_Catalonia.html", "text": "This is one of the best natural history museums I have visited.  The building itself is amazing, but the displays are well-organized, well-labeled, well-lit, and very educational.  The permanent exhibit shows the evolution of the world and life in the world, uses exhibits focused on themes like movement, skeletons, similarities of species, and the like--rather than showing all primates together and all birds together.  The collection shown isn't huge, but it is well displayed.  The special exhibit on primates was extremely good, intended to show the variety of primates, how they live, and what threats they face, to encourage people to care about preservation.", "publishedDate": "2020-01-28", "language": "en", "rating": 5}, {"id": 723986289, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d2235343-r723986289-Museu_de_Ciencies_Naturals_de_Barcelona-Barcelona_Catalonia.html", "text": "We took our 2 grandchildren here but the museum interior is so dark that the 2½ year old wanted to leave 10 minutes after we arrived. We had booked them into the interactive children's classroom but that wasn't for an hour, so it was difficult to keep him interested. There was an exhibition on climate change and pollution, with long white \"string\" curtains. The boys (2½ and just turned 5) got told off by a security guard for walking through them...they must be just for effect, but they're like a magnet for children. \nThis museum is ok for the first Sunday in the month after 3pm, but I wouldn't pay to go.", "publishedDate": "2019-11-05", "language": "en", "rating": 3}, {"id": 723284912, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d2235343-r723284912-Museu_de_Ciencies_Naturals_de_Barcelona-Barcelona_Catalonia.html", "text": "Natural science museums should be bright, fun, educational, inspiring and accessible.  This museum is a clear example of where the architecture does not fit at all the purpose of the building.  The building is dark - black walls, black floor, black ceiling and dimly lit.  And this is the inside of the building!  You can barely see where you are walking. The exhibits are mediocre.  You just want to get it over with.  \n\nOn the day I was there there was a climate change exhibit which was incomprehensible, despite being aimed at children and youth - massive walls of tiny text, videos shown on screens made of hanging string which made them blurry.  Also, the building is built on a slanted lot so they put it up on stilts, encouraging bums and homeless to squat under it. Most unfortunate.  A rare miss for Barcelona.", "publishedDate": "2019-11-02", "language": "en", "rating": 1}, {"id": 696084018, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d2235343-r696084018-Museu_de_Ciencies_Naturals_de_Barcelona-Barcelona_Catalonia.html", "text": "We spent well over two hours here and probably only saw / read / interacted with a small proportion of the amazing wealth of exhibits. The building is huge and the layout is smooth and easy to navigate. \n\nThere is a huge amount of information to consume and an extraordinarily diverse and detailed array of objects and beautifully presented films.  \n\nI loved the shark “swimming” on the floor, the evolution of the planet, the numerous fossils, minerals, bacteria, microbes, skeletons... It is a truly amazing experience and the knowledge and expertise shared is fantastic. \n\nDefinitely recommended and very reasonably priced. \n\nBe aware there is no cafe but a couple of vending machines. We didn’t go into the gift shop or the garden exhibition. ", "publishedDate": "2019-08-06", "language": "en", "rating": 5}, {"id": 683128839, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d2235343-r683128839-Museu_de_Ciencies_Naturals_de_Barcelona-Barcelona_Catalonia.html", "text": "My friend and I visited this museum when we ran out of things to do in the city centre over the weekend. I remembered reading that some museums had free admission on Sunday afternoon and it turns out this one had the same offer. We grabbed a metro to a station about 10 minutes walk from the museum and were amazed by how modern and big the museum was from the outside. Once inside we just leisurely walked through all the exhibits, some interesting us more than others, but we were incredibly impressed by how spacious it was inside and the collection size itself. Me and my friend are especially interested in animals and gemstones, of which the museum had lots of specimen to offer. I would highly recommend visiting this museum over CosmoCaixa (that we also visited) and just using your T-10 public transport ticket to get here.", "publishedDate": "2019-06-21", "language": "en", "rating": 5}, {"id": 678060048, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d2235343-r678060048-Museu_de_Ciencies_Naturals_de_Barcelona-Barcelona_Catalonia.html", "text": "As a Science geek, I made a point to see this museum even if it was far from the city center.  The building itself was already an attraction to me so I feel like it was worth making time for.\n\nI went there during the free museum hours (3PM onwards on Sundays) and there were only a few people which was nice (for selfish reasons).  I started with the temporary exhibit called We are Nature which was essentially a call to care for the Earth.  \n\nThe main exhibit started with the history of the Earth.  There were exhibit on fossils from the time of the dinosaurs, stuffed animals, rocks and minerals, bacterial culture and many more.  My favorite were on rocks and minerals, I did not think they could get that colorful.  It was hard to see some of the exhibits that were placed on the glass shelves though.", "publishedDate": "2019-06-01", "language": "en", "rating": 4}, {"id": 677105469, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d2235343-r677105469-Museu_de_Ciencies_Naturals_de_Barcelona-Barcelona_Catalonia.html", "text": "We enjoyed the different exhibitions and learned alot about evolution of the world.\n\nThe things you learned as a child coming back. They have interactive videos you can play as well.\n\nReasonably priced at 10 euros as well.\n\n", "publishedDate": "2019-05-28", "language": "en", "rating": 5}, {"id": 676770208, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d2235343-r676770208-Museu_de_Ciencies_Naturals_de_Barcelona-Barcelona_Catalonia.html", "text": "There’s really a lot to see in this interactive museum! Very interesting information and nice selection of what you get to see in the expositions.", "publishedDate": "2019-05-27", "language": "en", "rating": 5}, {"id": 675788267, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d2235343-r675788267-Museu_de_Ciencies_Naturals_de_Barcelona-Barcelona_Catalonia.html", "text": "This is a special looking natural science museum built in the forum park.\n\nTakes about 1-1:30 hours to visit, the museum mainly display different mineral rock types (quite cool to see all the shapes and colors), fossils, skeletons, and stuffed animals.\n\nThe museum tries to take you through the different biological eras but not very methodologically. It starts well with the trilobites in early Cambrian and Palezoic era, but then they lose it. You start seeing random displays of birds, vertebrates, mammals, fish, mineral stones etc.\n\nThe animals are very nicely logged and kept. Some have the animal placed next to its skeleton which is cool, but not much information is provided on any item on display, so it gets a bit messy and the visit becomes slightly random and incoherent, Shane since the items in the museum itself are very nice. \n\nThe museum could also use some people to guide you through and provide extra info to visitors, or at least an audio guide.\n\nRecommended to those interested in natural sciences nevertheless.", "publishedDate": "2019-05-22", "language": "en", "rating": 4}, {"id": 660991596, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d2235343-r660991596-Museu_de_Ciencies_Naturals_de_Barcelona-Barcelona_Catalonia.html", "text": "The museum is magnificent. the collection of rocks. animals and fossils are really interesting place for learning ", "publishedDate": "2019-03-25", "language": "en", "rating": 5}, {"id": 653778235, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d2235343-r653778235-Museu_de_Ciencies_Naturals_de_Barcelona-Barcelona_Catalonia.html", "text": "Visited on a Sunday afternoon when it's free, not sure how we'd feel if we'd paid. Spent a couple of hours walking round. There's exhibits on the formation of earth, stuffed animals and plant specimens. Everything is translated in English. There's a lot of different specimens to see, but not much that held much interest for our family. If you research the exhibits beforehand and feel they would be of interest then go for it. We were staying nearby and thought we would visit to see what it was like as it was free to enter. Not sure if we'd have gone if we had to pay, but then we're not big on museums anyway.", "publishedDate": "2019-02-20", "language": "en", "rating": 3}, {"id": 630089506, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d2235343-r630089506-Museu_de_Ciencies_Naturals_de_Barcelona-Barcelona_Catalonia.html", "text": "This museum has quite a large collection of geological, botanical and zoological samples, mostly arrayed in glass cases.  Come here if you are keen in one of these and want to expand your experience.  There are very few attempts at explanation, demonstration and interaction for teaching science.", "publishedDate": "2018-11-01", "language": "en", "rating": 2}, {"id": 615228535, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d2235343-r615228535-Museu_de_Ciencies_Naturals_de_Barcelona-Barcelona_Catalonia.html", "text": "Fantastic building and good value for money. Lots of interactive exhibits and good for children. Exhibits presented in English with lots of examples about the natural world a good in depth knowledge of the Mediterranean area. Well worth a visit. ", "publishedDate": "2018-09-09", "language": "en", "rating": 4}, {"id": 605077902, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d2235343-r605077902-Museu_de_Ciencies_Naturals_de_Barcelona-Barcelona_Catalonia.html", "text": "At the beginning my kids didn't want to go, then they loved it. What ever road you take to get there its worth it", "publishedDate": "2018-08-10", "language": "en", "rating": 5}, {"id": 585276570, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d2235343-r585276570-Museu_de_Ciencies_Naturals_de_Barcelona-Barcelona_Catalonia.html", "text": "The exhibition is not the largest - and the dim lighting is an interesting choice... But it is cheap to visit, it has a great location and the staff is very friendly so why not go? :) ", "publishedDate": "2018-06-05", "language": "en", "rating": 3}, {"id": 579477369, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d2235343-r579477369-Museu_de_Ciencies_Naturals_de_Barcelona-Barcelona_Catalonia.html", "text": "There seem to be some interesting exhibits, but they are difficult to see through the dim lighting and sombre paintwork. Both entrance/exit and lifts are hard to find, almost as though they were not meant to be used. Much larger font sizes on the explanatory cards might help to understand what is being looked at. An ugly building for the housing of what is a fascinating topic.", "publishedDate": "2018-05-11", "language": "en", "rating": 2}, {"id": 577739692, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d2235343-r577739692-Museu_de_Ciencies_Naturals_de_Barcelona-Barcelona_Catalonia.html", "text": "Very fun for kids and not only. Definitely worth a trip to that part of town. Also not sure of the occasion, but the entry was free.", "publishedDate": "2018-05-03", "language": "en", "rating": 5}, {"id": 576521751, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d2235343-r576521751-Museu_de_Ciencies_Naturals_de_Barcelona-Barcelona_Catalonia.html", "text": "We went to the museum because it was close to where we were staying and it was really nice.  They provide a nice introduction with a film about the history of the earth from the Big Bang onward.  There is also a video about how science advances through time.  The exhibits were bytime periods and were well laid out.  Most of the descriptions were in English as well as Spanish and Catalonian.  You touched a flag for the language you wanted.  A really top quality museum.  We did not visit the special exhibit because we spent so long in the regular part. Of the museum.", "publishedDate": "2018-04-29", "language": "en", "rating": 5}, {"id": 576141293, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d2235343-r576141293-Museu_de_Ciencies_Naturals_de_Barcelona-Barcelona_Catalonia.html", "text": "This is a Nice Museum to learn about the formation of the earth, rocks, evolution, the sea, animals and more. There is a 15 minute video about the ocean and stuff to do for the kids.", "publishedDate": "2018-04-27", "language": "en", "rating": 4}, {"id": 569942480, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d2235343-r569942480-Museu_de_Ciencies_Naturals_de_Barcelona-Barcelona_Catalonia.html", "text": "The building is great and provides a unique setting. No creaky wooden floor boards or confusing layouts in this natural history museum. The exhibits are very good, particularly the geology and stones. There are no large dinosaurs  skeletons here unfortunately and there's not enough toilets, especially for a modern building. Diagonal mall is very close and a good place to eat before or after. We spent 90 minutes at the museum.  ", "publishedDate": "2018-03-31", "language": "en", "rating": 4}, {"id": 563358057, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d2235343-r563358057-Museu_de_Ciencies_Naturals_de_Barcelona-Barcelona_Catalonia.html", "text": "We’ve been there with our childre of 6 & 8 years. Really interesting things. A lot of interective screens. A place where younger children can explore, discover or find something new for themselfs, it works from 11-13:00 & from 16-19:30. The temporary exibiyion was about ocean. There is small shop with suvenirs. As we came on a saturday after 14:00, our tickets cost 13€ for all of us including all exibitions.", "publishedDate": "2018-02-28", "language": "en", "rating": 4}, {"id": 557334055, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d2235343-r557334055-Museu_de_Ciencies_Naturals_de_Barcelona-Barcelona_Catalonia.html", "text": "As museums go this is quite small but well laid out museum, with a meandering layout to move you through the various exhibitions.  But the real jaw-dropper and the reason to travel to Catalunya is to see the building itself.  It is this huge blue spaceship style building with a triangular peak that juts out over the park it sits on.  The use of silver inlays among the blue panels, feels like the inside and the outside all blend together.  If you love architecture and architectural design, this is a beauty.", "publishedDate": "2018-01-30", "language": "en", "rating": 4}, {"id": 556505074, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d2235343-r556505074-Museu_de_Ciencies_Naturals_de_Barcelona-Barcelona_Catalonia.html", "text": "It was a rainy day... and it was warm inside. the place is not big, only 2 Dinosaurs, and a lot of movies and pictures... ", "publishedDate": "2018-01-26", "language": "en", "rating": 2}, {"id": 552108519, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d2235343-r552108519-Museu_de_Ciencies_Naturals_de_Barcelona-Barcelona_Catalonia.html", "text": "Houses a number of dinosaurs the most unusual being a large meat eater found only in Europe. Ther was a large contingent of school kids who ran between the exhibits and made viewing a challenge.", "publishedDate": "2018-01-06", "language": "en", "rating": 4}, {"id": 531657063, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d2235343-r531657063-Museu_de_Ciencies_Naturals_de_Barcelona-Barcelona_Catalonia.html", "text": "If you use Tripadvisor for navigation to this museum it will take you to Carrer (street) Leonardo de Vinci. It is the other side of the city! It happened to us.\nYou need to get to Leonardo de Vinci square. \nBetter call the museum and ask them how to get there. \nThe museum is relatively small but very beautiful. ", "publishedDate": "2017-10-10", "language": "en", "rating": 5}, {"id": 527576909, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d2235343-r527576909-Museu_de_Ciencies_Naturals_de_Barcelona-Barcelona_Catalonia.html", "text": "My boyfriend came here on our last day in Barcelona.  We paid 6 euros each on the door to go around the permanent exhibition.  This only took us an hour as it was pretty small. However, it is very well presented, although we felt some of the items were repeated on several occasions.  The exhibits are mostly of stuffed animals, fossils, rocks and crystals.  They are however quite high tech, using a variety of different tools to explain and help you learn. They provide lockers for a refundable euro and also have a buggy park.  The toilets were large and clean but I didn't see any food or drink facilities.  A big part of the building is dedicated to educational groups, so is great for schools.  They also sometimes have temporary exhibits, which you can pay extra to go and see. \nThe building is right on the coast, meaning we had a lovely walk along the promenade afterwards. It's worth a visit but don't plan a whole day there.", "publishedDate": "2017-09-26", "language": "en", "rating": 3}, {"id": 523365542, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d2235343-r523365542-Museu_de_Ciencies_Naturals_de_Barcelona-Barcelona_Catalonia.html", "text": "Awesome museum if you're interested in nature. So many things to see so make sure you have enough time. Totally recommended.  Also it's cheap and good distention for a rainy day. ", "publishedDate": "2017-09-11", "language": "en", "rating": 5}, {"id": 506376969, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d2235343-r506376969-Museu_de_Ciencies_Naturals_de_Barcelona-Barcelona_Catalonia.html", "text": "that museum was very intresting and awesome the part i liked the most was the dinosaurs  bones though i even liked the animal part\n\n", "publishedDate": "2017-07-28", "language": "en", "rating": 5}, {"id": 502403339, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d2235343-r502403339-Museu_de_Ciencies_Naturals_de_Barcelona-Barcelona_Catalonia.html", "text": "A lot of effort has gone into making very engaging exhibits with very little actual scientific artifacts. Doesn't detract from it though just means better suited to mass market rather than science enthusiasts. But cheap way to spend a few hours and close to the beach so you can cover two bases. Really geared for school groups so plenty for small children. ", "publishedDate": "2017-07-16", "language": "en", "rating": 4}, {"id": 500988208, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d2235343-r500988208-Museu_de_Ciencies_Naturals_de_Barcelona-Barcelona_Catalonia.html", "text": "The museum is neat and well organized, maybe the taxiderm animals are a bit gloomy but still good...We were lucky there was a specific show on Spinosaurus...awesome!!!", "publishedDate": "2017-07-11", "language": "en", "rating": 5}, {"id": 490283860, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d2235343-r490283860-Museu_de_Ciencies_Naturals_de_Barcelona-Barcelona_Catalonia.html", "text": "We were in the museum a couple with two children, as someone who it's his fifth time in Barcelona it was a refreshing experience because it's the first time we visited this museum and to find out that it is next to Primark was the cherry on the cake :)\nThe museum itself is very friendly and contains interactive exhibits and is very accessible even to children who do not understand the language (our children were 4 and 2.5 years old and enjoyed it very much), we loved the stuffed animal show and the exhibition of the dinosaur which is very impressive.", "publishedDate": "2017-06-04", "language": "en", "rating": 4}, {"id": 481870875, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d2235343-r481870875-Museu_de_Ciencies_Naturals_de_Barcelona-Barcelona_Catalonia.html", "text": "This is a great museum. Traditional cabinet exhibits, short films and touch tables. Very accessible for visually impaired (although I could not say whether braille is for English or Spanish) and small children may need lifting up to feel the touch exhibits. Nice system of showing individual exhibit placing on phylogenetic trees. Nice and compact for school trips, additional spaces for learning, some with computers. Some areas are rather dark and a nursery group that was there during our visit obviously had some children that found this a bit scary.\nVery close to beach so great fall back in case of inclement weather. I really enjoyed the geological and paleontological exhibits - there are also some cases of stuffed animals and birds.", "publishedDate": "2017-05-05", "language": "en", "rating": 5}, {"id": 480588631, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d2235343-r480588631-Museu_de_Ciencies_Naturals_de_Barcelona-Barcelona_Catalonia.html", "text": "Nice place with average exposition about earth history. The exhibition is small and without many interactive tools for young children", "publishedDate": "2017-05-01", "language": "en", "rating": 3}, {"id": 475376051, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d2235343-r475376051-Museu_de_Ciencies_Naturals_de_Barcelona-Barcelona_Catalonia.html", "text": "It was very empty during my visit in this interestingly designed building that sits above the ground. The initial galleries are very well laid out and take you through stages in the earth's development with projections on the wall that need no language and fossils from the period. Many of the remaining exhibits had interesting facts rather than just descriptions and some of the smaller rooms used effective ways to demonstrate things such as the classification room that used sorting of buttons to explain how animals could be classified. A tip is to take your glasses if you wear them. The museum could be even better if:\na) Labels were above rather than below cases in the initial section with larger font.\nb) In the fascinating room on animal behaviour. Rather than having 4 screens on different topics that cycle through Spanish, Catalan and English have 3 screen for each of the languages, showing all of the topics after each other. Not doing this meant a long wait when all the screens started showing the same language.\nc) There appeared to be an error in the description in the classification room when it showed the number of known species and predicted species as there seemed to be inconsistency in different places as to whether the predicted number of species included those already known or not.", "publishedDate": "2017-04-13", "language": "en", "rating": 4}, {"id": 466271940, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d2235343-r466271940-Museu_de_Ciencies_Naturals_de_Barcelona-Barcelona_Catalonia.html", "text": "We spent a great time and learnt lots of things about dinosaurs and evolution of earth. My 5 years old took part in an free activity in which he could touch dinosaurs' bones, fair, experience the tools used in prehistory by humans, etc.\nDownside was that the language used by the instructor when explaining the kids what they were going to see was Catalan. Fortunately kids were accompanied by a relative and most of the activity didn't require the help of the instructor.\n", "publishedDate": "2017-03-11", "language": "en", "rating": 4}, {"id": 458750619, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d2235343-r458750619-Museu_de_Ciencies_Naturals_de_Barcelona-Barcelona_Catalonia.html", "text": "The Museu de Ciencies Naturals is very easy to miss - it's at the north side of the city in a fugly building that's not got much else going on around it. We visited while the Spinosaurus exhibition was on - there's a massive spinosaurus outside and so you can buy a ticket for each side or both. We got both. We were also the only people in the whole museum for our entire 2 hour visit. It was amazing.\n\nThe museum has plenty in many languages, with a massive section of minerals and an almost as big section of taxidermy. So fascinating. There's plenty to look at and photograph.\n\nThe Spinosaurus exhibit was also pretty cool, with all of the videos being in English and Spanish, so we got to hear all of the information as well as read. The exhibit was very fun and such a great story about finding the bones, but I feel like there was a step missing in between this and then WOAH the dino is swimming. This bit was kinda glossed over and I would have loved to learn why they think it swims.\n\nOverall the museum is great and well worth the entrance fee - I would recommend to anyone else visiting if they had some spare time!", "publishedDate": "2017-02-11", "language": "en", "rating": 4}, {"id": 450071234, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d2235343-r450071234-Museu_de_Ciencies_Naturals_de_Barcelona-Barcelona_Catalonia.html", "text": "A bit far away from the city centre, in diagonal mar it's easy to reach by metro, the nearest stop is el maresme forúm. It's in a big venue with a lot of space for the collection. We visited both the permanent collection and the national geographic monography dedicated to the spinosaurus. The permanent collection is very interesting, with so many things to see: you can find fossils, animals, minerals, dinosaurs' bones and everything is well explained in an easy but at the same scientific method. National geographic's exhibition was also interesting and kids oriented with many attivities and explanations. If you're under 30 yo, you can pay a reduced ticket.", "publishedDate": "2017-01-06", "language": "en", "rating": 5}, {"id": 413445148, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d2235343-r413445148-Museu_de_Ciencies_Naturals_de_Barcelona-Barcelona_Catalonia.html", "text": "The earth journey experience is a more dynamic presentation, but this is the best natural science museum I was ever in. Very intelligent narrative that explained the theories very cogently. Lovely permanent exhibition and eye catching modern building.", "publishedDate": "2016-09-01", "language": "en", "rating": 5}, {"id": 411942743, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d2235343-r411942743-Museu_de_Ciencies_Naturals_de_Barcelona-Barcelona_Catalonia.html", "text": "We went because of the Spinosaurus, but enjoyed the whole museum. Our 6-year-old got tired of it before I'd spent as much time as I wanted to. i still think it's a good place to take kids, if you only want to stay an hour or so.", "publishedDate": "2016-08-28", "language": "en", "rating": 5}, {"id": 409294330, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d2235343-r409294330-Museu_de_Ciencies_Naturals_de_Barcelona-Barcelona_Catalonia.html", "text": "A must do visit if you are visiting Barcelona with kids!! It has a wonderful permanent collection and the building is a piece of art itself. It's a bit far from the main tourist attractions but totally worth it if you have a bit of extra time. Our family loved it!!", "publishedDate": "2016-08-23", "language": "en", "rating": 5}, {"id": 407591432, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d2235343-r407591432-Museu_de_Ciencies_Naturals_de_Barcelona-Barcelona_Catalonia.html", "text": "Not signposted at the metro but turn right when you come out and head towards the sea. The building is just beautiful. We thought we would be the only ones walking in but there were some people in there. Its a shame that people dont seem to come out this far but it was very welcome break from all the tourists in town. The fossil and mineral displays are much better than even the natural history museum in london! Amazing! Two downpoints: the english language button on the ipads around the museum didnt work most of the time and the products in the shop were more for children, teddies, toys...would have been nice to buy some minerals or some books in english. ", "publishedDate": "2016-08-19", "language": "en", "rating": 5}, {"id": 403260624, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d2235343-r403260624-Museu_de_Ciencies_Naturals_de_Barcelona-Barcelona_Catalonia.html", "text": "Visited here on a weeks stay in Barcelona mainly to see the Spinosaurus exhibition but the whole museum was very interesting and well laid out. Reasonable entrance fee too. ", "publishedDate": "2016-08-09", "language": "en", "rating": 4}, {"id": 402064699, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d2235343-r402064699-Museu_de_Ciencies_Naturals_de_Barcelona-Barcelona_Catalonia.html", "text": "Got more tr what we bargained for and the cheapest of all the attractions we visited in Barcelona. Admission for children  was free.  The cost was 13 euros for two adults. \n\nAnyone with any remote interest will enjoy visiting. \n\nThey have an extensive collection of geological and animal specimens along with interactive multimedia aids.\n\nTop tips. Turn off your camera flash and have your snacks outside. ", "publishedDate": "2016-08-06", "language": "en", "rating": 5}, {"id": 397239630, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d2235343-r397239630-Museu_de_Ciencies_Naturals_de_Barcelona-Barcelona_Catalonia.html", "text": "the most beautifully and attractive museum in Barcelona, blessed feelings, 3D display, animals.....really wonderful place and tones of information.\n\nhighly recommended.", "publishedDate": "2016-07-26", "language": "en", "rating": 5}, {"id": 395481153, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d2235343-r395481153-Museu_de_Ciencies_Naturals_de_Barcelona-Barcelona_Catalonia.html", "text": "I think this is one of the most overlooked museum in Barcelona (together with the Museu del Modernisme Catala). The Museu Blau as it is also called is located in the Forum area to the east of the city center. The whole area was built for the Forum Universal de las Culturas, together with the adjacent Convention Center and Diagonal Mar shopping center. Take the metro line L 4 to El Maresme / Forum. Inside the museum there is no daylight, just artificial illumination. The exhibition starts with a walk through the history of Earth, from the big bang to our time (neogene). There are various interactive exhibits as well. All in all, this first section of the museum is done quite well. The following sections are rather traditional in their concept, as they show different kind of animals, plants and minerals in glass cabinets. If you have already visited the more famous attractions in Barcelona and still have time to kill, then visiting this museum is a good way to accomplish this. There is also a small beach nearby that you might want to visit.  ", "publishedDate": "2016-07-22", "language": "en", "rating": 5}, {"id": 392357739, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d2235343-r392357739-Museu_de_Ciencies_Naturals_de_Barcelona-Barcelona_Catalonia.html", "text": "This museum's architecture is designed to make the interior quite somber which highlights the displays. I did not find it entirely pleasant and almost oppressive.  The museum's content is quite conventional and displays consist mostly of skeletons or taxidermy specimens for living creatures and there are also displays of rocks.  The displays are arranged by topic, such as evolution or fishes, etc.  The collections are extensive and the legends in three languages (Spanish, Catalan and English) generally quite good.", "publishedDate": "2016-07-13", "language": "en", "rating": 4}, {"id": 381868749, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d2235343-r381868749-Museu_de_Ciencies_Naturals_de_Barcelona-Barcelona_Catalonia.html", "text": "If you are in Barcelona just for a short time, you might want to visit other places first, but if you are staying longer, then a few hours can be well spent at the Museu Blau. The adults will be impressed from the beginning by the architecture of the building and all the area around and , once inside, by the technology used to display information. Holograms, lots of screens you can operate, projected lights and videos, isolated corners where you can listen to specific sounds and a lot more...all gathered only on one floor of the building. There is also a small enclosed space for toddlers where they can freely experiment with all kinds of materials, under supervision, for half an hour. Small kids love it. Plus, the entrance is free every first Sunday of each month.", "publishedDate": "2016-06-12", "language": "en", "rating": 4}, {"id": 372005318, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d2235343-r372005318-Museu_de_Ciencies_Naturals_de_Barcelona-Barcelona_Catalonia.html", "text": "We are a family of 5 adults and 2 children (6 and 11).  The forecast was for light rain. We went to the Aquarium, but it had a long queue,  of course, as it is in the middle of town. We decided to go back later. We took taxis to Museu Blau (also Museu de Ciencies Naturals) instead. The building is spectacular and the story of the Earth from the Big Bang to the present day is well told. The dark spaces with videos and well lit stands are dramatic. The children both got a lot from it. There were a lot of questions and interaction.  Well worth a visit on a rainy day. There were few tourists there, mainly local families and no worries about queues. The shop was closed but there were a few souvenirs at the ticket desk. There was a second exhibition about the Nature of Food, but one session was enough for the children. There didn't seem to be any catering, but we took taxis back to El Born and had bao buns in Koku Kitchen Buns!  By the time we got back to the Aquarium, the queue had gone.  Very successful day.", "publishedDate": "2016-05-11", "language": "en", "rating": 5}, {"id": 370937474, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d2235343-r370937474-Museu_de_Ciencies_Naturals_de_Barcelona-Barcelona_Catalonia.html", "text": "Not really worth visiting when you are older then 12 years.\nnice building, dark inside the museum. \n\nIf you are travelling with young children it could be a nice way of learning them a bit of history. exhibitions have sometimes a magnifier.\n\nBit far away from the touristic center of Barcelona.\n\n7€ entrance, Free with Barcelona card", "publishedDate": "2016-05-07", "language": "en", "rating": 3}, {"id": 357843469, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d2235343-r357843469-Museu_de_Ciencies_Naturals_de_Barcelona-Barcelona_Catalonia.html", "text": "The building is beautiful and the museum is quite nice, it's just a bit small compared to the best Natural History Museums there are in other major cities. Still worth a visit, everything is very well presented and well done.", "publishedDate": "2016-03-23", "language": "en", "rating": 3}, {"id": 354783968, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d2235343-r354783968-Museu_de_Ciencies_Naturals_de_Barcelona-Barcelona_Catalonia.html", "text": "Very interesting building and more interesting Art. Nice flair with great game of light and music and sounds. Everything is in Spanish, catalan and in English ", "publishedDate": "2016-03-12", "language": "en", "rating": 5}, {"id": 351839594, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d2235343-r351839594-Museu_de_Ciencies_Naturals_de_Barcelona-Barcelona_Catalonia.html", "text": "The natural science museum has a very interesting collection, including a lion and a leopard, which we don't see very often in such exhibits. Our 9 yo had a fantastic time. \nThey've set it up in such a way that the rooms are quite dark with all the lights on the animals. Very nicely done. \nAnd the building is quite unusual in shape and colour. A good place to spend a few hours. ", "publishedDate": "2016-02-29", "language": "en", "rating": 4}, {"id": 340732290, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d2235343-r340732290-Museu_de_Ciencies_Naturals_de_Barcelona-Barcelona_Catalonia.html", "text": "Nice building with combine of modern and contemporary architecture.great atmosphere inside you realy feel the aim of museum.explain about the time from bigbang untill today with visual effects minerals fossils stuffed aminals, skeletons and mechanic animals. Better for kids. If you visit on sundays after 15:00 oclock enterance is free.", "publishedDate": "2016-01-17", "language": "en", "rating": 5}, {"id": 326356218, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d2235343-r326356218-Museu_de_Ciencies_Naturals_de_Barcelona-Barcelona_Catalonia.html", "text": "Good museum with a lot of information in English. Good for children as well as adults. Would recommend ", "publishedDate": "2015-11-12", "language": "en", "rating": 5}, {"id": 321281975, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d2235343-r321281975-Museu_de_Ciencies_Naturals_de_Barcelona-Barcelona_Catalonia.html", "text": "In an awesome building there is a great museum, that \"tells\" you the story about planet earth!! So much knowledge and excellent atmosphere inside!!! Spend some time to visit!! ", "publishedDate": "2015-10-23", "language": "en", "rating": 5}, {"id": 321023716, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d2235343-r321023716-Museu_de_Ciencies_Naturals_de_Barcelona-Barcelona_Catalonia.html", "text": "This museum has several million species on exhibit and the Planet Earth display is especially wonderful.  Its excellent for kids and adults will also enjoy it.  The location is far out near the Olympic beach area but it is easily accessible by bus or metro.  ", "publishedDate": "2015-10-22", "language": "en", "rating": 5}, {"id": 319788728, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d2235343-r319788728-Museu_de_Ciencies_Naturals_de_Barcelona-Barcelona_Catalonia.html", "text": "It charted all the elements that contribute to the biosphere of life with more to see than to read. Probably not enough for a trained scientist.  All exhibits in English too. Amazing building. \nRandomly they also gave me a free yogurt when I left! ", "publishedDate": "2015-10-18", "language": "en", "rating": 5}, {"id": 319637842, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d2235343-r319637842-Museu_de_Ciencies_Naturals_de_Barcelona-Barcelona_Catalonia.html", "text": "I love visiting museums of nature and science. When I was visiting this one, it's expo was about food. It is not great of the greatest as the one in Denver, but it is nice to be visited with kids. I liked very much the architecture. On Sundays it has free entrance from 3 PM.", "publishedDate": "2015-10-17", "language": "en", "rating": 5}, {"id": 318660298, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d2235343-r318660298-Museu_de_Ciencies_Naturals_de_Barcelona-Barcelona_Catalonia.html", "text": "It is a standard nature museum. It has lots of interesting things but IMHO it lack some interactivity. \n\nLots of stuffed animals and minerals. Some videos.\n\nI loved the mechanical animals at the entrance.", "publishedDate": "2015-10-14", "language": "en", "rating": 4}, {"id": 313067255, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d2235343-r313067255-Museu_de_Ciencies_Naturals_de_Barcelona-Barcelona_Catalonia.html", "text": "The history of Earth. There are sections beging from BIG BANG till today. nice samples. free for children. for famly the tiket was 5,4 euro", "publishedDate": "2015-09-23", "language": "en", "rating": 5}, {"id": 310134657, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d2235343-r310134657-Museu_de_Ciencies_Naturals_de_Barcelona-Barcelona_Catalonia.html", "text": "What an interesting visit, also the kids liked it. There was a great collection of animals, that was the best part for me. The atmosphere of the museum was exciting with the dark walls. The outer architecture of the building was interesting (extremely modern), but the area wasn't that interesting. But that's a side issue. If you want to save a few euros, you could visit the place on sunday after three, with free entry. But in any case the entrance fee is not expensive.\n\nThe other services was not that good for my opinion. There should be more toilets and the shop was not that good as in some other museums have.", "publishedDate": "2015-09-14", "language": "en", "rating": 4}, {"id": 309566339, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d2235343-r309566339-Museu_de_Ciencies_Naturals_de_Barcelona-Barcelona_Catalonia.html", "text": "Stumbled across the museum a short walk from our hotel. Great for a rainy day, found the atmosphere very relaxing with subdued lighting and music. Kids will love the interactive sections. Reasonable entry fee, think it was about €7 per adult. City tour bus stop is across the road so easy to visit. Display descriptions are in Spanish and English.", "publishedDate": "2015-09-12", "language": "en", "rating": 4}, {"id": 304928088, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d2235343-r304928088-Museu_de_Ciencies_Naturals_de_Barcelona-Barcelona_Catalonia.html", "text": "The whole family enjoyed this trip, there is a good use of lighting and animation to create an calm and focussed atmosphere. We spent two hours here with two teenagers and was good value for money.  The hopping centre across from it offered a good choice of options for lunch and retail therapy!", "publishedDate": "2015-08-30", "language": "en", "rating": 5}, {"id": 300661767, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d2235343-r300661767-Museu_de_Ciencies_Naturals_de_Barcelona-Barcelona_Catalonia.html", "text": "The museum is located in a rather boring area focused on conference and hotels, a bit outside of the city centre. The building and facilities are very modern, but quite interesting as far as modern architecture goes. \n\nThe exhibitions themselves were nicely presented in modern and well-done exhibition halls. The content of the main exhibition is heavily focused on geology and fossils, and not so much on stuffed animals or larger skeletons, which I personally tend to find more amusing to look at. There was lots of information, but personally I enjoy looking more than reading at museums, because you can always find the texts and pictures online but you can't look at the objects in three dimensions in person. \n\nWould recommend if you have a couple of weeks to spend in Barcelona. ", "publishedDate": "2015-08-18", "language": "en", "rating": 3}, {"id": 284277076, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d2235343-r284277076-Museu_de_Ciencies_Naturals_de_Barcelona-Barcelona_Catalonia.html", "text": "A very well organised museum, with brilliant visual displays and information screens that could be translated into several languages. The information is not over-simplified for children, so there was pleny for adults to read and learn about too. I am a keen geology enthusiast I still found that I learned a lot from visiting this muesum, and some of the specimens are amazing, such as a gigantic fossilised mososaurus skeleton. The entry fee was very cheap and it was well worth visiting. Overall I thought it was the best natural history museum I have ever visited, second only to the natural history museum in London!", "publishedDate": "2015-06-30", "language": "en", "rating": 5}, {"id": 283473903, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d2235343-r283473903-Museu_de_Ciencies_Naturals_de_Barcelona-Barcelona_Catalonia.html", "text": "This must be the mother of all museums of natural sciences! Housed in a wonderful dark blue concrete building, slashed by glass panes (designed by the Basel based architects Herzog & de Moron) it is the centrepiece of the Forum area, in the western outskirts of Barcelona. Originally conceived as an exhibition hall without any specific function it is now the museum of natural sciences. As they enter and go up a monumental staircase, visitors are greeted by the skeleton of a whale hanging overhead. And the wonder continues: The museum's walls are dark which makes the exhibits and the sound and light animated presentations all the more dramatic. This is heavens for kids but equally interesting and educational for adults. The museum also organises punctual exhibitions and talks on topics related to human sciences, environment, food, health. \nAnd it's ideally situated near a pristine beach!", "publishedDate": "2015-06-27", "language": "en", "rating": 4}, {"id": 282381171, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d2235343-r282381171-Museu_de_Ciencies_Naturals_de_Barcelona-Barcelona_Catalonia.html", "text": "We loved all of it, from the explanation of dark matter to the movement-activated crab in the entrance.  As 2 PhD scientists we found the explanations simple but not condescending and  felt we had painlessly learned things outside our own fields.  We thought the displays, which included skeletons, fossils and preserved whole animals and the equipment used to investigate some areas would inspire both young and old alike.", "publishedDate": "2015-06-23", "language": "en", "rating": 5}, {"id": 269698750, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d2235343-r269698750-Museu_de_Ciencies_Naturals_de_Barcelona-Barcelona_Catalonia.html", "text": "National Museum of Natural Sciences of Catalonia, free admission on Sundays, blows your mind away with the special effects and sound to light systems really good for children, put in your dairy for a wet Sunday, a must for children and adults.", "publishedDate": "2015-05-03", "language": "en", "rating": 4}, {"id": 266663758, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d2235343-r266663758-Museu_de_Ciencies_Naturals_de_Barcelona-Barcelona_Catalonia.html", "text": "Great if you have kids. Not so much for amusement but excellent for knowledge. Takes time to explore but children will leave a little bit wiser. Dont hesitate to take kids there even if the trip is just for fun.", "publishedDate": "2015-04-19", "language": "en", "rating": 5}, {"id": 264543454, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d2235343-r264543454-Museu_de_Ciencies_Naturals_de_Barcelona-Barcelona_Catalonia.html", "text": "Very interesting architecture from outside.\nInside is a bit too dark sometimes. A very modern and rich museum mainly aiming at knowlegable adults.\n", "publishedDate": "2015-04-08", "language": "en", "rating": 4}, {"id": 262899526, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d2235343-r262899526-Museu_de_Ciencies_Naturals_de_Barcelona-Barcelona_Catalonia.html", "text": "go for it if you are in Barcelona. so historical and old museum in the centre of this wonderful city. go for it", "publishedDate": "2015-03-31", "language": "en", "rating": 4}, {"id": 261826578, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d2235343-r261826578-Museu_de_Ciencies_Naturals_de_Barcelona-Barcelona_Catalonia.html", "text": "Went there with 2 kids of 2 and 5. It was less accessible for the small one but the older one had a great time! I did as well! Great temporary exhibition about venenus animals: snake, spiders and others! I recommend on a rainy day!", "publishedDate": "2015-03-25", "language": "en", "rating": 4}, {"id": 260609999, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d2235343-r260609999-Museu_de_Ciencies_Naturals_de_Barcelona-Barcelona_Catalonia.html", "text": "The Blue Museum was definitely the highlight of our trip. The collection is very interesting. The museum is divided into sections where each one represents an era on earth. You move through the eras in increasing order of years until you reach the animals, plants, and rocks sections at the end. All sections contain these display tables with models of different entities like cells and plants with an interactive screen that you move along the models and read useful information and facts. Along the way, you also come along a few video projections playing different scientific subjects. While moving around, we stumbled by a semi-hidden section with a big round couch in the middle and speakers playing sounds of birds. We relaxed there for about 10 minutes just listening.\nIt's a really interesting and educational place that would entertain adults and kids alike. Would go there again for sure next time I'm in Barcelona.", "publishedDate": "2015-03-19", "language": "en", "rating": 5}, {"id": 247669886, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d2235343-r247669886-Museu_de_Ciencies_Naturals_de_Barcelona-Barcelona_Catalonia.html", "text": "The best part of the museum was the dangerous snakes, spiders and frogs sections. Unfortunately didn't get to see the other bits as got there too late and they had already closed that area of the museum but definitely a good natural science musem.", "publishedDate": "2015-01-05", "language": "en", "rating": 5}, {"id": 240925406, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d2235343-r240925406-Museu_de_Ciencies_Naturals_de_Barcelona-Barcelona_Catalonia.html", "text": "one of best we saw. we had well spent 3-4 hours with little break on the docks.\nthere are a lot of (old) stuffed animals and very good rock collection.\nif you like natural museums you must visit this one.\nalso, very few people was inside during our visit, so that was very nice (for us, not museum), and you can rest from all crowds Barcelona have in all tourist attractions.", "publishedDate": "2014-11-21", "language": "en", "rating": 5}, {"id": 230857643, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d2235343-r230857643-Museu_de_Ciencies_Naturals_de_Barcelona-Barcelona_Catalonia.html", "text": "The museum is not very big and not very rich. The builiding , itself, is far more interesting and beautiful.", "publishedDate": "2014-09-25", "language": "en", "rating": 3}, {"id": 222938626, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d2235343-r222938626-Museu_de_Ciencies_Naturals_de_Barcelona-Barcelona_Catalonia.html", "text": "The main exhibits are based on the development of the earth and it's geology and life. Some interesting audio-visual displays, and I liked the dark interior. Our family all enjoyed the special exhibition about the world's most poisonous creatures, 50 of them on live display. Curious that there were no exhibits from Australia.", "publishedDate": "2014-08-19", "language": "en", "rating": 3}, {"id": 222932132, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d2235343-r222932132-Museu_de_Ciencies_Naturals_de_Barcelona-Barcelona_Catalonia.html", "text": "As my son said its like going into the Millenium Falcon as you walk in underneath.  Our 5 year old was free and as he was with us it was even cheaper.  With the special exhibition it was €10 for the 3 of us.  The special exhibition was the most venimous creatures on the planet with 50 live ones. This was really good then on to the main attraction.  You meander round a route, taking you from the beginning of time, on to dinos, with lots of stuffed animals and skeletons. All captions were in English.  If you are this side of town it is well worth a visit.", "publishedDate": "2014-08-19", "language": "en", "rating": 4}, {"id": 221276935, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d2235343-r221276935-Museu_de_Ciencies_Naturals_de_Barcelona-Barcelona_Catalonia.html", "text": "This is wonderful if you're staying in the Maresme area or close to the Diagonal Mar shopping centre. It is a great natural science museum with some very interesting exhibits. Visited when there was a special exhibition on the most poisonouse animals in the world - with live exhibits. My sons were absolutely captivated. Staff wonderful. Facilities clean and welcoming. Go go go.", "publishedDate": "2014-08-12", "language": "en", "rating": 5}, {"id": 208544033, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d2235343-r208544033-Museu_de_Ciencies_Naturals_de_Barcelona-Barcelona_Catalonia.html", "text": "Huge place with interesting things for kids to learn about-from historic stones and animals to temporary exhibition.we got to snakes and amphibians display.place is huge so calculate some 2-3h there.", "publishedDate": "2014-06-02", "language": "en", "rating": 4}, {"id": 182909016, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d2235343-r182909016-Museu_de_Ciencies_Naturals_de_Barcelona-Barcelona_Catalonia.html", "text": "I had a Barcelona Card to see all the local attractions. Since this museum was next door to our hotel we decided to check it out. It is a huge structure with nothing spectacular about it. It was dark inside and two staff members in dark clothing standing by a dark wall scared us as we were walking around looking at exhibits. There was play room that looked interesting and we were booted out because it was only open on weekends not weekdays. If I had to pay for this museum I would have demanded a refund.", "publishedDate": "2013-10-30", "language": "en", "rating": 3}, {"id": 176759402, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d2235343-r176759402-Museu_de_Ciencies_Naturals_de_Barcelona-Barcelona_Catalonia.html", "text": "If you have any interest in natural sciences this place is well worth a visit. It gives extensive coverage of the evolution of animals and man with lots of hands-on displays and plenty of skeletons. We also found the sections on geology and the formation of the universe extremely well done. The exhibitions are well laid out with English language translations throughout and entrance fee is very modest.", "publishedDate": "2013-09-11", "language": "en", "rating": 5}, {"id": 175951703, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d2235343-r175951703-Museu_de_Ciencies_Naturals_de_Barcelona-Barcelona_Catalonia.html", "text": "Very reasonable entry fee and good facilities.\nEducational and particularly liked the geology exhibit.", "publishedDate": "2013-09-05", "language": "en", "rating": 5}, {"id": 174647448, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d2235343-r174647448-Museu_de_Ciencies_Naturals_de_Barcelona-Barcelona_Catalonia.html", "text": "It was definitely a pleasant surprise. The exhibitions are comprehensive interesting, with massive use of interactive flat-screen displays and projectors. There are workshops for kids too. If one is interested in natural history, this place concentrates lot's of information presented in interesting way.", "publishedDate": "2013-08-29", "language": "en", "rating": 5}, {"id": 171354156, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d2235343-r171354156-Museu_de_Ciencies_Naturals_de_Barcelona-Barcelona_Catalonia.html", "text": "My 14 year old son wanted to go and turned out good valve for 8 euros for the family. All exhibits featured an English description and found the museum very interesting with helpful staff.", "publishedDate": "2013-08-08", "language": "en", "rating": 4}, {"id": 162887055, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d2235343-r162887055-Museu_de_Ciencies_Naturals_de_Barcelona-Barcelona_Catalonia.html", "text": "Impressive building and very good exhibits. But why are science museums so often dark inside? Well laid out, although it didn't show me things I couldn't have seen at our local branch of the Natural History Museum. Still, I did learn something new about bird plumage, so worth the trip. Plenty of things to entertain small children. No cafe or shop the day we went.", "publishedDate": "2013-06-03", "language": "en", "rating": 4}, {"id": 161411365, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d2235343-r161411365-Museu_de_Ciencies_Naturals_de_Barcelona-Barcelona_Catalonia.html", "text": "I decided to check this museum out because I love natural history museums. This was the strangest one I  have ever visited but that isn't really a complaint. It is dark and kinda spooky inside . The way the exhibits are set up is more like an art exhibit than a museum. It is not not very busy since it is located quite a distance from the city center . I enjoyed my day at the museum but if you aren't a museum person maybe skip this one .", "publishedDate": "2013-05-21", "language": "en", "rating": 4}, {"id": 161196420, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d2235343-r161196420-Museu_de_Ciencies_Naturals_de_Barcelona-Barcelona_Catalonia.html", "text": "Tiny museum, lots of \"art\" used to demonstrate scientific information. Many reconstructions as opposed to the real deal in exhibits. The museum seems best suited to young children, not sure why the tourism bureau includes this in their voucher booklet... It was a bust.", "publishedDate": "2013-05-19", "language": "en", "rating": 1}, {"id": 159535266, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d2235343-r159535266-Museu_de_Ciencies_Naturals_de_Barcelona-Barcelona_Catalonia.html", "text": "This museum was only a few meters from our hotel and a perfect way to spend some time on a rainy day. it is very modern, interesting building. Entrance is only 6 Euro. If you re staying in the neighborhood and have some spare time definitely a good option for a rainy day", "publishedDate": "2013-05-03", "language": "en", "rating": 4}, {"id": 158858470, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d2235343-r158858470-Museu_de_Ciencies_Naturals_de_Barcelona-Barcelona_Catalonia.html", "text": "We were staying in a hotel across the road so thought we would check out this place. I thought when approaching the building that it was closed but it was just almost disserted and had a discrete entrance. Entry was cheap, it was informative with most descriptions also being in English  and the taxidermy displays were vast! I don't think I would travel to the area specifically to visit this place but if you are in the area then its a great way to spend a couple of hours.", "publishedDate": "2013-04-26", "language": "en", "rating": 4}, {"id": 158398450, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d2235343-r158398450-Museu_de_Ciencies_Naturals_de_Barcelona-Barcelona_Catalonia.html", "text": "Unfortunatelly the building is very dark inside and not propertlly build for a museum. So not really a great experience. ", "publishedDate": "2013-04-21", "language": "en", "rating": 2}, {"id": 158234621, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d2235343-r158234621-Museu_de_Ciencies_Naturals_de_Barcelona-Barcelona_Catalonia.html", "text": "We decided to go here when the weather was a bit gray and glad we did! The entrance fee was only 5 ? for starters and there was a lot to see, so money well spent. A lot of videos and hundreds of stuffed animals. Really nice and quiet stroll through history of earth. I can easilly recommend.", "publishedDate": "2013-04-19", "language": "en", "rating": 5}, {"id": 156985867, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d2235343-r156985867-Museu_de_Ciencies_Naturals_de_Barcelona-Barcelona_Catalonia.html", "text": "The museum is a very good value, admission was less than 6 Euros for the family.  We visited with 3 kids 6 years old and under and they did enjoy themselves, but for this age group the more they touch stuff, the more they are entertained. There are computer screens to touch, but that is about it.  There are tons of cool taxidermy animals to marvel at and some \"sparkly\" rocks that they remember.  It was a nice way to start to walk them through evolution and classification systems, but a bit over their heads.  It is not crowded, at all which makes the experience less stressful with little kids. From an adult perspective, it was interesting.  I can´t imagine they built this building only for this purpose, but as it is available, I don´t regret having gone.", "publishedDate": "2013-04-08", "language": "en", "rating": 3}, {"id": 153552921, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d2235343-r153552921-Museu_de_Ciencies_Naturals_de_Barcelona-Barcelona_Catalonia.html", "text": "I wasn't going to go to this museum but I am so glad I did. I had only an hour and wished I had of had more time. I went on Sunday evening - meaning it was free - but even when it isn't I'd say it is good value for money.\n\nThe museum steps you through the early stages of the Earth before going through the major areas of current biology (animals, fungi, plants) as well as showing rocks/minerals (which impressed because all of the chemical formulae were written on the labels). The exhibitions are in Catalan, Spanish and English.\n\nThe best bit for me was all of the animals. Yes, they might be taxidermy but it is great for kids and adults alike to exam these creates in such detail. It is 3 minutes away from El Maresme/Forum metro station. There is an outdoor play area next to the museum and the sea/beach is only around the corner. The T4 tram stops very near the museum as well.", "publishedDate": "2013-03-02", "language": "en", "rating": 5}, {"id": 150619965, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d2235343-r150619965-Museu_de_Ciencies_Naturals_de_Barcelona-Barcelona_Catalonia.html", "text": "This is a lovely little museum, tucked away from the city center (a 2-minute walk from the El Maresme/Forum metro station).\nWe spent just over 2 hours in the museum, and we were literally the only ones there, so it felt quite surreal.\nEntrance was 6 Euros per adult.\nMost of the museum's rooms are dark with only the exhibits flooded with light.\nThe museum has a permanent exhibition called \"Planet Life\" (geology and zoology of Earth, including numerous animals) and a couple of other exhibitions, as well.\nBottom line – I wouldn't go out of my way to visit the museum unless in the neighbourhood, but it's a solid choice to pass a couple of hours on a rainy day.", "publishedDate": "2013-01-25", "language": "en", "rating": 4}, {"id": 148420786, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d2235343-r148420786-Museu_de_Ciencies_Naturals_de_Barcelona-Barcelona_Catalonia.html", "text": "My wife and I came upon this quite by chance. We are living in Barcelona for three months and are slowly exploring the various visitor options and experiences. Yesterday we decided to use the tram from Vila Olimpica for the first time, an interesting trip in itself, stayed on to the end of the line but decided to return a few stops to look at the new shopping centre at Forum and the fantastic Telefónica tower. We noticed the Museu Blau, but thought it looked closed. However, on closer inspection, it was open. And what a surprise. The exhibition 'Planeta Vida' is just superb, and a must for anyone who is the slightest bit interested in geology, natural history, the environment, the history of the planet, taxonomy etc. Intelligently laid out with excellent films and commentaries, we spent an enjoyable few hours at no cost because the museum is free on Sundays from 3 o'clock and all day on the first Sunday in the month.", "publishedDate": "2012-12-31", "language": "en", "rating": 5}, {"id": 144182429, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d2235343-r144182429-Museu_de_Ciencies_Naturals_de_Barcelona-Barcelona_Catalonia.html", "text": "What to do on a rainy day? This! Really cheap and well planned museum, great for kids. Amazing playgrounds outside if it brightens up.", "publishedDate": "2012-10-31", "language": "en", "rating": 5}, {"id": 142841244, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d2235343-r142841244-Museu_de_Ciencies_Naturals_de_Barcelona-Barcelona_Catalonia.html", "text": "We went to see the relatively new 'Museu Blau' yesterday afternoon, since it's FREE every sunday between 3PM and 8 PM. We loved the 'creepy' cases with mounted animals and insects in formaldehyde. Also worth it for the big collection of precious stones.", "publishedDate": "2012-10-15", "language": "en", "rating": 5}, {"id": 138709787, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d2235343-r138709787-Museu_de_Ciencies_Naturals_de_Barcelona-Barcelona_Catalonia.html", "text": "A fantastic Natural History Museum.  It takes you on a journey from the big bang to the formation of the earth as we know it.  It is very interactive and has cool touch screens that are multi-lingual.  There are even screens that you slide over exhibits to give more detailed information.  There are cases of stuffed animals, birds and fish and they are set out to explain different types of animal behaviour.  Worth at least two visits - which is what your tickets allows you to do!", "publishedDate": "2012-08-28", "language": "en", "rating": 5}]}}]