[{"locationId": 190624, "name": "Parc Guell", "placeType": "ATTRACTION", "reviewListPage": {"reviews": [{"id": 757186159, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d190624-r757186159-Parc_Guell-Barcelona_Catalonia.html", "text": "The park itself is awesome but it doesn't change the fact that it's hard to see anything in the crowd. People are everywhere, taking pictures, touching whatever they can, stepping on your feet... Everything is fabulous but there is no way to enjoy it... It's sad. I can't imagine being here in the high season. After seeing huge queues for houses we just resigned.", "publishedDate": "2020-06-10", "language": "en", "rating": 3}, {"id": 755425534, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d190624-r755425534-Parc_Guell-Barcelona_Catalonia.html", "text": "Make sure you take a taxi to get to this part of Barcelona - steep hill, hence the great view.  Also make sure you purchase tickets as there are lines and waits for those who don't.  We really enjoyed this creation of Gaudi and leaning about how and why it was created for Eusebi Guell.  The mosaic work is incredible.  ", "publishedDate": "2020-05-25", "language": "en", "rating": 5}, {"id": 753449729, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d190624-r753449729-Parc_Guell-Barcelona_Catalonia.html", "text": "The park had some areas under renovation, the day was gray, but even so, Gaudí's works could color any cloudy day. I believe that when the works are finished, it will be much more pleasant to visit the park, a pity that we did not enjoy 100% of what it has to offer!", "publishedDate": "2020-05-11", "language": "en", "rating": 4}, {"id": 753445351, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d190624-r753445351-Parc_Guell-Barcelona_Catalonia.html", "text": "I had always thought that Parc Guell was bigger than it actually is.  It was great fun exploring and seeing all the sights, but even though it was the off season, it was crowded.  The architecture and tile work is spectacular but as crowded as it was when we were there I can't imagine how bad it is during peak season.  Plan accordingly.\n", "publishedDate": "2020-05-11", "language": "en", "rating": 4}, {"id": 753352555, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d190624-r753352555-Parc_Guell-Barcelona_Catalonia.html", "text": "Experiência sempre singular de passear nos jardins deste maravilhoso parque e suas belas obras arquitetônicas !!\n\nAlways unique experience of walking in the gardens of this wonderful park and its beautiful architectural works !!", "publishedDate": "2020-05-07", "language": "en", "rating": 5}, {"id": 753176557, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d190624-r753176557-Parc_Guell-Barcelona_Catalonia.html", "text": "Saw the free section of the park which is great along with the house but book a ticket in advance as the main area requires a ticket and we were too late", "publishedDate": "2020-05-06", "language": "en", "rating": 4}, {"id": 752796664, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d190624-r752796664-Parc_Guell-Barcelona_Catalonia.html", "text": "I'll be honest, I didn't love it. I knew that I wouldn't love the style and that's ok. My wife really enjoyed seeing the mosaics and unusual architecture. It was worth a visit and there is certainly nothing else like it.", "publishedDate": "2020-04-21", "language": "en", "rating": 4}, {"id": 752793075, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d190624-r752793075-Parc_Guell-Barcelona_Catalonia.html", "text": "A must see park in Barcelona. The colours of the mosaics in the park are a visual feast. So beautifully designed and such a pleasure visit. Amazing architecture..a tribute to Gaudi's brilliance. The view towards Sagrada  Familia cathedral from the park is panoramic.", "publishedDate": "2020-04-20", "language": "en", "rating": 5}, {"id": 752740028, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d190624-r752740028-Parc_Guell-Barcelona_Catalonia.html", "text": "The Park is in and of itself a work of Art. Its a must see in Barcelona . Buy your tickets on line before you arrive .They are at a Premium and you may not get in if you wait  .Tickets have a timed entrance so leave enough time to get there from your hotel . ", "publishedDate": "2020-04-18", "language": "en", "rating": 5}, {"id": 752738549, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d190624-r752738549-Parc_Guell-Barcelona_Catalonia.html", "text": "Do not miss.  But, our visit was crowded and lots of renovations. But, still worth the crowds. \nI will be back!\n", "publishedDate": "2020-04-18", "language": "en", "rating": 5}, {"id": 752622656, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d190624-r752622656-Parc_Guell-Barcelona_Catalonia.html", "text": "Beautiful park and gardens with stunning views, and some amazing architecture. Highly recommend visiting. ", "publishedDate": "2020-04-14", "language": "en", "rating": 4}, {"id": 752604784, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d190624-r752604784-Parc_Guell-Barcelona_Catalonia.html", "text": "The park is massive with lots of pathways which meander through the park. You just need to have the whole day and plenty of stamina to see it properly. The trees and shrubs provide a much need natural park in any city. Throughout the park there are sculptures by Gaudí that arouse and titillate your interest.", "publishedDate": "2020-04-14", "language": "en", "rating": 5}, {"id": 752461823, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d190624-r752461823-Parc_Guell-Barcelona_Catalonia.html", "text": "Amazing park which travels you in another dimension!! I easily could spend a whole day in there. Gaudi once again made his miracle. ", "publishedDate": "2020-04-10", "language": "en", "rating": 5}, {"id": 752457198, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d190624-r752457198-Parc_Guell-Barcelona_Catalonia.html", "text": "Beautiful architecture and a good place to spend a day. If you go on the top of the hill will have a great panoramic view of the city. Great!", "publishedDate": "2020-04-09", "language": "en", "rating": 5}, {"id": 752328147, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d190624-r752328147-Parc_Guell-Barcelona_Catalonia.html", "text": "The creativity expressed at this park i unlike any we have seen.  Look down and look up!  You will be amazed at how broken tiles were transformed into a work of art.   Be careful not to get lost.  We found it difficult to find the entry to the park and as we were leaving, we directed at least 10 others to the entrance.  You have an assigned time for entry so allow plenty of time to find the entrance at your assigned time.", "publishedDate": "2020-04-06", "language": "en", "rating": 5}, {"id": 752327107, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d190624-r752327107-Parc_Guell-Barcelona_Catalonia.html", "text": "It's so nice place. One of the best monuments to visit. I really like It and it's really Nice. Gaudí is one of the best artists of the world ♥️.", "publishedDate": "2020-04-06", "language": "en", "rating": 5}, {"id": 752168169, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d190624-r752168169-Parc_Guell-Barcelona_Catalonia.html", "text": "This time we didn't visit the restricted area of the park, a minor part, but, off course the most interesting. There are many beautiful parks  in great cities like London, NY, Paris or Madri, but the Parc Guell is a little show room of the fantastic world of Gaudi. ", "publishedDate": "2020-04-02", "language": "en", "rating": 5}, {"id": 751939149, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d190624-r751939149-Parc_Guell-Barcelona_Catalonia.html", "text": "A surrealist landscaped park with architectural elements of viaducts, grottoes, colonnaded hall, winding staircases, semi-closed conversation seats decorated in multicoloured ceramic fragments.  A terrace with views of the city and the sea. Casa Museu Gaudí with a garden, displays works of art, decorative objects and furniture designed by Gaudí. Open daily, 0800-2030 hours.  Metro stops Plaça de Lesseps L3 Green; AlfonsX L4 Yellow; Joanic L4 Yellow lines", "publishedDate": "2020-03-28", "language": "en", "rating": 4}, {"id": 751739562, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d190624-r751739562-Parc_Guell-Barcelona_Catalonia.html", "text": "Overall we enjoyed our visit.  The work that Gaudi did is mind blowing and amazing. The park, however, was confusing and once you leave you absolutely cannot get back in without new tickets.  There are 2 sections to this park, one you pay for and one that is free.  It's not clear and we had to ask park employees many times.  Each time we got a different answer.  Also be prepared to get some exercise, there are tons of stairs and ramps.  ", "publishedDate": "2020-03-24", "language": "en", "rating": 3}, {"id": 751624364, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d190624-r751624364-Parc_Guell-Barcelona_Catalonia.html", "text": "I love this park. If you can get here early and beat the queues it’s a beautiful place to sit or to wander around. Some amazing architecture and it truly captures everything Gaudi. If you have more than a day in Barca then this place is a must after some of the other things. ", "publishedDate": "2020-03-22", "language": "en", "rating": 5}, {"id": 751394297, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d190624-r751394297-Parc_Guell-Barcelona_Catalonia.html", "text": "This is why I travel . . . to experience this type of history and art/architecture in person. It’s definitely worth a stop. ", "publishedDate": "2020-03-19", "language": "en", "rating": 5}, {"id": 751289152, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d190624-r751289152-Parc_Guell-Barcelona_Catalonia.html", "text": "A lovely place with a marwellous viev over Barcelona. Nice houses, history and colours all over the place. Gardens and historic messages all over. \nTake a walk up here if you have good condition :) \nDont forget to bring a termos of coffee and some sandwiches ( Swedish fika) :-)", "publishedDate": "2020-03-18", "language": "en", "rating": 5}, {"id": 751215185, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d190624-r751215185-Parc_Guell-Barcelona_Catalonia.html", "text": "This is a little hike to get up, it’s worth the time. On the way you see all his creations, once you are up can see the city very well", "publishedDate": "2020-03-17", "language": "en", "rating": 4}, {"id": 751149690, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d190624-r751149690-Parc_Guell-Barcelona_Catalonia.html", "text": "Visited on my mums surprise birthday trip as somewhere she had always wanted to go (I had visited previously) was still such an amazing visit and worth paying the entrance fee into as this is the best part of the park in my opinion. ", "publishedDate": "2020-03-16", "language": "en", "rating": 5}, {"id": 751122195, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d190624-r751122195-Parc_Guell-Barcelona_Catalonia.html", "text": "Architecture is just sublime.  Lovely place to spend a few hours. All sort of interesting things to look at.", "publishedDate": "2020-03-16", "language": "en", "rating": 5}, {"id": 751097407, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d190624-r751097407-Parc_Guell-Barcelona_Catalonia.html", "text": "Visited the park as a part of a hop on and hop off his visit - but of a walk from the drop off point but glad we did. Lovely park with amazing sights and sounds - wild parrots too. Some of the areas were closed due to work being Carried out but we still had a great time ", "publishedDate": "2020-03-16", "language": "en", "rating": 4}, {"id": 751011650, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d190624-r751011650-Parc_Guell-Barcelona_Catalonia.html", "text": "We visited here on a Barcelona panoramic tour, and I had no idea this place even existed. What a tremendous find. It's worth taking a guided tour here to learn the fascinating history and to learn about meanings behind the beautiful elements of the park. Plus admission is limited for crowd control and a tour will ensure you can get in.", "publishedDate": "2020-03-15", "language": "en", "rating": 5}, {"id": 750880375, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d190624-r750880375-Parc_Guell-Barcelona_Catalonia.html", "text": "Enter before 8:30am to avoid charge. Interesting space given history. Impressive structure, Very visionary. We were there before it opened, realizing we didn’t need our tickets (purchased online). ", "publishedDate": "2020-03-14", "language": "en", "rating": 4}, {"id": 750879094, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d190624-r750879094-Parc_Guell-Barcelona_Catalonia.html", "text": "Great park that you can enter for free. Lovely for a family to explore. Take a picnic. Quite a steep approach  (one way is steps and the worse, other is slope ) and then have an elevated view of city, but really well kept and worth the visit. There are additional attractions to see once inside for extra fee - one you can get as an addition when paying for Sagrada and would advise paying couple euros extra at this point.  No food and drink, able to be purchased inside so take a bottle of water and loos not great fun but okay. Lovely cafe near one entrance - not main - which was lovely and reasonably priced, sit inside or out on balcony or down on terrace.\nReally worth a visit", "publishedDate": "2020-03-14", "language": "en", "rating": 4}, {"id": 750871395, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d190624-r750871395-Parc_Guell-Barcelona_Catalonia.html", "text": "We purchased tickets online, rode the HopOnHopOff bus to the Parc Güell stop, used google maps to find the way up to the park entrance ( about a 10 minute walk) then started  wandering around the beautiful park. It’s free to enter but you must have tickets to visit the Monument Zone. The ticket booth is right at the entrance. There were musicians playing in the hills, artisans selling wares around the paths and plenty of benches to sit at and see downtown Barcelona. Our tickets were for 1:30 but because of the Coronavirus, there were no crowds and we entered the paid area at noon. We were given a map of the Zone and really loved all of Gaudis work here. Very peaceful throughout the park but a security guard said this is not the norm.", "publishedDate": "2020-03-14", "language": "en", "rating": 5}, {"id": 750769290, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d190624-r750769290-Parc_Guell-Barcelona_Catalonia.html", "text": "Must see. Reserve tickets online. Map is a little confusing but the garden is wonderful with a great view to the town ", "publishedDate": "2020-03-13", "language": "en", "rating": 4}, {"id": 750734109, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d190624-r750734109-Parc_Guell-Barcelona_Catalonia.html", "text": "There is a lot to see in the park. The free areas have nice gardens, walkways, arcades and aquaducts. The pay areas have Gaudi's fanciful designs that make it look like a fairy wonderland. It's nice to come in  the morning when it is less crowded to be able to appreciate the place at leisure.", "publishedDate": "2020-03-13", "language": "en", "rating": 4}, {"id": 750639012, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d190624-r750639012-Parc_Guell-Barcelona_Catalonia.html", "text": "Parc Güell isn't just a normal public park, but it's also a World Heritage Site. This is a park which reflects the abundance and the playful side of Gaudi's genius by integrating architecture into nature. Parc Güell is located at the North East side of Barcelona, it has 42 acres and 95% of the park is free of charge. It opens 7 days a week and it has more than 9 million visitors each year. \nWe wanted to visit the Monumental Zone (which is free before 8 am), we couldn't get up too early but we still managed to arrive at 9:30 am on a weekday in order to avoid the crowds. The top attractions inside the Monumental zone are such as the i) Collonaded Pathway, ii) the Viaducts, iii) the Multicoloured Mosaic Salamander, iv) the 2 fairy-tale pavilions at the entrance, v) the Bird Nests on the terrace walls, vii) the Gaudi's museum (which used to be Gaudi's house), viii) all of his mosaic works and ix) the curved benches/ walls...etc. The free access area was equally beautiful too, although we didn't have too much time to stroll around.\nWe booked the tickets in advance and the ticket price includes the free shuttle bus from Alfons X station to the park (and returned). The journey took about 12 minutes and it cost 10 Euros per ticket.\nTo be honest, I was a bit disappointed if I compared Parc Güell to Sagrada Familia and Casa Batllo. This was not because I didn't like the park as I thought most of the sections inside the Monumental zone were fun & interesting, but I was just disappointed that a lot of the grounds were just filled with sands with very low maintenance. (i.e. in the main square, except for its mosaic benches, it was just an empty space with sands on the floor.) \nHowever, it's still a place that I would recommend you to visit when you're in Barcelona. ", "publishedDate": "2020-03-12", "language": "en", "rating": 4}, {"id": 750511044, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d190624-r750511044-Parc_Guell-Barcelona_Catalonia.html", "text": "This was slightly disappointing as it was partial under construction when I went here. It is a nice park I don't feel like I got much from my admission!", "publishedDate": "2020-03-11", "language": "en", "rating": 3}, {"id": 750509903, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d190624-r750509903-Parc_Guell-Barcelona_Catalonia.html", "text": "Not easy to get up to the park but it was worth it to see the art and the views.  Too many vendors selling their small trinkets but among them were also a few true artists.", "publishedDate": "2020-03-11", "language": "en", "rating": 4}, {"id": 750490200, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d190624-r750490200-Parc_Guell-Barcelona_Catalonia.html", "text": "A very nice park to visit , especially if you have children so they can enjoy themselves running, chasing pigeons, feeding little green parrots and just having fun .", "publishedDate": "2020-03-11", "language": "en", "rating": 4}, {"id": 750445059, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d190624-r750445059-Parc_Guell-Barcelona_Catalonia.html", "text": "We spent an entire morning walking through the park. Make sure you buy tickets in advance to get on the terrace with the pretty benches!", "publishedDate": "2020-03-11", "language": "en", "rating": 5}, {"id": 750422221, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d190624-r750422221-Parc_Guell-Barcelona_Catalonia.html", "text": "Amazing place to visit and enjoy Gaudi’s work! \nDefinitely buy tickets in advance or go before oficial opening, for free with less people in your shots ❤️", "publishedDate": "2020-03-11", "language": "en", "rating": 5}, {"id": 750380574, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d190624-r750380574-Parc_Guell-Barcelona_Catalonia.html", "text": "Sadly accessibility is limited due to the number of steps  but an amazing place. This man truly had a vision.", "publishedDate": "2020-03-10", "language": "en", "rating": 4}, {"id": 750292182, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d190624-r750292182-Parc_Guell-Barcelona_Catalonia.html", "text": "Park Guell is a public park designed by Antoni Guadi (the same architect who designed La Sagrada Familia). While most of the park is free to visit, there is a pay-to-visit section (€10 fee) to aid its restoration. Being located in a steep hill, the park offers fantastic views of the city. Guadi has used stones and ceramics to create interesting sculptures and mosaics. Locals visit here for hiking or dog-walking. Try visiting during evening to catch a sunset, or during opening hours to beat the crowds. There is a Gaudi museum (€5 fee) near the entrance. Away from the hustle and bustle of the city, this park is a peaceful place to visit when its not crowded.", "publishedDate": "2020-03-10", "language": "en", "rating": 4}, {"id": 750218243, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d190624-r750218243-Parc_Guell-Barcelona_Catalonia.html", "text": "A must see experience when in Barcelona. The park grounds are lovely but you have to pay to enter various parts which was slightly disappointing because parts of these areas were under renovation. Gaudí s imagination was unbelievable and the workmanship is second to none. Great views of the city too!", "publishedDate": "2020-03-10", "language": "en", "rating": 4}, {"id": 750152421, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d190624-r750152421-Parc_Guell-Barcelona_Catalonia.html", "text": "It's worth getting to Parc Guell early as it gets busy. It takes about 45 minutes to walk there from the Sagrada famillia or use the hope on off buses. It was easy to pay when you get there. Although you can view some of the park for free it is worth paying the €10 to get into the main   parts.", "publishedDate": "2020-03-09", "language": "en", "rating": 4}, {"id": 750150608, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d190624-r750150608-Parc_Guell-Barcelona_Catalonia.html", "text": "The architecture is cool, I mean it's Gaudi. Not much exciting compared to other sites, and the only source of information is from the map you are given at the start. Then you walk around a perimeter of the place.", "publishedDate": "2020-03-09", "language": "en", "rating": 3}, {"id": 750136139, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d190624-r750136139-Parc_Guell-Barcelona_Catalonia.html", "text": "We missed this last time we were visiting Barcelona so it is a nice place to visit. Quirky! Busy place with other tourists. We took a little bus which runs regularly up and down the steep incline.", "publishedDate": "2020-03-09", "language": "en", "rating": 4}, {"id": 750105087, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d190624-r750105087-Parc_Guell-Barcelona_Catalonia.html", "text": "I came here a few years ago and it was free. It was a lovely walk to have and there were beautiful parks to wander. Now you have to pay €10 just to walk around. It's a rip off. I will admit it is beautiful, but think €10 is too much, a donation of €2-3 should be enough to wall around here.\nTwo stars, just because it is beautiful, if not there would only be one.", "publishedDate": "2020-03-09", "language": "en", "rating": 2}, {"id": 750097122, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d190624-r750097122-Parc_Guell-Barcelona_Catalonia.html", "text": "Ok I was not impressed think we came up the wrong way very steep lots of steps . Nearly killed me off it was exhausting. Good views", "publishedDate": "2020-03-09", "language": "en", "rating": 3}, {"id": 750048249, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d190624-r750048249-Parc_Guell-Barcelona_Catalonia.html", "text": "Visited whilst in Barcelona with my daughter for a long weekend, caught hop on hop off bus to nearest stop.  Didn't find it was signposted very well from bus stop or even in the parc itself.  Fantastic buildings and views but not my favourite in the city", "publishedDate": "2020-03-09", "language": "en", "rating": 4}, {"id": 750031422, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d190624-r750031422-Parc_Guell-Barcelona_Catalonia.html", "text": "It is a fantastic place. Wander around at your own pace. Soak it all up. \n\nI’d advise buying your ticket online to avoid the queues. \n\nA great view over the city too. ", "publishedDate": "2020-03-09", "language": "en", "rating": 5}, {"id": 749944242, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d190624-r749944242-Parc_Guell-Barcelona_Catalonia.html", "text": "100% recommend. Don’t let anyone fool you, we easily spent 3 hours here. They even have a food court where you can grab lunch, a beer, coffee, Icecream.\nAbsolutely wonderful Park. Lots of hiking if you explore the free areas\nSo come prepared!", "publishedDate": "2020-03-08", "language": "en", "rating": 5}, {"id": 749931312, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d190624-r749931312-Parc_Guell-Barcelona_Catalonia.html", "text": "After seeing pictures online and other reviews we expected alot more from this. Main park area was free to visit which we didn't know and only paid the fee to enter the sort of main circle to take a photo of the famous view which was soo busy and covered in scaffolding in that area so didn't even get the chance for the photos etc  very very poor. Walked around for 20/30 mins and left disappointed. ", "publishedDate": "2020-03-08", "language": "en", "rating": 2}, {"id": 749858433, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d190624-r749858433-Parc_Guell-Barcelona_Catalonia.html", "text": "While we didn’t have enough time to go where all the colorful artwork is, walking around the remaining area was lovely. While being serenaded by all the birds, we enjoyed and admired Guadi’s creative expressions. ", "publishedDate": "2020-03-08", "language": "en", "rating": 5}, {"id": 749827375, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d190624-r749827375-Parc_Guell-Barcelona_Catalonia.html", "text": "Such a great spot! Some beautiful structures and absolutely stunning views of the city. We didn't go into the paid bit but had a wonder round and it's totally worth a visit!", "publishedDate": "2020-03-08", "language": "en", "rating": 5}, {"id": 749797295, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d190624-r749797295-Parc_Guell-Barcelona_Catalonia.html", "text": "The tour is nice, nice park with a beautiful panorama of the city, but I imagined it bigger and more spectacular as even for the price paid 10 €.\nPart of the \"paying zone\" is under construction at the moment, therefore visual values slightly diminished", "publishedDate": "2020-03-07", "language": "en", "rating": 3}, {"id": 749744547, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d190624-r749744547-Parc_Guell-Barcelona_Catalonia.html", "text": "Very interesting park to while away an afternoon. Excellent walk and most of it is free entry so excellent value. Great views of the city from here ", "publishedDate": "2020-03-07", "language": "en", "rating": 5}, {"id": 749744386, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d190624-r749744386-Parc_Guell-Barcelona_Catalonia.html", "text": "Really enjoyed the visit to Parc Guell. Gaudi’s monumental zone is a must see attraction. Wonderful architecture. Wandered around for an hour or so. ", "publishedDate": "2020-03-07", "language": "en", "rating": 5}, {"id": 749693967, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d190624-r749693967-Parc_Guell-Barcelona_Catalonia.html", "text": "My review is for the park only. Plenty of plants variety and beautiful surrounding. You have to wear confortable shoe's since you have to walk a lot. If you reach the Mirador terrace you can see all the Barcelona surrounding. Nice place for kids and families. ", "publishedDate": "2020-03-07", "language": "en", "rating": 5}, {"id": 749666259, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d190624-r749666259-Parc_Guell-Barcelona_Catalonia.html", "text": "You could probably spend a whole day there! Plenty of walking paths and breathtaking views over the city! Plus Gaudí’s work! Will be back when visiting Barcelona again!", "publishedDate": "2020-03-07", "language": "en", "rating": 5}, {"id": 749579934, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d190624-r749579934-Parc_Guell-Barcelona_Catalonia.html", "text": "Dont pay. It is just a crap encirclement, you cant see anything until you end up paying for each separate entrance up to 50 EUR. Only to find the real charm is above the fenced enclosure in the greenery above. Really adds to Barcelonas tourist trap, tourist thieving image. Why do people travel here. My worst visit to a European city ever. They are all in on it. recommend this place. Please .One lizard on the all those photos for a 12 ticker for a park worthy the space of someones back garden,., Shame on you city of barcelona. If you dont want tourists, limit th e numbers, dont fleece them.\n\n", "publishedDate": "2020-03-06", "language": "en", "rating": 1}, {"id": 749430655, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d190624-r749430655-Parc_Guell-Barcelona_Catalonia.html", "text": "Our  visit was fairly short as it was part of a P&O here excursion but the sun was shining and the park looked lovely even though it was February so the flowers and trees were still not in bloom.Our visit was mainly to see the Gaudi architecture and features which although not as many as you might expect are still amazing.His work is simply so unique and personal.\nIf you have plenty of time I would imagine walking around the park itself would be very enjoyable and interesting. Gaudi’s  work of blending in with nature is so eye catching.\nOne day we hope to spend a few days in this city rather than one off cruise days( this was a third such) as there is so much to see and enjoy.", "publishedDate": "2020-03-05", "language": "en", "rating": 5}, {"id": 749311464, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d190624-r749311464-Parc_Guell-Barcelona_Catalonia.html", "text": "It is a little hard to find and get to if you're walking, it is a beautiful park, interesting, shady, lots of walking there, too.  Bring water.", "publishedDate": "2020-03-05", "language": "en", "rating": 3}, {"id": 749304789, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d190624-r749304789-Parc_Guell-Barcelona_Catalonia.html", "text": "Not an easy place to find or get too but nice when you get there. Not the best place I visited in Barcelona but still glad I did", "publishedDate": "2020-03-05", "language": "en", "rating": 3}, {"id": 749291798, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d190624-r749291798-Parc_Guell-Barcelona_Catalonia.html", "text": "Not very well signposted for the hop on hop off bus.  The exit of the park really should have been the entrance.  The whole park and tickets signposting is a bit lacking and there is a silly one way system.  It is really quite beautiful but could do with better signposting and possibly friendly staff in the cafe.", "publishedDate": "2020-03-05", "language": "en", "rating": 3}, {"id": 749268955, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d190624-r749268955-Parc_Guell-Barcelona_Catalonia.html", "text": "Gaudi was hired to create this wonderful park after a high-end housing development failed in the same location.  WELL . . . believing that NATURE is the master architect of design, THIS location has something for everyone to marvel at . . . because nothing is common, straight or vague.  Every design element is creative and fun.  All ages will love this . .  but use a tour guide to help understand all the environmental elements put into place decades ago.  ", "publishedDate": "2020-03-05", "language": "en", "rating": 5}, {"id": 749132006, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d190624-r749132006-Parc_Guell-Barcelona_Catalonia.html", "text": "We visited Parc Guell with a private guide.  Walking around on our own would have been meaningless.  Understanding the connection between the landscaping, engineering and architecture really brought the project to light.  It allowed us to see the other Gaudi projects in a different light.", "publishedDate": "2020-03-04", "language": "en", "rating": 5}, {"id": 748896736, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d190624-r748896736-Parc_Guell-Barcelona_Catalonia.html", "text": "I never got the bar code on our tickets from the trip advisor bookings -the agency was closed and had been closed for 6 months -the  entrance  would not take my paperwork without a bar code -\nI got An email later that day  from the agency but never checked my email -all other trip tickets come  off my trip advisor bookings  area -now I know to always check for the bar code on the tickets under bookings -if you do not have a barcode then check the day of your event under your emails -disappointed!!   Agency down not exist on the address on my paperwork -which was around the corner from park guell-very disappointed and willl not pay my cc-", "publishedDate": "2020-03-03", "language": "en", "rating": 1}, {"id": 748889195, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d190624-r748889195-Parc_Guell-Barcelona_Catalonia.html", "text": "We had a beautiful day in the park.  Music, people and the views.  Loved every moment.  We took lots of pictures, and leisurely took our time to walk through the park.  I think there were too many vendors selling stuff, but other than that, it was a really great day and we were so happy we went to the park.", "publishedDate": "2020-03-03", "language": "en", "rating": 5}, {"id": 748753506, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d190624-r748753506-Parc_Guell-Barcelona_Catalonia.html", "text": "Beautiful park with so many twists and twists that have absolutely amazing view points. A great place to relax or a place to have a nice long hike.", "publishedDate": "2020-03-02", "language": "en", "rating": 5}, {"id": 748748054, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d190624-r748748054-Parc_Guell-Barcelona_Catalonia.html", "text": "We visited the park in a tour and were amazed by all of the little details and fine craftsmanship. Definitely worth a visit! ", "publishedDate": "2020-03-02", "language": "en", "rating": 5}, {"id": 748740097, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d190624-r748740097-Parc_Guell-Barcelona_Catalonia.html", "text": "We were a bit put off by the lines and reading that you need to buy tickets in advance.  But then discovered that the majority of the park is free entrance - people are only paying to go inside the Gaudi buildings. We had a lovely afternoon walking the trails and enjoying the views.  Don't think we missed anything by not paying the entry fee and going with the crowds!", "publishedDate": "2020-03-02", "language": "en", "rating": 4}, {"id": 748651978, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d190624-r748651978-Parc_Guell-Barcelona_Catalonia.html", "text": "The parc is beautiful but It is very hard to understand where to buy tickets and the staff has been very rude every time we asked a question about the place and the touristic path to follow. ", "publishedDate": "2020-03-02", "language": "en", "rating": 2}, {"id": 748629150, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d190624-r748629150-Parc_Guell-Barcelona_Catalonia.html", "text": "We pre booked skip the line tickets, when we arrived we was told entrance to the park is free, our tickets were so we could get close up to Gaudi’s work, you have to queue up for this at a designated time and you get 30 minutes to look around, not our sort of thing really so we didn’t bother, waste of €20 but our own fault really for not doing our research, if you like Gaudi and want to look at his stuff then pay the money, otherwise just stroll round the park for free, the walk ways in the park are very dusty so take old footwear.", "publishedDate": "2020-03-01", "language": "en", "rating": 3}, {"id": 748527281, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d190624-r748527281-Parc_Guell-Barcelona_Catalonia.html", "text": "Paid area is very limited and not worth the money you have to pay and the queue you have to stand waiting ", "publishedDate": "2020-03-01", "language": "en", "rating": 3}, {"id": 748469651, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d190624-r748469651-Parc_Guell-Barcelona_Catalonia.html", "text": "Beautiful mosaic and enjoyable walk. Must go into the restricted area where you pay. It is worth it.", "publishedDate": "2020-03-01", "language": "en", "rating": 4}, {"id": 748343082, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d190624-r748343082-Parc_Guell-Barcelona_Catalonia.html", "text": "To see Gaudi dream of a residential place, come here. Unfortunately it didn’t translate into his vision. The park surrounding PArc Guell is nice and spacious. Pace guell itself is ok average.  For 10 euros, don’t see much just open rooftop square to look at his 2 buildings. The garden has paved walkways with birds chirping. His iconic stairways is decorated with lizard dragon like animals and turtle. A lot of the parc is under construction. It pack with people so don’t get much of a nice shot but you can sit Along the curvy bench to sit and relax. ", "publishedDate": "2020-02-29", "language": "en", "rating": 3}, {"id": 748334934, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d190624-r748334934-Parc_Guell-Barcelona_Catalonia.html", "text": "If you are visiting Barcelona for some days , you have to visit this park . There you can see all the Barcelona from the highest point .... it’s unbelievable emotion and expressions for all your life :))", "publishedDate": "2020-02-29", "language": "en", "rating": 5}, {"id": 748318414, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d190624-r748318414-Parc_Guell-Barcelona_Catalonia.html", "text": "The majority of this park is free, but you must pay to get in to see the architecture built by Gaudi. The buildings and facades are out totally unique, but I was expecting a bit more for my money. \nIf you buy your ticket in advance you can get the free bus (provided by the park) from Alfons X Metro station, Yellow Line 4 ", "publishedDate": "2020-02-29", "language": "en", "rating": 4}, {"id": 748175681, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d190624-r748175681-Parc_Guell-Barcelona_Catalonia.html", "text": "Highly recommend a walk through this park and admire the views over Barcelona, it really fills your hart with joy", "publishedDate": "2020-02-28", "language": "en", "rating": 5}, {"id": 748119813, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d190624-r748119813-Parc_Guell-Barcelona_Catalonia.html", "text": "Walk in the nature, get the top of the mountain and then go down to Parc Guell to see the most colourful building walls you have ever seen, as well as an outstanding view of the place!!!", "publishedDate": "2020-02-28", "language": "en", "rating": 5}, {"id": 748084897, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d190624-r748084897-Parc_Guell-Barcelona_Catalonia.html", "text": "That’s a beautiful place but 90% of the parc is free and we paid 10€ for the 10 other percent which was too expensive for the prestation", "publishedDate": "2020-02-28", "language": "en", "rating": 4}, {"id": 748062195, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d190624-r748062195-Parc_Guell-Barcelona_Catalonia.html", "text": "We went on the hop on bus tour and decided to stop and see this. Quite a walk uphill to the park, and then found no tickets available to get in to the main part. Ok to walk round the gardens and see the mosaics on the outer walls. \nGet tickets in advance. \n", "publishedDate": "2020-02-27", "language": "en", "rating": 3}, {"id": 748054191, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d190624-r748054191-Parc_Guell-Barcelona_Catalonia.html", "text": "I walked up to Parc Guell to show friends the amazing sights and views. It is still a must when visiting Barcelona and you can still get free access to most of the parc. Alas the terrace and staircase etc are now restricted and you need a timed ticket to access.\nParc Guell is a terraced ‘garden’ high above Barcelona with amazing views of the city and with walkways and buildings and ornaments designed by Gaudí. Always my favourite place in Barcelona ", "publishedDate": "2020-02-27", "language": "en", "rating": 4}, {"id": 748008237, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d190624-r748008237-Parc_Guell-Barcelona_Catalonia.html", "text": "It is certainly an interesting place but it felt very busy, even in February and we gave up on the queue to get in the gatekeepers house. Some of the staff were quite rude and it isn’t the easiest place to find your way around, especially outside.", "publishedDate": "2020-02-27", "language": "en", "rating": 4}, {"id": 747898367, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d190624-r747898367-Parc_Guell-Barcelona_Catalonia.html", "text": "We had a Gaudi day during our city break and visited the Parc mid afternoon on a glorious sunny day, fantastic views and architecture.\nThoroughly recommend", "publishedDate": "2020-02-27", "language": "en", "rating": 5}, {"id": 747845740, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d190624-r747845740-Parc_Guell-Barcelona_Catalonia.html", "text": "Park Guell is one of the key attractions in Barcelona and part of famous Architect Gaudi's work. You can spend 2-3 hours there. Ensure that you know how to get there. We had a long walk from the nearest MRT station. Beware of pick pockets. \nOne key thing to note is that the entrance tickets can be bought only at the main entrance. If you enter from another entrance you will have to go back to the main entrance to buy tickets.", "publishedDate": "2020-02-26", "language": "en", "rating": 4}, {"id": 747745213, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d190624-r747745213-Parc_Guell-Barcelona_Catalonia.html", "text": "We went on a lovely sunny day in Feb so it was very pleasant to walk around.  We stopped a local walking her dog and asked if she thought it was worth paying to visit the parts that were not free access.  She said if you visit before 8am everything is free so that is worth noting if your an early riser.  I imagine its very hot in the summer so might be a good time for a look around anyway.  We walked up the paths as high as you could go and then saw a rough track to a very high point (bit of a scramble as not an official part of the park) but the views of Barcelona were amazing - completely panoramic from all sides so for us was the best bit.  The queues for the paid part of the park were crazy and this was low season so I dread to think what they would be like in high.  For us we do not think it would have been worth paying.", "publishedDate": "2020-02-26", "language": "en", "rating": 3}, {"id": 747588028, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d190624-r747588028-Parc_Guell-Barcelona_Catalonia.html", "text": "This place is good for a few quick pictures, but the crowds and vendors really make your time Hellish.  The Guadi house (really a simple museum) is there, but requires an additional payment.", "publishedDate": "2020-02-25", "language": "en", "rating": 3}, {"id": 747566355, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d190624-r747566355-Parc_Guell-Barcelona_Catalonia.html", "text": "So we came here because people said we should and it seems like its a must when in Barcelona.  It's rather cheap, 10 euros per person but overall it was just ok.  It was under construction when we were there but I don't think that would really make a difference.  Yes, there are some of the most instagramble pictures in all of Barcelona but no one in our family of 4 were really impressed.  Would I recomment? yes, you have to see if for yourself.  Would I go back? no.", "publishedDate": "2020-02-25", "language": "en", "rating": 3}, {"id": 747436336, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d190624-r747436336-Parc_Guell-Barcelona_Catalonia.html", "text": "It took us a short bus trip (using the local tourist bus) and lucky us, coz it was a challenging hike up to Parc Guell.  Not advisable for the elderly as it is a steep hill. The walk up gave a local homely view as you walk among the local houses. \n\nAs soon as you reach the entrance, the atmosphere changed to a buzz. Heavily crowded, but comfortable. Queue to get the tickets were done at the automated machine, and there were guides there to assist in buying the tickets. Process was swift.\n\nParc Guell is a huge place, so after the long climb up the steep hill , the area itself can only be covered in more than 2 hours. It is vast so take your time walking through the tunnels, take pictures, and there are beautiful sounds played by musicians in the tunnels. Do not miss them!\n\nI dont remember seeing any cafes, or places to stop and have a drink there, so ensure to bring your own drinks . I also didnt see any souvenir shops so take as many photos while you can.\n\nThe famous spot to take a picture of Barcelona from the colourful benches are extremely difficult to take with only you in it, hahah.. so dont put your hopes up too high. You will end up with someone else in the picture, too, most likely. \n\nOverall, Parc Guell is not to be missed.", "publishedDate": "2020-02-24", "language": "en", "rating": 5}, {"id": 747389218, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d190624-r747389218-Parc_Guell-Barcelona_Catalonia.html", "text": "Striking works of art. Out of this world cool. But some was under construction. Should provide discounted tickets for this reason as it was an eye sore still an awesome sight. ", "publishedDate": "2020-02-24", "language": "en", "rating": 4}, {"id": 747337695, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d190624-r747337695-Parc_Guell-Barcelona_Catalonia.html", "text": "Parc guel was created in 1900, is the most beautiful parc I have seen. Fantastic architecture in a whimsical theme", "publishedDate": "2020-02-24", "language": "en", "rating": 5}, {"id": 747309708, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d190624-r747309708-Parc_Guell-Barcelona_Catalonia.html", "text": "Is a nice place to visit when you visit Barcelona. I really had a good time there. Easy to get there with tram and metro bus", "publishedDate": "2020-02-24", "language": "en", "rating": 4}, {"id": 747286044, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d190624-r747286044-Parc_Guell-Barcelona_Catalonia.html", "text": "Very nice and beautiful park that has everything that a great park should: various landscapes, beautiful routs, trees and flowers, Gaudi buildings!!! \n\nMust see", "publishedDate": "2020-02-24", "language": "en", "rating": 5}, {"id": 747277943, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d190624-r747277943-Parc_Guell-Barcelona_Catalonia.html", "text": "Visited and paid €10 for entry into the restricted part. Bit pointless as there is nothing more in there that you can see or do from the outside. All buildings are visible from the outside. The only difference is that the restricted part has a cafe. If you visit, take a pic then leave. Overpriced for what its worth. ", "publishedDate": "2020-02-24", "language": "en", "rating": 2}, {"id": 747129985, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d190624-r747129985-Parc_Guell-Barcelona_Catalonia.html", "text": "Very interesting place and unfortunately since we were on a tour, we only had an hour but I could see spending a couple hours here. The views of the city from the upper terrace were beautiful. Plenty of construction going on so that did detract a little from the beauty. Also it is a trek away from the other main attractions. Just like typical Gaudi, the outside was ausentatious but the inside was simple. Pack some food and drink and enjoy sitting on the terrace and enjoy!", "publishedDate": "2020-02-23", "language": "en", "rating": 4}, {"id": 747110611, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d190624-r747110611-Parc_Guell-Barcelona_Catalonia.html", "text": "Make sure you book in advance of visiting otherwise you will not be able to access the main areas.\nThere is a public park which is free of charge but to visit the attractions you have to book and pay.  Admission is on a timed basis so book early.\nDirections on how to get there are not clear and if you do not get this right it is a long hard walk up hill and steps.  And once at the top directions are not clear.  \nI was disappointed we did not get to see all the attractions in the park due to fully booked", "publishedDate": "2020-02-23", "language": "en", "rating": 2}, {"id": 747086553, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d190624-r747086553-Parc_Guell-Barcelona_Catalonia.html", "text": "Don’t buy tickets for restricted area. Every Gaudi creation is perfectly visible from the free area of the park. Selfie on the famous bench is not worth it.", "publishedDate": "2020-02-23", "language": "en", "rating": 3}, {"id": 747054699, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d190624-r747054699-Parc_Guell-Barcelona_Catalonia.html", "text": "Absolutely stunning. I overheard one teen say “I’d seen it in pictures but it is so much better in real life.” It really is! Walk up to the top of the park fur fabulous views across the city it the sea.", "publishedDate": "2020-02-23", "language": "en", "rating": 5}, {"id": 746974192, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d190624-r746974192-Parc_Guell-Barcelona_Catalonia.html", "text": "Most part been renovated. Same amount of visitors allowed so packed. Not enjoyable. However the free section was nice to visit. Wait until renovations are over", "publishedDate": "2020-02-23", "language": "en", "rating": 2}, {"id": 746915935, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d190624-r746915935-Parc_Guell-Barcelona_Catalonia.html", "text": "We went without doing research and we were tired. Lots of steps and walking - should have saved it until we knew what to look for and were more rested. Beautiful park but we didn’t get inside home etc which we would recommend. So much thought put into all the designing.For someone who loves rocks this was a treat!", "publishedDate": "2020-02-23", "language": "en", "rating": 4}, {"id": 746897730, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d190624-r746897730-Parc_Guell-Barcelona_Catalonia.html", "text": "We went here after visiting the other Gaudi buildings, so did not really appreciate the park after being dazzled earlier. If you intend to spend a day visiting Parc Guell and Sagrada Familia, suggest visiting the park in the morning and then walking downhill through the local neighbourhoods to the cathedral.", "publishedDate": "2020-02-23", "language": "en", "rating": 4}]}}]