[{"locationId": 190623, "name": "MACBA Museu d'Art Contemporani de Barcelona", "placeType": "ATTRACTION", "reviewListPage": {"reviews": [{"id": 751283784, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d190623-r751283784-MACBA_Museu_d_Art_Contemporani_de_Barcelona-Barcelona_Catalonia.html", "text": "A well curated collection showing local artist views through different key point in history (from WWW to now). It is interesting to see how artists express their feelings about common topics like love, war, pain, life.. in a very different ways from normal people like me (with no artistic tendency :D). On the day i visited, the museum had some art event for kids on the first floor, lucky me to have a chance to see all the budding artists express themselves through drawing. Overall, a relaxing and self exploration stroll in a well designed modern building. Recommend if you have time and want to try something different.", "publishedDate": "2020-03-18", "language": "en", "rating": 3}, {"id": 749930583, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d190623-r749930583-MACBA_Museu_d_Art_Contemporani_de_Barcelona-Barcelona_Catalonia.html", "text": "Upon seeing the museum from the outside I was impressed with the modernist design and the natural light that reached inside the building. Once inside, I liked the way the modern, light filled design continued throughout the entire length of the structure. As for the exhibitions, I really enjoyed the Charlotte Posenenske exhibit as well as the chronological timeline of the history of art at MACBA and how international world events helped shape the ever evolving art scene. The Calder sculptures are amazing! The Takis exhibit was mind blowing and just plain fun. Adults and children will really enjoy his exhibit. I spent more than two hours here. Be sure to check out the art surrounding the museum including the Keith Haring AIDS mural (c. 1989) done just prior to his death. ", "publishedDate": "2020-03-08", "language": "en", "rating": 4}, {"id": 745954288, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d190623-r745954288-MACBA_Museu_d_Art_Contemporani_de_Barcelona-Barcelona_Catalonia.html", "text": "Visited the museum with two teens and a seven year old, and all were very impressed and enthusiastic.  \nThe current display - Takis' works with magnets, was full of wonder.  The girls were mesmerised by the moving and musical creations.  \nThe museum itself is a vast and interesting space, though not overwhelming.\nThe internal ramps of the museum mimic and bring in the skateboarding action in the square outside. \nActive, vibrant spaces, both inside and out.  Highly recommended.\nEntry was free.", "publishedDate": "2020-02-18", "language": "en", "rating": 5}, {"id": 738003322, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d190623-r738003322-MACBA_Museu_d_Art_Contemporani_de_Barcelona-Barcelona_Catalonia.html", "text": "Modern building with easy access to upper floors,  rich and interesting collection,  with information and explanations for all art works.  Taki's temporary collection realky spectacular.  Someone can use the same ticket several times within a month.  ", "publishedDate": "2020-01-09", "language": "en", "rating": 5}, {"id": 731667761, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d190623-r731667761-MACBA_Museu_d_Art_Contemporani_de_Barcelona-Barcelona_Catalonia.html", "text": "I love modern art and I really enjoyed MACBA. The timeline exhibition is mostly catalán but showed quite a diversity. I loves seeing works by Jenny Holzer and Christian Boltanski!\nIf nothing else there is always the great café and shop!", "publishedDate": "2019-12-09", "language": "en", "rating": 4}, {"id": 731602338, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d190623-r731602338-MACBA_Museu_d_Art_Contemporani_de_Barcelona-Barcelona_Catalonia.html", "text": "For those who love (partly) modern and (mostly) postmodern art there are certainly some interesting segments and artworks (notably J.M. Basquiat's paintings, famous conceptualist pieces, exceptional work by Jo Spence etc), however in general doesn't offer anything so unique, neither revolutionary in a way. I admire very much the narrative about the Civil War in Spain in thirties and hippie culture in sixties, but everything else is quite broad, seen at so many places and expectable for this type of museum.\nI like the museum building however - not so extraordinary like MAXXI or Vitras but truly pleasant and contemplative in a way. Therefore, one star for building itself.", "publishedDate": "2019-12-09", "language": "en", "rating": 3}, {"id": 729789046, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d190623-r729789046-MACBA_Museu_d_Art_Contemporani_de_Barcelona-Barcelona_Catalonia.html", "text": "Went with my partner and we loved the history and variety. The two featured exhibits were interesting and our visit was a great way to put all the other art we saw in Barcelona in context.", "publishedDate": "2019-11-30", "language": "en", "rating": 5}, {"id": 727994257, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d190623-r727994257-MACBA_Museu_d_Art_Contemporani_de_Barcelona-Barcelona_Catalonia.html", "text": "Very small and uninteresting, half of the museum was closed. Hardly any artwork, but lots of old newspapers. Staff was unfriendly and not interested in offering any info. The best part are the skateboarders outside, at least some contemporary art can be seen through the windows. More modern art can be found on the streets, don't waste your time or 11 € for admission.", "publishedDate": "2019-11-21", "language": "en", "rating": 1}, {"id": 727993866, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d190623-r727993866-MACBA_Museu_d_Art_Contemporani_de_Barcelona-Barcelona_Catalonia.html", "text": "One of the worst museums I have visited. Main floor was closed and other two were pretty much uninteresting and pretencious. Only good thing is design of building and skaters outside. Save yourself 11€ and buy a drink and chat with skaters.", "publishedDate": "2019-11-21", "language": "en", "rating": 1}, {"id": 725890171, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d190623-r725890171-MACBA_Museu_d_Art_Contemporani_de_Barcelona-Barcelona_Catalonia.html", "text": "We went at 1700 on Monday evening and were able to tour in about an hour and a half.  I didn’t have an audio guide but there were labels in English too.  \nI especially appreciated the feminist art.  It had a gallery with female artists.  Is it fair to call it feminist, when you get the female prospective?  The Guerrilla Girls posters shown below, says it all.  \nThere were also several large paintings by Jean-Michel Basquiat, including the his self portrait shown below. \n", "publishedDate": "2019-11-12", "language": "en", "rating": 5}, {"id": 724074972, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d190623-r724074972-MACBA_Museu_d_Art_Contemporani_de_Barcelona-Barcelona_Catalonia.html", "text": "The museum is rather small, but still a great deal with the ArTicket. Uniquely, the museum allows skateboarders to hang out and skate around just outside the museum which can be super fun to watch. \n\nI really enjoyed the timeline aspect of the museum as we progressed through different time periods and kinds of artwork. I felt the museum was very well curated and was happy to see works unlike any I had seen before.", "publishedDate": "2019-11-05", "language": "en", "rating": 5}, {"id": 721267102, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d190623-r721267102-MACBA_Museu_d_Art_Contemporani_de_Barcelona-Barcelona_Catalonia.html", "text": "I had never sen so many skateboarders in one place as I threaded my way through them to the entrance! Enjoyed the exhibition of art movements through the different decades which is currently on.", "publishedDate": "2019-10-25", "language": "en", "rating": 4}, {"id": 721256793, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d190623-r721256793-MACBA_Museu_d_Art_Contemporani_de_Barcelona-Barcelona_Catalonia.html", "text": "The building itself is a sight, very modern and interesting. The exhibition on the first floor (A Short Century) was colourful and fun. On the 2nd floor there was a exhibition by Charlotte Posenenske (Work in Progress). Some nice things there too, but quite dull compared to the one on the 1st floor. The staff was grumpy and unsmiling; some further training on customer service would be a good idea. Anyway, this was definitely a place to see after strolling around El Raval.", "publishedDate": "2019-10-25", "language": "en", "rating": 4}, {"id": 716037192, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d190623-r716037192-MACBA_Museu_d_Art_Contemporani_de_Barcelona-Barcelona_Catalonia.html", "text": "Finding where to go in a new city with 4 adults of different ages (20 somethings and 50 somethings) is not always easy but our visit to MACBA was interesting in different ways for all of us. The exhibition on colonisation was very well done especially since we come from ex-colonies. The pieces on pop art in the 60's and 70's was nostalgic for the \"older\" members of the party as well as the younger ones. We disagreed on the apricot piece and the impact of linguistic imperialism but agreed to disagree over a jug of white sangria at a cafe off Ramblas which is in walking distance!", "publishedDate": "2019-10-07", "language": "en", "rating": 4}, {"id": 713124432, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d190623-r713124432-MACBA_Museu_d_Art_Contemporani_de_Barcelona-Barcelona_Catalonia.html", "text": "We have been to several of these Modern art museums in different countries and are always impressed by the striking modern buildings.  However when you go in there never really seems to be much to appreciate.  When we visited it was mainly films that were showing or \"installations\".  Admittedly one floor was closed for a new exhibition but watching a few videos seemed to be a waste of a fine building.\nIt is free on the Barcelona card so we did not waste any money coming here.", "publishedDate": "2019-09-26", "language": "en", "rating": 3}, {"id": 709135933, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d190623-r709135933-MACBA_Museu_d_Art_Contemporani_de_Barcelona-Barcelona_Catalonia.html", "text": "Came all the way from London to see permanent collection but the museum was closed due to public holiday. So came the next day. The museum was open but the permanent collection not available to view for ten days. I understand this happens but there was nothing on the website to mention this. Why not? Staff unable to advise or compensate.", "publishedDate": "2019-09-12", "language": "en", "rating": 1}, {"id": 708819496, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d190623-r708819496-MACBA_Museu_d_Art_Contemporani_de_Barcelona-Barcelona_Catalonia.html", "text": "This type of museum gives art museums/galleries a bad rep. as it had no meaning, just a bunch of art only hipsters would find interesting", "publishedDate": "2019-09-11", "language": "en", "rating": 1}, {"id": 708542951, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d190623-r708542951-MACBA_Museu_d_Art_Contemporani_de_Barcelona-Barcelona_Catalonia.html", "text": "Most of the exhibits during my visit were of an topical/activist nature.  I have no problem with that- art can make the world a better place.  Anti racist, colonial, sexist, police brutality, etc.  I'm against it too!  I know the artists and curators are sincere, but I felt like it was a showcase of good intentions and poor execution.  Some stuff was engaging in its own right, but for the most part I couldn't help but cringe.  See it on a free on Sunday afternoons if you must go.", "publishedDate": "2019-09-10", "language": "en", "rating": 2}, {"id": 708043057, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d190623-r708043057-MACBA_Museu_d_Art_Contemporani_de_Barcelona-Barcelona_Catalonia.html", "text": "This place was expensive (€11 each), and the art on show really wasn't good. My wife is an artist and art teacher who loves galleries and she was deeply unimpressed. I found two pieces in the whole gallery that I liked. The main exhibition in the top floor was a lot about sound art. Sound art, to my taste, is boring and tedious. Just my opinion, but a waste of time and money.", "publishedDate": "2019-09-09", "language": "en", "rating": 2}, {"id": 703852864, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d190623-r703852864-MACBA_Museu_d_Art_Contemporani_de_Barcelona-Barcelona_Catalonia.html", "text": "Got a coupon book from Leonardo hotel that offered 20% off admission. They house a lot of anti police and anti military art. Huge gift shop had postcards.", "publishedDate": "2019-08-28", "language": "en", "rating": 4}, {"id": 703288367, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d190623-r703288367-MACBA_Museu_d_Art_Contemporani_de_Barcelona-Barcelona_Catalonia.html", "text": "My husband and I have the Articket BCN and have seen 4 out of the 6 sites.  This was a surprise in the art displayed, but we liked it.  We both really liked the exhibit on the top floor, by Christiam MorClay.  It was all about music, sound, the culture of music, etc.  There were a variety of formats, all very creative.  Don't miss the movie with sound, we watched it two times.  \nThe first two floor deal with the impact of colonization and are very impactful, albeit somewhat sobering.  We are glad to have seen the exhibits and movies.  Gives us a lot to think about.\nThe museum itself is in an expansive building, very pleasant and relaxing to tour through.", "publishedDate": "2019-08-26", "language": "en", "rating": 4}, {"id": 703141477, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d190623-r703141477-MACBA_Museu_d_Art_Contemporani_de_Barcelona-Barcelona_Catalonia.html", "text": "Today it’s the 26th of august 13:33 when we met the most unfriendly people ever. If the employees here have a fixed working schedule, maybe it should be wise not to visit the place in a monday.", "publishedDate": "2019-08-26", "language": "en", "rating": 1}, {"id": 702350512, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d190623-r702350512-MACBA_Museu_d_Art_Contemporani_de_Barcelona-Barcelona_Catalonia.html", "text": "Arrived at this  gallery at 19.30pm we assumed it closed after 8pm but was repeatedly told me rather rudely it was a public building and it closes at 8pm. Not sure why she had to repeatedly tell me that, but she gave us tickets so seemed okay to enter. Having attended many “public art galleries” I thought we could have a quick look easily in 30 minutes. We attended a couple rooms  and then we were told we cannot enter the another room as it was closing. It was 19.46pm!!!!??? We were told we couldn’t enter any of the other rooms as they were closing. I went back downstairs to reception and queried that. They gave some excuse about security and it closing. This time it was 19.50pm. I’ve never heard anything like it!!!  Never been to an art gallery where they shut at least 15 minutes before. Bearing in mind the staff allowed us to get our tickets and enter! Even the gift shop had its barriers put in place and was shutting up. There were lots of people inside.. \n\nArt was ok what we saw but never got to see the rest. Worst treatment of all the galleries we’ve attended here. Won’t waste my money coming back. ", "publishedDate": "2019-08-23", "language": "en", "rating": 1}, {"id": 699510736, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d190623-r699510736-MACBA_Museu_d_Art_Contemporani_de_Barcelona-Barcelona_Catalonia.html", "text": "My daughter (20) and I enjoyed MACBA. I especially liked the exhibit on graffiti and its historical perspective. Great way to beat the heat in the afternoon and stroll through at your own pace. We spent 2 hours there and felt that was a good amount of time. The building is lovely.", "publishedDate": "2019-08-16", "language": "en", "rating": 5}, {"id": 695481001, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d190623-r695481001-MACBA_Museu_d_Art_Contemporani_de_Barcelona-Barcelona_Catalonia.html", "text": "Unimpressive exhibitions and far less to see than what you initially imagine when looking at the beautiful building. Also very feminist and pretentious. Don't bother.", "publishedDate": "2019-08-04", "language": "en", "rating": 1}, {"id": 693462708, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d190623-r693462708-MACBA_Museu_d_Art_Contemporani_de_Barcelona-Barcelona_Catalonia.html", "text": "Expensive and bad exhibicions. Not worth it - tickets are expensive (12 euro) and everything is just... Bad. ", "publishedDate": "2019-07-28", "language": "en", "rating": 2}, {"id": 693459987, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d190623-r693459987-MACBA_Museu_d_Art_Contemporani_de_Barcelona-Barcelona_Catalonia.html", "text": "I loved my visit to MACBA, on my first full day in Barcelona. It is a stunning building and the collections there were very thought provoking. I was lucky to see Christian Marclay's amazing exhibition - and especially enjoyed the musical piece/montage. Definitely recommend MACBA for a visit if you are in Barcelona.", "publishedDate": "2019-07-28", "language": "en", "rating": 5}, {"id": 680733586, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d190623-r680733586-MACBA_Museu_d_Art_Contemporani_de_Barcelona-Barcelona_Catalonia.html", "text": "Really nicely laid out, excellent lighting. I really enjoyed visiting MACBA. \n\nIf you purchase the Barcelona Museum Pass, this museum is included.", "publishedDate": "2019-06-11", "language": "en", "rating": 4}, {"id": 678880055, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d190623-r678880055-MACBA_Museu_d_Art_Contemporani_de_Barcelona-Barcelona_Catalonia.html", "text": "We visited chiefly for the Christian Marclay exhibition, which was very good and recommended. The other floors had a permanents collection and other visiting exhibits. A varied and well curated selection over the entire building. The museum itself is centrally located, just a few mins walk from Plaça de la Catalunya and is a modern structure amongst older buildings, but manages to fit in well. It’s courtyard has also been adopted by the local skate community so it keeps the place young! Additionally - fab gift shop for art book lovers.", "publishedDate": "2019-06-04", "language": "en", "rating": 4}, {"id": 677870630, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d190623-r677870630-MACBA_Museu_d_Art_Contemporani_de_Barcelona-Barcelona_Catalonia.html", "text": "Don’t feel you have to get there super early to avoid the masses. I arrived after 4 and there was only a handful of people there. This meant you could really spend time on each piece. Some of the work is interactive for your input, some require careful reading, others will evoke emotion, some surprise, one in particular is rather creepy and seems out of a Stephen King novel and there were pieces in which I had no clue what was going on and just walked away! It’s a stunning museum, good wheelchair access, toilets on each floor, clearly signposted with free leaflets for information.\n\nIf you want more entertainment, sit and watch the talented skateboarding outside the museum, quite impressive.", "publishedDate": "2019-05-31", "language": "en", "rating": 4}, {"id": 675144234, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d190623-r675144234-MACBA_Museu_d_Art_Contemporani_de_Barcelona-Barcelona_Catalonia.html", "text": "With its cool white and glass structure and its long ramps running through the 3 floors of the atrium space, with galleries on one side and the glass wall to the outside on the other, architect Richard Meier's Barcelona's Museum of Contemporary Art still looks good today, and is a surprise to find that it was actually opened over 20 years ago.   \n\nThe Museum is centrally located, though slightly hidden in the rambling streets around the Placa Catalunya and is well worth finding for anyone interested in modern art.  Like the Pompidou Centre in Paris, it has a large space outside, which is popular for sitting in and relaxing, with a few artworks around it. The Museum also owns the historic Convent dels Angels nearby, though it was not in use when I visited.  \n\nAt the time of visit (May 2019) there were three interesting and different exhibitions. The top floor was taken over entirely by the Swiss American artist Christian Marclay (born 1955), with the different works connected by texts related to musical compositions that run across the walls of the galleries. Composition is a theme of the exhibition, including a chalkboard for visitors to write their own composition, which will be interpreted and played by musicians and then erased for the next iteration, and immersive video installations.  Having recently seen his 24 Hour Clock at the Tate in London, it was fascinating to see the breadth of his work. \n\nThe first floor had an exhibition drawn the museum's own collections over the last century with many fine works and a recurrent themes of protest in the displays, while the ground floor has a series of works, including video and installations, focused on contemporary artists exploring issues around colonialism and empire. \n\nThree interesting exhibitions in this enjoyable architecural building, which also has a good shop that is worth exploring.", "publishedDate": "2019-05-19", "language": "en", "rating": 5}, {"id": 672754654, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d190623-r672754654-MACBA_Museu_d_Art_Contemporani_de_Barcelona-Barcelona_Catalonia.html", "text": "MACBA Museu d'Art Contemporani de Barcelona is quite an interesting museum. It houses some amazing modern and contemporary Catalonian, Spanish and European art. The building itself is also well constructed, allowing plenty of natural light inside. When we visited, the area outside the museum was absolutely full of youngsters on their skateboards, making full use of the area which obviously is perfect for skateboarding! Without realising it we just walked right through the skateboarders, but amazingly, they just went right around us! They were very polite and did not seem to mind our presence; perhaps they were used to unsuspecting tourists like us walking into them during their skateboarding.", "publishedDate": "2019-05-09", "language": "en", "rating": 4}, {"id": 662283183, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d190623-r662283183-MACBA_Museu_d_Art_Contemporani_de_Barcelona-Barcelona_Catalonia.html", "text": "Lovely light-filled building that houses a really interesting permanent collection that is alone worth a visit. There was a wonderful exhibit of Jaume Plensa's sculptures when we visited, which was such an unexpected bonus!  This visit was a highlight of our trip as it also brought us into the El Raval neighbourhood, an edgy, artsy quarter filled with all sorts of cool businesses and cultural institutions.  ", "publishedDate": "2019-03-30", "language": "en", "rating": 5}, {"id": 653714562, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d190623-r653714562-MACBA_Museu_d_Art_Contemporani_de_Barcelona-Barcelona_Catalonia.html", "text": "Visited MACBA on my first day in BCN. There are a number of nice cafes nearby for a drink and bite to eat if needed. The building is lovely inside and out - we were there on a spectacularly sunny day, so the main hall was flooded with light. The exhibits were very interesting and well laid out, and there was enough information in English for my husband and I to understand the concepts. ", "publishedDate": "2019-02-20", "language": "en", "rating": 3}, {"id": 653559773, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d190623-r653559773-MACBA_Museu_d_Art_Contemporani_de_Barcelona-Barcelona_Catalonia.html", "text": "This is the best gallery of modern art have ever been to. So unique and wild. Some wonderful pieces. Just loved it. \n", "publishedDate": "2019-02-19", "language": "en", "rating": 5}, {"id": 649926560, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d190623-r649926560-MACBA_Museu_d_Art_Contemporani_de_Barcelona-Barcelona_Catalonia.html", "text": "This museum is in a stunning Richard Meier building which only enhances the experience.\nThe art is curated in a way that is understandable to everyone.\nAdditionally, the special exhibit featuring Jaume Olensa was amazing -Sculpture and an explanation of the artist’s thinking made it a truly memorable experience. \n\nBuy the Articket BCN and visit the CCCB next door which currently features an outstanding review of Stanley Kubrick’s work", "publishedDate": "2019-02-03", "language": "en", "rating": 5}, {"id": 644067387, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d190623-r644067387-MACBA_Museu_d_Art_Contemporani_de_Barcelona-Barcelona_Catalonia.html", "text": "This is THE (modern) Art museum of Barcelona, located in raval. There is free days and nights visit so better to chack before. ", "publishedDate": "2019-01-06", "language": "en", "rating": 4}, {"id": 642657177, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d190623-r642657177-MACBA_Museu_d_Art_Contemporani_de_Barcelona-Barcelona_Catalonia.html", "text": "If you’re into art and history of Barcelona then you could give this a try. Visiting the museum takes about an hour as there are three different levels with different exhibitions. I enjoyed seeing the cool art and historical pieces, but would have appreciated a bit more information about the pieces and their meaning. I would say it was a nice afternoon activity to do. Tickets cost €10 for entry and lockers are also available for €1 (which you get back from the machine). The museum is less than a 10 minute walk away from Plaça de Catalunya and La Rambla through the lively side roads. There is a cool skatepark outside the museum which the locals use. ", "publishedDate": "2018-12-31", "language": "en", "rating": 3}, {"id": 641440955, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d190623-r641440955-MACBA_Museu_d_Art_Contemporani_de_Barcelona-Barcelona_Catalonia.html", "text": "The title says it all. During our recent stay in Barcelona we went twice to the MACBA, the first time for the special exhibition of works by Jaume Plensa, and the second time for the permanent exhibitions on the second an third floor. We were facinated both times and must have spent about three hours in all. And the building itself is wonderful in its typical Meyer whiteness.\nNow about the ladies that are supposed to sell you your tickets. The first time we came across the Stony Lady. The second time we found the Stony Lady in an animated conversation with her blonde colleague. Said colleague, after a time, deigned to look up, take our money, and throw the tickets at us - all the time without ceasing her amusing banter with the Stony Lady. I think these two people are in the wrong place. Dismissing them might help to get them something more suited to their temperaments.", "publishedDate": "2018-12-25", "language": "en", "rating": 5}, {"id": 626562122, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d190623-r626562122-MACBA_Museu_d_Art_Contemporani_de_Barcelona-Barcelona_Catalonia.html", "text": "A medium-sized collection of contemporary art, well worth a visit. The building is attractive and the permanent is collection is well-laid out in a series of rooms on the second floor. I am not sure I accept the conceit behind the special exhibition in the first floor (artists' use of the concept of surfaces), but there were a number of interesting pieces. the plaza in front of the museum is a hand out for skate boarders and the cafe to the side is a hang out for the young and stylish. (This 60's couple did not quite fit in, but had a tasty snack and enjoyed the atmosphere.)", "publishedDate": "2018-10-19", "language": "en", "rating": 4}, {"id": 623220182, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d190623-r623220182-MACBA_Museu_d_Art_Contemporani_de_Barcelona-Barcelona_Catalonia.html", "text": "A great surprise reminds us of Whitney and MOMA PS 1 in NYC. Edgy our favorite piece was Blue by Derek Jarman, mixedmedia 35minute poetry, music and mesmerizing blue screen with movie sear viewing. Three unique well done Basquaits. A museum that is on the cultural progressive edge located across the street from University of Barcelona housed in a stunningly simplistic modern Richard Meier building.", "publishedDate": "2018-10-08", "language": "en", "rating": 5}, {"id": 620859066, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d190623-r620859066-MACBA_Museu_d_Art_Contemporani_de_Barcelona-Barcelona_Catalonia.html", "text": "Great building, lots of modern art, less crowds then most other Barcelona museums.  And it's only 10 euros.  What's the issue?  I guess it's a museum for Catalans and Spanish and many of those are on vacation out of Barcelona in August.  Not many tourists because I'd say that 90% of the almost 5,000 works are Catalan and Spanish.  Only a sprinkling of international artists AND it's almost all Post 1945.", "publishedDate": "2018-09-30", "language": "en", "rating": 4}, {"id": 616552082, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d190623-r616552082-MACBA_Museu_d_Art_Contemporani_de_Barcelona-Barcelona_Catalonia.html", "text": "Outside in the courtyard of the museum, there is an enormous Keith Haring mural on display. Stumbling upon it was easily one of the major highlights of our trip. It's just a quick walk from Las Ramblas!", "publishedDate": "2018-09-14", "language": "en", "rating": 5}, {"id": 615917788, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d190623-r615917788-MACBA_Museu_d_Art_Contemporani_de_Barcelona-Barcelona_Catalonia.html", "text": "A great place to while away a few hours. Interesting international contemporary work to see, nice space to sit and hang out, lockers to leave your stuff in, free wifi, little folding seats hanging on the wall on each floor to be used and returned - a boon for the footsore traveller and a nice museum shop. The plaza outside is full of skateboarders having fun. About 7 mins walk from Universitat metro station.", "publishedDate": "2018-09-12", "language": "en", "rating": 5}, {"id": 604263156, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d190623-r604263156-MACBA_Museu_d_Art_Contemporani_de_Barcelona-Barcelona_Catalonia.html", "text": "The building looks beautiful from the outside and inside. However the actual exhibitions were not as exciting as I had hoped. Cost us 10 euro each which isn't bad. Most of the text alongside art was in Catalan, not even Spanish which my mother speaks.", "publishedDate": "2018-08-08", "language": "en", "rating": 3}, {"id": 602693849, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d190623-r602693849-MACBA_Museu_d_Art_Contemporani_de_Barcelona-Barcelona_Catalonia.html", "text": "Great building superb piece of architecture. The art installations didnt inspire, Probably the wrong artists for me - the wrong show but it really isnt brilliant. Shame but thats art! Love or hate or unmoved. Enjoy the building whatever", "publishedDate": "2018-08-04", "language": "en", "rating": 3}, {"id": 602457056, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d190623-r602457056-MACBA_Museu_d_Art_Contemporani_de_Barcelona-Barcelona_Catalonia.html", "text": "Before I visited Barcelona I knew I wanted to visit MACBA, as a big fan of contemporary/modern art I wasn’t let down. A great building with a huge bright and open lobby when you enter which leads into a well stocked shop full of books, prints and other quirky items. On the ground floor there are two big rooms which were full of art, an easy ramp walkway leads you up to another set of large rooms which again were full of interesting works of art. A must for anyone who enjoys contemporary art. ", "publishedDate": "2018-08-03", "language": "en", "rating": 5}, {"id": 602171605, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d190623-r602171605-MACBA_Museu_d_Art_Contemporani_de_Barcelona-Barcelona_Catalonia.html", "text": "We have been to MONA in Tasmania, Australia and found it much more interesting than what is on offer here at the moment. It wreaks of self centred importance (my view) and whilst some concepts were of interest, the actual displays were weak overall. Great venue with too much unused space and a poor external welcome (skate park?)", "publishedDate": "2018-08-02", "language": "en", "rating": 2}, {"id": 598062153, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d190623-r598062153-MACBA_Museu_d_Art_Contemporani_de_Barcelona-Barcelona_Catalonia.html", "text": "Really nice extensive exhibits laid out over 3 floors showing a range of artists- you could spend hours here.   Free entry which is also a nice plus.", "publishedDate": "2018-07-20", "language": "en", "rating": 5}, {"id": 595213708, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d190623-r595213708-MACBA_Museu_d_Art_Contemporani_de_Barcelona-Barcelona_Catalonia.html", "text": "We went there as my daughter is a fan of art.  We were all a little bit disappointed as, even though the building is well done and representative, the art itself was underwhelming.  Moreover, its location left us a little bit uneasy.  Lots of skaters around, and there was some kind of setup where there were people preparing some posters about tourists not being welcomed.  We didn't stay too long.", "publishedDate": "2018-07-11", "language": "en", "rating": 2}, {"id": 591982657, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d190623-r591982657-MACBA_Museu_d_Art_Contemporani_de_Barcelona-Barcelona_Catalonia.html", "text": "Ground floor had audio explanations from app in English which helped close the gap between the works and possible interpretations. Next two floors were less accessible.", "publishedDate": "2018-06-30", "language": "en", "rating": 3}, {"id": 585778088, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d190623-r585778088-MACBA_Museu_d_Art_Contemporani_de_Barcelona-Barcelona_Catalonia.html", "text": "I came here with my boyfriend, I like contemporary art and so was really looking forward to it but I was disappointed, for the 10 euros I paid to get in I don’t think I got much out of it, the info on the pieces wasn’t great and there was one exhibition that had no English translation so we didn’t know what the pieces were about, also compared to the other contemporary art galleries I’ve been to there wasn’t that much actual art, a lot of empty space. There were bits I liked but probably wouldn’t go here again", "publishedDate": "2018-06-07", "language": "en", "rating": 3}, {"id": 583619141, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d190623-r583619141-MACBA_Museu_d_Art_Contemporani_de_Barcelona-Barcelona_Catalonia.html", "text": "Totally underwhelming. A huge white space void of any warmth or credibililty . They haven't even got off their rear ends and scrubbed off the graffiti off a magnificant black obelisk sculpture in the entryway which now seems to be a skateboard park. In fact two American tourists were taking a selfie in front of the museum to send to their younger brother who said the venue is a “legend” in the world skateboarding community. The building is a huge white space void of any warmth or credibililty .There were long ramps leading up to the upper galleries 6 x 100 metre ramps with nothing to inspire one apart from stark white walls.I could not see an elevator …maybe there was one ? The exhibitions were bland and uninteresting and if it wasn't for Francesc Torres's exciting challenging artwork work I would have walked out. It was hilarious to see a poster with a Q code on the mirror above the urinals in the mens bathrooms to access their artwork . Perhaps this was a metaphor for the gallery . Don't bother seriously, I would suggest the ramps and the huge floor space would be awsome for an indoor skateboarding park", "publishedDate": "2018-05-29", "language": "en", "rating": 1}, {"id": 583162314, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d190623-r583162314-MACBA_Museu_d_Art_Contemporani_de_Barcelona-Barcelona_Catalonia.html", "text": "I’m not a big fan of contemporary art so I can’t judge for the art part but it was a very nice museum and very clean.", "publishedDate": "2018-05-27", "language": "en", "rating": 3}, {"id": 582707331, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d190623-r582707331-MACBA_Museu_d_Art_Contemporani_de_Barcelona-Barcelona_Catalonia.html", "text": "Contemporary art is not among our favorite, but we are open to learning and wanted to visit since we were nearby.  For contemporary art lovers, MACBA may be worth a visit although we were somewhat disappointed on the afternoon we were there.    It seemed that half of the museum was closed and there actually was not much see other than an excellent photography exhibit.  We really did appreciate seeing the architecture of the building.  Our experience might have been different on a different day or month had more of the museum actually been open.", "publishedDate": "2018-05-25", "language": "en", "rating": 3}, {"id": 581900483, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d190623-r581900483-MACBA_Museu_d_Art_Contemporani_de_Barcelona-Barcelona_Catalonia.html", "text": "We went skating at the mecca of european skateboarding! its an amazing feeling, a lot of friendly people and pros and a lot of people selling cheap cold beers...what else can you ask????", "publishedDate": "2018-05-22", "language": "en", "rating": 5}, {"id": 581702830, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d190623-r581702830-MACBA_Museu_d_Art_Contemporani_de_Barcelona-Barcelona_Catalonia.html", "text": "We happened to visit on a Saturday evening during what was a museum night celebration being held throughout the city so there was no entrance charge. That turned out to be a good thing since there was little of traditional modern art in the museum. We enjoyed the structure as a whole and an avantgarde live production held for the museum night.  However,  we wouldn't have paid to get in, knowing what we now know.  Note: there's a big, open rectangular plaza in front of the museum which is very popular with skateboarders.", "publishedDate": "2018-05-21", "language": "en", "rating": 3}, {"id": 581265081, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d190623-r581265081-MACBA_Museu_d_Art_Contemporani_de_Barcelona-Barcelona_Catalonia.html", "text": "Not much was open on Mondays, but MACBA was.  It's located in the middle of the university, and many skateboarders are in the courtyard.  Wide open spaces with explanations of the art did not charm us.  In fact, how do we know these very large pieces are actually art?  This museum was included in our ARticket, which is the only reason we visited.", "publishedDate": "2018-05-19", "language": "en", "rating": 2}, {"id": 577858565, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d190623-r577858565-MACBA_Museu_d_Art_Contemporani_de_Barcelona-Barcelona_Catalonia.html", "text": "Hardly any artwork, half the museum is closed. Buy a couple of drinks instead and watch the skate boarder's outside, much more entertaining.", "publishedDate": "2018-05-04", "language": "en", "rating": 1}, {"id": 576242030, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d190623-r576242030-MACBA_Museu_d_Art_Contemporani_de_Barcelona-Barcelona_Catalonia.html", "text": "My partner is an artist, we have visited museums all over Europe, this was an absolute Joke, empty room art work was a disgrace, half of the building was closed, definitely do not bother", "publishedDate": "2018-04-28", "language": "en", "rating": 1}, {"id": 573920322, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d190623-r573920322-MACBA_Museu_d_Art_Contemporani_de_Barcelona-Barcelona_Catalonia.html", "text": "The MACBA building is spectacular from the outside, and gorgeous inside. Just beware the skate borders as you approach! There does not appear to be any permanent collection, rather a number of one off exhibitions. A great place to lose yourself and contemplate the art.", "publishedDate": "2018-04-17", "language": "en", "rating": 5}, {"id": 573605222, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d190623-r573605222-MACBA_Museu_d_Art_Contemporani_de_Barcelona-Barcelona_Catalonia.html", "text": "While waiting for our tour to start at the Picasso Museum we wondered by this museum. It’s not even a minute or two walk from the Picasso Museum. We toured the whole thing on our own within half an hour. It’s not very crowded and a lot of the artwork is lifelike.", "publishedDate": "2018-04-15", "language": "en", "rating": 3}, {"id": 573418305, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d190623-r573418305-MACBA_Museu_d_Art_Contemporani_de_Barcelona-Barcelona_Catalonia.html", "text": "This is a must when visiting BCN, because so close to the city center, because of the architecture, because it is full of choices for later lunch or soft drink, ...and  because of modern art, for sure.", "publishedDate": "2018-04-15", "language": "en", "rating": 5}, {"id": 573275852, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d190623-r573275852-MACBA_Museu_d_Art_Contemporani_de_Barcelona-Barcelona_Catalonia.html", "text": "This is a very spacious, airy gallery. There is a large array of art spread across three floors (that I saw. Not sure if there was a basement) and it is displayed in a way that gives the viewer good perspective, space and distance. That being said, I didn't see much in the way of facilities and the majority of the actual art did not do it for me! I did very much like the quote in the main hall which runs from floor to ceiling.", "publishedDate": "2018-04-14", "language": "en", "rating": 3}, {"id": 571170532, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d190623-r571170532-MACBA_Museu_d_Art_Contemporani_de_Barcelona-Barcelona_Catalonia.html", "text": "I got free admission with my Barcelona Card.  Photography is allowed in the museum.  This museum featured contemporary artwork.  I have to admit that the artwork in this museum did not appeal to me.\n\nThere are lockers for storage and a gift shop.  Watch where you are walking in the large outdoor plaza since there were a number of skateboarders around.", "publishedDate": "2018-04-04", "language": "en", "rating": 3}, {"id": 569334075, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d190623-r569334075-MACBA_Museu_d_Art_Contemporani_de_Barcelona-Barcelona_Catalonia.html", "text": "if contemporary Art is your thing this is a pretty good experience there is a lot to see a lot to get from all of the displays or paintings.", "publishedDate": "2018-03-28", "language": "en", "rating": 4}, {"id": 568801546, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d190623-r568801546-MACBA_Museu_d_Art_Contemporani_de_Barcelona-Barcelona_Catalonia.html", "text": "My friend and I (keen artists) visited MACBA after reading great things about it this March. The architecture of the building is minimal and beautiful - but thats probably the best thing about it.\n\nThe exhibitions don't hold much explanation and there is no clear guide how to follow it around, as there are lots of different rooms containing unrelated projects.\n\nThe best part of our visit here was seeing a couple installations, but again, they were very open to interpretation. I guess we are used to going to museums such as the Tate that hold an artist statement for key pieces. \n\nWe went on Saturday at 4pm as it was free on this time, so if you're going to visit I would say try and visit when it's free as we didn't feel it was worth an entry fee!", "publishedDate": "2018-03-26", "language": "en", "rating": 3}, {"id": 568470908, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d190623-r568470908-MACBA_Museu_d_Art_Contemporani_de_Barcelona-Barcelona_Catalonia.html", "text": "We visited the museum in a group and had a very good tour by a guide who made us understand and to some extend even start to appreciate some of the pieces of art that would otherwise not be ... OK, \"de colorises et ...\".", "publishedDate": "2018-03-24", "language": "en", "rating": 3}, {"id": 568428524, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d190623-r568428524-MACBA_Museu_d_Art_Contemporani_de_Barcelona-Barcelona_Catalonia.html", "text": "Everytime I am in Barcelona, I visit MACBA, and every time I discover someting new! The arcitrcture is also fantastic.", "publishedDate": "2018-03-24", "language": "en", "rating": 5}, {"id": 568141157, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d190623-r568141157-MACBA_Museu_d_Art_Contemporani_de_Barcelona-Barcelona_Catalonia.html", "text": "Richard Meier consistently designs masterpieces, and this is an elegant, bright building.  My son, who is an avid skateboarder, knew of this place for the plaza in front that is inhabited by skater dudes.  The museum is worth a visit, though, but get the ARTICKET BCN and visit this and several other museums for one price.", "publishedDate": "2018-03-22", "language": "en", "rating": 3}, {"id": 567000775, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d190623-r567000775-MACBA_Museu_d_Art_Contemporani_de_Barcelona-Barcelona_Catalonia.html", "text": "Its surroundings, right in the very core of Barcelona city, make it a not-to miss spot while strolling the pedestrians streets of the Raval quarter. Watch out for pickpockets & other sorts of people,though.", "publishedDate": "2018-03-17", "language": "en", "rating": 4}, {"id": 564271480, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d190623-r564271480-MACBA_Museu_d_Art_Contemporani_de_Barcelona-Barcelona_Catalonia.html", "text": "Even being art student I’m surprised that such a nice building has collection like this. Maybe we were at wrong time of the year for wrong exhibition but that was extremely boring and just nothing to see there. Have you seen any museum of contemporary art out there? Even in my one city it is much nicer than the one in Barcelona. Disappointed. We would spend this money better for a nice lunch honestly. The only thing we like in the end - sofas downstairs. Well.", "publishedDate": "2018-03-04", "language": "en", "rating": 1}, {"id": 563178333, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d190623-r563178333-MACBA_Museu_d_Art_Contemporani_de_Barcelona-Barcelona_Catalonia.html", "text": "MACBA is in the centre of Barcelona in the Gothic district. The building is nice and modern with high celings. They have interesting exhibitions including videos, sculptures, paintings and even some light sculptures. There is a good variety of different styles and types of art. It is a nice stop if you are into art.There is a fee to go in.", "publishedDate": "2018-02-27", "language": "en", "rating": 4}, {"id": 562693591, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d190623-r562693591-MACBA_Museu_d_Art_Contemporani_de_Barcelona-Barcelona_Catalonia.html", "text": "Visited for class with about 30 people in the morning. I absolutely loved the building, it was gorgeous in the sunlight. I love the very open concepts and the galleries are very nice. Only visited a few of the exhibitions but I really enjoyed it. A nice way to spend an hour or two. ", "publishedDate": "2018-02-25", "language": "en", "rating": 5}, {"id": 558951642, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d190623-r558951642-MACBA_Museu_d_Art_Contemporani_de_Barcelona-Barcelona_Catalonia.html", "text": "To be honest, I liked MACBA more from outside, it's a very nice building and around it is very great atmosphere, as the skateboards riding there everywhere. The museum inside is nice too, some exibition vere a little bit boring, but some of them were one of the best things I ever saw. So I definitely recommend to go check this place out. ", "publishedDate": "2018-02-06", "language": "en", "rating": 4}, {"id": 557498874, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d190623-r557498874-MACBA_Museu_d_Art_Contemporani_de_Barcelona-Barcelona_Catalonia.html", "text": "When I'm in Barcelona I always visit the MACBA. With contemporary art you never know what to expect. This time, I visited early January 2018, it was disappointing.\n\nThere was an exhibition with work from Rosemarie Castoro which had some interesting details\n\nAnother large exhibition payed tribute to Spanish artist Joan Brossa. As everything was in Spanish I just passed the exhibits quickly\n\nAll in all this visit unfortunately was a bit boring", "publishedDate": "2018-01-31", "language": "en", "rating": 3}, {"id": 556322583, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d190623-r556322583-MACBA_Museu_d_Art_Contemporani_de_Barcelona-Barcelona_Catalonia.html", "text": "Really really boring and not worth 10€. Nothing thought provoking,  nothing that would spark any interest. We just went thru it really quickly 'cause nothing really got our attention. The building itself is nice but we shoul've just stayed outside and watch the skaters. That would have been a lot more interesting and entartaining. I do not recomend going inside.", "publishedDate": "2018-01-25", "language": "en", "rating": 1}, {"id": 555027303, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d190623-r555027303-MACBA_Museu_d_Art_Contemporani_de_Barcelona-Barcelona_Catalonia.html", "text": "The MACBA building was quite good but the exhibition when we visited in January was quite boring. We went through each room quite quickly and did not have to wait and ponder about most exhibits. I am not an arty type so maybe its just me. I will not visit again unless its free.", "publishedDate": "2018-01-20", "language": "en", "rating": 3}, {"id": 551273240, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d190623-r551273240-MACBA_Museu_d_Art_Contemporani_de_Barcelona-Barcelona_Catalonia.html", "text": "The architecture is light and airy from the entrance however the exhibition space over the three floors is repetitive and consequently the navigation for each floor is pschologically boring. The three concurrent exhibitions could also have been more contrasting. Nothing bad, but the curating lacked passion or intrigue. Not the most impressive contemporary art museum I have visited. ", "publishedDate": "2018-01-03", "language": "en", "rating": 3}, {"id": 547570429, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d190623-r547570429-MACBA_Museu_d_Art_Contemporani_de_Barcelona-Barcelona_Catalonia.html", "text": "All modern art can be scary, it can shock, offend, or simply bore.  MACBA probably change their exhibitions frequently and in which case you might find something interesting.  For me the art on show in December 2017 was a bitter disappointment.  Pretentious, unskilled, lacking credibility; some works just seemed to be a con trick; a wall painted all in a single colour, but with small rectangles left uncoloured as though paintings had been hanging there (they hadn't).  A huge mirror (I'm guessing 10 metres by 5 metres) which had been mounted in a massive gilded frame and then the whole thing cut into 4 panels and leaning against a wall.  \"All life is a mirror\" it proclaimed.  A ball of twine had a miniature water tap screwed into it.  MACBA is expensive, and I didn't feel that I got good value here.  Beauty is in the eye of the beholder, this beholder didn't see anything that I could warm to and the E10.00 entry fee left me cold.  You really have to have an open mind and a good appreciation of Modern Art before a visit here will make sense.", "publishedDate": "2017-12-16", "language": "en", "rating": 3}, {"id": 543781062, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d190623-r543781062-MACBA_Museu_d_Art_Contemporani_de_Barcelona-Barcelona_Catalonia.html", "text": "Hit and especially miss. Most is a waste of your time. Some is nice to see. The scale balances to the negative unfortunately.", "publishedDate": "2017-11-28", "language": "en", "rating": 2}, {"id": 532627842, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d190623-r532627842-MACBA_Museu_d_Art_Contemporani_de_Barcelona-Barcelona_Catalonia.html", "text": "Included as part of the ARTICKETBCN, MACBA features a thoroughly underwhelming collection further marred by the fact that during our visit the workers were on strike for unfair labor practices.  Although slightly more impressive than the CCCB which was also ‘supposedly’ included on the Pass this is a definite ‘skip’ for all but the most hardcore Modern Art devotee.", "publishedDate": "2017-10-13", "language": "en", "rating": 2}, {"id": 532255156, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d190623-r532255156-MACBA_Museu_d_Art_Contemporani_de_Barcelona-Barcelona_Catalonia.html", "text": "Friendly striking staff on a picket line explained that entrance was free because of their industrial action, so we paid into the strike fund instead (completely voluntarily, no pressure). We were gripped by the excellent exhibition on forensic architecture.", "publishedDate": "2017-10-12", "language": "en", "rating": 5}, {"id": 532130301, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d190623-r532130301-MACBA_Museu_d_Art_Contemporani_de_Barcelona-Barcelona_Catalonia.html", "text": "The place is nice, the museum is bright and big, there was free entrance - which I'm glad there was, wouldn't have wanted to pay for this. There was very little variety, and felt like very little art. The first floor was a mix of different artists - nothing very exciting, the second floor was completely dedicated to a Spanish poet, and there were papers and letters on display everywhere, nice - but still somehow lacking something. Except for the huge display of obscure objects in the middle of that exhibition, that was my favourite thing in the whole museum. The rest I did not like, and felt much more like a educational/historical exhibition of some sorts. Ok if you have some time to waste, especially since it was free.", "publishedDate": "2017-10-11", "language": "en", "rating": 2}, {"id": 531043535, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d190623-r531043535-MACBA_Museu_d_Art_Contemporani_de_Barcelona-Barcelona_Catalonia.html", "text": "We decided to brave the catalan rally on Sunday and arrived at this place. We knew there was a strike so we were met at the front door by strikers who explained the strike to us. Entrance was free because of the strike and the exhibits on level 2 on \"Forensic Architecture \" kept us very busy for 2 hours. Very well put together in a beautiful building. Such a shame on the \"strike\".", "publishedDate": "2017-10-08", "language": "en", "rating": 4}, {"id": 528240834, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d190623-r528240834-MACBA_Museu_d_Art_Contemporani_de_Barcelona-Barcelona_Catalonia.html", "text": "This is not a museum of art. It is a collection of propaganda displays and materials. Very disappointed in it. Do not recommend.", "publishedDate": "2017-09-29", "language": "en", "rating": 1}, {"id": 527411504, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d190623-r527411504-MACBA_Museu_d_Art_Contemporani_de_Barcelona-Barcelona_Catalonia.html", "text": "Highly recommended, it was free entrance as well not sure if it's because of the city festival at the time. The shop is worth a visit too. ", "publishedDate": "2017-09-25", "language": "en", "rating": 5}, {"id": 526784273, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d190623-r526784273-MACBA_Museu_d_Art_Contemporani_de_Barcelona-Barcelona_Catalonia.html", "text": "Although I like conceptual art the exhibition we saw really didn't work for me. However the building itself is an excellent example of modern architecture and is a pleasure to walk around.", "publishedDate": "2017-09-23", "language": "en", "rating": 3}, {"id": 524520812, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d190623-r524520812-MACBA_Museu_d_Art_Contemporani_de_Barcelona-Barcelona_Catalonia.html", "text": "Check out their temporary expos here and you might find something you want to see.  I did and it was a good visit.  The building is not one of Barcelona's best, but it's in the middle of an old historic neighborhood.  A magnet for art students.", "publishedDate": "2017-09-14", "language": "en", "rating": 4}, {"id": 518547974, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d190623-r518547974-MACBA_Museu_d_Art_Contemporani_de_Barcelona-Barcelona_Catalonia.html", "text": "The museum staff were having a strike when we visited so we didn't hae to pay a entrance fee.  After visiting the whole museum  we were pleased that we didn't pay an entrance fee.  We were expecting some modern with some engineering, not what saw.  It was all very random, some shocking, however we loved the modern building and how it was all displayed throughout the galleries.  Don't go out of your way to visit there's plenty more in Barcelona to visit.", "publishedDate": "2017-08-28", "language": "en", "rating": 2}, {"id": 517101575, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d190623-r517101575-MACBA_Museu_d_Art_Contemporani_de_Barcelona-Barcelona_Catalonia.html", "text": "Decided to visit this after Museu Picasso and was extremely disappointed, do not waste your time or money. No art here only social expression. Have been to Modern art museums in San Francisco, New York, San Jose and other places...while I don't always appreciate the style, there is usually objects that qualify as art. This place did not have any.....", "publishedDate": "2017-08-24", "language": "en", "rating": 1}, {"id": 515457052, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d190623-r515457052-MACBA_Museu_d_Art_Contemporani_de_Barcelona-Barcelona_Catalonia.html", "text": "Thanks for pointing this out on your website. Closed due to industrial action, but yippee the shop was open. ", "publishedDate": "2017-08-20", "language": "en", "rating": 1}, {"id": 512725115, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d190623-r512725115-MACBA_Museu_d_Art_Contemporani_de_Barcelona-Barcelona_Catalonia.html", "text": "Went there to see some pictures and a look at old photos from Egypt and some first hand stories of the troubles in that area. ", "publishedDate": "2017-08-14", "language": "en", "rating": 4}, {"id": 509024282, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d190623-r509024282-MACBA_Museu_d_Art_Contemporani_de_Barcelona-Barcelona_Catalonia.html", "text": "After enjoying our visits to MNAC and Museu Picasso we were looking forward to the MACBA as our final museum stop of our trip. However it was very disappointing! As mentioned in previous reviews the actual exhibitions and displays are pretentious and hardly art. I did not engage with the art at all and walked around fairly quickly. The best display by far was the room filled with portraits of one individual per age (from 1 year old to 100 years old). The rest was completely forgettable.\n\nThe best thing about the museum was the interior design of the building itself and the fact that it was air conditioned (after walking round in 30C heat for a few hours prior). Would not visit again in future and would recommend spending the 10 Euro entry fee elsewhere.", "publishedDate": "2017-08-05", "language": "en", "rating": 1}, {"id": 508952568, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d190623-r508952568-MACBA_Museu_d_Art_Contemporani_de_Barcelona-Barcelona_Catalonia.html", "text": "Ok, there's some clever and elaborate work here, but even when we took time to contemplate and understand some of the work we found it unrewarding. There were a few pieces from the permanent collection that were absorbing. We took in all the galleries on the date of our visit. The Forensic Architecture temporary exhibit uses \"architecture as a methodological device with which to investigate armed conflicts and environmental destruction\". This seemed worthy but I just don't see this as art practice. Some of the gallery notes are written in that awful art-speak which mangles language and is designed to convey depth and complexity where little exists.\n\nThe building was my first real world encounter with the work of architect Richard Meier (who worked for Marcel Breuer at one point). Contrary to my expectations it is not a \"pearl inside old Barcelona\". Rather, I found it utterly sterile and bland - pretty damn awful really. I kept thinking about what a really good gallery building the Spanish architect Josep Lluís Sert had designed for the Fundació Joan Miró up at Montjuic in the 1970's. Go there instead. What the building does provide is a skate park and after our visit we really enjoyed watched the skateboarders and parcours / street acrobatics.", "publishedDate": "2017-08-05", "language": "en", "rating": 3}, {"id": 508323573, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d190623-r508323573-MACBA_Museu_d_Art_Contemporani_de_Barcelona-Barcelona_Catalonia.html", "text": "There's some great art and art meets science exhibitions on in MACBA.  It is worthy of a few hours of your time.\n\nHowever, the ground floor suffers from some amateur design decisions, notably the printing of information/interps panels in A4 sized signs... and so that in three languages, the font is very small.  You have to get so close to the signs that no-one else can read them at the same time.  Then there are signs that are in total darkness, and still others that are so far away from the artworks that they pertain to as to make for a very confusing experience.   I am pleased to report that signage on the upper two floors is much better.\n\nAnd just to make our visit that much more enjoyable, staff refused to let us exit from the top floor via the lifts. They forced us to use the stairs with no explanation given.  Rude at best.  ", "publishedDate": "2017-08-03", "language": "en", "rating": 3}, {"id": 507180079, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d190623-r507180079-MACBA_Museu_d_Art_Contemporani_de_Barcelona-Barcelona_Catalonia.html", "text": "Having visited many contemporary art exhibitions/museums and loved them, I was really excited to visit the MACBA. The building itself is interesting, very futuristic etc but the exhibitions inside are just terrible. As mentioned in previous reviews, the art is overly pretentious and really shallow. There is literally an installation of shredded paper (cvs) and nothing is really thought provoking, it all feels very try hard. There is one semi interesting section about forensic architecture and human rights history, but it is not worth paying 10 euros entry to see this alone. I would save your money and check out the street art/ small independent galleries in the city instead of visiting here. ", "publishedDate": "2017-07-30", "language": "en", "rating": 1}, {"id": 499981531, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d190623-r499981531-MACBA_Museu_d_Art_Contemporani_de_Barcelona-Barcelona_Catalonia.html", "text": "The architecture of the MACBA building is beautiful,however the most interesting exhibit was a pile of shredded paper.  The only good thing was the free wifi and air conditioning, but as far as art, the museum was a disappointment", "publishedDate": "2017-07-09", "language": "en", "rating": 1}, {"id": 497319732, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d190623-r497319732-MACBA_Museu_d_Art_Contemporani_de_Barcelona-Barcelona_Catalonia.html", "text": "Great place for skaters and break-dancers in the evening. \"Don't get their version of an irish coffee dessert if you're a fan of whiskey.\"Lovely building with fascinating exhibitions. No permanent collection on display. Strongly recommend free tour guide. ", "publishedDate": "2017-06-29", "language": "en", "rating": 4}, {"id": 495235132, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d190623-r495235132-MACBA_Museu_d_Art_Contemporani_de_Barcelona-Barcelona_Catalonia.html", "text": "The building is beautiful and was the only thing worth seeing, the gift shop was nice as well. One exhibit was a pile of shredded paper in front of a video of someone shredding the paper. Yes that was art.  I am sure it has some geopolitical existential meaning but all I wanted to do was throw it in the trash. Stay outside and watch the skateboarders who have a lot more talent than anything inside. ", "publishedDate": "2017-06-22", "language": "en", "rating": 1}]}}]