[{"locationId": 2328556, "name": "Teleferico del Puerto", "placeType": "ATTRACTION", "reviewListPage": {"reviews": [{"id": 752910713, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d2328556-r752910713-Teleferico_del_Puerto-Barcelona_Catalonia.html", "text": "We came to this cable car station by chance whilst we were walking along the Barcelona beach, it was hard to resist not wanting to get a bird's eye view of the beautiful coastline of Barcelona.\nThere was a queue for about 40 people on the ground floor when we got there, but I didn't expect that we'd ended up queuing for almost 2 hours before we reached the cable car. It was very hot and sunny on that day but thankfully, the management provided free beach umbrellas for people in the queue. The queue was split into half, 1/2 was on the ground floor and the other 1/2 was on the upper deck. People have to queue for tickets on the ground floor before taking the lift to the upper deck to queue again for the cable car.\nThe queuing experience was painful and exhausting. But once I boarded the cable car, the amazing view had made me forgotten all stresses that I had for the past 2 hours. We were lucky to get in the front row inside the cable car as it provided the best \"270-angle\" view. The ride started at \"Torre Sam Senastoa\" (The south tip of the beach) and it finished at \"Torre de Miramar\" (The Montjuic Hill) and the whole journey took about 15 minutes. The scenery along the Port Vell coastline was absolutely breathtaking, i.e. blue sky and blue sea... and it was one of the best moments I had in Barcelona. It's highly recommended for anyone who fancies taking a look at the coastline of Barcelona and who doesn't mind queuing for 2 hours.\np.s. The tickets prices listed in front of the ticket booth were misleading - a single ticket actually cost only 11.00 Euro.", "publishedDate": "2020-04-25", "language": "en", "rating": 4}, {"id": 743023696, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d2328556-r743023696-Teleferico_del_Puerto-Barcelona_Catalonia.html", "text": "We got the tTleferico del Puerto only one way and walked to Montjuic Castle from there.  The price in January is 16.50 Eur return and 11 Eur for one way. The ride is nice, lovely view. There were no lines in January, only few people queuing in the morning.", "publishedDate": "2020-02-04", "language": "en", "rating": 4}, {"id": 737650383, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d2328556-r737650383-Teleferico_del_Puerto-Barcelona_Catalonia.html", "text": "Be aware that the queues to take this attraction are long! We enjoyed this longer version of a teleferic. It is not the same as the short ride up to the Montjuic castle. We rode from the Montjuic stop down to the beachfront and enjoyed the views of the city and the sea. It is definitely a tourist excursion - not many locals paid for this attraction, but it was a nice conclusion to our time in Barcelona.", "publishedDate": "2020-01-07", "language": "en", "rating": 4}, {"id": 725312226, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d2328556-r725312226-Teleferico_del_Puerto-Barcelona_Catalonia.html", "text": "It is a great attraction if you want to see views of Barcelona.  There are two teleféricos owned by two different companies.  They have their own routes.  It is expensive (€11 for one way ticket / 2 way is a better deal on a per trip basis, but it does not seem a good use of time to do a round trip).  I have read other reviews and it seems everyone waiting to get the teleférico from the port area had to wait long lines.  I took it from the Hotel Miramar stop and I did not have to wait.  However I would suggest that if you take it from Hotel Miramar that you start your day on that side of town and end up at the port.  We did Plaza España, The Barcelona Museum and all the other land marks around and walked to the teleferico.  Please notice that before you get to the Hotel Miramar there is another teleferic so unless you want to do that route keep walking.  You have great views of Barcelona, but the area by the Hotel Miramar allows you to take better pictures.", "publishedDate": "2019-11-09", "language": "en", "rating": 4}, {"id": 722870959, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d2328556-r722870959-Teleferico_del_Puerto-Barcelona_Catalonia.html", "text": "Nice views of the port from above but the line is too long and there’s an additional line upstairs. Not worth the waste of time )-:", "publishedDate": "2019-10-31", "language": "en", "rating": 3}, {"id": 722211420, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d2328556-r722211420-Teleferico_del_Puerto-Barcelona_Catalonia.html", "text": "The cable car has a capacity of 20, there are only two. It gets really busy. Go early or go late, give plenty of time for queues to enjoy the views. \n\nWe arrived 50 minutes before opening to get in the first car. The children had handheld games devices to pass the time, while we planned the rest of the day.\n\nThe views over the port and of the city are well worth the 11€ each (our kids were free, not sure if this was generosity or standard!).", "publishedDate": "2019-10-28", "language": "en", "rating": 4}, {"id": 721988328, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d2328556-r721988328-Teleferico_del_Puerto-Barcelona_Catalonia.html", "text": "We were in the queue for nearly two hours Paid  the entrance fee. It seemed like a reasonable price ( little did we know ) \nNext we go in the lift to find at the top another bloomin queue. \nFinally get to the top and we see the queue to do the return journey.  \nHad a quick look round the top and then queued an hour to come back down.  \nIf you have nothing better to do for three hours then this is the trip for you. ", "publishedDate": "2019-10-28", "language": "en", "rating": 1}, {"id": 719552082, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d2328556-r719552082-Teleferico_del_Puerto-Barcelona_Catalonia.html", "text": "We did this with 2 other couples. The views are great but we had to wait for a really long time (circa 2 hours) Price was €11 or €16 return, we went for the single and walked back to our hotel. Nice views but wait far too long", "publishedDate": "2019-10-18", "language": "en", "rating": 2}, {"id": 715582150, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d2328556-r715582150-Teleferico_del_Puerto-Barcelona_Catalonia.html", "text": "I had to wait for quite a while - as a single rider I was able to move forward - but it was worth as it it gives a stunning view over the harbour. Try to step into the gondola first, otherwise you won't have a place at the window.", "publishedDate": "2019-10-05", "language": "en", "rating": 4}, {"id": 715010728, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d2328556-r715010728-Teleferico_del_Puerto-Barcelona_Catalonia.html", "text": "A brilliant ride and what great views. Takes a decent time and make sure you get a return ticket. A bit pricey but worth doing.make sure you have a head for heights", "publishedDate": "2019-10-03", "language": "en", "rating": 5}, {"id": 699292595, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d2328556-r699292595-Teleferico_del_Puerto-Barcelona_Catalonia.html", "text": "we went in the morning and everything was okay. however on the way back we had to wait about 1 hour and 30 minutes in the line under the sun to get up to the elevator, and up we had to also wait about 50 minutes in a line in order to go into the teleferic which lasts about 10 minutes only. I don't advise anyone to try it.The only nice thing was the view though", "publishedDate": "2019-08-15", "language": "en", "rating": 1}, {"id": 699194897, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d2328556-r699194897-Teleferico_del_Puerto-Barcelona_Catalonia.html", "text": "The only disappointment of a wonderful holiday in Barcelona was this overrated and overpriced cable car ride. We arrived late afternoon, to what we thought were relatively short queues. However took an age for the queue to move. Finally arrived at the pay kiosk to be told that full price to be paid if aged SEVEN or over!! Then queued again to take the lift to the tower. Once at the top of the tower we were met by a new massive queue for the cable car. There are just two cable cars, one going each way. They are crammed with 20 people at a time, so if you are unlucky enough to be one of the last of the 20, you will be in the middle of the car rather than by a window, and views will be limited. Then the main event...a seven minute cable car ride. Yes, nice views, but absolutely not worth €44 and the hour and 45 minutes queuing. Far too expensive and time consuming for what it is. Avoid, and invest your time and money elsewhere in this fine city.", "publishedDate": "2019-08-15", "language": "en", "rating": 2}, {"id": 696872395, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d2328556-r696872395-Teleferico_del_Puerto-Barcelona_Catalonia.html", "text": "For a 7 minute ride you have to wait around an hour and a half. We took roundtrip ticket and on the other end there was a queue for about 40-50 minutes. Similar views are available from the mountain itself and you can get there by public transport.", "publishedDate": "2019-08-08", "language": "en", "rating": 1}, {"id": 690318056, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d2328556-r690318056-Teleferico_del_Puerto-Barcelona_Catalonia.html", "text": "Good way to get from seaside to hillside. Views are great, of course. This Teleferik is much more beautiful and nicer than the “Teleferik de Montjuïc” . The view, distance and height is much better . Nice little jaunt across the harbour with fantastic views over Barcelona  and the surrounding area. But you need to know that  is that there is only one Cable Car that takes people and should finish its round trip journey to pickup the next group of people.It is also  long queue and waiting time because there is only one cable car . People working there are not so  friendly. Price is good in comparison to the beauty of the view and the experience itself. Still a nice trip where you can enjoy  your eyes with the spectacular view for the city .", "publishedDate": "2019-07-17", "language": "en", "rating": 4}, {"id": 689308746, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d2328556-r689308746-Teleferico_del_Puerto-Barcelona_Catalonia.html", "text": "I took this as a day out with 2 adults and 1 minor. Tickets are 11 euros both adults and minors each. The ride was enjoyable and lasted not too long, nor too short. 6 mins and 41 secs one way. My only concerns were that it took forever for the next cable car to come and was pretty cramped. Also, at the Olympic stadium stop, at the start of the queue, Don't use electronics. The fan squirts water. the sort of visit is good for all the categories.", "publishedDate": "2019-07-13", "language": "en", "rating": 3}, {"id": 685199281, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d2328556-r685199281-Teleferico_del_Puerto-Barcelona_Catalonia.html", "text": "Good view, however cable car was quite cramped so didn’t really get the room to take pictures and we were in the middle of the cable car and didn’t get the opportunity to go to the window to look. However the glimpses we got were lovely. Very short trip, expensive for such a short trip ", "publishedDate": "2019-06-29", "language": "en", "rating": 3}, {"id": 684876726, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d2328556-r684876726-Teleferico_del_Puerto-Barcelona_Catalonia.html", "text": "We got off on the hop on hop off bus tour to ride the cable cars. 33 euro  return for two adults. From reading other reviews we were lucky with approx 30 minutes wait at either end.\n\nWas disappointing with the way so many were rammed into the car making views very limited, it was like a fight for the best spot haha. \n\nDoes not include the top track. ", "publishedDate": "2019-06-27", "language": "en", "rating": 4}, {"id": 683306268, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d2328556-r683306268-Teleferico_del_Puerto-Barcelona_Catalonia.html", "text": "My wife and I recently visited Barcelona, Spain for the first time. The Teleferico del Puerto was listed on Tripadvisor for Things To Do and we took their advice from the reviews. \n\nWe took the Metro down to the port area from where our hotel was and walked down to the beach and then to the Teleferico del Puerto Tower where the cable cars leave from. We purchased our two round trip tickets and waited for the elevator to go up to the waiting area. We had about a fifteen to twenty minute wait which was good. The cable cars are small and get filled up fast so my advice is to try and get a good window spot as soon as you get in... \n\nThe views from the cable car were amazing and the ride was fun. When we got to the other side of the line decided to visit the outdoor bar that had a great view of Barcelona...It is an excellent spot for an Estrella Damm, glass of wine, or SanGria ..\n.\n The Teleferico del Puerto was a great choice and we would both recommend it to anyone looking for some fantastic views of Barcelona, the skyline and its harbor...", "publishedDate": "2019-06-21", "language": "en", "rating": 5}, {"id": 683279972, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d2328556-r683279972-Teleferico_del_Puerto-Barcelona_Catalonia.html", "text": "Had to pay 16.50 for round trip. Waited for ages to get on, with very obviously bored staff and then when we got on were crammed in with 16 people. The ride was short and when we got to the other end we were forced off to wait in another queue that would’ve taken another 1.5 hours to get back on instead of staying on. Ruined our afternoon plans and was not worth that money, the other cable car on the mountain is far better", "publishedDate": "2019-06-21", "language": "en", "rating": 1}, {"id": 683035161, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d2328556-r683035161-Teleferico_del_Puerto-Barcelona_Catalonia.html", "text": "My wife and I recently visited Barcelona, Spain for the first stop on our vacation to Spain, Andorra, and France. I saw the Teleferico del Puerto listed on Tripadvisor for Things To Do and took their advice from the reviews.\n\nWe had taken the Metro down to the port area and walked down to the beach and then to the Tower where the cable cars leave from. We purchased our two round trip tickets and took the elevator up to the waiting area. We had about a twenty minute wait which was pretty good.\n\nThe cable cars are small and get filled up fast so my advice is to try and get a window spot as soon as you get in... The views from the cable car were amazing and the ride was fun. When we got to the other end we decided to visit the bar that had a great view of Barcelona...An excellent spot for an Estrella, glass of wine  or two....\n\nThe Teleferico del Puerto was a great choice and we would both recommend it to anyone looking for some fantastic views of Barcelona and its harbor...", "publishedDate": "2019-06-20", "language": "en", "rating": 5}, {"id": 677611044, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d2328556-r677611044-Teleferico_del_Puerto-Barcelona_Catalonia.html", "text": "There are just two gondolas in operation with 18 people going in and it takes 8 minutes for the next gondola to arrive, so about 135 people per hour. Count the number of people in the line before you to estimate your waiting time. Remember that once you get to the top of the tower you will find another 50 people waiting ahead of you.\n\nThe actual trip across takes 6 minutes and is nice, but for us not worth the 1.5 hour wait", "publishedDate": "2019-05-30", "language": "en", "rating": 2}, {"id": 676739687, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d2328556-r676739687-Teleferico_del_Puerto-Barcelona_Catalonia.html", "text": "Didn't realise that the cable cars were different companies, woman on till smiled as she said yes to all our questions she then gave us one way tickets instead of returns not impressed \nThe extra €5 would have meant we could have visited the other cable car company and had better views, this was a rivalry tactic to stop the other company getting our custom.\nStaff were ill mannered and impolite.", "publishedDate": "2019-05-27", "language": "en", "rating": 1}, {"id": 674667084, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d2328556-r674667084-Teleferico_del_Puerto-Barcelona_Catalonia.html", "text": "I was the last customer to be squeezed into cable car. The attendant came in behind and stood at the door looking at his phone . I am 5’ 3” and was surrounded by a group of men who stood all round the windows for the entire trip so I did not see  anything at all. Total waste of money .", "publishedDate": "2019-05-17", "language": "en", "rating": 2}, {"id": 669192734, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d2328556-r669192734-Teleferico_del_Puerto-Barcelona_Catalonia.html", "text": "We did this cable car trip across the harbour in Barcelona. The view was awesome including the La Sagrada Familia, but the queuing is sooooo slow and there is no cover if it starts to rain. Try if you have time, but not a must.", "publishedDate": "2019-04-25", "language": "en", "rating": 3}, {"id": 667977866, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d2328556-r667977866-Teleferico_del_Puerto-Barcelona_Catalonia.html", "text": "We queued here for about 45 minutes it was so slow we only had about 30 people in the queue but it seemed like the lady selling tickets was trying to persuade (at length) for people to book a return not a single and that’s why it seemed to take so long. She then seemed to get in an argument with one customer as we neared the kiosk and then she came out in a huff and announced it was closed due to high winds. (It was windy so could have been legitimately closed for safety reasons) however we thought the queuing process, hard sell and with our disappointment made the whole experience poor.", "publishedDate": "2019-04-20", "language": "en", "rating": 2}, {"id": 666765543, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d2328556-r666765543-Teleferico_del_Puerto-Barcelona_Catalonia.html", "text": "We got off here whilst on the bus city tour and decided to give it ago. \n\nIf you don't like small spaces, being close to strangers or heights i DON'T recommend this!!\n\nThe views were good. €11 per adult one way or return was €16.50 per adult. Once at one end of the cable trip there is a relaxing water fountain area however i'm insure what else there is to do or how to get back to the habour so would get the return journey. ", "publishedDate": "2019-04-15", "language": "en", "rating": 3}, {"id": 664739391, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d2328556-r664739391-Teleferico_del_Puerto-Barcelona_Catalonia.html", "text": "Don’t do it! Save yourself the time and just take the train to the park, and walk it take the gondola ride to the top there. I admit the views from this ride are nice, but in no way worth the time. It only has two stupid cars going back and forth, not like regular sky ride that runs in a circle. Either the designer was completely clueless or they thought this ride was not going to work. I do not recommend this at all, unless you have 2-3 hours of time to waste just getting back and forth from the park. Look at the pictures and skip the ride.", "publishedDate": "2019-04-08", "language": "en", "rating": 3}, {"id": 662548321, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d2328556-r662548321-Teleferico_del_Puerto-Barcelona_Catalonia.html", "text": "Wonderful way to get an overview (pun intended) of the city. We took off from Mirador on top of Mont Juic and rode down to the beach Sant Sebastian. Walk up the steps from Plaça Esanya to the museum, and the. Walk along through the Botanic Gardens to the Miro Foundation, and another walk to the station to go down to the beach, be aware that there are two teleferics — the other one goes from the Foundatin up to the Castle. These two do not connect, so be careful of the different signs.", "publishedDate": "2019-03-31", "language": "en", "rating": 4}, {"id": 660831819, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d2328556-r660831819-Teleferico_del_Puerto-Barcelona_Catalonia.html", "text": "So after walking a half hour here, we were met with a sign that there would be a 60 minute wait. We should have left, but didn't. Big mistake. It was closer to 90 minutes. The trip was OK. I guess 22E for 2 was OK. But we decided after that 20 minutes is the most we would wait. The line did seem shorter at the other end, at Montjuic, but still like 40 minutes. There are great views elsewhere, like Montjuic Castle or Tibidabo, for FAR less without any waits. Give it a miss.", "publishedDate": "2019-03-24", "language": "en", "rating": 1}, {"id": 659684797, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d2328556-r659684797-Teleferico_del_Puerto-Barcelona_Catalonia.html", "text": "No idea why so many people have moaned about this. They must want the moon on a stick...\nWe did one way trip for 11€ each (a bit pricey, but it’s a one-off, I wouldn’t do it again) caught the metro to Paral-ell station, then was going to catch the furnicular, but it was not in operation, there was a replacement bus service though which was brilliantly signposted. Got off the bus just up the road from the hotel miramar, walked back down and caught the cable car. No drama, no queue, and I couldn’t care less whether the staff were smiley or not... 🙄😂 There was only about 8 people in our car, which was good, managed to get some great pictures. ", "publishedDate": "2019-03-19", "language": "en", "rating": 4}, {"id": 658104016, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d2328556-r658104016-Teleferico_del_Puerto-Barcelona_Catalonia.html", "text": "It took us two goes to try and get on these cable cars, the first day we were turned away after waiting for 15 minutes with no explanation given, just that there was a problem but there was still people in front of us who got on. The second time we waited about 45 minutes and then we were disappointed that we couldn’t get good pictures as the cars were crammed of people and we were stuck in the middle. The views were good from what we seen and it was a good way to get up to Montjuïc. The views at the top when you get off the cable car are fantastic though! ", "publishedDate": "2019-03-12", "language": "en", "rating": 3}, {"id": 657110400, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d2328556-r657110400-Teleferico_del_Puerto-Barcelona_Catalonia.html", "text": "Whilst the cable car is perfectly safe, people do move around to take photographs from different angles so it might not feel right for the faint hearted, but I absolutely loved it. Took the car from the port, the other station was out of order, no queues, great views over the port to all the super yachts, beach and city, you are better just getting a one way ticket rather than a return.", "publishedDate": "2019-03-07", "language": "en", "rating": 5}, {"id": 656516218, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d2328556-r656516218-Teleferico_del_Puerto-Barcelona_Catalonia.html", "text": "We caught this from Montjuic (land) side.  You can see straight away that it is low capacity - there are only two cars and capacity is 15-16 people.\n\nAt point of sale we were warned that it was 40 mins wait at either side so we though we knew what we were in for.\n\nOn the plus point, the outbound wait was probably less than 30 mins - the queue was from the top of the steps only.\n\nThe return from the harbour side was awful. There is no separate ticket holder queue so you are in one queue behind people buying tickets. We entered the queue and noticed a “60 mins wait from here” but the back of the queue was not as far as the sign so believed we only had around 40 mins.  It took 105 mins.\n\nCompletely detracts from the experience. I guess it also means if you aim for the last crossing at 18:50 you’ll need to leave 2 hours spare. Again when we got back the queue at the land side was still quite short.", "publishedDate": "2019-03-05", "language": "en", "rating": 3}, {"id": 655752149, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d2328556-r655752149-Teleferico_del_Puerto-Barcelona_Catalonia.html", "text": "The view it's great, but it get's crowded in so you don't get to look 360°. And the waiting time it's way too long.", "publishedDate": "2019-03-01", "language": "en", "rating": 3}, {"id": 651490043, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d2328556-r651490043-Teleferico_del_Puerto-Barcelona_Catalonia.html", "text": "We took the cable car down after lunch. It wasn't too packed and we were able to find a nice place for ourselves to view. The ride is wonderful and well worth the 11 Euros per person. The views are amazing as you keep coming down. When we arrived at the harbour area we saw massive queues of people waiting to go up.", "publishedDate": "2019-02-11", "language": "en", "rating": 4}, {"id": 650573822, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d2328556-r650573822-Teleferico_del_Puerto-Barcelona_Catalonia.html", "text": "My wife and I took the cable car ride from the Hotel Miramar down to the harbor area.  Smooth ride & great views of the city and waterfront for a relatively good price.  We couldn't get off at the harbor area due to maintenance issues with the system so it was a round trip.  But, we would still recommend it.", "publishedDate": "2019-02-06", "language": "en", "rating": 5}, {"id": 647642386, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d2328556-r647642386-Teleferico_del_Puerto-Barcelona_Catalonia.html", "text": "I read mix reviews about this so was in two minds about going, I glad I went. It cost 16 euros for a return trip, children under 7 were free. The lift ride up to the cable carts was great, the view was great and a sneak preview of what to expect.\n\nThe cable carts was fully, there was no seats, I spent my time looking out the window, so forgot about that, the return trip, the carts was empty so no complaints.\n\nThe views are amazing, if would defo recommend doing this, money well spent.", "publishedDate": "2019-01-22", "language": "en", "rating": 5}, {"id": 645503766, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d2328556-r645503766-Teleferico_del_Puerto-Barcelona_Catalonia.html", "text": "We queued for ages to buy the tickets, ages to get in the one lift and then ages to get on the actual gondola. Then crammed in and the journey was over in 5 minutes. Simply not worth it. Views were good but can be seen from various viewing points without going on the cable car. ", "publishedDate": "2019-01-13", "language": "en", "rating": 2}, {"id": 644370170, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d2328556-r644370170-Teleferico_del_Puerto-Barcelona_Catalonia.html", "text": "We decided to take this cable car from Montjuic to the port. We parked at MNAC which was free & it was 20 min walk. Not well signed & initially we arrived at the Teleferico de Montjuïc which takes you to the castle! We eventually found the port cable car in front of Miramar hotel. We had coffee in the Miramar cafe overlooking the port & caught the cable car. We had no queue & it was an amazing trip. It took 7mins then there was a lift down to Barceloneta Beach. The return journey was as spectacular. ", "publishedDate": "2019-01-07", "language": "en", "rating": 4}, {"id": 635988603, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d2328556-r635988603-Teleferico_del_Puerto-Barcelona_Catalonia.html", "text": "This is one of two gondolas which can take you over to Montjuic. It gives you really good views over the harbour and the city as you go over the water. However be aware it does not take you all the way up to the fort, unlike the other gondola. Once you get off by the Miramar hotel you have to walk up the hill for 20 minutes maybe half an hour stroll. I would say for the price of a return being around 16 euros it's expensive.", "publishedDate": "2018-11-27", "language": "en", "rating": 3}, {"id": 631694227, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d2328556-r631694227-Teleferico_del_Puerto-Barcelona_Catalonia.html", "text": "We took a ride on the Teleferico and really enjoyed the views of Barcelona.  It's a great way to get some super photos of the city.  Avoid the dumpy restaurant when you get off at Montjuic.  We then walked up to the castle and enjoyed that area.", "publishedDate": "2018-11-07", "language": "en", "rating": 5}, {"id": 630695464, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d2328556-r630695464-Teleferico_del_Puerto-Barcelona_Catalonia.html", "text": "We had to queue for 2 hours to get up in the tower. When you get up in the tower you have to queue again for 30min to get up in a cramped cable car where the ride is for 2min. Then you get to the other end where is another ever bigger queue for 2hours to get back!!!! Absolutely ridiculous. \nWe did not even try to get back even though we got the return ticket. Do not do it. \nGo to that nice cafe with a taxi, enjoy the view from there and get back to city centre with a taxi again. Very unorganized and a disappointment.", "publishedDate": "2018-11-04", "language": "en", "rating": 1}, {"id": 629894107, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d2328556-r629894107-Teleferico_del_Puerto-Barcelona_Catalonia.html", "text": "Teleferico Del Puerto is the wonderful cable car that brings you over the wonderful port and harbour area of Barcelona and although it's old and slow and in my opinion vastly overrated , for a one of treat and if it's your first visit to this most vibrant of cities it's probably worth a ride but with waiting times of up to an hour and a half I don't think it's personally worth the effort.\nIf your in the port and harbour area of Barcelona it's nice looking up at the old cable cars passing overhead and the views afforded from the cable cars are awesome. \nIf you have the patience, time and money to waste it's well worth checking out but I've rode them once and that was enough for me.", "publishedDate": "2018-10-31", "language": "en", "rating": 5}, {"id": 629726268, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d2328556-r629726268-Teleferico_del_Puerto-Barcelona_Catalonia.html", "text": "Luckily we just made it in the line at 4pm although they say they close at 5.30pm. Heaps of people were turned away.\nWe waited over an hour to even reach the top to board the cable car.\nNo communication along the way to tell you anything so you just wait in line.\nReally wish we hadn’t wasted our time. \nOk you can see a view of the city but it’s over in a few minutes and you land at a place with not much direction so you have no clue where you are going.\nSpain’s customers service is shocking. Don’t waste your time or money!!", "publishedDate": "2018-10-30", "language": "en", "rating": 2}, {"id": 628050703, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d2328556-r628050703-Teleferico_del_Puerto-Barcelona_Catalonia.html", "text": "Don’t get me wrong, the views are nice. But queues for an hour for a 10 minute ride (we’d already paid for a return ticket) wasn’t fun or really worth it. ", "publishedDate": "2018-10-25", "language": "en", "rating": 2}, {"id": 627505334, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d2328556-r627505334-Teleferico_del_Puerto-Barcelona_Catalonia.html", "text": "We waited over 1h30 in line (not that many people but the cable cars are super old and slow). It is highly over priced and not worth the time wasted that you could use touring Barcelona. Nice views you can get from Montjuic itself. No need to waste hours on this. Do not come.", "publishedDate": "2018-10-23", "language": "en", "rating": 1}, {"id": 626700780, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d2328556-r626700780-Teleferico_del_Puerto-Barcelona_Catalonia.html", "text": "After the beach we needed a short cut to the other side of the harbour. It was about 3pm and the queue was pretty long. We were told it would take 30 mins. It didn’t.\n\nGood views of the harbour but if we’d known it would take more than an hour and a half, for what was essentially a 5 minute ride costing €11 each. We probably wouldn’t have bothered. \n\nAlso; bear in mind during that time you’ll be waiting completely in the sun because there’s no shade until you reach the lift. So not a very good experience overall. \n\nIain, London", "publishedDate": "2018-10-20", "language": "en", "rating": 2}, {"id": 626562403, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d2328556-r626562403-Teleferico_del_Puerto-Barcelona_Catalonia.html", "text": "The cable car runs between and the cliff top areas at Montjuïc adjacent to the Miramar Hotel, and the beach area at Port Vell. \n\nAt the Miramar end, there is an open air café / bar beside the cable car station which provides stunning views over the city and the port, whilst the cable car ride itself takes you high over the harbour area where you can look inland over the city, or out to sea for many a mile.\n\nIt's great fun and well worth doing.", "publishedDate": "2018-10-19", "language": "en", "rating": 4}, {"id": 625426589, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d2328556-r625426589-Teleferico_del_Puerto-Barcelona_Catalonia.html", "text": "We were lucky with the timing of our cable car trip in that we had little wait time on the outward leg and not too long no on return journey, it being a Sunday late morning in early October. For €16 each you get some great views but the car with 16 passengers is a bit on the tight side, and the trip is very short for the money one pays. No regrets taking the trip, it was something we always wanted to do, once.", "publishedDate": "2018-10-16", "language": "en", "rating": 3}, {"id": 622659504, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d2328556-r622659504-Teleferico_del_Puerto-Barcelona_Catalonia.html", "text": "This cable car runs between Barceloneta and Montjuic (finishing near the Miramar hotel). There are great views across the city.", "publishedDate": "2018-10-06", "language": "en", "rating": 4}, {"id": 621353981, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d2328556-r621353981-Teleferico_del_Puerto-Barcelona_Catalonia.html", "text": "This system runs from Barceloneta Beach Marina area (head in the direction towards the huge lobster and the 50' tall modern art head in red, yellow and blue) to Montjuic.  It crosses above the harbor and exends about .8 of a mile.  The ride takes about 10 minutes.\n\nIt is called by several names, depending upon one's native language.  These names are:\n(1) Tromsborador Aeri del Port\n(2) Teleferic del Port\n(3) Telefrerico del Porto (this review)\n(4) Port Vell Aerisl Tramway\n\nThere is a very convenient stop right in the middle of Port Vell but it is closed right now.  It's name is Jaume I.  No one seems to know when it will open.  \n\nPlan on spending about $16.30 EU for a round trip ticket.  Go to Tower Saint Sebastian to ride it from its Barceloneta Beach point all the way to Montjuic's Miramar Gardens.\n\nDo not mistake this 1929 cable car system with the second (1970) system called Teleferic de Montjuic (Montjuic Cable Car) which does not cross the marina/harbor and only runs from the base to the top of Montjuic.  Completely different.", "publishedDate": "2018-10-02", "language": "en", "rating": 5}, {"id": 620372644, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d2328556-r620372644-Teleferico_del_Puerto-Barcelona_Catalonia.html", "text": "We rode the cable cars earlier this week. It was around €11 each one way. We didn’t have a lot of queuing time before getting the lift but there was quite a long queue at the top of the tower. The actual cable car was a good experience however, they pack quite a lot of people in. We were lucky enough to be able to stand by the window and have a really good view but other people were stuck in the middle of the car. The views are absolutely stunning though. We were pleased we just got a one way ticket as it was a pleasant walk back.", "publishedDate": "2018-09-28", "language": "en", "rating": 3}, {"id": 620115772, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d2328556-r620115772-Teleferico_del_Puerto-Barcelona_Catalonia.html", "text": "Jumped on this for a lift from the hill to beach ( 11€ one-way ) . Waited about 10 minutes before embarking with 11 others and had plenty of room to change views ( loved the little surprise in the middle ) . A unique experience with great views ", "publishedDate": "2018-09-27", "language": "en", "rating": 5}, {"id": 618795759, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d2328556-r618795759-Teleferico_del_Puerto-Barcelona_Catalonia.html", "text": "I had seen these cable cars that go to Montjuïc from the port on previous trips but never had the opportunity. This trip we made a point of going. We got to the port and as we were not sure where to go we hailed a pedi- cab and he took us right there. It costs 11e for a one way ticket and the ride takes less than 10 minutes. Yes they do cram about 10 people into each car but you do get a great 360 view of Barcelona and the harbour. I was happy to take this trip.", "publishedDate": "2018-09-23", "language": "en", "rating": 4}, {"id": 608490906, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d2328556-r608490906-Teleferico_del_Puerto-Barcelona_Catalonia.html", "text": "When you first buy your ticket, there is a placard which says, “20 minutes wait.” This is an absolute falsehood. The wait is 20 minutes from the ticket booth until the elevator and another 30 minute wait once you have gone up the elevator. There is one seat in the tram and they cram on people. This is definitely not worth the money or the view. If you want to see a view, go to their awful restaurant bar and stand just outside the entrance on their terrace. I assure you, the drinks are moderately priced and the cheapest quality alcohol and the food is even worse so don’t make the mistake of getting a table.", "publishedDate": "2018-08-20", "language": "en", "rating": 1}, {"id": 607483919, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d2328556-r607483919-Teleferico_del_Puerto-Barcelona_Catalonia.html", "text": "If you are staying near La Rambla and want to visit the beach at Barceloneta then this is a perfect way to get there. \n\nStarting at the Miramar hotel, you have the amazing views from the mountain. After a wait for one of the two cable cars it’s time to drift out over the mountainside and into the air. \n\nThe breath you have will be taken away by the stunning views you experience on your trip out over Port Vell. \n\nIt would be better if there were less people in the car making it easier to take pictures. \n\nPrices were a little steep at 11€ one way and 16€ return but this is comparable to a taxi from your hotel to the beachfront. \n\nIt’s a ride that HAS to be experienced", "publishedDate": "2018-08-17", "language": "en", "rating": 4}, {"id": 602642393, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d2328556-r602642393-Teleferico_del_Puerto-Barcelona_Catalonia.html", "text": "Nice experience with an enjoyable ride. The wait can be a bit testing. The views are spectacular and well worth the wait. ", "publishedDate": "2018-08-04", "language": "en", "rating": 5}, {"id": 602097804, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d2328556-r602097804-Teleferico_del_Puerto-Barcelona_Catalonia.html", "text": "We did not take the car from the Castle but from the Hotel Miramar.   We had a little challenge finding the cable car.   It's located near the Hotel Miramar and goes down to the port.", "publishedDate": "2018-08-02", "language": "en", "rating": 5}, {"id": 601393026, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d2328556-r601393026-Teleferico_del_Puerto-Barcelona_Catalonia.html", "text": "Waited in the queue for around 30 minutes so wasn't too bad and they have cold air fans in the line as well as umbrellas for shade. Cost 11euros per person single journey to Montjuic hill. The ticket is only for that journey so if you then wanted to take the cable car to Montjuic Fort, that is another 12euros so expensive. Ride only took around 7 minutes but was great fun and a good view across the harbour. If you are afraid of heights, don't take this ride.", "publishedDate": "2018-07-31", "language": "en", "rating": 3}, {"id": 599944829, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d2328556-r599944829-Teleferico_del_Puerto-Barcelona_Catalonia.html", "text": "We took a one way ticket on the Teleferico & enjoyed it very much. We unfortunately had to wait in full sun (+ 32gr) \nfor more than 1 hour to get on. Fans & umbrellas are foreseen to make waiting easier. Being 8 months pregnant, I was happy I could sit in the shadow while my partner waited in line. ", "publishedDate": "2018-07-26", "language": "en", "rating": 4}, {"id": 593918981, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d2328556-r593918981-Teleferico_del_Puerto-Barcelona_Catalonia.html", "text": "The positive it was that it was a beautiful view, and while waiting in line they provide umbrellas and fans with water mist so it wasn't too unpleasant.  The downside is that the wait was long. The line looks short but after you go up in the elevator there is another long line upstairs. Also they pack you in like sardines which is kind of uncomfortable for the view. There are bathrooms both at the bottom and at the top which is convenient for traveling with families. We happened to be in the area so we went, but I wouldn't necessarily go out of my way to do this activity.", "publishedDate": "2018-07-07", "language": "en", "rating": 3}, {"id": 591885949, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d2328556-r591885949-Teleferico_del_Puerto-Barcelona_Catalonia.html", "text": "Great view of the harbor but way too many people squeezed into one car. If you aren’t by a window you can’t see a thing. I spent my time staring at a mans hairy arm that was blocking my view.", "publishedDate": "2018-06-30", "language": "en", "rating": 2}, {"id": 591690942, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d2328556-r591690942-Teleferico_del_Puerto-Barcelona_Catalonia.html", "text": "We walked up to the top where the Motel/Restaurant was, it's a good walk up there from the City, lost count of the steps but it was worth it.\nWe bought our One Way tickets for €11, the ride was a good one, the view from up there is great, you really do get to see the full harbour.\nIt also lets you off very close to the beach, so you can take that gear with you.\nIt's a fun ride.", "publishedDate": "2018-06-29", "language": "en", "rating": 5}, {"id": 590177647, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d2328556-r590177647-Teleferico_del_Puerto-Barcelona_Catalonia.html", "text": "You can see this attraction from just about everywhere when near the sea.  We decided to take it one way back to the beach after a day of exploring the Olympic Venue area on the mountain.  It is a cable car.  We waited about 45 minutes.  It cost us 22 Euro for 2 people, one way.  The views are stunning.  The do tend to pack the car.  There is no commentary.  It is old.  I am glad we got to experience this attraction.  It is a great way to get back and forth.  It is a mode of transportation with a great view.", "publishedDate": "2018-06-24", "language": "en", "rating": 3}, {"id": 588511125, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d2328556-r588511125-Teleferico_del_Puerto-Barcelona_Catalonia.html", "text": "I'm a bit surprised that people get quite upset about this attraction, its actually just a mode of transport - not Disneyland.\n\nWe arrived early, no queue. It is clear where you are going, ie halfway up Montjuïc, you get a great view of the harbour/port where the cruise ships and mega yachts are berthed. Ehhh thats it.\n\nIts not cheap, but its ok.", "publishedDate": "2018-06-18", "language": "en", "rating": 3}, {"id": 586833494, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d2328556-r586833494-Teleferico_del_Puerto-Barcelona_Catalonia.html", "text": "Bought a round trip on impulse on our way to the harbour, and were not aware that the ticket will only take you half way up to Montjuïc. You have to buy a new ticket to the cable cars that will take you to the castle. I see from other reviews that we are not the first to make this mistake, and better info would have spared us the disappointment. We tried to get some info from the staff, but they were just terrible unfriendly. The woman in ticked booth did not even care to look up from her paper when we approched her. If you do know that cable cars will not take you to the top, chances are that you will be disappointed anyway. Cars are cramped, and if you end up in the middle, you won’t be able to enjoy the EUR 16.95 view  through dirty windows anyway. ", "publishedDate": "2018-06-11", "language": "en", "rating": 1}, {"id": 584301723, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d2328556-r584301723-Teleferico_del_Puerto-Barcelona_Catalonia.html", "text": "We had to wait a long time and although the view was good I would not recommend it. you get the same view if you climb the hill by foot which is a nice walk or by taxi which is for sure much cheaper. Staff is not very friendly either.", "publishedDate": "2018-06-01", "language": "en", "rating": 3}, {"id": 583714304, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d2328556-r583714304-Teleferico_del_Puerto-Barcelona_Catalonia.html", "text": "A bargain we felt at €11 to go across from the port to a mid point on Montjuic. We got there around 10.45/11 and the queue was reasonable. We waited maybe 20minutes to ride. The cable car itself is much steadier than I had thought it might and has amazing views over the harbour and beach. The ride takes about 10minutes. There are toilets are both end and a cafe bar at the mountain end too. I've read about people complaining about long waits but earlier in the morning (and a Sunday morning) seemed like a good time to go.", "publishedDate": "2018-05-29", "language": "en", "rating": 5}, {"id": 581386184, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d2328556-r581386184-Teleferico_del_Puerto-Barcelona_Catalonia.html", "text": "I am very glad i took this trip. The weather was nice and the time I traveled (May) made it not so crowded. A wonderful view of the city of Barcelona and a nice walk down from the hill afterwards. \nPlease note that there are several cable cars that run from different locations. This, with this view, is called Teleferico del Puerto", "publishedDate": "2018-05-20", "language": "en", "rating": 5}, {"id": 580596003, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d2328556-r580596003-Teleferico_del_Puerto-Barcelona_Catalonia.html", "text": "The rudeness of the staff was considerable – not one of them were in any way friendly, mannerly but were rude, disinterested and lacked any basic customer service skills.  The lady in the booth selling the tickets was disinterested as she was on a personal call making me wait. The staff checking tickets were sullen and abrupt.  I was sitting on a bench busy putting a new plaster on my blister and one of the staff scolded me like a child for having my foot on the bench (!) so when I got up (only I was finished!) three staff members sat down for a chat! \nIt cost €16.50 for a short return journey in an overly cramped cable car.  The wait in the queue was painfully slow.  If you have the misfortune to be wedged in the middle you have an obstructed view over people. I was on the right hand side going over, so I wanted to go on the left hand side on the return journey but couldn’t as it was so packed (so I saw the same view twice!). Wouldn’t recommend it.  \nInstead I would recommend you enjoy the walk to the top and go to the restaurant located beside the cable car to enjoy the most fantastic views of Barcelona!", "publishedDate": "2018-05-16", "language": "en", "rating": 2}, {"id": 579931506, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d2328556-r579931506-Teleferico_del_Puerto-Barcelona_Catalonia.html", "text": "The whole process of getting on the cable car at the bottom(Marina) took at least an hour and a half. It was painful. By then the weather changed so it was cold, wet , windy and we lost the view!", "publishedDate": "2018-05-13", "language": "en", "rating": 1}, {"id": 579467140, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d2328556-r579467140-Teleferico_del_Puerto-Barcelona_Catalonia.html", "text": "My wife and I recently enjoyed used the cable car system whilst on a long weekend trip to Barcelona. We had purchased tickets with one of the hop on/hop off sightseeing bus companies, and caught the bus up to the Miramar Hotel, where we alighted. We then got the cable car across to the port, where we wandered along the beach and enjoyed a spot of lunch. We then returned to the cable car system and travelled back across to the Miramar, where we caught the next sightseeing bus. \nWe enjoyed the cables car journeys in both directions, which offered great views of the port area of the City.   \nThe staff were friendly enough, and the prices were reasonable in our opinion. When we made our first journey across to the port it was mid morning, and fairly quiet, although the return journey was quite busy, and we had to wait a little while. In general though, a good experience which my wife and I enjoyed and would recommend as part of the sightseeing bus journeys.", "publishedDate": "2018-05-11", "language": "en", "rating": 4}, {"id": 577486222, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d2328556-r577486222-Teleferico_del_Puerto-Barcelona_Catalonia.html", "text": "Took the cable car from the marine side. After seeing the queue and the sign warning for the wait time we were about to change our minds. But this was what we had planned to start our journey that day which would continue with visiting Park de Montjuic and since we were already there, we just got on it (well... after an hour of wait). The view is nothing spectacular, I actually think it’s much better from Montjuic! €11 for a very short ride and wasted one hour, not worth it! ", "publishedDate": "2018-05-02", "language": "en", "rating": 2}, {"id": 574472513, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d2328556-r574472513-Teleferico_del_Puerto-Barcelona_Catalonia.html", "text": "We visited early April 18. Family of four including a 15 year old and an 11 year old. We were there relatively early (around 11:20) so there was no queue whatsoever. Tickets are €11 each; no concessions. The lady on the ticket counter was grumpy but we got our tickets okay. We waited about 5 minutes for the next car and boarded with those that had formed a queue behind us. The views are amazing over Barcelona and the port. The car was a bit rickety and there was only one seat - but as the ride is only around 10 mins total that was okay. At the beach end it terminates at the top of a tower and you get a lift down to the roadside. We waited a few minutes for the lift as one (of two) were out of order. We really enjoyed it but wouldn’t queue for too long for it...", "publishedDate": "2018-04-19", "language": "en", "rating": 4}, {"id": 573464998, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d2328556-r573464998-Teleferico_del_Puerto-Barcelona_Catalonia.html", "text": "Everything is bad. \nThe frequency of the cable car is a joke. \nThe route is small.\nYou have to wait a long time and then it’s rapidly over.\n", "publishedDate": "2018-04-15", "language": "en", "rating": 1}, {"id": 569447112, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d2328556-r569447112-Teleferico_del_Puerto-Barcelona_Catalonia.html", "text": "We queued for 1 hour for this, on the marina side, there were signs saying it would be this long, so no problem here. The lady at the ticket desk was friendly, all other staff were looking bored, the female staff member in our carriage plugged herself into her music, none of them interacted with the visitors even to say hello or thank you and made the whole experience less special. \n\nOn the upper level waiting to board the views would have been nice but the windows were dirty. \n\nOnce on board the ride is quite short, but good views across Barcelona. At the mountain end there was a very small queue, so would recommend starting the ride there (next to the metro station) rather than at the marina. ", "publishedDate": "2018-03-29", "language": "en", "rating": 2}, {"id": 567945791, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d2328556-r567945791-Teleferico_del_Puerto-Barcelona_Catalonia.html", "text": "Did the cable car today from harbour district up to hill. It gave good views, was clean and smooth. I would not say it’s a must do and if budget concerns you, give it a miss. But when a tourist with things to do it’s OK", "publishedDate": "2018-03-21", "language": "en", "rating": 3}, {"id": 564508381, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d2328556-r564508381-Teleferico_del_Puerto-Barcelona_Catalonia.html", "text": "Standing in line for over 1,5 h in February when it was not even too busy... Only 8 person fit into the little elevator bringing passengers up, and 12 into the gondola itself. so it takes tome. The view over the harbor is very nice indeed, but the ride only lasts for 5 Minutes. The vies is similar from the destination anyways, so one could just go up there by bus and enjoy the vies instead of standing in line for so long.", "publishedDate": "2018-03-04", "language": "en", "rating": 2}, {"id": 560154792, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d2328556-r560154792-Teleferico_del_Puerto-Barcelona_Catalonia.html", "text": "Have been here several time before, though on this occasion I came with my youngest who was desperate to go on the cable car. From past experiences I used my knowledge and decided to travel one way rather than return from the mountain side of the cable car to the beach side. \nSo we walked along by the column down by Las Ramblas and followed the street along ( you can see the cable car above) then you are able to walk up alongside what looks like a park- then you start climbing the steps- even if you get a little bit out of breath like me trust me it’s still worth it- I found that getting on the cable car from the mountain side end was better as less queues (because if you choose to get on from the other end you face a lengthy wait, first at the bottom, then after you’ve gone up in the lift) so my advice- one way from mountain side end, less queues :) ", "publishedDate": "2018-02-12", "language": "en", "rating": 5}, {"id": 559592119, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d2328556-r559592119-Teleferico_del_Puerto-Barcelona_Catalonia.html", "text": "We enjoyed this short trip for 9€ to the Olympic center. We had an amazing weather and so the view was memorable. If you have a good weather, please try this trip. We have been the fifth time in Barcelona, but we never got time for this. For sure we will do it again because it gives you a different view to this amazing city.", "publishedDate": "2018-02-10", "language": "en", "rating": 4}, {"id": 559056635, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d2328556-r559056635-Teleferico_del_Puerto-Barcelona_Catalonia.html", "text": "A very nice view of the city, harbour and ramblas. A ticket is €11 one way and retour €16,50. Go see this! ", "publishedDate": "2018-02-07", "language": "en", "rating": 5}, {"id": 558075889, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d2328556-r558075889-Teleferico_del_Puerto-Barcelona_Catalonia.html", "text": "I was expecting a lot from this ride (especially for this price), but unfortunately it did not meet my expectations. First of all, the cabin was uncomfortable, crowded and old. Secondly, the view is not that impressive. And finally, as I said, it costs too much. I would suggest to go to Teleferico de Montjuic instead, as it is cheaper, the cabin is nice and comfortable, chances are you will be alone in the cabin and the views are much, much better.", "publishedDate": "2018-02-03", "language": "en", "rating": 2}, {"id": 555752548, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d2328556-r555752548-Teleferico_del_Puerto-Barcelona_Catalonia.html", "text": "No doubt this attraction gives you fantastic views of Barcelona taking you over the harbour area but to many on the small car lessens the experience as you get to feel like a sardine and is vastly overpriced The cable car only takes you half way up to Montjuic castle ,we and many others thought it took you to the top    ", "publishedDate": "2018-01-22", "language": "en", "rating": 3}, {"id": 555361725, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d2328556-r555361725-Teleferico_del_Puerto-Barcelona_Catalonia.html", "text": "Visited in january 2018 - only queued for about 20 minutes to get onto the cable car. I imagine in summer the queues are huge. viewing platform at top of lift to cable car itself is a spectacle. views of the whole of Barcelona including the beach, sagrada familia, montjuïc etc. cable car ride itself is fairly short however for 11 euros one way to montjuïc i definitely recommend this attraction. when you arrive at the cable car station at montjuïc, bare in mind that the walk to the Castell de Montjuïc is all uphill for approximately 30 minutes. if you dont fancy the walk, you can instead take another cable car or the bus to the top.", "publishedDate": "2018-01-22", "language": "en", "rating": 4}, {"id": 554826555, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d2328556-r554826555-Teleferico_del_Puerto-Barcelona_Catalonia.html", "text": "We took the cable car from port to the Montjuic park. You can also go just to the top of the tower in the port for 5 eur. The views from here are fantastic, I would say best in Barcelona. The ride itself is also very good, it takes about 5 or 10 minutes, you'll wish it could take longer.", "publishedDate": "2018-01-19", "language": "en", "rating": 5}, {"id": 548335726, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d2328556-r548335726-Teleferico_del_Puerto-Barcelona_Catalonia.html", "text": "The walk from the old port to the funicular is not special. There is a bus stop near the tower for those who don't like to walk. They open late, at 11 am, but start selling tickets at 10.45. You need to be lucky with the number of people inside a car. A great experience on a clear day.", "publishedDate": "2017-12-20", "language": "en", "rating": 4}, {"id": 539021931, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d2328556-r539021931-Teleferico_del_Puerto-Barcelona_Catalonia.html", "text": "The teleférico a traditional atraction of Barcelona moves you from the Montjuich hill to the port front and viceversa. the ticket is 11 Euros single trip and gives you the possibility to see the port from the top and a wonderful view of Barcelona.", "publishedDate": "2017-11-07", "language": "en", "rating": 5}, {"id": 537460487, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d2328556-r537460487-Teleferico_del_Puerto-Barcelona_Catalonia.html", "text": "Telefèric del Puerto is a cable car that runs from a high tower in la Barceloneta to Mountjuïc (or vice versa), across the harbor of Barcelona. The wait is apparently always long, and the price might be a bit overkill for such a short ride, but the view really is exceptional. Unless you need to get back, a one way ride is enough.", "publishedDate": "2017-10-31", "language": "en", "rating": 3}, {"id": 535274881, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d2328556-r535274881-Teleferico_del_Puerto-Barcelona_Catalonia.html", "text": "A great way to see a different view of Barcelona and the port only a short cable car ride but worth it for the views it was great to see the size of the cruise ships from above ", "publishedDate": "2017-10-22", "language": "en", "rating": 5}, {"id": 534835243, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d2328556-r534835243-Teleferico_del_Puerto-Barcelona_Catalonia.html", "text": "Long wait for tickets, crowded cable car, over 16 euros for two five minute rides. There are better ways to get to Mount Juic.", "publishedDate": "2017-10-21", "language": "en", "rating": 2}, {"id": 534774082, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d2328556-r534774082-Teleferico_del_Puerto-Barcelona_Catalonia.html", "text": "I purchased a return ticket from Montjuic for €16.50 and headed down to wait for the cable car\n\nThere were approx 10 of us so the car was not cramped and gave us the chance to turn around and get a good view of the city from above\n\nIt took around 5/10 mins to reach the tower just above the beach\n\nOnce there I got off and went down to have a look round the beach before heading back up\n\nAt this point I was met with around 40-50 people in the queue and had to wait around 30 mins before I was able to get on the cable car\n\n4 stars given due to time having to queue and also when we went on the cable car from the beach back to Montjuic it was cramped with 15-18 people so barely any space to move around\n\nIf you are wanting to do a single trip I’d recommend starting off at Montjuic as you get some spectacular views of the city from there and the cable cars seem to be quieter aswell", "publishedDate": "2017-10-21", "language": "en", "rating": 4}, {"id": 528617390, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d2328556-r528617390-Teleferico_del_Puerto-Barcelona_Catalonia.html", "text": "Some reviews say all different things about this.  We took it 1-way from the port to the hill.  Line for ticket was 30min.  Line for elevator was 10min.  Once at the top, line for gondola was 30min.  At top you have great views while waiting for gondola.  Gondola itself has one small bench for elderly and children, the rest is standing room.  Total trip is 5-10min, 360° views, many places to hold on if nervous.  Restaurant on hilltop-side is tourist trap, but there are many 10min walk down the hill that are better.", "publishedDate": "2017-09-30", "language": "en", "rating": 4}, {"id": 528021056, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d2328556-r528021056-Teleferico_del_Puerto-Barcelona_Catalonia.html", "text": "Was really excited to do this given the spectacular views you can imagine you’d see. Sadly they cram 16-18 people into a car that can only really hold 8 comfortably. As we were the last people to board the car we were stuck in the middle with nothing put other people’s backs and backpacks to look ok at.\n\nAwful. Would not recommend. ", "publishedDate": "2017-09-28", "language": "en", "rating": 1}, {"id": 528020835, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d2328556-r528020835-Teleferico_del_Puerto-Barcelona_Catalonia.html", "text": "After we quoted in the heat for ages, we were the last people on the cart. \nThey crap 16 people on and you do not have any room to move. The views we were expecting we didn’t get to see as it was 3 people deep. \nWe left very disappointed. ", "publishedDate": "2017-09-28", "language": "en", "rating": 1}, {"id": 526821774, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d2328556-r526821774-Teleferico_del_Puerto-Barcelona_Catalonia.html", "text": "Didn't take a trip on this cable car last time we were in Barcelona so this had to be on the list of things to do this time round and what stunning views there were too.\nOnly a short queue and as they only take about 17 people in each gondola we had about a 15 minutes wait to get aboard.\nBrilliant views of the city and harbour.\nDon't make the same mistake as we did and think you could access it from Port Vell shopping and dining complex....you need to walk round the marina. Also queues from the castle side are no existent so may want to take that route at busy times of year.", "publishedDate": "2017-09-23", "language": "en", "rating": 5}, {"id": 526710217, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d2328556-r526710217-Teleferico_del_Puerto-Barcelona_Catalonia.html", "text": "We travelled from the Port to Miramar on a beautiful sunny day and got some amazing views of the city. Although the funicular is quite old and creaky it was a great trip. It is standing room only in the cabin but not too cramped with sufficient space to move about. The 'bounce as you go over the central tower is one to watch for..........\nExcellent value for money and certainly saved us a walk uphill.'", "publishedDate": "2017-09-23", "language": "en", "rating": 4}, {"id": 524284131, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d2328556-r524284131-Teleferico_del_Puerto-Barcelona_Catalonia.html", "text": "Can't fault the views over the port but didn't enjoy the experience too much, as it was standing only and very crowded, such that you felt like cattle.", "publishedDate": "2017-09-14", "language": "en", "rating": 3}, {"id": 521350070, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d2328556-r521350070-Teleferico_del_Puerto-Barcelona_Catalonia.html", "text": "You really must do this to get great views of the City and port area.\nAt the top end there are a few things to do and see and some good viewing platforms.\nOn the cable car the views are amazing.\nAt the port end is the beach area which is gorgeous. Lots of bars and restaurants and other good stuff to do and see.", "publishedDate": "2017-09-05", "language": "en", "rating": 5}, {"id": 521202112, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d2328556-r521202112-Teleferico_del_Puerto-Barcelona_Catalonia.html", "text": "We were excited to have a view of Barcelona from this experience. Unfortunately it is not accessible for larger powerchairs. They is another cable car ride in Barcelona.\nIt is accessible for powerchair user.", "publishedDate": "2017-09-04", "language": "en", "rating": 2}, {"id": 519981710, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d2328556-r519981710-Teleferico_del_Puerto-Barcelona_Catalonia.html", "text": "My recommendation is to get the Funicular from Parallel up to the Montajuic telefericoc then walk up to the castle through the grounds and back to the Port side of Montajuic to get the telerifico to the Port and Barceloneta. The queue was minimal in this direction and you can then just enjoy the views, which are dramatic. Maybe take the time to enjoy rather than take pictures.", "publishedDate": "2017-08-31", "language": "en", "rating": 4}]}}]