[{"locationId": 190164, "name": "Mercat de la Boqueria", "placeType": "ATTRACTION", "reviewListPage": {"reviews": [{"id": 756962146, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d190164-r756962146-Mercat_de_la_Boqueria-Barcelona_Catalonia.html", "text": "Colorful, nice, clean, delicious placee! In the heart of La Rambla street. Great experience but the price has to be cheaper. Everything is very expensive.", "publishedDate": "2020-06-06", "language": "en", "rating": 5}, {"id": 755441789, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d190164-r755441789-Mercat_de_la_Boqueria-Barcelona_Catalonia.html", "text": "If you are in the La Rambla area or in Barcelona, make sure you visit this market (closed on Sundays).  Your senses will have a feast.", "publishedDate": "2020-05-26", "language": "en", "rating": 5}, {"id": 752798421, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d190164-r752798421-Mercat_de_la_Boqueria-Barcelona_Catalonia.html", "text": "Wandering around the market tasting all the variety is one of the great joys of visiting Barcelona. Spanish food is made for this, and there is some amazing variety in here.", "publishedDate": "2020-04-21", "language": "en", "rating": 5}, {"id": 752739816, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d190164-r752739816-Mercat_de_la_Boqueria-Barcelona_Catalonia.html", "text": "This is a must stop for us on every trip to Barcelona . The market is off the main st of Las Rambles .You can't miss it if your looking for it . We always have fresh shell fish needless to say . We've tried many different things and have not been disappointed yet. Enjoy .", "publishedDate": "2020-04-18", "language": "en", "rating": 4}, {"id": 752462645, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d190164-r752462645-Mercat_de_la_Boqueria-Barcelona_Catalonia.html", "text": "I think is the best food market I've ever visited by far. Amazing experience. You can find whatever you like. Exotic fruits, local snacks, lots of sea food all over the world. Unique tacos, burritos rare meats. Amazing and really tasty. You can't miss it by the time is on the most famous street of Barcelona. Grateful for being there!!! ", "publishedDate": "2020-04-10", "language": "en", "rating": 5}, {"id": 752364295, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d190164-r752364295-Mercat_de_la_Boqueria-Barcelona_Catalonia.html", "text": "What another amazing food market. There is so much going on. The noise, the colors from each different stall, the smell of the food and the produce, the vibe is just unbeatable. Two options: Come after you just ate and enjoy the atmosphere, OR, come hungry and taste your way through the different flavors and there is something for every taste. We came here with both of our young children and they loved it. Uncomplicated, visual, you see something you like and you try, if you like it you buy more, if not, you move on. Bring some time and enjoy. We came back and back", "publishedDate": "2020-04-07", "language": "en", "rating": 4}, {"id": 752338225, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d190164-r752338225-Mercat_de_la_Boqueria-Barcelona_Catalonia.html", "text": "If you are searching fresh food is the best option. Great quality product and comfortable to buy. Nice place.", "publishedDate": "2020-04-06", "language": "en", "rating": 5}, {"id": 752271137, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d190164-r752271137-Mercat_de_la_Boqueria-Barcelona_Catalonia.html", "text": "The merat was such a cool place that we visited it multiple times as our hotel was just blocks away. All kinds of restaurants, shops and merchants. It is one of the 'must see' places in Barcelona!", "publishedDate": "2020-04-04", "language": "en", "rating": 5}, {"id": 752167600, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d190164-r752167600-Mercat_de_la_Boqueria-Barcelona_Catalonia.html", "text": "The St Joseph Market (also known as Mercat de La Boqueria) is a touristic attraction in the middle of Ramblas, so it is always crowded and more expensive than a ordinary market, off course. If you want to eat and enjoy the time slowly, you must find another place, but la boqueria is a place to \"eat with the eyes\", as we used to say in Brasil. ", "publishedDate": "2020-04-02", "language": "en", "rating": 4}, {"id": 752162060, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d190164-r752162060-Mercat_de_la_Boqueria-Barcelona_Catalonia.html", "text": "I would say this is a must do in barcleona. Great places to eat in the market. Lots of fresh seafood in the market. Pretty crowded. Go early. ", "publishedDate": "2020-04-02", "language": "en", "rating": 5}, {"id": 751613628, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d190164-r751613628-Mercat_de_la_Boqueria-Barcelona_Catalonia.html", "text": "I love fresh food markets - and Barcelona's Mercat de la Boqueria is a favorite! I love the food counters - Pinotxa Bar (yum!) ", "publishedDate": "2020-03-22", "language": "en", "rating": 4}, {"id": 751561615, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d190164-r751561615-Mercat_de_la_Boqueria-Barcelona_Catalonia.html", "text": "Visited during the beginning of the Coronavirus spreading. There weren’t as many people as normal. The food everywhere looked delicious. We ate at a tapas stall in the middle of the market. I wish England sold mixed fruit cups like those on sale here ", "publishedDate": "2020-03-21", "language": "en", "rating": 5}, {"id": 751324398, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d190164-r751324398-Mercat_de_la_Boqueria-Barcelona_Catalonia.html", "text": "A beautiful food market where you can find all the kinds of fish and meat you want for endless cooking. But you can also have wonderful meals at the restaurants inside or grab a bite as you walk by. We went there two times doing just that.\nWe sat at the Quim which served a heavenly oxtail dish, as well as many other delicious stuff. Fast and mostly polite service, great food, prices ok. \nDefinately worth to try.\nThe other day we grabbed a couple of \"calzone\" like sandwitches that came with various fillings. That was delicious too. What wasn't worth it AT ALL, were the fries that you bought in a paper cone - at least the ones we got. They must have been fried hours ago so they were no crunchy at all. Maybe we got unlucky with the specific shop. \nThe market however is a must see .", "publishedDate": "2020-03-18", "language": "en", "rating": 5}, {"id": 751206112, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d190164-r751206112-Mercat_de_la_Boqueria-Barcelona_Catalonia.html", "text": "You can judge a place on the markets it has like this, this was an attack on the senses, the vibrant colours of the fruit stalls, the smell of the fish stalls and the sound of the locals doing their shopping.\n\nWe bought some lunch from here but you can easily just spend an hour just looking at the stalls, the fruits that you don't see in your local Tesco, the I'm guessing goats head that doesn't tend to appear on your Sainsburys Deli and the fish that look more like something out of a horror film than a Morrisons.\n\nA great experience to get a flavour of Barcelona.", "publishedDate": "2020-03-17", "language": "en", "rating": 5}, {"id": 751073729, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d190164-r751073729-Mercat_de_la_Boqueria-Barcelona_Catalonia.html", "text": "This is a must see in Barcelona. No doubt that this is one of the best and most variable local markets in Barcelona. fresh and \"different\" ingredientes. some that you can only find on this specific market. You can also find some good wines and drinks. The few food spots in the market can be super good despite the line that you usually have to face to find yourself a sit. Avoid the 1st stands, get in deep in the market and get to know it fully before you start buying!", "publishedDate": "2020-03-16", "language": "en", "rating": 5}, {"id": 750769536, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d190164-r750769536-Mercat_de_la_Boqueria-Barcelona_Catalonia.html", "text": "Everything from fish meat ham fruits juices very clean fresh and well presented. Don’t miss it. Can have some food made in front of you \n", "publishedDate": "2020-03-13", "language": "en", "rating": 4}, {"id": 750723393, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d190164-r750723393-Mercat_de_la_Boqueria-Barcelona_Catalonia.html", "text": "A proper market in every sense of the word, colorful, vibrant, stimulating, noisy and the smells!! if you can grow it, eat it or drink it you will find it here, plus all the usual touristy stuff & much more a must see for any visitor to Barcelona.", "publishedDate": "2020-03-13", "language": "en", "rating": 5}, {"id": 750650215, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d190164-r750650215-Mercat_de_la_Boqueria-Barcelona_Catalonia.html", "text": "This market is awesome!  The fresh food, the size of the chocolate dipped strawberries, the seafood and the Ramblero grill that cooked it up were incredible. Not thrilled with the empanadas but really loved the honey dipped macadamia nuts!  It was a lot of fun to walk through and we went every day of our trip!", "publishedDate": "2020-03-12", "language": "en", "rating": 5}, {"id": 750337419, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d190164-r750337419-Mercat_de_la_Boqueria-Barcelona_Catalonia.html", "text": "A must see when in Barcelona. Keep an eye out, it is easy to miss. They have something for everybody, fresh fruit, juice, fresh fish, meat, candy, nuts, snacks, everything.....", "publishedDate": "2020-03-10", "language": "en", "rating": 5}, {"id": 750280074, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d190164-r750280074-Mercat_de_la_Boqueria-Barcelona_Catalonia.html", "text": "Located on the famous La Rambla street, This is the most popular and must-see market in Barcelona. It's basically a gathering of shopkeeper selling fruits, vegetables, meat, seafood, pickles, candies, smoothies, juices and what not. It's a delight to see so many colours in one place. Visit early in the morning before 10:30 to ensure there aren't many tourists. One doesn't need to be shy to take multiple pictures of shops - the shopkeepers are accustomed to this even if you don't end up buying anything. For a foodie, it would be hard to resist tasting a few delicacies here.", "publishedDate": "2020-03-10", "language": "en", "rating": 5}, {"id": 750256395, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d190164-r750256395-Mercat_de_la_Boqueria-Barcelona_Catalonia.html", "text": "Loved this Market, so much food choice, the vibrant colours and sweet smells from the fruit, amazing cooked food and my personal favourite was the meat and cheese cones. Also found gluten free bread sticks which was great!", "publishedDate": "2020-03-10", "language": "en", "rating": 5}, {"id": 750216083, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d190164-r750216083-Mercat_de_la_Boqueria-Barcelona_Catalonia.html", "text": "the best Fruit market in Barcelona, various products, nicely presented, excellent decoration, Amazing quality of food, excellent priced, recommendable ", "publishedDate": "2020-03-10", "language": "en", "rating": 5}, {"id": 750154558, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d190164-r750154558-Mercat_de_la_Boqueria-Barcelona_Catalonia.html", "text": "This is place that you must visit to experience the people, flavors and uniqueness of Barcelona.  They have a variety of fresh and cooked food withing the market.\nI love trying small bites at different stalls and picking up some culinary souvenirs.  \nIt is not a \"bargain\" place but you can find unique spices like saffron and a delicious variety of olives very fairly priced.", "publishedDate": "2020-03-09", "language": "en", "rating": 4}, {"id": 749777467, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d190164-r749777467-Mercat_de_la_Boqueria-Barcelona_Catalonia.html", "text": "We enjoyed seafood at one of the bar type restaurants, bought some nice cheese and Iberico, tried some special juices blends.\nVery unique experience :)", "publishedDate": "2020-03-07", "language": "en", "rating": 5}, {"id": 749755712, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d190164-r749755712-Mercat_de_la_Boqueria-Barcelona_Catalonia.html", "text": "Awesome interactive class offered to all range of ages. Gabrielle was hands on from selecting fresh seafood from the local market to sharing his culinary skills in the kitchen. Definitely recommend it.", "publishedDate": "2020-03-07", "language": "en", "rating": 5}, {"id": 749739829, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d190164-r749739829-Mercat_de_la_Boqueria-Barcelona_Catalonia.html", "text": "Excellent market, worth a visit just to wonder around taking in the atmosphere, some really nice bars and places to eat as well. A must visit in Barcelona ", "publishedDate": "2020-03-07", "language": "en", "rating": 5}, {"id": 749696670, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d190164-r749696670-Mercat_de_la_Boqueria-Barcelona_Catalonia.html", "text": "Huge variety of food: fish, fruit, vegetables, Serrano ham, eggs, prices and sweet. Prices may vary from a little and some foods at not cheap at all. If you for a little break taking appetizer and or a drink may be a good choice. I do not recommend this place for dinner or lunch. ", "publishedDate": "2020-03-07", "language": "en", "rating": 3}, {"id": 749669593, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d190164-r749669593-Mercat_de_la_Boqueria-Barcelona_Catalonia.html", "text": "Absolutely in love with this place! That’s what I love about Spain! Markets with fresh fish, fruits, ham... try everything! And have a glass of Cava in one of the bars!", "publishedDate": "2020-03-07", "language": "en", "rating": 5}, {"id": 749512374, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d190164-r749512374-Mercat_de_la_Boqueria-Barcelona_Catalonia.html", "text": "Seafood 🦞, meat 🥩, cheese 🧀,\nNuts 🥜, sweets 🍫 and places to sit for lunch 🍴 make this a great destination place for snacks, take-aways, gifts, and refueling your strength as you tour beautiful Barcelona. ", "publishedDate": "2020-03-06", "language": "en", "rating": 5}, {"id": 749288463, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d190164-r749288463-Mercat_de_la_Boqueria-Barcelona_Catalonia.html", "text": "Walking back to the hotel my son and I swung into this expansive mercat to get some jamon and wine. What we didn’t expect was to sit down at the seafood joint and have some amazing grilled calamari with salad and home fried potatoes along with a nice ice cold tall Estrella. Alex was awesome and they speak several languages. They are located right behind the DD and Starbucks so stop in. ", "publishedDate": "2020-03-05", "language": "en", "rating": 5}, {"id": 749169977, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d190164-r749169977-Mercat_de_la_Boqueria-Barcelona_Catalonia.html", "text": "Fun place to visit. Good for a quick lunchtime bite! Interesting selection of deli, tapas and drinks. Also fresh fruit, vegies, meat and fish", "publishedDate": "2020-03-04", "language": "en", "rating": 4}, {"id": 748917417, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d190164-r748917417-Mercat_de_la_Boqueria-Barcelona_Catalonia.html", "text": "This review may disappoint you but I only give my opinion to save anyone from the downward roller coaster disappointment that I personally felt after reading review after review that this place is a must see in Barcelona. Ok, to set standards, if you normally love to eat fresh food and have been to an outdoor farmers market before, than this mercat is just another average market to get fresh fruits, veggies and meats and seafood. For the meats and seafood, you must have a kitchen to take the raw food to cook. There are plenty of seafood stalls who make delicious and exotic seafood dishes while you stand or sit at a very tight bar. I tried the potato’s bravas from a potato stall. They were basically re fried potato but size squares with a mild tomato sauce drizzled on top. The stall cook said the sauce was spicy, but I, personally, thought it was tasteless. I also bought a fresh cup of fruit. It was refreshing and delicious. But for that price, you can get way more fresh fruit from any supermarket. It will be just as fresh and just as tasty. I had a cup of fresh pina coco. It was delicious. I also got a spicy chicken and cheese empanada. It was warm, buttery and flaky. Very good. All in all, I feel the mercat is overrated by all YouTube tourist guides and some reviewers on TripAdvisor. It is the same up priced farmers market that you find anywhere else in the world. Yes, it was crowded, but not unbearable.", "publishedDate": "2020-03-03", "language": "en", "rating": 4}, {"id": 748645286, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d190164-r748645286-Mercat_de_la_Boqueria-Barcelona_Catalonia.html", "text": "A must do in Barcelona the atmosphere is amazing as is the spells of the food! We really enjoy the cones of ham and cheese!", "publishedDate": "2020-03-01", "language": "en", "rating": 4}, {"id": 748517508, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d190164-r748517508-Mercat_de_la_Boqueria-Barcelona_Catalonia.html", "text": "Although a bit touristy this place is great for browsing around and buying few things to take home. There are also many restaurants in the market where you can have relatively inexpensive lunch.", "publishedDate": "2020-03-01", "language": "en", "rating": 5}, {"id": 748382202, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d190164-r748382202-Mercat_de_la_Boqueria-Barcelona_Catalonia.html", "text": "An epicurean delight. Great sights, sounds and smells of a traditional Spanish market. As well as the numerous and varied stalls there are lots of tapas bars to sit down and enjoy a bite and a beer. Just be wary that you will pay above the odds for the experience.", "publishedDate": "2020-02-29", "language": "en", "rating": 4}, {"id": 748323394, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d190164-r748323394-Mercat_de_la_Boqueria-Barcelona_Catalonia.html", "text": "Great variety of fruits, used to go every morning to buy a cup of fresh fruits. Its a must do if you visit barcelona.", "publishedDate": "2020-02-29", "language": "en", "rating": 5}, {"id": 748208001, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d190164-r748208001-Mercat_de_la_Boqueria-Barcelona_Catalonia.html", "text": "Great selection of foods at high prices. The paella with lobster that we eyed was priced at $90pp - ludicrous. Definitely for not-so-savvy American/European tourists. Cooked-to-order Asian fusion food (choose your beer or soda from the fridge) at the entrance was excellent.   ", "publishedDate": "2020-02-28", "language": "en", "rating": 3}, {"id": 747798387, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d190164-r747798387-Mercat_de_la_Boqueria-Barcelona_Catalonia.html", "text": "In this place you can eat a good and traditional food in Barcelona. Everything is good and they have good prices. And if you go after 5-6 pm you can buy food at small prices. I definetly recomended. ❤️", "publishedDate": "2020-02-26", "language": "en", "rating": 5}, {"id": 747791826, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d190164-r747791826-Mercat_de_la_Boqueria-Barcelona_Catalonia.html", "text": "Fresh fruits - a huge selection of all you can imagine; fruit shakes, drinks, the famous and delicious Barcelona ham, fish, cheese and many other snacks. \nEverything your heart desires, at really affordable prices. A great hall with so much food. Everything was fresh,tasty and delicious.\n\nImmerse yourself in the normal everyday life of Barcelona. Try it, you will not regret!", "publishedDate": "2020-02-26", "language": "en", "rating": 5}, {"id": 747586437, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d190164-r747586437-Mercat_de_la_Boqueria-Barcelona_Catalonia.html", "text": "Amazing market with lots of fresh food fresh fruits flowers chocolates nuts spices olive oil sea salts Jamon ham at reasonable prices !! It’s amazing and open everyday except closed on Sundays.", "publishedDate": "2020-02-25", "language": "en", "rating": 5}, {"id": 747566911, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d190164-r747566911-Mercat_de_la_Boqueria-Barcelona_Catalonia.html", "text": "This place is awesome and a must! First thing you see when you walk in is the delicious drinks and fruit everywhere.  Those drinks are delicious!!! we went back another day just to get more.  The prices are high because it is a tourist trap but so many things to sample.  I would highly recommend and this is a place I'll miss.", "publishedDate": "2020-02-25", "language": "en", "rating": 5}, {"id": 747458083, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d190164-r747458083-Mercat_de_la_Boqueria-Barcelona_Catalonia.html", "text": "A great market full of colourful and extremely busy because it’s just in front of the ramblas .\nYou can buy everykind of veggies and spices.\nA bit difficult to find vegan food .\nThis is a place not to be missed if you are a foodie.", "publishedDate": "2020-02-24", "language": "en", "rating": 5}, {"id": 746949026, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d190164-r746949026-Mercat_de_la_Boqueria-Barcelona_Catalonia.html", "text": "We stumbled upon this open air market by accident and I’m so glad we did.  The market had everything!!!!  So many beautiful colors of fruits, vegetables, and meats.  You can also eat there!  We got some olives to take back to the states.  \n\nOne word of advice though.  If you want to take pictures ask the person first.  This guy was not happy with me for taking his picture without asking.  I felt so bad after.  \n\nHope you enjoy the market as much as we did.", "publishedDate": "2020-02-23", "language": "en", "rating": 5}, {"id": 746817690, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d190164-r746817690-Mercat_de_la_Boqueria-Barcelona_Catalonia.html", "text": "We only had less than 24 hours in Barcelona between flights from another part of Europe back to Australia, so caught a bus here to explore. Visually stunning with all of the produce on offer. Even though I know the prices here are not as cheap as other markets, they are certainly cheaper than the prices we would pay back home. An easy place to kill a couple of hours.", "publishedDate": "2020-02-22", "language": "en", "rating": 5}, {"id": 746557058, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d190164-r746557058-Mercat_de_la_Boqueria-Barcelona_Catalonia.html", "text": "Cool market. Not much different to other large fresh produce markets from other cities. \n\nBut does have a large selection of hot and cooked food section further in.\n\nMostly geared to tourists and for the best produce and prices, follow the old dears. Where the old grannies shop will be where the best deals to be had.\n\nFollow the locals", "publishedDate": "2020-02-21", "language": "en", "rating": 4}, {"id": 746521276, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d190164-r746521276-Mercat_de_la_Boqueria-Barcelona_Catalonia.html", "text": "We stumbled across this market which is situated in Las Ramblas after it had been recommended. The variety of food on offer has to be seen to be believed. All the food looked very tempting and we would have liked to have sat at one of the ones that offered tapas but they were all too busy, however we found a very nice little place just at the side of the market. The only negative thing about this place is that it is very busy and be wary of pickpockets. Also some of the food is expensive. It is nice just to wander round though . ", "publishedDate": "2020-02-21", "language": "en", "rating": 5}, {"id": 746410619, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d190164-r746410619-Mercat_de_la_Boqueria-Barcelona_Catalonia.html", "text": "Such a neat experience, with so many things to try. You won’t leave hungry or empty handed!\nWok To Walk is a great place within the market as well.", "publishedDate": "2020-02-20", "language": "en", "rating": 5}, {"id": 746387724, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d190164-r746387724-Mercat_de_la_Boqueria-Barcelona_Catalonia.html", "text": "A great buzzing market. Yes it’s a tourist trap, but it’s good fun. A glass of Albariño and gambas al ajillo whilst watching the world go by? That will do. ", "publishedDate": "2020-02-20", "language": "en", "rating": 5}, {"id": 746352920, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d190164-r746352920-Mercat_de_la_Boqueria-Barcelona_Catalonia.html", "text": "Always love a good wander in la Boqueria, there is so much to see....you could spend hours here. This is one place I always visit whenever I visit Barcelona.", "publishedDate": "2020-02-20", "language": "en", "rating": 4}, {"id": 746266708, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d190164-r746266708-Mercat_de_la_Boqueria-Barcelona_Catalonia.html", "text": "The sights, sounds and smells are intoxicating for a foodie like me. I found so many treats and the vendors do their best to be patient. I tend to travel with a wee sized cooler bag complete with cutting board, serrated knife, fork/knife/spoon, etc. so purchases at the market can be enjoyed in a nice park setting or in a quiet hotel room. There was a bottle shop in this market which I particularly appreciated.\nFor American’s, it might be hard to accept the fact that the food is often handled with bare hands by the vendor. We visited the Mercats around Spain daily and managed never to pick up any ‘tummy bugs’. \n\nYou can also find places to sit down to eat within The Mercat.", "publishedDate": "2020-02-20", "language": "en", "rating": 5}, {"id": 746155453, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d190164-r746155453-Mercat_de_la_Boqueria-Barcelona_Catalonia.html", "text": "We only bought a fruit juice for 1 Euro but then spent the rest of the time wandering around looking at the wonderful displays of produce. Definitely worth a quick wander.", "publishedDate": "2020-02-19", "language": "en", "rating": 5}, {"id": 746133437, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d190164-r746133437-Mercat_de_la_Boqueria-Barcelona_Catalonia.html", "text": "Admittedly we came late in the day due to flight delays but benefit was not tons of crowds although some stalls had already shut up for the day. Still in time to have some tapas and a drink from Quim de la Boqueria. Lovely start to the trip. ", "publishedDate": "2020-02-19", "language": "en", "rating": 4}, {"id": 745950909, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d190164-r745950909-Mercat_de_la_Boqueria-Barcelona_Catalonia.html", "text": "Looks beautiful \nReally nice to wander round and look at the displays of fruit, seafood, chocolates etc", "publishedDate": "2020-02-18", "language": "en", "rating": 5}, {"id": 745774681, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d190164-r745774681-Mercat_de_la_Boqueria-Barcelona_Catalonia.html", "text": "Go in once take your pictures and that's what it's mostly good for. Overpriced everything for tourists that wouldn't know any better. Can't say anything I bought there was worth it. Would recommend the San Antonio market instead.", "publishedDate": "2020-02-17", "language": "en", "rating": 2}, {"id": 745516712, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d190164-r745516712-Mercat_de_la_Boqueria-Barcelona_Catalonia.html", "text": "A must see when in Barcelona, the fruits and fish look amazing. A bustling market with many local people doing their shopping.", "publishedDate": "2020-02-16", "language": "en", "rating": 5}, {"id": 745429715, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d190164-r745429715-Mercat_de_la_Boqueria-Barcelona_Catalonia.html", "text": "Colorful market, a lot of varieties of food, fruit, seafood and meat!  \nThe people are very friendly and kind. \nIt is the cheapest place where to eat in Barcelona! \nThe smoothies are incredible! ", "publishedDate": "2020-02-16", "language": "en", "rating": 5}, {"id": 745090192, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d190164-r745090192-Mercat_de_la_Boqueria-Barcelona_Catalonia.html", "text": "3 Chocolates for 12 euros. The Chocolate Cookie on top of the Chocolate was delicious. But, I thought it would be filled underneath fully and it was not.\nWould be helpful to try before you buy!\n2 scoop cone of Coconut and Chocolate was 3.50 euros, delicious flavours!\nBe aware the price as you enter is highly expensive and as you get into the middle then the price declines.\nIt was annoying to then go into the town and see the same product a lot cheaper.\nVery busy with tourists, so watch your valuables as pick pocketers prey on your distraction.\nThe lady at the strawberry stand told me to move as I was leaning on her stand. I was no where near touching her strawberries.\nSeems they are pushy for your money, under value and over priced.\n\nThe chocolate stand is overated, don't bother buying any chocolate there as it is stupidly expensive. \n\nI won't return there! It seems exciting but not a decent market really. ", "publishedDate": "2020-02-14", "language": "en", "rating": 1}, {"id": 744794811, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d190164-r744794811-Mercat_de_la_Boqueria-Barcelona_Catalonia.html", "text": "La Boqueria was a must see on our list. \n\nThe sights and smells were outstanding, and our daughter totally smashed a crèpe the size of her head from one of the stalls. \n\nSo much fresh fruit, fresh fish, delectable ice creams and other foods filled the hall and there’s something there for everyone - including bars!\n\nBusier at some times than others and just off La Rambla, it’s quick to pop in en route. ", "publishedDate": "2020-02-13", "language": "en", "rating": 4}, {"id": 744764635, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d190164-r744764635-Mercat_de_la_Boqueria-Barcelona_Catalonia.html", "text": "A visit to this market on La Rambla is a must. This is a photographer's delight--lots of colorful food beautifully displayed. If you are in a hotel and can't buy fresh vegetables or fish, stop by the candy and nut stalls. You won't be able to resist!", "publishedDate": "2020-02-12", "language": "en", "rating": 5}, {"id": 744698033, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d190164-r744698033-Mercat_de_la_Boqueria-Barcelona_Catalonia.html", "text": "A visit to the Buqueria market should take place lunch time. We sat at the buquria bar had a squid that was un chuable. Much too hard. We were dissappinted and said that to the manager. They gave us back the money. Better if you dont like a dish say that immedistely. They are very nice. Offered a different dish but we wanted to keep traveling.", "publishedDate": "2020-02-12", "language": "en", "rating": 4}, {"id": 744631340, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d190164-r744631340-Mercat_de_la_Boqueria-Barcelona_Catalonia.html", "text": "Walk in with a group of friends or at lease two / three with u , colourful fruits words , clean fresh seafoods area , bakery , fried ... really good for sharing , if not u can taste more . Reasonable prices ( exclusive sit dining ) . ", "publishedDate": "2020-02-12", "language": "en", "rating": 4}, {"id": 744444288, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d190164-r744444288-Mercat_de_la_Boqueria-Barcelona_Catalonia.html", "text": "A colorful and busy market with all the tourists jamming this place. It's fun to experience the hustle and bustle but it can get tiring walking through the crowds. Wasn't easy to look for decent food to buy since you can't even get close to the stalls sometimes. We ended getting some delicious empanadas and fresh juices for a simple lunch.", "publishedDate": "2020-02-11", "language": "en", "rating": 4}, {"id": 744405967, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d190164-r744405967-Mercat_de_la_Boqueria-Barcelona_Catalonia.html", "text": "A very colorful market! Spend some time looking around to see what this market has to offer. Prices can differ among the stalls, so make sure to go around to score a good deal! When nearing closing time, some food are sold at a lower price. A nice experience!", "publishedDate": "2020-02-11", "language": "en", "rating": 5}, {"id": 744097785, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d190164-r744097785-Mercat_de_la_Boqueria-Barcelona_Catalonia.html", "text": "If you wanna feel a really taste of Barcelona you should go There! Amazing food and fruits ❤ it's even hard to decide what to eat or drink.", "publishedDate": "2020-02-10", "language": "en", "rating": 5}, {"id": 743862391, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d190164-r743862391-Mercat_de_la_Boqueria-Barcelona_Catalonia.html", "text": "This market was thriving with customers. \nFresh ingredients, some places to seat and eat but mostly locals gathering supplies. \nGreat fun for a foodie!", "publishedDate": "2020-02-09", "language": "en", "rating": 5}, {"id": 743743366, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d190164-r743743366-Mercat_de_la_Boqueria-Barcelona_Catalonia.html", "text": "It is situated in La rambla street so you can't miss it. But..nothing special. It is very small, with poor selection. The prices are abnormally high. Everything is very expensive except fresh juices. ", "publishedDate": "2020-02-08", "language": "en", "rating": 3}, {"id": 743668578, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d190164-r743668578-Mercat_de_la_Boqueria-Barcelona_Catalonia.html", "text": "There are still some ‘proper stalls’ and if you visit earlier in the day you can still find locals sticking up.  However much of the space is now given up to meeting the  requirements of cruise/busloads of tourists with the result that many of the stalls are replicated throughout (cones of meat stalls of fruit/juices).\n\nMercat S’ Antoni is only a 10 minute walk away for those looking for a more authentic expert.", "publishedDate": "2020-02-07", "language": "en", "rating": 2}, {"id": 743553443, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d190164-r743553443-Mercat_de_la_Boqueria-Barcelona_Catalonia.html", "text": "Every kind of food for this area can be found at this market! The main thing you will NOT find is a place to sit and rest! There are lots of people. Don't go if you are tired!!", "publishedDate": "2020-02-07", "language": "en", "rating": 4}, {"id": 743411812, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d190164-r743411812-Mercat_de_la_Boqueria-Barcelona_Catalonia.html", "text": "My friend and I were very lucky to have found a place to rent for several days which was just a hop and skip away from the Mercat.  We got a chance to go everyday to feast our eyes on the different meats, chorizos, seafood, tapas, vegetables, fruits, etc.  Everything, to me, was saying like buy me, buy me (lol).  \n\nThere are some vendors who are friendlier than others, and some prepared dishes better than others.  But one takes his or her chances on these things.  the important thing is that this place is so alive and I love it!", "publishedDate": "2020-02-06", "language": "en", "rating": 5}, {"id": 743324562, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d190164-r743324562-Mercat_de_la_Boqueria-Barcelona_Catalonia.html", "text": "This market was my first stop on day one of my trip. I absolutely loved the vibrant atmosphere and endless selections of meat, fresh produce, sweets, and even on-site dining areas. It was so wonderful, I made sure to go back on my last day before leaving Barcelona. ", "publishedDate": "2020-02-05", "language": "en", "rating": 5}, {"id": 743188669, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d190164-r743188669-Mercat_de_la_Boqueria-Barcelona_Catalonia.html", "text": "If you’re staying at an airbnb and like to cookt his place is idyllic! Much like borough market in the UK it is sure to get the taste buds moving. There’s isnt a huge amount of stalls but it has good spanish produce and if you’re well worthy of a stop. It was pouring with rain when we stopped by for tapas and sangria sat at the bar, really cant complain.", "publishedDate": "2020-02-05", "language": "en", "rating": 4}, {"id": 743117723, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d190164-r743117723-Mercat_de_la_Boqueria-Barcelona_Catalonia.html", "text": "Well, we are spoiled by fabulous market in far east and other places. This is a very pretty old building and colourful for photos. But too touristy for us.", "publishedDate": "2020-02-04", "language": "en", "rating": 4}, {"id": 742902782, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d190164-r742902782-Mercat_de_la_Boqueria-Barcelona_Catalonia.html", "text": "The market is easy to browse and explore... tasting along the way. We enjoyed the hustle and bustle... it was full of energy! There are fresh fruit juices, empanadas, churros, turron, Iberica ham and even paella. Foodie heaven...go and enjoy for yourself!", "publishedDate": "2020-02-03", "language": "en", "rating": 5}, {"id": 742619846, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d190164-r742619846-Mercat_de_la_Boqueria-Barcelona_Catalonia.html", "text": "Loved this place we stumbled across.\nIf I had more time in Barcelona I would definitely go back and eat at the gorgeous little eateries in the centre of the market, the food & wine being served there looked fantastic and a great atmosphere of people.\nAs it happened we didn’t have time so settled for a cone of meats & cheeses and a wonder up & down the aisles.", "publishedDate": "2020-02-02", "language": "en", "rating": 5}, {"id": 742581573, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d190164-r742581573-Mercat_de_la_Boqueria-Barcelona_Catalonia.html", "text": " Many aisles of delicious treats can be found here.Vendors also sell prepared and cooked items to eat on the go.We enjoyed trying new items that were foreign to us. It was fun walking through this market looking at all the colorful displays of food. Stop in for a nibble!", "publishedDate": "2020-02-02", "language": "en", "rating": 5}, {"id": 742207222, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d190164-r742207222-Mercat_de_la_Boqueria-Barcelona_Catalonia.html", "text": "Beautiful food displayed, music played Quintessential! There are several similar to this most to beautiful architecture buildings done by famous architects in their heyday. Make sure to get a paper cone there’s signature meats and Manchego cheese. Not to skip! ", "publishedDate": "2020-01-31", "language": "en", "rating": 4}, {"id": 742124711, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d190164-r742124711-Mercat_de_la_Boqueria-Barcelona_Catalonia.html", "text": "I feel so sheltered living in the US. We don’t display our fish and meats the way they do in Europe at all. The peeps here are not grossed out or put off seeing fish and animals in all sorts of be headed, skinned and plucked states. It was quite horrifying at first, but then freaking interesting after some time, like a train crash if you will. I couldn’t help but look in amazement at the raw and bloody display of creatures. \n\nI won’t say seeing them in such a state made me want to buy or even eat them. It was just hard to look away was all.", "publishedDate": "2020-01-30", "language": "en", "rating": 4}, {"id": 741918416, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d190164-r741918416-Mercat_de_la_Boqueria-Barcelona_Catalonia.html", "text": "This is such a unique experience - we love visiting this vibrant market.  So many vendors selling meats, cheeses, fruit, fish and more... you must try the meat cones full of Iberico ham while wandering among the stalls!  For us this market is a \"must-visit\" each time we're in Barcelona - there's absolutely nothing like it in North America!", "publishedDate": "2020-01-29", "language": "en", "rating": 5}, {"id": 741872400, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d190164-r741872400-Mercat_de_la_Boqueria-Barcelona_Catalonia.html", "text": "It was our fault for going at midday where it's elbow to elbow inside the market. Such as contrast at 8-9am when the market opens and you're able to leisurely stroll around. As with most bustling markets, there are so many things to see and smell. There are several places to sit and have some tapas. Worth going (early!)", "publishedDate": "2020-01-28", "language": "en", "rating": 4}, {"id": 741618274, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d190164-r741618274-Mercat_de_la_Boqueria-Barcelona_Catalonia.html", "text": "This quickly became one of our favorite places to stop in for a snack or to just wander.  There was so much to try and to see.  There are options to sit for a glass of wine, grab food on the go, or just see the rich culture of the areas food.  Would highly recommend!", "publishedDate": "2020-01-27", "language": "en", "rating": 5}, {"id": 741520145, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d190164-r741520145-Mercat_de_la_Boqueria-Barcelona_Catalonia.html", "text": "A market with fresh fruit and veggies and also a lively place with great vibe in the heart of Barcelone. The architecture is incredibly old and fascinating.", "publishedDate": "2020-01-27", "language": "en", "rating": 5}, {"id": 741468004, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d190164-r741468004-Mercat_de_la_Boqueria-Barcelona_Catalonia.html", "text": "Wow, what an impressive fresh food market is Mercat de la e Boqueria is.\nThe colors and variety of the different fresh fruit and vegetables too the home made pastries and chocolates was amazing. The fresh seafood that you can see is still moving on the ice was a sight to see. Great place to try out the Spanish and Catalan delicacies and take some home for friends and family.\nThis is one of the places you should visit if in Barcelona if not for the food but the ambiance.", "publishedDate": "2020-01-26", "language": "en", "rating": 5}, {"id": 741406672, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d190164-r741406672-Mercat_de_la_Boqueria-Barcelona_Catalonia.html", "text": "Close to the Metro, ideal place for fresh fruits, vegetable and grilled fish.\nMake sure to get the dry cocount very tasty.", "publishedDate": "2020-01-26", "language": "en", "rating": 5}, {"id": 741359968, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d190164-r741359968-Mercat_de_la_Boqueria-Barcelona_Catalonia.html", "text": "One of the famous places in Barcelona, and as many others, nothing special. Nice for passing trough and taking some picture but food is expensive and hygienically speaking.....even after what is happening in China!", "publishedDate": "2020-01-26", "language": "en", "rating": 3}, {"id": 741335976, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d190164-r741335976-Mercat_de_la_Boqueria-Barcelona_Catalonia.html", "text": "We spent 5 days in Barcelona and this was a stop at least once a day! Put this on your list of sites. You can eat as you wander the aisles or sit down at one of the restaurant stalls. \n\nWe bought presents for family and friends here. We still miss our favorite vendors for fruit, artichokes, seafood lunch, chocolates, pastries, nuts, and more. Trust me, do not go to Barcelona with a stop here ❤️", "publishedDate": "2020-01-26", "language": "en", "rating": 5}, {"id": 741280113, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d190164-r741280113-Mercat_de_la_Boqueria-Barcelona_Catalonia.html", "text": "Mercat de la Boqueria is a venture into the heart and soul of the city. It may be somewhat over commercialised but it is of course a market first of all. I recommend a walk around to savour the smells and vibrant colours of fresh produce. Then go to one of the fish counters where you can pick what fresh fish you would like cooked for your meal. Washed down of naturally with a glass of Spanish wine.  Definitely on the not to be missed experiences in Barcelona.", "publishedDate": "2020-01-26", "language": "en", "rating": 5}, {"id": 741002639, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d190164-r741002639-Mercat_de_la_Boqueria-Barcelona_Catalonia.html", "text": "The fruit stalls are reasonably priced and look good value. \nWe did however find a chocolate stall that looked incredible but was so expensive! Almost €10 per kilo! This would also definitely be a hot spot for pick pockets so would be on the look out and be careful with belongings! ", "publishedDate": "2020-01-24", "language": "en", "rating": 3}, {"id": 740979930, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d190164-r740979930-Mercat_de_la_Boqueria-Barcelona_Catalonia.html", "text": "Great market to see and walk around. Lovely ham, fish and croquettes!! It’s worth visiting and having bits and pieces to eat!!", "publishedDate": "2020-01-24", "language": "en", "rating": 5}, {"id": 740972714, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d190164-r740972714-Mercat_de_la_Boqueria-Barcelona_Catalonia.html", "text": "There is really nothing to say just : visit it.\nGo in the morning, have some fresh cut fruits, empanadas, fish, chips, sea food and so on.\nIt's amazing. ", "publishedDate": "2020-01-24", "language": "en", "rating": 5}, {"id": 740848062, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d190164-r740848062-Mercat_de_la_Boqueria-Barcelona_Catalonia.html", "text": "Amazing food market with something for everyone! Looked clean and was laid out well. Really worth visiting ", "publishedDate": "2020-01-23", "language": "en", "rating": 5}, {"id": 740639655, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d190164-r740639655-Mercat_de_la_Boqueria-Barcelona_Catalonia.html", "text": "Famous market with so much fresh fruit, spices, nuts, cheese and meat, bars with tapas...\nNotice, it doesn't work on Sundays.", "publishedDate": "2020-01-22", "language": "en", "rating": 5}, {"id": 740629866, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d190164-r740629866-Mercat_de_la_Boqueria-Barcelona_Catalonia.html", "text": "Lots of cute places, fresh produce stands, lovely sweet stands. Somewhat crowded at lunch; we spent about 30 minutes here, wandering the stands, picking up some blueberries to munch on. Did not feel the need to go back, although we passed the place several times during our visit.", "publishedDate": "2020-01-22", "language": "en", "rating": 4}, {"id": 740567700, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d190164-r740567700-Mercat_de_la_Boqueria-Barcelona_Catalonia.html", "text": "Very cool & busy place...  popular (touristy) market to visit. You can pick up fresh veggies, cheeses, spices and olive oils here! So many vibrant colors everywhere! ", "publishedDate": "2020-01-22", "language": "en", "rating": 5}, {"id": 740400286, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d190164-r740400286-Mercat_de_la_Boqueria-Barcelona_Catalonia.html", "text": "The main entance is from La Ramblas and is perhaps the best reason for going there. There is the most amazing variety of fresh and dried food stallswith meat, fish, fruit,cakes and pastries and things like olive oil and dried herbs providing portable and relatively inexpensive presents or souvenirs. Yes to an extent it is touristy, and yes you do have to keep youer attention honed to avoid being either pick pocketed or otherwise scammed, but unless you have an absolute phobia of crowds it is worth at least a quick look. We would spend far to much monet here if we lived in Barcelona - or perhaps we would use one of the smaller local markets recommended by those \"in the know\"", "publishedDate": "2020-01-21", "language": "en", "rating": 4}, {"id": 740267747, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d190164-r740267747-Mercat_de_la_Boqueria-Barcelona_Catalonia.html", "text": "Free entrance. Plenty of stalls ranging from meats, cooked food, candy. You name it. All items are beautifully displayed. Just be careful of the people \"bumping\" into you!", "publishedDate": "2020-01-20", "language": "en", "rating": 4}, {"id": 739970598, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d190164-r739970598-Mercat_de_la_Boqueria-Barcelona_Catalonia.html", "text": "Lovely market but full of pick pockets. We had to warn a lady about a man trying to get in her bag. As we were pick pocketed on the train we didn’t want this to happen to anyone else. Not enough police about to stop this issue ", "publishedDate": "2020-01-19", "language": "en", "rating": 4}, {"id": 739918638, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d190164-r739918638-Mercat_de_la_Boqueria-Barcelona_Catalonia.html", "text": "After wandering around Passeig de Gràcia, we ended up in Las Ramblas where we enjoyed fresh fruits (served sliced in a cup with fork) and fruit juice & smoothies at this huge market. I’ve never seen a market so colorful- fruits, vegetables, seafood, meat, chocolates, candies, gummies, nuts, & much more. We did not try the tapas as we have been eating along the way. It was fun-tastic! There’s a lot of stalls, so many to choose from. Mostly cheaply priced. This is a must experience. ", "publishedDate": "2020-01-18", "language": "en", "rating": 5}, {"id": 739858352, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d190164-r739858352-Mercat_de_la_Boqueria-Barcelona_Catalonia.html", "text": "Must visit place in Barcelona. You want to try every food in the market. Everything looks so delicious.", "publishedDate": "2020-01-18", "language": "en", "rating": 5}, {"id": 739828460, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d190164-r739828460-Mercat_de_la_Boqueria-Barcelona_Catalonia.html", "text": "Truly an awful place. Don’t even bother going here. It is only a tourist trap with the worst food I’ve ever eaten (truly). Tried multiple stalls and it was all awful. Only food I would get is fresh meat and fish to cook at home, or cones of ham and sausage. Don’t waste your time!", "publishedDate": "2020-01-18", "language": "en", "rating": 1}, {"id": 739758871, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d190164-r739758871-Mercat_de_la_Boqueria-Barcelona_Catalonia.html", "text": "A real feast for your senses - you really don't know where to start here as everything looks and smells amazing\n\nEverything is available - colourful fruit & veg - giant steaks, herbs, spices - wines, beers, sea food, nuts - all foods are here and the presentation by the stall holders is fantastic.\n\nLots of food available to buy and eat immediately - cakes, burritos, pizzas & lots of bars and counters to eat at from a plate - all food cooked in front of you\n\nIt's a \"must see\" on a trip to Barcelona ", "publishedDate": "2020-01-17", "language": "en", "rating": 4}, {"id": 739669221, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d190164-r739669221-Mercat_de_la_Boqueria-Barcelona_Catalonia.html", "text": "The vast majority of the market is unique and authentic - it's the original produce market at it's best. I just wish there were fewer vendors creating demand for plastic cups :-(", "publishedDate": "2020-01-17", "language": "en", "rating": 5}, {"id": 739593629, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d190164-r739593629-Mercat_de_la_Boqueria-Barcelona_Catalonia.html", "text": "Ok we called this place the food market, I’d be surprised if locals actually use it due to the cost of simple tapas, there are some superb tapas bars that conjure up some tremendous dishes within the market and if sitting cramped on a stool in an outdoor market pushes your buttons then this place is for you.\nOther stalls are selling the freshest of produce fish and butchery foods, there’s also some fantastic desert delicacies that would whet the appetite of any body.\nOnly problem we found was the price and environment for sitting and dining, plenty of decent restaurants near by that represent better value and comfort... well worth a look around though.", "publishedDate": "2020-01-16", "language": "en", "rating": 4}, {"id": 739529020, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d190164-r739529020-Mercat_de_la_Boqueria-Barcelona_Catalonia.html", "text": "This is a fun open food market. There are a lot vendors selling Barcelona meats and lots of other specialty foods. I think if you have time and love to cook, this is the place to visit.", "publishedDate": "2020-01-16", "language": "en", "rating": 5}, {"id": 739178861, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d190164-r739178861-Mercat_de_la_Boqueria-Barcelona_Catalonia.html", "text": "Crowded with people just before the Christmas, it had a festive feel. All sorts of food items on display it is a paradise for people that like to explore the local fresh produce. Lot of eateries to enjoy the local flavours, it seemed a good place to buy the famous saffron, olives and the Iberian ham. Need to be careful with small kids as the place is crowded with high chances of them getting lost. But kids loved the place.", "publishedDate": "2020-01-14", "language": "en", "rating": 4}, {"id": 738982916, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d190164-r738982916-Mercat_de_la_Boqueria-Barcelona_Catalonia.html", "text": "We went there three times because we loved the various options of food...from seafood, to different meat assortments, empanadas, fruits, chocolate, fresh juice and so much more!", "publishedDate": "2020-01-13", "language": "en", "rating": 5}, {"id": 738920401, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d190164-r738920401-Mercat_de_la_Boqueria-Barcelona_Catalonia.html", "text": "If ever you have a meat or seafood crave, just go there and try it out! I also appreciated when merchants advised us to watch out for pickpockets as in all touristic place always be aware though.", "publishedDate": "2020-01-13", "language": "en", "rating": 5}, {"id": 738919333, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d190164-r738919333-Mercat_de_la_Boqueria-Barcelona_Catalonia.html", "text": "We came here for dinner with my family. It is walking distance from the hotel we stayed in. The seafood are very fresh and tasty. We ordered lobster, mussels, squid calamari,  and scallop. Very delicious! The place can get crowded so be there early. The staff can speak and understand English and very friendly. A must try place to dine when you go to Barcelona.", "publishedDate": "2020-01-13", "language": "en", "rating": 5}, {"id": 738418066, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d190164-r738418066-Mercat_de_la_Boqueria-Barcelona_Catalonia.html", "text": "A nice town market where you can buy macademia nuts and chocolates to take back home. We also enjoyed juice there. There was a lot of variety in flavours..worth visiting. ", "publishedDate": "2020-01-11", "language": "en", "rating": 5}, {"id": 738334782, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d190164-r738334782-Mercat_de_la_Boqueria-Barcelona_Catalonia.html", "text": "Very good local food, great choice if you are walking the Ras Ramblas and want to grab a quick bite. ", "publishedDate": "2020-01-10", "language": "en", "rating": 4}, {"id": 738277730, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d190164-r738277730-Mercat_de_la_Boqueria-Barcelona_Catalonia.html", "text": "Visited the market twice wish we had something like this at home,quality of produce was amazing,didn’t have the chance to sit and have lunch but lots of places to do so and it all looked great", "publishedDate": "2020-01-10", "language": "en", "rating": 5}, {"id": 738189872, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d190164-r738189872-Mercat_de_la_Boqueria-Barcelona_Catalonia.html", "text": "We visited La Boqueria several times during our stay in Barcelona. The fruit was delicious (we bought it for our breakfast) and so cheap and we enjoyed walking around the many stalls selling different delicious foods. Good place to have a drink and tapas.", "publishedDate": "2020-01-09", "language": "en", "rating": 5}, {"id": 738116737, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d190164-r738116737-Mercat_de_la_Boqueria-Barcelona_Catalonia.html", "text": "Mercat de la Boqueria is located at the city center. You can find everything you like, from meat to fresh fish and sweets to fruits. The only drawbacks are the smell and the fact that some shops were closed and in the evening ", "publishedDate": "2020-01-09", "language": "en", "rating": 4}, {"id": 738055424, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d190164-r738055424-Mercat_de_la_Boqueria-Barcelona_Catalonia.html", "text": "Super tasty food. Everything is fresh and has great taste. We ate fruits, tapas and proscuito crudo.", "publishedDate": "2020-01-09", "language": "en", "rating": 5}, {"id": 737992323, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d190164-r737992323-Mercat_de_la_Boqueria-Barcelona_Catalonia.html", "text": "Amazing food, even worth it if you just want to browse, you will be blown away by the display and quality of 90% of the stalls. We had tapas at one of the olaces and the food was delicious, a bit pricey, my wife and I spent $110€ for some tapas, a glass of wine and a beer. But it was beautiful food. Glad we visited ", "publishedDate": "2020-01-08", "language": "en", "rating": 4}, {"id": 737715233, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d190164-r737715233-Mercat_de_la_Boqueria-Barcelona_Catalonia.html", "text": "Great place to sample local Spanish food.  Convenient.  Fun.  Even had black squid ink rice!  Convenient location!", "publishedDate": "2020-01-07", "language": "en", "rating": 5}, {"id": 737710987, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d190164-r737710987-Mercat_de_la_Boqueria-Barcelona_Catalonia.html", "text": "It is ok, but mostly to buy and go. Hard to get a seat, the places to eat were not so good. We went, had a fresh juice, looked around and left. Not a must to seebor go😱", "publishedDate": "2020-01-07", "language": "en", "rating": 3}, {"id": 737639041, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d190164-r737639041-Mercat_de_la_Boqueria-Barcelona_Catalonia.html", "text": "This is the nicest market that we visited in Barcelona. It is enjoyable just to walk through, although there are good places to eat here as well.", "publishedDate": "2020-01-07", "language": "en", "rating": 5}, {"id": 737637004, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d190164-r737637004-Mercat_de_la_Boqueria-Barcelona_Catalonia.html", "text": "While this looks like a fruit market for locals, it's much more.  Take time to stroll through the aisles and try all of the amazing food options.  There are vendors providing lunch and dinner options as well places offering just dessert.  My favorite was the one offering crepes and bubble waffles.  We also picked up some beautiful fruit to enjoy at the hotel.", "publishedDate": "2020-01-07", "language": "en", "rating": 5}, {"id": 737621321, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d190164-r737621321-Mercat_de_la_Boqueria-Barcelona_Catalonia.html", "text": "Amazing market, fabulous displays and fabulous ‘sit at the counter’ tapas bars. A must on any trip. Fascinating place.", "publishedDate": "2020-01-07", "language": "en", "rating": 5}, {"id": 737561180, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d190164-r737561180-Mercat_de_la_Boqueria-Barcelona_Catalonia.html", "text": "How boring is London's Borough Market in comparison with this feast!  I did so wish I had access to a kitchen! Try the seafood tapas store at the southern corner.  So good we ate there more than once.  Freshest most delicious seafood I have eaten for years! Spring for the mixed Seafood platter - so worth it!!!!", "publishedDate": "2020-01-07", "language": "en", "rating": 5}, {"id": 737377917, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d190164-r737377917-Mercat_de_la_Boqueria-Barcelona_Catalonia.html", "text": "WOW! We didn’t know where to begin and what to buy first, we loved it all. My kids spent their own money to buy strawberries and fruit smoothie and I felt we should have gone when we were really hungry to really get the full benefit of the culinary delights. We bought a wide variety of things and wanted to stay longer but my husband said we needed to go!", "publishedDate": "2020-01-06", "language": "en", "rating": 5}, {"id": 737320013, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d190164-r737320013-Mercat_de_la_Boqueria-Barcelona_Catalonia.html", "text": "I am very fond of local market. This is the real local market where you can buy some good stuff for immediate consumptions, fruits, shakes, fruit based sweeties, and lot more things. You would be gasped for breath as it's bit tight and too much of rush. My suggestion is to go empty stomach so that u can enjoy the food . ", "publishedDate": "2020-01-06", "language": "en", "rating": 5}, {"id": 737100574, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d190164-r737100574-Mercat_de_la_Boqueria-Barcelona_Catalonia.html", "text": "What a great to visit this place. It was a huge of activity from one end of the building to the other, full of locals and tourists doing their shopping or having a good look around to see what was on offer. I was briefly distracted by some loud Cossack sounding music and went for a look. Some dancers were entertaining shoppers further down the market and were joined briefly by an energetic older lady who tried to pass mid-dance. ", "publishedDate": "2020-01-05", "language": "en", "rating": 5}, {"id": 736874107, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d190164-r736874107-Mercat_de_la_Boqueria-Barcelona_Catalonia.html", "text": "This place is a must visit in Barcelona great atmosphere great food can be very busy but well worth visiting ", "publishedDate": "2020-01-04", "language": "en", "rating": 5}, {"id": 736855604, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d190164-r736855604-Mercat_de_la_Boqueria-Barcelona_Catalonia.html", "text": "Many big cities have similar markets but this one is more organized and looks more sophisticated. It is crowded with tourists so be careful about your belongings. \nThere are many stalls selling everything from fruit and olives to fish, from tea to candy. There are also quite a number of tapas bars but it was impossible to get a seat and the prices looked very expensive. It is definitely a good idea to see the market, take some photos and eat somewhere else. ", "publishedDate": "2020-01-04", "language": "en", "rating": 4}, {"id": 736787659, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d190164-r736787659-Mercat_de_la_Boqueria-Barcelona_Catalonia.html", "text": "Nice to spend 1/2 an hour not more \nGrab some cuts fruits and walk thru the aisles.\nGreat place to take photos", "publishedDate": "2020-01-04", "language": "en", "rating": 4}, {"id": 736345067, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d190164-r736345067-Mercat_de_la_Boqueria-Barcelona_Catalonia.html", "text": "What a feast for the senses, a great market to eat and drink your way around, with something for all tastes and ages. Great prices for food to eat as you wander, bars also around the outside to rest your feet and enjoy the sights and sounds. ", "publishedDate": "2020-01-02", "language": "en", "rating": 5}, {"id": 736253883, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d190164-r736253883-Mercat_de_la_Boqueria-Barcelona_Catalonia.html", "text": "So many delicious local foods and cuisines you can find there that it is hard to choose. I simply loved it.", "publishedDate": "2020-01-02", "language": "en", "rating": 5}, {"id": 736171801, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d190164-r736171801-Mercat_de_la_Boqueria-Barcelona_Catalonia.html", "text": "Been to La Boqueria to enjoy seafood dish, there's a lot of food stall that sells the various dish, the best one are to eat Baby octopus, and don't forget the Sangria and Cerveza", "publishedDate": "2020-01-01", "language": "en", "rating": 5}, {"id": 735955705, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d190164-r735955705-Mercat_de_la_Boqueria-Barcelona_Catalonia.html", "text": "avoid if you can.  if visiting take no valuables on any pockets or bags. keep cash on easy to reach inside pocket. don’t keep all cash together.  best food shops are on the outer edges. inner ones are very dangerous. if you see an instant crowd suddenly develop around you be warned you are being targeted. distractions will be created around you to take your attention away from someone reaching from the other side.  avoid the chocolate tent charging rip off prices such as 60 or more euros per Kg.  the fruit tent next to it is also targeted by pick pockets.  barcelona is a pick pocket paradise. with cameras there could be a lot done, but unless the value of item stolen is more than 400 euros the criminals get released the next day after a free dinner and shower.\navoid sea food shops and even tents as sea food packages are mostly loaded with cheap overcooked and dry muscles. \n", "publishedDate": "2019-12-31", "language": "en", "rating": 1}, {"id": 735869315, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d190164-r735869315-Mercat_de_la_Boqueria-Barcelona_Catalonia.html", "text": "One cant visit Barcelona without visiting their most famous market. For the most part I loved the sights, sounds and smells of this market. Take cash, makes it easier to purchase. You can pick up so really good food and snacks but some are overpriced - I think due to it being a tourist attraction.", "publishedDate": "2019-12-31", "language": "en", "rating": 4}, {"id": 735848491, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d190164-r735848491-Mercat_de_la_Boqueria-Barcelona_Catalonia.html", "text": "A very vibrant and colourful market. Amazing food choices and lots to see. Fruit, Ice cream, pastries, Various nuts and many others.\nAlthough not too big place but must visit for an experience.", "publishedDate": "2019-12-31", "language": "en", "rating": 5}, {"id": 735652577, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d190164-r735652577-Mercat_de_la_Boqueria-Barcelona_Catalonia.html", "text": "Right on the La Ramblas this awesome market is a great place for locals and tourists to buy local local produce, nuts, vegetables, meats, and an interesting array of kooky looking seafood in unique stalls. Great place to shop or eat.  Dont miss it.", "publishedDate": "2019-12-30", "language": "en", "rating": 5}, {"id": 735644035, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d190164-r735644035-Mercat_de_la_Boqueria-Barcelona_Catalonia.html", "text": "Had a wander around the market and looked at the meats, fruit, cheese etc. on offer. Lovely to see all the goods being sold but the market is not really any different to many other large markets in Spain. There were only a couple of stalls which provided the opportunity to sit and have something to eat and drink. These were absolutely packed and so rather deterred most visitors.", "publishedDate": "2019-12-30", "language": "en", "rating": 3}, {"id": 735640164, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d190164-r735640164-Mercat_de_la_Boqueria-Barcelona_Catalonia.html", "text": "Although it is perceived to have fresh fruits, the ones that we had were not. Prices on the entrance are significantly higher than inside. ", "publishedDate": "2019-12-30", "language": "en", "rating": 1}, {"id": 735335386, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d190164-r735335386-Mercat_de_la_Boqueria-Barcelona_Catalonia.html", "text": "In a walk from Catalunya Sq, down to Columbus Circle, you must stop in La Boquería to have at least a bite of fresh fruits, iberic jam w/ a glass of wine.\nVery crowded place, so you'd better go there early at noon, or before 1pm in the afternoon.", "publishedDate": "2019-12-29", "language": "en", "rating": 5}, {"id": 735248037, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d190164-r735248037-Mercat_de_la_Boqueria-Barcelona_Catalonia.html", "text": "Great to see all the different produce - fruits, nuts, vegetables, meats, seafood - in stall after stall.  Perfect to shop, or for lunch.  Market has a unique vibe and is a memorable part of Barcelona ", "publishedDate": "2019-12-28", "language": "en", "rating": 5}, {"id": 735236028, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d190164-r735236028-Mercat_de_la_Boqueria-Barcelona_Catalonia.html", "text": "With its colours and different amazing little fruits, seafood, olives, mushrooms ... it will take your heart people.\nI loved it. One of the best markets I have ever seen in my life. U can take lunch or breakfast there. U can find smoothies, fruits ready to be eaten or also salty food.", "publishedDate": "2019-12-28", "language": "en", "rating": 5}, {"id": 735148449, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d190164-r735148449-Mercat_de_la_Boqueria-Barcelona_Catalonia.html", "text": "Not huge but great variety and an awesome place to grab some snacks including plenty of vegetarian options. Place gets very crowded quick but it was still very enjoyable and reasonably priced. \nThe ham selection was incredible. \nAmazingly, with all the meat and fish, not an unpleasant odor. Speaks to the quality. ", "publishedDate": "2019-12-28", "language": "en", "rating": 5}, {"id": 735136084, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d190164-r735136084-Mercat_de_la_Boqueria-Barcelona_Catalonia.html", "text": "Of course you have to stop here and see while your in Barcelona. It was nice and very bright but people were pushy selling stuff. The fish area was amazing but in certain places it smelled really fishy in a bad way. The fruit juices were really good and cheap. The empanadas were really good and so many different flavors to choose from. ", "publishedDate": "2019-12-28", "language": "en", "rating": 3}, {"id": 734979343, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d190164-r734979343-Mercat_de_la_Boqueria-Barcelona_Catalonia.html", "text": "It's a good market with alot of variety of foods and a few tapas bars.\nAt the end of the day I've seen much bigger and more authentic Spanish markets in Madrid and Valencia.\nIt's become way too touristy.", "publishedDate": "2019-12-27", "language": "en", "rating": 3}, {"id": 734889385, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d190164-r734889385-Mercat_de_la_Boqueria-Barcelona_Catalonia.html", "text": "It's not that it's not a good market but it's a very overrated one as from my point of view the London Borough Market  and the Jerusalem Mahane Yehuda Market  are more interesting than it.\nIt's relatively small but clean with many places to seat and eat .", "publishedDate": "2019-12-27", "language": "en", "rating": 4}, {"id": 734628052, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d190164-r734628052-Mercat_de_la_Boqueria-Barcelona_Catalonia.html", "text": "Boqueria Market is incredible, you can lose yourself just looking at all the selection of any area. So many restaurants to taste. \nA must to spend at least one day here. Amazing!!", "publishedDate": "2019-12-25", "language": "en", "rating": 5}, {"id": 734499104, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d190164-r734499104-Mercat_de_la_Boqueria-Barcelona_Catalonia.html", "text": "We enjoyed walking through this market but it was very crowded even for the evening time. The fruit stands were our favorite. ", "publishedDate": "2019-12-24", "language": "en", "rating": 3}, {"id": 734358272, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d190164-r734358272-Mercat_de_la_Boqueria-Barcelona_Catalonia.html", "text": "This is the very best outdoor market I’ve ever been to.  Fresh fruit, veggies, juices, fish, pastries, sandwiches, chocolates, candies, nuts & meats were fresh and some many displays were a work of art...beautiful.  A must visit to your trip to Barcelona.", "publishedDate": "2019-12-23", "language": "en", "rating": 5}, {"id": 734212446, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d190164-r734212446-Mercat_de_la_Boqueria-Barcelona_Catalonia.html", "text": "This was a great place to visit and sample food for a few hours. We went on a weekday at lunch so it wasn’t as busy as the weekend. We sampled food at two different locations. Both were good. Both had fresh seafood. This market is a food lovers paradise with many local meats, fruit, fish, nuts, etc. You can purchase fresh items to cook at home if you are local, or you can visit one of the local stands that prepares the food in front of you. It’s under roof so the rain that day did not bother us. ", "publishedDate": "2019-12-22", "language": "en", "rating": 5}, {"id": 733783296, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d190164-r733783296-Mercat_de_la_Boqueria-Barcelona_Catalonia.html", "text": "It is the biggest food market in the town. \nIt has everything about food \nBe careful , because in some places people are overcharging the products . \nWe had lunch in one of the Sea food places ( Quiosc modern ) and it was not expensive and very tasty. \nWe did not find dessert because it was overcharged ( 83 € per kilos for chocolate ! ) \nStrongly recommend the visit ", "publishedDate": "2019-12-20", "language": "en", "rating": 5}, {"id": 733484924, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d190164-r733484924-Mercat_de_la_Boqueria-Barcelona_Catalonia.html", "text": "Amazing market located near the Plaça de Catalunya. So many delicious treats including fresh seafood, jamon, eggs, fresh fruits and veggies, candy and more! \n\nOur favorite was the fruit stands where you can get fresh juice for just 1€! While my husband tried different juices the two times we stopped in, I was all about the pitahaya coco (dragon fruit and coconut). Seriously, only 1€!!\n\nThis is our second trip to Barcelona and we had to stop back at a seafood stand called La Peixera. They have a variety of paper cones with mixed fried seafood for 5€. While other stalls also have fried foods in paper cones, we like La Peixera because they will freshly fry your order before serving you. \n\nPro tip: There are many stalls that sell similar things, so I suggest walking around first to scope out the whole market first. While you may be tempted to buy from the first stall you see, you are likely to find the same items just a few rows back for a cheaper price.", "publishedDate": "2019-12-18", "language": "en", "rating": 5}, {"id": 733424460, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d190164-r733424460-Mercat_de_la_Boqueria-Barcelona_Catalonia.html", "text": "Always go here when we are in Barcelona,trake in all the wonderful selection of food and then enjoy lunch at one of the stalls. Not cheap but tasty and great fun you just have to do it.", "publishedDate": "2019-12-18", "language": "en", "rating": 5}, {"id": 733393343, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d190164-r733393343-Mercat_de_la_Boqueria-Barcelona_Catalonia.html", "text": "A fantastic market full of different foods and vibrant colours. Chocolates, confectionary, fresh fruit/vegetables, seafood and cured meats. A great market experience right in the heart of Barcelona. ", "publishedDate": "2019-12-18", "language": "en", "rating": 5}, {"id": 733230051, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d190164-r733230051-Mercat_de_la_Boqueria-Barcelona_Catalonia.html", "text": "Friends recommended we make time to visit the Mercat de Le  Boquoria.  So glad they did!  What a wonderful market to explore!  Loved the Tapas Bars, also.", "publishedDate": "2019-12-17", "language": "en", "rating": 5}, {"id": 733057846, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d190164-r733057846-Mercat_de_la_Boqueria-Barcelona_Catalonia.html", "text": "Well, having been numberous local markets throughout spain in this trip, i m a bit disappointed on this market. It really cster to tourists, no local  shop there st all!", "publishedDate": "2019-12-16", "language": "en", "rating": 3}, {"id": 733036692, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d190164-r733036692-Mercat_de_la_Boqueria-Barcelona_Catalonia.html", "text": "La Rambla market is fruit, vegetable, fish market in Barcelona, I forgot nuts too, is a beautiful clean market to visit, great place to visit, it is absolutely huge. We had some excellent fish for our supper, reasonable prices. Also bought some very tasty yellow cheese to bring home. Packed with people, tourists, this is a must when you visit Barcelona. Enjoy your meal there. BRAVO", "publishedDate": "2019-12-16", "language": "en", "rating": 4}, {"id": 732942190, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d190164-r732942190-Mercat_de_la_Boqueria-Barcelona_Catalonia.html", "text": "It’s good street markets there you can find food ,snacks , spices, nuts , fresh juices and fish markets.  \n", "publishedDate": "2019-12-15", "language": "en", "rating": 5}, {"id": 732900946, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d190164-r732900946-Mercat_de_la_Boqueria-Barcelona_Catalonia.html", "text": "For me this was the best market in all of Barcelona. HUGE. Lots of Tapas and great snacks as you walk through. Prices are decent as well. Lots of great seafood too!! ", "publishedDate": "2019-12-15", "language": "en", "rating": 5}, {"id": 732900393, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d190164-r732900393-Mercat_de_la_Boqueria-Barcelona_Catalonia.html", "text": "Feast for the senses!  Visually, auditory and taste!\nWho has this fine collection of produce in December!  \nThe vendors nearest the entrance are the most expensive.  \nEnjoy!", "publishedDate": "2019-12-15", "language": "en", "rating": 5}, {"id": 732732199, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d190164-r732732199-Mercat_de_la_Boqueria-Barcelona_Catalonia.html", "text": "Amazing market even just to browse! Lots of Jamon specialist stalls, fruit, meat, and seafood. Not many green grocers - only on the fringes in the morning. Lovely food stalls too - notable ones are Bar Ramblero, Bar Pintxos, Bar Central and El Quim. Do watch out for days of religious significance as the market will be closed. Google searches and web info may not be accurate as we found out. Eg. All Saints Day - Market is closed and so are some restaurants/eateries.", "publishedDate": "2019-12-14", "language": "en", "rating": 5}, {"id": 732625989, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d190164-r732625989-Mercat_de_la_Boqueria-Barcelona_Catalonia.html", "text": "Came back here after a few years. And it's still the best Mercado around. Not just in this city. \nThe smells, the colours, the food! A feast for your eyes and palate. A great number of stalls offering fresh vegetables, fruit, nuts, fish, seafood, meat, aged Jamon, spices and drinks. Then there are the stalls who serve lunch and dinner with seats. All kinds of seafood and meats, with beer and a full bar sometimes. We especially enjoyed the fresh oysters and sea urchin here (get them at Peixateria Manolo) . And - the best for last - the 5-year old Iberico Jamon cuts from the stall called \"JJ\". Divine pieces of meat. The very top.\n\nEven you didn't plan on eating anything it's worth to come and have a stroll. But probably you can't resist buying and/or eating something here. There's just something for everybody. Yes, it can get really packed, but it's worth it. Sadly it's always closed on sundays.", "publishedDate": "2019-12-14", "language": "en", "rating": 5}, {"id": 732457929, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d190164-r732457929-Mercat_de_la_Boqueria-Barcelona_Catalonia.html", "text": "What a wonderfull place! We felt like we went back in time. I wish that kind of markets would be in my hometown!", "publishedDate": "2019-12-13", "language": "en", "rating": 5}, {"id": 732356677, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d190164-r732356677-Mercat_de_la_Boqueria-Barcelona_Catalonia.html", "text": "It seems like the park is always crowded with tourists & definitely overpriced compared to other local markets but I understand why. However, I still recommend visiting just for the experience when around Las Ramblas!", "publishedDate": "2019-12-12", "language": "en", "rating": 4}, {"id": 732321879, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d190164-r732321879-Mercat_de_la_Boqueria-Barcelona_Catalonia.html", "text": "If you want a tantalising place to go this is the place. This market although small is world class. The array of foods from fish, chocolates to infused salts is amazing. Allow yourself  some time to wonder. Everyone from pensioner to young children will be enthralled.", "publishedDate": "2019-12-12", "language": "en", "rating": 5}, {"id": 732058372, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d190164-r732058372-Mercat_de_la_Boqueria-Barcelona_Catalonia.html", "text": "Market with an amazing atmosphere, full of fresh food with reasonable prices. Here you can eat all kinds of meat, seafood, fresh fruits... I ate cherries in december! Everything is so vivid! Worth a visit.", "publishedDate": "2019-12-11", "language": "en", "rating": 5}, {"id": 732052764, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d190164-r732052764-Mercat_de_la_Boqueria-Barcelona_Catalonia.html", "text": "OMG if I lived in Barcelona I’d be here all the time.    It’s a big tease to travelers because you simply want to buy everything—-eggs, ham, beef, veggies, seafood, wine, beer...so you’ll have to settle for the terrific restaurant at the back of the market, across from the stairs to the WCs.     We camped out there for a couple hours and had the coldest beer and freshest fried squid EVER.     So simply prepared their seafood, but so delicious.    The kid next to me had beautifully grilled vegetables on a platter.   YUM!", "publishedDate": "2019-12-11", "language": "en", "rating": 5}, {"id": 731914652, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d190164-r731914652-Mercat_de_la_Boqueria-Barcelona_Catalonia.html", "text": "This is a vibrant engaging market with lots of food options. It is however I think a bit overhyped. Especially in the mornings lots of stalls empty and vendors still setting up. I didn’t find the vendors very friendly and welcoming either. It’s worthwhile for a stroll through and perhaps to eat a meal but it’s not a top 10 attraction as it seems to be thought of by many. ", "publishedDate": "2019-12-10", "language": "en", "rating": 4}, {"id": 731913824, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d190164-r731913824-Mercat_de_la_Boqueria-Barcelona_Catalonia.html", "text": "It was packed when we went here. Once we were inside, I was overwhelmed. I couldn't decide where to look and so many samples were being pushed our way. Meats, fresh seafood, tropical fruits, candies and just about anything you could think of to eat is here. I could spend all day in this market. I went 3 times and took my time to really take in the food sights. Needless to say, I bought quite a lot of items here. Definitely will go back again when I return to Barcelona in 6 months. Can't wait!", "publishedDate": "2019-12-10", "language": "en", "rating": 5}, {"id": 731887047, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d190164-r731887047-Mercat_de_la_Boqueria-Barcelona_Catalonia.html", "text": "We stumbled upon St Josef Market by chance and what a fantastic surprise \nFull of fresh food at very reasonable prices, from fresh fish to nuts to fruit and cheeses... absolutely worth a visit you won’t be disappointed ", "publishedDate": "2019-12-10", "language": "en", "rating": 5}, {"id": 731871373, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d190164-r731871373-Mercat_de_la_Boqueria-Barcelona_Catalonia.html", "text": "This very famous market is an amazing place. Well worth a visit. However most of the stall holders were very bad tempered and rude. We asked if we could take photos and they waved us away, gesturing and shouting. Well it is a tourist attraction but they were obviously very fed up with tourists overall. We asked a stall holder a price and they ignored us and made a rude gesture. Oh well! ", "publishedDate": "2019-12-10", "language": "en", "rating": 4}, {"id": 731827930, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d190164-r731827930-Mercat_de_la_Boqueria-Barcelona_Catalonia.html", "text": "We visited about 4 times, and always packed, always fun! Tried different food, and it was all good. Loaded up on fruit to keep at hotel, ham of course, tried cheeses, and had fun just looking around!", "publishedDate": "2019-12-10", "language": "en", "rating": 5}, {"id": 731646170, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d190164-r731646170-Mercat_de_la_Boqueria-Barcelona_Catalonia.html", "text": "Oldest market in modern building. Here you can get whatever you want: fruits, fish, meat, sweets, nuts, herbs, food etc. Unfortunately haven't tryed the seafood place here. But everything looked so tasty!", "publishedDate": "2019-12-09", "language": "en", "rating": 4}, {"id": 731567930, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d190164-r731567930-Mercat_de_la_Boqueria-Barcelona_Catalonia.html", "text": "Any place I visit I like to go to the markets. You get a feel for a town this way. This market catered both to tourists, and locals. I enjoyed the sights and smells. As expected, it was heavy on meat and sea food. Even so, there was adequate choices for my vegetarian wife.prices were a bit high, but not exorbitant. ", "publishedDate": "2019-12-09", "language": "en", "rating": 4}, {"id": 731453299, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d190164-r731453299-Mercat_de_la_Boqueria-Barcelona_Catalonia.html", "text": "Went here for seafood and it is beyond expectation. Reasonable price and portion. Had I not been full, I would have gone for full seafood platter. It serves a variety of fresh food and a selection of fresh fruit juices. Just be patient and choose the ones with 1 euro.", "publishedDate": "2019-12-08", "language": "en", "rating": 5}, {"id": 731410371, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d190164-r731410371-Mercat_de_la_Boqueria-Barcelona_Catalonia.html", "text": "Time has passed since local people went to La Boqueria Market in order to purchase their weekly or daily goods ( usually fish, vegetables, meat, wine, ...).\nCurrently, a crowd of tourists invades all the corridors and only buy fruit juicies (in plastic pots !!!!) and disturb people who, like me, have to buy my weekly food.\n\nAnother place in this unrecognisable Barcelona that was another kind of city and any longer will be a popular city. Just a theme park for tourists.\n\nPity the tourist globalization.", "publishedDate": "2019-12-08", "language": "en", "rating": 1}, {"id": 731041752, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d190164-r731041752-Mercat_de_la_Boqueria-Barcelona_Catalonia.html", "text": "I liket this market. It was filled with all kind of fruit, meat, sweets, fish, but I didn't like that the prices were changing from day to day. For example on Tuesday the fruit juice was 1 euro, the next day 2 euros, and on Thurday was 1,5 Euros. ", "publishedDate": "2019-12-06", "language": "en", "rating": 5}, {"id": 730976061, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d190164-r730976061-Mercat_de_la_Boqueria-Barcelona_Catalonia.html", "text": "Beautiful market filled with fresh fruit, vegetables, fish, meats, nuts, cheese and wine. Very crowded and I didn't find any stalls giving free samples but it's a must see", "publishedDate": "2019-12-06", "language": "en", "rating": 5}, {"id": 730911823, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d190164-r730911823-Mercat_de_la_Boqueria-Barcelona_Catalonia.html", "text": "Haven been to Barcelona for at least ten years and when the opportunity came up to visit Mercat De la Boqueria was one of the first we revisited. \n\nIt’s like seeing a good old friend after so many years, boy has she scrubbed up well! \n\nClean, well presented and super busy as always. \n\nThe layout is good and the offerings outstanding as always.\n\nWe had lunch two days in a row at two different stalls in the market and both were equally as good and reasonably priced. \n\nYes there are tourist and Barcelona is showing her food to the rest of the world in style. \n\nOur favourite market of all wet visited across the world!", "publishedDate": "2019-12-05", "language": "en", "rating": 4}, {"id": 730878396, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d190164-r730878396-Mercat_de_la_Boqueria-Barcelona_Catalonia.html", "text": "This is a great fun market with lots of fresh and cooked food choices. The street outside of the market has lots of restaurants as well. Market can get really crowded. This is the only type of scenario that I felt it was warranted to be really careful of your surroundings. A lot of the areas around the market have dimly lit streets and we were warned to be careful by a shop keeper and a taxi driver.", "publishedDate": "2019-12-05", "language": "en", "rating": 4}, {"id": 730817325, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d190164-r730817325-Mercat_de_la_Boqueria-Barcelona_Catalonia.html", "text": "You won't find many food markets as colourful, vibrant and productive as Mercat de la Boqueria. Located in La Rambla, its a prime spot for fresh food lovers. Fruits, veges, meat, sea food, nuts..... you name a thing and it is there. Many of the thing can be cooked fresh for you and served right there. What a treat to be there.", "publishedDate": "2019-12-05", "language": "en", "rating": 5}, {"id": 730768237, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d190164-r730768237-Mercat_de_la_Boqueria-Barcelona_Catalonia.html", "text": "Came here after hearing so much about this place. It was not a disappointment at all, its a little over rated. If you are in the Las Ramblas area its definitely a great place to stop by and get cheap eats. The juices were amazinly good. I found a coconut/papaya drink that was mind blowing. They serve fresh oysters on the shell and Boket had tasty snacks and a kind patient staff. All in all it was a good market.", "publishedDate": "2019-12-05", "language": "en", "rating": 4}, {"id": 730502543, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d190164-r730502543-Mercat_de_la_Boqueria-Barcelona_Catalonia.html", "text": "There is nothing better than walking the isles and getting a beer, then some seafood, then some good ham, a piece of fruit, etc. I really enjoy this as I can try so many different things, talk to the vendors and compare prices and quality. At the end, I may have spent 100-euros, but the family was happy and ready for the afternoon stroll down to the barceloneta. ", "publishedDate": "2019-12-03", "language": "en", "rating": 5}, {"id": 730477563, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d190164-r730477563-Mercat_de_la_Boqueria-Barcelona_Catalonia.html", "text": "A market that you can find any type of jamon, chocolate and fish. Nice place but overpriced on the heard of las ramblas.", "publishedDate": "2019-12-03", "language": "en", "rating": 3}, {"id": 730471107, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d190164-r730471107-Mercat_de_la_Boqueria-Barcelona_Catalonia.html", "text": "Lots to check out and see. It felt very authentic. Drinks, gelato, churros and chocolate, fresh seafood, etc", "publishedDate": "2019-12-03", "language": "en", "rating": 3}, {"id": 730266641, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d190164-r730266641-Mercat_de_la_Boqueria-Barcelona_Catalonia.html", "text": "Great little market in the center of Madrid. Lot to see and eat around. Inside market food is expensive but same options with cheaper price available right outside. ", "publishedDate": "2019-12-02", "language": "en", "rating": 5}, {"id": 730198818, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d190164-r730198818-Mercat_de_la_Boqueria-Barcelona_Catalonia.html", "text": "It is absolutely fantastic. The variety of different food and the presentation of it is just mind blowing. Recommend it to anyone!", "publishedDate": "2019-12-02", "language": "en", "rating": 5}, {"id": 730030265, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d190164-r730030265-Mercat_de_la_Boqueria-Barcelona_Catalonia.html", "text": "\nWe enjoyed strolling through the market, which is both beautiful and scrumptious. We purchased empanadas and other candies, and loved perusing the various offerings of produce, seafood, baked goods, wines and more. Everything imaginable. Unfortunately it was pouring rain outside so we didn't get to linger too long or sit outside in one of the sidewalk offshoots of the market. Highly recommend the visit.", "publishedDate": "2019-12-01", "language": "en", "rating": 5}, {"id": 730014825, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d190164-r730014825-Mercat_de_la_Boqueria-Barcelona_Catalonia.html", "text": "...it reminded me of my childhood markets in Lima (just cleaner...) with a lot of seafood to buy...but if you compare it with the variety of such markets as Borough Market in London...this one offers only produce, seafood, jam (expensive) and has a couple of food places...   ", "publishedDate": "2019-12-01", "language": "en", "rating": 3}, {"id": 729831134, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d190164-r729831134-Mercat_de_la_Boqueria-Barcelona_Catalonia.html", "text": "Like the most of all \"Mercados\" all around the world, it's funny to see what they are selling.. But the difference is that, this market is a bit touristic with all the atmosphere, but doesnt feel local at all.. \n\nIt's located in the middle of the famous LaRambla Avenue. \n\nCool seafood selections to buy or even have a bite with a beer beside, but also tons of tropical fruits etc...\n\nOh, one more thing... DONT DARE TO TOUCH ANYTHING:)))  You are not welcome at all...", "publishedDate": "2019-11-30", "language": "en", "rating": 3}, {"id": 729788829, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d190164-r729788829-Mercat_de_la_Boqueria-Barcelona_Catalonia.html", "text": "Big impressive market, so many stalls it was hard to see everything offered.  Would have been more enjoyable if there were not so many people.", "publishedDate": "2019-11-30", "language": "en", "rating": 4}, {"id": 729788707, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d190164-r729788707-Mercat_de_la_Boqueria-Barcelona_Catalonia.html", "text": "True Barcelona market. Everything your sense could want. Ask before taking photos! Lots of variety from food to price. Go for brunch and walk as you get a fresh smoothie, meat and cheese cone, fried sausage and more!", "publishedDate": "2019-11-30", "language": "en", "rating": 5}, {"id": 729722887, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d190164-r729722887-Mercat_de_la_Boqueria-Barcelona_Catalonia.html", "text": "An amazing market but has been the busiest we have been to. Definitely felt hungry as we walked around if you wan meat cones, this is the place to go. Had some tapas and the best scallops of my life.", "publishedDate": "2019-11-29", "language": "en", "rating": 5}, {"id": 729659328, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d190164-r729659328-Mercat_de_la_Boqueria-Barcelona_Catalonia.html", "text": "Stumbled across the market whil st having an evening stroll through Kax Ramblas.  Sadly it was closing, at just about 8pm, but we will return.", "publishedDate": "2019-11-29", "language": "en", "rating": 5}, {"id": 729411786, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d190164-r729411786-Mercat_de_la_Boqueria-Barcelona_Catalonia.html", "text": "This is a very big and very beautiful market with lots of different fun and unique places selling everything from snacks to vegetables, Although it is a bit expensive but a nice place to visit.", "publishedDate": "2019-11-28", "language": "en", "rating": 4}, {"id": 729149347, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d190164-r729149347-Mercat_de_la_Boqueria-Barcelona_Catalonia.html", "text": "I tried the freshest calamari rings from the market which only costed €5! Their fish in the market is very fresh, keep in mind the people over here do not fish on Sundays so it’s better to come on a Tuesday to try or eat any kind of seafood. They have ice cream gelatos, meat, seafood, fruit drinks, food bars, crepes and a lot of fresh fruit.", "publishedDate": "2019-11-26", "language": "en", "rating": 3}, {"id": 729090129, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d190164-r729090129-Mercat_de_la_Boqueria-Barcelona_Catalonia.html", "text": "It was nice walking through the market and seeing the various different foods for sale Lots of meats Quite crowded in the evening", "publishedDate": "2019-11-26", "language": "en", "rating": 5}, {"id": 729063072, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d190164-r729063072-Mercat_de_la_Boqueria-Barcelona_Catalonia.html", "text": "Q-Trip: Want a snack? This is the place.\nQ-Trip: Washroom? Try Starbucks and the bathroom is \n              mixed so do not let the ladies’ line-up slow you \n              down. Squeeze by for men’s room to right with  urinal. \nQ-Trip: Looking for hostess gifts and extra agents for \n             the kitchen. You have the duct tape and bubble \n             wrap in suitcase BUT did you bring a shopping bag \n             to the market? Eliminate the plastic. \n\n              At least three sit down spots too ... just packed.\nA feast for the eyes in anything food. The fish choices were deep. The mushroom choices a spectacle. ", "publishedDate": "2019-11-26", "language": "en", "rating": 5}, {"id": 728860270, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d190164-r728860270-Mercat_de_la_Boqueria-Barcelona_Catalonia.html", "text": "I've been visiting Barcelona for years for work but this is the first time I've got to spend proper leisure time there.\nThe St Josef Market is the most wonderful place to visit. The vibrancy and energy of the place coupled with the colours, smells and general hustle and bustle make this a must visit destination. We went every morning for fruit and a smoothy, we bought lunch there and even found ourselves having drinks one night in one of the restaurants that surrounds the square. If we'd have had the time we could easily have spent the whole day there. ", "publishedDate": "2019-11-25", "language": "en", "rating": 5}, {"id": 728627824, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d190164-r728627824-Mercat_de_la_Boqueria-Barcelona_Catalonia.html", "text": "This is the most amazing food shopping experience I have ever had. It expanded my horizons about what is possible. I've never seen so many fresh fruits, vegetables, meats, chicken, seafoods, cheeses, olive oils, and specialty foods displayed so beautifully. It's a big reason to return to Barcelona. I can't say enough about it; words are insufficient to describe how astonishing it is and how worthwhile.", "publishedDate": "2019-11-24", "language": "en", "rating": 5}, {"id": 728607548, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d190164-r728607548-Mercat_de_la_Boqueria-Barcelona_Catalonia.html", "text": "Nice place to get Ingredients but not lot of options for ready made food. Good place if you are staying in airbnb and going to cook yourself.", "publishedDate": "2019-11-24", "language": "en", "rating": 3}, {"id": 728333947, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d190164-r728333947-Mercat_de_la_Boqueria-Barcelona_Catalonia.html", "text": "Great market for a visit. Selection is enormous, but it's also wery crowded. We didn't eat anything there, it's a lot of mouthwatering snacks to find. Worth a visit.", "publishedDate": "2019-11-23", "language": "en", "rating": 4}, {"id": 728258761, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d190164-r728258761-Mercat_de_la_Boqueria-Barcelona_Catalonia.html", "text": "A vast array of food stalls to delight the senses. Some pleasant tapas bars where you can drink in the comings and goings in this amazing market", "publishedDate": "2019-11-22", "language": "en", "rating": 5}, {"id": 728219307, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d190164-r728219307-Mercat_de_la_Boqueria-Barcelona_Catalonia.html", "text": "It's right off Las Ramblas and it's interesting to look around at all the food options.  We bought some spices and other small items that we could take on the plane.  There are spots to get a meal too.", "publishedDate": "2019-11-22", "language": "en", "rating": 4}]}}]