[{"locationId": 7208916, "name": "Rambla del Poblenou", "placeType": "ATTRACTION", "reviewListPage": {"reviews": [{"id": 626871836, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d7208916-r626871836-Rambla_del_Poblenou-Barcelona_Catalonia.html", "text": "A tree lined rambla offers shops restaurants and traffic free strolling. A bit less touristy that The Ramblas so actually more pleasant. Has a park area near the sea.", "publishedDate": "2018-10-20", "language": "en", "rating": 4}, {"id": 621851139, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d7208916-r621851139-Rambla_del_Poblenou-Barcelona_Catalonia.html", "text": "The Rambla del Poblenou is a restaurant & shop lined avenue near the Glories area of Barcelona.  It ends at the beach and runs from the beach up to Avenue Diagonal.  We stayed nearby at the IBIS hotel de Glories 22, only a three block walk from the Rambla.  Each of the four nights we ventured to the Rambla for dinner we were delighted to find tables in the streets with willing wait-staff and excellent food and beverages to taste.  Although we visited dozens of sites in Barcelona, we felt most at home and relaxed along the Rambla del Poblenou.", "publishedDate": "2018-10-03", "language": "en", "rating": 5}, {"id": 620566662, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d7208916-r620566662-Rambla_del_Poblenou-Barcelona_Catalonia.html", "text": "Not overly crowded with tourists because this area is a bit far from the usual tourist attractions in the city. Lovely Ramblas with great restaurants. Once you have enjoyed the walk to the sea on the Ramblas here, venture on the cute side streets to the left (facing the sea). Charming area.", "publishedDate": "2018-09-29", "language": "en", "rating": 5}, {"id": 620351258, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d7208916-r620351258-Rambla_del_Poblenou-Barcelona_Catalonia.html", "text": "We wandered down at night.  Large and diverse selection of places to eat and not as crowded as other places.  Great at night time we sat outside and had tapas.", "publishedDate": "2018-09-28", "language": "en", "rating": 4}, {"id": 614902644, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d7208916-r614902644-Rambla_del_Poblenou-Barcelona_Catalonia.html", "text": "Lots of restaurants most you can eat outside as well, lots of bars and shops. Lovely area to watch the world go by.", "publishedDate": "2018-09-08", "language": "en", "rating": 5}, {"id": 606461840, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d7208916-r606461840-Rambla_del_Poblenou-Barcelona_Catalonia.html", "text": "Rambla del Poblenou is like the well-known Rambla between Barri Gotic and El Raval, except for the tourists. Here are much less tourists.\nIt's a cosy place.\nRambla del Poblenou situated in the middle of the neighborhood El Poblenou. It is about 1200 meter long from northwest to southeast.\nMetro-Stations Llacuna and Poblenou are both about 300 meter from The Rambla.", "publishedDate": "2018-08-14", "language": "en", "rating": 4}, {"id": 602804849, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d7208916-r602804849-Rambla_del_Poblenou-Barcelona_Catalonia.html", "text": "If you want to be away from the touristy side of Barcelona, and enjoy the local life (food and drinks wise), this is a good place to start! Ideal time 6pm-1am", "publishedDate": "2018-08-04", "language": "en", "rating": 5}, {"id": 601467766, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d7208916-r601467766-Rambla_del_Poblenou-Barcelona_Catalonia.html", "text": "This is a fun street, big trees provide the much needed afternoon shade. Lots of restaurant options and unfortunately so interesting shops to attract my wife. ", "publishedDate": "2018-07-31", "language": "en", "rating": 4}, {"id": 599928442, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d7208916-r599928442-Rambla_del_Poblenou-Barcelona_Catalonia.html", "text": "This neighborhood was a great place to stay, eat, have coffee, access green tourist bus route and walk to beaches.  Loved the local shops for gelato and there was a cute shop for kid’s clothes.  Many parks for children.", "publishedDate": "2018-07-26", "language": "en", "rating": 5}, {"id": 588605682, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d7208916-r588605682-Rambla_del_Poblenou-Barcelona_Catalonia.html", "text": "love the feeling of togetherness in this area, close to the beach and many nice restaurants and bars to enjoy!", "publishedDate": "2018-06-18", "language": "en", "rating": 5}, {"id": 586387645, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d7208916-r586387645-Rambla_del_Poblenou-Barcelona_Catalonia.html", "text": "a much more relaxed atmosphere than the Las Ramblas in the centre. it is nice fo ra summer walk after the beach. do not miss the parallel street Maria Aguilo with the pisntoresc houses and \"hidden gem\" shops", "publishedDate": "2018-06-10", "language": "en", "rating": 4}, {"id": 563376118, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d7208916-r563376118-Rambla_del_Poblenou-Barcelona_Catalonia.html", "text": "In crowded, touristy cities I love finding the locals spots where the residents are going about their lives. There are plenty of dining and retail options between Ave Diagonal and the Mediterranean Sea.", "publishedDate": "2018-02-28", "language": "en", "rating": 5}, {"id": 547325288, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d7208916-r547325288-Rambla_del_Poblenou-Barcelona_Catalonia.html", "text": "Very relaxed excellent position. 100M Rambla del Poblenou has the best and cheapest Tapas in Spain. Excellent service , Service, products fresh and prepared in front of you. A must do in Barcelona. ", "publishedDate": "2017-12-15", "language": "en", "rating": 5}, {"id": 530896042, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d7208916-r530896042-Rambla_del_Poblenou-Barcelona_Catalonia.html", "text": "This is an incredible neighborhood to enjoy dining and shopping. At the end of the street is the Mediterranean- Platja de la mar Bella - much quieter than the main beach. Every store they speak English. ", "publishedDate": "2017-10-07", "language": "en", "rating": 5}, {"id": 522001707, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d7208916-r522001707-Rambla_del_Poblenou-Barcelona_Catalonia.html", "text": "Here all life exists!!\nAt one end the great soft clean beach at the other, the Mecca of shopping.\n Between these two points all can be found. Peaceful friendly bars, quaint artsy boutiques, gift and souvenir shops, food markets, bars did I mention the bars.Whatvever your tastes whatever your needs catered for it is here !!", "publishedDate": "2017-09-06", "language": "en", "rating": 5}, {"id": 518504678, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d7208916-r518504678-Rambla_del_Poblenou-Barcelona_Catalonia.html", "text": "In our experience this successful pedestrian’s street is a very good option if you want to rest of the strong tourist circuit. It offers an environment of peace, relaxing walking  and maybe having the opportunity of sharing with locals. There are lots of options to eat or drink, we specially recommended it between the end of the afternoons and evenings. You can also have a lot of options to eat or drink something in the relaxing atmosphere, this street  finish at the beach, for us is perfect walk especially between afternoon and evening.  \n\n", "publishedDate": "2017-08-28", "language": "en", "rating": 4}, {"id": 506544717, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d7208916-r506544717-Rambla_del_Poblenou-Barcelona_Catalonia.html", "text": "We stayed at a hotel nearby, and walked along Rambla del Poblenou most days and/or nights. This Rambla is smaller, quieter than Las Ramblas de Catalunya, and more to our preference. Great tapas, great Ice Cream, everything we needed!", "publishedDate": "2017-07-28", "language": "en", "rating": 4}, {"id": 506079000, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d7208916-r506079000-Rambla_del_Poblenou-Barcelona_Catalonia.html", "text": "This is hands down far better than the tourist filled las ramblas in the center. It is filled with lovely bars and restaurants and leads right to the beach. We were staying a few blocks down and this was where we spent all our evenings eating and drinking on the terraces...a must visit if you are in the neighbourhood ", "publishedDate": "2017-07-27", "language": "en", "rating": 5}, {"id": 505544702, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d7208916-r505544702-Rambla_del_Poblenou-Barcelona_Catalonia.html", "text": "we stayed at Hesparia del Mar for a week so this was our 'hood. Rambla del Poblenou fabulous for people watching but we found the side streets and alleyways better for cheap eats/authentic food. but the difficulty there of course, is trying to get them added to Trip Advisor. Ive two pending but getting adequate details difficult - although they can readily be found on google! I digress however, this is a classic stroll - we tended to walk a km or so to midway (from the beach end) then meander back and just stop for a vino when close to the beach end. Then cross to the beach (a main road between but a direct overpass) then amble back to our hotel with the beach views...would recommend staying in area rather than just visiting. The Poblenou train station is on a direct line to the classic tourist centre around the gothic quarter and La Rambla with only around 5-6 stops which equates to roughly 10-12 minutes and trains frequent.", "publishedDate": "2017-07-25", "language": "en", "rating": 4}, {"id": 499487108, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d7208916-r499487108-Rambla_del_Poblenou-Barcelona_Catalonia.html", "text": "We are staying at the Four Points Sheraton,  so this is our neighborhood for five days. \n\nThe atmosphere is lively, lovely and safe. No need to look over your shoulder like the other touristy Las Ramblas.\n\nThere are several restaurants and bars to choose from. \n\nReally liked the Area. At the end of this Ramblas,  there is a beach. Tonight there's a beerfest\n\n", "publishedDate": "2017-07-07", "language": "en", "rating": 4}, {"id": 499275246, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d7208916-r499275246-Rambla_del_Poblenou-Barcelona_Catalonia.html", "text": "Beautiful pedestrian walk from the beach to the mountains in Poblenou.  The locals avoid Las Ramblas and the throngs of tourists favouring this Rambla.  Lined with outdoor restaurants, bars, and cafes and frequented by locals strolling and walking their dogs. Avoid the tourist prices and crowds and enjoy the local scene.", "publishedDate": "2017-07-06", "language": "en", "rating": 4}, {"id": 497770709, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d7208916-r497770709-Rambla_del_Poblenou-Barcelona_Catalonia.html", "text": "We were staying at a hotel close by and walked here every day. This a nice local place for a walk and lots going on but the restaurants are difficult to pick. I eat at two near by, outside and both were rather below average. I recommend a beer and an tapas, then hear to a better restaurant elsewhere.", "publishedDate": "2017-07-01", "language": "en", "rating": 3}, {"id": 494992178, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d7208916-r494992178-Rambla_del_Poblenou-Barcelona_Catalonia.html", "text": "our hotel was just a few streets away from here so we frequently visited for beer ,coffee and some great tapas \nI recommend a visit here if your in the area as the restaurants who line the rambla offer some great food and great service ", "publishedDate": "2017-06-21", "language": "en", "rating": 5}, {"id": 487794533, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d7208916-r487794533-Rambla_del_Poblenou-Barcelona_Catalonia.html", "text": "So this is what I feel the Rambla should be like. Nice pedestrian center walkway. Great shops and restaurants on both sides. Not touristy at all. Filled with many locals hanging out, walking dogs, shopping and eating. This Rambla also leads down to the beach. If you are in Poblenou, stop here. You will be glad u did!", "publishedDate": "2017-05-25", "language": "en", "rating": 5}, {"id": 486232218, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d7208916-r486232218-Rambla_del_Poblenou-Barcelona_Catalonia.html", "text": "Lots of open air restaurants, trendy shops, and people watching people.  Stop for a cold drink, snack, or a full meal.", "publishedDate": "2017-05-21", "language": "en", "rating": 5}, {"id": 476703921, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d7208916-r476703921-Rambla_del_Poblenou-Barcelona_Catalonia.html", "text": "If you are staying in the area, i would highly recommend this street. It goes straight to the beach (Bogatell) and is filled with cute bars and restaurants and most stay open until 12.30, 1am. \n\nIts always full during the day with people, great spots for some Gelato, and an evening night cap to finish the day off.", "publishedDate": "2017-04-18", "language": "en", "rating": 5}, {"id": 476214728, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d7208916-r476214728-Rambla_del_Poblenou-Barcelona_Catalonia.html", "text": "This rambla is not very long, it's not worth a trip there unless you are in the area.  There is a wide range of restaurants, snacks and treats, my issue is that the entire rambla is permiated with a stench of raw sewage,  making very difficult to enjoy any outdoor terrace dinning. ", "publishedDate": "2017-04-16", "language": "en", "rating": 3}, {"id": 441506525, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d7208916-r441506525-Rambla_del_Poblenou-Barcelona_Catalonia.html", "text": "This has a lovely feel to it. Not too touristy. Lots of love val and lots of people walking their dogs. Everything is reasonably priced and youbcan sit with a coffee and people watch.", "publishedDate": "2016-12-02", "language": "en", "rating": 5}, {"id": 436443199, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d7208916-r436443199-Rambla_del_Poblenou-Barcelona_Catalonia.html", "text": "Agree with all the good reviews below. Great area for strolling, watching people and eating. Did not do shopping here, so we cannot comment on that aspect. Stayed in the Eurohotel 3 blocks away. Would highly recommend exploring, if in the area or staying at a hotel nearby.By sharing your experiences, you're helping travelers make better choices and plan their dream trips. Thank you!", "publishedDate": "2016-11-11", "language": "en", "rating": 5}, {"id": 432431549, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d7208916-r432431549-Rambla_del_Poblenou-Barcelona_Catalonia.html", "text": "YOU can see why \"rambing\" is so popular - great sights, smells, and popular culture all around, and a great beach at the end!", "publishedDate": "2016-10-28", "language": "en", "rating": 5}, {"id": 431801711, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d7208916-r431801711-Rambla_del_Poblenou-Barcelona_Catalonia.html", "text": "A smaller version of the main La Rambla but with a local touch and a wide variety of cafes and restaurants. Well worth visiting!", "publishedDate": "2016-10-26", "language": "en", "rating": 5}, {"id": 429412162, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d7208916-r429412162-Rambla_del_Poblenou-Barcelona_Catalonia.html", "text": "Like it's more famous cousin, Rambla del Poblenou starts at the waterfront and goes inland about a 20 minute walk.  It is also a wide boulevard with great restaurants and gelato shops (there's even one that sells marijuana gelato, but you have to ask specifically for it as they do not display it), and other stores.  Unlike Las Ramblas, this is a pedestrian only boulevard, it is WAY less crowded with only a few tourists amongst the locals and it is not quite as long.  More relaxing and gentle.\n\nFor me, I would come here every time over that crazy one over there.", "publishedDate": "2016-10-18", "language": "en", "rating": 5}, {"id": 429177057, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d7208916-r429177057-Rambla_del_Poblenou-Barcelona_Catalonia.html", "text": "Excellent alternative to the packed tourist oriented Ramblas, well worth a visit mostly locals, great choice of restaurants and bars on main drag and side streets branching off this up and coming district of Barcelona ", "publishedDate": "2016-10-18", "language": "en", "rating": 4}, {"id": 427552111, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d7208916-r427552111-Rambla_del_Poblenou-Barcelona_Catalonia.html", "text": "We like Poble Nou, many locals, only some tourists. This local rambla is lively, but not too much. Don't miss the plates commemorating important local persons.", "publishedDate": "2016-10-13", "language": "en", "rating": 4}, {"id": 425965765, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d7208916-r425965765-Rambla_del_Poblenou-Barcelona_Catalonia.html", "text": "Found this Rambla on a previous visit when staying at a local hotel. Great area for non touristy bars and restaurants, although all visitors made very welcome. Situated between Llacuna and Poblenou Metro stations on Yellow line. 1o minute walk down to beach / promenade, then further 30 minutes stroll into city. Worth a visit for lunch.", "publishedDate": "2016-10-07", "language": "en", "rating": 4}, {"id": 421451135, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d7208916-r421451135-Rambla_del_Poblenou-Barcelona_Catalonia.html", "text": "Great non touristy place.\nPlenty of good restaurants and Cafe. \nAnd all places are local price not like LA Rambla. Recommended to walk to the beach. ", "publishedDate": "2016-09-23", "language": "en", "rating": 5}, {"id": 418365970, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d7208916-r418365970-Rambla_del_Poblenou-Barcelona_Catalonia.html", "text": "What I love about this street is the fact that there seems to be mostly locals here going about their daily life. It is very pedestrian friendly and offers benches all throughout for people to sit, people watch and read a book. Tons of restaurants, bars and cafes dot the streets. A leisurely 15 minute walk down the stretch leads you right into the beach. I would definitely recommend a visit to this area.", "publishedDate": "2016-09-14", "language": "en", "rating": 4}, {"id": 376263503, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d7208916-r376263503-Rambla_del_Poblenou-Barcelona_Catalonia.html", "text": "A cute, pedestrian-friendly street lined with restaurants and shops. It appears to be frequented by the locals more than the tourists, which is a nice break from the touristy places of  Barrio Gotico. The street itself will lead you straight to the beach in a pleasant 15-20 minute walk. Recomended if you're in the neighborhood.", "publishedDate": "2016-05-24", "language": "en", "rating": 4}, {"id": 356134192, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d7208916-r356134192-Rambla_del_Poblenou-Barcelona_Catalonia.html", "text": "Great place with many restaurants, not very central so a bit off the touristy route but nonetheless a nice place. Just off poblenou station. ", "publishedDate": "2016-03-16", "language": "en", "rating": 5}, {"id": 354944706, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d7208916-r354944706-Rambla_del_Poblenou-Barcelona_Catalonia.html", "text": "Stayed at near-by hotel and on advise of a friend walked to the Rambla del Poblenou. Lovely street with loads of dining options. You can walk all the way to the beach as well. Perfect for dinner place hunt when not sure what you want. ", "publishedDate": "2016-03-13", "language": "en", "rating": 4}, {"id": 313613621, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d7208916-r313613621-Rambla_del_Poblenou-Barcelona_Catalonia.html", "text": "A lovely street filled with a good selection restaurants, bars and shops of various kinds, with lots of public seating along it's length. Great to eat, drink or simple to walk, busy but pleasant in the evenings with people of all ages", "publishedDate": "2015-09-25", "language": "en", "rating": 4}, {"id": 313594000, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d7208916-r313594000-Rambla_del_Poblenou-Barcelona_Catalonia.html", "text": "Lovely place to walk about, lots of restaurants to enjoy the local foods. Lots of very interesting  mime artists along the way. Very nice market also where you can sample drinks, food at your leisure, you can also amble off into the side streets and explore ", "publishedDate": "2015-09-25", "language": "en", "rating": 4}, {"id": 307917194, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d7208916-r307917194-Rambla_del_Poblenou-Barcelona_Catalonia.html", "text": "This was a nice in the city , lots of restaurants to choose from, not too touristy , and fairly relaxed .", "publishedDate": "2015-09-07", "language": "en", "rating": 4}, {"id": 307687660, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d7208916-r307687660-Rambla_del_Poblenou-Barcelona_Catalonia.html", "text": "A typical Spanish walk\nRestaurants ?so many here you will be spoilt for choice... \nTree lined with seating along the way.", "publishedDate": "2015-09-06", "language": "en", "rating": 5}, {"id": 306776560, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d7208916-r306776560-Rambla_del_Poblenou-Barcelona_Catalonia.html", "text": "I arrived in Barcelona on Catalunya's Day and Poblenou was very festive with lots of people in the Rambla with flags, food, music and people smiling.", "publishedDate": "2015-09-03", "language": "en", "rating": 4}, {"id": 294157068, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d7208916-r294157068-Rambla_del_Poblenou-Barcelona_Catalonia.html", "text": "if you want to have an easier and less expensive Rambla experience,  this option may be better, is not crowdy and you can find a lot of good restaurants as well", "publishedDate": "2015-07-30", "language": "en", "rating": 4}, {"id": 287363188, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d7208916-r287363188-Rambla_del_Poblenou-Barcelona_Catalonia.html", "text": "In contrast to the overly crowded Las Ramblas in central Barcelona, this was a peaceful stroll through a less-touristic area.  Wonderful restaurants with outdoor seating in 1/3 of the pedestrian area, with plenty of room for walkers.  In particular, Passeig 9 had great food.  I loved this area.  Shade trees on either side and in the roundabout circles at intersections.  Park benches and outdoor cafes to enjoy the area.  The rambla leads you right to the beach.  Not too many hotels here, but the Holiday Inn Express, while without local character, was adequate.  There are Metro stops two or three blocks either side of the rambla - Poblenou and LLacuna.", "publishedDate": "2015-07-09", "language": "en", "rating": 5}, {"id": 280147289, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d7208916-r280147289-Rambla_del_Poblenou-Barcelona_Catalonia.html", "text": "We recently stayed in Poblenou whilst on a group visit for Primavera Sound. 4 lads and me and my boyfriend.\n\nThe boys enjoyed the Poblenou Ramblas with us for delicious tapas (Lazzurano was our favourite. Little €1 pinchos they would cook and bring round for you to take if you want. SO GOOD. Nice beer and outside seating. \n\nSODA cocktail bar was amazing. The best piña colada I have ever had and I have had A LOT of piña coladas. \n\nLots of other great places to eat and drink for pretty cheap. We were concerned that lots of people had said Poblenou was bad for crime and not good for tourists but it was excellent.\n\nWe frequented the Irish bar a fair bit but mostly it's Spanish food and it's all so good. There's also some great shops and a decent amount of supermarket type shops handy if you're staying self catering.\n\nThe lads went out drinking at la Ramblas most nights then onto clubs as the Poblenou Ramblas sort of shut down around midnight in May/June. Not sure if they stay open later in the summer but me and my boyfriend spent some beautiful warm evenings wandering up the Poblenou Ramblas stopping outside various places and lapping up the architecture. \n\nIf you're up for a chilled time it's the place to go.", "publishedDate": "2015-06-14", "language": "en", "rating": 5}, {"id": 277972607, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d7208916-r277972607-Rambla_del_Poblenou-Barcelona_Catalonia.html", "text": "I love walking from Diagonal Mar to the ocean through la Rambla del Poblenou. There are many restaurants along the way and lots of people having a great time, eating or drinking within the restaurants or at the tables outside. \n\nDuring my last visit there were several important soccer games being played, and it was funny to see that those bars/restaurants with the larger screens or TVs had the largest crowds. It was fun walking by and observing all the excitement. \n\nIts a fun street, with lots of people but never too crowded  In this and the other ramblas you see  many older couples walking hand in hand; very nice elderly and elegant couples. \n\n This time I started exploring some of the side streets and discovering some of the smaller shops. The Rambla del Poblenou has elegance and style and a nice breeze as you approach the ocean. I found a good place for coffee cups - including my Soc del Poblenous coffee cup.", "publishedDate": "2015-06-04", "language": "en", "rating": 5}]}}]