[{"locationId": 9582536, "name": "Mercat del Art de la Placa de Sant Josep Oriol", "placeType": "ATTRACTION", "reviewListPage": {"reviews": [{"id": 723075316, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d9582536-r723075316-Mercat_del_Art_de_la_Placa_de_Sant_Josep_Oriol-Barcelona_Catalonia.html", "text": "Nice little art market nestled in a beautiful square in Gothic quarter. Artists are friendly, vibe is very chill. On weekends and holidays. Nice little gourmet market with honey, cheeses, cured meats and chocolates nearby ", "publishedDate": "2019-11-01", "language": "en", "rating": 5}, {"id": 661399064, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d9582536-r661399064-Mercat_del_Art_de_la_Placa_de_Sant_Josep_Oriol-Barcelona_Catalonia.html", "text": "visited this a couple of days ago. It is an amazing but small set up with various local artists. The artists are very friendly and eager to talk about their work. I bought a beautiful piece to remember my Barcelona trip!  There was also a festival going on that same day with giant figures dancing, musicians playing and acrobats.  The Cathedral is open so you can go inside and be amazed.  ", "publishedDate": "2019-03-26", "language": "en", "rating": 5}, {"id": 658571488, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d9582536-r658571488-Mercat_del_Art_de_la_Placa_de_Sant_Josep_Oriol-Barcelona_Catalonia.html", "text": "Booked a fabulous culinary course. Met by Alex the chef who took us to this fantastic indoor market to buy ingredients so he could teach us how to cook paella. The market is fascinating. Alex was very passionate about it and told you lots of interesting information. We all walked back to his restaurant where he served us sangria and then taught us how to make the paella. Everyone got involved in the preparation and the cooking and then we ate what we had prepared. Fantastic day out. Very good if you are a foodie. ", "publishedDate": "2019-03-15", "language": "en", "rating": 5}, {"id": 658515314, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d9582536-r658515314-Mercat_del_Art_de_la_Placa_de_Sant_Josep_Oriol-Barcelona_Catalonia.html", "text": "A great experience, explosions of colour, sounds, smells...this place has it all, your senses are fully engaged. You can eat/drink at many of the stalls not dissimilar to st Miguel market in Madrid (if you’ve been there), only this is larger and more of an actual market. Fruit, veg, meats, fish, chocolates, snacks, drinks, you can get anything you need whether it’s to consume there/then or to take away and prepare at ‘home’ you’ll be fully accommodated. We ate at the seafood stall just outside Starbucks and it was an incredible platter.", "publishedDate": "2019-03-14", "language": "en", "rating": 5}, {"id": 650795978, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d9582536-r650795978-Mercat_del_Art_de_la_Placa_de_Sant_Josep_Oriol-Barcelona_Catalonia.html", "text": "This is the touristy market located near Las Ramblas.  It is more expensive than the more local market that is not very far from here.  There are loads of food shops including tapas, fresh fruits and vegetables, chocolate coated strawberries, jamon (ham), deep fried items, and more.  It is quite crowded and a good place for pickpockets so be careful where you place your belongings.  Have fun trying different foods!", "publishedDate": "2019-02-07", "language": "en", "rating": 4}, {"id": 648436775, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d9582536-r648436775-Mercat_del_Art_de_la_Placa_de_Sant_Josep_Oriol-Barcelona_Catalonia.html", "text": "Just visit this place! No explanation needed! No need to type anything futher! Just go...just go hungry!", "publishedDate": "2019-01-26", "language": "en", "rating": 5}, {"id": 595548399, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d9582536-r595548399-Mercat_del_Art_de_la_Placa_de_Sant_Josep_Oriol-Barcelona_Catalonia.html", "text": "St Josep food market is just of las Rambla and is a wonder to be seen. So many stalls over 100+ selling food from\nMeat fish fruit and veg fruit juices bread sweets etc. There is also tapas bars situated in and around the  market. The colours and smells are amazing. A great atmosphere where tourists mingle  with locals to buy goods ", "publishedDate": "2018-07-12", "language": "en", "rating": 5}, {"id": 584628903, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d9582536-r584628903-Mercat_del_Art_de_la_Placa_de_Sant_Josep_Oriol-Barcelona_Catalonia.html", "text": "What an insight into the delicacies of the Catalonia region. Every food type you could possibly imagine from Iberico ham, to fruit and vegetables to chocolates and lollies. It is simply a pleasure to wander through and see the people of Barcelona buy their daily consumables. Make sure that you try the local fare at one of the many stores throughout the complex. Keep a hand on your wallet, not because of pickpockets (they are around) but because it is so easy to spend money there. Enjoy!!!!", "publishedDate": "2018-06-02", "language": "en", "rating": 5}, {"id": 512972544, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d9582536-r512972544-Mercat_del_Art_de_la_Placa_de_Sant_Josep_Oriol-Barcelona_Catalonia.html", "text": "The best way to understand the ways of living of a country is going to visit their local market; not chain supermarkets! Particularly to food lover, St. Josep is an excellent place to see why Spanish cuisine is so nice!\n\nThe following probably are good purchase from St. Josep for your kitchen at home if you enjoy cooking and eating:\n1. Dried tomatoes and other fruits like figs (good for spaghetti and bakery);\n2. Herbs especially saffron (expensive in Asia but cheap in Europe local market; very good for seafood);\n3. Iberico ham (must must buy!! Good for pairing with wine and sweet melon; of course, for paella too).\n\nThere are restaurants and bars inside the market too; using fresh ingredients to cook. Don't miss it!\n\n", "publishedDate": "2017-08-14", "language": "en", "rating": 5}, {"id": 495643543, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d9582536-r495643543-Mercat_del_Art_de_la_Placa_de_Sant_Josep_Oriol-Barcelona_Catalonia.html", "text": "I could have spent 2 hours here easily but my family rushed me along! It is basically an outdoor market like many big cities have with food vendors and butchers, wine vendors, sweets, fruits and veggies and all kinds of interesting local fare.  It is compact and crowded so hold on to your belongings - it is an easy place to get pick pocketed.  Take your time and stroll the outside vendors, they are less crowded.  Make a lunch out of it sampling things as you go. I liked the egg vendor who had all kinds of eggs for sale including Emu and Ostrich.  Don't touch - It's not customary to touch things as we often do in the US.  In fact, at grocery stores, there are plastic gloves to wear before squeezing fruit to see if it's ripe.  If you have a kitchen, the seafood looked amazing - the shrimps were whole and huge - lobster, whole fish, crabs etc. Fun place to see how other cultures eat .", "publishedDate": "2017-06-24", "language": "en", "rating": 5}, {"id": 472746122, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d9582536-r472746122-Mercat_del_Art_de_la_Placa_de_Sant_Josep_Oriol-Barcelona_Catalonia.html", "text": "Good range of art and styles on offer here,  easy to wander round and no feeling of pressure from sellers. Worth a look if you're in the area", "publishedDate": "2017-04-04", "language": "en", "rating": 4}, {"id": 471032680, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d9582536-r471032680-Mercat_del_Art_de_la_Placa_de_Sant_Josep_Oriol-Barcelona_Catalonia.html", "text": "Huge local event with parade of 8' characters, dancing, climbing and fabulous music. No English spoken here and few tourists--but if you are going there in March", "publishedDate": "2017-03-29", "language": "en", "rating": 3}, {"id": 418596106, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d9582536-r418596106-Mercat_del_Art_de_la_Placa_de_Sant_Josep_Oriol-Barcelona_Catalonia.html", "text": "Lovely place to spend an hour on a sunny Sunday morning.  Great atmosphere and good variety of work by local artists. A bit on the expensive side, but hard to resist buying - something for everyone.", "publishedDate": "2016-09-14", "language": "en", "rating": 4}, {"id": 393016160, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d9582536-r393016160-Mercat_del_Art_de_la_Placa_de_Sant_Josep_Oriol-Barcelona_Catalonia.html", "text": "Local artists sell saturday/sunday their products at this outdoor market.\nPlaca de Sant Josep Oriol is located next to Basilica de Santa Maria del Pi in Barri Gotic", "publishedDate": "2016-07-15", "language": "en", "rating": 3}]}}]