[{"locationId": 8610896, "name": "Casa Serra", "placeType": "ATTRACTION", "reviewListPage": {"reviews": [{"id": 689546258, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d8610896-r689546258-Casa_Serra-Barcelona_Catalonia.html", "text": "Casa Serra is one of the many buildings on Avinguda Diagonal designed in the Catalan Modernism architectural style, with a hint of Neomudejar. Designed by Josep Puig i Cadafalch and built in 1908 for Pere Serra, the building features lovely Mudejar style roofs and pretty bay windows. It’s now government offices and used by the council of the province of the city. As another reviewer has commented, there’s a rather ugly, modern glass building behind Casa Serra that’s an extension of this building, also used by the council. The extension is completely unsympathetic to the style of Casa Serra.\n\nYou’ll likely pass this building especially if doing a tour of all the Catalan Modernist buildings on  Avinguda Diagonal, otherwise, it’s worth a small detour.", "publishedDate": "2019-07-14", "language": "en", "rating": 4}, {"id": 677755874, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d8610896-r677755874-Casa_Serra-Barcelona_Catalonia.html", "text": "Casa Serra was originally built as a residence of the family whose name the building bears. Apparently they never actually lived there! Be that as it may, the building is considered as one of Catalunya's examples of modernism, something of a cultural heritage of the Catalans. It is quite an interesting building and the people who use it must feel rather lucky. They are all those people who work for the provincial Council of Barcelona, because it is its headquarters! However there is a bit of a black mark against this as there is a more modern, and some would say rather ugly, building behind, which was constructed in the 1980s to serve as offices of the provincial Council. It somehow spoils the original beautiful building. It's worth checking out.", "publishedDate": "2019-05-30", "language": "en", "rating": 4}, {"id": 672163024, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d8610896-r672163024-Casa_Serra-Barcelona_Catalonia.html", "text": "The Serra House is a Modernisme style building situated on Rambla de Catalunya, at the intersection with Avenida Diagonal.\n\nThe building was completed in 1908. It is now the home of the provincial council of the Province of Barcelona.\n\nThe house itself is beautiful but there is an ugly newer office building next to it.", "publishedDate": "2019-05-07", "language": "en", "rating": 4}]}}]