[{"locationId": 2645511, "name": "Playa de La Barceloneta", "placeType": "ATTRACTION", "reviewListPage": {"reviews": [{"id": 756815372, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d2645511-r756815372-Playa_de_La_Barceloneta-Barcelona_Catalonia.html", "text": "Worst beach ever. Packed of loud and tacky tourists unfortunately. Not worth it. If you're visiting Barcelona go to any other beach instead.", "publishedDate": "2020-06-02", "language": "en", "rating": 1}, {"id": 752019022, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d2645511-r752019022-Playa_de_La_Barceloneta-Barcelona_Catalonia.html", "text": "Beautiful, clean beach provides a nice walk into Barcelona City.  Plenty of people enjoying the many activities available on the beach.  Really pleasant, though a slightly cool wind.  \nIt was great being able to follow the cities beaches for so long.", "publishedDate": "2020-03-29", "language": "en", "rating": 4}, {"id": 750818020, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d2645511-r750818020-Playa_de_La_Barceloneta-Barcelona_Catalonia.html", "text": "Really enjoyed a stroll along the beach, this time of year (early March) the weather is really pleasant. We found a lovely little beach bar & sat to have a couple of drinks & just enjoy the beach- really lovely! ", "publishedDate": "2020-03-14", "language": "en", "rating": 4}, {"id": 749244462, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d2645511-r749244462-Playa_de_La_Barceloneta-Barcelona_Catalonia.html", "text": "The beach can be easy accessed,people are doing activities, sports, very nice place to spend a couple of hours.", "publishedDate": "2020-03-05", "language": "en", "rating": 4}, {"id": 747921292, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d2645511-r747921292-Playa_de_La_Barceloneta-Barcelona_Catalonia.html", "text": "Fun beach with a lot to do right nearby! Great place to hang with friends and chill for a few hours. Be careful for pick pockets and salesmen.", "publishedDate": "2020-02-27", "language": "en", "rating": 4}, {"id": 746535842, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d2645511-r746535842-Playa_de_La_Barceloneta-Barcelona_Catalonia.html", "text": "Relax and get away from bustling Barcelona. \nThe beach is nice and clean and spacious for sun bathers, exercising and people watching.  \nTake metro to Barceloneta stop or metro bus L19 and free minutes walk to beach.  Restaurants and sales stop along the way. \nNice to see clean sand and almost somewhat blue water.  \nI’m sure it can be very pack during summer peak season and can’t be crazy but at least you can spy and people watch ", "publishedDate": "2020-02-21", "language": "en", "rating": 4}, {"id": 745087112, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d2645511-r745087112-Playa_de_La_Barceloneta-Barcelona_Catalonia.html", "text": "Not the best beach and very messy.\nAlso, the sea was cold and it was windy, so we could not enjoy it as much.\nHowever, we enjoyed the view and it is very central to everything.\nThe long walk next to the beach was good too. Of course, the sound of the waves are relaxing as well.\nI did not like the lady trying to sell a massage, she was pushy, nor the others.\n\nBe careful of thieves and of over priced tourist trap scams!", "publishedDate": "2020-02-14", "language": "en", "rating": 3}, {"id": 744670144, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d2645511-r744670144-Playa_de_La_Barceloneta-Barcelona_Catalonia.html", "text": "Even in February, the weather was good. Almost 17 degrees Celsius. Great to walk around and just look at the sea and people.", "publishedDate": "2020-02-12", "language": "en", "rating": 5}, {"id": 742995354, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d2645511-r742995354-Playa_de_La_Barceloneta-Barcelona_Catalonia.html", "text": "Every capital city show have a lovely beach. \nThat’s to do and see around the beach area. Or just relax and watch the boats ", "publishedDate": "2020-02-04", "language": "en", "rating": 4}, {"id": 740649754, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d2645511-r740649754-Playa_de_La_Barceloneta-Barcelona_Catalonia.html", "text": "This beach has something magic, it is the perfect place to take a walk or to relax, regardless of the weather outside. Close to the city center it is always a place of good vibes. The landscape amazing..", "publishedDate": "2020-01-22", "language": "en", "rating": 5}, {"id": 740293409, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d2645511-r740293409-Playa_de_La_Barceloneta-Barcelona_Catalonia.html", "text": "Went to see the beach a few times while we were visiting Barcelona a few months ago. Definitely a must visit attractions, very nice to take long walks along the beach and admire the view.\nThe waves were maybe a bit too high and the water a bit colder but definitely a place that shouldn't be missed while visiting the city.", "publishedDate": "2020-01-20", "language": "en", "rating": 4}, {"id": 739581153, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d2645511-r739581153-Playa_de_La_Barceloneta-Barcelona_Catalonia.html", "text": "Of course the sea is stunning, but the theft...outrageous. One hopes a beach day will be a relaxing day. Not here. Here you must be vigilant and so where is the fun in that? Walk a few blocks North to Llevant. A bit safer. It is Barcelona after all. ", "publishedDate": "2020-01-16", "language": "en", "rating": 2}, {"id": 739251877, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d2645511-r739251877-Playa_de_La_Barceloneta-Barcelona_Catalonia.html", "text": "This is beach bordering city centre in Barcelona. This sandy beach is close to other points of interest, with some nice views", "publishedDate": "2020-01-15", "language": "en", "rating": 5}, {"id": 735558607, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d2645511-r735558607-Playa_de_La_Barceloneta-Barcelona_Catalonia.html", "text": "Fantabulous views. Really clean beach. Restaurants on this beach (but too expensive). Great wildlife. Lovely.", "publishedDate": "2019-12-30", "language": "en", "rating": 4}, {"id": 733880132, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d2645511-r733880132-Playa_de_La_Barceloneta-Barcelona_Catalonia.html", "text": "The beauty of the city is really amazing, a lot of landmarks that gives you availability of movement, the only negative think in my opinion The Food, don't visit the popular restaurants , the food is pure enough and expensive, there are some small places - restaurants little outside with great seafood!!", "publishedDate": "2019-12-20", "language": "en", "rating": 4}, {"id": 732902846, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d2645511-r732902846-Playa_de_La_Barceloneta-Barcelona_Catalonia.html", "text": "This is a beautiful beach. Sand is on the rougher side but not bad. Nice place to see a good sunset. There was actually people selling cocky on the beach which is a plus if you are into that sort of thing. ", "publishedDate": "2019-12-15", "language": "en", "rating": 4}, {"id": 731997198, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d2645511-r731997198-Playa_de_La_Barceloneta-Barcelona_Catalonia.html", "text": "Ok, maybe it is not so nice like Californian beaches or Maldivi, but this place is really nice if you want to have some summer break after exploring the town. \nWe were walking for two hours and then just stayed on the beach. Swim, talk, laugh, later got some bottles of wine and continue to be there to the dark.,\nGreat and clean place, there are some cool places to grab some coffee, not expensive. \nDay after we vent to the pool, at the end of the beach..and really had great fun there!", "publishedDate": "2019-12-11", "language": "en", "rating": 5}, {"id": 730387247, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d2645511-r730387247-Playa_de_La_Barceloneta-Barcelona_Catalonia.html", "text": "Even in December the sun was shining....! A very pleasant area, lovely promenade to walk along and some great bars and restaurants that were not expensive despite being right on the front.. Will go back.", "publishedDate": "2019-12-03", "language": "en", "rating": 4}, {"id": 728706971, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d2645511-r728706971-Playa_de_La_Barceloneta-Barcelona_Catalonia.html", "text": "Come here on a sunny day and enjoy how all of the city comes for sun, food and fun.  Lots of places nearby for a lunch or just a drink.  The beach comes to the city.", "publishedDate": "2019-11-24", "language": "en", "rating": 4}, {"id": 725667488, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d2645511-r725667488-Playa_de_La_Barceloneta-Barcelona_Catalonia.html", "text": "This is just an average beach.  The beach itself is not that great (i.e.  sand, facilities, water).  There are plenty of street vendors trying to sell you stuff.  This is not a beach to relax and rest.  The beach has no charm.  If you are in Barcelona you can go to the beach to get out of the routine but I would not consider Barcelona as a beach destination.  You will find better beaches in South America and the Caribbean.", "publishedDate": "2019-11-11", "language": "en", "rating": 3}, {"id": 722551456, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d2645511-r722551456-Playa_de_La_Barceloneta-Barcelona_Catalonia.html", "text": "A lovely safe beach, we spent some time here this morning looking for sea glass and strolling around. Street hawkers offering beers, massages and clothes/sunglasses were the only minor irritation.", "publishedDate": "2019-10-30", "language": "en", "rating": 5}, {"id": 722275354, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d2645511-r722275354-Playa_de_La_Barceloneta-Barcelona_Catalonia.html", "text": "Surprised to find how lovely Barcelona's beaches are as you don't normally find beaches in cities. A great place to spend the day, gorgeous setting with lots going on for those who like to sit and watch the world go by. \nNot too busy on a beautiful October day and still warm enough for those of us from cold weather countries!\nDefinitely worth a visit when visiting Barcelona.", "publishedDate": "2019-10-29", "language": "en", "rating": 5}, {"id": 721263014, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d2645511-r721263014-Playa_de_La_Barceloneta-Barcelona_Catalonia.html", "text": "This beach is in the city area and because of this, they get crowded in high season. I reached here early in the morning to avoid the crowd. There were hardly any people at that time. We strolled around the beach before crowd pours. \nThe seawater and sand are cleaned daily. They are cleanest in the morning but can get a bit littered at the end of a busy beach day. We can all help by taking your litter with you or putting your litter in the provided bins. \n\nThere is not very much to rent at the beach. Barcelona is not a beach resort, but a city with a beach, so there are few watersport rentals on Barcelona beaches. There are no pedal boat rentals on Barcelona beaches. But still, you can find a few shops across the road to rent something, but not very popular though. \n\nThe beach swimming season in Barcelona is generally from May to mid-September when the Barcelona seawater temperature is most comfortable for swimming. All Barcelona beaches have the European blue flag of excellence awarded for water quality and services.\n\nVendors walk around selling everything from mojitos to on-the-spot massages, also there are cafes and bars situated on the beach throughout. The beach features loads of amenities on-site including bathrooms, showers, changing rooms, umbrellas, lounge chairs, sports courts such as volleyball and beach tennis and more.\n\nWell if you are in the city, you should not miss this.", "publishedDate": "2019-10-25", "language": "en", "rating": 4}, {"id": 720779374, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d2645511-r720779374-Playa_de_La_Barceloneta-Barcelona_Catalonia.html", "text": "My wife and I walked to Barceloneta, the beachfront area, from the top of Ramblas.  We had a mediocre paella for lunch (we were informed by our guide in Granada that they don’t use saffron in Barcelona).  We didn’t find the Barceloneta very impressive, but we didn’t walk very far down the beachfront.", "publishedDate": "2019-10-23", "language": "en", "rating": 3}, {"id": 719494368, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d2645511-r719494368-Playa_de_La_Barceloneta-Barcelona_Catalonia.html", "text": "This is an awesome, clean, fun beach, About 15 minute walk from Las Ramblas. Nice dining options and activities right on the beach. ", "publishedDate": "2019-10-18", "language": "en", "rating": 5}, {"id": 718839257, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d2645511-r718839257-Playa_de_La_Barceloneta-Barcelona_Catalonia.html", "text": "I’m here on personal business,moving around as a local in public transport and this is the closest beach from the city.Good for a swim,lay around,good eats and views.Only downside is the feeling you have to be watching your stuff because of all the street vendors walking around the sand.Clean water,nice crowd, but too many stalking vendors.", "publishedDate": "2019-10-16", "language": "en", "rating": 4}, {"id": 716834360, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d2645511-r716834360-Playa_de_La_Barceloneta-Barcelona_Catalonia.html", "text": "We had a great afternoon here! Not too crowded, and we were grateful for the men selling drinks and blankets.  Plenty of restaurants to walk to from here.  Beautiful buildings and sculptures around the beach! Pretty rocks!", "publishedDate": "2019-10-09", "language": "en", "rating": 5}, {"id": 715062984, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d2645511-r715062984-Playa_de_La_Barceloneta-Barcelona_Catalonia.html", "text": "We came to the beach during La Merce festival to see the fireworks up close. It was amazing and the atmosphere was super relaxed with everyone coming together in good spirits. Never visited the beach otherwise as we stayed at others up the Costa Brava but it's certainly nice to have a beach so close to a full city", "publishedDate": "2019-10-03", "language": "en", "rating": 5}, {"id": 714595793, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d2645511-r714595793-Playa_de_La_Barceloneta-Barcelona_Catalonia.html", "text": "Having a beach in the city should be a great thing. It is kind of but at same time if you have time go somewhere else. Barceloneta is an artificial beach build during Olympic Games. It’s full of tourists, annoying sellers, it’s dirty (fake sand), dirty water etc. 20-30 min outside Barcelona you can experience the real beach. Don’t be lazy. ", "publishedDate": "2019-10-01", "language": "en", "rating": 2}, {"id": 714037939, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d2645511-r714037939-Playa_de_La_Barceloneta-Barcelona_Catalonia.html", "text": "I like the beach. It reminds me of South Beach, it was clean, volleyball played on the beach, people running, biking & enjoying the area. A few bars and things to do, what I didn’t like was the smell in the streets getting to the beach. Very bad smell on the streets. Even after taking a different route, the smell of the streets was nasty", "publishedDate": "2019-09-29", "language": "en", "rating": 4}, {"id": 713458469, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d2645511-r713458469-Playa_de_La_Barceloneta-Barcelona_Catalonia.html", "text": "If you go to Barcelona bring your swimsuit. The beach is great, many nice bars and places to eat. A clean beach with guards. ", "publishedDate": "2019-09-27", "language": "en", "rating": 4}, {"id": 712890127, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d2645511-r712890127-Playa_de_La_Barceloneta-Barcelona_Catalonia.html", "text": "I had done some online research of which beaches were the best to see while in Spain and this one was labeled the busiest and noisiest. One that was noted to definitely visit was Ocata beach but our Airbnb host said it was nothing special. So on our second to last day, we finally went to the beach. I’m so sad that we went in regular clothes and not swim suits 😭. The water there is stunning, the sand kept clean, and it wasn’t any busier or louder than a beach you would find in the United States. In fact, it was so beautiful. There were areas dedicated for exercising and there were people with dogs (who were kind enough to clean up after them).\n\nThe water was cool and refreshing (only bc a giant wave kicked my ass) and the best part is, there was sea glass everywhere! We also found a lot of old tiles that had broken off and been washed in the ocean, making it shiny and new again. If we had gotten there when the tide was going out, I can only imagine the bounty we would’ve had! \n\nThis beach is easily accessible by public transportation! I had seen somewhere on here that they close the beaches down at a certain point in the evening, but that is false. When the sun goes down, they turn on huge lights and the beach life continues. There are plenty of what they call Urban Guard around and you won’t be disappointed if you choose to make this your Barcelona beach destination!", "publishedDate": "2019-09-25", "language": "en", "rating": 5}, {"id": 712490441, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d2645511-r712490441-Playa_de_La_Barceloneta-Barcelona_Catalonia.html", "text": "A beautiful place to take a stroll on a sunny day. Gorgeous views of the Sea, beach and sand. Some touristy shops and restaurants also. ", "publishedDate": "2019-09-23", "language": "en", "rating": 4}, {"id": 712236015, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d2645511-r712236015-Playa_de_La_Barceloneta-Barcelona_Catalonia.html", "text": "Beach area is lively and vibrant place to visit even in the evening. Was a nice place to go to break up a city stay. ", "publishedDate": "2019-09-23", "language": "en", "rating": 4}, {"id": 712054072, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d2645511-r712054072-Playa_de_La_Barceloneta-Barcelona_Catalonia.html", "text": "This is a nice place if you want to relax on the beach and enjoy the sun or take a dip in the water.", "publishedDate": "2019-09-22", "language": "en", "rating": 4}, {"id": 709679549, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d2645511-r709679549-Playa_de_La_Barceloneta-Barcelona_Catalonia.html", "text": "I like the beach alot, I like alot of people of different cultures and hanging out and meeting new people, but for some who prefer very little people it may not be the best.", "publishedDate": "2019-09-14", "language": "en", "rating": 5}, {"id": 709213138, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d2645511-r709213138-Playa_de_La_Barceloneta-Barcelona_Catalonia.html", "text": "Of course near the port you don’t expect clear sea water. The beach is crowded and it is certainly not safe to leave your belongings unattended. Unfortunately many people don’t take their garbage with them, so you will see many all around. You can go for a walk and spend some time relaxing. ", "publishedDate": "2019-09-12", "language": "en", "rating": 3}, {"id": 708757539, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d2645511-r708757539-Playa_de_La_Barceloneta-Barcelona_Catalonia.html", "text": "Wanted a break from the hectic city vibe in Barcelone so went down to the beach for some sun and relaxation. What i got was a beach where you felt like packed sardines and where beach vendors had overrun the place. \nAs soon as one vendor was done trying to sell you something (overpriced drinks, blankets, parasols and so on) the next one was there to take over. Sometimes i even had two salesmen at once trying to sell me stuff. \n\nWas not relaxing, was not a beach experience nor relaxing or plesant. \n\nIf you want to relax at the beach i would recommend you go to one of the beaches further north and stay clear of this one.", "publishedDate": "2019-09-11", "language": "en", "rating": 1}, {"id": 708621242, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d2645511-r708621242-Playa_de_La_Barceloneta-Barcelona_Catalonia.html", "text": "When we arrived we thought it was dirty but fine. Within minutes the vendors came, and then continued coming through in loud waves literally every five minutes. The men selling blankets, umbrellas, and drinks were working together in a theft ring. We watched MANY TIMES the vendors steal valuables and then tie them in the umbrellas they had just sold when the users went in the water, wrap up the umbrellas and quickly burry them in the sand within seconds. Then a few minutes later the blanket vendors would lay down one of their blankets, an umbrella and then dig up the stolen goods hidden in the sand. All while the water and mojito vendors stood by keeping watch. It was disgusting. We watched this happen multiple times and saw them digging up the umbrellas taking out the phones and going through wallets, then pack up and leave to repeat the process. On top of everything the water was disgusting. Do not go to this beach or Barcelona. It is only going downhill.", "publishedDate": "2019-09-10", "language": "en", "rating": 1}, {"id": 706639412, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d2645511-r706639412-Playa_de_La_Barceloneta-Barcelona_Catalonia.html", "text": "The water here is disgusting and I for some reason felt sticky after coming around. Bring a mask and snorkel if you want to spot some wild sanitary towels. Also sand is grim.", "publishedDate": "2019-09-04", "language": "en", "rating": 1}, {"id": 705288177, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d2645511-r705288177-Playa_de_La_Barceloneta-Barcelona_Catalonia.html", "text": "Omg stay away from the beach! Raw sewage pumped in! You can see for yourself at the botell end next to the medical centre. Used tampons and towels floating in the sea. Absolutely unbelievable is all I can say. Illegal beach sellers selling drinks and beach cloths hound you every 30 seconds not to mention cigarette butt's everywhere. We were here last year and the decline is very sad to say the least. Unfortunately this will be our last visit to Barcelona. Oh and don't wear nice jewellery and don't leave your bags unattended!", "publishedDate": "2019-09-01", "language": "en", "rating": 1}, {"id": 701703294, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d2645511-r701703294-Playa_de_La_Barceloneta-Barcelona_Catalonia.html", "text": "Too crowded , drugs galore, too many sellers . That said we did see presence of the police periodically .", "publishedDate": "2019-08-21", "language": "en", "rating": 1}, {"id": 701601080, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d2645511-r701601080-Playa_de_La_Barceloneta-Barcelona_Catalonia.html", "text": "We walked to beach from La Rambla, apart from it being hot, the offshore breeze was refreshing as we walked along the bike/walkway. There is enough stretch of beach to find a spot to sunbathe. The water was nice and warm, the day that we went was a yellow flag warning. I have uploaded a picture of the sign that describes the flag colors affiliated with the water conditions. There are a lot of vendors walking along the beach trying to sell beach blankets and alcoholic and non-alcoholic drinks. Restrooms were clean, just remember to take your toilet tissue from the dispenser before you enter the stalls as there are not any in the stalls.There are also intercom poles placed along the beach that announce warnings about protecting your personal items on the beach both in Spanish and English.", "publishedDate": "2019-08-21", "language": "en", "rating": 4}, {"id": 699355615, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d2645511-r699355615-Playa_de_La_Barceloneta-Barcelona_Catalonia.html", "text": "Great beach to spend some time at. We walked the strip for a bit. A few groups were fully nude if you're ok with that.", "publishedDate": "2019-08-15", "language": "en", "rating": 4}, {"id": 698714764, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d2645511-r698714764-Playa_de_La_Barceloneta-Barcelona_Catalonia.html", "text": "The beach its self is mostly clean and there is few rocks around. Plenty of space to sunbathe and relax. Visitors should beware of thieves and people selling towels and drinks; the sellers are very annoying and thieves will take anything left for a moment on the sand. ", "publishedDate": "2019-08-13", "language": "en", "rating": 4}, {"id": 698335396, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d2645511-r698335396-Playa_de_La_Barceloneta-Barcelona_Catalonia.html", "text": "This sort of got panned in our guide books, and I’m not sure why. Rented a bike and rode the length of the beaches in Barcelona and enjoy this one immensely.  ", "publishedDate": "2019-08-12", "language": "en", "rating": 4}, {"id": 697862961, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d2645511-r697862961-Playa_de_La_Barceloneta-Barcelona_Catalonia.html", "text": "It’s very crowded beach you can’t relax there because of the guys who will try to sell you beers and water, it was very crowded and there is no free lockers to put our stuff it costs 5€ from each to have a locker \nAnd there were a lot of naked people ", "publishedDate": "2019-08-11", "language": "en", "rating": 3}, {"id": 697504009, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d2645511-r697504009-Playa_de_La_Barceloneta-Barcelona_Catalonia.html", "text": "Playa de la Barceloneta in Barcelona is all you need to relax after exploring barcelona for the whole day. The water is clear/clean and very refreshing. The beach is well kept but must confess i was disappointed about their public bathrooms. Other that that it is fun !", "publishedDate": "2019-08-10", "language": "en", "rating": 5}, {"id": 696878158, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d2645511-r696878158-Playa_de_La_Barceloneta-Barcelona_Catalonia.html", "text": "This beach is right in city and so convenient yet so dirty. Took teen boys for a swim first day in Barcelona as it was hot and everyone was at beach. Boys went to get in water and seriously there was a condom floating in water. \n\nBeach is very busy and to be expected center of city. Restaurants around beach are ok but expensive. ", "publishedDate": "2019-08-08", "language": "en", "rating": 3}, {"id": 690810378, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d2645511-r690810378-Playa_de_La_Barceloneta-Barcelona_Catalonia.html", "text": "We went during school summer holidays so it was very crowded. There were also jellyfish sightings in the sea so we didn’t stay there long. The sea is a fairly nice temperature but can feel a bit chilly after a while. There are loads of people walking around selling water and beer which gets annoying after a while. ", "publishedDate": "2019-07-19", "language": "en", "rating": 3}, {"id": 689486922, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d2645511-r689486922-Playa_de_La_Barceloneta-Barcelona_Catalonia.html", "text": "We found this beach to be more crowded than Bogatell where we went the previous day, obviously due to its proximity to the city. \n\nAlso, less family oriented even though they are not out of place. \n\nIf you are from the Bible Belt in the US, you may be bothered by the monokini, but hey, nothing wrong and get over it.\n\nPro tip : After your beach day, walk Barceloneta neighbourhood, a charm. ", "publishedDate": "2019-07-14", "language": "en", "rating": 4}, {"id": 689064816, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d2645511-r689064816-Playa_de_La_Barceloneta-Barcelona_Catalonia.html", "text": "As sunset comes down. People sit or walk. To the calm ocean. And many restaurants on the beach shore to enjoy food or drinks. ", "publishedDate": "2019-07-12", "language": "en", "rating": 4}, {"id": 688752466, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d2645511-r688752466-Playa_de_La_Barceloneta-Barcelona_Catalonia.html", "text": "Nice beach to visit with family, not to crowded considering this is the most popular beach in barcelona", "publishedDate": "2019-07-11", "language": "en", "rating": 4}, {"id": 688106968, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d2645511-r688106968-Playa_de_La_Barceloneta-Barcelona_Catalonia.html", "text": "Great area with restaurants, bars and lots of activity.   Fun place to hangout but the street vendors can be annoying when your laying on the beach.", "publishedDate": "2019-07-09", "language": "en", "rating": 4}, {"id": 686948917, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d2645511-r686948917-Playa_de_La_Barceloneta-Barcelona_Catalonia.html", "text": "The beach itself is beautiful. Drawbacks are the hawkers trying to sell drinks, massages, and goods.  Water temps were too cold to swim unfortunately.", "publishedDate": "2019-07-05", "language": "en", "rating": 5}, {"id": 686919741, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d2645511-r686919741-Playa_de_La_Barceloneta-Barcelona_Catalonia.html", "text": "Good if you like peddlers and bad, expensive service. The water is clean and this is perhaps the only positive point I can make about it. Use your time elsewhere.", "publishedDate": "2019-07-05", "language": "en", "rating": 1}, {"id": 686457915, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d2645511-r686457915-Playa_de_La_Barceloneta-Barcelona_Catalonia.html", "text": "Nice way to skip the city relaxing on the sun. The sand is not that good as it’s full with small stones. The water is clean when visited but warning of jellyfish is in place but couldn’t spot any. Lot of sellers offering    What you need in the beach. Took the bus from Espanya place D20 . Buy the 10 tickets from the subway station to save you money and time . 10 tickets for zone one is for 10.20 Euros . ", "publishedDate": "2019-07-03", "language": "en", "rating": 4}, {"id": 685762998, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d2645511-r685762998-Playa_de_La_Barceloneta-Barcelona_Catalonia.html", "text": "Many people during summer of course but still it's a nice place to hang out. Lots of action going on, availability of.food and drinks nearby. Paddle boarding rents also possible. Sweet beach!", "publishedDate": "2019-07-01", "language": "en", "rating": 4}, {"id": 685758409, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d2645511-r685758409-Playa_de_La_Barceloneta-Barcelona_Catalonia.html", "text": "I wont say Barcelona is famous for their beach front , altough lots of restaurants , there is definitely better beaches in Spain", "publishedDate": "2019-07-01", "language": "en", "rating": 3}, {"id": 684978022, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d2645511-r684978022-Playa_de_La_Barceloneta-Barcelona_Catalonia.html", "text": "The beach was very busy and the crowds were mostly partiers, drinking and playing loud music and generally being very Rowdy.\n\nWe found a slightly quieter spot but soon discovered why - it was €45 to use a sun lounger and parasol. We didn't bother.\n\nI couldn't find much information about facilities before we went so for anyone considering going, there are showers, changing rooms and toilets. ", "publishedDate": "2019-06-28", "language": "en", "rating": 2}, {"id": 684385089, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d2645511-r684385089-Playa_de_La_Barceloneta-Barcelona_Catalonia.html", "text": "We went from las ramblas and saw gothic  quarter and colon marina area and all street vendors. Walked down to Southern tip of beach and had dinner at pez vela which was delicious -though service lacking.. beautiful perfect weather in late June , breezy but not too cold or hot.. 76 and still light at 10pm. Felt safe, plenty of bars cans and even bike pedi cabs for hire. Wonderful\nAnd relaxing ", "publishedDate": "2019-06-25", "language": "en", "rating": 5}, {"id": 682380036, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d2645511-r682380036-Playa_de_La_Barceloneta-Barcelona_Catalonia.html", "text": "Nice visit to the beach! \nWe were in April so didn’t swim but we had a relaxing time there. Only the people who walk around with drinks are anoing.", "publishedDate": "2019-06-18", "language": "en", "rating": 5}, {"id": 682084970, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d2645511-r682084970-Playa_de_La_Barceloneta-Barcelona_Catalonia.html", "text": "Big beach, very crowded, but all seem to work well and you can even find some tranquil corners to enjoy anything, from coffee to drinks to any cuisine you may have in mind. There is a huge street market with amazing products, from local traditional manufacturers to foreign things to arts and crafts to whatever you may fancy.", "publishedDate": "2019-06-17", "language": "en", "rating": 5}, {"id": 681991650, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d2645511-r681991650-Playa_de_La_Barceloneta-Barcelona_Catalonia.html", "text": "We were dropped off at the north end of the series of beaches that make up La Barceloneta. Rented an umbrella and sent kids into the water. That particular beach is very rocky, although it looks like they recently dumped multiple truck loads of sand  that they haven’t “spread out” yet. Kids had fun playing in these “dunes”. Water was “refreshing” but cold when you got out in breeze. On the next southern breakwater, there is a exercise area (rings, monkey bars, etc) where local guys impress young women with their feats of strength. Very entertaining. \n\nThe next beach down is listed as “Barceloneta” and looked much better, with gradual slope of nice sand into water and little to no rocks. Worth walking a little farther to if you are planning to go in the water. \n\nAnd, to my American friends, yes topless is ok and yes there are quite a few who do so, from young women to elderly grandmas. You get over it quickly, but definitely not Siesta Key. ", "publishedDate": "2019-06-16", "language": "en", "rating": 3}, {"id": 681660464, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d2645511-r681660464-Playa_de_La_Barceloneta-Barcelona_Catalonia.html", "text": "Myself and my husband, Frank, took a short trip to this beach. Much to our horror we soon realised it was full of nudists. Now don’t get me wrong there is nothing wrong with the human form but our 12 year old son, Clynt, should not necessarily be seeing such a display. \n\nApart from the obvious shortcomings of the beach goers this was a lovely trip as there are plenty of entrepreneurial young cervesa vendors boasting some deals that are too good to be true. \n\nI recommend coming early in the morning around 7:30am to grab the best spot, we did this and ended up with a spot so good we were practically in the ocean. \n\nSusan, Frank, and Clynt Matthews ", "publishedDate": "2019-06-15", "language": "en", "rating": 4}, {"id": 680492443, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d2645511-r680492443-Playa_de_La_Barceloneta-Barcelona_Catalonia.html", "text": "Poblenou and Selva Del Mar - my favorite place to take the sun, to swim , to relax , to have some sports . The sand is perfect, the sea 🌊 is not dirty , not so much people as at Barceloneta . If you want to have to spent a good time on a beach 🏖 in Barcelona- I advice you to go here !)) ", "publishedDate": "2019-06-10", "language": "en", "rating": 5}, {"id": 680396016, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d2645511-r680396016-Playa_de_La_Barceloneta-Barcelona_Catalonia.html", "text": "Beware! today 10 July (holiday in Barcelona) the sunbeds on Barceloneta beach are 30 Euro each!!!!! We came a few days ago and they were 12 Euro each (still expensive) that’s without umbrella. We declined today and just got an umbrella - on it’s own 20 Euro. No signs displayed with prices and they are clearly not regulated in any way. Shame on you guys. Something should be done to stop this daylight robbery of tourists.", "publishedDate": "2019-06-10", "language": "en", "rating": 1}, {"id": 680142225, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d2645511-r680142225-Playa_de_La_Barceloneta-Barcelona_Catalonia.html", "text": "The beach is beautiful, it was clean, looked nice but there were a lot of people and a lot of noise so it’s maybe not the best place if you want to relax. Still great!", "publishedDate": "2019-06-09", "language": "en", "rating": 5}, {"id": 678264108, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d2645511-r678264108-Playa_de_La_Barceloneta-Barcelona_Catalonia.html", "text": "It is quite nice being in a crowd, watching people watching other people.  The water can be quite cool, or can have jellyfish but generally is fine. No shade on the beach at all.\n\nThere are queues for the few toilets, especially in the parts closer to the city. If you want a more peaceful and secure place, head further north towards The Forum, or go even further in the metro to Badalona, where it is much more family oriented, but not so good for a young crowd.\n\nVery worth while for a stroll, but do watch your stuff as there are very capable gangs that operate in the area both for people dozing on the sand or walking along.", "publishedDate": "2019-06-02", "language": "en", "rating": 4}, {"id": 677891597, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d2645511-r677891597-Playa_de_La_Barceloneta-Barcelona_Catalonia.html", "text": "The Barceloneta beach was full of people when we went, and while that should not be a surprise, be prepared to wander around the different beach stretches before finding a space for you to laze around. Otherwise, its a rather well equipped beach with showering / washing areas and beach houses serving food/drinks (albeit pricey). Reachable by Barceloneta station on the L4 line.", "publishedDate": "2019-05-31", "language": "en", "rating": 4}, {"id": 677391433, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d2645511-r677391433-Playa_de_La_Barceloneta-Barcelona_Catalonia.html", "text": "So basically if you are happened to spend a few days in Barcelona  and if you decided to spend some time on the beach.. well be prepared.\n\nAnd be well prepared. Random men come to you trying to sell you their stuff literally in every 2 minutes\n(mojito fresh beer cold beer), they keep shouting. Blanket guys coming to your face trying to sell you their one and only super price blankets which is totally covered with the sweat of the guy... digusting\n\nAnyway i give you a pro tip : Bring an earphone and listen to a music so that you cant be bothered with the constant shouting i mentioned above.\n\nAlso dont look at them. dont react to them. Be wary of the lady who offers massages.\n\nApart from that its not that bad. Water is kinda cold but thats good anyway\n\ntldr\n\nNot so crowded but the frickin men with their constant shouting", "publishedDate": "2019-05-29", "language": "en", "rating": 3}, {"id": 677181121, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d2645511-r677181121-Playa_de_La_Barceloneta-Barcelona_Catalonia.html", "text": "I was very disappointed visiting the Barceloneta Beach today. I was harrassed by the lady in the picture about 5 times wanting to give me a massage for 5 euros. She was extremely aggressive. She kept touching my legs, arms, shoulders, and neck trying to convince me to get a massage. Plus, there are other annoying vendors walking the beach trying to sell you things, so relaxing is not possible at the beach. In addition, the beach is extremely DIRTY.  I understand that it is a public beach, but the city needs to do a better job cleaning it up. Thankfully, I found a chair by the showers and was able to sit on... otherwise, I would have set on the stairs in filth. It's a beach worth seeing  to check it off your list, but don't go with the expectation of spending a quality day at the beach. ", "publishedDate": "2019-05-28", "language": "en", "rating": 1}, {"id": 676225842, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d2645511-r676225842-Playa_de_La_Barceloneta-Barcelona_Catalonia.html", "text": "If visiting the beach in Barcelona. Take a very large sign with you stating in several languages “I DONT WANT TO BUY YOUR TAT!!!”\nThis place is like sunbathing in the middle of an open market.\nEvery 20 seconds you are assailed by someone trying to sell you beer, water, mojitos, big sheets, henna tattoos or massages. These last are the worst. An interminable stream of middle-aged oriental women coming up and asking repeatedly “Massage? Massage?Massage?” It doesn’t matter if they’ve been round once,twice or twenty times before. They seem to operate on the basis that you will crack eventually just to get rid of them. After about the third circuit they appear to believe that if they actually start the massage you will give in. They may be right as a straight forward “GO AWAY!” (Or more profane equivalent) doesn’t seem to work. Unfortunately it’s the most extreme example of the rapacious street hassle which typifies Barcelona. At first it’s amusing due to its near absurdity. But eventually it’s very very tiresome and wearing. I won’t be returning.", "publishedDate": "2019-05-24", "language": "en", "rating": 1}, {"id": 676141791, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d2645511-r676141791-Playa_de_La_Barceloneta-Barcelona_Catalonia.html", "text": "This is a beach close to the Colon circle, at the end of la Rambla from the water direction.\n\nWent there on a rainy day, so sadly could not capture the full vibe, but clean and nice, and connected to a stretch of other beaches all the way to the Barcelona Forum.\n\nI can only imagine how it is when the weather is good, and people are swimming and suntanning.\n\nIf you like beach or walking by the sea, this is not something to miss.", "publishedDate": "2019-05-24", "language": "en", "rating": 4}, {"id": 675936692, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d2645511-r675936692-Playa_de_La_Barceloneta-Barcelona_Catalonia.html", "text": "Barceloneta beach is beautiful and idyllic but ruined by the Vietnamese woman hassling you every 2 mins for a massage, one lady actually put her hands on me and I had to swipe her away and tell her no countless times and she laughed and eventually walked away. In the end I blatantly ignored them as they stood beside me until they moved on, they finally got the hint that I wasn't going to be persuaded. So if it wasn't for these woman, Barceloneta beach would be tip top! The beach is clean, there are plenty of toilets dotted along the prom and restaurants and cafes, perfect on a hot sunny day, it costs €10 to get a sun lounger on the beach but I wouldn't unless you want hassled constantly.", "publishedDate": "2019-05-23", "language": "en", "rating": 2}, {"id": 675826832, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d2645511-r675826832-Playa_de_La_Barceloneta-Barcelona_Catalonia.html", "text": "I’ve visited La Barceloneta twice. The first time it was may and I had some rest with my family by the sea. It wasn’t warm yet, but the beach was almost full. The second time was this year in March. Some people were already enjoying the beach but it was too windy to have proper rest. Anyway, the seafront, with its benches and its restaurants, was already crowded.\nFor whom who likes peace, La Barceloneta is not the right place. There are beaches little further from the city centre, which worth to be considered!", "publishedDate": "2019-05-22", "language": "en", "rating": 3}, {"id": 675217844, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d2645511-r675217844-Playa_de_La_Barceloneta-Barcelona_Catalonia.html", "text": "Playa De La Barceloneta is a nice beach very close to the city centre. We walked  around and enjoyed the day. There are quite a few shops in the area, including cafes, restaurants, bars and other types too. In Summer it would be a very popular place, but not as popular in cold weather.", "publishedDate": "2019-05-20", "language": "en", "rating": 4}, {"id": 675062677, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d2645511-r675062677-Playa_de_La_Barceloneta-Barcelona_Catalonia.html", "text": "Lovely stretch of beach with places to stop for a beer and something to eat. Great sitting watching the world go round but we were interrupted on numerous occasions by people selling beach mats, offering a massage and hair beads. We didn’t do this ourselves, but it would make a gorgeous beach walk along this long stretch of sands. If we visited Barcelona again we would probably stay in this area for a beach themed break and then travel to the city by metro. ", "publishedDate": "2019-05-19", "language": "en", "rating": 4}, {"id": 674145856, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d2645511-r674145856-Playa_de_La_Barceloneta-Barcelona_Catalonia.html", "text": "It’s a beach. There’s sand. There’s sea. There’s also dozens of people walking up and down trying to sell you drinks that they keep cool by hiding them in the sewer. PRO TIP: when the massage lady comes past, say that you have pain in your neck and she will give you a free neck rub at which point you can say no. Also, my friend who looks like Jordan Henderson grazed his knee when diving for a volleyball shot. 3 stars. ", "publishedDate": "2019-05-15", "language": "en", "rating": 3}, {"id": 673101437, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d2645511-r673101437-Playa_de_La_Barceloneta-Barcelona_Catalonia.html", "text": "beach almost in the heart of the big city? I'm not sure if i know better and bigger. also out of the season it is almost full of people, walking, running, or just sitting on the sand.", "publishedDate": "2019-05-10", "language": "en", "rating": 4}, {"id": 671770787, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d2645511-r671770787-Playa_de_La_Barceloneta-Barcelona_Catalonia.html", "text": "Playa de La Barceloneta is a real surprise. We walked all around Barcelona and then came across this lovely spot.  A beach in the middle of the city, basically! Okay, it's not the \"middle\" but it's so close to the city centre. It's a great spot for relaxation for families, couples or anyone who would care to go there. A terrific place.", "publishedDate": "2019-05-06", "language": "en", "rating": 4}, {"id": 667853277, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d2645511-r667853277-Playa_de_La_Barceloneta-Barcelona_Catalonia.html", "text": "It’s brilliant to have this beach right in the middle of a city, a great area to visit particularly with families. We visited in April and so many of the other attractions and amenities were not open but we still spent a sunny long afternoon there and enjoyed it and could have spent longer there.", "publishedDate": "2019-04-20", "language": "en", "rating": 5}, {"id": 664975207, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d2645511-r664975207-Playa_de_La_Barceloneta-Barcelona_Catalonia.html", "text": "We didn’t have the warmest weather but we still found time to walk the beaches and take in the beautiful views of the sea. It’s a lovely part of the city. ", "publishedDate": "2019-04-09", "language": "en", "rating": 4}, {"id": 664505033, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d2645511-r664505033-Playa_de_La_Barceloneta-Barcelona_Catalonia.html", "text": "Got in an early morning jog to here and decided to watch the sunrise.  It was really beautiful since there was no one on the beach, except a few other doing the same and folks that managed to go clubbing all night long.  I hung out there for about an hour and found it relaxing.  Took photos, but it doesn't do the scenery any justice.", "publishedDate": "2019-04-07", "language": "en", "rating": 4}, {"id": 664452494, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d2645511-r664452494-Playa_de_La_Barceloneta-Barcelona_Catalonia.html", "text": "We have been to the Barceloneta beach one time. We went there with our kids (8 and 5) and friends. Didn’t enjoy it at all. It is very crowded. People “sit on the heads” of each other. You really need to watch your staff. Many thieves. The water is dirty and there are many people. Next day we went to Castelldefels and enjoyed the beach a lot. Fewer people. Nice beach restaurants. Cleans beach.", "publishedDate": "2019-04-07", "language": "en", "rating": 2}, {"id": 663786565, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d2645511-r663786565-Playa_de_La_Barceloneta-Barcelona_Catalonia.html", "text": "You can get to the beach in multiple ways, by foot, by metro or by bus. We reached there at the sunset, it was an amazing view. It was a little bit cold but the sight...wow", "publishedDate": "2019-04-04", "language": "en", "rating": 5}, {"id": 662548801, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d2645511-r662548801-Playa_de_La_Barceloneta-Barcelona_Catalonia.html", "text": "When the weather is good, join the rest of the city on the sand of one of the beaches. Buy a giant pareo  from a vendor and watch the amazing skills of the beach volleyball players, and finish the afternoon with fresh seafood tapas.", "publishedDate": "2019-03-31", "language": "en", "rating": 4}, {"id": 662425142, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d2645511-r662425142-Playa_de_La_Barceloneta-Barcelona_Catalonia.html", "text": "We were here on a cruise stop and after a great Tapas Meal at Jai-Ca, we walked down to the beach.  It was basically deserted since it was raining, but at least we got to walk down and touch a toe in the water.  This would be a great beach in the summer.  After seeing pictures of this vibrant area, it was odd to see it so deserted.", "publishedDate": "2019-03-31", "language": "en", "rating": 4}, {"id": 661467076, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d2645511-r661467076-Playa_de_La_Barceloneta-Barcelona_Catalonia.html", "text": "This is a clean beach with beautiful scenery along the boardwalk.We took a stroll along the beach from Port Vell to a beach bar next to the marina near the Casino Barcelona.There were multiple choices of restaurants along the water or the side streets.The atmosphere was vibrant and lively.\n", "publishedDate": "2019-03-26", "language": "en", "rating": 5}, {"id": 660417115, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d2645511-r660417115-Playa_de_La_Barceloneta-Barcelona_Catalonia.html", "text": "Really good beach and boardwalk. There are plentiful cafes and restaurants and cycle hire is available. Nice to escape from the busy city streets for some sea air. ", "publishedDate": "2019-03-22", "language": "en", "rating": 4}, {"id": 660340129, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d2645511-r660340129-Playa_de_La_Barceloneta-Barcelona_Catalonia.html", "text": "This is a really nice place. I was here many many times and I recall the old times before the Olympic games when this was a little run down but which had excellent fish restaurants.\n\nIt is cleaner, safer now but it has to some extent lost it's old charm.\n\nThe day I was there it was not so good weather so it was quiet, none of the mad hordes which are normally here, I like it that way.\n\nWell worth a visit but in summer it must be chaos. Beach is nice and there are many restaurants, bars and supermarkets around to get something to eat.\n\nAvoid all restaurants who tout for clients. They are normally very bad quality, bad value and pure tourist traps.\n\nDon't buy stuff from the people selling near the beach, it is either counterfeit or stolen. These people do not pay taxes, vat or social security. You are supporting illegal activities.", "publishedDate": "2019-03-22", "language": "en", "rating": 4}, {"id": 660240916, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d2645511-r660240916-Playa_de_La_Barceloneta-Barcelona_Catalonia.html", "text": "My husband on our third trip to Barcelona was dying to see the beach so mid March we were  there. Being from Florida I found it interesting, nice and unique. Even though it was 50 degrees the sun was shining, a lot of people were hustling about and there was something for everyone. Several beachside restaurants, surfing, bike riding, a outdoor gym and strolling down the boardwalk walk. Interestingly many people were sun bathing fully clothed. I’d never seen such a thing but there were several beach goers participating. It was a nice and relaxing environment. However any tourist city comes with its negatives. I didn’t see one police officer but did see a woman in a chaotic state saying someone had stolen her wallet. Beware of pick pockets which I think is the norm in Barcelona.", "publishedDate": "2019-03-21", "language": "en", "rating": 5}, {"id": 659359698, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d2645511-r659359698-Playa_de_La_Barceloneta-Barcelona_Catalonia.html", "text": "It is a nice beach with a nice boardwalk. The restaurants are pricey and the food is ok - but if you stop by the gelato and hot chocolate kiosk you can have a delicious thick warm chocolate that is one of the best that we’ve had in Barcelona! ", "publishedDate": "2019-03-18", "language": "en", "rating": 4}, {"id": 658825589, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d2645511-r658825589-Playa_de_La_Barceloneta-Barcelona_Catalonia.html", "text": "Good place to eat , simple but great, well priced.\nHighly suggested.\nHad octopus , chorizo and gammon, all good with beer and whisky. A torta to finish.\nDo visit worth the money", "publishedDate": "2019-03-16", "language": "en", "rating": 4}, {"id": 658805437, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d2645511-r658805437-Playa_de_La_Barceloneta-Barcelona_Catalonia.html", "text": "The beach here is nice, but the Playa promenade is very busy and there are loads of traders selling fake crap.  There are nicer places to walk and take on Barcelona.", "publishedDate": "2019-03-16", "language": "en", "rating": 2}, {"id": 657653124, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d2645511-r657653124-Playa_de_La_Barceloneta-Barcelona_Catalonia.html", "text": "A lovely promenade approx 1.25km a great walk lovely sandy beach lots of bars and restaurants...skateboarders ...electric scooters ...roller skaters ...sand sculptures...a great buzz in this area fabulous on a hot sunny day ...we were lucky in March to have 23 degrees a great place to visit so close to the city centre ", "publishedDate": "2019-03-10", "language": "en", "rating": 5}, {"id": 657487240, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d2645511-r657487240-Playa_de_La_Barceloneta-Barcelona_Catalonia.html", "text": "Visited this place on an evening after a hectic few days of work. Pretty nice place to spend an evening with lot of restaurants nearby.  Next to harbor and a ship converted to restaurant. ", "publishedDate": "2019-03-09", "language": "en", "rating": 4}, {"id": 657094981, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d2645511-r657094981-Playa_de_La_Barceloneta-Barcelona_Catalonia.html", "text": "Went here for a few hours while in a long weekend and was surprised his busy it was for a March day. Weather was quite food though until the wind picked up around 5.30 and the beach cleared !\nPlace is really clean and lots of bars and restaurants.\nThere are quite a few traders as well as women offering massages which after a while became a bit annoying but other than that it was a nice place", "publishedDate": "2019-03-07", "language": "en", "rating": 4}, {"id": 656380967, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d2645511-r656380967-Playa_de_La_Barceloneta-Barcelona_Catalonia.html", "text": "In early springtime there was a lot of People walking and rolling and having time with frends. Long and well kept shore walkinglines. Lots of boats to admire. Shopping center. Small restaurants in the old part and more and differently prised restaurants in the new part.", "publishedDate": "2019-03-04", "language": "en", "rating": 4}, {"id": 656299401, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d2645511-r656299401-Playa_de_La_Barceloneta-Barcelona_Catalonia.html", "text": "We looked forward to visit the beach and take a stroll on it... African salesmen every where with sunglasses, handbags and so on. We left it and if you’re not keen on shopping copies not worth a visit!?", "publishedDate": "2019-03-04", "language": "en", "rating": 1}]}}]