[{"locationId": 4597443, "name": "Casa de La Llotja", "placeType": "ATTRACTION", "reviewListPage": {"reviews": [{"id": 632600453, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d4597443-r632600453-Casa_de_La_Llotja-Barcelona_Catalonia.html", "text": "Very nice, old and traditional building with great spanish architecture. It is fully recommended to go there", "publishedDate": "2018-11-11", "language": "en", "rating": 5}, {"id": 591825783, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d4597443-r591825783-Casa_de_La_Llotja-Barcelona_Catalonia.html", "text": "This is one of the most important buildings in Barcelona that you've never heard of.\n\nAside from housing the Royal Catalan Academy of Fine Arts of Saint George (on the 2nd Floor - with a separate review), you will find architecture here that is truly stunning - both gothic and neoclassical in the same building.  This has been one of the most important buildings in Barcelona since the 14th Century.\n\nThe original structure was finished in 1392, and the \"Salón de Contraciones\" provides a breathtaking view of medieval gothic architecture that has been protected from the elements and so reveals incredible details.  The neoclassical façade and addition were commissioned in 1771, and provides a duality that is nothing short of stunning.\n\nThe building is truly still alive.  Within the \"Salón de Cónsuls\" on the 2nd Floor, the Barcelona Commodities Exchange (3rd largest in the world, after Chicago and Paris) conducts business every Tuesday.  Deals are closed with a handshake.  The Salón Lucrecia, the Salón Dorado and the Escalera de Honor all add to the majesty of this structure.\n\nWe contracted a local tour guide with a thorough knowledge of the history and splendor of the building - it really added to the experience!  Our tour guide explained that It has only been open to the public for two years, and that pre-teens must be carefully supervised.  \n\nTruly worth a visit!", "publishedDate": "2018-06-30", "language": "en", "rating": 5}, {"id": 584356056, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d4597443-r584356056-Casa_de_La_Llotja-Barcelona_Catalonia.html", "text": "This is a classic Gothic building near the waterfront built in th 14th century and has been involved in commerce and commodities trade ever since.It is now th head quarters  of the Barcelona Chamber of Commerce.", "publishedDate": "2018-06-01", "language": "en", "rating": 3}, {"id": 505266782, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d4597443-r505266782-Casa_de_La_Llotja-Barcelona_Catalonia.html", "text": "La Llotha is not the post office as some have posted and included pictures, it is a commodities exchange since medieval times. As a seafaring city, commerce needed such a market to exchange goods and this building has done that for hundreds of years. The post office building is incredible in its own right but it is across the street.", "publishedDate": "2017-07-24", "language": "en", "rating": 3}, {"id": 473397586, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d4597443-r473397586-Casa_de_La_Llotja-Barcelona_Catalonia.html", "text": "A classy building especially with different type of lighting played in the ballroom. A very beautiful ball room and very fortunate to attend a dinner event there", "publishedDate": "2017-04-07", "language": "en", "rating": 4}, {"id": 365952914, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d4597443-r365952914-Casa_de_La_Llotja-Barcelona_Catalonia.html", "text": "Lots of historical buildings but this can be visited and is used as a large hall for corporate functions. Fascinating ceiling and internal walls. Worth a look", "publishedDate": "2016-04-20", "language": "en", "rating": 4}, {"id": 275778002, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d4597443-r275778002-Casa_de_La_Llotja-Barcelona_Catalonia.html", "text": "La Lotja has been once the stock exchange palace; actually is a common Post Office, so you can enter it and take a look to its wonderful, renaissance ceiling. It's not so normal do tourism in post office, is it?", "publishedDate": "2015-05-30", "language": "en", "rating": 4}, {"id": 258042016, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d4597443-r258042016-Casa_de_La_Llotja-Barcelona_Catalonia.html", "text": "Hard to pick a better venue than this for a large corporate gathering. Impressive inside and out, the intricate ceiling is worth a long look. The setup makes this a good place for many gatherings. \n\nTIP: It can be tricky finding a taxi here in the evening. Suggest having Uber on your phone.", "publishedDate": "2015-03-06", "language": "en", "rating": 5}]}}]