[{"locationId": 592191, "name": "Plaça George Orwell", "placeType": "ATTRACTION", "reviewListPage": {"reviews": [{"id": 728399875, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d592191-r728399875-Placa_George_Orwell-Barcelona_Catalonia.html", "text": "A small plaza in the gothic quarter surrounded by bars and cafes , quite nondescript really even grubby as theres a few tattoo parlours and lots of graffitti  . we had passed through it without realising what it was but i walked back to take a shot of the structure in the pic", "publishedDate": "2019-11-23", "language": "en", "rating": 3}, {"id": 706360530, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d592191-r706360530-Placa_George_Orwell-Barcelona_Catalonia.html", "text": "We wandered to this square completely by mistake; but a pleasant surprise. Turns out George Orwell owned a house here during the war and this is where he stayed. The square is surrounded by loads of boutique stores and lovely restaurants. We stopped for some tapas of course! Definitely worth a visit if you're in Barcelona. :) ", "publishedDate": "2019-09-04", "language": "en", "rating": 5}, {"id": 690183963, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d592191-r690183963-Placa_George_Orwell-Barcelona_Catalonia.html", "text": "The Placa George Orwell is a public square located in the Gothic quarter of Barcelona and name for the British author of 1984 and Homage to Catalonia. By the standards of the ever popular Gothic quarter, this is quite a quiet square more popular with locals and it is with tourists. Perhaps something to do with it’s seedy reputation reputation and it’s local name of \"La Plaça Tripi” or the acid square. In the centre of the square is a large-scale reproduction of a surrealist work by Leandre Cristòfol, which was probably made on a “trip” as well.\n\nThere’s really nothing here for the average tourist and certainly unless they know their way around less popular tourist spots.", "publishedDate": "2019-07-16", "language": "en", "rating": 3}, {"id": 676718439, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d592191-r676718439-Placa_George_Orwell-Barcelona_Catalonia.html", "text": "The reason for top score in this review is the name, rather than the place. George Orwell is one of the great writers of all time. This lover of his books is also glad of the practical advantages of the place named in his honour - shade, peace and quiet, bars, and proximity to many attractions. ", "publishedDate": "2019-05-26", "language": "en", "rating": 5}, {"id": 673190453, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d592191-r673190453-Placa_George_Orwell-Barcelona_Catalonia.html", "text": "This square is named after the British author who wrote the book Homage to Catalonia. \n\nThe square has some bars and a strange sculpture.", "publishedDate": "2019-05-11", "language": "en", "rating": 3}, {"id": 658805130, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d592191-r658805130-Placa_George_Orwell-Barcelona_Catalonia.html", "text": "If you want a little peace whilst exploring the Gothic quarter this Plaça is a little sun trap.  There is a little play area if you have young children.  Don’t miss Conos a little takeaway serving cones with calamari, white bait and vegetables.  Cheap and very tasty ", "publishedDate": "2019-03-16", "language": "en", "rating": 4}, {"id": 634471106, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d592191-r634471106-Placa_George_Orwell-Barcelona_Catalonia.html", "text": "The Placa de George Orwell is a small square located in the Gothic Quarter of Barcelona. This square is named after this famous writer because of the book he wrote titled \" Homage to Catalonia\" which is his first hand account of the Spanish Civil War. He came to Barcelona to cover the Spanish Civil War but was so moved by the Republican resistance he decided to volunteer to fight the Fascist government of Franco which nearly cost him his life. This square is home to a couple restaurants and bars and on Sunday they have a outdoor flea market featuring paintings and art. Jolly Chriss.", "publishedDate": "2018-11-19", "language": "en", "rating": 4}, {"id": 629777550, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d592191-r629777550-Placa_George_Orwell-Barcelona_Catalonia.html", "text": "Plaça George Orwell is a plaza i came across as my twin brother Stephen and I were wandering around this part of town and in all honesty it's not one of the best plaza's in Barcelona, it's sort of none descript and aside from the name of the plaza there is absolutely nothing to commemorate the great man,no information not even a statue although there is a modern piece of street art here that looks kinda cool.\nThe architecture here is in keeping with the splendid architecture you will see all over the Gothic Quarter and there's some great cafe's and restaurants here but in truth it's not worth going out of your way to visit.\nEasy to find on Paseo De Carrer Escudellers.", "publishedDate": "2018-10-30", "language": "en", "rating": 3}, {"id": 627091320, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d592191-r627091320-Placa_George_Orwell-Barcelona_Catalonia.html", "text": "I have to admit I was disappointed to finally arrive here after wandering through the beautiful old Gothic Quarter whilst looking forward to discovering this little square. To be fair, it doesn't memorialise George Orwell, as a man, or author, it is simply named after him as one of the Revolutionary Freedom Fighters of the Spanish Civil War. But if you are a fan then you will have read Homage to Catalonia, and that's where it can be exciting because with a little effort you can recognise quite a few of the locations he describes.\nThere is sadly a darker side to this square though, it has a reputation, outside the hours of daylight, as a place to find, and use all kinds of recreational drugs. So definitely not a place to wander round after dark with a young family. Through the day though it is just another square with yet another sculpture within the medieval quarter, so don't be afraid to visit whilst the sun is above you.", "publishedDate": "2018-10-21", "language": "en", "rating": 3}, {"id": 623735605, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d592191-r623735605-Placa_George_Orwell-Barcelona_Catalonia.html", "text": "Restaurant  Dionisos\nThis place is well worth a lunch time stop off. Great value for money for a meal, especially meal of the day,  €11.90 (outside) = starter, main , dessert,  wine/beer and coffee.\nPanos is such a charasmatic and helpful Greek waiter, making for sense of the menu choices.\nHighly recommend the food and atomasphere. +++", "publishedDate": "2018-10-10", "language": "en", "rating": 5}, {"id": 612141242, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d592191-r612141242-Placa_George_Orwell-Barcelona_Catalonia.html", "text": "Out wandering through the amazing streets came across a little tapas/sushi restaurant, unusual combination but suited us fine. Waiter was very friendly and animated, food was ok, nothing spectacular. Playground in the middle of the square for families. Very weird characters walking through busking, great if you want a drink and people watch.", "publishedDate": "2018-08-29", "language": "en", "rating": 4}, {"id": 610475856, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d592191-r610475856-Placa_George_Orwell-Barcelona_Catalonia.html", "text": "I was asked by a friend to locate this place and take photos. After some searching I found a rather nondescript square and after some more searching finally the street sign. Apparently I had arrived. I spun around my own axis a few times trying to work out what I’m missing. Nothing really. There’s a cafe/restaurant sort of place there, otherwise nothing much at all. It being Sunday morning and the shop shutters still down I could locate some graffiti with reference to ‘1984’. Unless you’re a complete Orwell geek I’d say don’t bother going out of your way for this. A few steps further, yes there’s some surveillance cameras or a shop with a theme that you could twist into a “look! The juxtaposition”-kind of travellog, if desperate.", "publishedDate": "2018-08-26", "language": "en", "rating": 2}, {"id": 607634479, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d592191-r607634479-Placa_George_Orwell-Barcelona_Catalonia.html", "text": "I'm a George Orwell fan,so on this visit to Barcelona I resolved that I would see 'Placa George Orwell'. I had been vaguely aware that Orwell spent a little time in Barcelona (or in Catalonia at least), but knew nothing of the circumstances. It wasn't far from the hotel, so I marched off to see it, assuming there would be an informative plaque, and that his homesite might be open for tours. \n\nWhat a disappointment. I learned that George Orwell never lived at Placa George Orwell; in fact it's known as “Placa del Tripi” by the locals! The decision to bestow Orwell's name on this place was apparently made only in March,1996 by local government officials, possibly due to the fact that Orwell fought in the Spanish Civil War for the Republican side. \n\nWhat is eerily prescient about naming the plaza after Orwell is this: In 2001, Placa George Orwell became the first public space in Barcelona to be controlled by municipal video surveillance cameras! Think about that for a moment (or read 1984 if you need a refresher). \n\nAnd so, if you're a George Orwell fan, and you want to ponder his life while you're in Barcelona, I'd suggest that instead of visiting the plaza named after him, you read 'Homage to Catalonia', and take a stroll down La Rambla. Many of the places he described are still recognizable. Here are a few other references if you're interested: \n\n[REMOVED per TripAdvisor censorship... Sorry, you'll have to research this on your own]", "publishedDate": "2018-08-18", "language": "en", "rating": 2}, {"id": 524106619, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d592191-r524106619-Placa_George_Orwell-Barcelona_Catalonia.html", "text": "I did inform myself prior to going there so I knew what to expect - not much. But surroundings is swell (Gothic quarter) and we kind of found it by mistake. However it is a must for every Orwelian or civil war enthusiast.. which I am.", "publishedDate": "2017-09-13", "language": "en", "rating": 4}, {"id": 495884886, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d592191-r495884886-Placa_George_Orwell-Barcelona_Catalonia.html", "text": "If, like me, you have read Homage to Catalonia and thought you would visit, just look at the photos unless you are in the area. There not much to see and it's definitely not worth going out of your way to find. ", "publishedDate": "2017-06-25", "language": "en", "rating": 3}, {"id": 493154686, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d592191-r493154686-Placa_George_Orwell-Barcelona_Catalonia.html", "text": "Our hotel over looked the plaza and we got to experience it all hours of the day. It was quite at daybreak, bustling at lunch, and filled with groups meeting in the evening. It was a lovely place to enjoy a beer, watch children play in the little park in the middle, enjoy life slowly go by. \nThere is nothing here about Orwell, it's just named in his honor as a former freedom fighter from the Spanish civil war. \nIf you're in the gothic quarter, it's worth coming here; but it is not a destination itself.", "publishedDate": "2017-06-14", "language": "en", "rating": 4}, {"id": 474942591, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d592191-r474942591-Placa_George_Orwell-Barcelona_Catalonia.html", "text": "It is wonderful to see the tribute paid to Orwell by naming this square to his honor, however there is nothing special to experience ", "publishedDate": "2017-04-12", "language": "en", "rating": 2}, {"id": 365727633, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d592191-r365727633-Placa_George_Orwell-Barcelona_Catalonia.html", "text": "Placa de George Orwell is a bit of a let down. On the one hand, it's good to see that Barcelona has commemorated Orwell. On the other hand, it's not connected to him at all. The Placa is, apparently, a hang out for drug dealers and - ironically - was one of the first places in Barcelona to install CCTV cameras!\n\nOn the other hand, there are two excellent veggie eating places here, so not a bad place to visit for food.", "publishedDate": "2016-04-20", "language": "en", "rating": 3}, {"id": 340661195, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d592191-r340661195-Placa_George_Orwell-Barcelona_Catalonia.html", "text": "George Orwell came to Spain in 1936 to fight as part of the International Brigade against Franco’s nationalists. Two years later, he wrote the “Homage to Catalonia” as a personal observation of a warfare and a remarkable portrait of the city in its most vulnerable times. Well, the square doesn’t reflect the writer’s merit for this city. It is a small, inconspicuous square that locals often call “Placa del Tripi” (or Acid Square) for self-explanatory reasons.", "publishedDate": "2016-01-17", "language": "en", "rating": 3}, {"id": 273983622, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d592191-r273983622-Placa_George_Orwell-Barcelona_Catalonia.html", "text": "Unless you are an old etonian, born in 1984, live on animal farm, come from wigan pier or have been down and out in paris or london, walk past this Catalonian homage to George", "publishedDate": "2015-05-23", "language": "en", "rating": 2}, {"id": 217966148, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d592191-r217966148-Placa_George_Orwell-Barcelona_Catalonia.html", "text": "Not really anything there except a modern statue. If you end up there when you wandering, fine, but not worth searching for.", "publishedDate": "2014-07-28", "language": "en", "rating": 2}, {"id": 180567599, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d592191-r180567599-Placa_George_Orwell-Barcelona_Catalonia.html", "text": "This little square (actually a triangle) is worth a look, just for this history lesson. It's not spectacular but it is rich with history. It has definitely had its ups and downs and used to be known as La Plaça Tripi...or \"the acid square\" because of its seedy background. I'd describe the area as being a somewhat seedy, half wonderful, mostly safe neighborhood there is a park because yes, children live here too. \n\nSuch an English name does not usually grace the squares of Spain. George Orwell is probably best known for controversial books like 1984 and Animal Farm but he also wrote Homage to Catalonia, his first-hand account of the Spanish Civil War. It was recognized to be a meaningful contribution to Barcelona and is said to be one of the most honest versions of the social and political story of the time. \n\nPlaça George Orwell has some unusual and controversial architectural features for an ancient European square such as an unusual sculpture of Orwell erected in his honor. It is supposed to represent the gunshot that went through his throat when he lived here.\n\nIf you're tired of the bustle of la Ramba, take a two minute detour and sit in Plaça George Orwell for a few minutes and watch people for a bit. Not a bad way to spend a few minutes.", "publishedDate": "2013-10-11", "language": "en", "rating": 4}, {"id": 165847320, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d592191-r165847320-Placa_George_Orwell-Barcelona_Catalonia.html", "text": "Some art sculpture on this square and that's it. Ugly square with too modern art, doesnt fit in this part of town. Not worth a visit.", "publishedDate": "2013-07-01", "language": "en", "rating": 1}]}}]