[{"locationId": 191047, "name": "Port Vell", "placeType": "ATTRACTION", "reviewListPage": {"reviews": [{"id": 752764772, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d191047-r752764772-Port_Vell-Barcelona_Catalonia.html", "text": "The Adventure Buddies enjoyed Port Vell walking around seeing all the beautiful boats, yachts, restaurants and souvenir stands. It is a nice place to walk around.", "publishedDate": "2020-04-19", "language": "en", "rating": 4}, {"id": 744678186, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d191047-r744678186-Port_Vell-Barcelona_Catalonia.html", "text": "A lovely stroll and quite nice to sit and watch the view. Nice architecure too nearby.\nA lot of tourists, so watch your belongings due to theives.\nA shopping mall near. Theres always a lot to do here which is good. \n", "publishedDate": "2020-02-12", "language": "en", "rating": 3}, {"id": 742126044, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d191047-r742126044-Port_Vell-Barcelona_Catalonia.html", "text": "Nice views of boats and massive yachts. Right on the harbor. Boats and more boats.\n\nThere was this restaurant called Luz de gas right on the harbor. Had an upper deck for seating too. \n\nSo much to take in. Lots and lots of great bottles of red wines, lots of local cuisine and beautiful yachts to aspire for one day.\n\nFood wasn’t bad, the wine was better. ", "publishedDate": "2020-01-30", "language": "en", "rating": 3}, {"id": 740075339, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d191047-r740075339-Port_Vell-Barcelona_Catalonia.html", "text": "We came to Port Vell to watch Circ Raluy Historic. Resident here for 3 months over Xmas and New Year. \n\nGreat show. Old fashioned, vintage. Made everyone laugh.", "publishedDate": "2020-01-19", "language": "en", "rating": 5}, {"id": 737633419, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d191047-r737633419-Port_Vell-Barcelona_Catalonia.html", "text": "The marina at Port Vell is a great place to walk around for seeing the sea, the local restaurants and some amazing yachts.", "publishedDate": "2020-01-07", "language": "en", "rating": 4}, {"id": 735558065, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d191047-r735558065-Port_Vell-Barcelona_Catalonia.html", "text": "Very nice but very busy. This port is pretty big and it has restaurants around it but it has too much street sellers spoiling your visit  but other than that it is beautiful.", "publishedDate": "2019-12-30", "language": "en", "rating": 4}, {"id": 731662107, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d191047-r731662107-Port_Vell-Barcelona_Catalonia.html", "text": "We walked from Port Vell to Port Olympic on a beautiful winter day.  We enjoying the scenery and sunshine during this walk.", "publishedDate": "2019-12-09", "language": "en", "rating": 4}, {"id": 730869894, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d191047-r730869894-Port_Vell-Barcelona_Catalonia.html", "text": "It was very beautiful and easy accessible. In December there is a Christmas market on the port. The views are amazing and mixed with nature, old building and new technologies.", "publishedDate": "2019-12-05", "language": "en", "rating": 5}, {"id": 730620195, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d191047-r730620195-Port_Vell-Barcelona_Catalonia.html", "text": "I had this experience and it was wonderful to take a walk with friends next to the boats and seagulls fly above you. Beautiful colors, happy people and the breeze of Cataluna!", "publishedDate": "2019-12-04", "language": "en", "rating": 5}, {"id": 729785195, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d191047-r729785195-Port_Vell-Barcelona_Catalonia.html", "text": "We went here after two days of shopping, museums and cathedrals. Barcelona is a very large and beautiful city,  with so much to see and do. Port veil is near a very nice beach, with lots of nice restaurants. Great for a relaxing few hours.", "publishedDate": "2019-11-30", "language": "en", "rating": 5}, {"id": 728888216, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d191047-r728888216-Port_Vell-Barcelona_Catalonia.html", "text": "Port Vell is at the foot to Las Ramblas.  Here cruise ships dock and leisure yachts reside near to the World Trade Centre.", "publishedDate": "2019-11-25", "language": "en", "rating": 4}, {"id": 722466614, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d191047-r722466614-Port_Vell-Barcelona_Catalonia.html", "text": "A classy part of Barcelona, definitely worth a look. Check out the amazing yachts and see how the other half live! Also go to bar 1881 on top of the museum building for a great vibe and drinks.", "publishedDate": "2019-10-29", "language": "en", "rating": 5}, {"id": 722278692, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d191047-r722278692-Port_Vell-Barcelona_Catalonia.html", "text": "It was just lovely. Perfect place for chill out. The food was good. Drink not so expensive. Generally happy with the place", "publishedDate": "2019-10-29", "language": "en", "rating": 5}, {"id": 719149175, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d191047-r719149175-Port_Vell-Barcelona_Catalonia.html", "text": "Port Vell is a waterfront harbor in Barcelona. It was built as part of an urban renewal program prior to the 1992 Barcelona Olympics.  A pedestrian walkway, Rambla de Mar, connects La Rambla to Port Vell.  It incorporates a swing bridge, in order to allow ships to enter and exit the harbour.  If you head for the waterfront you'll be able to see the historic schooner, the Pailebot Santa Eulàlia, which was built in 1918. Also, the wooden walkway, known as the Rambla de Mar, leads to the retail and leisure complex Maremagnum and Barcelona's L'Aquàrium. Modern place with delicious food and fast service. They serve seafood and local foods. Good for catching a breeze after crowded streets of Barcelona.", "publishedDate": "2019-10-17", "language": "en", "rating": 5}, {"id": 717627772, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d191047-r717627772-Port_Vell-Barcelona_Catalonia.html", "text": "It's a spacious and joyful space, where you can walk and have a look on the sea, specially on sunset, then go on a boatrip in the port, and finish the stay with a good meal of sea food in a restaurant in the corner. I went two times during my stay in Barcelona.", "publishedDate": "2019-10-12", "language": "en", "rating": 5}, {"id": 714022278, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d191047-r714022278-Port_Vell-Barcelona_Catalonia.html", "text": "Loads of boats ranging from tiny sailboats to unbelievable cruise ships. Worth walking along to get between major locations (beach, Gothic district, las Ramblas) - but not worth going out the way to see it unless you're really into boats. Was much prettier at night in my opinion", "publishedDate": "2019-09-29", "language": "en", "rating": 4}, {"id": 708241481, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d191047-r708241481-Port_Vell-Barcelona_Catalonia.html", "text": "Located along the waterfront not too far from La Rambla. Lots of sail boats to look at. Also places to shop and places to eat. ", "publishedDate": "2019-09-09", "language": "en", "rating": 3}, {"id": 706101092, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d191047-r706101092-Port_Vell-Barcelona_Catalonia.html", "text": "Pros\n- the view at the end is lovely\n- great to nosey at the super priced yaughts\n\nCons\n-restaurant staff trying to get you in are aggressive\n-restaurants display trip advisor excellence stickers but when you look them up its from years ago\n- sunglasses/hat/watch seller accused my husband of being racist as he wouldn't give him attention when he got way too close for comfort. He is very lucky we bit our tounges and just walked away. ", "publishedDate": "2019-09-03", "language": "en", "rating": 3}, {"id": 697416322, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d191047-r697416322-Port_Vell-Barcelona_Catalonia.html", "text": "This is a nice area for a walk while in Barcelona, the marina is full of yachts , some of which are breathtaking. Apparently there are some good restaurants in the area but we did not visit them.", "publishedDate": "2019-08-09", "language": "en", "rating": 4}, {"id": 696185023, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d191047-r696185023-Port_Vell-Barcelona_Catalonia.html", "text": "There is not much to be said, it was another nice location to people watch an catch a good breeze. There are a lot of boats near by as it is a marina, and there are a lot of  restaurants that offer great views but they will be a bit of the higher price. There are also a lot of vendors on the street as well.", "publishedDate": "2019-08-06", "language": "en", "rating": 3}, {"id": 696037918, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d191047-r696037918-Port_Vell-Barcelona_Catalonia.html", "text": "A huge marina with hundreds of yachts and other floating vessels.\nYou can walk for hours on the wharf and watch them.\nAnd if you're lucky enough, you'll be able to see the world's largest motor yachts worth hundreds of millions of dollars.\nMajka and Ryszard from Poland\n   \nOlbrzymia marina z setkami jachtów i innych pływających jednostek.\nMożna godzinami chodzić po nabrzeżu i je oglądać.\nA jeżeli ma się akurat szczęście, to uda się zobaczyć największe jachty motorowe świata, warte setki milionów dolarów.\nMajka i Ryszard z Polski", "publishedDate": "2019-08-06", "language": "en", "rating": 5}, {"id": 694748699, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d191047-r694748699-Port_Vell-Barcelona_Catalonia.html", "text": "I wanted to see sunset falling over the sea in Barcelona during our stay and I heard of those trips so I purchased ours (which was a bit pricey) through GetYourGuide. My family and I loved it. \n\nI'm not sure if you could rent a boat from Port Vell on spot, but for us, when we arrived there seemed to be someone who knew about us and whom I showed the booking reference to. Even if you were not renting a boat, I feel like just passing by the port at sunset time would be magical. The boats are lined up in a long row, and honestly, going to a port for the first time ever that itself was an experience. \n\nPort Vell is located at the end of La Rambla. It is a good 20-minutes walk, but we took a taxi because the folks I was with didn't feel like walking. \n\nWill I recommend it? Well, it depends on the sort of traveler you are. I would say it was an added bonus to our trip and the kids specially enjoyed it.", "publishedDate": "2019-08-01", "language": "en", "rating": 5}, {"id": 684840984, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d191047-r684840984-Port_Vell-Barcelona_Catalonia.html", "text": "Generally overpriced restaurants of  average quality alongside with African Street market selling fake goods.  I don't feel comfortable walking along the seafront at all.", "publishedDate": "2019-06-27", "language": "en", "rating": 2}, {"id": 684573984, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d191047-r684573984-Port_Vell-Barcelona_Catalonia.html", "text": "Pleasant promenade at the foot of the Ramblas, next to the marina.  Walk across the bridge to get to the big shopping centre, Maremagnum.", "publishedDate": "2019-06-26", "language": "en", "rating": 4}, {"id": 684376612, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d191047-r684376612-Port_Vell-Barcelona_Catalonia.html", "text": "On a recent trip to Barcelona, Spain my wife and visited the Port Vell area twice. There is so much to see and do here that a couple of visits were needed to see as much as we could.\n\nThe port is huge and there are many ferries, cruise ships, luxury yachts, and sailboats in the harbor. The first visit we took the Teleferico del Puerto ( cable car ) over the port and the views were outstanding. Our second and last visit we walked across the famous wooden bridge and checked out some shops and restaurants. Plus we took a ride on the Goleta Karya sailboat into the Mediterranean and that was great. Plus seeing Barcelona and the port from the water was pretty nice.\n\nSo if you are in Barcelona go and check out Port Vell and the area surrounding it..The beaches there are nice too.....", "publishedDate": "2019-06-25", "language": "en", "rating": 5}, {"id": 679573450, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d191047-r679573450-Port_Vell-Barcelona_Catalonia.html", "text": "A very good port just to have a walk and to enjoy seeing all the boats. Was very nice! We also recommend you to try some other ports of Barcelona.", "publishedDate": "2019-06-06", "language": "en", "rating": 5}, {"id": 675989541, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d191047-r675989541-Port_Vell-Barcelona_Catalonia.html", "text": "Nice area to walk around! Bridge was nice. Nice to have a stroll down the water from. LOADS of looky looky men! ", "publishedDate": "2019-05-23", "language": "en", "rating": 4}, {"id": 675601573, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d191047-r675601573-Port_Vell-Barcelona_Catalonia.html", "text": "Wow what a harbour, I have never seen so many luxury yachts in my life. Area is buzzing with traders and cafe bars.", "publishedDate": "2019-05-21", "language": "en", "rating": 5}, {"id": 675060962, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d191047-r675060962-Port_Vell-Barcelona_Catalonia.html", "text": "We enjoyed the sights of the huge yachts at this vast port. The yacht show was on at the time so there were a large number of really impressive vessels moored up. It’s a lovely stretch but the off putting part is the numerous street sellers crowding the pavements. The port leads you down to the beach. Give yourself about an hour to walk and take in the sights. ", "publishedDate": "2019-05-19", "language": "en", "rating": 3}, {"id": 671843795, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d191047-r671843795-Port_Vell-Barcelona_Catalonia.html", "text": "Port Vell is a lovely area to visit. There are the water views and all those boats to watch. There are cafes and several eateries as well as other shops. You can sit down and have a drink or a bite to eat and just watch the world by.  It's worth visiting.", "publishedDate": "2019-05-06", "language": "en", "rating": 4}, {"id": 670987448, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d191047-r670987448-Port_Vell-Barcelona_Catalonia.html", "text": "Loved exploring around here plenty to do. Watch the amazing cruise ships coming into port, shopping, eating and drinking. Would recommend for all ages really and would definitely visit again when in Barcelona.", "publishedDate": "2019-05-02", "language": "en", "rating": 5}, {"id": 665996805, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d191047-r665996805-Port_Vell-Barcelona_Catalonia.html", "text": "This is a beautiful part of Barcelona, close to restaurants, bars, street vendors and shops. The harbour is magnificent with beautiful yachts lined up for ll to see. The walks along the harbour are atmospheric by day and equally so by night. Felt happy here...", "publishedDate": "2019-04-13", "language": "en", "rating": 5}, {"id": 665729517, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d191047-r665729517-Port_Vell-Barcelona_Catalonia.html", "text": "The board walk here is nice to stroll on at any time of day but our favourite was in the evening.Sadly, even then there are still,pavement sellers, but we just ignored them.A bit of space and some sea air, also we took a look at some of the very large yachts anchored a little further down the harbour.", "publishedDate": "2019-04-12", "language": "en", "rating": 4}, {"id": 665538540, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d191047-r665538540-Port_Vell-Barcelona_Catalonia.html", "text": "Very busy place at the bottom of Las Ramblas which is worth seeking out for a stroll around. Check out the yachts and cruisers and take the ski lift up for an amazing view of Barcelona. A few decent and reasonable bars to pop in for a drink too.", "publishedDate": "2019-04-11", "language": "en", "rating": 4}, {"id": 662884332, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d191047-r662884332-Port_Vell-Barcelona_Catalonia.html", "text": "This is a beautiful area at the end of Las Ramblas as you walk it's length from Placa De Catalunya.  There is the amazing Christopher Columbus  Column leading to the big shopping,restaurant and entertainment centre of The Maremagnum. On the left is the picturesque Marina and a short walk to the right brings you to the remains of Barcelona's medeval walls. You can watch the cross harbour cable car\"Teleferic\" wend  its way from Mont Juic to Barcalonetta. So much to see and do here. You can also catch coastal boat trips close to the customs house architectural gem. Duration 1 hour. A must see area.", "publishedDate": "2019-04-01", "language": "en", "rating": 5}, {"id": 660504313, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d191047-r660504313-Port_Vell-Barcelona_Catalonia.html", "text": "At the bottom of Ramblas lies Port Vell a marina and shopping/entertainment complex. It is interesting even a little quirky in design but nothing special inside. We live in Malaga province so we wanted to see any differences. Same \"looky looky\" men everywhere and the same lack of interest by the local police in moving them on. Unless you eat in one of the restaurants there is a \"pay to use toilet\" in the complex - really!", "publishedDate": "2019-03-23", "language": "en", "rating": 4}, {"id": 658850301, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d191047-r658850301-Port_Vell-Barcelona_Catalonia.html", "text": "Port Vell is a super busy area on the waterfront.  Sadly now invaded by pavement sellers, selling fake trainers and bags.  As a result walking though the area is now very crowded as the pavements are taken up fake crap.  Whatever you do, do not look interested in anything they have to sell. They can be quite aggressive if they think you want to barter.", "publishedDate": "2019-03-16", "language": "en", "rating": 3}, {"id": 657651992, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d191047-r657651992-Port_Vell-Barcelona_Catalonia.html", "text": "Love this area boat trips around the coast available ...if you enjoy sail boats and yachts this is the place to have a lovely stroll get an ice cream or coffee and just watch the boats well worth a visit ", "publishedDate": "2019-03-10", "language": "en", "rating": 5}, {"id": 657095381, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d191047-r657095381-Port_Vell-Barcelona_Catalonia.html", "text": "Went here while on a weekend break and a really nice place.\nLots of fantastic boats to look a and bars and restaurants to sit in right next to the water.\nThere are loads of street traders there all selling fake fashions and tourist bits they did not pressurise though so nice just to stroll through and look", "publishedDate": "2019-03-07", "language": "en", "rating": 4}, {"id": 656759918, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d191047-r656759918-Port_Vell-Barcelona_Catalonia.html", "text": "Port Vell is were the super rich moor their super yachts and what a magnificent sight they are with plenty of restaurants and bars along the way.", "publishedDate": "2019-03-06", "language": "en", "rating": 5}, {"id": 654772465, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d191047-r654772465-Port_Vell-Barcelona_Catalonia.html", "text": "Fine venue for spending a Sunny afternoon. Nice views, shopping mall, bars and many people gathering.", "publishedDate": "2019-02-25", "language": "en", "rating": 4}, {"id": 648558271, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d191047-r648558271-Port_Vell-Barcelona_Catalonia.html", "text": "Fantastic area for a wander, a stroll or a run or just waste a couple of hours. Perfect place for this stunning selfies to send back home.\nLoads of authentic bars and restaurants for food and drink. \nYou just have to try to paella ... absolutely delicious ", "publishedDate": "2019-01-27", "language": "en", "rating": 4}, {"id": 647122530, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d191047-r647122530-Port_Vell-Barcelona_Catalonia.html", "text": "This is the older port area of Barcelona and not the modern cruise terminal, there is lots to see and do in this area and a great new addition is a floating walkway out to a cinema complex. When I was there, there were a huge number of interesting ships in port and also lots of street vendors selling refreshments\n\nGot to see the sunset here as well which was a bonus.", "publishedDate": "2019-01-20", "language": "en", "rating": 4}, {"id": 646963750, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d191047-r646963750-Port_Vell-Barcelona_Catalonia.html", "text": "Port Well is a stop on the tour bus route and is a welcome relief from the hustle and bustle of the streets. There are restaurants and shops, a mall and plenty of opportunities to take a stroll without encountering any traffic.", "publishedDate": "2019-01-19", "language": "en", "rating": 4}, {"id": 640712861, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d191047-r640712861-Port_Vell-Barcelona_Catalonia.html", "text": "There’s a lot of activities (restaurants, a mall, shopping street, etc) surrounding this area it’s right off La Ramblas.\n\nI rented a bicycle and drove it around the port and other areas enjoying the view and all it has to offer!\n\nI recommend you rent a bicycle or a Segway whatever you prefer and go around. Enjoy!", "publishedDate": "2018-12-20", "language": "en", "rating": 4}, {"id": 638411899, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d191047-r638411899-Port_Vell-Barcelona_Catalonia.html", "text": "Very busy Harbor area with tons of street vendors along the beach and harbor selling knock off purses, shoes, etc...  We walked this area and then took the sky rise Gondola ride up to the Parc de Mont Juic.  This gondola ride is a must!", "publishedDate": "2018-12-09", "language": "en", "rating": 4}, {"id": 638070031, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d191047-r638070031-Port_Vell-Barcelona_Catalonia.html", "text": "Enjoyed strolling through the harbor and visiting the mall at Port Vell. Stopped by the McDonald’s to rest, and it was incredibly busy. ", "publishedDate": "2018-12-07", "language": "en", "rating": 5}, {"id": 635425672, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d191047-r635425672-Port_Vell-Barcelona_Catalonia.html", "text": "Port Vell commences at the end of Barcelona's La Rambla, by the Columbus monument. If you head for the waterfront you'll be able to see the historic schooner, the Pailebot Santa Eulàlia, which was built in 1918 and named after Barcelona's co-patron saint.\nAlso, the wooden walkway, known as the Rambla de Mar, leads to the retail and leisure complex Maremagnum and Barcelona's L'Aquàrium", "publishedDate": "2018-11-24", "language": "en", "rating": 4}, {"id": 633619989, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d191047-r633619989-Port_Vell-Barcelona_Catalonia.html", "text": "Port Vell is a waterfront harbor located in Barcelona. Port Vell contains a harbor, a shopping mall, restaurants and bars. A very scenic area of Barcelona.Jolly Chriss.", "publishedDate": "2018-11-15", "language": "en", "rating": 4}, {"id": 627783434, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d191047-r627783434-Port_Vell-Barcelona_Catalonia.html", "text": "We had time for a pleasant walk around the Port Vell area on our day in Barcelona on a cruise ship holiday.\n\nA bridge connects you to a mall and aquarium and there are plenty of stopping places to chill out and admire the views.\n\nWe were lucky enough to see the bridge open.", "publishedDate": "2018-10-24", "language": "en", "rating": 5}, {"id": 627277018, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d191047-r627277018-Port_Vell-Barcelona_Catalonia.html", "text": "We arrived at Barcelona's beach / port area via a cable car ride from the Miramar district, which was a fun experience in itself. (See \"Teleférico Del Puerto, Avinguda Miramar\" for further details relating to the cable car rides.) \n\nThe beach is terrific, but do take the opportunity to stroll along the promenades of Port Vell since they offer a selection of bars, restaurants and shops on one side of the avenue, and an array of market stalls on the other side, with traders and craftsmen selling their wares and produce.", "publishedDate": "2018-10-22", "language": "en", "rating": 3}, {"id": 624899259, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d191047-r624899259-Port_Vell-Barcelona_Catalonia.html", "text": "We went here on Sunday where there is food market with food stalls along the road. We stopped for a glass of craft beer which was super good. We also tried churos, but we did not like it.\nThis market add a bit more fun to walk here.", "publishedDate": "2018-10-14", "language": "en", "rating": 4}, {"id": 624159937, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d191047-r624159937-Port_Vell-Barcelona_Catalonia.html", "text": "The port area of Barcelona is an absolutely fantastic place to visit.\nBesides the great architecture that abounds in this district you also have the amazing amount of pubs,bars and restaurants plus the old town streets of the Barceloneta neighbourhood. \nMy twin brother Stephen and I visited the Port Vell district a couple of times on our eight days holiday to this vibrant city in September, temperature hitting the 30+ degree mark it was so nice sitting outside a bar and taking in the stunning views,I was really surprised at the amount of boats and yachts that were moored up in the port area.\nThis is one of the most popular area's of Barcelona, it's probably the first area that most of the tourists who disembark the huge cruise liners that dock here head to.\nA superb and lively area and most definitely well worth checking out. \n\n", "publishedDate": "2018-10-12", "language": "en", "rating": 5}, {"id": 623458608, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d191047-r623458608-Port_Vell-Barcelona_Catalonia.html", "text": "Bustling spot , people , traffic , shops , monuments , quite a busy atmosphere \n\nPlenty to see and do - we had a good walk through this area and enjoyed the sights\n", "publishedDate": "2018-10-09", "language": "en", "rating": 4}, {"id": 623077165, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d191047-r623077165-Port_Vell-Barcelona_Catalonia.html", "text": "Very old historical port with breath taking views and it’s a very big port . Lots of options of restaurants near by . Actually Barcelona is a place where you will find restaurants everywhere ", "publishedDate": "2018-10-07", "language": "en", "rating": 4}, {"id": 622430797, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d191047-r622430797-Port_Vell-Barcelona_Catalonia.html", "text": "Lovely port to have a walk around .Lots of nice sights especially when its sunny. Well worth a visit. Restaurants and shopping centre also there .some nice boats to have a look at.", "publishedDate": "2018-10-05", "language": "en", "rating": 5}, {"id": 620874056, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d191047-r620874056-Port_Vell-Barcelona_Catalonia.html", "text": "Not too far from the Columbus monument, we passed by an historical building under reconstruction; it was the 1902 Adauna Building (Old Customs House) or Duana Nova (New Customs House).  It is an architectural treasure.  The winged lions on top are frosting on the cake.  \n\nThere are columns, dentil molding, royal crowns and a beautifully decorated exterior.  When the sun (setting or rising) hits the building, a rosy glow emanates from the building.  It is undergoing renovations (as of September, 2018) and we look forward to seeing it when it returns to the public.   \n\nOur ship Aegean Odyssey docked in Port Vell and our main neighbors were a large Marriott Hotel and the aerial tram system from Mt. Juic to elsewhere.  Thie tower here provided necessary support.  It was amusing to see them pass by in the sky.\n\nPort Vell is very walkable and modern.  We found it the perfect point to begin our 2018 explorations.  It was a pleasure to be back here after 4 years.", "publishedDate": "2018-09-30", "language": "en", "rating": 4}, {"id": 620340665, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d191047-r620340665-Port_Vell-Barcelona_Catalonia.html", "text": "Barcelona was for many years one of the great naval powers of the Mediterranean Sea, and this area is a relic from that area. There's a fascinating naval museum nearby. Try to find it.", "publishedDate": "2018-09-28", "language": "en", "rating": 5}, {"id": 619996071, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d191047-r619996071-Port_Vell-Barcelona_Catalonia.html", "text": "Great view of all the yachts and boats.\n\nPerfect for a romantic walk, soaking in all the scenery.\n\nBest of all it's free ! ", "publishedDate": "2018-09-27", "language": "en", "rating": 5}, {"id": 618033832, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d191047-r618033832-Port_Vell-Barcelona_Catalonia.html", "text": "We strolled through here to see the Aquarium and go to the mall Maremagnum. It was a nice, clean area. Lots of street “blanket vendors” selling knock-off items. There’s lots of different areas to just sit and have coffee or ice craeam and watch the boards. ", "publishedDate": "2018-09-19", "language": "en", "rating": 4}, {"id": 617772505, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d191047-r617772505-Port_Vell-Barcelona_Catalonia.html", "text": "Port Vell is very impressive and also very beautiful !! The size of the boats takes your breath away ! It’s a really nice area to stroll around, take a break and enjoy a drink and watch the world go by. It’s definitely worth going down to the port - the cruise liners are amazing! Also in the evening you get great views of the famous ‘W’ hotel - would love a stay at that hotel.", "publishedDate": "2018-09-18", "language": "en", "rating": 5}, {"id": 617070677, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d191047-r617070677-Port_Vell-Barcelona_Catalonia.html", "text": "Beautiful place to go for an after dinner walk. There’s shops and restaurants close by. Stunning view. ", "publishedDate": "2018-09-16", "language": "en", "rating": 5}, {"id": 612559438, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d191047-r612559438-Port_Vell-Barcelona_Catalonia.html", "text": "Great value you can get Paella and a jug of Sangria for Just £18! The Paella was so tasty i really recommend it packed with flavour. We also were treated to a glass of cava on the house which really made our evening. Would definitely look to return the next time i visit.", "publishedDate": "2018-08-31", "language": "en", "rating": 4}, {"id": 609031280, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d191047-r609031280-Port_Vell-Barcelona_Catalonia.html", "text": "This area has restaurants, shops and activities and was a fun place to walk and watch the boats.  There was a lot of traffic on the water and we enjoyed savoring the waterfront.", "publishedDate": "2018-08-21", "language": "en", "rating": 4}, {"id": 608191121, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d191047-r608191121-Port_Vell-Barcelona_Catalonia.html", "text": "Loved going by Port Vell daily during our beautiful week in Barcelona.  The harbor, yachts, and view were always stunning and worth seeing, no matter how many times I looked.  Part of the special that is Barcelona...wish I was there right now.  Can't wait to revisit this lovely city and spot again!", "publishedDate": "2018-08-19", "language": "en", "rating": 5}, {"id": 602392514, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d191047-r602392514-Port_Vell-Barcelona_Catalonia.html", "text": "As we reached the bottom end of Las Ramblas we carried on across the road to port area and then ventured across the boardwalk style bridge to the Port Vell Shopping and Dining area. With the usual array of shops you would find in any shopping mall and food outlets as well we ventured around the perimeter of the area and sat watching the boats in the harbour whilst enjoying an ice cream. Away from the main shopping element this is a nice relaxing place to rest a while.", "publishedDate": "2018-08-03", "language": "en", "rating": 4}, {"id": 602182966, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d191047-r602182966-Port_Vell-Barcelona_Catalonia.html", "text": "Port Vell is a waterfront harbor and part of the Port of Barcelona. Prior to the Olympics in 1992 this area was run down with vacant warehouses and factories, now it is visited by 16 million people each year and is a focal point of the city and a tourist attraction. We visited the Maremagnum, a mall with shops, cinema, bars and restaurants where we did some shopping and eating. The IMAX, Europe's largest aquarium is also at this port. It displays 8000 fish, 11 sharks contained in 22 basins filled with 1.5 million gallons of salt water. We walked the pedestrian walkway with a swing bridge that allows ships to enter and exit the harbor. The old Customs Building has beautiful architecture features. A pleasant afternoon taking in the area.", "publishedDate": "2018-08-02", "language": "en", "rating": 4}, {"id": 595978976, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d191047-r595978976-Port_Vell-Barcelona_Catalonia.html", "text": "I visited Port Vell on many occasions, day and night during my stay in Barcelona in August 2016. Always a buzz of activity. I dined at Montaditos at the end of the port in Maremagnum and thoroughly enjoyed my tapas dish overlooking the water and hive of activity. Strongly recommend Port Vell and this restaurant.", "publishedDate": "2018-07-13", "language": "en", "rating": 5}, {"id": 594944502, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d191047-r594944502-Port_Vell-Barcelona_Catalonia.html", "text": "Good way to see the harbour and beaches from the cable car ride, only around 8 minutes but the queue for the tickets and the elevator ride was around 45 minutes in the open, but they provided umbrellas and cooling mist fans to help to cool us down!", "publishedDate": "2018-07-10", "language": "en", "rating": 4}, {"id": 594247175, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d191047-r594247175-Port_Vell-Barcelona_Catalonia.html", "text": "Came here with my husband it was lovely just to sit there and enjoy the calmness of the boats beautiful views. ", "publishedDate": "2018-07-09", "language": "en", "rating": 5}, {"id": 594047772, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d191047-r594047772-Port_Vell-Barcelona_Catalonia.html", "text": "At the end of the Ramblas there is the port. It is beautifull. You walk over the bridge to the shopping mall, aquarium etc. Nice bars and restaurants. A must visit when you are in Barcelona.", "publishedDate": "2018-07-08", "language": "en", "rating": 4}, {"id": 589235710, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d191047-r589235710-Port_Vell-Barcelona_Catalonia.html", "text": "I accidentally booked a room in this hotel for the wrong year! I went to Barcelona last September 2017, and when I went to check in they told me I had booked it for September 2018! I live in the United States...I don't travel to Barcelona every year! I have paid $200 to them, and they will not let me change it to anther, later date when I will be going. I realize this was my mistake, and I accept responsibility for it. However, would it really hurt them to let me come at a later time...since I've already paid. Lesson learned don't pay upfront! Pay at checkout if possible!", "publishedDate": "2018-06-20", "language": "en", "rating": 1}, {"id": 588609468, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d191047-r588609468-Port_Vell-Barcelona_Catalonia.html", "text": "I enjoyed visiting Port Vell both day and night. Aways a buzz of activity with yachts entering the port to large numbers of visitors enjoying all that it has to offer. Port Bell is particularly beautiful at night, full of life, lights and talented entertainers. I sat at the very end of the port one night and watched in awe as an enormous cruise ship reversed into its dock, spectacular! ", "publishedDate": "2018-06-18", "language": "en", "rating": 5}, {"id": 584409912, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d191047-r584409912-Port_Vell-Barcelona_Catalonia.html", "text": "So many vendors selling cheap MESSI shirts, nike knock-offs and African knick-knacks...it's like La Rambla with a view. Has beautiful potential but is overrun by cheap trinkets.", "publishedDate": "2018-06-01", "language": "en", "rating": 4}, {"id": 584363662, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d191047-r584363662-Port_Vell-Barcelona_Catalonia.html", "text": "It is worth seeing but it is not what Barcelona is all about and you will find much more in the streets to the north rather than this area that is often frequented by tourists. Look elsewhere.", "publishedDate": "2018-06-01", "language": "en", "rating": 3}, {"id": 583770303, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d191047-r583770303-Port_Vell-Barcelona_Catalonia.html", "text": "This is another good example of urban renewal.  It was a run-down area of empty warehouses, railroad yards and factories but underwent modernisation and renewal prior to the 1992 Olympics. Its two major attractions are the Aquarium, the largest in Europe, and Maremàgnum , a large shopping mall. great views over the harbour and a place to see the many moored boats.", "publishedDate": "2018-05-29", "language": "en", "rating": 4}, {"id": 581462684, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d191047-r581462684-Port_Vell-Barcelona_Catalonia.html", "text": "This area is where in Barcelona  Africa meets China: dozens and dozens of Africans come here to sell illegal cheap copies made in China to  undiscerning tourists and pathetic people in general that do not care about quality, but rather about giving the impression that they can afford an expensive brand,  and feel no shame in wearing or carrying a fake. The aspect of the area, which could be lovely with its quiet open spaces and views, is transformed in a third world market  where passers by a crowded in a narrow line making the whole experience uncomfortable and unpleasant. Unfortunately these people have also invaded the beach ruining one of the best features of the city. Very sad and a good example of a badly managed city.", "publishedDate": "2018-05-20", "language": "en", "rating": 1}, {"id": 579402259, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d191047-r579402259-Port_Vell-Barcelona_Catalonia.html", "text": "It was pleasant strolling on the waterfront, along the docks, past the yachts in the evening. We also visited the  Maremagnum mall and Barceloneta Beach nearby ", "publishedDate": "2018-05-11", "language": "en", "rating": 4}, {"id": 570402903, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d191047-r570402903-Port_Vell-Barcelona_Catalonia.html", "text": "I spent a fantastic few hours here, just walking around and sitting and watching the boats. It was a welcome break from all of the walking I had done previously - it was a beautiful sunny day and very relaxing. There are plenty of restaurants and bars and you can relax on the beach. I had walked there from the Arc de Triompf but wasn't up to walking back to the Placa Cataluna  near where I was staying so I took a taxi back; it only cost around 7/8 Euro's.", "publishedDate": "2018-04-02", "language": "en", "rating": 5}, {"id": 569821541, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d191047-r569821541-Port_Vell-Barcelona_Catalonia.html", "text": "The Port Vell located by Barcelona beach and at the end of Las Ramblas is a great location to just wander and chill. It have a number of restaurants and shops to browse and some amazing yachts to check out as you walk along. The only down side is the street traders selling sports tops and tourist rubbish off the foot paths. \n\nYou will also find the Barcelona Cable Car at the end of the Port. This is good but honestly not worth the money and the long wait to buy a ticket and travel on it. ", "publishedDate": "2018-03-31", "language": "en", "rating": 4}, {"id": 568266422, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d191047-r568266422-Port_Vell-Barcelona_Catalonia.html", "text": "On our way back to the cruise ship MSC meraviglia we walked along. Beautiful on our sunny day in March...", "publishedDate": "2018-03-23", "language": "en", "rating": 4}, {"id": 567371240, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d191047-r567371240-Port_Vell-Barcelona_Catalonia.html", "text": "This area of Barcelona is relaxing, it's about enjoying your surroundings, taking time to smell the roses (or the sea air), enjoy the view, eat, drink, shop.   \n\nWith the Rambla del Mar area (see pics) with shopping centre, ferries to other countries, a bridge that lights up and the famous floating sculptures on the old buoys, along with lovely views of the W Hotel that looks like a sailboat on the sea.\n\nThe Passeig de Colom area included takes in the Smiling Shrimp and Cara de Barcelona sculptures, weekend bubble man entertaining kids, historical buildings, private yachts owned by millionaires and music festivals (see pics).\n\nThe waterfront has lots of watercraft on show, the old Roman Museum of Catalonia area with its beautiful arches and lots of market shopping with an entire section of people selling fakes - handbags to clothes to shoes - remember to bargain thoroughly for a good price!", "publishedDate": "2018-03-18", "language": "en", "rating": 5}, {"id": 564946954, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d191047-r564946954-Port_Vell-Barcelona_Catalonia.html", "text": "After hours of walking around Barcelona, we got to Port Vell. Soo different to the rest of the city we had travelled around, it's so peaceful and quiet, we sat and just watched for an hour or so. We always like to visit docks and ports and Port Vell didn't disappoint.", "publishedDate": "2018-03-06", "language": "en", "rating": 4}, {"id": 561851963, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d191047-r561851963-Port_Vell-Barcelona_Catalonia.html", "text": "We decided to take a rest during the countless hours & many miles you end up walking without realising & found this to be nice & relaxing whilst watching the birds fly by", "publishedDate": "2018-02-20", "language": "en", "rating": 4}, {"id": 560355594, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d191047-r560355594-Port_Vell-Barcelona_Catalonia.html", "text": "Nice port with some fancy yachts. I walked through here on Sunday afternoon. Nice chill out area to sit down and watch people get by or just stopped for drink near by.", "publishedDate": "2018-02-13", "language": "en", "rating": 4}, {"id": 559559626, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d191047-r559559626-Port_Vell-Barcelona_Catalonia.html", "text": "Port Vell , is just a walkaway distance from the end of the Monument Colom , The sun Set view at this place is really amazing and to admire the seagulls flying around. With Beautiful walkways and relaxing grass turf the Port Vell is definitely a must hit place to relax at the evening hours and to spend the day after visiting touristic places in Barcelona, i spent 3 hrs strolling around Port Vell seeing the Yachts ad the luxury cruises anchored around in very close proximity . The views are simply amazing , you can see street performers,and walkers , people jogging , bicycling around.. Best place to capture fantastic photographs... loved this place. ", "publishedDate": "2018-02-10", "language": "en", "rating": 4}, {"id": 559525205, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d191047-r559525205-Port_Vell-Barcelona_Catalonia.html", "text": "Walking through the rambla you will find  this port with all the super yachts  and very big shopping center.  A Nice area to have good drinks and food", "publishedDate": "2018-02-09", "language": "en", "rating": 5}, {"id": 558886249, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d191047-r558886249-Port_Vell-Barcelona_Catalonia.html", "text": "It’s a nice port but not very special, but it’s lovely to walk next to the boat! There wasn’t a lot of people when we were there. ", "publishedDate": "2018-02-06", "language": "en", "rating": 3}, {"id": 553907059, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d191047-r553907059-Port_Vell-Barcelona_Catalonia.html", "text": "We chose this stop-off on our Bus Turistic hop-on hop-off circuit, for lunch and a mosey around. After a pleasant lunch at Tapa Tapa (separate review) my wife opted to explore the shops in this location whilst I sauntered across the pedestrian walkway on the harbour end of Las Ramblas and read in the sun on one of the numerous available benches overlooking the harbour.\nDefinitely worth a visit.", "publishedDate": "2018-01-15", "language": "en", "rating": 4}, {"id": 553228962, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d191047-r553228962-Port_Vell-Barcelona_Catalonia.html", "text": "I have been to Barcelona 5 times before this trip so feel I have comfortably visited the main attractions within the centre. \n\nFor this trip it was my family’s first holiday abroad so wanted it to be special, We stayed in port vell off the beaten track for me a first staying in a quieter area. It was fantastic, we were 10 minutes from the beach, near to the zoo and walking distance to the aquarium. The beach was very clean and the people around the area were very welcoming when we visited restaurants, etc. It felt like a beach holiday rather than a city break. ", "publishedDate": "2018-01-11", "language": "en", "rating": 4}, {"id": 551706399, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d191047-r551706399-Port_Vell-Barcelona_Catalonia.html", "text": "It's a nice walk along here and it manages to maintain some original architecture which is really nice. A part of it is a bit like a modern shopping centre, but I guess that services some people", "publishedDate": "2018-01-05", "language": "en", "rating": 4}, {"id": 550881267, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d191047-r550881267-Port_Vell-Barcelona_Catalonia.html", "text": "Port Vell is a waterfront harbor for yachts built for the 1992 Barcelona Olympics. A pedestrian walkway, Rambla de Mar, connects La Rambla to Port Vell. \n\nThere is a lot to do: Maremagnum mall (shops, bars and restaurants), IMAX Port Vell cinema with seven-story high screen and Europe's largest aquarium.", "publishedDate": "2018-01-02", "language": "en", "rating": 5}, {"id": 549971835, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d191047-r549971835-Port_Vell-Barcelona_Catalonia.html", "text": "A continuation of La Ramblas, well worth the time to cross the street near the Colombus statue and check out this area,  Cross the bridge and get to a nice modern shopping center with three floors,  lots of restaurants.  The whole area was reworked/remodeled a few years ago (Maybe for the Olympics?) It is nice and worthy to see.", "publishedDate": "2017-12-29", "language": "en", "rating": 4}, {"id": 549671805, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d191047-r549671805-Port_Vell-Barcelona_Catalonia.html", "text": "Walked down La Rambla towards Columbus Monument brought us to Port Vell. Nice place for a stroll, or rest at the benches and watch the cable cars  and yachts. ", "publishedDate": "2017-12-28", "language": "en", "rating": 4}, {"id": 548480733, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d191047-r548480733-Port_Vell-Barcelona_Catalonia.html", "text": "Port Vell is where you can see the famous Christopher Columbus Column. You can carefully walk out to the column but becareful of fast drivers!", "publishedDate": "2017-12-21", "language": "en", "rating": 4}, {"id": 548342042, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d191047-r548342042-Port_Vell-Barcelona_Catalonia.html", "text": "Most of this area is fenced off completely for the privacy of the owners of the super yachts. Better to spend some time a bit more to the south in the marina of the port of Barcelona.", "publishedDate": "2017-12-21", "language": "en", "rating": 4}, {"id": 547532505, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d191047-r547532505-Port_Vell-Barcelona_Catalonia.html", "text": "We walked down the boardwalk from The Columbus statue to get to the HOHO green line bus. Two really quirky pieces of art.", "publishedDate": "2017-12-16", "language": "en", "rating": 3}, {"id": 546747793, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d191047-r546747793-Port_Vell-Barcelona_Catalonia.html", "text": "Beautiful sunny day at the Port . There is also a  shopping center there and restaurants or you can just take a seat on one of the benches and watch the and  pretty boats", "publishedDate": "2017-12-11", "language": "en", "rating": 4}, {"id": 543115511, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d191047-r543115511-Port_Vell-Barcelona_Catalonia.html", "text": "If you want to take a day of this should be included in your Barcelona Tour, along with Barcelonetta beach. We have seen Port cell from the port and also from Montijuc.", "publishedDate": "2017-11-25", "language": "en", "rating": 5}, {"id": 542537228, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d191047-r542537228-Port_Vell-Barcelona_Catalonia.html", "text": "We strolled down Las Ramblas until we hit the port. Beautiful walk on a beautiful day! The port is lively and colorful, filled with restaurants, bars and great photo ops! Walking over the beautifully constructed bridge you see the restaurants and bars ahead, the gondola overhead, the cruise ships in the distance and small, tourist boats. The yachts and sailboats in the port are magnificent - we can all dream, right?! Wonderful way to spend a sunny afternoon in October! Plenty of restaurant decks to sit with a glass of wine and people watch! Totally loved it - we stayed until sunset!", "publishedDate": "2017-11-21", "language": "en", "rating": 5}]}}]