[{"locationId": 13003921, "name": "Parroquia de Sant Miquel del Port", "placeType": "ATTRACTION", "reviewListPage": {"reviews": [{"id": 712741153, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d13003921-r712741153-Parroquia_de_Sant_Miquel_del_Port-Barcelona_Catalonia.html", "text": "We came across Parroquia de Sant Miquel del Port while walking around the streets of Barceloneta. More often than not, the best way to see a city is by just wandering around and \"getting lost\" in the streets. We like to do this a lot while travelling. This lovely, 18th century church just appeared in front of us, so to speak. We did not go inside but stood outside and admired for some time. It is not a huge building but it is big enough. Worth a stop, if you happen to be in the vicinity.", "publishedDate": "2019-09-24", "language": "en", "rating": 4}, {"id": 690707544, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d13003921-r690707544-Parroquia_de_Sant_Miquel_del_Port-Barcelona_Catalonia.html", "text": "A cute little church in the La Barcelonata district of east Barcelona. The church is dedicated to St. Michael and an image of him features on the facade of the church. The church is an nice example of classical Baroque architecture, \n\nThe church is nice enough, but certainly not enough to make a detour unless you have lots of time on your hands.", "publishedDate": "2019-07-18", "language": "en", "rating": 3}, {"id": 681980600, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d13003921-r681980600-Parroquia_de_Sant_Miquel_del_Port-Barcelona_Catalonia.html", "text": "We happened to be in Barcelona on Pentecoste weekend which is 50 days after Easter and read that Barceloneta neighborhood celebrates heavily this weekend through the The Cors Muts (Silent Choirs) festival which is essentially is made up of several dancing parade groups celebrating around the neighborhood on Saturday morning before returning back on Monday afternoon.\n\nIndeed it was an unforgettable experience culturally, enjoying the parades and festivities whilst walking through this charming neighborhood including the nice church of Sant Miquel del Port! The small piazza in front of this church has a relaxed atmosphere hosting a small number of restaurants. Highly recomended to visit regardless of this festival however if you happen to be around in Pentecoste, make sure you stop by!!!", "publishedDate": "2019-06-16", "language": "en", "rating": 5}, {"id": 649153300, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d13003921-r649153300-Parroquia_de_Sant_Miquel_del_Port-Barcelona_Catalonia.html", "text": "This is a very attractive little church so close to the market that it is worth a quick stop that is not a challenge to find in a very large city.  It is not a world class site, but it is very attractive.  The exterior is very engaging and makes you stop to look at it.  The interior is attractive.\n\nGranted, the market is exciting and wonderful--one of the best we have ever seen/experienced.  We try to go there anytime we are in the city; however, take time to see this church.", "publishedDate": "2019-01-30", "language": "en", "rating": 3}, {"id": 631869844, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d13003921-r631869844-Parroquia_de_Sant_Miquel_del_Port-Barcelona_Catalonia.html", "text": "While wandering around the wonderful Barceloneta neighbourhood and in particular around the port and harbour area we chanced upon Parroquia De Sant Miguel Del Port and what a lovely looking little church this is.\nThe design of architect Pedro Martin Cermeno and constructed between 1753 -- 1755 ,the wonderful and evocative Baroque architecture is very pleasing on the eye and although damaged during the Spanish Civil War the church exterior still retains a faded elegance. \nWe never had time to check out the interior but we enjoyed the views afforded from a cafe in the beautiful plaza were Parroquia De Sant Miguel Del Port is located .\nEasy to locate on Carrer De Sant Miguel and most definitely well worth checking out if your in the area. \n", "publishedDate": "2018-11-08", "language": "en", "rating": 5}, {"id": 563178254, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d13003921-r563178254-Parroquia_de_Sant_Miquel_del_Port-Barcelona_Catalonia.html", "text": "The fantastic Metropolis, Barcelona, has many beautiful old buildings.\nParroquia de Sant Miquel del Port is one of them.\nIt is a church, situated on Placa de la Barceloneta.\nYou can take a rest on the cosy square at the bars/restaurants Can Ganassa and L'Ostia.", "publishedDate": "2018-02-27", "language": "en", "rating": 3}]}}]