[{"locationId": 17639374, "name": "Montjuïc Funicular", "placeType": "ATTRACTION", "reviewListPage": {"reviews": [{"id": 730919989, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d17639374-r730919989-Montjuic_Funicular-Barcelona_Catalonia.html", "text": "The funicular joins to the gondola ride all the way to the top of Montjuic. Views are sensational as you can see all of Barcelona and out to sea.", "publishedDate": "2019-12-05", "language": "en", "rating": 5}, {"id": 722465719, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d17639374-r722465719-Montjuic_Funicular-Barcelona_Catalonia.html", "text": "A bit short for the price but excellent views and a great shortcut to see the castel on a sunny day. I found the staff pleasant. It’s very accessible and parking was fair ", "publishedDate": "2019-10-29", "language": "en", "rating": 4}, {"id": 722348581, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d17639374-r722348581-Montjuic_Funicular-Barcelona_Catalonia.html", "text": "You get great views of the city from this well worth a visit and the hop on bus stops there so easy to get to you see nearly all of Barcelona from here", "publishedDate": "2019-10-29", "language": "en", "rating": 5}, {"id": 717972900, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d17639374-r717972900-Montjuic_Funicular-Barcelona_Catalonia.html", "text": "Great way to get to the top of montjuic. Connected to the metro system, it will save you more than an ounce of sweat if you're travelling in the summer. This area has a lot at the top to see thats a little off the beaten path. If you're a sports junkie, great way to see the Olympic stadium.", "publishedDate": "2019-10-13", "language": "en", "rating": 4}, {"id": 717085124, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d17639374-r717085124-Montjuic_Funicular-Barcelona_Catalonia.html", "text": "We got off the hop on hop off and spontaneously bout a ticket the the top. Round trip worked great for us and we thoroughly enjoyed the castle at the top. An added unplanned adventure that was worth it. ", "publishedDate": "2019-10-10", "language": "en", "rating": 5}, {"id": 715067462, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d17639374-r715067462-Montjuic_Funicular-Barcelona_Catalonia.html", "text": "This is not like other funiculars that transport you up a hill or mountainside with great views. It's basically just a short underground metro that goes a little steeper. However it is very useful for getting you halfway up Montjuic hill right outside the cable car station. You can use your metro T10 pass to go on it, however we did have to queue and then wait 10 mins for it to set off", "publishedDate": "2019-10-03", "language": "en", "rating": 3}, {"id": 715008057, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d17639374-r715008057-Montjuic_Funicular-Barcelona_Catalonia.html", "text": "A nice funicular if you like this sort of thing and I do. part of the Barcelona transport ticket and runs very frequently. A good view of course from the top however it doesnt go to the top!! Good fun", "publishedDate": "2019-10-03", "language": "en", "rating": 4}, {"id": 714541306, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d17639374-r714541306-Montjuic_Funicular-Barcelona_Catalonia.html", "text": "Our son LOVES everything train, so of course we had to get the funicular. It is a short ride and connects the metro line up to the cable car system. Nothing to go out of your way for, but if you are trying to get up to the castle, etc...this is included in your metro ticket price. Enjoy!", "publishedDate": "2019-10-01", "language": "en", "rating": 4}, {"id": 701461437, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d17639374-r701461437-Montjuic_Funicular-Barcelona_Catalonia.html", "text": "Free with your travel card so why not, funny little short train ride linking up the tube and Teleferic to the top of Montjuïc. Very short but sweet.", "publishedDate": "2019-08-21", "language": "en", "rating": 5}, {"id": 685838542, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d17639374-r685838542-Montjuic_Funicular-Barcelona_Catalonia.html", "text": "We thought this would be a little better than it was.  We decided that to access the Montjuic area we would take the Metro to the funicular and then walk from there.  The funicular leaves every 10 minutes, so we waited for it to come and then the ride was super short.  When we got off, we had quite a walk to get to Plaza Espana.  I can see how it was exciting when it was new for the world fair, but I would skip this attraction and ride the metro to Plaza Espana.  If you really want to ride the funicular, maybe ride it and then ride back to the metro.", "publishedDate": "2019-07-01", "language": "en", "rating": 3}, {"id": 685239784, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d17639374-r685239784-Montjuic_Funicular-Barcelona_Catalonia.html", "text": "This is a train that goes up an incline. It is pulled by cables and it is a very interesting experience. If you are going to take the cable cars to the top of Montjuic and you want to use public transport this is the train you will need to take.", "publishedDate": "2019-06-29", "language": "en", "rating": 4}, {"id": 683307961, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d17639374-r683307961-Montjuic_Funicular-Barcelona_Catalonia.html", "text": "My wife and I recently visited Barcelona for the first time and spent four full days touring as much of this beautiful city as we could. On one of the days we wound up on top of the hilltop overlooking the city and harbor.\n\nWe thought the entrance for the Teleferico del Puerto was here but the taxi driver let us off in the wrong spot. So we decided to take the Funicular down to the Metro to head over to take in more sights. The Montjuic Funicular was a short ride and mostly in a tunnel. But when you get on the tram is in a open air trench and you do get a couple of quick views....\n\nBeing a \"railfan\" I enjoyed this unique tram ride going vertically down the hillside. If you are in the area of the Montjuic Funicular, give it a ride...You will probably enjoy it too.", "publishedDate": "2019-06-21", "language": "en", "rating": 4}, {"id": 682786252, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d17639374-r682786252-Montjuic_Funicular-Barcelona_Catalonia.html", "text": "We decided to do as much sightseeing as we could the first five days we were in Barcelona and tried to take in as much as we could.....\n\nWe just happened up the Funicular de Montjuic by accident and since I am a \"railfan\" we just had to ride it. We were at the top station and took the short ride down the hillside to the Metro station at the bottom where we took a subway to get back to our hotel.\n\nWhile this may not be a major attraction, we both enjoyed the ride and it is really a ride that you do not see that often...So give the Funicular de Montjuic a try.....", "publishedDate": "2019-06-19", "language": "en", "rating": 4}]}}]