[{"locationId": 3367732, "name": "Piscines Bernat Picornell", "placeType": "ATTRACTION", "reviewListPage": {"reviews": [{"id": 700280860, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d3367732-r700280860-Piscines_Bernat_Picornell-Barcelona_Catalonia.html", "text": "Huge pools indoor and outdoor, nice place to spend a day. Very deep fresh clean water. The showers not so nice though, they are are screaming for renovations but you have everything you need including saunas and a jacuzzi", "publishedDate": "2019-08-18", "language": "en", "rating": 5}, {"id": 621434633, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d3367732-r621434633-Piscines_Bernat_Picornell-Barcelona_Catalonia.html", "text": "A rare treat to be able to swim in a 50 metre pool, let alone an Olympic venue! Sparklingly clean water in the outdoor pool was a comfortable temperature, and the locals clearly take a pride in their facility. It is possible to access the gallery through the café and enjoy the view across the city - remember the 1992 TV pictures? The admission fee includes the use of the gym, saunas and jacuzzi, so although it seems expensive, if you plan to stay a while, it is good value.\nEnjoy", "publishedDate": "2018-10-02", "language": "en", "rating": 5}, {"id": 612469325, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d3367732-r612469325-Piscines_Bernat_Picornell-Barcelona_Catalonia.html", "text": "Spent several relaxing hours swimming and sunbathing at this fantastic pool. My daughters age 15 and 20 had a great time especially the eldest as she is super critical of pools as she is an ex competitive club swimmer and currently teaches and coaches swimming and rated this pool very highly. She said the water was fantastic .\nThe cafe was good and they allow you up from the pool as long as u are covered up etc. \nThe admission also included use of jacuzzi steam room and gym so good value.\nVery relaxed atmosphere with super vigilant lifeguards.\nJust wish we had more time on our holiday for a second visit !", "publishedDate": "2018-08-30", "language": "en", "rating": 5}, {"id": 607274245, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d3367732-r607274245-Piscines_Bernat_Picornell-Barcelona_Catalonia.html", "text": "After having visited many amazing outdoor pools in Iceland I came there with certain prospects and this place didn't disappoint me at all. It has everything what's needed for cultivating physical culture. The atmosphere is very positive and people are friendly. I love the architecture of the sport facility, its surrounding is truly beautiful. it's convenient to go there after/before visiting Joan Miro Foundation, both places I'd highly recommend to everyone.", "publishedDate": "2018-08-17", "language": "en", "rating": 5}, {"id": 604964997, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d3367732-r604964997-Piscines_Bernat_Picornell-Barcelona_Catalonia.html", "text": "We visited here after first going to the Olympic diving pools because the views there are amazing but there was no shade in the searing heat so we came here instead.   It costs 10 euros ish to get in and there is an indoor pool (swimming cap needed) outdoor pool and gym.  There are also jacuzzis in the changing rooms.  There is a cafe and spectator areas if you don’t want to take a dip.  The outside pool and changing areas do have some nudity but it’s not at all off putting.  The indoor pool is lanes only but the outdoor pool has a section for playing and lanes.  It was a lovely relief to get in the pool away from the August heat and if you don’t have a pool at your hotel then this is worth the trip.  Right next door is the Olympic stadium which is free to get in, in fact the whole Montjuic Olympic area is well worth the visit to get away from the hustle and bustle of central Barcelona.  Get here via the number 150 bus from Plaça Espanya or the funicular from Parralel metro station.", "publishedDate": "2018-08-10", "language": "en", "rating": 5}, {"id": 601569794, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d3367732-r601569794-Piscines_Bernat_Picornell-Barcelona_Catalonia.html", "text": "The pool was easier to get to than I had imagined. Quick bus and short walk or one-stop funicular. No bother. I found staff amazingly friendly and helpful when I temporarily lost my independent-minded son (9). I was told no child escapes! So, safeguarding, big yes. Plus the guards who look casual as they wander around are actually being super vigilant. \nYou’ll need a padlock if you want to lock up your stuff but most people take their things up to the pool and make a pile near their towels / beds. Hiring a bed is easy (£1) but later in the day requires patience. If you tell them you want a bed/s, you’ll get them. \nBring food and water. Goggles advisable. Water is fabulous but my son, staying in for hours, ended up with very slightly sore eyes. He was fine. We’ll bring goggles next time, because there will be a next time. \nAtmosphere is excellent. More of it needed at home (England). Diving, bombing, all good. People are  respectful and kids have tons of fun. \nSomeone put music on and it was nice. Not too loud. I like loud, but there was a respectful volume maintained. \nYou could be here all day.", "publishedDate": "2018-07-31", "language": "en", "rating": 4}, {"id": 559953528, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d3367732-r559953528-Piscines_Bernat_Picornell-Barcelona_Catalonia.html", "text": "I had a real great swimming experience at Bernat Picornell. Clean pool, spacious lanes and all equipment available to be used. I will definitely be back to train!\nThe only downside: pool entry is quite expensive for non-members (12,15 EUR).", "publishedDate": "2018-02-12", "language": "en", "rating": 5}, {"id": 509006765, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d3367732-r509006765-Piscines_Bernat_Picornell-Barcelona_Catalonia.html", "text": "It's the old Olympic outdoor pool. Fab.  Lunch in restaurant, 3 course, glass of beer and a coffee €9.  Wonderful experience and not a Brit in sight xx", "publishedDate": "2017-08-05", "language": "en", "rating": 5}, {"id": 494945750, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d3367732-r494945750-Piscines_Bernat_Picornell-Barcelona_Catalonia.html", "text": "An easy 12 minute walk from the top of the funicular (catch it inside Paral-Lel subway station).  There was a sports meet in the outside pool, so I could only swim in the indoor pool.  The ticket attendant was not friendly; entry costs about 12€; you must wear a swim cap in the pool and you need your own lock for the lockers (you can buy a lock for 12€ in the little shop by the ticket seller).   There are two men's locker rooms - one near the pool, and another one downstairs closer to the gym.  Curiously, there are very few bathrooms; none in the pool locker room, but a single men's stall (plus a women's and a handicapped) adjacent to the pool deck.  The indoor pool was divided into 20 (or more) 25 metre lanes which two people shared- mostly side-by-side swimming, not circles.  There are two sweep-second (analog) swim pace clocks - one at each end of the pool (near the big windows, so if you are anywhere near the middle the clocks are distant and hard to read).  There are no digital timers. Some lanes are reserved for seniors.  If you do backstroke, there are no flags - however, the ceiling design changes at the pool edge, so it's not a problem.  Borrow various pull-buoys, kick boards, flotation tubes, etc. on deck.  I could see only a single (friendly) lifeguard watching over the entire enormous space.  The tiny pool-deck jacuzzi fits about four people, and the water is not hot.  Many people left towels and bags hanging on hooks on the side of the pool; most left flip-flops at the end of their lane.  I saw no signage in English, but some people did understand it.", "publishedDate": "2017-06-21", "language": "en", "rating": 3}, {"id": 471941848, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d3367732-r471941848-Piscines_Bernat_Picornell-Barcelona_Catalonia.html", "text": "The folk here are reet fancy but the gym is very good. It's hard in Spain to find a one off gym visit for the travelling gym guy who doesn't want a membership. At €11 its pricy if u just wanna lift. Pros -and cons include \n+large gym space for weights and cardio\n- no squat rack at all \n+changing rooms toilets lockers and gym all nearby and isn't too busy \n- no space and only one bar for deadlifts \n+great big windows nice clean area to workout not an underground dungeon thing \n- doesn't use Olympic bars dispute being a host of an olympics \n+ not full of meat heads nice normalish  people ", "publishedDate": "2017-04-01", "language": "en", "rating": 4}, {"id": 450440996, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d3367732-r450440996-Piscines_Bernat_Picornell-Barcelona_Catalonia.html", "text": "A friend suggested we visit as we wanted a swim on tour & to soak up Olympic ambiance! $75 Aussie dollars to enter for 2 adults & 2 kids - better be good!\nSwim hats, Goggles, locker key all required.\nStaff rude.\nFind another pool I say!", "publishedDate": "2017-01-08", "language": "en", "rating": 2}, {"id": 399835525, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d3367732-r399835525-Piscines_Bernat_Picornell-Barcelona_Catalonia.html", "text": "Visited this as part of a walk around the Olympic park and the magic fountain. It's quite a walk from the tube stop (espanya), but I think you could the funicular up the other way. Great Olympic pool, with sun loungers available. costs around 11€, and you can bring your own padlock for a locker. Deep pool and good fun, serrated for lane serious swimmers and  fun areas alike. There is a cafe on site, but we didn't use it.", "publishedDate": "2016-08-01", "language": "en", "rating": 4}, {"id": 396316894, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d3367732-r396316894-Piscines_Bernat_Picornell-Barcelona_Catalonia.html", "text": "I went to swim here at the end of a very hot day and enjoyed the experience very much.  I swim regularly and significantly as a matter of course, so my expectations were more than just a 'splash around'.  Perhaps unsurprisingly, the two fifty metre pools more than fulfilled this expectation.  As it happened, I only used the outdoor pool, simply because the chance to swim outdoors living in the United Kingdom is such a rarity.  This pool was mostly set-up for lane swimming, although had some well-bounded areas for informal swimming.  Everyone kept to the appropriate areas, meaning that productive swimming was certainly possible.\n\nSwimming in such an important pool historically in inherently a pleasure, but doubly so when the weather is warm, the sun is shining and the sky is blue.\n\nThe entrance price is not super-cheap, being a little over €11, but this seemed to be for a day ticket.  Changing and other facilities were orderly, clean and in good repair.  Pleasantly they seemed largely the original style as when the facility was refurbished and expanded for the 1992 Olympics, so this have some added interest to the venue.  The indoor pool also seemed good, while beside the outdoor pool was a square pool which was quite deep, which is likely for water polo.\n\nA padlock is required for the lockers which users must bring themselves.  However, it is possible to leave non-valuables out, such as towels, clothes and shoes beside the pool.  I visited at 18:30 on a Saturday and there was significant available space, but it was likely busier at an earlier time in the day.", "publishedDate": "2016-07-24", "language": "en", "rating": 5}, {"id": 391425003, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d3367732-r391425003-Piscines_Bernat_Picornell-Barcelona_Catalonia.html", "text": "This is a wonderful lap pool and play pool. It seems more like a fitness center (hot tub, sauna), but the outdoor pool is wonderful on a hot day of sight seeing. Remember to bring your towel with you when you head out to sightsee and stop in here for a relaxing afternoon by the pool. Great for kids, but deep everywhere, so keep your eye on them.", "publishedDate": "2016-07-11", "language": "en", "rating": 5}, {"id": 387116465, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d3367732-r387116465-Piscines_Bernat_Picornell-Barcelona_Catalonia.html", "text": "Great spacious pool, quite clean. Perfect for a nice swim or even to enjoy the sun and swim at the same time! Perfect for all swimming fanatics, or even if you just want to have a casual dip to cool off! ", "publishedDate": "2016-06-28", "language": "en", "rating": 5}, {"id": 341971385, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d3367732-r341971385-Piscines_Bernat_Picornell-Barcelona_Catalonia.html", "text": "Venue for the 1992 summer Olympics. Great pool. Bring flip flops, swimming cap and padlock for lockers. Men's changing room also has jacuzzi, sauna and steam room. ", "publishedDate": "2016-01-22", "language": "en", "rating": 4}, {"id": 323614027, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d3367732-r323614027-Piscines_Bernat_Picornell-Barcelona_Catalonia.html", "text": "Even if you a not a member if you like working out - once you made the long way from the city center - is an ideal spot to spend a couple of ours: huge gymnasium (compared to the crowed downtown studios), sauna, jacuzzi, indoor and outdoor swimming pool (the latter is note heated!), a bar with a terrace where you can have a sandwich and a cup of coffee enjoying the views.", "publishedDate": "2015-11-01", "language": "en", "rating": 5}, {"id": 316582635, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d3367732-r316582635-Piscines_Bernat_Picornell-Barcelona_Catalonia.html", "text": "I'm reviewing the outdoor pool which I've visited several times. The indoor pool looked clean and well looked after and was busy whenever I went. The outdoor pool has fewer users, especially outside July and August. But it is a lovely swimming pool, open all year round, well maintained and with friendly lifeguards. It's great to swim in an actual Olympic pool, especially when it's outside in the Mediterranean sunshine. The changing facilities are excellent and include a jacuzzi. I dropped a star for two reasons: firstly I wish it opened a bit earlier - I like to swim before breakfast but you can't get in before 9.30 (even later on Sundays and in the winter). The only real criticism I have is that it's bizarrely difficult to get to the café from the pool. It is a nice café with a balcony over the pool and a good selection of refreshments.It's open to the public and is easy to get to from the outside, but has no direct access to the pools or gym. We managed to get there only by going through a barrier which we probably weren't meant to be able to pass - it was a quiet day and few staff were around! Surely the management could come up with a way for paying customers to use the café too without having to get dressed and go out through the turnstyle first?  ", "publishedDate": "2015-10-06", "language": "en", "rating": 4}, {"id": 313056893, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d3367732-r313056893-Piscines_Bernat_Picornell-Barcelona_Catalonia.html", "text": "Bring your kit for a full day of swimming and sunbathing and even a Jacuzzi in the changing rooms if you like! Its an iconic place if you like swimming you'll love this place!", "publishedDate": "2015-09-23", "language": "en", "rating": 5}, {"id": 303996978, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d3367732-r303996978-Piscines_Bernat_Picornell-Barcelona_Catalonia.html", "text": "The pool has a great temperature and is utterly refreshing. On a hot day like today was it was absolutely perfect. The water is beautifully clear and was great fun to slash about in.\n\nFYI bring a small padlock if you want to lock your stuff up or just bring it down to the side of the pool", "publishedDate": "2015-08-27", "language": "en", "rating": 5}, {"id": 287701147, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d3367732-r287701147-Piscines_Bernat_Picornell-Barcelona_Catalonia.html", "text": "Great place to relax and get away from all the \"stress\". We really enjoyed the swimmingpool (no need for more) and the impressive view in the background. Got the impression that we were there with the locals! If anything, you could critise them for not making it more commercial, but that would kill the great relaxing feeling... Enjoy!", "publishedDate": "2015-07-10", "language": "en", "rating": 5}, {"id": 284032193, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d3367732-r284032193-Piscines_Bernat_Picornell-Barcelona_Catalonia.html", "text": "Travelled to Barcelona with my son who swims in College, and he needed to train so we went there.  Good indoor 25 meter and 50 meter outdoor pool.  Cost about 5 euros to get in and swim.  also has people sunbathing need to pool, which is a little odd.  Especially the topless ones.  ", "publishedDate": "2015-06-29", "language": "en", "rating": 4}, {"id": 271160559, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d3367732-r271160559-Piscines_Bernat_Picornell-Barcelona_Catalonia.html", "text": "As a travelling swimmer, it is not always convenient to swim  at hotel pools.  Usually they are too short and crowded for laps.  I've found that access to local pools is a better option for working out as a traveler.  Being from the northeastern US, year round pools are all  indoors and usually not more than 25 yards or meters long; so outdoor pools and long distances are a big draw for me.\n\nHaving executed the 'swim at public pool' philosophy in Kona, Kihei, Palm Desert, and Munich, I had to experience the Piscines Bernat Picornell while in Barcelona.  \n\nWe went on a Thursday afternoon, paid around eight euros for access to the facilities.  The W's locker room entrance is on a higher level than the Olympic pool, and at about the same level as an indoor pool.  Signage is all in Spanish or Catalan, so its a guessing game to figure out what is behind the many locker room doors once you've stowed your stuff.  None that I tried led to toilets, however, which was weird.  \n\nThe locker room is pretty wide open, Euro style, as are the showers, so if you expect privacy, you should adjust expectations.  Showers operate with a push on the knob and run for a few minutes before shutting off...\n\nI chose the Olympic pool, since it was a beautiful sunny day and an opportunity to swim 50m laps outdoors should not be passed on, imo.  The water was colder than I expected, extremely clear, and eventually pretty comfortable, once I had finished a couple of  laps. The pool is deep everywhere (per Olympic standard), with a ledge on the ends for standing between laps.  I didn't see anyone using the diving well, but it appeared to be open, as it wasn't roped off. \n\nOn this Thursday afternoon, there were always a few open lanes, with one side set  up as a wide (3 widths) lane.  The indoor pool, visible from an upstairs concession, looked about 50m long, but was set up for short course, with maybe 15 lanes available.\n\nBack at the Olympic pool, chaise lounges were lined up on the sunny side, not all occupied.  Some women were sunbathing topless, but I didn't see anyone nude or swimming without a suit.\n\nOverall, I loved it, and I thought it was as good as any other city's facilities I've tried.  Recommended for swimming enthusiasts.", "publishedDate": "2015-05-10", "language": "en", "rating": 4}, {"id": 226448676, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d3367732-r226448676-Piscines_Bernat_Picornell-Barcelona_Catalonia.html", "text": "We went 3 times , for a family of 4 just under 40 euros..expensive compared to pools in the UK. The days we went 2x August and 1x September always around 10:00..the pool was not used much..the pool is divided into 4x 50m lanes and 4 lanes broken upto play areas or short swims...It is an Olympic pool so no shallow end..We did lots of lengths and some play.. Free sun chairs and if you want free use of sauna, steam rooms and a jacuzzi..yes it is dated and could do with a face lift but the main outside pool is a great swim in the sun..no lockers unless,you bring your own padlock..everyone seemed friendly...close to the magic fountain about a 15 minute walk..", "publishedDate": "2014-09-02", "language": "en", "rating": 4}, {"id": 143885287, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d3367732-r143885287-Piscines_Bernat_Picornell-Barcelona_Catalonia.html", "text": "Since we went swimming in the outdoor pool, we've seen the previous reviewer's comments (who must have visited a couple of days before us), which are all absolutely spot on, so won't repeat them all here (NB it was about 12 Euros for a adult, 7 Euros for kids under 14).  It's just surprising that more tourists don't come to use the pool for an Olympic experience, given that there's a steady stream of Olympic tourists a couple of hundred yards away looking at the stadium.\n\nSo folk are aware, the pool is cold and slightly salty, but it is very quiet.  The price is a bit of a deterrent, but payment gives access to all facilities including the lovely (and busier) large indoor heated pool and gymn facilities.\n\nThe cafe is excellent value-for-money and the the staff were vey helpful and patient considering that it's principally a local's facility rather than a tourist one.  They also have a shop selling towels, hats, goggles, etc - so no excuse for avoiding a spontaneous swim!", "publishedDate": "2012-10-27", "language": "en", "rating": 4}, {"id": 143552773, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d3367732-r143552773-Piscines_Bernat_Picornell-Barcelona_Catalonia.html", "text": "We are riding the wave (more floating the ripple) of outdoor swimming and while we were in Barcelona we wanted to swim in the sea at Barceloneta, which was fine, and then swim in an outdoor pool on Montjuic.  The muncipal infinity pool of Kylie video fame is only open during July and August so we went to this 50m Olympic pool next to the stadium.  It is expensive (12 Euros plus 4 Euros for a locker - though you can take your bags to the outside pool) but very atmospheric amongst the empty stands with the Torre Calatrava tower looming above.  On an October midweek it was quiet, cool and lovely.  You can also relax in the jacuzzi or sauna afterwards and the restaurant looked good.", "publishedDate": "2012-10-23", "language": "en", "rating": 4}]}}]