[{"locationId": 2623636, "name": "Mercat de la Concepcio Barcelona", "placeType": "ATTRACTION", "reviewListPage": {"reviews": [{"id": 748047569, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d2623636-r748047569-Mercat_de_la_Concepcio_Barcelona-Barcelona_Catalonia.html", "text": "Just a real market in the city. If you're staying close by, go, now. Plenty of vegetable, fish, meat, deli stalls. Great place to buy anything you need, a couple of small bars with coffee, fresh beer and snacks. There is a supermarket in the basement so basically you can do all your food shopping including whatever you want to take home with you. Stocked up on Jamon and the likes in one of stalls, they happily recommended and packed in vacum bags to take home without worrying that it will go off or spread the smell in your bag. ", "publishedDate": "2020-02-27", "language": "en", "rating": 5}, {"id": 724156632, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d2623636-r724156632-Mercat_de_la_Concepcio_Barcelona-Barcelona_Catalonia.html", "text": "This place is several different levels and has all basic staples of food in addition to fruit, ice cream, OTC drug needs, and beautiful flowers!", "publishedDate": "2019-11-05", "language": "en", "rating": 5}, {"id": 713656551, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d2623636-r713656551-Mercat_de_la_Concepcio_Barcelona-Barcelona_Catalonia.html", "text": "Compared to the bigger markets in the city it's not as pretty, but we bought fresh bread and local wine here and the sellers were really lovely. There is a nice florist which stands out. Sadly one side of the market is dominated by a commercial supermarket, which although proved useful, the staff were very unhappy and rude. ", "publishedDate": "2019-09-28", "language": "en", "rating": 4}, {"id": 706097364, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d2623636-r706097364-Mercat_de_la_Concepcio_Barcelona-Barcelona_Catalonia.html", "text": "Quieter and much cheaper. A must if you are self catering as the food looked nice. We only did a passing visit. ", "publishedDate": "2019-09-03", "language": "en", "rating": 5}, {"id": 705103549, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d2623636-r705103549-Mercat_de_la_Concepcio_Barcelona-Barcelona_Catalonia.html", "text": "We went there to eat the most delicious paellas and other fish meals and good wines, the  market is full of colour and animation, you have to go absolutely recommended", "publishedDate": "2019-08-31", "language": "en", "rating": 5}, {"id": 694431396, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d2623636-r694431396-Mercat_de_la_Concepcio_Barcelona-Barcelona_Catalonia.html", "text": "We stayed in a flat just down the street from this market and found the most delicious cheese, yogurt, meat, fruits and vegetables. The sellers are very helpful and kind. Don’t miss this if you’re in the Exiample neighborhood.", "publishedDate": "2019-07-31", "language": "en", "rating": 4}, {"id": 662547003, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d2623636-r662547003-Mercat_de_la_Concepcio_Barcelona-Barcelona_Catalonia.html", "text": "This is a smaller market and swathed in flowers on the outside. A good choice of vendors. Check the hours for openings — they close early several days, and many stalls close after three even on the days it stays open late.", "publishedDate": "2019-03-31", "language": "en", "rating": 4}, {"id": 655517063, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d2623636-r655517063-Mercat_de_la_Concepcio_Barcelona-Barcelona_Catalonia.html", "text": "We decided to check out this market because it was a 5-minute walk from where we were staying. It's a much smaller market than Boqueria. Unlike Boqueria, there aren't that many vendors selling cooked foods/tapas/snacks. Instead, it seemed more like a place where locals did their food shopping. We picked up some strawberries, so this is a good spot to pick up some fresh fruit. There's also a supermarket downstairs. They sell flowers and plants out front, and while I definitely didn't need any flowers, it was still nice to just look at them. If you're staying nearby and want to experience some local vibes, you should check it out. Otherwise, it's probably not worth going out of your way for if you're not looking to buy groceries.\n\nNote - they're closed Sundays.", "publishedDate": "2019-02-28", "language": "en", "rating": 4}, {"id": 625960450, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d2623636-r625960450-Mercat_de_la_Concepcio_Barcelona-Barcelona_Catalonia.html", "text": "Typical upmarket local food market.\n\nFeast for the eyes and well worth a visit to experience how well heeled locals shop for the days food.", "publishedDate": "2018-10-17", "language": "en", "rating": 5}, {"id": 625094922, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d2623636-r625094922-Mercat_de_la_Concepcio_Barcelona-Barcelona_Catalonia.html", "text": "We came to Mercat Concepcio for breakfast. Most of the vendors had not opened yet but there were a handful of stands with fruits and vegetables and two tapas bars. There is also a sweet little flower store up front. We ended up getting food from a little Japanese stand that was a little expensive, with a nice man who made yakisoba and sushi in front of us. The market did seem very similar to the ones we have seen elsewhere but it was still a nice place to eat.", "publishedDate": "2018-10-15", "language": "en", "rating": 4}, {"id": 617893845, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d2623636-r617893845-Mercat_de_la_Concepcio_Barcelona-Barcelona_Catalonia.html", "text": "Worth thr visit. Not so big but.we liked it better than the more touristy places. Everything seems fresher and less packed", "publishedDate": "2018-09-19", "language": "en", "rating": 5}, {"id": 540925493, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d2623636-r540925493-Mercat_de_la_Concepcio_Barcelona-Barcelona_Catalonia.html", "text": "Please if you walk by, I strongly recommend to stop by BAR MANUEL. It's the one on the left by street Valencia entrance. They always have daily specialities to have a nice lunch or you can enjoy their various tapas. You will not regret this stop. Enjoy a piece of spanish omelette or any of the side dishes that you will be able to see by the bar table...", "publishedDate": "2017-11-14", "language": "en", "rating": 5}, {"id": 538104356, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d2623636-r538104356-Mercat_de_la_Concepcio_Barcelona-Barcelona_Catalonia.html", "text": "Beautiful iron framed building housing a market with many meat, fruit, ham, vegetable stalls. Buy stuff to take on a picnic or eat right away. Very pleasant place to sit down and relax while locals do their shopping and parents buy their kids something to eat after school (around 4 on weekdays, the place comes alive with kids from a nearby school). In one corner is a bar serving tapas, empanadas and drinks, but most stalls have a couple seats of their own as well. Downstairs there is also a supermarket. (Stalls close around 5, the supermarket is open from 8am to 8pm.)", "publishedDate": "2017-11-03", "language": "en", "rating": 5}, {"id": 524612431, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d2623636-r524612431-Mercat_de_la_Concepcio_Barcelona-Barcelona_Catalonia.html", "text": "Lovely, clean market in the Eixample district built over 125 years ago but has since been thoroughly renovated.  It was quiet the weekday morning we had gone so it was easy to check out the array of vegetables, fruits, cheeses among other produce.", "publishedDate": "2017-09-15", "language": "en", "rating": 4}, {"id": 524359619, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d2623636-r524359619-Mercat_de_la_Concepcio_Barcelona-Barcelona_Catalonia.html", "text": "This was right by ou accommodation.  It is one of the best markets ive ever visited.  Clean, with a great array of fresh produce either ready to eat, or cook from scratch. The vendors are friendly, patient and helpful, and the market only sells food and plants and flowers.  No annoying souvenirs and trinkets.  There is a supermarket bellow it though.", "publishedDate": "2017-09-14", "language": "en", "rating": 5}, {"id": 524248553, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d2623636-r524248553-Mercat_de_la_Concepcio_Barcelona-Barcelona_Catalonia.html", "text": "Shopped in the market many times for fruit and flowers.  It's often open in the evenings.  Small, neighborhood serving, very pleasant.", "publishedDate": "2017-09-13", "language": "en", "rating": 4}, {"id": 524184272, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d2623636-r524184272-Mercat_de_la_Concepcio_Barcelona-Barcelona_Catalonia.html", "text": "Excellent and very clean Market near Passei de Gracia. Very nice shops with lots of products, fish, meats, sea food, vegetables, fruits. All the products first class. Great place to go shopping, not very crowded and very good staff in the vendors.  See pictures", "publishedDate": "2017-09-13", "language": "en", "rating": 5}, {"id": 524165212, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d2623636-r524165212-Mercat_de_la_Concepcio_Barcelona-Barcelona_Catalonia.html", "text": "Lovely building , great atmosphere , good food and drink, pretty central too , a 10 minute walk from Plaza Cataluña", "publishedDate": "2017-09-13", "language": "en", "rating": 4}, {"id": 508139249, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d2623636-r508139249-Mercat_de_la_Concepcio_Barcelona-Barcelona_Catalonia.html", "text": "This is a place where you can buy local food just like in a real market and on the contrary to L. B....... there is no tourist scam. We went to Torres Vilà to buy some bellota and queso manchego. We got very good advice on the different types of ham (made from leg, shoulder, pata negra etc.....). We had a cafe solo at the bar on the entrance opposite Calle Arrago. Definitely a place to recommend.", "publishedDate": "2017-08-02", "language": "en", "rating": 5}, {"id": 493674002, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d2623636-r493674002-Mercat_de_la_Concepcio_Barcelona-Barcelona_Catalonia.html", "text": "We had checked on the internet for markets other than La Boqueria to visit and we weren't disappointed. When you walk in there is a supermarket and appliance shop first and then doors take you through to the air conditioned market proper. Lots of stalls selling fruit and veg and meats. Mainly locals there. The best part for us was the part at the back selling lots of plants and flowers and an Agave came home with us!", "publishedDate": "2017-06-17", "language": "en", "rating": 5}, {"id": 490296126, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d2623636-r490296126-Mercat_de_la_Concepcio_Barcelona-Barcelona_Catalonia.html", "text": "This is a great local market which is well worth a visit when in Barcelona. There is a lovely little friendly bar just inside the entrance and the stalls are well worth a look around. Not many tourists here so a nice local atmosphere.", "publishedDate": "2017-06-04", "language": "en", "rating": 5}, {"id": 489943442, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d2623636-r489943442-Mercat_de_la_Concepcio_Barcelona-Barcelona_Catalonia.html", "text": "Forget about the raving reviews of all the other marketplaces in BCN. \n\nThis is the hidden gem which is still surprisingly a secret to most tourists ! It has everything else other markets can offer. It is far less crowded and is even air conditioned. \n\nIt has a fabulous florist, sufficiently stocked supermarket in the basement and cafes and bars in the market proper as well. The stallowners are friendly and prices are reasonable as well. ", "publishedDate": "2017-06-02", "language": "en", "rating": 5}, {"id": 471030375, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d2623636-r471030375-Mercat_de_la_Concepcio_Barcelona-Barcelona_Catalonia.html", "text": "Lovely products, picturesque setting, a great way to spend an hour or buy gifts or picnic supplies. Watch the limited hours, closed Sunday.", "publishedDate": "2017-03-29", "language": "en", "rating": 4}, {"id": 470479029, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d2623636-r470479029-Mercat_de_la_Concepcio_Barcelona-Barcelona_Catalonia.html", "text": "Living a 10 minute walk from here is wonderful. It's my local fresh food store. Can be expensive but I'd rather shop here than in a supermarket. There is a supermarket attached for day to day - non-fresh food - products which is handy as well. Fabulous flower market/shop also attached to the market.\n\nA few bars in the market for tapas/coffee/beer!", "publishedDate": "2017-03-27", "language": "en", "rating": 5}, {"id": 469115104, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d2623636-r469115104-Mercat_de_la_Concepcio_Barcelona-Barcelona_Catalonia.html", "text": "This is an excellent neighborhood market with a wide variety of fresh goods, including multiple fruit, vegetable, cheese, fish, and other vendors.  There is a nice bakery here as well, and a supermarket underneath the market.  We rented a nearby apartment and were able to buy supplies for a number of meals.", "publishedDate": "2017-03-21", "language": "en", "rating": 5}, {"id": 464960007, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d2623636-r464960007-Mercat_de_la_Concepcio_Barcelona-Barcelona_Catalonia.html", "text": "It is mire for locals than for tourists. We went there for breakfast twice and had fresh good food in a funny little cafè opposite the flowers side. This market is famous fir flowers and indeed they have plenty of stuff. We enjoyed chatting with the barista, that looks like Moe, and was very kind to us. We had great cafè con leche (like cappuccino) and cafè cortado (like the Italian ''macchiato\"). If I were living there, I would do the grocery every day at the Mercat de la Concepcio !", "publishedDate": "2017-03-06", "language": "en", "rating": 4}, {"id": 435118162, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d2623636-r435118162-Mercat_de_la_Concepcio_Barcelona-Barcelona_Catalonia.html", "text": "We rented an apartment about a 1/2 block away and honestly, this was one of the highlights of the trip (which was great overall). We rented an apartment in particular so we could make some of our own meals (highly recommended for families with young ones)- and thanks to the variety of fantastic foods at Mercat de la Concepcio, we never felt like we were missing out. All of the vendors were extremely nice and happily assisted me (despite my not so great Spanish). We went nearly every day and enjoyed dinners filled with olives, cheese, meats and olive oils. Really great!", "publishedDate": "2016-11-06", "language": "en", "rating": 5}, {"id": 395175812, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d2623636-r395175812-Mercat_de_la_Concepcio_Barcelona-Barcelona_Catalonia.html", "text": "I you want local meat, fish, ham, veggies when in BCN then go here instead of Mercat de la Boqueria on the Rambla that usually gets all the glory and fame. However, this one is much nicer, no tourist crow and the merchants actually greet you with a \"ola\" \nThere is also a regular supermarked in the basemanet - really a convenient one-stop market.\n\nThere is a good variety of Iberico ham and the stores will vacuum pack sliced ham for you if you want to bring some home. Just ask.", "publishedDate": "2016-07-21", "language": "en", "rating": 4}, {"id": 379534418, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d2623636-r379534418-Mercat_de_la_Concepcio_Barcelona-Barcelona_Catalonia.html", "text": "Walking around Barcelona on a cool slightly damp Saturday morning, I cam across the Mercat de la Concepcio.\nIt was a wonderful local market with stalls run by local families serving the local community.\nThe produce was fresh and fragrant.\nThe locals were chatting to their regular suppliers.\nOld men were taking espressos at the coffee bar, chatting away.\nYoung men, old ladies were slicing and dicing fish, veggies, jamon making beautiful displays.\nNo wonder supermarkets in Australia pale into insignificance when you experience the joys of fresh local markets.", "publishedDate": "2016-06-03", "language": "en", "rating": 5}, {"id": 365779204, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d2623636-r365779204-Mercat_de_la_Concepcio_Barcelona-Barcelona_Catalonia.html", "text": "Mercat de la Boqueria gets all the glory and pulls all the tourists, but you can have a very similar experience here.\n\nJust like the other market, this one has meats, cheeses, fruits and other goodies to tickle your taste buds.  The selection is smaller than Mercat de la Boqueria, but there were virtually no crowds when we visited.\n\nStrangely, they also have an appliance store and some sort of convenience store built into it.  It's a one-stop shop.\n\nIt would be really easy to pass this and not even know what was inside, but it's worth walking in, wandering around and seeing what's available.", "publishedDate": "2016-04-20", "language": "en", "rating": 4}, {"id": 357554245, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d2623636-r357554245-Mercat_de_la_Concepcio_Barcelona-Barcelona_Catalonia.html", "text": "This is a great place to buy your groceries if you are staying nearby. One stall even sold custom-made sealed \"Travel-Packs\" filled with cheese, ham and/or olives that you can take home by plane. It's less crowded and more authentic than the famous markets around Las Ramlas.", "publishedDate": "2016-03-22", "language": "en", "rating": 5}, {"id": 331943448, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d2623636-r331943448-Mercat_de_la_Concepcio_Barcelona-Barcelona_Catalonia.html", "text": "It was very nice to go to Market , because we have some small snack, tapas, which was fantastic! You can choose delithious fish and sea food grilled with cava or vine.", "publishedDate": "2015-12-10", "language": "en", "rating": 5}, {"id": 325836403, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d2623636-r325836403-Mercat_de_la_Concepcio_Barcelona-Barcelona_Catalonia.html", "text": "We stayed a short walk from this market which was a great bonus. It is open every day except Sunday with a supermarket in the basement. We love shopping at the food markets and this one was fun to shop for our meals. Bought vegetables, fruit, fish and cheeses and the quality was exceptional. Everything was fresh and well priced (some items cheaper than at the grocery stores). Specifically wanted to mention the bakery located in the corner towards the main entrance near the grocery store - so good and the pastries are to die for. They taste heavenly and look very exquisite. Don't miss this market if you're in the are - you will enjoy shopping there.", "publishedDate": "2015-11-10", "language": "en", "rating": 5}, {"id": 321041297, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d2623636-r321041297-Mercat_de_la_Concepcio_Barcelona-Barcelona_Catalonia.html", "text": "Amazing array of beautiful flowers and fresh fruits, meats and cheeses. Fish also!! \n\nIt's small but everyone is very friendly. Get a fruit juice!! ", "publishedDate": "2015-10-22", "language": "en", "rating": 5}, {"id": 287804191, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d2623636-r287804191-Mercat_de_la_Concepcio_Barcelona-Barcelona_Catalonia.html", "text": "Great place to buy fresh and delicious food for breakfasts! Delicious hams and cheeses and breads too. The only downside is that one of the booths selling fruits are quite rude. Otherwise, great place!", "publishedDate": "2015-07-10", "language": "en", "rating": 4}, {"id": 285522632, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d2623636-r285522632-Mercat_de_la_Concepcio_Barcelona-Barcelona_Catalonia.html", "text": "La Concepcio is the place to go if you want to feel like a traveler and not a tourist. There are many locals at this market. It is not jam packed with tourists. There are great fruit juices,fruit,meats,cheeses,bakeries,olive oils,wines and several cafes and bars. There is an amazing flower market at the entrance.I would shop here for a picnic and it is perfect if you are renting an apartment.", "publishedDate": "2015-07-04", "language": "en", "rating": 5}, {"id": 255852810, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d2623636-r255852810-Mercat_de_la_Concepcio_Barcelona-Barcelona_Catalonia.html", "text": "Tiny and nice. It is not Boqueria, of course, but still. Good choice of meat, sausages, cheeses, fruits, vegetables... Lots of flowers to make a pleasant surprise to your loved one.", "publishedDate": "2015-02-22", "language": "en", "rating": 5}, {"id": 233922001, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d2623636-r233922001-Mercat_de_la_Concepcio_Barcelona-Barcelona_Catalonia.html", "text": "At the entrance there is a beautiful fresh flower market with also plants and everything associated with that, very inviting! One really gets hungry when entering this food market, there are separate fresh produce stalls with meat, fish and seafood, chicken and to much to mention. Also the freshest fruit and vegetables. We bought some lovely good quality olive oil, balsamic vinegar and olives to take home. I were disappointed that it was not possible to buy more because we stayed in a hotel and also not possible to take home to South Africa on a plane. Next time when visiting Barcelona we intend staying in a self catering apartment so that we can buy all this nice fresh produce from the food markets, and we will be visiting this one definitely again!", "publishedDate": "2014-10-12", "language": "en", "rating": 4}, {"id": 233641934, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d2623636-r233641934-Mercat_de_la_Concepcio_Barcelona-Barcelona_Catalonia.html", "text": "I guess if you are actually going here for something specific, it may be worth the trip. I expected much more than it delivers. The grocery in the basement was actually the highlight. If you are in the neighborhood (maybe walking from La Sagrada Familia), it may be worth a quick stop.", "publishedDate": "2014-10-10", "language": "en", "rating": 3}, {"id": 206801022, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d2623636-r206801022-Mercat_de_la_Concepcio_Barcelona-Barcelona_Catalonia.html", "text": "I can only echo \"FoodieLuv\"'s review. We walked to this market after visiting La Sagrada Familia (about 20 brisk walk). On a weekday, the market was pleasantly peaceful (as compared to La Bouqueira, where you are assaulted on all senses by the crush of visitors). On one end, there is a verdant plant nursery, while the inside of the market is spacious, well-lit and peaceful. There is less choice than in LB. For example, from memory, only three four fish counters. But I think you would probably find most things you wanted, here, in a more conducive atmosphere. We didn't buy much - just sole (fish), so we can't really comment on the quality of produce. There is also a supermarket in the basement.\nBut overall, if you wanted to experience a Spanish market, this would be my choice.", "publishedDate": "2014-05-23", "language": "en", "rating": 4}, {"id": 205567809, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d2623636-r205567809-Mercat_de_la_Concepcio_Barcelona-Barcelona_Catalonia.html", "text": "We spent one 1 1/2 hours in this amazing, delicious market. Our landlord recommended this place during our one week stay in lively Barcelona. Though not as big as Boqueria, the selections were many, the smells wonderful, and plenty food eye-candy! We found the vendors very friendly and helpful even though we didn't speak their language. We purchased several items and left with two bags to consume at our apartment. Our only disappointing experience was a fruit vendor who put a totally rotten (molded completely) apple in amongst our other four apples. She pulled one off on these stupid Americans. What a shame, as we had bought juices and other fruit from her. Oh well, we didn't let it ruin our wonderful market experience. Oh, BTW, the flowers are just beautiful there, and there is a great big grocery market underneath for your other essentials. We bought very nice wine & cava at great prices. ", "publishedDate": "2014-05-14", "language": "en", "rating": 5}]}}]