[{"locationId": 6206152, "name": "Plaza de Toros Monumental de Barcelona", "placeType": "ATTRACTION", "reviewListPage": {"reviews": [{"id": 752544814, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d6206152-r752544814-Plaza_de_Toros_Monumental_de_Barcelona-Barcelona_Catalonia.html", "text": "During my journey through Spain, it was fascinating to visit the different bullrings. The final bullring that I visited was this bullring in Barcelona. This bullring is distinct in that it incorporates art deco in its architecture as evidence by the detailed tile work. I learned that the bullring dates back to 1914. However, no bullfights have been held here since bullfighting was outlawed by Catalonia in 2011. Today, this bullring is only a museum with some limited areas within the bullring opened to the public. Since it is in the heart of Barcelona, it was well worth a visit to learn about a bygone era.", "publishedDate": "2020-04-12", "language": "en", "rating": 4}, {"id": 732906875, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d6206152-r732906875-Plaza_de_Toros_Monumental_de_Barcelona-Barcelona_Catalonia.html", "text": "This is well worth the little money it cost to get in. We had the whole place to ourselves. So cool and so much history! You get to walk anywhere in the ring as well! ", "publishedDate": "2019-12-15", "language": "en", "rating": 4}, {"id": 727052364, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d6206152-r727052364-Plaza_de_Toros_Monumental_de_Barcelona-Barcelona_Catalonia.html", "text": "Lots of history here and it's fun to tour and learn of how this arena has been used.  Located in a very busy part of town and served by the Metro.", "publishedDate": "2019-11-17", "language": "en", "rating": 4}, {"id": 713693840, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d6206152-r713693840-Plaza_de_Toros_Monumental_de_Barcelona-Barcelona_Catalonia.html", "text": "Excellent place to visit. Feel like you are alone in an abandoned historic building. Can roam and explore freely, try any seat, investigate behind the scenes, ringside behind the barriers, or in the middle of the arena. T-shirts on sale show the Beatles performed here in 1965. Fascinating in addition to being amazing value for the admission cost. Only one warning, be careful not to get locked in when they close for siesta at 2pm (I almost did!)", "publishedDate": "2019-09-28", "language": "en", "rating": 5}, {"id": 702270125, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d6206152-r702270125-Plaza_de_Toros_Monumental_de_Barcelona-Barcelona_Catalonia.html", "text": "For 6€, you can go into the stands, stables, arena, museum and shop. Interesting history. Probably one of the cheapest attractions in Barcelona.", "publishedDate": "2019-08-23", "language": "en", "rating": 5}, {"id": 684448502, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d6206152-r684448502-Plaza_de_Toros_Monumental_de_Barcelona-Barcelona_Catalonia.html", "text": "On our first trip to Barcelona we took a walk after checking into our hotel and happened upon the Bull Fighting Museum or Plaza de Toros Monumental de Barcelona.\n\nIt is a beautiful building with amazing tilework. The museum itself was closed and we both wished it was open to check out the inside and the actual museum. But just seeing the historic architecture from the outside was pretty nice in itself.\n\nThe best thing is that no more bulls will have to die here anymore.....Worth seeing when in the area.", "publishedDate": "2019-06-26", "language": "en", "rating": 4}, {"id": 681896351, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d6206152-r681896351-Plaza_de_Toros_Monumental_de_Barcelona-Barcelona_Catalonia.html", "text": "This is a great place to visit and to see the history behind this beautiful arena. The entrance is 6 euros and well worth it. There's a very nice museum.  ", "publishedDate": "2019-06-16", "language": "en", "rating": 5}, {"id": 675490770, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d6206152-r675490770-Plaza_de_Toros_Monumental_de_Barcelona-Barcelona_Catalonia.html", "text": "I only recommand it if you have time to spare as there is a lot of other attractions to see as well.", "publishedDate": "2019-05-21", "language": "en", "rating": 5}, {"id": 664466252, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d6206152-r664466252-Plaza_de_Toros_Monumental_de_Barcelona-Barcelona_Catalonia.html", "text": "It’s a shame the bull ring has been turned into a shopping centre. It’s great the outside has largely been kept as it was but regardless of what you think about bull fighting it would have been better to turn it into a museum. \n\nThe building itself is very impressive and stands in a prominent part of Espania, Barcelona near the Museum, Olympic site and Montjuic Castle. \n\nThey do have photos and the history of the bull ring and beyond on one of the upper floors as well as a rooftop area for viewing the surrounding neighbourhood.", "publishedDate": "2019-04-07", "language": "en", "rating": 4}, {"id": 663708177, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d6206152-r663708177-Plaza_de_Toros_Monumental_de_Barcelona-Barcelona_Catalonia.html", "text": "People come here in large numbers for shopping and eating.  It's the historic bull fighting arena, now used for new purposes.  Pleasant but busy.", "publishedDate": "2019-04-04", "language": "en", "rating": 4}, {"id": 653731809, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d6206152-r653731809-Plaza_de_Toros_Monumental_de_Barcelona-Barcelona_Catalonia.html", "text": "The place itself is really nice on the outside and the inside.There should be a little more things to do.", "publishedDate": "2019-02-20", "language": "en", "rating": 4}, {"id": 631315926, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d6206152-r631315926-Plaza_de_Toros_Monumental_de_Barcelona-Barcelona_Catalonia.html", "text": "Although I wouldn’t recommend for families as it’s probably a bit boring for kids - I do recommend for adults . Very interesting and historical but could have probably done with a map with some information on .", "publishedDate": "2018-11-06", "language": "en", "rating": 4}, {"id": 628160765, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d6206152-r628160765-Plaza_de_Toros_Monumental_de_Barcelona-Barcelona_Catalonia.html", "text": "Plaza De Toros Monumental De Barcelona  is the former bull ring that is just an amazing piece of architecture. \nBuilt in 1914 and simply known as La Monumental to the locals ,the facade looks superb,a mix of both Mudejar and Byzantine style architecture, it grabs your attention if your passing this awesome building.\nBullfighting was banned in the Catalonia region in 2010 and came into force in 2012  but you can still enter the former bull ring arena for €6 and walk around the magnificent arena and visit the museum within.\nA stunning looking building and if your in the area most definitely well worth checking out. \nEasy to locate on Gran Via De Les Corts Catalanes in the amazing L'Eixample District of Barcelona.   ", "publishedDate": "2018-10-25", "language": "en", "rating": 5}, {"id": 624598577, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d6206152-r624598577-Plaza_de_Toros_Monumental_de_Barcelona-Barcelona_Catalonia.html", "text": "If your nearby this a really interesting place to visit , gives  you a insight into Barcelona history without having info thrust in your face . If like me your totally against bull fighting it is still a awesome building and you can sense the atmosphere even when it is empty .  Only 6€ entrance worth it . ", "publishedDate": "2018-10-14", "language": "en", "rating": 4}, {"id": 618503518, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d6206152-r618503518-Plaza_de_Toros_Monumental_de_Barcelona-Barcelona_Catalonia.html", "text": "Had admired this building from the outside but didn’t actually know what it was until seeing other photos here!", "publishedDate": "2018-09-21", "language": "en", "rating": 4}, {"id": 612941854, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d6206152-r612941854-Plaza_de_Toros_Monumental_de_Barcelona-Barcelona_Catalonia.html", "text": "The bullring was open just after 10am and we paid the man €6 each.  We were allowed to access the bullring and museum of our own accord and wander around.  The bullring was bigger than I expected.  The museum is small however shows the different outfits the matador wore throughout the years.  We enjoyed our visit here", "publishedDate": "2018-09-01", "language": "en", "rating": 4}, {"id": 591885992, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d6206152-r591885992-Plaza_de_Toros_Monumental_de_Barcelona-Barcelona_Catalonia.html", "text": "Cheap entry and well worth a look. It was very quiet when we went which meant we could have a proper look round. The stands are very high up and made me feel a little queasy. The museum part is small but is a nice look at the history. I'm glad it's not longer a working ring but it was a worth seeing", "publishedDate": "2018-06-30", "language": "en", "rating": 4}, {"id": 574619471, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d6206152-r574619471-Plaza_de_Toros_Monumental_de_Barcelona-Barcelona_Catalonia.html", "text": "€6 entry, well worth it! You can walk/sit around the bull ring and enter the main arena. Small museum included old outfits of the matadors, real bull models and additional information is provided in multiple languages. Would highly recommend :) easy to get to from the ‘monumental’ metro station. ", "publishedDate": "2018-04-20", "language": "en", "rating": 5}, {"id": 560720579, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d6206152-r560720579-Plaza_de_Toros_Monumental_de_Barcelona-Barcelona_Catalonia.html", "text": "stumbled upon this place as the start of our visit to Barcelona and there was a music and food festival.  For the 3 Euros entrance we were treated to market stalls with food and jewelry.  Inside there was music both live and a disco with lots of food stalls.  WE had fun in a very pretty venue.  Sad to think it was a bullring.", "publishedDate": "2018-02-15", "language": "en", "rating": 4}, {"id": 556649840, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d6206152-r556649840-Plaza_de_Toros_Monumental_de_Barcelona-Barcelona_Catalonia.html", "text": "Have just visited the old bull ring it was only €6 each to get in and you can go pretty much anywhere in the stadium there is a little museum with a very friendly man to show you around it is well worth the visit ", "publishedDate": "2018-01-27", "language": "en", "rating": 5}, {"id": 556564741, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d6206152-r556564741-Plaza_de_Toros_Monumental_de_Barcelona-Barcelona_Catalonia.html", "text": "Despite arriving during the alleged opening hours (1600H) the gates were locked. There were 5 other tourists trying to get in, including an elderly man from Catalonia. We peered through the filthy windows of the ticket office and saw a man sat inside, reading a stack of newspapers. He had 3 packs of cigarettes stacked on the table in front of him, and looked well prepared for an afternoon of doing nothing ! \nThe Catalan visitor politely asked him why the gate was locked. He just shouted \"closed\" and \"go away\" in Catalan, and rudely shooed us away. \nNeedless to say, we were very disappointed and angry to be treated in this manner. The mudejar architecture on the outside of the building looks amazing, and I'm sure the arena and museum would have been interesting, had we been able to get in. \nI have since looked through the other negative reviews on TripAdvisor and it seems it's quite common for the bullring to be closed when it's supposed to be open. Makes you wonder if the miserable git is being paid, but can't be bothered to open up and do his job !. Hopefully, whoever is responsible for this building will read these reviews and employ someone who can be bothered to unlock the door !", "publishedDate": "2018-01-26", "language": "en", "rating": 1}, {"id": 544012266, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d6206152-r544012266-Plaza_de_Toros_Monumental_de_Barcelona-Barcelona_Catalonia.html", "text": "An interesting place if not a bit expensive considering the lack of information. The site is not used anymore and has literally been left as it were with the old bull pens and the fighting arena.", "publishedDate": "2017-11-29", "language": "en", "rating": 4}, {"id": 541237954, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d6206152-r541237954-Plaza_de_Toros_Monumental_de_Barcelona-Barcelona_Catalonia.html", "text": "€6 entry.\nPaid the man who was sat in the sun on a fold up chair reading a paper...at least I think he worked there...i hope he worked there.\nIt's just a look around the old bullring but it was great.\nYou can go up to the stalls and walk into the actual ring and live through it with the imagination of history.\nThe museum was interesting although I found the mannequins a little disturbing. \n\nThe man in the museum was very abrupt and acted like he just got woke up...grumpy\n\nBut you know what. Important part of Spanish history ", "publishedDate": "2017-11-15", "language": "en", "rating": 3}, {"id": 540194371, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d6206152-r540194371-Plaza_de_Toros_Monumental_de_Barcelona-Barcelona_Catalonia.html", "text": "Final day in Barcelona and decided to go to the old bull ring.  Now bull fighting has been banned in Catalonia since 2012, so this stadium is now very much used for other things.  But for 6 euros you can go in look all around the stands and stand in the centre of the ring.  The architecture is amazing and the museum of the ring fascinating with an extremely helpful man to show you round.  Virtually no area is out of bounds and you can really absorb the history.  The great thing is that hardly anyone was there and this was a Saturday.  It was a wonderful little gem in barcelona.", "publishedDate": "2017-11-11", "language": "en", "rating": 5}, {"id": 514321001, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d6206152-r514321001-Plaza_de_Toros_Monumental_de_Barcelona-Barcelona_Catalonia.html", "text": "I went to my first and inky bull fight when I was 14.  I was enamoured with the spectacle.  The romanticism of a single man entering the ring standing against a 1000 lb (or more) angry animal.  But, alas, bull fighting is falling out of favour in Spain.  The Plaça de Braus Monumental is moth-balled   No more bull fights in Barcelona.  \n\nVisit for to witness the grandeur of the ring.  The abuelo who manages the museum is funny,  He asks your preferred language and proceeds to give you the entire tour in Spanish. \n\nThe Barcelona community used to come together at the bullring on a Sunday, after Church to cheer the heros of the ring.  What romanticism!", "publishedDate": "2017-08-17", "language": "en", "rating": 5}, {"id": 510399017, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d6206152-r510399017-Plaza_de_Toros_Monumental_de_Barcelona-Barcelona_Catalonia.html", "text": "This beautiful Arena now completly empty represents the culture of Spain! It is a really sad see it on this conditions", "publishedDate": "2017-08-09", "language": "en", "rating": 4}, {"id": 509088650, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d6206152-r509088650-Plaza_de_Toros_Monumental_de_Barcelona-Barcelona_Catalonia.html", "text": "Came here on way to dinner, it's a nice monument and has lovely design but although there is an explanation about it it isn't much more than a 10 minute visit so unless going past here I wouldn't say it's worth the journey.", "publishedDate": "2017-08-05", "language": "en", "rating": 3}, {"id": 491909333, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d6206152-r491909333-Plaza_de_Toros_Monumental_de_Barcelona-Barcelona_Catalonia.html", "text": "The Barcelona Bullring is a beautiful edifice that reflects the pride that every large Spanish city takes in it's bullring. Barcelona recently voted to abandon the centuries old tradition of the bullfight and the stadium is now used for other purposes, mainly concerts.", "publishedDate": "2017-06-10", "language": "en", "rating": 5}, {"id": 485284034, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d6206152-r485284034-Plaza_de_Toros_Monumental_de_Barcelona-Barcelona_Catalonia.html", "text": "It's supposed to be open till 2 pm. Well, I was there at 1:30 and the gate was locked, I walked around it to search for entrance but the locked gate was the only one.\n\nAs I made a full circle and come back to the entrance again, an old guy was in the courtyard, talking to someone else who I couldn't see. Clearly, he was employed there but he couldn't be bothered to walk 5 meters to talk to me... He just kept shaking his head. What a nasty disgrace. I only wanted to know when it will be open. I wasted half day for this, and to make it worse it has happened on May the 18th, International Museum Day!", "publishedDate": "2017-05-18", "language": "en", "rating": 1}, {"id": 475638489, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d6206152-r475638489-Plaza_de_Toros_Monumental_de_Barcelona-Barcelona_Catalonia.html", "text": "This empty bull ring was amazing place, with love od history. It was magical to stand on sand on same place like torreadors. Interesting stadium with 20 thousand capacity ", "publishedDate": "2017-04-14", "language": "en", "rating": 4}, {"id": 475448959, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d6206152-r475448959-Plaza_de_Toros_Monumental_de_Barcelona-Barcelona_Catalonia.html", "text": "It's nothing to see it there, unless you're an architecture student, and want to see techiniques, and bad taste.", "publishedDate": "2017-04-13", "language": "en", "rating": 1}, {"id": 473236071, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d6206152-r473236071-Plaza_de_Toros_Monumental_de_Barcelona-Barcelona_Catalonia.html", "text": "The architectural style is a mix of modernism and moorish, with beautiful tiles and spires, minarets, towers and arches. Near to Sagrada Familia and worth a visit.", "publishedDate": "2017-04-06", "language": "en", "rating": 4}, {"id": 472673516, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d6206152-r472673516-Plaza_de_Toros_Monumental_de_Barcelona-Barcelona_Catalonia.html", "text": "This arena is not in use anymore but can be visited. When we went we were the only ones there and so we had more or less a private tour. I m not a fan of corrida but the culture around it is pretty interesting. The small museum have a lot of artifacts and you can enter the ring for as long as you want. Sadly the guide could only speak catalan so I couldnt get all the information .. (even if he was very funny and nice) ticket was 6euro I think, totally worth a tour ", "publishedDate": "2017-04-04", "language": "en", "rating": 4}, {"id": 471928238, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d6206152-r471928238-Plaza_de_Toros_Monumental_de_Barcelona-Barcelona_Catalonia.html", "text": "Was taken there about 45 years ago as a young lad to experience a bullfight!\nAmazing building and quite breathtaking to walk to the middle of the bullring. Unfortunately the museum was closed and would have liked to be able to visit the small chapel and medical facility. \nObviously a very controversial 'sport' but could feel this historical building still had a place in the heart of Catalonia. \nNo crowds just walk in 6€. We visited many wonderful sights during our Barcelona stay but for some reason the Plaza de Toros Monumental will remain a lifelong memory. ", "publishedDate": "2017-04-01", "language": "en", "rating": 4}, {"id": 465971713, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d6206152-r465971713-Plaza_de_Toros_Monumental_de_Barcelona-Barcelona_Catalonia.html", "text": "A beautiful building, well worth a visit to see the external structure which is a mosaic of blues and whites.\n\nThis is easy to find and is on the way from the centre of the city to Sagrada Familia.", "publishedDate": "2017-03-09", "language": "en", "rating": 4}, {"id": 463476821, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d6206152-r463476821-Plaza_de_Toros_Monumental_de_Barcelona-Barcelona_Catalonia.html", "text": "Many people will miss this attraction. While people may pass it while walking around Barcelona, it isn't immediately obvious that this building is open as an attraction. It opens a little later in the day and I believe closes mid day then opens again later. Enter through the front gates and keep to the left to pay your admission to a gentleman either sitting outside or inside a shed. make sure you hold on to your ticket as it is asked for later. Follow the outer ring to the left to find a small museum dedicated to past matadors. The guide is very friendly but only speaks Spanish so prepare yourself for that, and he asks you for your ticket. He will point out a few notable pieces and even take a picture of you if needed. I found this museum very insightful, even if a bit small, as this is a topic I didn't know much about. Some of the posters advertising past bull fights have some great artwork on them, making the venue appear half opera, half gladiatorial battle. Lots of emotion in those posters. When you are done here, stroll into the ground floor of the bull ring. At the time of my visit, I was the only person here for about twenty minutes or so, and the feeling of standing in the center of a now unused, empty bull ring is indescribable. This feeling of being there alone actually helped me rate this attraction one point higher. You can go back outside to the outer ring and climb the stairs to enter the ring from the higher levels as well, just be careful walking as the rows and aisles are tight.", "publishedDate": "2017-02-28", "language": "en", "rating": 4}, {"id": 460504195, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d6206152-r460504195-Plaza_de_Toros_Monumental_de_Barcelona-Barcelona_Catalonia.html", "text": "Barcelona's last bull ring that closed some years ago is a wonderful piece of real Barcelona.  Go through the open gates - there is a man in the small shed (!) and we paid 6 euros for adults, 5 for our teenager and free for under 10.  You can get into the main arena and wander about soaking up the atmosphere as well as see the small museum.  It feels gladiatorial and aside from your views about bullfighting, it is a real eye opener and a chance to get behind the tourist route.  Great way to spend 30mins to an hour and in the summer perfect to avoid the heat.  Sadly, the arena will probably be turned into something less interesting soon so go while you can!", "publishedDate": "2017-02-16", "language": "en", "rating": 5}, {"id": 437488919, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d6206152-r437488919-Plaza_de_Toros_Monumental_de_Barcelona-Barcelona_Catalonia.html", "text": "A beautiful old building that is largely unused.  The tiles on the outside are gorgeous.  The inside is very interesting given that bull fighting has not been allowed since 2010.  A very small entrance fee gives you access to the whole arena plus a small museum of bullfighters suits, photos and posters.  ", "publishedDate": "2016-11-15", "language": "en", "rating": 4}, {"id": 423927738, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d6206152-r423927738-Plaza_de_Toros_Monumental_de_Barcelona-Barcelona_Catalonia.html", "text": "Sit and walk through the bull ring and you can almost hear the atmosphere when the bull fights were still able to take place. The empty arena provides a calming and interesting look back through history. If you speak Spanish, make sure you talk to Juan Pedro, the nephew of the arena's owner. A special thanks to him for his enlightening description of the bull fights. I almost felt like I could have been there back in the glory days!", "publishedDate": "2016-09-30", "language": "en", "rating": 5}, {"id": 423626530, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d6206152-r423626530-Plaza_de_Toros_Monumental_de_Barcelona-Barcelona_Catalonia.html", "text": "this place is not so famous in tourist guides, but it is a real madterpiece.. if I recall correcz it costs 6€ and it is well worth it.. you can wander around freely and explore the arena, there is also small museum which is good but not spectacular.. you will be almost alone in arena (there were 3-4 persons visiting with us) so you will have freedom to take as much photos as you want and walk everywhere.. it is near Sagrada familya so you can combine the 2", "publishedDate": "2016-09-29", "language": "en", "rating": 5}, {"id": 417730626, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d6206152-r417730626-Plaza_de_Toros_Monumental_de_Barcelona-Barcelona_Catalonia.html", "text": "We came out of the Sagrada looked at the map and noticed this as a highlighted area, not knowing what it was and feeling adventurous we walked the short distance to find this amazing building ? It is an old stadium for Bull fighting, we ventured in and paid the 6 Euros. You can wander around on your own, we entered the ring and stood in the middle just like a matadoor, It was truly amazing.There is a small museum you can visit with various costumes, you can also where the bulls came in from there stalls.\nIt certainly is a true piece of history that is well worth stopping in to see.", "publishedDate": "2016-09-12", "language": "en", "rating": 5}, {"id": 415791744, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d6206152-r415791744-Plaza_de_Toros_Monumental_de_Barcelona-Barcelona_Catalonia.html", "text": "Beautiful exterior featuring a small museum on corridas and torreros inside. The tour oberall does not take much time. Possible spot for concerts now (?)", "publishedDate": "2016-09-07", "language": "en", "rating": 4}, {"id": 413902590, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d6206152-r413902590-Plaza_de_Toros_Monumental_de_Barcelona-Barcelona_Catalonia.html", "text": "I will speak about architecture of this place causeit is brilliant. I love everything about it. I love the colours, blue and white and orange/brown. I love the eggs on the big columns. I am mesmerized with this building. I really, really love the archtecture of this arena. And it is filled with history, am I supposed to ask for more?", "publishedDate": "2016-09-02", "language": "en", "rating": 5}, {"id": 409664015, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d6206152-r409664015-Plaza_de_Toros_Monumental_de_Barcelona-Barcelona_Catalonia.html", "text": "6 eu entry its a very basic place. good for a quick visit.\nvery quite when i was there i stood apon the center of the ring no one around in the stands or ring. A matador for a moment.  ole.", "publishedDate": "2016-08-23", "language": "en", "rating": 5}, {"id": 399440095, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d6206152-r399440095-Plaza_de_Toros_Monumental_de_Barcelona-Barcelona_Catalonia.html", "text": "\nVery interesting and not to be missed.\nEnthusiastic guide,even though he doesn't speak English he managed to be understood.\nWorth the 6€ to get in.\nNearest stations Sagrada Familia or Glories\n\n", "publishedDate": "2016-07-31", "language": "en", "rating": 5}, {"id": 382969389, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d6206152-r382969389-Plaza_de_Toros_Monumental_de_Barcelona-Barcelona_Catalonia.html", "text": "I so wanted to see a bullfight during my visit to this great city but alas it was not meant to be. Using a little imagination however I could almost see the Matador, the bull and the cheering crowd as I stood on the sand in the center of this great arena. It is well maintained and although a bullfight has not taken place here since bullfighting was outlawed in 2011 It looks as if you could have one there tomorrow !!! I feel that this is part of spain's heritage and I would not be surprised if in the future bullfighting resumes here. You can wander through the entire facility which I am sure you were never allowed to during this buildings heyday. The museum also has a nice display of garments , photos ect. that you will enjoy. Don't miss it during your visit to Barcelona", "publishedDate": "2016-06-15", "language": "en", "rating": 5}, {"id": 373087098, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d6206152-r373087098-Plaza_de_Toros_Monumental_de_Barcelona-Barcelona_Catalonia.html", "text": "The mighty La Monumental. This used to be the bull fighting pit before Barcelona banned the sport years ago. The gruesome violent and graphic sport in this arena has been turned into a museum. Give it a go, and you can get in touch with your inner Matador….", "publishedDate": "2016-05-15", "language": "en", "rating": 4}, {"id": 354289204, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d6206152-r354289204-Plaza_de_Toros_Monumental_de_Barcelona-Barcelona_Catalonia.html", "text": "What do you think off when you hear of Spain? Bullfighting! For a cheap entry price of 6 euros per person or 5 if you're a child, you can see the small museum and wander around freely in the bullring. Highly recommend it as it is walking distance from Sagrada familia or just off the metro 'monumental' ", "publishedDate": "2016-03-10", "language": "en", "rating": 5}, {"id": 347767036, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d6206152-r347767036-Plaza_de_Toros_Monumental_de_Barcelona-Barcelona_Catalonia.html", "text": "I was in Plaza de los toros or Plaza Monumental de Barcelona, also known simply as La Monumental) was a square T golds in the city of Barcelona, Catalonia, Spain. It was the last bullring in commercial operation in Catalonia. It is situated at the confluence of Gran Via and Carrer Marina (Marina Street). It has a capacity of 19,582 within 26 rows of lines, boxes and bleachers on the first floor inside and upper dam around the buil cio.é a very beautiful place and always has many parrot near the square where I was in the square I could see them.\nthank you Barcelona", "publishedDate": "2016-02-14", "language": "en", "rating": 5}, {"id": 343335241, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d6206152-r343335241-Plaza_de_Toros_Monumental_de_Barcelona-Barcelona_Catalonia.html", "text": "After finding out about it on here and having a spare hour, I decided to visit. I was the only person there. After walking around the concourse you find the museum next to the old stables where the Bulls were kept. I was greeted by an elderly gentleman who gave me a personal tour of the museum, despite him speaking no English! After wandering around the museum on my own, I was told I was allowed to enter the bullring, a great experience that not many attractions in the city can rival. I highly recommend visiting, whether you agree or disagree with Bull Fighting. ", "publishedDate": "2016-01-28", "language": "en", "rating": 4}, {"id": 339967314, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d6206152-r339967314-Plaza_de_Toros_Monumental_de_Barcelona-Barcelona_Catalonia.html", "text": "The last active bullring in Catalonia, which was closed in 2011 after bullfighting was banned by local parliament, is magnificent architectural structure, built in 1914 as the world’s unique bullfight arena in Art-Nouveau style, although with a touch of Moorish and Byzantine influence. For 6 euros you can visit this large arena and the bullfighting museum which is today one of the largest public spaces in the city that can accommodate more than twenty thousand spectators.", "publishedDate": "2016-01-14", "language": "en", "rating": 4}, {"id": 326927615, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d6206152-r326927615-Plaza_de_Toros_Monumental_de_Barcelona-Barcelona_Catalonia.html", "text": "It isn't a well-publicised attraction but we noticed it on a bus ride along Grand Via de Corts Catalans. The architecture looks distinctly moorish with beautiful arches and tiles. I was in two minds weather", "publishedDate": "2015-11-15", "language": "en", "rating": 4}, {"id": 322743083, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d6206152-r322743083-Plaza_de_Toros_Monumental_de_Barcelona-Barcelona_Catalonia.html", "text": "Came across this by accident but if you have a vivid imagination - you were transported back into a bygone era of matador versus bull. If you have time on you hands this is well worth a visit. ", "publishedDate": "2015-10-28", "language": "en", "rating": 4}, {"id": 314437472, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d6206152-r314437472-Plaza_de_Toros_Monumental_de_Barcelona-Barcelona_Catalonia.html", "text": "We went to this building a little of cuff and didn't know what to expect . As we walked through the gates an old man sat on a chair soaking up the sun..can we come in? I asked..he just stood up walked up to us muttering 12€.... Strange greeting to this attraction , we paid and he gave us a ticket as he ushered us away....well what can I say, the place was incredible, I think we were the only people in there , a whole arena to ourselves, you can go into the stands , walk in the conclaves and walk into the centre of the arena and imagine what it would be like to be a bullfighter. There is a museum area with the history of the place, costumes , posters , bulls heads etc etc..again there was a strange man just sat at the entrance , didn't say a word and presumed he must of lost a lot of money that same day as the other miserable man! But hey , this doesn't take away from the visit, I would defo go back and suggest it to anyone, very interesting , no one else there and at 6€ each to go in ...well that not much for a good hour and halves exploring.", "publishedDate": "2015-09-28", "language": "en", "rating": 5}, {"id": 314267916, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d6206152-r314267916-Plaza_de_Toros_Monumental_de_Barcelona-Barcelona_Catalonia.html", "text": "The entry fee is only 6euros and there is a small museum dedicated to the performances once held here. We even met a retired Matador on the day we visited.", "publishedDate": "2015-09-28", "language": "en", "rating": 4}, {"id": 306160169, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d6206152-r306160169-Plaza_de_Toros_Monumental_de_Barcelona-Barcelona_Catalonia.html", "text": "While walking back from visiting Gaudi masterpieces we stumbled across this gem!! Very inconspicuous, without any fanfare, we didn't even know it was open until we started wandering in. Only 6 euro gets you into this amazing 'decommissioned' bullring with hardly any other visitors!! Well, the acting juices begin to flow and next thing you know you are putting on your own show :).\nAn amazing unsung attraction - just don't tell too may people or else it will become crowded!", "publishedDate": "2015-09-01", "language": "en", "rating": 5}, {"id": 301833301, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d6206152-r301833301-Plaza_de_Toros_Monumental_de_Barcelona-Barcelona_Catalonia.html", "text": "We decided to go to visit La Monumental only after seeing it mentioned on Trip Advisor, and we were so glad we did. It's a huge place - hard to believe that so many people would go to watch bull fighting, but once you visit the small museum, to look at the costumes and the posters, then you realise that this is a relic from a bygone age, before television (and football) took the place of more traditional entertainment. Even in it's current state (empty and slowly decaying), it's very impressive, and well worth a visit. \nJust a few euros to get in, and a small tip to the 'curator' - this was the cheapest attraction in the city, but probably one of the best. An hour well spent.", "publishedDate": "2015-08-21", "language": "en", "rating": 4}, {"id": 298840829, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d6206152-r298840829-Plaza_de_Toros_Monumental_de_Barcelona-Barcelona_Catalonia.html", "text": "Of course it is not a top attraction. But it is nice to visit. Inside is the museum with many costumes,posters and pics. And there are not many tourists.", "publishedDate": "2015-08-13", "language": "en", "rating": 4}, {"id": 297868133, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d6206152-r297868133-Plaza_de_Toros_Monumental_de_Barcelona-Barcelona_Catalonia.html", "text": "It is good to visit it during the walk to the beach. This picturesque building also can be visited, the entrance fee is 6 euros, but we didn´t do it.", "publishedDate": "2015-08-11", "language": "en", "rating": 3}, {"id": 283068102, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d6206152-r283068102-Plaza_de_Toros_Monumental_de_Barcelona-Barcelona_Catalonia.html", "text": "We came across this by chance - but seeing the bull fighting ring was  amazing. We wouldn't have come to a bull fight, but walking into the arena you got a sense of the scale and emotion that would have been there - only a few years ago (2011 was the last fight here). \n\nOpening times are fluid - 10-14, 16-19 - but you need to be a bit flexible - as we turned up at 1600 and it opened 15 minutes later! But our patience was rewarded. \n\nThere were 2 gentlemen who were on the gate, one of whom very proudly took us through to the museum and unlocked the doors for us. He explained in Spanish how he was part of the family, pointing to a photo from 1948 which had someone looking almost identical to him standing by a matador. He was clearly very proud of his links with the history. \n\nAnd then we just wandered around! Looking at the costumes through the ages, and the posters and the heads of some of the famous bulls.\n\nBut hold your breath for entering the ring! Its a huge amphitheater with raked seats all around. Close your eyes and listen to the noise of the crowd, the racing hooves of the bulls. Climb to the top of the seating and look down and its amazing. But perhaps be thankful that the bloodshed doesn't happen still. \n\nThis place is not well known, it seems on the tourist trail, and there are apparently discussions to turn it into a mosque. Don't expect a slick museum with lots of multimedia - this is a raw travel experience. So our advice is find it whilst you can, pay the 6 euros entrance, explore and listen to the stories. It's not our history or tradition but it was part of Catalonia's. Its a chance to learn some of their story.", "publishedDate": "2015-06-26", "language": "en", "rating": 4}, {"id": 279659145, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d6206152-r279659145-Plaza_de_Toros_Monumental_de_Barcelona-Barcelona_Catalonia.html", "text": "This was \"nice To see\" place, if you have time left,  and ewerything else is done. Stuff don't speak English at all, and they are not very kind. Museum is interesting,  but not \"wow\" experience. Not my favourite place here in Barcelona. ", "publishedDate": "2015-06-12", "language": "en", "rating": 3}, {"id": 278412120, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d6206152-r278412120-Plaza_de_Toros_Monumental_de_Barcelona-Barcelona_Catalonia.html", "text": "I went to a bullfight in this ring in 1964 so was surprised to recognise it when we came across it. It wasn't somewhere I had planned to visit or even knew that it existed but the short visit was great. You get a feeling of the place and how it was in its day. Thankfully no longer in use but a history to a Spanish tradition. ", "publishedDate": "2015-06-06", "language": "en", "rating": 4}, {"id": 273446920, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d6206152-r273446920-Plaza_de_Toros_Monumental_de_Barcelona-Barcelona_Catalonia.html", "text": "Well the museum part of this tour is a joke.  It's 2 small rooms with very similar items, and at no point did we get the WOW factor.  The arena is where the fun was, climbing up the bleachers and walking out into the middle of the historic bullfighting ring to stand on the sand that was once dominated by local heroes.  $6/per person, still not sure it was worth the money.", "publishedDate": "2015-05-20", "language": "en", "rating": 3}, {"id": 263553523, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d6206152-r263553523-Plaza_de_Toros_Monumental_de_Barcelona-Barcelona_Catalonia.html", "text": "This is not only a monument but also an observation deck. A great place for photographers. View is beautiful.", "publishedDate": "2015-04-04", "language": "en", "rating": 4}, {"id": 261339256, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d6206152-r261339256-Plaza_de_Toros_Monumental_de_Barcelona-Barcelona_Catalonia.html", "text": "This was once a place with screaming crowds. The building is a fantastic piece of architecture, there is nothing like it except in other Spanish towns. What is missing is the smells and the athmosphere. I am not a fan of bullfighting but I always remember the smells and the shouting crowds.\n\nIt is now a museum and you can visit. It is open I think every day including the weekends. You cannot vitis the whole building unfortunately which is a pity.\n\nI would recommend visiting just to have an idea of how impprtant bull fighting was in this region. It is still practices in other regions of Spain and souther France.", "publishedDate": "2015-03-23", "language": "en", "rating": 5}, {"id": 256501514, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d6206152-r256501514-Plaza_de_Toros_Monumental_de_Barcelona-Barcelona_Catalonia.html", "text": "This is a great little place to soak up the once thriving atmosphere of the bull fight. There is a small exhibition of bullfighting, with posters, costumes and even fallen bulls heads on the walls! To be able to walk around the stadium, both in the stands and on the hallowed sands of the ring are something else. Agree or disagree with the sport itself, this is still a cultural gem that shouldn't be overlooked.", "publishedDate": "2015-02-26", "language": "en", "rating": 4}, {"id": 254654064, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d6206152-r254654064-Plaza_de_Toros_Monumental_de_Barcelona-Barcelona_Catalonia.html", "text": "The visit is worth if you have interest in bull fighting or simply if a history buff. Though there are no more live fights (as far i came to knew), its museum is worth a visit. Its huge and can sit many a thousands, and one has to imagine how exhilarating the crowd would have been with a fight on.", "publishedDate": "2015-02-17", "language": "en", "rating": 4}, {"id": 252055388, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d6206152-r252055388-Plaza_de_Toros_Monumental_de_Barcelona-Barcelona_Catalonia.html", "text": "We really enjoyed viewing this piece of Barcelona history. The facility is showing its age but it still has a lot of character and I could still easily imagine the fights out in the main ring. The fighters clothing display was also very well done although quite small. Most of all this attraction seemed little visited thus giving good opportunity for photographs.", "publishedDate": "2015-02-01", "language": "en", "rating": 5}, {"id": 241848319, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d6206152-r241848319-Plaza_de_Toros_Monumental_de_Barcelona-Barcelona_Catalonia.html", "text": "We weren't originally going to visit this attraction but we are incredibly glad we did! It cost 6 euros each and was amazing to imagine what it may have been like to stand in the bull ring and have thousands of eyes watching over your every move. The museum was a nice little touch but the best part was definitely having free reign of the bullring and stadium. Would recommend this to anyone.", "publishedDate": "2014-11-28", "language": "en", "rating": 5}, {"id": 230678561, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d6206152-r230678561-Plaza_de_Toros_Monumental_de_Barcelona-Barcelona_Catalonia.html", "text": "This disused bullring was the majestic bullfighting temple in Barcelona from 1914 until 2011. There are supposedly moves a foot to convert the bullring into a 40,000 capacity mosque - the biggest in Europe if the city council approves the project.\nBecause of its large seating capacity of nearly 20,000 seats it has hosted concerts of many celebrities such as the Beatles, Tina Turner, Rolling Stones and Bob Marley. \nThe La Monumental as it is commonly known, is still home to the \"Bullfighting Museum of Barcelona\".  The museum is small but provides an interesting history of bullfighting in Barcelona. It displays costumes of famous bullfighters, actual heads of famous bulls and other items related to bullfighting.  \nWe visited late in the afternoon (4pm) and practically had the whole place to ourselves.  It was quite eerie yet very impressive to see the inside of this amazing architectural wonder.  \nGet along to see it before it disappears for good.", "publishedDate": "2014-09-24", "language": "en", "rating": 5}]}}]