[{"locationId": 6412469, "name": "Edge Brewing", "placeType": "ATTRACTION", "reviewListPage": {"reviews": [{"id": 752797121, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d6412469-r752797121-Edge_Brewing-Barcelona_Catalonia.html", "text": "We are in lockdown now for almost 6 weeks and the wonderful chaps at Edge have given us an amazing service and made lockdown a better experience. If order early even same day delivery straight from the cold room of the brewery. We are working our way through all of the beers and while we have personal faves all are extremely well made. A good range of styles and flavours that are always well balanced (and Less important but also  good concepts and designs for each beer). Top marks to Edge. 10/10 Cheers!", "publishedDate": "2020-04-21", "language": "en", "rating": 5}, {"id": 719829203, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d6412469-r719829203-Edge_Brewing-Barcelona_Catalonia.html", "text": "Flew into Barcelona for 8 evenings in Spain and this was our first stop after checking into the hotel. Had emailed with Esther in the prior weeks and she had arranged a meeting since we would be at other locations in Spain during the normal open hours. Such a great visit. It had started to rain as soon as we arrived so we spent the next 2 hours sampling beers and having great conversation with Esther and her husband Jose who had let us in. Will always remember this good time!", "publishedDate": "2019-10-20", "language": "en", "rating": 5}, {"id": 690142733, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d6412469-r690142733-Edge_Brewing-Barcelona_Catalonia.html", "text": "Whilst in Barcelona I noticed there was an open night at the brewery, they do this and organise other activities if you check the website. Introduced to the head brewer and sampled some excellent beers, good bbq and overall an excellent evening spent with some nice people. \nAnd the Best Neipa I’ve tasted. ", "publishedDate": "2019-07-16", "language": "en", "rating": 5}, {"id": 655820612, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d6412469-r655820612-Edge_Brewing-Barcelona_Catalonia.html", "text": "A favorite found: Hoptimista.\nFlavors combined with hop aroma is perfect.\nStrongly recommend a visit to El Duende tasting their beer.", "publishedDate": "2019-03-02", "language": "en", "rating": 5}, {"id": 645958550, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d6412469-r645958550-Edge_Brewing-Barcelona_Catalonia.html", "text": "Accidently found this places and visited every single night in our trip. Very nice brewed, there are nice choices", "publishedDate": "2019-01-15", "language": "en", "rating": 5}, {"id": 630326085, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d6412469-r630326085-Edge_Brewing-Barcelona_Catalonia.html", "text": "This is the first trip advisor post I’ve given but felt it deserved it. We were made to feel very welcome. The team that showed us round were clearly passionate about the brewery and loved what they did. We got to taste lots of different beers and they made us feel right at home, we also both learnt a lot about the brewing process. I would definitely recommend this. Thanks to all Edge Brewing! ", "publishedDate": "2018-11-02", "language": "en", "rating": 5}, {"id": 625325264, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d6412469-r625325264-Edge_Brewing-Barcelona_Catalonia.html", "text": "Can’t wait for Edge to start flowing in Tryon, North Carolina.!  Not long now!🎃 I love what the owner’s mission is to “save horses, one beer at a time!”  Kudos! Thanks for what your doing as well as creating an awesome brew! \nMarty", "publishedDate": "2018-10-16", "language": "en", "rating": 5}, {"id": 619723828, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d6412469-r619723828-Edge_Brewing-Barcelona_Catalonia.html", "text": "I visited Barcelona Years ago, well before this brewery started brewing American craft beer. But I tried Hop Timista with a buddy of mine in Athens and our consensus was unanimous. It’s probably the worst American craft beer we have ever tried. And we have tried 100s, and at least a dozen IPAs while in Greece! Skip this one!!", "publishedDate": "2018-09-26", "language": "en", "rating": 1}, {"id": 619641909, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d6412469-r619641909-Edge_Brewing-Barcelona_Catalonia.html", "text": "Actually they brew the best craft beers worldwide and I'm not an insider and this is not a joke. A tasteful, gorgeous, stunning beers, offered with creative packaging and a great customer service if you want to buy some boxes from them. You can also visit their brewing installations and taste their beers before buying ‘em. I'm quite an expert in craft beers and Edge is actually the best crafts worldwide. Indeed...they're Americans so they know how to do craft beer!", "publishedDate": "2018-09-26", "language": "en", "rating": 5}, {"id": 569341572, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d6412469-r569341572-Edge_Brewing-Barcelona_Catalonia.html", "text": "Hidden in an industrial unit, you have to be on a tasting to come in. It wasn't amazing. Wish they spent a little longer on the tour. You get £15 of beer, so the tour costs £5.", "publishedDate": "2018-03-28", "language": "en", "rating": 5}, {"id": 561300110, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d6412469-r561300110-Edge_Brewing-Barcelona_Catalonia.html", "text": "The only negative you can say is that its not in a really tourist area so its quiet when you get off the metro and you feel you might be in the wrong place especially if you turn up early.  That's not their fault though and once you know you are in the right place they are great hosts and you get to taste some great beer and the hosts give their recommendations of where to go for beer afterwards so are really helpful. There is a wide range beers and get some good insight into their brewing.", "publishedDate": "2018-02-18", "language": "en", "rating": 5}, {"id": 549367971, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d6412469-r549367971-Edge_Brewing-Barcelona_Catalonia.html", "text": "We came here as travelers during the San Juan festival of 2017 and were luckily invited to a private party at the brewery. This place is operated by the loveliest of people, to say the least. They made us feel like we were part of their brewery family. We tasted each beer they had on tap and I can honestly say I enjoyed the delicious differences in each and every one of them! I highly recommend this place to anyone that enjoys craft brews and great vibes!", "publishedDate": "2017-12-26", "language": "en", "rating": 5}, {"id": 476123393, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d6412469-r476123393-Edge_Brewing-Barcelona_Catalonia.html", "text": "It’s only open on Fridays... which was clear to us only after our visit on Saturday night. We thought it was open as I didn’t check the opening hours before heading to the brewery. There were some crowd hanging in front of the building so we just walked right in. It looked very nice as I’m a big fan of American style brewery pubs. After the second round I was getting a bit suspicious and asked if it was a private party... and it was. We were crashing a private party... how embarrassing... But the beers were so great and I had some ticks left we decided to stay. We had a secret deal with the bartender... But the situation got even more awkward when the birthday boy was about to arrive. Everybody was cheering and very enthusiastic and we were trying to be as unnoticeable as possible... When the man of the hour was going around and hugging everybody I thought now we’re screwed... and then I saw a chance for us. He was getting closer to the other end of the bar... we hit the door which was unfortunately a huge door which took like minutes (that’s what it felt like) to open... but we made it. A truly great place. Absolutely great brews and brilliant staff.", "publishedDate": "2017-04-16", "language": "en", "rating": 5}, {"id": 445869170, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d6412469-r445869170-Edge_Brewing-Barcelona_Catalonia.html", "text": "Amazing experience a about the process of making craft beer excellent beers in the heart of Barcelona it's a most visiting you like good beer", "publishedDate": "2016-12-21", "language": "en", "rating": 5}, {"id": 429651081, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d6412469-r429651081-Edge_Brewing-Barcelona_Catalonia.html", "text": "Opens only on Fridays afternoons and you have to add your name in their website to be at the door list, but is so worth it. The selection of beers is vast from Sours to Ales to IPAs, APAs, they brew every kind. The staff is really friendly and you can have a tour around the brewery itself. If you like beer this is a paramount place to visit.", "publishedDate": "2016-10-19", "language": "en", "rating": 5}, {"id": 389123731, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d6412469-r389123731-Edge_Brewing-Barcelona_Catalonia.html", "text": "I just celebrated 4th of July in this pretty cool place. They have the brewery right there, a bar and a small patio in the back. The beer was fantastic, some very interesting IPA, PALE ALE, etc. It could have been a bit colder for my taste, especially in the summer a pint gets warm pretty quick. Overall, nice, and I will definitely go back ! Go, explore and enjoy.", "publishedDate": "2016-07-04", "language": "en", "rating": 4}, {"id": 381435792, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d6412469-r381435792-Edge_Brewing-Barcelona_Catalonia.html", "text": "Don't forget to make a reservation by mail when you plan to go there.\n\nOnce you are there you experience a very easy going vibe in an industrial environment. You can walk in the brewery (with or without a guide), have a chat with the staff and drink a few beers.\n\nRecommends is the taste platter with 4 different beers. It seems that a lot locals know to find this place.\n\nCheers!\n\n", "publishedDate": "2016-06-10", "language": "en", "rating": 4}, {"id": 376817708, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d6412469-r376817708-Edge_Brewing-Barcelona_Catalonia.html", "text": "My friends and I booked a tour of the brewery with Robin.  While the tour itself wasn't extensive due to the size of the facility, Robin was very knowledgable and taught us a lot about the beer-making process.  He was also incredibly generous with the sample, and the beer itself was great.  A fun time had by all!", "publishedDate": "2016-05-26", "language": "en", "rating": 5}, {"id": 375700046, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d6412469-r375700046-Edge_Brewing-Barcelona_Catalonia.html", "text": "We were a group of friends looking for something chilled out and fun to do early evening in Barcelona.  The space is great, with a cool bar and outside seating area.  Robin was a great guide, talked us through the process of making the beers and also lead the tasting.  \n\nThe beers themselves are awesome and you can definitely spend a good couple of hours here.  The whole thing is very relaxed and there's no pressure to move on after the tour and tasting officially ends - we sat outside and enjoyed a few more beers.  Robin also gave us a few good ideas for where to head afterwards.\n\nYou can contact them through their website to arrange group tours or book onto one of their tasting evenings.  All in all a must do if you enjoy craft beer and want to head somewhere beyond the touristy areas.", "publishedDate": "2016-05-23", "language": "en", "rating": 5}, {"id": 350382162, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d6412469-r350382162-Edge_Brewing-Barcelona_Catalonia.html", "text": "Thankfully, I was introduced to this place while I was in Barcelona.  I was really craving a good craft beer.  I am a fan of good IPA's a and I found it here!  A Colorado based brewery that opened this location in Spain.  My favorite IPA here is the 7even Edge 7sword!  The tasting room is only open on Friday evening and they also bring in a local restaurant in to cook on site when you get hungry... and YOU WILL... so bring cash!  A large and open warehouse space.  Come for the beer and stay for the human sized Jenga!  We stayed here for hours talking and enjoying the beer!  This place definitely quenched my thirst for the Craft Culture back home in San Diego!", "publishedDate": "2016-02-23", "language": "en", "rating": 4}, {"id": 342661509, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d6412469-r342661509-Edge_Brewing-Barcelona_Catalonia.html", "text": "We booked onto a tour and are so so happy we did! The beers were absolutely outstanding, every single beer we had was excellent. I've never been a big fan of IPAs but theirs were amazing. Even better than that Robin (tour guide) was informative, friendly and recommended some great other places for us to visit. If you love beer you have to visit! ", "publishedDate": "2016-01-25", "language": "en", "rating": 5}, {"id": 339096823, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d6412469-r339096823-Edge_Brewing-Barcelona_Catalonia.html", "text": "Did a Friday night, after work thing here in the summer - a bit out of the centre of town but absolutely worth it.  Great beer and very friendly staff.  Could have done with a few more food trucks but otherwise, worth a visit.", "publishedDate": "2016-01-11", "language": "en", "rating": 4}, {"id": 328656282, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d6412469-r328656282-Edge_Brewing-Barcelona_Catalonia.html", "text": "The open night was a chilled out and relaxed affair. We arrived, sampled a few beers, then walked through the production area and were given a run down of operations and then we tasted a few more beers. Good attraction in Barcelona.", "publishedDate": "2015-11-23", "language": "en", "rating": 4}, {"id": 327779727, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d6412469-r327779727-Edge_Brewing-Barcelona_Catalonia.html", "text": "Had the pleasure of attending the brewery evening(every friday)- great array of beer choice supplemented by great street food- could do a brewery tour if you wanted", "publishedDate": "2015-11-19", "language": "en", "rating": 4}, {"id": 323526632, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d6412469-r323526632-Edge_Brewing-Barcelona_Catalonia.html", "text": "When you get burnt out on Cava, give this place a visit, it has the best craft beers in Barcelona,\nA little hard to find but worth the effort my wife had the Red and I tried the American Blond.does not get much better than that!\nDid the Brewery tour its free and fun,", "publishedDate": "2015-10-31", "language": "en", "rating": 4}, {"id": 312013012, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d6412469-r312013012-Edge_Brewing-Barcelona_Catalonia.html", "text": "The staff knew everything about beer brewing and were so friendly.\nOnly cost 15 euros and I would have happily paid more.\nPlenty of beer to taste and Robin even gave us recommendations on where to eat (Black Lab - the best food in Barca!)", "publishedDate": "2015-09-20", "language": "en", "rating": 5}, {"id": 309219938, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d6412469-r309219938-Edge_Brewing-Barcelona_Catalonia.html", "text": "The brewery was state of art compared to the majority of breweries in the UK. A real spectacle for anyone in the beer scene!\n\nThe beer was also ace. I thought the branding of the beer Padrino was a class touch.\n\nAnd Robin from Edge was very nice and took me into Barcelona for a beer afterwards", "publishedDate": "2015-09-11", "language": "en", "rating": 5}, {"id": 292745630, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d6412469-r292745630-Edge_Brewing-Barcelona_Catalonia.html", "text": "The tour was excellent, worths the money without doubt. Who ever tried homebrewing, or intends to try, must go to this place. You can find inspiration there.\n      ", "publishedDate": "2015-07-26", "language": "en", "rating": 5}, {"id": 292725096, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d6412469-r292725096-Edge_Brewing-Barcelona_Catalonia.html", "text": "Had a great tour with informative guide and lots of beer ☺. Not to big group (maybe 10 people). Only 15euros, and possible to buy Great and cheap beer to bring back home. Recommended! ", "publishedDate": "2015-07-26", "language": "en", "rating": 5}, {"id": 292035012, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d6412469-r292035012-Edge_Brewing-Barcelona_Catalonia.html", "text": "I had the opportunity to get a tour from both Scott and Alan while sampling a variety of beers.  The atmosphere is great, the beers are spot on, and these guys know their stuff.  If you are in Barcelona, I highly recommend stopping in to get a pint/growler and to see the brewery operation.", "publishedDate": "2015-07-24", "language": "en", "rating": 5}, {"id": 290679836, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d6412469-r290679836-Edge_Brewing-Barcelona_Catalonia.html", "text": "On a recent trip to Barcelona, I had made a promise to myself to try and visit this brewery after lots of recommendations from local bottle shop and breweries in Manchester. However, my wife and I weren't able to get there until Friday - the day before we were due to fly back to the UK. Unfortunately the brewery was closed to the public on Fridays now. I was pretty bummed out about it to be fair, however I spot a member of staff sweeping up outside and asked where I could get some bottles from locally, having not seen any in my week in the city. The fella I spoke too (who's name I didn't catch was) was brilliant. We had a brief chat, and rather than try and give me directions, offered to sell me some bottles there and then. HUZZAH! It was amazingly good of him to hook me up and I really am very grateful. The brewery space looked great, and I managed a small look at their tap room. Shame I couldn't drop by during opening hours, but the beers are exceptionally good and I would thoroughly recommend this brewery to anyone remotely interested in beer.", "publishedDate": "2015-07-20", "language": "en", "rating": 5}, {"id": 290660228, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d6412469-r290660228-Edge_Brewing-Barcelona_Catalonia.html", "text": "The tour of the brewery was interesting and you get to taste several of their beers. I wen't solo, but all the other groups that was on the tour was nice people, and the guide was superb! Will probably try to do this again the next time I visit Barcelona.", "publishedDate": "2015-07-20", "language": "en", "rating": 5}, {"id": 289768871, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d6412469-r289768871-Edge_Brewing-Barcelona_Catalonia.html", "text": "For a mere 15 euro we were treated with four healthy thirds of tasty craft goodness. Each one followed a talk on the processes and ingredients used. We were then given a tour of the brewery which gave an insight into the workings of the brewery. After this we were encouraged to ask questions and were then given a pint of which ever beer took our fancy. I can highly recommend the tour to anyone and it was a great opportunity to meet others interested in the craft scene. A big thanks to Robin and the team and I would definitely visit again", "publishedDate": "2015-07-17", "language": "en", "rating": 5}, {"id": 289649095, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d6412469-r289649095-Edge_Brewing-Barcelona_Catalonia.html", "text": "Edge Brewing are one of the leaders of the craft beer revolution in Barcelona. Estabilished in 2013 by two Americans who were keen to bring the American craft beer scene to Barcelona. The staff are passionate about their product. Head brewer Alan Sheppard is a real character! \nWe decided to visit the brewery whilst in Barcelona for the MotoGP, unfortunately because of our schedule at the circuit de Barcelona we were unable to attend the usual Saturday tour. This was no problem as Robin at the brewery arranged to accomodate us amongst a 'private' tour he was hosting on the Friday. The tour was informative & very interesting & there was plenty of beer to sample! This included at least four different brews of which you could conclude you visit with a pint of your favourite. Robin was also very knowlegeable of the craft beer scene in Barcelona & advised on all the best bars to visit, of which there were some real gems!\nI would throughly recommend a vist to Edge Brewing whilst in Barcelona, it's extremely easy to get to, virtually on top of Bogatell station & within easy walking distance of the Olympic Port.", "publishedDate": "2015-07-16", "language": "en", "rating": 5}, {"id": 289594684, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d6412469-r289594684-Edge_Brewing-Barcelona_Catalonia.html", "text": "We had a wonderful time at Edge Brewing. As Americans living in Germany, we miss the world of craft beer. We were very excited to see the Brewery and taste some good beer. We were not disappointed! This is a great experience in a fun city.", "publishedDate": "2015-07-16", "language": "en", "rating": 5}, {"id": 288182341, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d6412469-r288182341-Edge_Brewing-Barcelona_Catalonia.html", "text": "My wife and I came by the brewery on Friday as we were I. The area.  We met Alan(head brewer) and Robin out front.   They gave us the time for the tour on Saturday and told us about a local craft brewing festival a few towns away.   We weren't able to got to the festival, but we did come back for the tour.   ***note, email ahead for the time of the tour.  We had a pretty large group of folks there when we arrived but Robin did the tour and did a great job.   It was a mix of people that knew a ton about brewing and some who had seen a brewery for the first time.  Robin was great with the whole group.  We were able to sample most of their beers, which were all very good.  It was a present break fro the San Miguel and Estrella that is served everywhere else.\n\nI think we were there about 2 hours between the tour and the tasting and it felt like no time at all.  We will go back and visit the brewery again when we return the Barcelona and certainly look for their beer in bars and the store!\n\nOf note, this is in my top five things to do in Barcelona.", "publishedDate": "2015-07-12", "language": "en", "rating": 5}, {"id": 283375719, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d6412469-r283375719-Edge_Brewing-Barcelona_Catalonia.html", "text": "Slight mess up with our brewery tour, but Alan stepped in and gave us an impromptu tour and a tasting of some truly good beers. Really nice guy and a great place, we'll be coming back.", "publishedDate": "2015-06-27", "language": "en", "rating": 5}, {"id": 278489949, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d6412469-r278489949-Edge_Brewing-Barcelona_Catalonia.html", "text": "Had a great tour of the brewery on Saturday, discussing different craft breweries and comparing notes! We were lucky to have a small group which made it very personalized and we certainly got great value.\n\nThe tour includes four good sized tasters plus a pint of your choice. It's listed as a 2 hour tour but we weren't rushed and we were really able to chat with Robin from the brewery.\n\nDefinitely recommend if you're in Barcelona, such a change from the endless Spanish lagers!", "publishedDate": "2015-06-07", "language": "en", "rating": 5}, {"id": 266762245, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d6412469-r266762245-Edge_Brewing-Barcelona_Catalonia.html", "text": "I'd been to Edge a few times before, and always had a great time, so when organising a friends stag do, having just seen they'd started tours and tastings on Saturdays, thought it could be a great option. \n\nWe weren't disappointed! \n\nAs well as being very informative, it was great value, with a flight of four beers to \"taste\", plus a pint of your choice included with the entrance price. \n\nRobin is clearly very knowledgeable and passionate about beer and the brewing process, and this comes across. \n\nThe beers themselves are always excellent too which helps!", "publishedDate": "2015-04-20", "language": "en", "rating": 5}, {"id": 263939303, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d6412469-r263939303-Edge_Brewing-Barcelona_Catalonia.html", "text": "It was fun to be part of the first COME EXPLORE experience.  I went for my boyfriend but ended up enjoying it as much as he did. Learnt lots about beer, its ingredients and different flavour possibilities, the process, and so on...Lots to take in!  The staff were very knowledgeable and friendly.  The beers were really different. We even tasted a beer fresh from one of the tanks. The place is also really cool and easy to get to - we walked there from the beach. So really was worth a visit.", "publishedDate": "2015-04-06", "language": "en", "rating": 5}, {"id": 261734049, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d6412469-r261734049-Edge_Brewing-Barcelona_Catalonia.html", "text": "I didn't like beer until my boyfriend insist that a I have to try artesian beer! It's another world of beer, a world of taste I have never tried before! I LOVE BEER NOW! Ale, summer ale, Ipa, Porter, my favorite the Fort it's an oatmeal porter! Now you can find most of this beers made in the heart of Barcelona in some specialized bars, but there's nothing like coming on a Friday night (when the factory opens to the public) and grab a beer in the middle of everything! Really cool ambient ", "publishedDate": "2015-03-25", "language": "en", "rating": 5}, {"id": 259713444, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d6412469-r259713444-Edge_Brewing-Barcelona_Catalonia.html", "text": "We spent a really good couple of hours here on their open night held on a Friday.\n\nLoved trying the ales and beers and the atmosphere was great with a lovely mixture of tourists and locals. Staff were really friendly\n\nThere was a local food stall selling burgers - just a really cool vibe and something different out of the hustle and bustle of downtown Barcelona\n\nDidn't do the tour but by the looks of things they were enjoying themselves too\n\nIts a little out of town but theres a metro stop just nearby - definitely worth the effort!", "publishedDate": "2015-03-16", "language": "en", "rating": 5}, {"id": 259646189, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d6412469-r259646189-Edge_Brewing-Barcelona_Catalonia.html", "text": "If you like craft beer you must stop by and see the crew at Edge Brewing.  Their beer is very good and they have some guest taps too.  There are food vendors serving up some tasty food.  The whole place is cash only, so bring your Euros.\n\nThe vibe is very energetic, it feels like a neighborhood place even though it is in a warehouse.  The first night we went they were slammed and it took quite some time to get a beer but the servers are super friendly.", "publishedDate": "2015-03-15", "language": "en", "rating": 5}, {"id": 252094852, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d6412469-r252094852-Edge_Brewing-Barcelona_Catalonia.html", "text": "If you're a fan of craft beer, then this is a great way to spend a Friday night. They open the doors to the public at 6pm (I think) and there's a 10-tap setup, great food and a cool vibe.  They do tours of the brew facility too on the night (in 3 different languages), so you can really quiz them about their growth.  These guys make lovely beer too.  They were voted best new brewery in the WORLD a few days before I visited, and deservedly so.", "publishedDate": "2015-02-01", "language": "en", "rating": 5}, {"id": 234126168, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d6412469-r234126168-Edge_Brewing-Barcelona_Catalonia.html", "text": "Excellent place for all of craft beer lovers! \nGood prices and close to metro station. Staff is very nice.", "publishedDate": "2014-10-13", "language": "en", "rating": 5}, {"id": 234025994, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d6412469-r234025994-Edge_Brewing-Barcelona_Catalonia.html", "text": "My wife and I visited Barcelona in August, and one of my aims was to suss out the growing beer scene in the region.  Overall, we were a little disappointed in what we saw but Edge Brewing  was a delightful change.\n\nThey have an 'Open Doors' event on a Friday, but we weren't there on a Friday.  Following an exchange of emails, we were told to just pop along one particular afternoon and we could visit the brewery.\n\nWe arrived, wandered in and were met by Alan who showed us the shiny new brewery equipment.  We had a quick chat about what he was trying to do with the brewery before heading to the bar.  Yum.\n\nThey had no less than 10 of their own beers on tap, with a similar range available at the open doors event.  We tried all of the beers available before settling on a couple of large ones of the ones that we enjoyed.  I don't generally make notes on the beers I've tried but they were all in excellent condition and a good range of styles.  Too many breweries concentrate on just one style of beer - generally pale and hoppy these days but not at Edge.\n\nAll in all, a great afternoon chatting with Allan (and the brewery assistant whose name escapes me!) sampling probably the best of the beers we'd tried while we were in Barcelona.\n\nKeep up the good work!", "publishedDate": "2014-10-12", "language": "en", "rating": 5}, {"id": 231223137, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d6412469-r231223137-Edge_Brewing-Barcelona_Catalonia.html", "text": "Off the regular beaten path,easy to get to with the subway,just a few steps from where u come up from the subway,it's just around the corner.\nGood beer and nice staff,local people seems to enjoy it,cheap beer with the optional of buying food from a food truck every friday.\nWorth a wisit if you enjoy beer&making of beer.", "publishedDate": "2014-09-27", "language": "en", "rating": 4}, {"id": 228615934, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d6412469-r228615934-Edge_Brewing-Barcelona_Catalonia.html", "text": "Edge Brewing looks a lot like an american brewery. The typical American beer styles,  the brewery visit, the staff... everything remembered me the United States; just, in Catalunya. The quality of the products is pretty good although not surprizing: I guess that with more time, they'll start producing beers more related to the local terroir. Worth the visit on Friday evenings if you are around...", "publishedDate": "2014-09-13", "language": "en", "rating": 4}, {"id": 213793820, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d6412469-r213793820-Edge_Brewing-Barcelona_Catalonia.html", "text": "I rarely will ever hand out a 5.  It has to be very well deserved. \n\nThis startup brewery is killer, though.  Amazing to look at if your an enthusiast or just curious what a real brewery looks like. \n\nHead brewer Alan was mingling and great to talk to. \n\nBeer cost is reasonable if you buy in bulk ;).  4€ each for 5 tokens.  Sampler trays for 5€. \n\nCheck their schedule since they only open for the general tastings on Friday & Saturday.  But also heard that you can knock on the door at other times and if they are around you might get in ;)\n", "publishedDate": "2014-07-05", "language": "en", "rating": 5}, {"id": 208638511, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d6412469-r208638511-Edge_Brewing-Barcelona_Catalonia.html", "text": "The finst beer. Good bunch of lads. A unique experience in bcn. Feel priveledged to have been one of the first to taste this great beer.", "publishedDate": "2014-06-03", "language": "en", "rating": 5}, {"id": 207674169, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d6412469-r207674169-Edge_Brewing-Barcelona_Catalonia.html", "text": "What a cool spot! You can enjoy a super fresh beer and sit right there in view of the brewery. You can tell these people really care about beer. I follow them on FB and see a lot of events going on there and around town so it's a good way to keep up with the craft beer scene in Barcelona. I was there when the brewery first opened. I will certainly go back next time I visit to see what new things they have going on.", "publishedDate": "2014-05-28", "language": "en", "rating": 5}, {"id": 207651553, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d6412469-r207651553-Edge_Brewing-Barcelona_Catalonia.html", "text": "This is a fully operational brewery making craft beer the american way - its well worth a visit, I did a tour and you can learn all about how beer is made, see it brewing and taste some of their selections on tap. Friendly environment and friendly people sharing their passion, recommended for when you've had enough of estrella and sangria...", "publishedDate": "2014-05-28", "language": "en", "rating": 5}, {"id": 207312110, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d6412469-r207312110-Edge_Brewing-Barcelona_Catalonia.html", "text": "We had an amazing time and were really excited to discover American-style craft beers in Barcelona! Awesome atmosphere and really fun experience overall.", "publishedDate": "2014-05-27", "language": "en", "rating": 5}, {"id": 205168109, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d6412469-r205168109-Edge_Brewing-Barcelona_Catalonia.html", "text": "I didn't expect to find an American-inspired brewery on our Spanish holiday, but I'm definitely glad that I did! Great space, friendly people ... and awesome hopalicious beers, better balanced than most of the American beers that tend to be too much about the hops. I'd visit again the next time I'm in Barcelona.", "publishedDate": "2014-05-12", "language": "en", "rating": 5}, {"id": 202727967, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d6412469-r202727967-Edge_Brewing-Barcelona_Catalonia.html", "text": "In a quiet area in The street of lulle in Barcelona is a big door That leads into one of Barcelonas best craft breweries. The people you meet inside are a couple of americans who just happen to be The friendliest guys i have met while in town And Their beers which they make on site is Truly amazing. This is one of The places absolutely worth stopping by And checking out. IF you are lucky you will run into some of spains best smiles by The  name of Pepe And Xavi And a few others who work There. Just beautiful people. ", "publishedDate": "2014-04-25", "language": "en", "rating": 5}, {"id": 202431172, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d6412469-r202431172-Edge_Brewing-Barcelona_Catalonia.html", "text": "I'm a Barcelona resident and it's great to see this brewery taking shape here in the city. Great set up and great location not far from the beach and not too far from the Old Town. More importantly, enthusiastic people keen to share their knowledge of craft beer, brewing it and appreciating it. I was their for an event and really enjoyed hanging out in the tasting room there, trying their beers and one or two others they had on tap from other local breweries too.  New, different, and exciting to see and TASTE!", "publishedDate": "2014-04-23", "language": "en", "rating": 5}, {"id": 200181557, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d6412469-r200181557-Edge_Brewing-Barcelona_Catalonia.html", "text": "I was fortunate enough to visit Edge Brewing on the day of their opening celebration. I was very surprised at this classic American style brewery with a tasting room to match. They even had a great food truck for the event so good.Lots of great beers really loved the amber and was treated by the brewer to the new Hoptimista right off the tank what a treat.What a great place with a great feeling, The staff was great and really handled the crowd well. Cant wait to get back.and visit these Americans and see what they do next.", "publishedDate": "2014-04-07", "language": "en", "rating": 4}, {"id": 199037935, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d6412469-r199037935-Edge_Brewing-Barcelona_Catalonia.html", "text": "Love craft beer?  In Barcelona?  If yes, you must visit Edge.  Being there made me feel like I was back in a great craft brewery in the US.  The staff was super friendly and welcoming.  I'd give it six stars if I could!", "publishedDate": "2014-03-28", "language": "en", "rating": 5}, {"id": 198162541, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d6412469-r198162541-Edge_Brewing-Barcelona_Catalonia.html", "text": "Great place, great beer and funny people running this place. Despite not being fully open at the time of writing, it is possible to sneak in of a Friday and enjoy a few jars at Edge. I wasn't sure about craft beers because of price and more grown up taste, but I'm sold now after a couple of evenings of relentless drinking here and no hangover to report the next day. Can't wait until they open for real.", "publishedDate": "2014-03-21", "language": "en", "rating": 5}]}}]