[{"locationId": 265457, "name": "Anella Olimpica", "placeType": "ATTRACTION", "reviewListPage": {"reviews": [{"id": 752472154, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d265457-r752472154-Anella_Olimpica-Barcelona_Catalonia.html", "text": "During my visit to Barcelona, it was exciting to visit the Olympic Complex which was the site of the 1992 Summer Olympics. As expected, this is a massive complex which includes a stadium, sports hall and swimming pools. One item that stood out in its uniqueness is a spire-like structure that looked like a modernistic sculpture. I was surprised to learn that it is actually a communications tower that obviously was indispensable in the Summer of 1992. \n\nI learned that the complex is currently used for special events. However, the swimming pools are now open to the public for use.", "publishedDate": "2020-04-10", "language": "en", "rating": 4}, {"id": 738678728, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d265457-r738678728-Anella_Olimpica-Barcelona_Catalonia.html", "text": "This location offers a great view of the city and is a nice place to visit if you want to stroll around the park. The stadium is impressive although sadly falling into disrepair.", "publishedDate": "2020-01-12", "language": "en", "rating": 4}, {"id": 735537001, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d265457-r735537001-Anella_Olimpica-Barcelona_Catalonia.html", "text": "Such a wonderful place but very sad state of maintenance. I know it costs money but may be private companies can maintain such a place", "publishedDate": "2019-12-30", "language": "en", "rating": 3}, {"id": 735125872, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d265457-r735125872-Anella_Olimpica-Barcelona_Catalonia.html", "text": "The sports complexes on Montjuic are still in use almost 30 years after the Olympic games were held here in 1992 and its good to see the area being well maintained, easy to get to from behind the MNAC and its a good place to wander around enjoying the sights and views", "publishedDate": "2019-12-28", "language": "en", "rating": 4}, {"id": 721249570, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d265457-r721249570-Anella_Olimpica-Barcelona_Catalonia.html", "text": "On my last visit to Barcelona, there was a sporting event on so you could not get properly inside the Olympic park, but this time it was all open. It's beautiful and still pretty well cared for. The view from the hill over the city is fantastic and you can get some good photos of all the different architectural elements.", "publishedDate": "2019-10-25", "language": "en", "rating": 5}, {"id": 719813069, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d265457-r719813069-Anella_Olimpica-Barcelona_Catalonia.html", "text": "Much like the stadium that stands above it, this formally grand park now stands largely empty, as a reminder of a short-lived time gone by that will never come again.  This truly immense paved over space spreads out in front of the stadium and is dominated by the large white radio tower that now bears graffiti at its base. The walls of fountains that stand as the boundaries of each level are worn and weathered with age but still flow.  \n\nThe day we visited was a little dreary and overcast which only added to the melancholy feel of the place.  A scattered family here or dog walker there were the only other inhabitants of the space.  You could just imagine the crowds of people that once packed this venue on some hot Barcelona summer day during the height of the Olympics.  But no more.  Just a memory.  And some really ugly faux Greek columns with an unnecessary modernistic twist.", "publishedDate": "2019-10-20", "language": "en", "rating": 3}, {"id": 708869839, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d265457-r708869839-Anella_Olimpica-Barcelona_Catalonia.html", "text": "It was amazing place and nice to visit for a short time,to see the Olympic stadium and the whole Olympic facilities.", "publishedDate": "2019-09-11", "language": "en", "rating": 5}, {"id": 699579255, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d265457-r699579255-Anella_Olimpica-Barcelona_Catalonia.html", "text": "Visited this Historical Olympic venue earlier today, it must have been pretty impressive back in 1992 during the Summer Olympic Games (Games of the XXV Olympiad), however today it is looking run down and requires some upkeep to bring it back to its full former glory.\n\nWorth a visit.\n\n", "publishedDate": "2019-08-16", "language": "en", "rating": 3}, {"id": 689988843, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d265457-r689988843-Anella_Olimpica-Barcelona_Catalonia.html", "text": "This area was built for the 1992 Olympic Games and is located in the middle of the Parc de Montjuïc. It's high up on a hill although there's are escalators and public transport to make things a little easier. It's location give fantastic views of the city below.\n\nThe Olympic stadium is still here and well maintained, and the general area houses a series of amenities such as Palau Sant Jordi and the striking communications tower.\n\nIt's a bit of a trek to get there, but well worth it for the historical significance, and when combined with a visit to the general area of Parc de Montjuïc.", "publishedDate": "2019-07-16", "language": "en", "rating": 5}, {"id": 683162236, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d265457-r683162236-Anella_Olimpica-Barcelona_Catalonia.html", "text": "Barcelona were the pioneers in utilising the Olympic Games to regenerate run down parts of the city.  They did a great job.\n\nIf you like sport and sporting history the Anella Olimpica is well worth a visit.  The views are stunning and the site is compact.  If there is no event on then entry to the stadium is free.  \n\nJust down the road is the Olympic Museum; well priced and full of memorabilia (where's our one in London Sadiq?).", "publishedDate": "2019-06-21", "language": "en", "rating": 5}, {"id": 675992371, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d265457-r675992371-Anella_Olimpica-Barcelona_Catalonia.html", "text": "I don’t know about the monument itself, but the park it is in is clean, spacious, and surrounded by palaces, museums, and lots of greenery. Lovely for a walk or a run, or simply relaxing while viewing the city.\n\nWorth a visit if you are close and want to relax.", "publishedDate": "2019-05-23", "language": "en", "rating": 4}, {"id": 653582755, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d265457-r653582755-Anella_Olimpica-Barcelona_Catalonia.html", "text": "We were amazed at the size of this Olympic statue. The space is clean and worth the visit. Make sure to come early before they close.", "publishedDate": "2019-02-19", "language": "en", "rating": 4}, {"id": 613898730, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d265457-r613898730-Anella_Olimpica-Barcelona_Catalonia.html", "text": "We like to visit Olympic stadiums so had to come to this site on our trip to Barcelona.  The monument has presence over the city skyline.  The area is well maintained.  Worth a look to check out Olympic history", "publishedDate": "2018-09-04", "language": "en", "rating": 5}, {"id": 606927426, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d265457-r606927426-Anella_Olimpica-Barcelona_Catalonia.html", "text": "We loved walking around this part of Olympic history. It is a beautiful area with fountains, views, beautiful buildings, and of course the beautiful torch. It was fun to see people actually jogging in the area-what an experience.", "publishedDate": "2018-08-15", "language": "en", "rating": 5}, {"id": 604955025, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d265457-r604955025-Anella_Olimpica-Barcelona_Catalonia.html", "text": "We stopped by to see inside the stadium after we had swam in the Olympic pool and it is great.  It’s a 55,000 seater stadium but feels much smaller because the views are so good.  There’s a cafe to have a drink and a snack and plenty of photo opportunities.  Really could feel the whole vibe of the 1992 Olympics. The actual building was first completed in the 1920’s and you could see that from the architecture and quality of the build.  The whole of the Olympic site on Montjuic is well worth a visit especially on a very busy August day to get away from the crowds.", "publishedDate": "2018-08-10", "language": "en", "rating": 5}, {"id": 603243508, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d265457-r603243508-Anella_Olimpica-Barcelona_Catalonia.html", "text": "The area is a beautiful example of redevelopment of an area. Sadly when I visited, there was a tournament on in some of the Olympic venues so access to the park was restricted, but it was still possible to admire the buildings, sculptures and views. A worthwhile stop off on your journey through Montjuic.", "publishedDate": "2018-08-06", "language": "en", "rating": 4}, {"id": 594605047, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d265457-r594605047-Anella_Olimpica-Barcelona_Catalonia.html", "text": "This park is pristine.  The infrastructure in Barcelona due to the Olympics, Expos and major soccer tournaments is incredible - what they built for the Olympics is very impressive and this is fun and easy to see.", "publishedDate": "2018-07-09", "language": "en", "rating": 5}, {"id": 591087171, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d265457-r591087171-Anella_Olimpica-Barcelona_Catalonia.html", "text": "Not necessarily worth the walk, as you can see the monument from almost any high spot in the city. Olympics in 1992 took place here.", "publishedDate": "2018-06-27", "language": "en", "rating": 3}, {"id": 588220752, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d265457-r588220752-Anella_Olimpica-Barcelona_Catalonia.html", "text": "Lovely reminder of the 1992 olympics held here and s a symbol of the revitalization that was done to modernize barcelona na. It is easily visible from the ground, sea or air  and is a great photo opportunity. A lovely piece of architectural genius", "publishedDate": "2018-06-17", "language": "en", "rating": 4}, {"id": 583772746, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d265457-r583772746-Anella_Olimpica-Barcelona_Catalonia.html", "text": "This is an area worth visiting when in Montjuic, there always seems to be crowds, even a wet and cold day did not seem to deter visitors. It is here that you will find some of the 1992 Olympic facilities, the Olympic Stadium, the Sports Complex, the Communications Tower, the Swimming & Diving facilities, the University of Sports and the gardens surrounding. \nMy standout was undoubtedly the tower; 136m high, steel construction, painted white  and a base covered with broken mosaic tiles. Its orientation results in the shadow of the central needle projecting on to the adjacent Plaça d'Europe and acting as a sundial.", "publishedDate": "2018-05-29", "language": "en", "rating": 5}, {"id": 583038948, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d265457-r583038948-Anella_Olimpica-Barcelona_Catalonia.html", "text": "We thoroughly enjoyed our time in this area taking in the museum, gardens, architecture and views.  This is a beloved green space and resource for Barcelona residents,  We enjoyed it, too!", "publishedDate": "2018-05-27", "language": "en", "rating": 5}, {"id": 579573365, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d265457-r579573365-Anella_Olimpica-Barcelona_Catalonia.html", "text": "For someone who never has had and probably never will have an opportunity to attend an Olympics, this was the next best thing. The area is well maintained and easy accessible. Take the city bus #150 to the top of the hill, then you can see Montjuic Castle as well. Walking downhill, you'll pass by the Botanical Gardens (another good visit) on your way to the Olympic Stadium. Just entering and viewing the stadium made me feel a part of history. There is a small cafe with a very limited menu (we chose to eat elsewhere) and a gift shop  seemingly devoted to Gaudi. I did purchase a small reasonably priced item, but I would've preferred some Olympic themed items.", "publishedDate": "2018-05-11", "language": "en", "rating": 4}, {"id": 576286575, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d265457-r576286575-Anella_Olimpica-Barcelona_Catalonia.html", "text": "It's nice to see that all the buildings that were built for the 1992 Olympics are still being used.  There are some great views to be seen from many of the facilities.  Imagine the games going on!", "publishedDate": "2018-04-28", "language": "en", "rating": 4}, {"id": 576098576, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d265457-r576098576-Anella_Olimpica-Barcelona_Catalonia.html", "text": "Its really huge complex but if you think about it the question is simply-and what now? Empty and must be expensive keep it...", "publishedDate": "2018-04-27", "language": "en", "rating": 3}, {"id": 567552308, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d265457-r567552308-Anella_Olimpica-Barcelona_Catalonia.html", "text": "I was glad we gave this place ample time when we visited. It was easy to get to. Once you're on top there, the view is one of the best in the city. I wish I had brought a sandwich and a book and just spent the day there. The place is still used for sports and concerts but as a symbol of Catalan modernism, it plays a significant role. It is worth visiting even if only to imagine the events that took place there.", "publishedDate": "2018-03-19", "language": "en", "rating": 5}, {"id": 541451630, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d265457-r541451630-Anella_Olimpica-Barcelona_Catalonia.html", "text": "Maybe I should have had a guide or learned more about it before visiting. It was cool to see and the bus audio guide told us a little. I don't know. We came, we saw, we took pictures and left within 10 minutes.", "publishedDate": "2017-11-16", "language": "en", "rating": 3}, {"id": 539778410, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d265457-r539778410-Anella_Olimpica-Barcelona_Catalonia.html", "text": "Barcelona benefitted greatly with the World Cup and the Olympics particularly the roads and the beach , many areas were cleaned up and redeveloped. The one thing that really hasn’t found a role is the Olympic stadium which is hugely underused though well maintained.  It’s nice but fairly pointless now. ", "publishedDate": "2017-11-09", "language": "en", "rating": 3}, {"id": 534863005, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d265457-r534863005-Anella_Olimpica-Barcelona_Catalonia.html", "text": "Wander up here from the Sants Estacio in about 15mins. Travelators help those who would find the walk up hard work. Lots of things to see around the area.", "publishedDate": "2017-10-21", "language": "en", "rating": 3}, {"id": 532696359, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d265457-r532696359-Anella_Olimpica-Barcelona_Catalonia.html", "text": "Stopped in here on our walk around monjuic.\n\nSeemed very quiet, although there were some infomation boards.\n\nGreat views, free to enter. Almost seemed like a area that is currently very under utilised. Went into the stadium and had a look around by ourselves and into the shop.\n\nReally expected more activity, it was very quiet and a good place to see the views and have a rest. The sculptures are very interesting.", "publishedDate": "2017-10-13", "language": "en", "rating": 4}, {"id": 529683718, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d265457-r529683718-Anella_Olimpica-Barcelona_Catalonia.html", "text": "We didn't go in but stopped for the sculptures and peeked into the stadium.\nNice area to walk and you get a slice of history even if it;s not ancient.", "publishedDate": "2017-10-03", "language": "en", "rating": 4}, {"id": 525117412, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d265457-r525117412-Anella_Olimpica-Barcelona_Catalonia.html", "text": "We weren't planning on seeing this site, but took a hop on hop off bus tour and ended up seeing it! It is way up on the mountain and it is pretty cool to see. Nice surrounding area to walk around in!", "publishedDate": "2017-09-17", "language": "en", "rating": 4}, {"id": 523781153, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d265457-r523781153-Anella_Olimpica-Barcelona_Catalonia.html", "text": "Spent a relaxing afternoon at the Bernat Picornell Olympic outdoor pool what a treat 11.50 euros but no time limit and plenty of loungers.Suprisingly quiet worth everu penny", "publishedDate": "2017-09-12", "language": "en", "rating": 5}, {"id": 520811018, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d265457-r520811018-Anella_Olimpica-Barcelona_Catalonia.html", "text": "This was a pleasant surprise for me. Very relaxing atmosphere on a Saturday afternoon. Great for a walk around and very interesting at the same time.", "publishedDate": "2017-09-03", "language": "en", "rating": 4}, {"id": 501318028, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d265457-r501318028-Anella_Olimpica-Barcelona_Catalonia.html", "text": "Olympic park is worth the visit especially if you are on your way to the castle of Montjuïc. It's about half way walking uphill. The park itself is quite modern design, with the bizarre radio antenna at the center of it. ", "publishedDate": "2017-07-12", "language": "en", "rating": 4}, {"id": 483849277, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d265457-r483849277-Anella_Olimpica-Barcelona_Catalonia.html", "text": "Have been to a few Olympic parks including most of those in Asia Pacific. This one is the worst in comparison.\n\nNot worth the visit!", "publishedDate": "2017-05-13", "language": "en", "rating": 1}, {"id": 483360724, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d265457-r483360724-Anella_Olimpica-Barcelona_Catalonia.html", "text": "This is on the top of Montjuic & worth a visit whilst in Barcelona.  There are escalators to help you get to the top if walking, otherwise its on the bus route.  There isnt much shade in the Olympic area, so take a hat & sunglasses.  We visited at the end of April & it was incredibly glary & bright.  The spire is visible from all over town & there is also the stadium & the large plaza to walk around.", "publishedDate": "2017-05-11", "language": "en", "rating": 4}, {"id": 478037447, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d265457-r478037447-Anella_Olimpica-Barcelona_Catalonia.html", "text": "The Olympic village, built for the 1992 games, is a \"must see\" for visitors to this magnificent city.\nThe main stadium is open to visitors. The communications tower is impressive as are the views from the top of Montjuic.", "publishedDate": "2017-04-22", "language": "en", "rating": 4}, {"id": 477053110, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d265457-r477053110-Anella_Olimpica-Barcelona_Catalonia.html", "text": "We had steady pleasant walk from our hotel on the the bottom of La Rambla (long walk with lots of steps). Took a ride on the cable cars whilst passing and into the stadium. Nice to sit and watch children having running events whilst having refreshments. Very clean and tidy.  Lovely stadium.  ", "publishedDate": "2017-04-19", "language": "en", "rating": 5}, {"id": 472208276, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d265457-r472208276-Anella_Olimpica-Barcelona_Catalonia.html", "text": "If you plan to visit only for being here and at the Stadium, don't waste your time. On the other half, if you have to go to Palau Sant Jordi for a concert or want to spend all day long at Montjuïc is OK", "publishedDate": "2017-04-02", "language": "en", "rating": 3}, {"id": 471155027, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d265457-r471155027-Anella_Olimpica-Barcelona_Catalonia.html", "text": "Communication tower designed by Santiago Calatrava.\nA bizarre yet wonderful structure set in the well kept gardens of the Olympic stadium. The other major facilities consist of the Palau Sant Jordi sports hall, the National Physical Education Institute (INEFC) and the Picornell swimming pools. The Joan Antoni Samarach Olympic and Sports Museum are also located in the Olympic Ring.", "publishedDate": "2017-03-29", "language": "en", "rating": 5}, {"id": 452386294, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d265457-r452386294-Anella_Olimpica-Barcelona_Catalonia.html", "text": "This place is beautiful. The stadium maybe dated but looks fabulous what is even better is the area surrounding it with the telefonic monument and beautiful court yard  with fountains simply stunning on a sunny day  and well worth the walk up to it. ", "publishedDate": "2017-01-16", "language": "en", "rating": 5}, {"id": 449693213, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d265457-r449693213-Anella_Olimpica-Barcelona_Catalonia.html", "text": "It's got stunning views and a very chilled atmosphere, the photos and the views are sensational .A must go to attraction. ", "publishedDate": "2017-01-05", "language": "en", "rating": 4}, {"id": 449580262, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d265457-r449580262-Anella_Olimpica-Barcelona_Catalonia.html", "text": "This place is a must! You get amazing views of Barcelona as well as partake in a bit of history. The ring itself is pretty cool and a beautiful site to look at surrounded by fountains and a little park as well as the sports complexes. ", "publishedDate": "2017-01-05", "language": "en", "rating": 5}, {"id": 439030163, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d265457-r439030163-Anella_Olimpica-Barcelona_Catalonia.html", "text": "This place is very calm and it was pretty empty when we visited it (accidentally). We stopped for a little while, the view of the statue (?) was amazing. Though nothing special happens here, you should visit it but only if you are near!", "publishedDate": "2016-11-21", "language": "en", "rating": 4}, {"id": 436851671, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d265457-r436851671-Anella_Olimpica-Barcelona_Catalonia.html", "text": "The Olympic Park has been left unchanged since the games finished. The various stadia and buildings have all been put to good use for club sports and public sporting facilities but the large open spaces of the park remain unchanged. \n\nThere are waterfalls, ornamental ponds and imposing colonnades. The communication tower is still there although slightly the worse for wear now. There is plenty of space to sit and contemplate, and few visitors to disturb you.", "publishedDate": "2016-11-13", "language": "en", "rating": 5}, {"id": 436291550, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d265457-r436291550-Anella_Olimpica-Barcelona_Catalonia.html", "text": "I woud suggest to come up here, to sit on the grass, to hear the water in fountains flowing,to relax... Another lovely spot in Montjuic", "publishedDate": "2016-11-10", "language": "en", "rating": 4}, {"id": 432786553, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d265457-r432786553-Anella_Olimpica-Barcelona_Catalonia.html", "text": "Whilst visiting Barcelona with my partner in May we decided to visit the old Olympic grounds! Getting up there was a nice walk and there were escalators to help you on your way and little cafes dotted about. The park itself is pretty eerie as its quiet and looks abandoned although we saw a couple of people and heard one guy say how one the halls is used for basket ball tournaments etc! Feel like more should be done with it especially after all the money that's gone into it. It didn't cost anything you just walk in although we couldn't go into any of the building etc there a no cafes or anything like that but there is a great view of the city!", "publishedDate": "2016-10-29", "language": "en", "rating": 3}, {"id": 431786917, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d265457-r431786917-Anella_Olimpica-Barcelona_Catalonia.html", "text": "Worth going to. The park nearly is really good. Lovely views. Could spend a long time in the park if you wanted to as it is big!", "publishedDate": "2016-10-26", "language": "en", "rating": 3}, {"id": 430955963, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d265457-r430955963-Anella_Olimpica-Barcelona_Catalonia.html", "text": "I remember when the Olympic Games, came and went in Los Angeles. A month later it was hard to tell the difference. In my memory, there was something memorable about the Barcelona Olympics(which we did not attend), especially the TV shot of the platform divers with the city spread out beneath them. Visiting the venue brought it back vividly. Just Lagniappe.", "publishedDate": "2016-10-23", "language": "en", "rating": 4}, {"id": 427819324, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d265457-r427819324-Anella_Olimpica-Barcelona_Catalonia.html", "text": "The olympic park where took place the Olympic games in 1992.The main attraction point is in my opinion the communication tower,designed by Santiago Calatrava.A wonderful structure.Also you can find here the olympic stadium.", "publishedDate": "2016-10-14", "language": "en", "rating": 4}, {"id": 423633294, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d265457-r423633294-Anella_Olimpica-Barcelona_Catalonia.html", "text": "This is another beautiful location in Barcelona.. it is not packed with tourists which is nice for a change.. you will see  major Barcelona Olympic buildings, square thst connects it is beautiful, stadium is fantastic.. it doesn't look too big from outside, but when you come in it is pretty big.. I visited after Montjuic castle (15 minute downhill walk) and it is also near Mies van der Rohe Barcelona Pavillion which is a must see.. so thos places make a great combination for visiting", "publishedDate": "2016-09-29", "language": "en", "rating": 5}, {"id": 422170484, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d265457-r422170484-Anella_Olimpica-Barcelona_Catalonia.html", "text": "The Olympic stadium and parks are a must see when visiting Barcelona. You can even run the 100m sprint for a 5€. Theres also bar that overlooks the whole arena. We even managed to visit the outdoors diving centre which has some amazing views. Highlight of my trip! ", "publishedDate": "2016-09-25", "language": "en", "rating": 5}, {"id": 421098076, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d265457-r421098076-Anella_Olimpica-Barcelona_Catalonia.html", "text": "I think it's ineresting to see. you can look and walk around the place without paying. you can also pay and participate in olympic activities wich in my opinion is unnescessary. overall it's very pretty.", "publishedDate": "2016-09-22", "language": "en", "rating": 4}, {"id": 419904271, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d265457-r419904271-Anella_Olimpica-Barcelona_Catalonia.html", "text": "The Barcelona Olympics were 24yrs ago add yet this complex has not aged. at the time the complex & the infrastructure created to service the complex must have been mind blowing because today they are still awe inspiring. If you get excited every four years by the Olympics then do yourself a favour & visit this complex.", "publishedDate": "2016-09-18", "language": "en", "rating": 4}, {"id": 419516306, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d265457-r419516306-Anella_Olimpica-Barcelona_Catalonia.html", "text": "Typical tourist attraction in Barcelona. Don't miss it when you are staying in this amazing city. :))))", "publishedDate": "2016-09-17", "language": "en", "rating": 5}, {"id": 400605889, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d265457-r400605889-Anella_Olimpica-Barcelona_Catalonia.html", "text": "It's nice that Spain hasn't let it's Olympic facilities fall to ruin like so many other former hosts.  You can enter some of the main Summer Olympic fields/stadiums up on Montjuic, and it's really beautifully designed and aesthetically pleasing with nice accent statues and water features.\n\nThat said, it's an empty sports venue, so don't expect anything too exciting other than some picturesque views.", "publishedDate": "2016-08-02", "language": "en", "rating": 3}, {"id": 398681145, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d265457-r398681145-Anella_Olimpica-Barcelona_Catalonia.html", "text": "My friend and I recently stayed in an apartment around a twenty minute walk from the Olympic stadium so decided it was worth a visit. Although most people may decide to skip this attraction as its not as centrally located as many others I highly recommend paying a visit. The views are spectacular and free access is available to a number of sites that were used during the 1992 Olympics. This was definitely a personal highlight of my Barcelona trip and would highly recommend it to anyone visiting.", "publishedDate": "2016-07-28", "language": "en", "rating": 5}, {"id": 396307145, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d265457-r396307145-Anella_Olimpica-Barcelona_Catalonia.html", "text": "This park dates back to the Olympics of 1992, although structures in the site, such as the Olympic stadium, are far older.  Despite the park itself dating back to 1992 and perhaps being a 'single-use' facility as inherently Olympic parks are, it has nonetheless been well-kept and remains a beautiful place.  Also, the sports venues remain in robust use, giving this place a feeling of being alive, rather than simply a monument.\n\nIts beauty lies in its simplicity and layout, with surfaces being of high-quality marble and granite finish throughout, whose robustness likely accounts for why the park as aged so well.  At every turn there is a lovely vista, with there being a symmetry throughout.  In the recent past I visited the Olympic park area in London done for the 2012 Olympics and feel that the London park is vastly inferior to that at Barcelona, despite that at London presumably being comparatively 'state of the art'.  I would suspect that the inherent grace of the Barcelona park will prove timeless.", "publishedDate": "2016-07-24", "language": "en", "rating": 5}, {"id": 383776594, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d265457-r383776594-Anella_Olimpica-Barcelona_Catalonia.html", "text": "Ride the cable car up to the Olympic Park, from down on the port below, also visit the National Palace, and ride the escalators up from the other side, also great views from the Palace side.", "publishedDate": "2016-06-18", "language": "en", "rating": 4}, {"id": 380866756, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d265457-r380866756-Anella_Olimpica-Barcelona_Catalonia.html", "text": "Not one of Barcelona's show stoppers but certainly worth a visit if you are there all week rather than rushing round on a long weekend\nA peaceful area and the stadium looks nice from the front. There are some other monuments and water features which add to the pleasantry\nIt's free to wander around and only takes 10 minutes so try and combine with a trip to Montjuic and the nearby palace/magic fountains ", "publishedDate": "2016-06-08", "language": "en", "rating": 3}, {"id": 377444947, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d265457-r377444947-Anella_Olimpica-Barcelona_Catalonia.html", "text": "I really enjoyed this part of the city. The stadium itself is smaller then expected compared to modern olympic stadiums but the park around it really was beautiful and offered great views of the city.", "publishedDate": "2016-05-28", "language": "en", "rating": 4}, {"id": 372262354, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d265457-r372262354-Anella_Olimpica-Barcelona_Catalonia.html", "text": "Site of the 1992 summer Olympics, a impressive place to visit, you get access to the whole complex. a great place to take photos, magnificent tower used for telecommunications is of special interest. We visited in the afternoon and there were not that many tourists here, good views overlooking the city", "publishedDate": "2016-05-11", "language": "en", "rating": 4}, {"id": 371585489, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d265457-r371585489-Anella_Olimpica-Barcelona_Catalonia.html", "text": "We passed this site on the open top bus but could see the landmark structure from our hotel roof terrace! It was home to the 1992 Olympics and is open for tours!  ", "publishedDate": "2016-05-09", "language": "en", "rating": 5}, {"id": 371218021, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d265457-r371218021-Anella_Olimpica-Barcelona_Catalonia.html", "text": "We could see this amazing sculpture from our hotels miles away so was great to see it up close and personal. At night it has flashing lights- fab. ", "publishedDate": "2016-05-08", "language": "en", "rating": 4}, {"id": 370154434, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d265457-r370154434-Anella_Olimpica-Barcelona_Catalonia.html", "text": "While others might have taken the bus to this site, my husband & I chose to walk to it from downtown Barcelona...a long walk w/lots of hills. That being said, seeing this complex was worth the effort. Not only was it impressive, it was a flashback in history. I would recommend seeing this to anyone...the walk was good exercise!", "publishedDate": "2016-05-04", "language": "en", "rating": 4}, {"id": 351402213, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d265457-r351402213-Anella_Olimpica-Barcelona_Catalonia.html", "text": "As an engineer I appreciated the combination of function with exceptionally unique design.  It is a very striking antenna.  It can be seen from many locations in the city.  I would not put a site visit high your list unless you are an afficiano of architectural or industrial design.", "publishedDate": "2016-02-27", "language": "en", "rating": 4}, {"id": 346838039, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d265457-r346838039-Anella_Olimpica-Barcelona_Catalonia.html", "text": "It's massive and not overcrowded like other Barcelona places. It was perfect with bikes! cycling was very pleasant. very nice view and something different form Barcelona city! worth to see", "publishedDate": "2016-02-11", "language": "en", "rating": 4}, {"id": 340391471, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d265457-r340391471-Anella_Olimpica-Barcelona_Catalonia.html", "text": "The Olympic Parc in Montjuic was the site of the 1992 Summer Olympic Games. Here you can find several major structures, the Olympic Stadium, the Palau Sant Jordi hall, the Picornell swimming pools and the marvelous telecommunications tower by Santiago Calatrava. The whole complex is thoughtfully designed and even today it is a great place to visit and wander along its main thoroughfares and paths.", "publishedDate": "2016-01-16", "language": "en", "rating": 5}, {"id": 324343350, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d265457-r324343350-Anella_Olimpica-Barcelona_Catalonia.html", "text": "Theres not much here besides the communications tower and Olympic stadium but it is a very calm area, despite being close to major attractions. Good remains of 1992 Olympics to see though.", "publishedDate": "2015-11-04", "language": "en", "rating": 4}, {"id": 323890441, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d265457-r323890441-Anella_Olimpica-Barcelona_Catalonia.html", "text": "This area was near our hotel so we walked up bit sure what we were expecting but this is spectacular and very quite! It's a lovely area to walk around and sit and had amazing views of the city, would recommend going up here to see the views and Olympic stadium", "publishedDate": "2015-11-02", "language": "en", "rating": 5}, {"id": 320491038, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d265457-r320491038-Anella_Olimpica-Barcelona_Catalonia.html", "text": "Though there isn't much there but remains of the 1992 Olympics, it was still very nice seeing the structures and reminisce. There isn't a lot going on but in my opinion it's worth a quick look. Plus it's free to the public and not crowded, very peaceful area to visit!", "publishedDate": "2015-10-20", "language": "en", "rating": 4}, {"id": 318718518, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d265457-r318718518-Anella_Olimpica-Barcelona_Catalonia.html", "text": "Very nice place to visit. Compared to the other places in Barcelona it is very peaceful and uncrowded. In my opinion that is not because it would not be interesting, not at all, I guess it is because of its dimension. The place is enormous. The entrance to the olympics stadium is free. The main square is full of fountains and it makes you feel really relaxed, also gives you a lot of opportunities just to seat down and chill.\nIf you want you can also enter to the Museum of Sport which requires a entrance fee.", "publishedDate": "2015-10-14", "language": "en", "rating": 5}, {"id": 314433680, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d265457-r314433680-Anella_Olimpica-Barcelona_Catalonia.html", "text": "Every one remembers the pictures on the TV of the divers on the board overlooking the city during the Olympic Games and is was great to see the place in real life. You can walk around for free, see the stadium and village. It is slightly showing it's age and started to look a bit unloved but still well worth a visit.\n", "publishedDate": "2015-09-28", "language": "en", "rating": 4}, {"id": 313514014, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d265457-r313514014-Anella_Olimpica-Barcelona_Catalonia.html", "text": "Lovely relaxing, tranquil space, really enjoyed the visit chilled out and had coffee from the very nice stall nearby", "publishedDate": "2015-09-25", "language": "en", "rating": 3}, {"id": 311933825, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d265457-r311933825-Anella_Olimpica-Barcelona_Catalonia.html", "text": "Do you still remember the 92 Olympics?\nWell, if you do remember the games that changed the history of opening ceremonies, you will enjoy walking around the place and visiting the olympic venues. \nIf you were too young (or not yet around) at that time to remember the games, then simply get there to enjoy one of the best views of the city. ", "publishedDate": "2015-09-19", "language": "en", "rating": 5}, {"id": 311241655, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d265457-r311241655-Anella_Olimpica-Barcelona_Catalonia.html", "text": "Very interesting and free entry. We sow all equipment for Olympic games in Barselona, conducted in 1992.\n\n\t\n", "publishedDate": "2015-09-17", "language": "en", "rating": 5}, {"id": 297533103, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d265457-r297533103-Anella_Olimpica-Barcelona_Catalonia.html", "text": "Helped by outdoors rollerstairs you reach the area and get an idea of the dimensions. Nice for concerts and events. Nice view.", "publishedDate": "2015-08-10", "language": "en", "rating": 4}, {"id": 295156690, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d265457-r295156690-Anella_Olimpica-Barcelona_Catalonia.html", "text": "Next to the Olympic stadium. Looks like something from Star Trek. Might not appeal to all, but for me, it's impressive!", "publishedDate": "2015-08-02", "language": "en", "rating": 5}, {"id": 272643767, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d265457-r272643767-Anella_Olimpica-Barcelona_Catalonia.html", "text": "We stayed just around the block from Placa Espanya so it was a relatively close walk and escalator ride up to the Olympic Park. Free admission for an area in Barcelona was nice for a change. There wasn't a lot to see here, but the area did make for some great photo opportunities. If you only have a short time in Barcelona and aren't an Olympics super fan, then you could skip this.", "publishedDate": "2015-05-17", "language": "en", "rating": 3}, {"id": 272089571, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d265457-r272089571-Anella_Olimpica-Barcelona_Catalonia.html", "text": "The site is a 20 minute walk from the Espanya metro station. Once there you can look around the \"ruins\". There is an impressive statue, a few large fountains and some great views of the city from a different vantage point. There is potential for very beautifully framed pictures for the photographers. However this location should not be a \"must see\". It's a bit rundown and is not as impresive as one might hope. Think gym on a hill, high school sport centre or university gymnasium. If you are going to see the Magic Fountain close by however, you could just as well make the effort.", "publishedDate": "2015-05-14", "language": "en", "rating": 2}, {"id": 270542129, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d265457-r270542129-Anella_Olimpica-Barcelona_Catalonia.html", "text": "Nice place to roam about after seeing the stadium. You can nice snaps around this area with beautiful landscaping in the surrounding.", "publishedDate": "2015-05-07", "language": "en", "rating": 4}, {"id": 270326443, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d265457-r270326443-Anella_Olimpica-Barcelona_Catalonia.html", "text": "Taking time out of a hectic Barcelona city break and as a big sports fan it was a real highlight to explore the Olympic park area of Montjuic and spend a couple of hours here. Great place to take a time out, sit on the grass, have a picnic and let the children run off some energy.\nSitting on top of the city it has excellent views and the stadium can be entered for free for a view of the track.\nit's a bit of a walk up the hill to get here, but there are escalators in the park to speed this up if you don't want to run all the way!\nWe all agreed this was one of the best things we did in Barcelona.", "publishedDate": "2015-05-06", "language": "en", "rating": 5}, {"id": 269661082, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d265457-r269661082-Anella_Olimpica-Barcelona_Catalonia.html", "text": "While going on a bus tour one can see not only the Barcelona stadium but also a beautiful piece of architecture depicting the spirit of Olympics. The Olympic Ring on Montjuïc was the nerve centre of the festivities and today is a landmark. One need not get down to see it but can capture the beauty while travelling on an open hop on hop off bus.", "publishedDate": "2015-05-03", "language": "en", "rating": 5}, {"id": 265921549, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d265457-r265921549-Anella_Olimpica-Barcelona_Catalonia.html", "text": "We rode the Sky Car and then made the walk up Miramar Avenue to the Stadium.  A MUST do as there are amazing sights after every turn.  Just when we thought we were taking a mundane walk back to the Metro station, Playa Espana came into view and OMG.  Highly recommend this area", "publishedDate": "2015-04-15", "language": "en", "rating": 5}, {"id": 264242858, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d265457-r264242858-Anella_Olimpica-Barcelona_Catalonia.html", "text": "We caught the funicular train from Parel-lel metro station which takes you most of the way to the Olympic Ring, just a short, slightly uphill walk about 10 minutes to the stadium.\n\nThe area around the stadium and other venues is beautifully laid out with modern sculptures, water features and planting - it's lovely to stroll around, taking in the views all sides.\n\nThe communication tower is a highlight, and is really big - we got some great photographs up here!\n\nWatch out for parakeets - one dropped a large \"present\" on me after eating dark coloured berries - the stains on my white T shirt were permanent!!!", "publishedDate": "2015-04-07", "language": "en", "rating": 5}, {"id": 259335633, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d265457-r259335633-Anella_Olimpica-Barcelona_Catalonia.html", "text": "The Anella Olimpica is a futuristic structure sitting atop Montjuic Hill. Visiting the Anella is a fantastic experience as you should also see MNAc, Fundacion de Joan Miro, Parc de Montjuic Placa Espanya, etc on the same trip. Wonderful views over Barcelona and an all round great day out Highly recommended!", "publishedDate": "2015-03-13", "language": "en", "rating": 4}, {"id": 222348610, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d265457-r222348610-Anella_Olimpica-Barcelona_Catalonia.html", "text": "The Olympic site and all the stadiums and buildings are open to the public. There's plenty to see up there and good views all around.", "publishedDate": "2014-08-17", "language": "en", "rating": 4}, {"id": 216461856, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d265457-r216461856-Anella_Olimpica-Barcelona_Catalonia.html", "text": "As a huge fan of the Olympics I had to come here. The stadium is beautiful and impressive. You can gain access to the whole park, there are no gates or fees. There isn't actually that much to see though, so you don't need to spend much time here. Apart from the stadium, the rest of the park is really showing its age, and it has a kind of creepy abandoned feel to it. It was still really cool to check out a piece of Olympic history, so if you're interested in sports/the Olympics or you're in the area, definitely check it out. Especially as it's free!", "publishedDate": "2014-07-20", "language": "en", "rating": 4}, {"id": 215328223, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d265457-r215328223-Anella_Olimpica-Barcelona_Catalonia.html", "text": "Walked from the sky tram to the stadium.  Passed the diving venue which would have been incredible during the Olympics.  View looks out over the city.  There is a little neighborhood outdoor bar about half way which was a perfect rest stop.  Mostly uphill walk but pretty easy.  The stadium is in very good shape and you can walk right in and look around.  The grounds are also easily accesible.  From there it is a nice walk down to the fountains and the metro.  Nice afternoon walk while in Barcelona.", "publishedDate": "2014-07-14", "language": "en", "rating": 4}, {"id": 214553057, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d265457-r214553057-Anella_Olimpica-Barcelona_Catalonia.html", "text": "took hop on hop off bus to this stop and explored the Stadium and grounds around it.  The complex is high up above city and offers great views all around. It something to think all this was built for the olympics and wonder how much use it gets. Remember use the bathrooms at the stadium because they are far and few between.  You can also get refreshments inside at a stand and there is small gift shop.  Good phots to be had overlooking field and then outside by other complexes.  All free so worth visit on nice day.", "publishedDate": "2014-07-09", "language": "en", "rating": 4}, {"id": 213970487, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d265457-r213970487-Anella_Olimpica-Barcelona_Catalonia.html", "text": "It is nice to check out something that was a part of Olympic history. You just have to appreciate the structure.  Don't know when I'll be going back to Barcelona but it's something I am glad I took the time to see.", "publishedDate": "2014-07-06", "language": "en", "rating": 5}, {"id": 209261819, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d265457-r209261819-Anella_Olimpica-Barcelona_Catalonia.html", "text": "I have to admit that I have a thing for abandoned places, and you can find many of them in Barcelona. You can walk down here from Montjuic Castle, and then straight to Placa Espanya. If you have more than 3 days in the city, I'd say you shouldn't skip this one, since it is very relaxing, and also a nice spot for a picnic. If you have only a short time, then you might find something else to fill it with.", "publishedDate": "2014-06-07", "language": "en", "rating": 4}, {"id": 206940051, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d265457-r206940051-Anella_Olimpica-Barcelona_Catalonia.html", "text": "And it is worth taking some time to see all these buildings, especially Olympic Stadium. It seemed that most of these buildings were not in use, but as it was Easter, that might be the reason. Anyway, big sports fields and Olympic games centers are always nice to visit.", "publishedDate": "2014-05-25", "language": "en", "rating": 3}, {"id": 169349906, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d265457-r169349906-Anella_Olimpica-Barcelona_Catalonia.html", "text": "Not a lot of time required here. Lovely to walk around and see the sights of Barcelona from above. Pretty gardens and lots of wild cats!!!", "publishedDate": "2013-07-27", "language": "en", "rating": 4}, {"id": 144679396, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d265457-r144679396-Anella_Olimpica-Barcelona_Catalonia.html", "text": "Nice to stroll arround, in beautifull montjuic mountain. The olimpic stadium worth visiting.Well kept buildings from the olimpics", "publishedDate": "2012-11-05", "language": "en", "rating": 4}, {"id": 142183198, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d265457-r142183198-Anella_Olimpica-Barcelona_Catalonia.html", "text": "The Anella Olimpica or Olympic ring, is part of the Olympic Park done for the 1992 Olympics.\nI love it, it’s full of futuristic architecture. It includes the Olympic stadium, swimmingpools and the famous and colossal telecommunications tower.\nYou don’t need a lot of time here, but there are other attractions nearby, so I would suggest to spare a day for this hilly part of the city and visit the following all together – ideally taking the touristic bus to save time, you can hop on and off as you like.\n\n- Start off from Placa Espanya, gorgeous for pictures. Walk up to Palau National, every time I went the museum was closed, but it’s very nice to relax listening to street artists – remember to look for the board advertising the timing for the Magic fountain! \n- After this there is the Anella Olympica\n- Nearby there is also Miro museum if you are into art\n- After that you’ll find the Montjuic castle with its stunning views\n\nIf you want to stay in the area for the evening too, then there are two popular choices:\n- See the Magic fountain show (check days and times!) – this is between Placa d’Espanya and Palau National\n- Or maybe book El Tablao de Carmen for some tapas and lovely flamenco show – in the Poble Espaniol (Spanish quarter)", "publishedDate": "2012-10-06", "language": "en", "rating": 4}, {"id": 136707783, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d265457-r136707783-Anella_Olimpica-Barcelona_Catalonia.html", "text": "A place nice to visit, large areas, many fountains, close to bothanical gardens, great view to Montjuic and the city.", "publishedDate": "2012-08-09", "language": "en", "rating": 4}]}}]