[{"locationId": 244855, "name": "Barcelona Wax Museum", "placeType": "ATTRACTION", "reviewListPage": {"reviews": [{"id": 740188272, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d244855-r740188272-Barcelona_Wax_Museum-Barcelona_Catalonia.html", "text": "The paranormal night was an amazing experience! The entire museum is great.. and you can learn a lot. \n\nAlso the Bosc de les fades bar is great to have some drinks... it doesn’t look like you are in the centre of BCN!!\n\nWill come back for sure!!!", "publishedDate": "2020-01-20", "language": "en", "rating": 5}, {"id": 718645265, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d244855-r718645265-Barcelona_Wax_Museum-Barcelona_Catalonia.html", "text": "the structure od the museum are based on stories. I fortunately don’t know much about Spanish history, but I liked everything in it", "publishedDate": "2019-10-15", "language": "en", "rating": 4}, {"id": 718536875, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d244855-r718536875-Barcelona_Wax_Museum-Barcelona_Catalonia.html", "text": "We kind of imagined that will see a museum of world celebrities made in wax.\nBut surprisingly was not like that.\nInstead is a nice wax museum, more about Spain celebrity persons.", "publishedDate": "2019-10-15", "language": "en", "rating": 3}, {"id": 715303792, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d244855-r715303792-Barcelona_Wax_Museum-Barcelona_Catalonia.html", "text": "Around midnight, we strumbled across this place and thought we walk in and not knowing what it was. We decided to take some photos and then I realised there was a man looking at us outside the window which really gave me the fright and goosebumps and then we realised it was a wax museum. It was a creepy place from outside at that time of night. We didn’t get a chance to visit the inside. But if you want to be out of place and have goosebumps the go visit this place out of hours or midnight to get a shock.", "publishedDate": "2019-10-04", "language": "en", "rating": 5}, {"id": 710880161, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d244855-r710880161-Barcelona_Wax_Museum-Barcelona_Catalonia.html", "text": "The music they play here is super eerie. We've been to other wax museums and they were more fun and upbeat. The sets are well done though, more so than the wax figures. Being from North America, a lot of the figures were unknown to us.", "publishedDate": "2019-09-18", "language": "en", "rating": 3}, {"id": 709320192, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d244855-r709320192-Barcelona_Wax_Museum-Barcelona_Catalonia.html", "text": "This wax museum is a very good place to visit there is lots of wax statues and they are different to others I have been to in the past.", "publishedDate": "2019-09-13", "language": "en", "rating": 4}, {"id": 697707108, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d244855-r697707108-Barcelona_Wax_Museum-Barcelona_Catalonia.html", "text": "Wax museums are always fun, but this one is a little fricky. It's dark, movement in some parts, demonstration of  interrogation room. I did not enjoy much but more brave people may like it.", "publishedDate": "2019-08-11", "language": "en", "rating": 3}, {"id": 693017739, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d244855-r693017739-Barcelona_Wax_Museum-Barcelona_Catalonia.html", "text": "Would not waste your time I’m glad the entry was part of the Barcelona pass because if I paid at the door I would be really unhappy. I can’t comment to much on the Spanish characters accuracy but going by the figures I did know I would say they are not a good likeness. It would maybe be more interesting if they they had some information about the characters rather than just a name especially for the historic figures. Don’t waste your time in this attraction.", "publishedDate": "2019-07-26", "language": "en", "rating": 1}, {"id": 683613305, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d244855-r683613305-Barcelona_Wax_Museum-Barcelona_Catalonia.html", "text": "My husband and i walked past a couple of times before deciding to go in, but wow did we have a good time. The place was empty aside from us and the wax figures because we toured through only 45 minutes (which wasn’t quite enough time) before they closed for siesta. We thoroughly enjoyed seeing all of the historical Spanish figures as well as more mainstream references to modern and pop culture. The vibe was sufficiently creepy but crazy enjoyable. Make sure you take the elevator down to the lower level and tour through the fantasy and horror sections of this wax museum, you’ll be happy you did.", "publishedDate": "2019-06-23", "language": "en", "rating": 5}, {"id": 676081425, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d244855-r676081425-Barcelona_Wax_Museum-Barcelona_Catalonia.html", "text": "Terrible! Waste of money. Pitch black, no signs on the figures, impossible to tell who they are. Poor directions inside. All over within 20mins. \nJust awful.  They all look the same, with bad hair and costumes. Majority of the figures are Spanish people that mean nothing to the English tourist. Very dusty experience. Do not waste your money like we did!!", "publishedDate": "2019-05-24", "language": "en", "rating": 1}, {"id": 675238709, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d244855-r675238709-Barcelona_Wax_Museum-Barcelona_Catalonia.html", "text": "This bar is just to the right of the museum, same name as the museum and located in the last block of the Ramblas, on the left, before you get to the Marina area.  Prices not bad. Lights go out, rain, thunder and lightning begin.  A different experience and very enjoyable.  We go there at least once when in Barcelona.", "publishedDate": "2019-05-20", "language": "en", "rating": 4}, {"id": 668744762, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d244855-r668744762-Barcelona_Wax_Museum-Barcelona_Catalonia.html", "text": "Very bad and dark. Figures do not look like real people. Luke Skywalker looks like a dragqueen. Bad quallity work. Not worth it", "publishedDate": "2019-04-23", "language": "en", "rating": 1}, {"id": 661857785, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d244855-r661857785-Barcelona_Wax_Museum-Barcelona_Catalonia.html", "text": "This was my first wax museum. It's big and has lots of themes and characters. For some people, the experience can be a little scary in some exhibits and another minus is that some characters really don't look as they should and are kinda rushed. All in all it's a nice place to waste some time and it was very fun for me and my friends.", "publishedDate": "2019-03-28", "language": "en", "rating": 4}, {"id": 658585305, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d244855-r658585305-Barcelona_Wax_Museum-Barcelona_Catalonia.html", "text": "What can I say?!?! It was the worst experience I’ve ever had on a holiday. Horrendous wax works, a ripoff at 15 euros per person. Don’t waste your time and money on this", "publishedDate": "2019-03-15", "language": "en", "rating": 1}, {"id": 652285591, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d244855-r652285591-Barcelona_Wax_Museum-Barcelona_Catalonia.html", "text": "If you’re looking for a haunted house vibe, this is the attraction for you. Was expecting madam tussads or something similiar but received the opposite. Even the building and staff gave off a creepy vibe. Accidentally walked into a room\nfull of blanketed wax figures, which looked like a scene from insidious and the staff just stared at us. Wouldn’t recommend to anyone ", "publishedDate": "2019-02-13", "language": "en", "rating": 1}, {"id": 652124899, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d244855-r652124899-Barcelona_Wax_Museum-Barcelona_Catalonia.html", "text": "It was my first wax meusum visit and I really liked it. It was not just full of wax art but also have submarine experience. It's worth spending on that experience. ", "publishedDate": "2019-02-13", "language": "en", "rating": 5}, {"id": 650006553, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d244855-r650006553-Barcelona_Wax_Museum-Barcelona_Catalonia.html", "text": "I probably went with the wrong expectations with prior impression that it would be similar to Madame Trussads. However.... I really dont understand what is the theme of this museum. It looked like a haunted house :P LOL well, I take it as a \"new\" experience. It is the only not-so-good place I went to while in Barcelona. ", "publishedDate": "2019-02-03", "language": "en", "rating": 1}, {"id": 634819182, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d244855-r634819182-Barcelona_Wax_Museum-Barcelona_Catalonia.html", "text": "Situated just off Las Ramblas, the wax museum provided a fittingly spooky setting for when we visited late on Halloween. Being the only visitors there, it was just us, the waxworks and a somewhat eerie silence. There is something quite creepy about being alone in a large hall full of inanimate life like figures, but this provided a different experience to Madame Tussards where when it's busy and with the figures not sectioned off, sometimes you can't tell the difference between them and guests until someone moves and makes you jump!\n            As usual, it's a matter of trying to work out who's who, and we discovered later in the tour that an audio guide was available. The good thing though, with the figures that you aren't familiar with, it does make you curious and want to search up who they are. Most of the figures are also placed in somewhat appropriately fitting scenes, with some more impressive than others including walking through Captain Nemo's submarine.  Understandably, for those who might scare easily, there are parts of the museum that I can imagine people might be apprehensive about walking through as you're not quite sure what might be coming up next, but this might only be heightened when there's not many people about. \n         Overall, a lot of effort has gone into making the figures and trying to match likenesses etc (some are very good, whilst others are not necessarily bang on), but unless a waxworks is your thing I'd say check out the bar La Bosc de Les Fades just along from it instead. It's not a bad way to kill some time if you need to though.", "publishedDate": "2018-11-21", "language": "en", "rating": 3}, {"id": 629723805, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d244855-r629723805-Barcelona_Wax_Museum-Barcelona_Catalonia.html", "text": "Although I never ventured into the waxworks museum held within Museo De Cera I couldn't help but be blown away by the amazing architecture of not just this building but the stunning area the museum is located.\nMy twin brother Stephen and I were wandering around this part of town admiring the superb architecture just off Las Ramblas and the Gothic Quarter  ( Barri Gótic  ) when we chanced upon this amazing building, it just looks so regal ,I didn't even know it was the waxworks museum till I returned to my home town of Liverpool and checked up about the museum. \nI took a few photos of this building before moving on to explore more of this outstandingly beautiful district of Barcelona. \nEasy to locate on Passatge De La Banca. \nWell worth checking out. ", "publishedDate": "2018-10-30", "language": "en", "rating": 5}, {"id": 621043790, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d244855-r621043790-Barcelona_Wax_Museum-Barcelona_Catalonia.html", "text": "A lot of different people can be found in this wax museum. It's not the best in the world, some of the figures look pretty authentic, others don't, but all together it's worth a visit, the major part of the figures are arranged in a way which shows how much love they put into this museum and Iwould say that it is interesting especially when you're accompanied by children.", "publishedDate": "2018-10-01", "language": "en", "rating": 4}, {"id": 620028283, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d244855-r620028283-Barcelona_Wax_Museum-Barcelona_Catalonia.html", "text": "Please dont waste your money or time Its all spanish history a few actors which are so badly done you couldnt out.A waste or time and money avoir", "publishedDate": "2018-09-27", "language": "en", "rating": 1}, {"id": 618402683, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d244855-r618402683-Barcelona_Wax_Museum-Barcelona_Catalonia.html", "text": "We did this because it was handy on La Rambla, and part of the Barcelona Pass.  Most of the characters were from Spanish history, so did not always recognize them.  It is a quite large 3-floor museum.  Had a good mix of serious, humorous and scary displays.  Not all figures were particularly good likenesses. ", "publishedDate": "2018-09-21", "language": "en", "rating": 3}, {"id": 616480363, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d244855-r616480363-Barcelona_Wax_Museum-Barcelona_Catalonia.html", "text": "With a connection to Madam Tussauds in London, wax museums are always on our itinerary and while a thunderstorm raged outside, we spent a thoroughly enjoyable hour or so in here.  The exhibits are weird, wonderful, some are in no particular grouping and there are understandably, quite a lot of Spanish individuals of note portrayed as well.  Not all of the models look like the people they represent - in fact, not many of them look like anyone you'd recognise - but the whole place is housed in an impressive old palace and many of the sets are very atmospheric and quite nicely done.  There are some scenes and tableaux which are pretty well done with  background music and sounds giving relevant atmosphere and a chamber of horrors which frankly, was a little scary to enter!  Don't expect technical excellence, but do enjoy the ambiance - it's good fun. Oh, and check out Prince Charles and Camilla - they're hilariously bad!  ", "publishedDate": "2018-09-14", "language": "en", "rating": 5}, {"id": 611604840, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d244855-r611604840-Barcelona_Wax_Museum-Barcelona_Catalonia.html", "text": "I've actually never been in a wax museum before, and on a whim we decided to go in. It was actually a lot of fun looking around. I loved it and found it to be almost quaint! The building it is housed in is just beautiful. I jumped and got a bit scared at times when the wax figures looked too real, but found it pretty fascinating to walk around and tour the exhibits. I think this is a great place to visit, but prepare to die laughing over the Star Wars exhibit. ET is there, Hans Solo is there looking very old and Luke Skywalker IS there but appears to be suffering from rapid aging syndrome. (Why is his hair white?) I had a great time, and recommend checking it out unless you are a fancy wax conniseur that doesn't have time for anything less than DreamWorks level special effects.", "publishedDate": "2018-08-28", "language": "en", "rating": 4}, {"id": 606952619, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d244855-r606952619-Barcelona_Wax_Museum-Barcelona_Catalonia.html", "text": "It's not like it's a bad place to visit. If you have free time and want to spend the value of the ticket, why not? However, if you've visited London's Madame Tussaud or Paris' Grèvin, be prepared to be underwhelmed. Most of the figures are historical, almost no entertainment personalities and some sculptures are of really poor quality (I saw a male and a female that had basically the same face, just different painting, and clothes). Also, unlike other wax museums, you can't get close and/or touch the figures for that nice celebrity selfie you wanted so much.", "publishedDate": "2018-08-16", "language": "en", "rating": 3}, {"id": 595546326, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d244855-r595546326-Barcelona_Wax_Museum-Barcelona_Catalonia.html", "text": "We stumbled upon this wax museum on Las Ramblas and at only €15 each it was worth a visit. \nIf you are excepting a madam Tussaud type experience you will be disappointed.  It is set in a very old building could well be the original place for the museum I don’t know. Lots of stairs so not wheelchair accessible and it is very dark in places. The wax works are not true to likeness and we had to look at the labels on the floor to work out who most were. Most of the models are roped off so you can not get right next to all of them although one family in there were climbing all over the ropes to get to them ", "publishedDate": "2018-07-12", "language": "en", "rating": 3}, {"id": 583357561, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d244855-r583357561-Barcelona_Wax_Museum-Barcelona_Catalonia.html", "text": "I like visiting wax museums when in other cities, they are generally pretty fun and at the very least you learn a bit... however this museum is the oddest I've ever seen. Normally you expect some scenes set up and some theme is each room. The Museu de Cera is poorly executed. it consists of room after room of wax figures lines up one after the other or jumbled together in groupings that don't necessarily make a lot of sense... We were also expecting to see some horror wax figures but apparently that section is only open at night. We expected much more for the €15 we paid per ticket.", "publishedDate": "2018-05-28", "language": "en", "rating": 1}, {"id": 580193747, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d244855-r580193747-Barcelona_Wax_Museum-Barcelona_Catalonia.html", "text": "Only went into this Wax Museum as it started raining and I did not have an umbrella!  I agree that a lot of the figures did not look like who they were meant to be, especially Charles and Camila!  It was a creepy but unusual place, including going down into a submarine then up into a space ship!  The receptionist told us that the museum was originally a bank and the safety deposit boxes in the Bonnie and Clyde room are the original ones!", "publishedDate": "2018-05-14", "language": "en", "rating": 4}, {"id": 577929806, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d244855-r577929806-Barcelona_Wax_Museum-Barcelona_Catalonia.html", "text": "I dont think its worth the money, but if you have a pass that includes this place its worth the visit. The characters dont look that accurate but there are many of them! A good way to spend 10mins if you're looking to pass the time.", "publishedDate": "2018-05-04", "language": "en", "rating": 3}, {"id": 565208978, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d244855-r565208978-Barcelona_Wax_Museum-Barcelona_Catalonia.html", "text": "Though the wax work is not perfect, but we loved the fact that they gave this museum different themes when moving from one room to another.", "publishedDate": "2018-03-07", "language": "en", "rating": 4}, {"id": 558677224, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d244855-r558677224-Barcelona_Wax_Museum-Barcelona_Catalonia.html", "text": "Not worth a visit!!!!!\nAnd the people at the recpion not nice!!\nTheres alot more to go out there than to this place.", "publishedDate": "2018-02-05", "language": "en", "rating": 1}, {"id": 554639315, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d244855-r554639315-Barcelona_Wax_Museum-Barcelona_Catalonia.html", "text": "I've visited different wax museums in the US and then visited this one on Barcelona, so I'm definitely sure that this is the worse! Very old figures that doesn't look nothing at all as the people represented, a lot of figures are spanish citizens or local celebrities, so if you are a foreigner you will be lost and bored all the way. In general, all the figures seems neglected and almost covered in cobwebs and dust, surrounded by dark and boring settings. For the ticket price (€15 per person) I think it was a waste of time and money, better look other places more interesting and cheap in Barcelona with that.", "publishedDate": "2018-01-18", "language": "en", "rating": 1}, {"id": 536168117, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d244855-r536168117-Barcelona_Wax_Museum-Barcelona_Catalonia.html", "text": "This was the worst wax museum I have ever seen. In fact, I think it is the probably the worst tourist attraction in Barcelona.\nMost of the wax figures are absolutely inaccurate and grotesque. Most of the rooms are dark, ugly and just horrible.\nOn the top of it the entry ticket was €15!", "publishedDate": "2017-10-26", "language": "en", "rating": 1}, {"id": 527119572, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d244855-r527119572-Barcelona_Wax_Museum-Barcelona_Catalonia.html", "text": "At €15 Euros per adult, this wax museum is extremely overpriced. Many of the figures were inaccurate and grotesque. The Star Wars figures were terrible. If they drop the price to €5, the museum would be worth it. ", "publishedDate": "2017-09-24", "language": "en", "rating": 2}, {"id": 504211809, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d244855-r504211809-Barcelona_Wax_Museum-Barcelona_Catalonia.html", "text": "This is one of the worst attractions here in Barcelona. It s an old museum of wax super expensive ( with a non working online Ticket ).  Some of the statues ( the Star Wars) ones were so bad that were hilarious :) ( look the pictures :) )", "publishedDate": "2017-07-21", "language": "en", "rating": 1}, {"id": 502823449, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d244855-r502823449-Barcelona_Wax_Museum-Barcelona_Catalonia.html", "text": "Expensive, like 50€ for the pack...staff were not, let's say, service committed. But, worst of all the wax figures...half of them are from people non-Spaniards would never recognize (and that is the half that is less badly executed...) the other half are hilariously ugly: manly women with square jaws and looking as if they just shaved their moustaches, same face repeated in several \"personalities\", proportions not proportional at all...\n\nWell, if you have 50 bucks or quid you want to waste...just give them to poor people...\n\nNota: the blonde lady in the Star Wars set is supposedly poor Luke Skywalker...", "publishedDate": "2017-07-17", "language": "en", "rating": 1}, {"id": 501327102, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d244855-r501327102-Barcelona_Wax_Museum-Barcelona_Catalonia.html", "text": "We meant to see this on a previous trip to Barcelona but didn't have time. I've had a fascination for wax museums ever since being taken to Louis Tussaud's in Blackpool as a child back in the 60s. \n\nThis was by no means the worst (I'll save that for the one at Mdina in Malta that gives you the history of the island). However, many of the waxworks were very old and I found the experience on the whole a bit creepy. \n\nThe laughter came from trying to work out who some of the dummies were supposed to be. England's Henry VIII appeared to have been modelled on the actor Keith Michell who played him on the BBC in the 70s, Anthony and Cleopatra on Taylor and Burton. As for Charles and Camilla.................enough said!\n\nI ended up taking photos of all the funny ones, JR Ewing looked more like a Japanese tourist and I was convinced Steven Spielberg was actually Barry Gibb of the Bee Gees! In the Star Wars section Luke Skywalker was more like Martina Navratilova and Princess Leia didn't look like anyone I'd seen before (maybe they got staff to model on their day off?). Oh, and could someone please tell me why ET was in the Star Wars bit as we had no idea?\n\nIt passed 40 minutes, but if I was you I'd do yourself a favour and go to the awesome and free Brian Eno installation in the arts centre across the street. So good we went twice and spent about 2 hours in there each time as it was so fab and relaxing.", "publishedDate": "2017-07-12", "language": "en", "rating": 3}, {"id": 500839255, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d244855-r500839255-Barcelona_Wax_Museum-Barcelona_Catalonia.html", "text": "This museum is not Madame Tussauds. Some of the figures are good, other awful. All of them outdated. The building itself is wonderful, and I recommend it to everybody interested in a geniune 'roadside' European attraction", "publishedDate": "2017-07-11", "language": "en", "rating": 2}, {"id": 497319206, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d244855-r497319206-Barcelona_Wax_Museum-Barcelona_Catalonia.html", "text": "The admission price is extreme compared to the experience. My 13 year old loved it, for me as an adult i believe it really needs an upgrade. The concept was good but the wax figures really need a higher standard. Expensive for what you receive. ", "publishedDate": "2017-06-29", "language": "en", "rating": 2}, {"id": 489445431, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d244855-r489445431-Barcelona_Wax_Museum-Barcelona_Catalonia.html", "text": "The waxworks were well presented, but I found the lighting too low to really appreciate them.  Quite gloomy and disconcerting walking around.  We were the only people there, until, just as we were going, a school group came in.  The museo closes for siesta until 4 pm.", "publishedDate": "2017-05-31", "language": "en", "rating": 4}, {"id": 482573975, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d244855-r482573975-Barcelona_Wax_Museum-Barcelona_Catalonia.html", "text": "The place is completely outdated and extremely overpriced, very creepy all together, avoid and enjoy other places in Barcelona!!!", "publishedDate": "2017-05-08", "language": "en", "rating": 1}, {"id": 473330360, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d244855-r473330360-Barcelona_Wax_Museum-Barcelona_Catalonia.html", "text": "Well - if you have many ree time, you can go and perhaps you see some interested, but for me - second time and for friend i don't recommend this palce for visit and waste time.\nWith children better you don't go - this is scary for them will be.\nPrice - this is my opinion - don't worst it...", "publishedDate": "2017-04-07", "language": "en", "rating": 2}, {"id": 472142960, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d244855-r472142960-Barcelona_Wax_Museum-Barcelona_Catalonia.html", "text": "This is not Madame Tussaud's, but it is a truly unique experience.  I can only illustrate this by noting that the first room on your tour has the deposed Shah of Iran.  The torture area is a nice ending, expect to spend no more than an hour here, but with its location and the time it requires it is a nice before or after meal activity to fill time.  Enjoy.", "publishedDate": "2017-04-02", "language": "en", "rating": 4}, {"id": 467720889, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d244855-r467720889-Barcelona_Wax_Museum-Barcelona_Catalonia.html", "text": "Definitely worth a visit after a stroll down Le Ramblas. The interior of the old bank building is interesting but the exhibits are mostly hilarious with funny little tableaux being acted out in wax and sound and light. We laughed lots and agreed it would be a spooky experience if you were there alone. Go to the little shop and bar when you exit they are also definitely worth a visit.", "publishedDate": "2017-03-15", "language": "en", "rating": 5}, {"id": 465488266, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d244855-r465488266-Barcelona_Wax_Museum-Barcelona_Catalonia.html", "text": "Although the museum is no Madame Tussaud´s, it doesn´t fall all that much shorter. You´ll find all kinds of politicial and historical characters, including Guadi, William Shakespeare and Hitler. The figurines are well made and even creepy looking as you move from room to room. We really enjoyed this visit seeing as we arrived quite late and had the museum practically to ourselves. The music and special effects were fun - you won´t want to miss this place. We decided to take the non guided tour and it set us back €15 entrance", "publishedDate": "2017-03-07", "language": "en", "rating": 5}, {"id": 452554286, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d244855-r452554286-Barcelona_Wax_Museum-Barcelona_Catalonia.html", "text": "am not fan of museums .. but i loved this one is more fun and lovely then many wax museum the style of the place is the best . different  floor ..  sound all over is was good place", "publishedDate": "2017-01-16", "language": "en", "rating": 4}, {"id": 445965254, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d244855-r445965254-Barcelona_Wax_Museum-Barcelona_Catalonia.html", "text": "We visited on a Tuesday afternoon. The museum is located at the bottom of las ramblas and quite easy to find. \n\nIt wasn't open when we arrived (3:30) so we went for a drink in the fairy tale cafe, as we had wanted to do this anyway. \n\nWe paid €11 each including the discount voucher from the tour bus. \n\nLots of wax figures and twists in the building - just when you thought you were done there was another level. \nFrom cave men to space men there was something for everyone. \nSome of the wax figures were eerily realistic, while others were.... a bit lame. But what do you expect it's a fun day out and very interesting!\nDidn't do any of the experiences as they weren't offered to us.", "publishedDate": "2016-12-21", "language": "en", "rating": 4}, {"id": 445884581, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d244855-r445884581-Barcelona_Wax_Museum-Barcelona_Catalonia.html", "text": "If there is something that is not worth visiting in Barcelona is the wax museum, yes, it is very sad to compare ours with others from other countries, save money for something else, because I can assure that it is one of the worst museums of wax You'll see.\n\nsi hay algo que no vale la pena visitar en Barcelona es el museo de cera, sí, es muy triste comparar el nuestro con otros de otros paises, ahorraros el dinero para otra cosa, porque puedo asegurar que es de los peores museos de cera que vais a ver.", "publishedDate": "2016-12-21", "language": "en", "rating": 1}, {"id": 443663892, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d244855-r443663892-Barcelona_Wax_Museum-Barcelona_Catalonia.html", "text": "If you are looking for Justin Bieber, this isn't the museum for you, but I found it well-done and entertaining.  A ton of historical figures,  some in interesting groupings (we did not get the audio guide, but that might have been helpful as my history memory is lacking).  A little dark for pictures, some of the figures were not quite right, some were creepily staring into your eyes. Definitely recommend, there is also a fun gift shop next door.", "publishedDate": "2016-12-11", "language": "en", "rating": 4}, {"id": 436343969, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d244855-r436343969-Barcelona_Wax_Museum-Barcelona_Catalonia.html", "text": "Didn't plan on visiting this museum however as we were next to it we decided to check it out. Entrance fee was quite expensive to just walk around and see wax people. The first impression was good with creepy music throughout the whole tour. Good fun to see what's in the next room. ", "publishedDate": "2016-11-11", "language": "en", "rating": 4}, {"id": 426176704, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d244855-r426176704-Barcelona_Wax_Museum-Barcelona_Catalonia.html", "text": "If you've ever been to a wax museum before, this is a different breed. The building is perfect for such an attraction, but the content stopped in the 1970s I guess. It is not updated since and seems outdated compared to other wax museums. But it's a charming museum, kind of like stepping back in time. At times we were the only visitors and that was fun. Staff didn't speak much English and was busy eating cake when I bought a catalogue (and didn't offer me some!). I think this attraction will close soon so go and see it if you enjoy wax figures (of dubious quality), architecture and a very special old wold atmosphere.", "publishedDate": "2016-10-08", "language": "en", "rating": 2}, {"id": 415384036, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d244855-r415384036-Barcelona_Wax_Museum-Barcelona_Catalonia.html", "text": "This is not Madame Tussaud's. But it's infinitely more fun. The building and settings themselves are absolutely fantastic and the figures/characters are, well, an oddball collection of people. The whole place has a quirky charm to it inviting as much laughter as bewilderment when trying to ascertain why on God's green Earth E.T. is placed next to the entire main cast of Star Wars. Or why Churchill shares the stage with Yasser Arafat and Mao Tse Tsung.", "publishedDate": "2016-09-06", "language": "en", "rating": 4}, {"id": 414013110, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d244855-r414013110-Barcelona_Wax_Museum-Barcelona_Catalonia.html", "text": "To expensive for what they had there and the worst Luke skywalker I have ever seen and the other pieces are not very good at all", "publishedDate": "2016-09-02", "language": "en", "rating": 1}, {"id": 409483120, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d244855-r409483120-Barcelona_Wax_Museum-Barcelona_Catalonia.html", "text": "El Museo de Cera from Barcelona triggers in me a combination of feelings: fascination, attraction-repulsion, mystery. It is a must visit in Barcelona, the building per se is a great visit, dark, gothic, it used to be a bank, then a palace, or the other way around. The wax statues are freaky and one cannot stop staring at them. You have to go and see it!", "publishedDate": "2016-08-23", "language": "en", "rating": 5}, {"id": 402223899, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d244855-r402223899-Barcelona_Wax_Museum-Barcelona_Catalonia.html", "text": "Horror event was fun, and staff made a good effort. I had many laughs while occasionally being impressed by the acting and parts of the show. ", "publishedDate": "2016-08-06", "language": "en", "rating": 5}, {"id": 401117699, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d244855-r401117699-Barcelona_Wax_Museum-Barcelona_Catalonia.html", "text": "they asked for exact  double the price as stated in the internet, i showed them the internet printed site just a week before going there and they would not admit to that, they even wanted me to pay for my 4 and a half year daughter without asking for her age first, but another tourist told him that there should be a free admission to kids under five, so the little one did not have to pay, but an adult and a kid payed 24 euros instead of 12 that they had put on in the internet site, the manager stated he wont speak english and just left the p[lace and a young lady  just told me that the pricec i showed her were from 2006 although it was from 2016!! so i told her to change the stated facts in the internet she said ok, no sorry nothing\n in the internet site they also write that there is a fairy cafe near by, this is so untrue also, its just a shop where they sell overpriced items and maybe i am not sure at some point in time they will offer coffe to minimum amound of people as i saw 3 hanging chiars, of course they wil charge you\n but the chairs were not in use when we wr=ere there in the afternoon, but it was just a store and not a fairy caffee....\n we were so dissapointed to make  the whole trouble, promise our girls a fairy caffe and end up paying double the price for a minimal wax museyum where we could have done so many other things in barcelona...such a waste of time and money", "publishedDate": "2016-08-03", "language": "en", "rating": 1}, {"id": 395446261, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d244855-r395446261-Barcelona_Wax_Museum-Barcelona_Catalonia.html", "text": "The museum quite a bit, compared to the other museums such as Madame Tussauds, the tour was quick about half an hour, the museum is located at the beginning of La Rmbla Street, it contains some statues of historical figures, scientists, and Presidents of countries, some features of the statues is not perfect, but it was an enjoyable visit to my family", "publishedDate": "2016-07-22", "language": "en", "rating": 3}, {"id": 390323621, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d244855-r390323621-Barcelona_Wax_Museum-Barcelona_Catalonia.html", "text": "I don't think there has been any new figures introduced to this museum in the 21st century. If you have been to wax museums in other countries, and unless you are particularly interested in some Catalan or Spanish celebrities (old ones, no new, of course), it is definitely not worth the 15€. ", "publishedDate": "2016-07-08", "language": "en", "rating": 1}, {"id": 389588213, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d244855-r389588213-Barcelona_Wax_Museum-Barcelona_Catalonia.html", "text": "I liked wax museums. I visited one in Barcelona. It is situated near Las Ramblas. And it is inside another rich neoclassic architecture building. You can admire the building before entering. Inside there are over 200 pieces of wax made figurines. \nThe museum is divided into many rooms, such as the Patio of Crystal, the Gothic Room, and others.  Every room is full of glorious figures. Take your time. Most of the wax figures are related to the history of Spain, including literature, art, music, and others. The museum will engage you in culture, art, fantasy, music and literature. The flamenco dancers and the artist Salvador Dali impressed me. They looked so real! You will also see king and queens. As you see the wax figures let your imagination wander! \nThe museum also offers evening sessions, such as the horror show. \nYou would need a couple hours to enjoy this attraction. The entrance is 15 euros per adult and 9 for children. There are two more areas to see but you would need to pay more. These additional rooms are the Bosc de les fades, and enchanting forest and the Passatge del temps, an origami heritage kind of place. \nThe museum is located in C Josep Anselm Clave 3, 08002, Barcelona.", "publishedDate": "2016-07-05", "language": "en", "rating": 4}, {"id": 388275139, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d244855-r388275139-Barcelona_Wax_Museum-Barcelona_Catalonia.html", "text": "Guys this is a must!  I've never in my life had such a great horror experience like this one.  The tickets to the horror experience sells for 18eur and it lasts for 50 mins the show too good everything is realistic specially that they make it inside the wax museum where the figures adds more reality to the whole thing. ", "publishedDate": "2016-07-01", "language": "en", "rating": 5}, {"id": 385926369, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d244855-r385926369-Barcelona_Wax_Museum-Barcelona_Catalonia.html", "text": "the price was expensive=with a family of 4 we didn't go in. from the outside one can see several classic characters. liked the ally its located on. Attractive exterior", "publishedDate": "2016-06-25", "language": "en", "rating": 3}, {"id": 383088436, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d244855-r383088436-Barcelona_Wax_Museum-Barcelona_Catalonia.html", "text": "Having visited wax museums else where. We were keen to visit another. I remember well in London being photographed arguing with the president of the USA. The figures there looked so life like. The figures here looked like wax ones and not really very good likeness's either. I have attached a photo of their version of Prince Charles, so you may be your own judge. Also the Museum is very poorly lit. I could not read the name plates on many of the exhibits and they certainly needed name plates.", "publishedDate": "2016-06-16", "language": "en", "rating": 2}, {"id": 370979088, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d244855-r370979088-Barcelona_Wax_Museum-Barcelona_Catalonia.html", "text": "The tickets can be purchased at a ticket booth on the ramblas in front of the museum,\nthe girl in the ticket booth was very kind unlike the staff at the reception of the museum. \nThe staff was still speaking spanish to us even when we said we don't understand spanish. then they got tired i guess and one of the two suddenly started speaking english....... but the museum itself is very interesting. \n\nSpanish and Catalonian history figures as well as internationally known figures (Steven Spielberg, Indiana Jones, E.T., star wars figures.\n \nWhen visiting without audio guide you probably can see it all in about 30 minutes. with audio guide it takes around 1u30min.\n\nThere is a 'horror' room (different ways of executing) that cannot be skipped. \n\nEntrance fee is 15€ but with barcelona card 12€ a audioguide is 3.5€ and a deposit (Like ID Card or Hotel Key) is required since the exit is a other door then the entrance and u dont need to pass the reception anymore, so that's understandable i think.", "publishedDate": "2016-05-07", "language": "en", "rating": 4}, {"id": 355530241, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d244855-r355530241-Barcelona_Wax_Museum-Barcelona_Catalonia.html", "text": "Situated at the end of the Rambles, this museum is tucked away down an alley. There is a booth on the main part of the Rambles where you can purchase tickets, but my advice is don't!\n\nWhen I walked in I didn't recognise any of the wax models as they were Spanish, which is fair enough. However when I got to \"Winston Churchel\" I didn't recognise him either, mainly due to the fact that the model looked nothing like him.\n\nAfter a while it becomes slightly funny that none of the models look like who they are supposed to. It seems that they have just brought a job lot of store mannequins and dressed them up.\n\nI would recommend that you give this place a miss as Madame Tussauds it is not.", "publishedDate": "2016-03-15", "language": "en", "rating": 2}, {"id": 350383381, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d244855-r350383381-Barcelona_Wax_Museum-Barcelona_Catalonia.html", "text": "I liked the all \"old athmosphere/nostalgia\" we have when entering the museum. I dont think its so small. People that saw it in 20 min were probably running. I took 1 hour and i was reading and observing all the carachters. The only thing i didnt like was the price (15eur). Besides that everyhting was nice.", "publishedDate": "2016-02-23", "language": "en", "rating": 3}, {"id": 346132566, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d244855-r346132566-Barcelona_Wax_Museum-Barcelona_Catalonia.html", "text": "This is not just a museum displaying wax statues. To each room there is a theme, an atmosphere, mechatronics and audio queues that compliments the figures. \nBesides the normal visit there are two Horror experiences.", "publishedDate": "2016-02-09", "language": "en", "rating": 5}, {"id": 324841158, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d244855-r324841158-Barcelona_Wax_Museum-Barcelona_Catalonia.html", "text": "Me and my friends visited Barcelona for a long weekend a few years ago\nAll I seem to read is negative reviews especially on social media sites\n\nTherefore all the amazing adventures that I have been on and enjoyed I am going back and writing a little review \n\nMe and my friends loved visiting all the different museums in Barcelona\n\nWe visited the museum erotica and the wax museum on the same day and loved both \n\nThe wax museum here is Barcelona is so much different to the ones in the UK\nIt was not very commercial nor did it have Alan Carr and David Beckham wax features\n\nIt had a bit of history and character to the museum \n\nI would recommend a visit \nIdeal for couples, friends and families although small children may not find it as exciting as the beach 😊", "publishedDate": "2015-11-06", "language": "en", "rating": 5}, {"id": 319851563, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d244855-r319851563-Barcelona_Wax_Museum-Barcelona_Catalonia.html", "text": "Having never been to a wax museum and reading some of the reviews went to this with no expectations.\n\nWe were pleasantly surprised, the pieces are all well presented and every care seemed to go in to making the details of each exhibit match the theme.\n\nI think it was money well spent.", "publishedDate": "2015-10-18", "language": "en", "rating": 4}, {"id": 319346384, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d244855-r319346384-Barcelona_Wax_Museum-Barcelona_Catalonia.html", "text": "I went with my children ,i think it was worth the 15 euro,as my children are interested in history ,so loved it all,but yeah was a bit scary ,there is a submarine bit u have 2 go through ,my children ages 8 and 9 would not go through ,but a good scary experience lol", "publishedDate": "2015-10-16", "language": "en", "rating": 4}, {"id": 318490107, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d244855-r318490107-Barcelona_Wax_Museum-Barcelona_Catalonia.html", "text": "Didnt expect much but for 15 Euros deffinitely worth the visit! There is a nice \"fairy tale\" bar right at the exit of the museum!", "publishedDate": "2015-10-14", "language": "en", "rating": 4}, {"id": 309695402, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d244855-r309695402-Barcelona_Wax_Museum-Barcelona_Catalonia.html", "text": "Old, tired and figures not nice... Was really looking forward to it but as soon as I entered I knew it wouldnt be good and I was right. No people, no!! You need an upgrading, you need to remove a lot and add new. ", "publishedDate": "2015-09-12", "language": "en", "rating": 1}, {"id": 308901741, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d244855-r308901741-Barcelona_Wax_Museum-Barcelona_Catalonia.html", "text": "Wow in this wax Museum it seems like the figures are alive and watching you.   You do get a sense that they are not happy to be there.   LOL Great fun for the whole family!", "publishedDate": "2015-09-10", "language": "en", "rating": 4}, {"id": 302628823, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d244855-r302628823-Barcelona_Wax_Museum-Barcelona_Catalonia.html", "text": "The wax model are not quite so realist...and they don't have many known for all people characters. It is not worst, but they are better things to do and spend you're many in Barcelona", "publishedDate": "2015-08-23", "language": "en", "rating": 3}, {"id": 302619868, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d244855-r302619868-Barcelona_Wax_Museum-Barcelona_Catalonia.html", "text": "We had actually gone to have a drink in the 'fairy bar' which my partner had wanted to go to, and then found out that the bar is part of the wax museum and right next to it, so after a drink we headed to the wax museum.  We found to our slight confusion a billboard outside advertising something called 'INFECTION' with zombie imagery.  There was no entry to the wax museum for just a wander round, it was only the infection 'experience', so we did it.\n\nIt involves an hour of attempting to solve a 'mission' post-apocalypse/ virus/ invasion in a very dark building populated by 'zombies' with clues to solve.  \n\nIt's a beautiful building and it's fun having the run of it.  It was well acted - you were split into teams, got a briefing from a 'marine' and are given a torch, clue card and headphones through which you get instructions - nothing else. (Note: Ask for a gun!!)\n\nInside the building it's dark, the wax sculptures are even more creepy and its surprisingly scary when you find yourself face to face with a 'zombie'.  We failed spectacularly in our 'mission' to get a virus vaccine as we didn't even understand the instructions, but good fun late at night with a friend or a few.\n\nFYI:\n- All instructions are in English.\n- The museum & fairy bar are situated just off Las Ramblas - very convenient location.\n- Cost 18 Euros (£13) \n- Experience lasts an hour\n- Probably too scary for kids under 15 or 16\n\nTip: Take off your headphones at least once, briefly (or drop them in a panic like I did) and see how weird it is to be in a dark building with random people running around and the occasional swearword in otherwise complete silence.", "publishedDate": "2015-08-23", "language": "en", "rating": 4}, {"id": 302182082, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d244855-r302182082-Barcelona_Wax_Museum-Barcelona_Catalonia.html", "text": "We arrived early morning straight off the Metro.  It was to be a relaxing day with no planning involved, unlike me, and this was the first little place we seen, so why not.  After purchasing 2 adult tickets boy am i glad i didn't opt for the grand package, ha ha.  The trip inside killed a half hour at best and the best part of it was the alleyway leading to it and the architecture of the outer building itself.  \n\nMy advice is don't bother with here, head down to the docks and grab a return 40 min boat ride for €7.50 now thats VALUE FOR MONEY\n\nI have pictures included so you can make up your own mind", "publishedDate": "2015-08-22", "language": "en", "rating": 2}, {"id": 301515139, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d244855-r301515139-Barcelona_Wax_Museum-Barcelona_Catalonia.html", "text": "Paid 15 euro each and thought the place was OK but not great. Its certainly not Madame Tussauds standard but to be fair neither is it the same price. Overall my 13 year old daughter and I enjoyed the visit (especially the submarine and chamber of horrors) but it did seem a little expensive for the time taken to walk around.", "publishedDate": "2015-08-20", "language": "en", "rating": 3}, {"id": 299795568, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d244855-r299795568-Barcelona_Wax_Museum-Barcelona_Catalonia.html", "text": "I feel that some of the reviews on here have been a little harsh towards this museum. \n\nWe visited the Museo de Cera with a discount voucher from our tourist bus trip during our last day in Barcelona, making it €12 each for a ticket. I found this to be very reasonably priced. \n\nInside the museum's interesting building, we found that it was very quiet, enabling us to really take our time to enjoy the waxworks on offer. \n\nYes, there were some that I didn't recognise, but a even a partially educated person would know at least 70% of the statues. (Or at the very least their names on the wooden plaques.)\n\nThe rooms were split into different themed areas, with lighting effects and mechanical display areas - although some of these could do with a little oil. Some may also be quite frightening for young children. \n\nThe Star Wars themed area was a personal highlight. I have never seen anything as amusing in a museum before. Look out for another character from a separate blockbuster making a strange appearance. \n\nOverall, the museum is far from perfect and holds some 'interesting' interpretations of famous faces. Yet we had a great time here and came out very happy with the experience. \n\nIf you are on a strict budget or want to see quality pieces of wax artwork, this probably isn't the museum for you. \n\nOn the other hand, if you have some euros and time to spare. Visit this museum for a truly unique experience. I certainly did not regret my decision to visit. ", "publishedDate": "2015-08-16", "language": "en", "rating": 3}, {"id": 299134748, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d244855-r299134748-Barcelona_Wax_Museum-Barcelona_Catalonia.html", "text": "A great way to spend a morning! Yes,a lot of the statues are interesting looking to say the least! But there are some lovely set ups, and the lift into the deep sea area was a special favourite!", "publishedDate": "2015-08-14", "language": "en", "rating": 4}, {"id": 295911257, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d244855-r295911257-Barcelona_Wax_Museum-Barcelona_Catalonia.html", "text": "The wax museum, just off La Rambla, is well worth a visit. It is laid out on several floors. The wax figures may not always look exactly authentic, but they are shown for example as historic, cultural, music, royalty collections, and definitely interesting. Towards the end unexpected parts turn up. My 13 and 16 year olds really enjoyed the museum. The museum is a private enterprise which may explain the rather high entrance ticket, but a visit is still worth it.", "publishedDate": "2015-08-05", "language": "en", "rating": 5}, {"id": 294341961, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d244855-r294341961-Barcelona_Wax_Museum-Barcelona_Catalonia.html", "text": "Barcelona Wax Museum is a neo-classical style building, you can pass through scenes full of surprises and admire the skill of the creators of this space. It's located in a small square just off La Rambla boulevard.\nIf you want to visit Barcelona Wax Museum, I can tell you that this experience goes even further into the fantasy with a variety of creative decors and audio-visual effects meant to enrich your visit and make it as authentic as possible. It's not just a simple museum where you look in silent...\nFee entrance (admission): €15.00\nArrival: Metro: Drassanes (L3); Bus Turistic: Colom - Museu Marítim\nOpening: Mo.-Fr. 10.00-13.30 and 16.00-19.30; Sa., Sun., holidays 11.00-14.00 and 16.30-20.30.", "publishedDate": "2015-07-31", "language": "en", "rating": 4}, {"id": 290482886, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d244855-r290482886-Barcelona_Wax_Museum-Barcelona_Catalonia.html", "text": "Nothing to do with a real Wax Museum like the original in London - waste of time and waste of money - sorry", "publishedDate": "2015-07-19", "language": "en", "rating": 1}, {"id": 288852511, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d244855-r288852511-Barcelona_Wax_Museum-Barcelona_Catalonia.html", "text": "Very cool place it's worth the price we paid 15 euro per ticket. \n\nThis was the best wax museum I have ever been to beats LA and Tijuana San Francisco the best \n\nYou should go ", "publishedDate": "2015-07-14", "language": "en", "rating": 5}, {"id": 283552170, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d244855-r283552170-Barcelona_Wax_Museum-Barcelona_Catalonia.html", "text": "It might seem like the fee is a bit high but it's well-worth it. While on the first level you'll see some really great figures, the actual magic starts once you get on the elevator. ( I won't spoil the surprise). One thing I would improve is the setup upstairs, the figures are rather crowded and do make one a bit antsy about bumping into them.", "publishedDate": "2015-06-28", "language": "en", "rating": 5}, {"id": 277988349, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d244855-r277988349-Barcelona_Wax_Museum-Barcelona_Catalonia.html", "text": "A little strange and full of figures Spanish visitors may know but not the general public.\nStill interesting but actually one of the most expensive tickets in town for some reason.\nGlad I went, but would bother going back.\nPlenty of better things to see before this museum near port end of Las Ramblas ", "publishedDate": "2015-06-04", "language": "en", "rating": 3}, {"id": 274265473, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d244855-r274265473-Barcelona_Wax_Museum-Barcelona_Catalonia.html", "text": "It was a late day for us and this was one of the only attractions open late on a Sunday. It had a flair to it for sure. One of the better wax museums we have visited. It was very hot walking through the museum. And the wax people were not as realistic as some of the other ones we visited. But I delighted in the presentation of each wax people. I am not into horror films or wax people that played in horror films, and that is the exiting exhibits that you will see. It may be scary for little ones. Also note, when you get to the top floor via stairs you can only go down via an elevator. The elevator takes you down to a floor with more exhibits. . . and then the exit.", "publishedDate": "2015-05-24", "language": "en", "rating": 3}, {"id": 264262153, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d244855-r264262153-Barcelona_Wax_Museum-Barcelona_Catalonia.html", "text": "It is not included in the must do thing in Barcelona, but since you pay a visit you will ask yourselves why... It is a fantastic experience walking among all those significant personalities of the history or pose for a picture in front of a lot of imaginary characters! The visit was amazing and the layout of the museum also helps to feel like being in an adventure!", "publishedDate": "2015-04-07", "language": "en", "rating": 4}, {"id": 263013834, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d244855-r263013834-Barcelona_Wax_Museum-Barcelona_Catalonia.html", "text": "The building looks interesting from outside but collection inside is nothing special at all and you pay 15 eu. Sculptures don't really look much alike to those famous people they stand for. Lots of spanish celebrities which are not really famous for the rest of world. Disappointed", "publishedDate": "2015-04-01", "language": "en", "rating": 2}, {"id": 254222724, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d244855-r254222724-Barcelona_Wax_Museum-Barcelona_Catalonia.html", "text": "Over all it was nice but it was too scattered, some areas were too tooooo dark so I had to use my phone light. it would not take more than 15 mins to finish so it's good to spend some time in Rambla street. ", "publishedDate": "2015-02-14", "language": "en", "rating": 3}, {"id": 252649650, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d244855-r252649650-Barcelona_Wax_Museum-Barcelona_Catalonia.html", "text": "I didn't find some of the waxworks particularly good likenesses. Not up to the standard of similar museums. OK for a quick look round but doesn't justify the expense. Opted for the audio guide at additional cost, which I think was a mistake. The receptionist then wanted a deposit/passport as security but relented after some heated debate.", "publishedDate": "2015-02-04", "language": "en", "rating": 2}, {"id": 247532070, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d244855-r247532070-Barcelona_Wax_Museum-Barcelona_Catalonia.html", "text": "Tj pkace itself is beautiful..the msnsion is very old and inside are themed areas with music backround....from submurine to the moon...gangsteres...alice in winderland..it was realy realy worth our time and money:)", "publishedDate": "2015-01-05", "language": "en", "rating": 5}, {"id": 246812340, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d244855-r246812340-Barcelona_Wax_Museum-Barcelona_Catalonia.html", "text": "We visited the wax museum after spotting a poster advertising it, and seeing that it was still open (we visited at around 9pm so you can go during the day or night).\nSome of the waxworks are a good likeness and some aren't... It is, by no means, Madame Tussaud's, but for €15 I'd say it's worth a visit and the different sections/exhibitions were very well put-together.\nThe staff were friendly and helpful too. :)", "publishedDate": "2015-01-01", "language": "en", "rating": 4}, {"id": 241746912, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d244855-r241746912-Barcelona_Wax_Museum-Barcelona_Catalonia.html", "text": "I visited this place today & loved it.I of course didn't know the all the Spanish & Catalan works but sure it was just a bit of fun.I really liked the diffrent areas from history to movies to SIFI & horror & for those who are looking for the dummy's to demonstrate some accuracy of the persons they are ment to portray will be slightly dissipointed.I found it to be very funny& to be taken light hearted.I also found the staff to be very friendly.I feel the price is very high at €15 per person & they should take a serious look at this.\n\nWax models of the starwars cast not to be missed as its one of the funniest things I've ever seen.", "publishedDate": "2014-11-27", "language": "en", "rating": 4}, {"id": 236986580, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d244855-r236986580-Barcelona_Wax_Museum-Barcelona_Catalonia.html", "text": "The pricing seemed fair to me, we were a small group of teens. I enjoyed most of the figures and good a few laughs in the tour. I recommend it, if you have time the area. The staffed seemed nice and they were helpful.", "publishedDate": "2014-10-29", "language": "en", "rating": 4}, {"id": 227492415, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d244855-r227492415-Barcelona_Wax_Museum-Barcelona_Catalonia.html", "text": "It was only €15 per adult which I think is very good. Okay I didn't know most of the people in there but I enjoyed the visit anyway. The wax work was very good and quite realistic. I would have loved to have come back for the horror show they were advertising.", "publishedDate": "2014-09-07", "language": "en", "rating": 4}, {"id": 226982804, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d244855-r226982804-Barcelona_Wax_Museum-Barcelona_Catalonia.html", "text": "When my kids were younger it was funny. Babies don't know Hitler or cleopatra but teenagers do - hint the resemblance of the statues was embarrassing. \n\nAs a family we paid just under. €40. The walk around took us less than 20 mins. It just was not worth it want educative or gripping. If you have been to London's Madame Tusuads you'd know what it mean. \n\nI promise you will regret this the moment you enter. It is old and tired. The staff even look as bored as wax. \n\nGood side is the have nice modern design shop just out side - bit pricey though. ", "publishedDate": "2014-09-04", "language": "en", "rating": 1}, {"id": 226613433, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d244855-r226613433-Barcelona_Wax_Museum-Barcelona_Catalonia.html", "text": "While doing a hop-on-hop-off tour of Barcelona my wife and I decided to spend some time at this museum as we had never been to a wax museum before.\nBeing a lover of museums and very interested in history I enjoyed this museum.\nI found it fascinating to view an exhibition of the two American Wright brothers aviation pioneers who invented and built the world's first successful aircraft. The first controlled powered human flight was made in 1903.\nIronically a bit further on there is an exhibition of Apollo 11 that was the spaceflight that landed the first humans on the Moon in 1969, only 66 years later!\nThe visit to this museum also broadened my knowledge as it prompted one to read up more about some historical figures on display there.\nRegarding the figures of historical leaders dating back many centuries one can’t really say how true to life they are. To me the display of Julius Caesar & Cleopatra was also very good. This Roman general played a critical role in the events that led to the rise of the Roman Empire in 60 BC. Caesar is considered by many to be one of the greatest military commanders in history. The exhibition of Napoleon & his first wife Josephine was also very good where he is shown in his famous hand-in-waistcoat gesture. Some historians say that this gesture was because of a chronic stomach pain he had, while others allege that he might have had an itchy skin disease. He remains one of the most studied political and military leaders in all of history.", "publishedDate": "2014-09-03", "language": "en", "rating": 4}, {"id": 225910067, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d244855-r225910067-Barcelona_Wax_Museum-Barcelona_Catalonia.html", "text": "There were many wax statues of known people I would say grouped well together.  However the likeness to the person was not very good.  Coming from Kolkata, I would say that Mother Teresa did not look anything like her.  However, I would advise anyone visiting to have their photo taken as we did as Cleopatra and Marc Antony.  It was just something to remember the visit.   But on the whole the museum was average.", "publishedDate": "2014-09-01", "language": "en", "rating": 3}, {"id": 224443942, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d244855-r224443942-Barcelona_Wax_Museum-Barcelona_Catalonia.html", "text": "I'm just gonna go ahead and say it: it's a big pile of stinky no-no. Especially if you saw the one in London you should not bother to go in. The quality of most of the statues is almost hilariously bad, and only a few are ok. And another thing that bothered me a lot is that unlike Madame Tussauds, where most of the wax statues are well known people, actors, artists, here quite a lot of them are just some wax dummies as you'll see from the pictures I'm gonna upload.. There is also a temporary horror exibition which I haven't seen.  On the days of the exibition the regular wax museum is closed.", "publishedDate": "2014-08-25", "language": "en", "rating": 2}, {"id": 220996821, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d244855-r220996821-Barcelona_Wax_Museum-Barcelona_Catalonia.html", "text": "its just waste of money and time, dont go there, i bought two tickets in 36 euros for night show, they includes too many peoples in one show and we moved as a mob, they didnt  allowed to take pictures & not mentioned at the time of purchasing tickets. too much dark inside even u cant see the dummy's . ", "publishedDate": "2014-08-10", "language": "en", "rating": 1}, {"id": 220513369, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d244855-r220513369-Barcelona_Wax_Museum-Barcelona_Catalonia.html", "text": "At euro15 each, with other price options to include audio and, a bit misleading advertising I am giving this attraction a poor rating.\nWax figures we're cool to see but nothing overly impressive, certainly not for the price (but we all have our own preferences).  For half the price you can visit historical, architectural and artistry up up up the hill.\nThe misleading advertising I'm referring to is with regard to the wax museum 'horror' exhibit. I went back and surveyed the posters on La Rambla and at the entrance and none of them showed that it was only operated during evening hours.  The only place we were shown the hours upon asking was on a board at the ticket window adjacent to the entrance.\nSo, be warned if special exhibits are taking place you need to buy a ticket for that, or enter at those times only.  You can only enter once with your purchased ticket.  We entered and inquired on the horror exhibit and were taken back out, shown the hours and told we could not exchange or reuse the tickets for that time, only buy new ones.", "publishedDate": "2014-08-08", "language": "en", "rating": 2}]}}]