[{"locationId": 10713220, "name": "Playa de Sant Miquel", "placeType": "ATTRACTION", "reviewListPage": {"reviews": [{"id": 704594661, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d10713220-r704594661-Playa_de_Sant_Miquel-Barcelona_Catalonia.html", "text": "This beach used to be lovely- 10 euros a sunbed and good beach restaurants where you could pick up salmon tartare for under 10 euros. Wow how its changed. Now there are hardly any sunbeds and the cost has doubled to 20 euros each.....quite the most ridiculous price!! Unsurprisingly they were mostly empty and instead the beach was rammed with people sitting on the towels they had been pressurised into buying by the fifty or so Indians selling/ renting them and umbrellas. It's impossible to sit and read a book without being constantly interrupted by a hawker trying to sell massages/tattos/towels/umbrellas/water/beer/sangrias/mojitos/doughnuts(really!)/club nights out....and even the local restaurants own waiter comes out onto the sand every 5 minutes to sell drinks at the top of his voice...and if you are unlucky enough to be sitting beside him when he serves a bottle of bubbly the scream that accompanies the pop of the cork makes you want to ram the bottle somewhere unmentionable!! If you add to this a dirty sea from the boats and while we were here an unexploded bomb in the water, all in all we wont be returning to barcelona anytime soon, which judging by the amount of tourists here this year is probably a fact welcomed by the beaten down locals. Barcelona I feel sorry for you...you've changed!", "publishedDate": "2019-08-30", "language": "en", "rating": 1}, {"id": 687172564, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d10713220-r687172564-Playa_de_Sant_Miquel-Barcelona_Catalonia.html", "text": "The beach is huge.  The look is wonderful.  More very cold.  Definitely take a day off for the beach.  People who sell are very boring, you can not rest on their own.  100 times you have something (from massage to towel) you simply can not get rid of them.  Along the beach you have plenty to eat and drink :) the prices are ok.  People who ride you in those bicycles.  Beware of the driver asking for the price first.  20 EU are looking for 2 kn.", "publishedDate": "2019-07-06", "language": "en", "rating": 3}, {"id": 682699496, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d10713220-r682699496-Playa_de_Sant_Miquel-Barcelona_Catalonia.html", "text": "Nice city beach, close to the town to walk, run or just chill out. Good choice of restaurant can be found around.", "publishedDate": "2019-06-19", "language": "en", "rating": 4}, {"id": 647682045, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d10713220-r647682045-Playa_de_Sant_Miquel-Barcelona_Catalonia.html", "text": "This beach which is located between the beaches of Sant Sebastia and Barceloneta is close to the town and oposite the Plaza del Mar. It is close to the port and is one of the oldest beaches around. It was named after the Church of San Miguel de la Port which was built in 1755.The beach has all the facilities needed including toilets and Wi Fi (must have Wi Fi on a beach!) The historical area around the beach is also interesting with many bars and restaurants.", "publishedDate": "2019-01-22", "language": "en", "rating": 3}, {"id": 593687302, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d10713220-r593687302-Playa_de_Sant_Miquel-Barcelona_Catalonia.html", "text": "This beach is usually nice but this year all the sunbeds are gone except of on two spots where they have about 20 each, and they cost 20 euros each compared to last year when they were 10 euros each. So it is not what it used to be...", "publishedDate": "2018-07-06", "language": "en", "rating": 2}, {"id": 593552110, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d10713220-r593552110-Playa_de_Sant_Miquel-Barcelona_Catalonia.html", "text": "The beach is nice enough. It's very clean, and there's all the amenities you need close by; toilets, bars, restaurants, shops. It is VERY busy though. You will get a spot on the beach to lay down and relax, but it might not be the spot you want. The toilet are also pretty grim, particularly towards the end of the day. The sand is somewhat rocky, and not too fine, but it isn't an issue when walking on it. The weather was nice when we first went, and it was lovely to lay down there and enjoy the sun. Be careful of pick pockets down the boardwalk as they are apparently notorious down there.", "publishedDate": "2018-07-06", "language": "en", "rating": 3}, {"id": 583798982, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d10713220-r583798982-Playa_de_Sant_Miquel-Barcelona_Catalonia.html", "text": "What a beautiful well kept beach. The sand is golden and the water is lush blue. There are nice bats and restaurants along the beach which serve tapas and other dishes. ", "publishedDate": "2018-05-29", "language": "en", "rating": 4}, {"id": 568541706, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d10713220-r568541706-Playa_de_Sant_Miquel-Barcelona_Catalonia.html", "text": "It's a shame that this lovely area is tainted by the despicable pickpocket gangs that hang around here.  The Police know they hang around this area, they know the gangs target tourists on the beach, on the path, on the walkway, in restaurants, bars and just enjoying the sun sitting on the benches. \n\nApart from this, the area is really nice.  It's pretty with sand sculptures (see pic) with a great energy in this part of the beach.  Although the beach itself is really good for swimming and enjoying the sun, don't leave a single item unsupervised on the sand or it's the last you'll see it. \n\nIdeally I'd like the locals to push for a clean up of this area, so that their establishments are worry free for tourists.", "publishedDate": "2018-03-24", "language": "en", "rating": 3}, {"id": 411750115, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d10713220-r411750115-Playa_de_Sant_Miquel-Barcelona_Catalonia.html", "text": "Can recommend the beach - it is very nice to have a real god beach in this large city with a very nice harbour and bay area, fine for kids also", "publishedDate": "2016-08-28", "language": "en", "rating": 4}]}}]