[{"locationId": 4880672, "name": "Parroquia de San Agustin", "placeType": "ATTRACTION", "reviewListPage": {"reviews": [{"id": 690704695, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d4880672-r690704695-Parroquia_de_San_Agustin-Barcelona_Catalonia.html", "text": "The Parroquia de San Agustin is a parish church located in the El Raval district of Barcelona. I was actually just walking back from the Rambla El Raval to my hotel when I saw a large crowd of Filipinos around a church. It turned out there was a large party from the Philippines attending mass at this church, so I thought I go in anyway.\n\nBecause there was a service, I stayed back as much as possible. I could see that the church is a mix of Baroque and Neo-Palladiam, with an alter that features an image of St. Augustine. Some of the chapels were quite attractive rather than magnificent, the Chapel of the Brotherhood of the Great Power and of the Hope Macarena being case in point.\n\nThe church is nice enough, but I certainly wouldn't go out of the way to see it.", "publishedDate": "2019-07-18", "language": "en", "rating": 4}, {"id": 643774862, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d4880672-r643774862-Parroquia_de_San_Agustin-Barcelona_Catalonia.html", "text": "An impressive and large place of worship in a square off Las Ramblas.  It is an area that had small groups of men gathered together that left us feeling not too secure - the inside of the Church is a quiet place of sanctuary from what surrounds it.  It is a large area that is both beautiful yet understated, especially compared to other places of high ornamentation.", "publishedDate": "2019-01-05", "language": "en", "rating": 4}, {"id": 625271884, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d4880672-r625271884-Parroquia_de_San_Agustin-Barcelona_Catalonia.html", "text": "We came across this beautiful church late at night when we were pub and bar hopping in the eclectic and vibrant Raval neighbourhood. \nThe church looks amazing from the outside, a stunning Baroque facade that is so very pleasing on the eye. \nThere's quite a few restaurants and bars outside the church ,we had a beer sat outside were we took in the beautiful views afforded from here of the church. \nOn my next holiday to Barcelona next year I am going to make a point of revisiting this church in the day time and check out the interior.\nParroquia De San Agustin is easy to locate on Plaça Sant Agusti.\nA beautiful church, well worth checking out if your in the area. ", "publishedDate": "2018-10-15", "language": "en", "rating": 5}, {"id": 505234290, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d4880672-r505234290-Parroquia_de_San_Agustin-Barcelona_Catalonia.html", "text": "I had seen this large Latin Cross church the last time I was in Barcelona and mistakened it for the Antic Hospital Santa Crue. Being such a significant sized structure, I wanted to visit on this trip especially visiting so many sights in El Raval. After visiting the Hospital and waiting for our lunch restaurant  to open, I visited the church on my own. \n\nI found it it again to be as large as any of the older churches like Santa Maria del Pi or Sants Just i Pastor, however newer. I would say it had great bones but just needed some renovation work. Unfortunately I lost my pictures of the church but I found its interior beautiful and very spacious. Much like Raval, the church seemed to be emerging in a Renaissance of the area. I hope it continues to experience that as it was a great structure and easy to stop in for a quick view and prayer while in El Raval.", "publishedDate": "2017-07-24", "language": "en", "rating": 4}]}}]