[{"locationId": 6499629, "name": "Church of San Felipe Neri", "placeType": "ATTRACTION", "reviewListPage": {"reviews": [{"id": 725223070, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d6499629-r725223070-Church_of_San_Felipe_Neri-Barcelona_Catalonia.html", "text": "We were taken here to see the effects of the bombing during the civil war.\nThe tiny church of Sant Felip Neri is tucked away in a hidden corner of the Gothic Quarter: a little square with a romantic atmosphere which bears the same name. The baroque yet austere façade bears the scars of bombing.. However, it is the pock-marked walls that attract our attention the most. These wounds etched into the stone of Sant Felip Neri are a reminder of the aerial bombardment that took place in January 1938 at the height of the Civil War, ending the lives of 42 people, many of them children, who had taken shelter in the basement of the convent. The finger of fate dictated that a bomb would fall right on top of the shelter. (quoted from website as of interest)", "publishedDate": "2019-11-09", "language": "en", "rating": 4}, {"id": 685468122, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d6499629-r685468122-Church_of_San_Felipe_Neri-Barcelona_Catalonia.html", "text": "We literally stumbled upon this beautiful church. On the way to the Picasso Museum, I noticed the doors and now am ever so happy we experienced this beautiful but understated church. The atmosphere more spiritual than the more popular sites, so if you have an opportunity, be sure to add this to your list!", "publishedDate": "2019-06-30", "language": "en", "rating": 5}, {"id": 650550206, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d6499629-r650550206-Church_of_San_Felipe_Neri-Barcelona_Catalonia.html", "text": "This was a very interesting landmark - the Church of San Felipe Neri - has battle scars all around the exterior.  The fountain has a full story around it as well.  If you visit this landmark, you can explore the story and history of this church. It is right in the heart of Barcelona, so it is definitely worth a visit of you are in the area.", "publishedDate": "2019-02-06", "language": "en", "rating": 5}, {"id": 642240955, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d6499629-r642240955-Church_of_San_Felipe_Neri-Barcelona_Catalonia.html", "text": "I'm afraid I can't comment on the church's interior as I went there in the afternoon on my final day to find out it closed at 1pm in winter. It's not much to look at from the exterior but does have some nice architecture above it's main front door. It's set in a small square and has a small fountain in front of it that wasn't working.", "publishedDate": "2018-12-29", "language": "en", "rating": 3}, {"id": 579972147, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d6499629-r579972147-Church_of_San_Felipe_Neri-Barcelona_Catalonia.html", "text": "The shrapnel gashes in the stone façade are a solemn reminder of the bombing that occurred here in 1938 during the Spanish Civil War.  However, once you walk inside this baroque-style church finished in the late 1700s, you enter into a warm and comforting church that has a lovely main altar and side altars.  We were fascinated by the 2nd floor pews that had screens on them to mask the occupants. We were told that the church is not open to view on a regular basis, so if you are there and it is open, take advantage of the opportunity.", "publishedDate": "2018-05-13", "language": "en", "rating": 4}, {"id": 484919996, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d6499629-r484919996-Church_of_San_Felipe_Neri-Barcelona_Catalonia.html", "text": "The church is very welcoming. It’s relatively small but rather interesting; located in a beautiful and peaceful little square in the Gothic District of Barcelona, close to the Cathedral. The façade is very sober and shows some holes and other irregularities which are the aftermath of the bombardment having taken place on January 30th 1938 during the Spanish Civil War. Above the entrance door in a niche there is a statue of the Saint to which the temple is dedicated. In the middle of the stated square there is a nice fountain. Sitting or walking around in that square is very relaxing.\nThe church is in baroque style. It’s a typical Counter-reformation church with one sole nave and side altars interconnected by narrow corridors on each side, which may somehow give the impression that it’s a three-aisle church. The temple is part of a monastery constructed around a cloister. The atmosphere inside the church is very peaceful and profound and it calls forth devotion. There are several baroque and neoclassical altars among which those of St. Philippe Neri, St. Raymond of Penyafort (by Ignasi Vergara), the Adoration of the Three Wise Men (by Salvador Gurri) and the Nativity (by Ramon Amadeu) are outstanding.The sculptural group behind the high altar in the apse with the crucifixion in the center is spectacular. In the middle of the transept there is a dome and on each side thereof there is a large painting depicting some scenes of the Saint’s life. They are the work of the painter Joan Llimona who reproduced on them the face of the famous architect Gaudí as that of the Saint. \nIt’s worth visiting that temple and learning about its history is of course an interesting activity. Sometimes concerts of baroque music are held in the church in question. Owing to the fantastic acoustics in the church itself it’s possible to enjoy a unique moment listening to excellent music.", "publishedDate": "2017-05-17", "language": "en", "rating": 4}, {"id": 380420290, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d6499629-r380420290-Church_of_San_Felipe_Neri-Barcelona_Catalonia.html", "text": "The Church of Sant Felip Nerti is in a beautiful square with shady trees and tranquility. However, the church is perhaps most known for its tragic history. During the Spanish Civil War, 20 children and their guardians were killed while seeking shelter inside the church, when it was hit by a bomb. Deep pit marks from the shrapnel still scar the exterior of the church. The actual church is in the baroque style and was built on the grounds of a medieval cemetery in 1752. The church is deep in the winding roads of the Gothic Quarter. I would recommend that you locate the Plaza de Sant Jaume on Carrer de Ferran. From the plaza, look for the beautiful gothic bridge between two buildings off of the plaza. This is Carrer Bisbe. Walk down Carrer Bisbe and take the first street to your left. This is Carrer de Sant Sever. Walk along this street until you reach a street to your right, Carrer de Sant Felip Nerti. You will see the opening of the church square.", "publishedDate": "2016-06-06", "language": "en", "rating": 4}]}}]