[{"locationId": 8736807, "name": "Parc Diagonal Mar", "placeType": "ATTRACTION", "reviewListPage": {"reviews": [{"id": 704211084, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d8736807-r704211084-Parc_Diagonal_Mar-Barcelona_Catalonia.html", "text": "The parc is ok for a little wander around, but if you have kids the slides are great. There are about 4/5 built into a hill and are various shapes/inclines. Take either spare clothes or wetwipes, because the kids can get really dusty/dirty on the slides - but they have loads of fun.", "publishedDate": "2019-08-29", "language": "en", "rating": 4}, {"id": 689298794, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d8736807-r689298794-Parc_Diagonal_Mar-Barcelona_Catalonia.html", "text": "Parc Diagonal Mar is a large and quite interesting park, just opposite the Diagonal Mar Shopping centre. There's lots of green space and some stunning Catalan Modernist inspired sculptures. The whole park is quite scenic with many paved walkways, a bridge and large pond. I actually quite jealous of the owners of the flats which overlook the park.\n\nAn interesting diversion if staying in the area or the beach, but otherwise wouldn't go out of the way.", "publishedDate": "2019-07-13", "language": "en", "rating": 5}, {"id": 668682108, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d8736807-r668682108-Parc_Diagonal_Mar-Barcelona_Catalonia.html", "text": "It is a beautiful and interesting park with an eclectic mix of restaurants from Tapas to Five Guys and if you’re really desperate Mickey D’s. Kind of cool but all in all is still just a park and shopping mall.", "publishedDate": "2019-04-23", "language": "en", "rating": 3}, {"id": 603971280, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d8736807-r603971280-Parc_Diagonal_Mar-Barcelona_Catalonia.html", "text": "Amazing what a designer / architect can do to make a park interesting. Lots of steel structures some very clever all over the park but it is a steel sculpture largely. No idea how to describe this place - look at pictures and make up your own mind. I think its really good but think it will date. Needs to be maintained well and thats always a worry. Walk round for an hour and smile.", "publishedDate": "2018-08-07", "language": "en", "rating": 4}, {"id": 602719953, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d8736807-r602719953-Parc_Diagonal_Mar-Barcelona_Catalonia.html", "text": "Each time i visit, the park has improved.  A few years ago it was still a bit quiet sometimes and as a relatively new park the plants and tress had not grown enough yet.  But it’s better now and certainly quirky.  Great place for a picknick on the little hill as well and the slides for kids are good.  Would still need a bar or coffee shop but i guess it is difficult to compete with the shopping mall next to it.", "publishedDate": "2018-08-04", "language": "en", "rating": 4}, {"id": 575780682, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d8736807-r575780682-Parc_Diagonal_Mar-Barcelona_Catalonia.html", "text": "Interesting concept with unusual designs. Very clean and peaceful park for children and adults alike.", "publishedDate": "2018-04-26", "language": "en", "rating": 4}, {"id": 573536446, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d8736807-r573536446-Parc_Diagonal_Mar-Barcelona_Catalonia.html", "text": "The most remarkable of this park is for me the big sized slides for kids. They are quite fun, and will keep the kids entertained for a while (but bring some carton/cardboard for better sliding).\n\nIf you have no kids, the park also is very adult-friendly, being nice to walk around and relax. There's almost no people, and the sculptures and the design is interesting to watch. ", "publishedDate": "2018-04-15", "language": "en", "rating": 4}, {"id": 565395640, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d8736807-r565395640-Parc_Diagonal_Mar-Barcelona_Catalonia.html", "text": "Loved their pasta and nice ambient!\nStaff was very nice, service fast, and I'll definitely come here again.", "publishedDate": "2018-03-08", "language": "en", "rating": 5}, {"id": 559629582, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d8736807-r559629582-Parc_Diagonal_Mar-Barcelona_Catalonia.html", "text": "This is the second largest park in Barcelona. \n\nEspecially interesting are the park lampposts. They were designed by the architect Enric Miralles in 2002 and are an excellent example of respectful lighting with biodiversity (there are 3 species of nocturnal birds feeding on insects that get trapped in their original design).\n\nHowever, it is a pity that there is so much incivility in it (many dog owners are breaking the rule of carrying them tied). We hope that the City Council acts to redress this situation.\n\nDuring the year the lake is a strategic place for birds to pass (a team of ornithologists has already counted more than 150 species of birds)\n\nDefinitely it is one of the most recommended parks to visit in the city.", "publishedDate": "2018-02-10", "language": "en", "rating": 5}, {"id": 534775286, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d8736807-r534775286-Parc_Diagonal_Mar-Barcelona_Catalonia.html", "text": "if you wanna see something different in Barcelona, something modern, something sophicticated. Recommended this place.", "publishedDate": "2017-10-21", "language": "en", "rating": 4}, {"id": 481902183, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d8736807-r481902183-Parc_Diagonal_Mar-Barcelona_Catalonia.html", "text": "Nice very quiet park at the end of Avinguda Diagonal, near the sea. The park is clean and extremely well maintained.", "publishedDate": "2017-05-05", "language": "en", "rating": 4}, {"id": 468750892, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d8736807-r468750892-Parc_Diagonal_Mar-Barcelona_Catalonia.html", "text": "We walked through this beautifully designed  park, full of modern art and stylish structures. There is a large children’s play area, a raised walkway over water, the lake with sculptures which sprayed out water and the curved tubular structures. It was a breathtaking sight!\n\nWe could not help ourselves but to lie down under the shade and enjoy watching palm trees swaying in the warm breeze.", "publishedDate": "2017-03-20", "language": "en", "rating": 5}, {"id": 427020013, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d8736807-r427020013-Parc_Diagonal_Mar-Barcelona_Catalonia.html", "text": "Like much of Barcelona that I've seen, this park is very well maintained by the local authority, creating a delightful open space to rest a while.\nWith no real interest in sculpture or flora, I cannot make any comment on the quality fo what is here, but to say that the plantlife all seems to be thriving, and that the sculptures offer some interest to passing observation.\nWhat I have found is a certain tranquility here - seating is plentiful, there are open and shaded areas, and enough water around to ease the heat of the midday.\nPerfect for a quiet stroll, or a more quiet hours reading.", "publishedDate": "2016-10-11", "language": "en", "rating": 5}, {"id": 426324942, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d8736807-r426324942-Parc_Diagonal_Mar-Barcelona_Catalonia.html", "text": "It is the second largest park in Barcelona, a sunny, airy and absolutely accessible space, where water from a large lake shares the limelight with hills covered with grass and lush vegetation.\nIts design favors mixing with the city through a large, open space and connects to the sea.\nThe park is arranged following a series of roads that, like a tree, branch out in all directions. Everywhere, extremely long concrete benches separated and sorted spaces evoking the sea waves.\nThere are many nature photographers who go to this park to capture unusual images of birds.\nA fully recommended visit!", "publishedDate": "2016-10-09", "language": "en", "rating": 5}, {"id": 407460132, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d8736807-r407460132-Parc_Diagonal_Mar-Barcelona_Catalonia.html", "text": "This park is directly across from the Diagonal Mar mall and is pretty quiet. Very nice to take a stroll in and relax for awhile. ", "publishedDate": "2016-08-19", "language": "en", "rating": 4}, {"id": 364434600, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d8736807-r364434600-Parc_Diagonal_Mar-Barcelona_Catalonia.html", "text": "The park was situated fairly close to our Hotel in the Diagonal Mar area. Its a beautiful place suitable for people of all ages .\n\nThe park is situated in the relatively new area of Barcelona, and that could be the reason for it not being very crowded at most times...\n\nGreat place for a stroll..", "publishedDate": "2016-04-15", "language": "en", "rating": 4}, {"id": 340011978, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d8736807-r340011978-Parc_Diagonal_Mar-Barcelona_Catalonia.html", "text": "As I am a regular guest of a hotel in this part of the city, this is one of my usual destination for taking a walk. The park is relatively new; I remember its construction about fifteen years ago. I suppose that the whole area is still in construction and not fully inhabited and that is the reason why the park itself still feels somehow empty and deserted with not many visitors. Or maybe this is just my feeling…", "publishedDate": "2016-01-14", "language": "en", "rating": 4}, {"id": 338101243, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d8736807-r338101243-Parc_Diagonal_Mar-Barcelona_Catalonia.html", "text": "Not sure who the park is targeted at as it's not exactly equipped well for children... Or skateboarders or any other sort of sport and it wouldn't suit walkers of many dogs as it's so small. However it is unusual in design and interesting to take a walk through and contemplate 'what made them do that?' whilst looking at the various structures.", "publishedDate": "2016-01-07", "language": "en", "rating": 3}]}}]