[{"locationId": 1747997, "name": "Trenhotel Salvador Dali", "placeType": "ATTRACTION", "reviewListPage": {"reviews": [{"id": 471086491, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d1747997-r471086491-Trenhotel_Salvador_Dali-Barcelona_Catalonia.html", "text": "We traveled once from Madrid to Lisbon and that was the best train ride I have ever had and I will explain why: I can never sleep in trains and here I slept soundly the whole night and woke up very refreshed and energetic! \nThe cabin was for just two people, a little tight, but quite enough room. We had a small sink, towels and two toiletries bags, given to us as gifts! The journey was very comfortable, we would do that again and highly recommend it!", "publishedDate": "2017-03-29", "language": "en", "rating": 4}, {"id": 436715572, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d1747997-r436715572-Trenhotel_Salvador_Dali-Barcelona_Catalonia.html", "text": "Traveled from Madrid, Spain to Lisbon, Portugal overnight. \nTight/narrow cabin for 2 passengers. No toilet in room. Used in the hallway instead. Nice ride. Good experience trip. ", "publishedDate": "2016-11-12", "language": "en", "rating": 4}, {"id": 311231429, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d1747997-r311231429-Trenhotel_Salvador_Dali-Barcelona_Catalonia.html", "text": "We travelled from Madrid to Lisbon and back on this train - it has to have been one of the worst trips I've been on. The train left at 10PM, and had bright lights on in the cabin till midnight, at which point the conductor checked our tickets. We slept till 1:30PM, at which time members of the police force boarded the train to check for drugs, which is absolutely acceptable except that they spoke on the microphone very loudly, once again waking everyone up. Later on, at around 6AM, the conductor from the other country at the end of the trip asks to check your ticket, waking you up once again. It's almost as though Renfe forbids travellers in tourist class from sleeping!\n\nWould I travel again using this demonic train? Surely not. You're far better off flying between Madrid and Lisbon, even if it means paying double what you'd pay for this.", "publishedDate": "2015-09-17", "language": "en", "rating": 1}, {"id": 308437992, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d1747997-r308437992-Trenhotel_Salvador_Dali-Barcelona_Catalonia.html", "text": "We traveled twice in the Trenhotel, Madrid-Lisbon and back. Our journey was quite comfortable and we would recommend the same.\nThe Good Part: The timings are quite convenient for tourists since the travel is overnight. The beds were decent though the compartments were a little smaller than we would have expected. They were clean enough and guess good value for money overall\nThe Okay Part: Guess there were very few washrooms and once not clean enough. As mentioned above, the space is little constrained inside.\nTo summarise, a good value for money option for the journey from Madrid-Lisbon or back,", "publishedDate": "2015-09-09", "language": "en", "rating": 4}, {"id": 284644869, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d1747997-r284644869-Trenhotel_Salvador_Dali-Barcelona_Catalonia.html", "text": "We travelled on trenhotel twice in the same trip, one from Barcelona to Granada, the other one from Madrid to Lisbon. Chosen the C class for the first one and G class the next one. We thought there is difference between the 2 classes as price level is different, and from the Renfe website and other travellers'  comments on the web, we had an impression that there is dinner provided and TV in the compartment for the G class, hence we chose a next level up when we travelled to Lisbon wanting to experience dinning on a train...in the end, it was disappointed. Actually the two classes are the same. No meal, no TV, both with private shower and toilet, same compartment size (not even an inch bigger...), similar toilet bag. There is no need to pay more for same service if we know that. We don't think the staff on train are nice nor helpful neither. Overall our experience towards Trenhotel is very so so, not to mention the Renfe website is not user friendly at all, especially for someone like us who can't understand Spanish.", "publishedDate": "2015-07-01", "language": "en", "rating": 4}, {"id": 216543924, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d1747997-r216543924-Trenhotel_Salvador_Dali-Barcelona_Catalonia.html", "text": "We travelled on the JOAN MIRO TRENHOTEL from Barcelona to Paris September 2013 and thoroughly enjoyed the experience. We booked 2 First Class cabins as we were travelling with our boys aged 10 & 12. We opted for the early dinner sitting so we could see the countryside as we ate our 3 course meal, which is included in the ticket price. For us as a family it was our first time on an overnight train and we enjoyed the experience. The cabins, small as you would expect, had all that you needed and we all managed to get a good nights sleep. It was terrific to leave and arrive at the centre of two major cities, saving taxi rides to the airport, long check in lines, even longer security checks and then another taxi ride at the other end. With a shower, breakfast we hit the ground running in Paris the next morning. We would definitely do this again.", "publishedDate": "2014-07-21", "language": "en", "rating": 5}, {"id": 199638456, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d1747997-r199638456-Trenhotel_Salvador_Dali-Barcelona_Catalonia.html", "text": "Went with a group of four from Madrid to Lisbon. We booked a 4-bed compartment. It was a nightmare as the heating could not be switched off and the room was boiling hot all night long. We could hardly get asleep. The train journey is not smooth too. I didn't expect the oscillations could be that bad, mush worse than the sleeper trains in UK. A very dangerous scene was one of the train doors was left open for ventilation.", "publishedDate": "2014-04-02", "language": "en", "rating": 3}, {"id": 181424030, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d1747997-r181424030-Trenhotel_Salvador_Dali-Barcelona_Catalonia.html", "text": "We viewed our overnight ride from Barcelona to Granada as an adventure.  We fly everywhere but the times of the fights were too early in the morning to enjoy the full day ahead or then too late in the early afternoon to enjoy our time in Granada.  So a suggestion was made to us to try the Trenhotel.  Traveling with 3  New York  super sized 30” rolling duffels for our 2 week trip was the kiss of death for traveling on trains in Spain.  We learned to be first on the line to board all trains to secure a spot on the luggage racks as we boarded  other trains in Spain.  But securing a spot for our bags in our overnight Grand Classe room for 2 proved to be a bit more challenging. As others have said, the train itself is rather sparce and dated looking. We found the hi speed Ave trains between Seville and Madrid much more modern.     \n\nWhen I got on the train I was clearly upset with the space- but I knew that this would be the size of our compartment prior to booking.. We did not know what where our 3 large pieces of luggage would fit.  So we used the shower area to shove in 2 of the duffles with still no where to put the 3rd piece of luggage. Only normal sized carry on 20 inch pieces of luggage fit overhead in the compartment and out of the way. When the train guy came in the room he told us not to worry and that he would find a place when he made up the beds for us.  Well he could not, and just left the piece standing up it’s side in the corner of the room next to the bathroom door.  Between that and the ladder there was not much room to move. But aren’t we supposed to just go to sleep after dinner? \n\nDinner was really quite decent.  I had a pasta dish and my husband had rack of lamb. There were only 4 or 5 other tables taken in the dining car for both dinner and breakfast next morning.   So for us, there was no need to run to secure our table reservations.\n \nI was led to l believe that there was some sort of videos and movies in our compartment but that was not the case- maybe we were on an older train.  That's when the iPad became my best friend. We had rented a WiFi hotspot for the week so we had internet throughout the trip.  \nAfter dinner we had nothing to do so we were lucky enough to fall asleep for the night as it was after 11 pm by then. The bathroom was roomier than an airline bathroom as it had a shower, sink and toilet- all immaculate. The beds were quite comfortable and roomy.  The amenities kit on the train was actually quite extensive. I did leave it on board, but it could probably  be considered  award winning for a train ride.  The conductor person had to wake us up at 8:10 am for breakfast as we were still in a dead sleep! \n\nHaving never travelled on an overnight train I must say that it was quite nice getting into town at 9:15 am with the day ahead of us with only a 10 minute ride into town My friend reminds me that her bathroom on Amtrak in her private cabin for her 23 hour ride to Florida last week was a potty seat next to where she sat.......Flying business class on a plane is certainly more comfortable; but there is something to be said for not dealing with the hassle of the airport. Overall, a fine experience if you don’t have NY sized luggage! Had we not had the shower area, in which to shove our suitcases, we would have had a major problem.  Would I do it again?  I would say a 60/40 chance!", "publishedDate": "2013-10-17", "language": "en", "rating": 4}, {"id": 168631326, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d1747997-r168631326-Trenhotel_Salvador_Dali-Barcelona_Catalonia.html", "text": "We had the reclining seats on the Trenhotel Joan Miro to Paris. By and large, it was a good experience: the seats were as comfortable as I expected them to be—not a great bed but a good chair—and the service was very good. Most of my complaints are minor or not the fault of the Trenhotel, the primary one being that we bought a France-Spain pass and made our reservations for the trip online through RailEurope and this was the only leg of 6 that was wrong: my wife and I were placed in single chairs at opposite ends of the car. The conductor muddled through my poor attempt to explain the problem in Spanish and helped us get single seats across from one another (the paired seats were, of course, all taken) so that we could at least talk during the trip. \n\nIf we have the chance to do it again, I hope we can afford the extra money for a compartment: it would have been nice to have been better rested—and showered—the next morning in Paris (there was a shower for 6 euros at Gare d'Austerlitz that we opted to skip... I probably would not do that again in July!). But even the reclining seats are a good, inexpensive way to get from Barcelona to Paris—with our pass, the reservation was only $75 each, which is much cheaper than airfare and a hotel bill!", "publishedDate": "2013-07-22", "language": "en", "rating": 4}, {"id": 136876145, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d1747997-r136876145-Trenhotel_Salvador_Dali-Barcelona_Catalonia.html", "text": "Our journey from Milan to Barcelona was an outstanding travel experience, and one marvels at the design of the compartment where so much facility is found in so little space. The evening meal was very good, and while not gourmet, as suggested, was freshly prepared by a skilled and competent chef. It was easy to have a good night’s sleep, and a tasty breakfast set the day up perfectly. We were wonderfully looked after in the dining car by a most friendly and efficient lady who is a credit to the entire operation.", "publishedDate": "2012-08-11", "language": "en", "rating": 5}, {"id": 133277862, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d1747997-r133277862-Trenhotel_Salvador_Dali-Barcelona_Catalonia.html", "text": "THIS REVIEW IS FOR THE PARIS - BARCELONA TRAIN\nGrand Class means a cabin ( 1 or 2 people) with private shower, wc and wash basin. The train is air conditioned.\nYour ticket price includes a three course dinner plus coffee, and drinks. (aperitif, wine, brandy etc). It also includes breakfast. Grand Class passengers are given priority for tables. For dinner go in on boarding. \nBreakfast delivered at Spanish speed.\nTell the attendant when you want the bed made up - usually done while dinning, and in the morning tell them on your way to breakfast and it will be reverted to day format.\n\nI have travelled and worked on overnight trains around Europe. This is in the top six.\n\nBook online at the {SNCF} RailEurope site - they also have offices in major cities.", "publishedDate": "2012-07-02", "language": "en", "rating": 4}, {"id": 131620396, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d1747997-r131620396-Trenhotel_Salvador_Dali-Barcelona_Catalonia.html", "text": "This review is also for the Trenhotel Joan Miro from Barcelona to Paris for the \"Preferente\" class (private 2 person cabin - washbasin/no bath & toilet).  As everyone already knows, the Renfe site is a nightmare.  After numerous calls with our bank (it doesn't accept AMEX), we were unable to book the tickets on-line at all, and went directly to the station (Estacio de Franca) three days before our departure to purchase the tickets. Most folks prefer to go through the website because of the \"offerta duo\" discount offered on it, but please be rest assured that the discount can be also be made at the station (there was a 10 Euro fee).  Just ask.\n\nThe cabins are small yes, but comfortable.  The train speed and time (its a night train afterall) doesn't allow for gazing at the country side.  The service is pretty horrible - we called the attendant numerous times to pull our seats down into beds and after listening to the beeper at the attendant switchboard go-off incessantly for 20 minutes, decided to jimmy the seats ourselves with some butter knives borrowed from the kitchen.  \n\nThe train itself is not pretty.  I've ridden my fair share of 10 hr+ train rides in Europe and South America - and all have been pretty darn pleasant, if not a joy to ride.  The Trenhotel is cramped, mechanically spartan and compounded with the rough service and time of day, you'll just want to hit the sack, wake up and arrive at your next destination.\n\nThat said, I feel its a much nicer alternative than flying and I would take it again in a heartbeat given the present options.  Traveling such a distance overnight is cost effective - you're basically paying for a hotel + transportation, and that makes it a great value.   The convenience of not having to lug your luggage via metro/taxi from the apt/hotel to the airport, check-in, go through security, etc is also immeasurable.  So yes, while I recommend the Trenhotel, I would also keep my expectation low.", "publishedDate": "2012-06-09", "language": "en", "rating": 4}, {"id": 67371216, "absoluteUrl": "https://www.tripadvisor.com/ShowUserReviews-g187497-d1747997-r67371216-Trenhotel_Salvador_Dali-Barcelona_Catalonia.html", "text": "This review is the Trenhotel Joan Miró (the Trenhotel Salvador Dali goes to Milan but there is no separate listing for the Joan Miró).\n\nWe took the Grand Class, starting in Paris Austerlitz having travelled by Eurostar from London.    When you board you are given tickets for the inclusive dinner and breakfast which you will need to present to the waiter before you eat.\n\nIt is important to go straight to the dining car after leaving your cases in your room as the best seats will get occupied very soon!      We made the mistake of waiting and had to share one of the larger tables, but not too bad as the other 2 diners were very freindly.\n\nThe good thing about Grand Class is that everything is included starting with a glass of champagne, a 70cl bottle of wine (shared between 2), coffee and a large brandy.    There are 3 courses with a main menu and a \"special\" menu featuring a regional dish.   They have menus in both spanish and english so ask for the english menu if not so good at spanish!    We had octopus a fiero starter, veal main and almond cake desert which was on the special menu and very tasty.\n\nThe room was quite small as you would expect, but had shower and toilet.   The shower will switch off after 30 seconds, so remember to keep pressing the button every 20 seconds.    They give you free shampoo etc for the shower.     The return train only had a shaver socket and no separate mains socket and my european power adapter for my mobile phone was loose in this socket and fell out, so best to bring some tape to keep it from falling out!\n\nThere were quite a lot of annoying rattles in the cabin, but they do supply earplugs.    I found the cabin a bit hot but not too bad, but I'd ask for an extra pillow as the pillows are very thin.\n\nThe breakfast gets served 1 hour before arrival and has coffee, toast, croissants, pastries, fruit juice and fruit.    I would have also liked some bacon, egg etc but this did not seem to be offered - prehaps it was as special request but I saw no one else having it.\n\nFinally once you have folded your bed away in the morning make sure that there is nothing left on the bed as it cannot be put down again without a special key that the staff have.", "publishedDate": "2010-06-13", "language": "en", "rating": 4}]}}]